[
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_11172017.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     9:00 am: RBI Deputy Governor Viral Acharya  SBI Chairman Rajnish Kumar  Kotak Mahindra Bank MD Uday Kotak  SBI Deputy MD Anshula Kant  SBI Group Chief Economic Advisor Soumya Kanti Ghosh and other ba",
        "date": "11172017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Morning News Call - India  November 17 "
    },
    {
        "content": "* Verizon is also in early stages of exploring acquiring parts of 21st Century Fox - CNBC  citing DJ Further company coverage:",
        "date": "11162017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Verizon also in early stages of exploring acquiring parts of 21st Century Fox - CNBC "
    },
    {
        "content": "Nov 16 Comcast Corp has approached Twenty-First Century Fox Inc and expressed interest in buying some major assets  CNBC reported on Thursday  citing sources.",
        "date": "11162017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "REFILE-Comcast approaches Twenty-First Century Fox for buying some assets - CNBC "
    },
    {
        "content": "* Comcast has approached 21st Century Fox to express acquisition interest- CNBC  citing DJ‍​",
        "date": "11162017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-Comcast has approached Twenty-First Century Fox to express acquisition interest- CNBC  citing DJ‍​ "
    },
    {
        "content": "Zimbabwean President Mugabe insists he stays on as the country’s ruler  Lebanon’s Saad al-Hariri is expected to fly to France and a portrait of Christ breaks the world record for the highest artwork sale at auction.",
        "date": "11162017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Thursday Morning Briefing "
    },
    {
        "content": "LOS ANGELES/NEW YORK A shareholder proposal calling for Twenty-First Century Fox Inc to scrap its dual-class share structure was rejected on Wednesday  although the measure received significant support among voters outside the controlling Murdoch family.",
        "date": "11162017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Narrow win for Fox shows restlessness with dual-class shares "
    },
    {
        "content": "Nov 9 Wall Street Journal owner News Corp reported a quarterly profit on Thursday  compared with a year-ago loss  driven by a tight control on expenses amid a decline in print advertising sales.",
        "date": "11092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp posts 1st-qtr profit on lower expenses "
    },
    {
        "content": " (This version of November 9th story corrects to say expenses fell to $1.15 billion  not $1.14 billion  in paragraph 6  and total revenue rose 4.7 percent  not 4.5 percent  in paragraph 10)",
        "date": "11102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp profit beats on digital real estate unit strength "
    },
    {
        "content": "Nov 9 Walt Disney Co reported a 2.8 percent drop in quarterly revenue on Thursday  weighed down by the lack of any major box office releases  sending the company's shares down about 3 percent in extended trading.",
        "date": "11092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Disney reports 2.8 percent fall in quarterly revenue "
    },
    {
        "content": "Nov 9 Wall Street Journal owner News Corp reported a better-than-expected quarterly profit on Thursday  driven by a tight control on expenses and growth in revenue across all its businesses.",
        "date": "11102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "CORRECTED-UPDATE 2-News Corp profit beats on digital real estate unit strength "
    },
    {
        "content": "Nov 10 Walt Disney's shares rose 3 percent on Friday  as Wall Street shrugged off poor financial results and focused instead on the media giant's commitment to build a service that will compete aggressively with video streaming pioneer Netflix.",
        "date": "11102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Disney shares rise as focus turns to streaming commitment "
    },
    {
        "content": "* Indexes down: Dow 0.19 pct  S&P 0.24 pct  Nasdaq 0.22 pct (Adds details  changes comment  updates prices)",
        "date": "11102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "US STOCKS-Wall St falls on tax bill worries; media stocks climb "
    },
    {
        "content": "The force of \"Star Wars\" lifted Walt Disney Co  shares on Thursday as the promise of a new film trilogy overshadowed disappointing quarterly results and struggles at the media company's television business. | Video ",
        "date": "11102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "New 'Star Wars' trilogy raises hopes after Disney results miss target "
    },
    {
        "content": "Nov 6 Twenty-First Century Fox has held talks to sell most of the company to Walt Disney Co  CNBC reported on Monday  citing people familiar with the matter.",
        "date": "11062017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Fox held talks to sell most of company to Disney - CNBC "
    },
    {
        "content": "* Twenty-First Century Fox Inc - ‍reported total quarterly revenues of $7.00 billion  a $496 million  or 8%  increase from last year​",
        "date": "11082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox Q1 adj shr from cont ops attributable to co's stockholders was $0.49 "
    },
    {
        "content": "LONDON  Nov 7 Veteran hedge fund manager Crispin Odey now opposes Twenty-First Century Fox’s 11.7 billion pound ($15.4 billion) bid to take control of British pay-TV broadcaster Sky in a move that could raise further doubts about the deal.",
        "date": "11072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Sky investor Crispin Odey says he now opposes Fox takeover "
    },
    {
        "content": "Nov 9 The force of \"Star Wars\" lifted Walt Disney Co shares on Thursday as the promise of a new film trilogy overshadowed disappointing quarterly results and struggles at the media company's television business.",
        "date": "11102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 4-New 'Star Wars' trilogy raises hopes after Disney results miss target "
    },
    {
        "content": "* 21st Ccentury Fox has been holding talks to sell most of the company to Disney- CNBC  citing sources Source text : http://cnb.cx/2izdPoq",
        "date": "11062017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-21St Century Fox holding talks to sell most of company to Disney- CNBC "
    },
    {
        "content": "Twenty-First Century Fox Inc's  quarterly revenue topped market estimates on Wednesday as higher sales from traditional and online distributors boosted its cable business.",
        "date": "11082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox's quarterly revenue beats Street "
    },
    {
        "content": "Nov 8 Twenty-First Century Fox Inc's quarterly revenue topped market estimates on Wednesday as higher sales from traditional and online distributors boosted its cable business.",
        "date": "11082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-Twenty-First Century Fox's quarterly revenue beats Street "
    },
    {
        "content": "* Fox bid for Sky undergoing regulatory review (Writes through with comments from investor Odey)",
        "date": "11072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Sky investor Odey opposes Fox bid as Disney talks fuel uncertainty "
    },
    {
        "content": "Nov 8 Rupert Murdoch's Twenty-First Century Fox Inc reported a 7.6 percent rise first-quarter revenue on Wednesday  as higher advertising sales boosted its cable business.",
        "date": "11082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox's first-quarter revenue rises "
    },
    {
        "content": "Democrats score a victory in Virginia  Trump arrives in China to seek help reigning in North Korea and FBI agents raid the headquarters of a major U.S. body broker.",
        "date": "11082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Wednesday Morning Briefing "
    },
    {
        "content": "BOSTON Proxy adviser Institutional Shareholder Services on Monday recommended investors vote against the re-election to the board of five Twenty-First Century Fox Inc directors  mainly citing concerns over a lack of action on executive pay.",
        "date": "10312017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Proxy adviser ISS sides against five Twenty-First Century Fox directors "
    },
    {
        "content": "BOSTON  Oct 30 Proxy adviser Institutional Shareholder Services on Monday recommended investors vote against the re-election to the board of five Twenty-First Century Fox Inc directors  mainly citing concerns over a lack of action on executive pay.",
        "date": "10302017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Proxy adviser ISS sides against five Twenty-First Century Fox directors "
    },
    {
        "content": "Nov 8 Britain's FTSE 100 index is seen opening down 7 points at 7 505.8 on Wednesday  according to financial bookmakers  with futures down 0.1 percent ahead of the cash market open.",
        "date": "11082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Nov 8 "
    },
    {
        "content": "LONDON  Nov 7 A report that Rupert Murdoch held talks about selling film and television assets to Walt Disney Co added another layer of uncertainty to his $14.5 billion bid to buy all of Britain's Sky.",
        "date": "11072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Sky falls as report of Disney-Fox talks increase deal uncertainty "
    },
    {
        "content": "    Nov 8 Britain's FTSE 100 index is seen opening down 7 points at 7 505.8 on Wednesday  according to financial bookmakers.          * ROLLS-ROYCE: The U.S. Justice Department unsealed charges on Tuesday against five individuals for their alleged role in a scheme to pay bribes to foreign government officials to benefit Rolls-Royce Holdings Plc and help secure a contract to provide services for a major gas pipeline from Central Asia to China.     * SKY: British broadcaster Sky has sa",
        "date": "11082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UK Stocks-Factors to watch on Nov 8 "
    },
    {
        "content": "Oct 25 James Murdoch  chief executive of Twenty-First Century Fox Inc  said on Wednesday he expects its bid to acquire Sky PLC to be approved by British regulators in the first half of 2018 despite fallout from a sexual harassment settlement involving former Fox News commentator Bill O'Reilly.",
        "date": "10252017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox CEO James Murdoch expects Sky deal to be approved next year "
    },
    {
        "content": "Nov 7 Britain's FTSE 100 index is seen opening up 14 points on Tuesday  according to financial bookmakers  with futures up 0.14 percent ahead of the cash market open.",
        "date": "11072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Nov 7 "
    },
    {
        "content": "Nov 8 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "PRESS DIGEST- British Business - Nov 8 "
    },
    {
        "content": "    Nov 7 Britain's FTSE 100 index is seen opening up 14 points on Tuesday  according to financial bookmakers.           * BARCLAYS: Barclays Plc has failed to persuade a U.S. appeals court to unwind a class action lawsuit accusing the British bank of defrauding shareholders about its private \"dark pool\" trading platforms.      * FOX/SKY: Walt Disney Co discussed buying Rupert Murdoch's Twenty-First Century Fox's international assets such as pay TV provider Sky Plc  CNBC said. Fox ha",
        "date": "11072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UK Stocks-Factors to watch on Nov 7 "
    },
    {
        "content": "LOS ANGELES If Walt Disney Co  buys some Twenty-First Century Fox  businesses  it could provide a quick path for the traditional media giant to create a substantial competitor to Netflix Inc  in the battle for TV and movie viewers.",
        "date": "11082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox in the Mouse House could give Disney an edge in streaming wars "
    },
    {
        "content": "Nov 7 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "PRESS DIGEST- Wall Street Journal - Nov 7 "
    },
    {
        "content": "Nov 7 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "PRESS DIGEST- Financial Times - Nov 7 "
    },
    {
        "content": "    Oct 13 Britain's FTSE 100 index is seen opening 11 points lower at 7 545 on Friday  according to financial bookmakers.          * HSBC: Citigroup Inc  Deutsche Bank AG and HSBC Holdings Plc have agreed to pay a combined $132 million to settle a U.S. class action brought by futures traders accusing them of manipulating the Libor benchmark interest rate  according to a U.S. court filing on Wednesday.      * STANDARD CHARTERED: The chairman of British bank Standard Chartered  called",
        "date": "10132017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UK Stocks-Factors to watch on Oct 13 "
    },
    {
        "content": "LONDON James Murdoch was re-elected as Sky  chairman by a slim majority of independent shareholders on Thursday  despite questions being raised about whether he can be neutral due to his role as chief executive at bidder Twenty-First Century Fox.",
        "date": "10122017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "In shadow of Fox bid  James Murdoch re-elected Sky chairman "
    },
    {
        "content": "Oct 13 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "10132017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "PRESS DIGEST- New York Times business news - Oct 13 "
    },
    {
        "content": "* Independent director says \"pretty confident\" about deal review (Add AGM quotes  results of shareholder vote)",
        "date": "10122017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-In shadow of Fox bid  James Murdoch re-elected Sky chairman "
    },
    {
        "content": "LONDON  Oct 12 A majority of independent votes cast at the annual shareholders' meeting of Sky on Thursday supported the re-election of James Murdoch as chairman  a spokesman for the European pay TV group said.",
        "date": "10122017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "James Murdoch wins backing of Sky shareholders to stay as chairman "
    },
    {
        "content": "LONDON  Oct 12 Sky  the European pay TV group that Rupert Murdoch is trying to buy  said it made a strong start to its new year  with like-for-like revenue up 5 percent and 160 000 new customers  up 51 percent from the same period a year ago.",
        "date": "10122017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Sky makes good start to the year  Q1 revenue up 5 pct "
    },
    {
        "content": "* News Corp says ‍​executive chairman Rupert Murdoch's 2017 total compensation was $5.7 million versus $5.3 million in 2016 - SEC filing",
        "date": "10032017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-News Corp: Executive chairman Rupert Murdoch's 2017 compensation was $5.7 mln "
    },
    {
        "content": "LONDON  Sept 29 Activist group Avaaz stepped up its battle to stop Rupert Murdoch buying Sky  launching a legal challenge to the regulator's view that the pay-TV group would still be a \"fit and proper\" owner of a broadcasting licence if the deal goes ahead.",
        "date": "09292017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Murdoch opponent challenges UK regulator over Sky deal "
    },
    {
        "content": "* Twenty-First Century Fox Inc says executive chairman K. Rupert Murdoch's FY 2017 total compensation was $29.3 million versus $34.6 million in fy 2016 - SEC Filing ‍​",
        "date": "09282017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox says executive chairman Rupert Murdoch's FY 2017 total compensation was $29.3 mln - SEC Filing ‍​ "
    },
    {
        "content": "SYDNEY  Sept 12 Rupert Murdoch's Twenty-First Century Fox Inc joined a court challenge on Tuesday against rival U.S. cable network CBS Corp's proposed buyout of struggling Australian television broadcaster Ten Network Holdings Ltd.",
        "date": "09122017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Rupert Murdoch's Fox joins court challenge to CBS' Australian TV buyout "
    },
    {
        "content": "* We are disappointed that the review of sky deal will take another six months - co-chairman  conf call",
        "date": "09132017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox disappointed that the review of Sky deal will take another six months "
    },
    {
        "content": "* ‍LOOK FORWARD TO ENGAGING \"CONSTRUCTIVELY\" WITH CMA AND \"HOPE THAT FINDINGS OF THIS PROCESS WILL BE RESPECTED BY SECRETARY OF STATE\"​",
        "date": "09142017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox says to engage with CMA on Sky deal "
    },
    {
        "content": "SYDNEY  Sept 18 An Australian judge dismissed a challenge by a group involving Rupert Murdoch's Twenty-First Century Fox on Monday against an agreed takeover by CBS Corp of struggling television broadcaster Ten Network Holdings Ltd. (Reporting by Tom Westbrook; Editing by Paul Tait)",
        "date": "09172017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Australia judge dismisses 21st Century Fox challenge of CBS television buyout "
    },
    {
        "content": "Sept 13 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "09132017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "PRESS DIGEST- New York Times business news - Sept 13 "
    },
    {
        "content": "* Executive remains confident deal will go through (Adds detail  quotes)",
        "date": "09142017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 4-Judge Fox bid for Sky on merits not politics -James Murdoch "
    },
    {
        "content": "CAMBRIDGE  England  Sept 14 A decision by the British government to approve Rupert Murdoch's bid for European pay-TV broadcaster Sky would show the country was open to inward investment as it approaches Brexit  his son James said on Thursday.",
        "date": "09142017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Backing Sky deal would show UK open after Brexit-James Murdoch "
    },
    {
        "content": "Sept 13 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "09132017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "PRESS DIGEST - Wall Street Journal - Sept 13 "
    },
    {
        "content": "* ‍NOTES TODAY'S ANNOUNCEMENT BY SECRETARY OF STATE FOR DIGITAL  CULTURE  MEDIA AND ON PROPOSED ACQUISITION OF SKY BY 21ST CENTURY FOX  INC​",
        "date": "09142017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-Sky says notes UK DCMS Secretary of State's announcement "
    },
    {
        "content": "LONDON  Sept 14 Rupert Murdoch's planned $15 billion takeover of European broadcaster Sky will be referred to regulators over concerns about broadcasting standards  Britain's Culture and Media Secretary Karen Bradley said on Thursday.",
        "date": "09142017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UK confirms Murdoch's Sky bid will be examined over broadcasting standards "
    },
    {
        "content": "* Elevated Fox Networks Group Chairman and CEO Peter Rice to President  21st Century Fox‍​",
        "date": "09062017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox says Peter Rice named president of co "
    },
    {
        "content": "LONDON Britain said on Monday it would decide as \"soon as is reasonably practicable\" whether to refer Rupert Murdoch's $15 billion bid to buy pay-TV group Sky  for an in-depth review.",
        "date": "09042017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Britain says to rule on Fox-Sky advice as soon as possible "
    },
    {
        "content": "Aug 22 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08222017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "PRESS DIGEST- British Business - Aug 22 "
    },
    {
        "content": "* News Corp will have 65 per cent shareholding in new company and Telstra will have 35 per cent",
        "date": "08172017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Telstra Corporation says Foxtel  Fox Sports Australia to combine "
    },
    {
        "content": "Aug 10 News Corp reported fourth-quarter revenue that slightly missed Wall Street's average estimate as the owner of the Wall Street Journal was hurt by declining demand for print advertising.",
        "date": "08102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "CORRECTED-UPDATE 1-News Corp revenue misses slightly on weak demand for print advertising "
    },
    {
        "content": "Aug 10 News Corp  the owner of the Wall Street Journal and book publisher HarperCollins  reported a 6.6 percent fall in quarterly revenue hurt by declining demand for print advertising and a strong dollar.",
        "date": "08102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp's quarterly revenue falls 6.6 percent "
    },
    {
        "content": "Aug 8 Britain's department of culture said on Tuesday it had written to media watchdog Ofcom for more information on its views on  Twenty-First Century Fox's bid for Sky Plc.",
        "date": "08082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "CORRECTED-UK government asks watchdog to look into Fox's bid for Sky "
    },
    {
        "content": "* REBNY signs direct feed agreement with Move Inc  operator of realtor.com  New York's fastest growing online real estate website Source text for Eikon: Further company coverage:",
        "date": "08072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-REBNY signs direct feed agreement with Move Inc "
    },
    {
        "content": "Rupert Murdoch-controlled Twenty-First Century Fox Inc's quarterly profit edged past analysts' estimates  but revenue fell just short of expectations  hurt by the lack of box office hits from its movie studio.",
        "date": "08092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox revenue misses  profit tops estimates "
    },
    {
        "content": "Aug 9 Rupert Murdoch-controlled Twenty-First Century Fox Inc's quarterly profit edged past analysts' estimates  but revenue fell just short of expectations  hurt by the lack of box office hits from its movie studio.",
        "date": "08092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-Twenty-First Century Fox revenue misses  profit tops estimates "
    },
    {
        "content": "Aug 9 Rupert Murdoch-controlled Twenty-First Century Fox Inc reported a 1.5 percent rise in quarterly revenue  boosted by its cable business.",
        "date": "08092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox posts 1.5 percent rise in quarterly revenue "
    },
    {
        "content": "LONDON  Aug 9 Hedge fund manager Crispin Odey has said he is considering withdrawing his support for Twenty-First Century Fox's attempt to take over Sky   saying he believes the 11.7 billion pound ($15.20 billion) deal undervalues the British broadcaster.",
        "date": "08092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Sky investor Odey says Fox bid is losing appeal "
    },
    {
        "content": "Britain's department of culture said on Tuesday it had written to media watchdog Ofcom for more information on its views on  Twenty-First Century Fox's  bid for Sky Plc .",
        "date": "08092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UK government asks watchdog to look into Fox's bid for Sky "
    },
    {
        "content": "Aug 9 Britain's FTSE 100 index is seen opening 40 points lower at 7503.2 on Wednesday  according to financial spreadbetters  with futures down 0.48 percent ahead of the cash market open.",
        "date": "08092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Aug 9 "
    },
    {
        "content": "    Aug 9 Britain's FTSE 100 index is seen opening 40 points lower at 7503.2 on Wednesday  according to financial spreadbetters.              * SKY: Sky set to retain live Football League rights in 180 mln stg-a-year deal  the Guardian reported.     * COPPER: LME copper CMCU3 punched the $6 500 mark  the highest since December 2014  before trading last at $6 480. On Tuesday turnover volumes were at typical levels around 21 000 lots  suggesting interest in chasing prices higher may be",
        "date": "08092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UK Stocks-Factors to watch on Aug 9 "
    },
    {
        "content": "LONDON Rupert Murdoch will have to wait a few more weeks to know whether Twenty-First Century Fox's  bid for Sky  will be referred for a lengthy British investigation.",
        "date": "07202017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Murdoch made to wait few more weeks for Britain's Fox-Sky decision "
    },
    {
        "content": "LONDON  July 20 Rupert Murdoch will have to wait a few more weeks to know whether Twenty-First Century Fox's bid for Sky will be referred for a lengthy British investigation.",
        "date": "07202017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Murdoch made to wait few more weeks for Britain's Fox-Sky decision "
    },
    {
        "content": "LONDON  July 20 Britain said on Thursday it still intended to refer Rupert Murdoch's bid to buy pay-TV group Sky for further scrutiny to assess whether it would give the media mogul too much influence.",
        "date": "07202017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Britain still likely to refer Murdoch's Sky deal for further scrutiny "
    },
    {
        "content": "LONDON The British government will update parliament on Thursday on the next steps in Twenty-First Century Fox's bid for European pay-TV group Sky  the opposition Labour Party said on Twitter.",
        "date": "07202017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UK to give update on Fox-Sky merger on Thursday: opposition Labour Party "
    },
    {
        "content": "LONDON  July 20 The British government will update parliament on Thursday on the next steps in Twenty-First Century Fox's bid for European pay-TV group Sky   the opposition Labour Party said on Twitter.",
        "date": "07202017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UK to give update on Fox-Sky merger on Thursday -opposition Labour Party "
    },
    {
        "content": "July 13 Internet television company Roku has hired investment banks to lead an initial public offering that could come later this year as it aims for a valuation of more than $1 billion  sources familiar with the matter said.",
        "date": "07132017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Internet TV company Roku hires banks for 2017 IPO -sources "
    },
    {
        "content": "NEW YORK CBS Corp's  CBS News division said on Thursday it has signed a new editorial and newsgathering partnership with BBC News to share video  editorial content and other resources across the globe.",
        "date": "07132017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "CBS News forms partnership with BBC  replacing Sky "
    },
    {
        "content": "NEW YORK  July 13 CBS Corp's CBS News division said on Thursday it has signed a new editorial and newsgathering partnership with BBC News to share video  editorial content and other resources across the globe.",
        "date": "07132017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-CBS News forms partnership with BBC  replacing Sky "
    },
    {
        "content": "July 6 \"Making Money\" host Charles Payne was suspended from Fox Business Network  a company spokeswoman said on Thursday.",
        "date": "07072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "'Making Money' host Charles Payne suspended from Fox Business Network "
    },
    {
        "content": "Fox Sports fired Jamie Horowitz  its president of national networks  on Monday  according to a memo sent to employees  which provided no reasons for the dismissal but did emphasize the importance of \"professional conduct.\"",
        "date": "07032017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox Sports dismisses president of national networks "
    },
    {
        "content": "SYDNEY Australian newspaper publisher Fairfax Media Ltd said two private equity firms withdrew from rival takeover bids worth up to A$2.9 billion ($2.2 billion)  leaving it to proceed with demerger plans and sending its shares sharply lower.",
        "date": "07032017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Australia's Fairfax ends talks with PE suitors without formal bid "
    },
    {
        "content": "* Fairfax says received no bids from TPG or Hellman & Friedman",
        "date": "07032017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-Australia's Fairfax ends talks with PE suitors without formal bid "
    },
    {
        "content": "* News corp releases ‍statement regarding european commission decision to fine Google for breaching eu antitrust rules​ Source text for Eikon: Further company coverage:",
        "date": "06272017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-News Corp releases ‍statement regarding european commission decision to fine Google for breaching EU antitrust rules​ "
    },
    {
        "content": "LONDON Britain intends to subject Rupert Murdoch's takeover of European pay-TV group Sky  to a lengthy in-depth investigation after finding the $15 billion deal risks giving the media mogul too much power over the news agenda. | Video ",
        "date": "06292017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Britain says Fox bid for Sky risks giving Murdoch too much power "
    },
    {
        "content": "LONDON  June 29 Britain intends to subject Rupert Murdoch's takeover of European pay-TV group Sky to a lengthy in-depth investigation after finding the $15 billion deal risks giving the media mogul too much power over the news agenda.",
        "date": "06292017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 4-Britain says Fox bid for Sky risks giving Murdoch too much power "
    },
    {
        "content": "LONDON Britain intends to refer Rupert Murdoch's takeover of Sky  to a full investigation because the deal raises concerns about the amount of influence the media mogul would wield.",
        "date": "06292017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Text: Britain says Fox bid for Sky gives Murdoch too much power over news "
    },
    {
        "content": "LONDON  June 29 Britain intends to refer Rupert Murdoch's takeover of Sky to a full investigation because the deal raises concerns about the amount of influence the media mogul would wield.",
        "date": "06292017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "TEXT-Britain says Fox bid for Sky gives Murdoch too much power over news "
    },
    {
        "content": "LONDON Rupert Murdoch will find out by June 29 whether he is closer to securing takeover target Sky  after Britain set out a timetable to rule on whether the media mogul is a suitable owner of Europe's biggest broadcaster.",
        "date": "06202017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "UK to give new ruling on Fox-Sky takeover by June 29 "
    },
    {
        "content": "May 22 Fox News was hit with new sexual harassment and discrimination lawsuits on Monday  adding to the catalog of complaints that has rattled the U.S. cable news network and its corporate parent 21st Century Fox Inc.",
        "date": "05222017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Scandal-plagued Fox News hit with more lawsuits in U.S. court "
    },
    {
        "content": "* “Everybody at Fox News is shocked and grieved by the death of Roger Ailes”-21st Century Fox Executive Chair Rupert Murdoch",
        "date": "05182017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-\"Everybody at Fox News is shocked and grieved\" by Ailes' death-Rupert Murdoch "
    },
    {
        "content": "* Fairfax a casualty of the flight to online media (Recasts with second bid  adds shareholder comment  background)",
        "date": "05182017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-Second US buyout firm bids for Australia's Fairfax Media "
    },
    {
        "content": "* Berkshire Hathaway dissolves share stake in Twenty-First Century Fox - SEC filing",
        "date": "05152017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Berkshire Hathaway dissolves share stake in Twenty-First Century Fox "
    },
    {
        "content": "Twenty-First Century Fox Inc   the television and film company controlled by Rupert Murdoch  reported quarterly revenue below Wall Street's expectations on Wednesday  weighed down by weaker box office results.",
        "date": "05112017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox misses Wall Street sales target "
    },
    {
        "content": "May 10 Twenty-First Century Fox Inc  the television and film company controlled by Rupert Murdoch  reported quarterly revenue below Wall Street's expectations on Wednesday  weighed down by weaker box office results.",
        "date": "05112017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 4-Twenty-First Century Fox misses Wall St sales target "
    },
    {
        "content": "* 21St century fox reports third quarter income from continuing operations before income tax expense of $1.25 billion and total segment operating income before depreciation and amortization of $1.94 billion on 5% revenue growth",
        "date": "05102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-21st Century Fox Q3 adjusted eps from continuing operations $0.54 "
    },
    {
        "content": "News Corp  reported better-than-expected quarterly revenue as the owner of the Dow Jones Newswires and the Wall Street Journal saw an uptick in its digital real estate business and growth in its advertising revenue.",
        "date": "05092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp quarterly revenue beats on higher ad revenue "
    },
    {
        "content": "* 21St Century Fox names Melody Hildebrandt global chief information security officer",
        "date": "05082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-21st Century Fox names Melody Hildebrandt as Global Chief Information Security Officer "
    },
    {
        "content": "May 10 Twenty-First Century Fox Inc  the television and film company controlled by Rupert Murdoch  reported a 4.6 percent rise in quarterly revenue due to strong Super Bowl advertising and high ratings for its cable news channel  Fox News.",
        "date": "05102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox reports 4.6 pct rise in quarterly revenue "
    },
    {
        "content": "* Q3 adj profit $0.07/shr vs est $0.05/shr (Adds details from conference call  background)",
        "date": "05092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-News Corp quarterly revenue beats on higher ad revenue "
    },
    {
        "content": "May 9 News Corp reported its first revenue rise in three quarters as the owner of the Dow Jones Newswires and the Wall Street Journal saw an upside from its digital real estate business.",
        "date": "05092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp reports 4.6 pct rise in quarterly revenue "
    },
    {
        "content": "* News Corp names Marc Frons chief technology officer Source text for Eikon: Further company coverage:",
        "date": "05082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-News Corp names Marc Frons chief technology officer "
    },
    {
        "content": "LONDON A woman who accused former Fox News presenter Bill O'Reilly of sexual harassment in the United States called on Britain on Monday to block Fox's owner Rupert Murdoch from taking full control of Britain's pay-TV group Sky . | Video ",
        "date": "05092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox News complainant meets UK regulator over Sky-Fox deal "
    },
    {
        "content": "NEW YORK Twenty-First Century Fox Inc  is in talks with Blackstone Group LP  about submitting an offer to buy Tribune Media Co   one of the largest U.S. television station operators  sources familiar with the matter said on Sunday.",
        "date": "05012017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox in talks with Blackstone to buy Tribune "
    },
    {
        "content": "* Dow up 0.10 pct  S&P up 0.22 pct; Nasdaq hits record high (Adds details  changes comment  updates prices)",
        "date": "05012017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "US STOCKS-Wall St moves higher as tech gains offset weak economic data "
    },
    {
        "content": "* 21st Century Fox is in talks with Blackstone to launch a joint bid for Tribune Media - FT  citing sources Source text  - http://on.ft.com/2pkKKlo Further company coverage: (Bengaluru Newsroom)",
        "date": "04302017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-21st Century Fox is in talks with Blackstone to launch a joint bid for Tribune Media - FT  citing sources "
    },
    {
        "content": "* Indexes up: Dow 0.06 pct  S&P 0.18 pct  Nasdaq 0.35 pct (Updates to open)",
        "date": "05012017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "US STOCKS-Wall St opens higher after govt shutdown averted "
    },
    {
        "content": "* Futures up: Dow 40 pts  S&P 5.75 pts  Nasdaq 17.25 pts (Adds details  comment  updates prices)",
        "date": "05012017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "US STOCKS-Wall St set to open higher after govt shutdown averted "
    },
    {
        "content": "* Says after review of allegations  co and Bill O'Reilly agreed that O'Reilly will not be returning to Fox News Channel Further company coverage:",
        "date": "04192017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox says Bill O'Reilly will not be returning to Fox News "
    },
    {
        "content": "NEW YORK  April 9 Fox News parent Twenty-First Century Fox Inc said on Sunday it will investigate a sexual harassment claim against TV anchor Bill O'Reilly  who has seen several companies pull their ads from his top-rated news show in the past week.",
        "date": "04102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox to investigate sexual harassment claim against O'Reilly "
    },
    {
        "content": "BRUSSELS  April 7 Rupert Murdoch's Twenty-First Century Fox secured unconditional EU antitrust approval on Friday for its 11.7-billion-pound ($14.5 billion) takeover of European pay-TV group Sky.",
        "date": "04072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Murdoch's Fox wins EU approval to take over Sky "
    },
    {
        "content": "April 2 The New York Post apologized early on Sunday hours after its app was apparently hacked with what was reported to be alerts about President Donald Trump.",
        "date": "04022017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "New York Post apologizes after app apparently hacked "
    },
    {
        "content": "BRUSSELS  March 31 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03312017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "EU mergers and takeovers (March 31) "
    },
    {
        "content": "BRUSSELS/LONDON  April 7 Rupert Murdoch's Twenty-First Century Fox is set to win unconditional EU antitrust approval for its 11.7-billion-pound  ($14.5 billion) takeover of European pay-TV group Sky  two people familiar with the matter said on Friday.",
        "date": "04072017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "EU regulators to approve Fox takeover of Sky - sources "
    },
    {
        "content": "DUBAI  March 29 Vice Media is bringing its edgy style of journalism to the Middle East to tap what it believes is an underserved market of young  digital hungry consumers.",
        "date": "03302017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "RPT-Vice Media takes its edgy journalism to the Middle East "
    },
    {
        "content": "DUBAI  March 29 Vice Media is bringing its edgy style of journalism to the Middle East to tap what it believes is an underserved market of young  digital hungry consumers.",
        "date": "03292017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Vice Media takes its edgy journalism to the Middle East "
    },
    {
        "content": "* Twenty-First Century Fox - on March 23 unit extended until April 6  2017 expiration date of offer to exchange up to $450 million of 3.375 percent notes due 2026",
        "date": "03232017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox unit extended until April 6 expiration date of offer to exchange up to $450 mln of 3.375 pct notes due 2026 "
    },
    {
        "content": "BRUSSELS  March 29 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03292017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "EU mergers and takeovers (March 29) "
    },
    {
        "content": "BRUSSELS  March 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03232017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "EU mergers and takeovers (March 23) "
    },
    {
        "content": "BRUSSELS  March 24 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03242017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "EU mergers and takeovers (March 24) "
    },
    {
        "content": "* Fox confident of approval despite political opposition   (Adds opposition lawmaker's quote  background on James Murdoch)",
        "date": "03162017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-British regulator to investigate Sky takeover by Murdoch's Fox "
    },
    {
        "content": "LONDON  March 8 Rupert Murdoch's Twenty-First Century Fox said it was not surprised the British government wanted to scrutinise its takeover of Sky  but disputed the analysis that led to the view the deal may not be in the public interest.",
        "date": "03082017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox takes issue with UK government analysis of Sky deal "
    },
    {
        "content": "March 1 Hulu will provide customer help 24 hours a day  seven days a week ahead of the upcoming launch of its live TV streaming service  and plans to open a service center by the fall  doubling investment in customer service over the next year so it can cope better with any glitches that arise  the company told Reuters this week.",
        "date": "03022017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Hulu to launch non-stop customer service as it readies live TV "
    },
    {
        "content": "LONDON  March 1 Rupert Murdoch's Twenty-First Century Fox will seek approval from the European Commission for its $14.4 billion bid for European pay-TV firm Sky in the coming days  a person familiar with the matter said.",
        "date": "03012017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Murdoch's Fox set to request EU approval for Sky takeover bid "
    },
    {
        "content": "BRUSSELS Rupert Murdoch's Twenty-First Century Fox  has asked EU antitrust regulators to approve its $14.4 billion takeover bid for European pay-TV company Sky   a filing on the European Commission showed on Friday.",
        "date": "03032017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Murdoch's Fox seeks EU okay for $14.4 billion Sky takeover bid "
    },
    {
        "content": "Penguin Random House has landed a deal to publish two forthcoming books by former U.S. President Barack Obama and the former first lady  Michelle Obama  with one volume to be written by each  the publishing company said on Tuesday.",
        "date": "03012017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Penguin Random House lands book deal with Obamas "
    },
    {
        "content": "* Britain likely to refer 11.7 bln stg deal to media regulator",
        "date": "03032017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-UK government likely to refer Fox's Sky deal to regulator "
    },
    {
        "content": "Feb 28 Penguin Random House has landed a deal to publish two forthcoming books by former U.S. President Barack Obama and the former first lady  Michelle Obama  with one volume to be written by each  the publishing company said on Tuesday.",
        "date": "03012017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Penguin Random House lands book deal with Obamas "
    },
    {
        "content": "* Says confident that its deal to buy Sky will be approved \"based on a compelling fact set\"  Further company coverage:   (London newsroom)",
        "date": "03032017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-Fox says confident its Sky deal will be approved "
    },
    {
        "content": "BRUSSELS  March 3 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03032017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "EU mergers and takeovers (March 3) "
    },
    {
        "content": "* News Corp says Susan Panuccio  currently chief financial officer of News Corp Australia  will become new CFO of company",
        "date": "02232017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "REFILE-BRIEF-Bedi A. Singh to depart post at News Corp "
    },
    {
        "content": "BRUSSELS  March 3 Rupert Murdoch's Twenty-First Century Fox has asked EU antitrust regulators to approve its $14.4 billion takeover bid for European pay-TV company Sky  a filing on the European Commission showed on Friday.",
        "date": "03032017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Murdoch's Fox seeks EU okay for $14.4 bln Sky takeover bid "
    },
    {
        "content": "* Says pursuant to agreement  newly-appointed CFO of co  Susan Panuccio  entitled to an annual base salary of not less than $1.1 million  Source text: (http://bit.ly/2lqnePd) Further company coverage:",
        "date": "02272017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-News Corp CFO Panuccio entitled to annual base salary of not less than $1.1 mln "
    },
    {
        "content": "* News Corp says in connection with reorganization at Dow Jones  expects to incur about $30 million-$40 million restructuring charges during remainder of 2017",
        "date": "02102017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-News Corp says expects to incur $30 mln-$40 mln restructuring charges during remainder of 2017 in connection with reorganization at Dow Jones "
    },
    {
        "content": "News Corp   the owner of Dow Jones Newswires and book publisher HarperCollins  posted an adjusted profit that edged past analysts' estimates for the first time in three quarters as the drop in ad sales in its news business was offset by growth in its other businesses.",
        "date": "02092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp's adjusted profit edges past analysts estimates "
    },
    {
        "content": "* Shares up 1.6 pct in after-hours trading   (Adds details  share movement)",
        "date": "02092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-News Corp's adjusted profit edges past analysts estimates "
    },
    {
        "content": "Twenty-First Century Fox Inc  reported a quarterly profit that beat analysts' expectations  as its television and cable units benefited from hosting the World Series and its  cable news channel enjoyed strong ratings during the U.S. presidential campaign.",
        "date": "02062017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox profit tops estimates  revenue misses "
    },
    {
        "content": "Feb 9 News Corp  the owner of the Dow Jones Newswires and book publisher HarperCollins  posted a second-quarter loss as it struggles to offset the decline in advertising income in its newspaper business.",
        "date": "02092017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp posts second-quarter loss "
    },
    {
        "content": "Feb 6 Twenty-First Century Fox Inc  reported a 4.2 percent rise in quarterly revenue  as its television unit benefited from hosting the baseball World Series and its cable news channel enjoyed strong ratings during the U.S. presidential campaign.",
        "date": "02062017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox revenue rises 4.2 pct "
    },
    {
        "content": "LONDON  Jan 26 Sky  the European pay-TV group that has accepted a buy-out offer from shareholder Rupert Murdoch  reported 679 million pounds in first-half operating profit  down 9 percent  after it absorbed a big hike in Premier League soccer costs.",
        "date": "01262017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Sky reports dip in H1 operating profit on increased soccer costs "
    },
    {
        "content": "OTTAWA  Jan 20 Canada's business competition watchdog said on Friday it had reached an agreement with Apple Inc and three major e-book publishers that will allow retailers to offer discounts to customers.",
        "date": "01202017",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Canada's Competition Bureau reaches deal with Apple  publishers "
    },
    {
        "content": "LONDON Prime Minister Theresa May did not discuss with Rupert Murdoch the proposed takeover of UK pay-TV group Sky  by the tycoon's Twenty-First Century Fox at a September meeting  Britain's media minister said on Tuesday.",
        "date": "12202016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "UK PM and Murdoch did not discuss Sky bid at September meeting: minister "
    },
    {
        "content": "LONDON Investor Royal London Asset Management on Thursday asked Sky's  independent committee of directors for more information on the advice on which they based their acceptance of a $14.6 billion offer from Twenty-First Century Fox .",
        "date": "12152016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Investor Royal London asks Sky committee for more information "
    },
    {
        "content": "LONDON Former Prime Minister Gordon Brown urged Britain to delay Rupert Murdoch's proposed deal to buy European pay-TV group Sky  until the government completes an inquiry into a phone hacking scandal  the Guardian said on Wednesday.",
        "date": "12142016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Former UK PM Brown calls for Murdoch's Sky deal to be delayed "
    },
    {
        "content": "MADRID (Reuters Breakingviews) - Sky’s shareholders can’t fly much higher. Some of the UK pay-TV group’s investors are grumbling that independent directors gave in too quickly to an opportunistic bid from Rupert Murdoch’s Twenty-First Century Fox. But the market had previously given Sky the thumbs-down  and the premium looks generous. A small sweetener is the best investors can hope for.",
        "date": "12152016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Sky shareholders are close to maximum altitude "
    },
    {
        "content": "New sexual harassment accusations against former Fox News network chief Roger Ailes were revealed in a lawsuit filed against 21st Century Fox on Monday.",
        "date": "12142016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "New accusations against former Fox News head Ailes in lawsuit "
    },
    {
        "content": "LONDON British public sector pension funds on Tuesday called for an \"appropriate\" premium in any potential deal between Twenty-First Century Fox  and Sky  as well as for safeguards to protect minority shareholders.",
        "date": "12132016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "British pension funds warn on any Fox/Sky deal "
    },
    {
        "content": "LONDON Britain's main opposition Labour Party will ask an urgent question in parliament on Monday about the proposed bid by Rupert Murdoch's Twenty-First Century Fox  for pay-TV company Sky   the parliamentary website said.",
        "date": "12122016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Britain's Labour to ask urgent parliamentary question on Fox bid for Sky "
    },
    {
        "content": "LONDON A major shareholder in British pay-TV Sky  told Reuters on Sunday that it would vote against a takeover bid from Rupert Murdoch's Twenty-First Century Fox  as the offer was too low.",
        "date": "12112016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Major shareholder says Fox's offer for Sky too low  will vote against it "
    },
    {
        "content": "LONDON A major shareholder in British pay-TV company Sky  will vote against Twenty-First Century Fox's  $14 billion takeover bid  the investor told Reuters on Sunday  while another said it is unhappy about the offer.",
        "date": "12122016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Major Sky shareholder to vote against Fox bid "
    },
    {
        "content": "LONDON British Prime Minister Theresa May is aware of Rupert Murdoch's Twenty-First Century Fox  $14 billion takeover bid for British pay-TV company Sky Plc  but it would not be appropriate to comment on the deal  her spokeswoman said on Monday.",
        "date": "12122016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UK PM May's spokeswoman says not appropriate to comment on Fox bid for Sky "
    },
    {
        "content": "Nov 21 AT&T has signed a deal with Fox Networks Group to continue showing its networks across its offerings including its online video service  DirectTV Now  the two companies announced on Monday.",
        "date": "11212016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "AT&T signs on Fox for DirectTV Now "
    },
    {
        "content": "* cuts share stake in Time Warner Inc by 18.1 percent to 3.9 million shares",
        "date": "11142016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Greenlight Capital dissolves share stake in Twenty-First Century Fox  Vodafone Group "
    },
    {
        "content": "News Corp   the owner of the Wall Street Journal  Dow Jones Newswires and book publisher HarperCollins  reported a quarterly loss as it struggles to cope with a decline in newspaper advertising sales.",
        "date": "11072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp posts quarterly loss as print ad sales fall "
    },
    {
        "content": "Nov 7 News Corp  the owner of the Wall Street Journal  Dow Jones Newswires and book publisher HarperCollins  reported a quarterly loss as it struggles to cope with a decline in newspaper advertising sales.",
        "date": "11072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-News Corp posts quarterly loss as print ad sales fall "
    },
    {
        "content": "* Q1 book publishing revenue $389 million versus $409 million",
        "date": "11072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-News Corp Q1 adjusted loss per share $0.01 "
    },
    {
        "content": "Nov 7 News Corp  the owner of the Wall Street Journal  Dow Jones Newswires and book publisher HarperCollins  reported a 2.4 percent fall in quarterly revenue as it struggles to cope with a decline in newspaper advertising revenue.",
        "date": "11072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp's quarterly revenue falls 2.4 percent "
    },
    {
        "content": "* Hulu-says inks new affiliate agreements with 21st Century Fox and the Walt Disney Company",
        "date": "11012016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Hulu inks deal with 21st Century Fox and Walt Disney "
    },
    {
        "content": "* Fox chief executive James Murdoch - Fox does not have a \"heightened appetite\" for M&A after AT&T/Time Warner deal- conf call",
        "date": "11022016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-first Century Fox says does not have \"heightened appetite\" for M&A after AT&T/Time Warner deal- CEO on conf call "
    },
    {
        "content": "* Cable network programming quarterly segment OIBDA increased 6% to $1.38 billion",
        "date": "11022016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox cable network programming quarterly segment OIBDA increased 6% to $1.38 bln "
    },
    {
        "content": "Nov 2 Twenty-First Century Fox Inc  owner of Fox News and the Twentieth Century Fox movie studio  reported a 7.1 percent rise in quarterly revenue due to higher ad revenue at its cable division  helped by the U.S. presidential election campaign.",
        "date": "11022016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox quarterly revenue up 7.1 pct "
    },
    {
        "content": "Nov 2 News Corp's Wall Street Journal will launch a new format for the newspaper with fewer sections on Nov. 14  Gerald Baker  the editor-in-chief  told employees in a memo on Wednesday.",
        "date": "11022016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Wall St Journal to launch new format with fewer sections Nov. 14-memo "
    },
    {
        "content": "News Corp's The Wall Street Journal on Friday offered all of its news employees the option to take buyouts  according to a memo reviewed by Reuters.",
        "date": "10212016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Wall Street Journal offers all news employees option to take buyouts: memo "
    },
    {
        "content": "Oct 21 News Corp's The Wall Street Journal on Friday offered all of its news employees the option to take buyouts  according to a memo reviewed by Reuters.",
        "date": "10212016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Wall Street Journal offers all news employees option to take buyouts -memo "
    },
    {
        "content": "LONDON  Oct 13 Almost 30 percent of voting shareholders at Sky opposed the appointment of James Murdoch as chairman of the European pay TV group on Thursday  with some saying he was too closely linked to the group's largest investor  owned by his father Rupert.",
        "date": "10132016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Almost 30 pct of Sky shareholders oppose James Murdoch as chairman "
    },
    {
        "content": "* Exec chairman Rupert Murdoch 2016 total compensation of $5.34 million versus $5.07 million in 2015",
        "date": "10122016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-News Corp says Rupert Murdoch's 2016 total compensation $5.34 mln "
    },
    {
        "content": "Oct 6 Australian Competition and Consumer Commission",
        "date": "10052016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-ACCC comments on News Corporation's proposed acquisition of APN's Australian regional media division "
    },
    {
        "content": "NEW YORK An estimated 37 million Americans watched the U.S. vice presidential debate between Republican Mike Pence and Democrat Tim Kaine on television  according to Nielsen data on Wednesday  less than half the number who tuned in to Donald Trump's first matchup with Hillary Clinton last week.",
        "date": "10052016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "U.S. vice presidential debate watched by 37 million on TV "
    },
    {
        "content": "NEW YORK  Oct 5 An estimated 37 million Americans watched the U.S. vice presidential debate between Republican Mike Pence and Democrat Tim Kaine on television  according to Nielsen data on Wednesday  less than half the number who tuned in to Donald Trump's first matchup with Hillary Clinton last week.",
        "date": "10052016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 4-U.S. vice presidential debate watched by 37 million on TV "
    },
    {
        "content": "* Twenty-First Century Fox Inc - CEO James Murdoch's FY 2016 total compensation $26.4 million versus $15.1 million for FY 2015 - SEC filing",
        "date": "09232016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox CEO James Murdoch's FY 2016 total compensation $26.4 mln "
    },
    {
        "content": "NEW YORK  Sept 14 Fox News said on Wednesday that co-presidents Jack Abernethy and Bill Shine have signed new multiyear contracts  deals that put to rest some uncertainty about the cable channel's direction after the departure of former Chairman Roger Ailes.",
        "date": "09142016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "CORRECTED-Fox News co-presidents signed to long-term contracts "
    },
    {
        "content": "LONDON  Sept 14 Europe's leading pay-TV group Sky  known for splashing out billions of pounds on coverage of glamorous sports to keep an edge over its rivals  said on Wednesday it had identified the next big thing: drone racing.",
        "date": "09142016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Soccer  Formula 1  drone racing - Sky takes to air with new sport "
    },
    {
        "content": "* As at 3.00 p.m. on 7 Sept 2016  co received valid acceptances of 64. million wireless shares  representing about 93.84 percent of existing issued share  Source text for Eikon:  Further company coverage:",
        "date": "09072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-News Corp says received acceptances of c.94 pct Wireless shares "
    },
    {
        "content": "WASHINGTON  Sept 7 The top U.S. communications regulator plans on Thursday to unveil a revised plan to allow about 100 million pay TV subscribers to replace expensive set-top boxes with less-costly apps that provide access to television and video programs  two people briefed on the plan said.",
        "date": "09072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "U.S. FCC chief to unveil revised plan to eliminate cable boxes "
    },
    {
        "content": "LONDON The United States can be a big growth area for Formula One but  Liberty Media have no desire to 'Americanise' the sport after the U.S. company's takeover  new F1 chairman Chase Carey said on Thursday.",
        "date": "09082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Liberty will not 'Americanise' F1  says Carey "
    },
    {
        "content": "Fox News will pay $20 million to settle a sexual harassment lawsuit by former anchor Gretchen Carlson  whose allegations led to the resignation of network chief Roger Ailes in July  a source familiar with the agreement said on Tuesday. | Video ",
        "date": "09062016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox settles sexual harassment lawsuit for $20 million on Ailes' behalf "
    },
    {
        "content": "LONDON  Sept 7 Formula One faces its biggest shake-up in decades with the announcement on Wednesday that U.S. cable TV mogul John Malone's Liberty Media has agreed to take control of the cash-generating glamour sport.",
        "date": "09072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "RPT-UPDATE 1-Motor racing-Formula One faces big shake-up after Liberty deal "
    },
    {
        "content": "LONDON  Sept 8 The United States can be a big growth area for Formula One but  Liberty Media have no desire to 'Americanise' the sport after the U.S. company's takeover  new F1 chairman Chase Carey said on Thursday.",
        "date": "09082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Motor racing-Liberty will not 'Americanise' F1  says Carey "
    },
    {
        "content": "Sept 6 Fox News will pay $20 million to settle a sexual harassment lawsuit by former anchor Gretchen Carlson  whose allegations led to the resignation of network chief Roger Ailes in July  a source familiar with the agreement said on Tuesday.",
        "date": "09062016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 6-Fox settles sexual harassment lawsuit for $20 mln on Ailes' behalf "
    },
    {
        "content": "LONDON Formula One faces its biggest shake-up in decades with the announcement on Wednesday that U.S. cable TV mogul John Malone's Liberty Media has agreed to take control of the cash-generating glamor sport.",
        "date": "09072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Formula One faces big shake-up after Liberty deal "
    },
    {
        "content": "LONDON Formula One's commercial supremo Bernie Ecclestone has been asked to stay on for three years after an imminent takeover of the sport is completed by U.S. cable TV mogul John Malone's Liberty Media.",
        "date": "09072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Exclusive: Ecclestone says new F1 owners would want him to stay "
    },
    {
        "content": "Sept 8 The chair of the U.S. Federal Communications Commission said Thursday he is unveiling a revised proposal to allow tens of millions of Americans to drop costly pay TV set-top boxes and get service through application-based software.",
        "date": "09082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "FCC chair unveils revised set top box reform plan "
    },
    {
        "content": "LONDON Liberty Media's takeover of Formula One promises a long-term strategy for the cash-rich sport with a sharper focus on new media markets and another attempt to expand in North America.",
        "date": "09082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Liberty takeover offers a longer-term vision for F1 "
    },
    {
        "content": "LONDON  Sept 7 Formula One faces its biggest shake-up in decades with the announcement on Wednesday that U.S. cable TV mogul John Malone's Liberty Media has agreed to take control of the cash-generating glamour sport.",
        "date": "09082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "RPT-UPDATE 1-Motor racing-Formula One faces big shake-up after Liberty deal "
    },
    {
        "content": "* Stacey Snider to assume leadership of Twentieth Century Fox Film on September 1  2016",
        "date": "08232016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Stacey Snider to assume leadership of Twentieth Century Fox Film "
    },
    {
        "content": "Twenty-First Century Fox Inc  anticipates having to settle with the women who have alleged they were victims of harassment by former Fox News chief Roger Ailes  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08112016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Fox anticipates settlements in Ailes harassment case: WSJ "
    },
    {
        "content": "Aug 11 Twenty-First Century Fox Inc  anticipates having to settle with the women who have alleged they were victims of harassment by former Fox News chief Roger Ailes  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08112016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Fox anticipates settlements in Ailes harassment case-WSJ "
    },
    {
        "content": "Aug 11 Twenty-First Century Fox Inc  anticipates having to settle with the women who have alleged they were victims of harassment by former Fox News chief Roger Ailes  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08112016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox anticipates settlements in Ailes harassment case-WSJ "
    },
    {
        "content": "Rupert Murdoch's News Corp reported an unexpected 5.1 percent rise in quarterly revenue  helped by growth in its digital real estate business and in its news division that houses the Wall Street Journal and the New York Post.",
        "date": "08082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp revenue rises unexpectedly  snaps five quarters of declines "
    },
    {
        "content": "Aug 8 Rupert Murdoch's News Corp  reported an unexpected 5.1 percent rise in quarterly revenue  helped by growth in its digital real estate business and in its news division that houses the Wall Street Journal and the New York Post.",
        "date": "08082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-News Corp revenue rises unexpectedly  snaps five quarters of declines "
    },
    {
        "content": "Aug 8 News Corp  the owner of the Wall Street Journal and book publisher HarperCollins  reported a 5.1 percent rise in quarterly revenue  helped by strong growth in its digital real estate business.",
        "date": "08082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp posts 5.1 percent rise in quarterly revenue "
    },
    {
        "content": "Aug 3 Twenty-First Century Fox Inc  reported better-than-expected quarterly profit on Wednesday  but higher sports programming and film marketing costs held back gains  and the media company's shares fell more than 4 percent after-hours.",
        "date": "08032016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "UPDATE 3-Twenty-First Century profit beats Wall Street  but costs a concern "
    },
    {
        "content": "* Q4 earnings per share view $0.37 -- Thomson Reuters I/B/E/S",
        "date": "08032016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox reports Q4 adj earnings per share $0.45 "
    },
    {
        "content": "Aug 3 Twenty-First Century Fox Inc  reported a slightly better-than-expected quarterly profit  helped by higher ad revenue in its cable division.",
        "date": "08032016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "CORRECTED-UPDATE 1-Twenty-First Century Fox profit marginally beats estimates "
    },
    {
        "content": "Aug 3 Twenty-First Century Fox Inc  reported a 7.1 percent rise in quarterly adjusted revenue  driven by strong advertising sales in its cable and television units.",
        "date": "08032016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox adjusted revenue rises 7.1 pct "
    },
    {
        "content": "NEW YORK Hulu has beefed up its customer service staff and is hiring executives from outside and within the online video business to slow subscriber defections ahead of the introduction of its live TV service  a top official of the streaming company said.",
        "date": "08032016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Hulu mounts push to draw and keep subscribers: executive "
    },
    {
        "content": "Aug 3 Time Warner Inc disclosed a 10 percent stake in video streaming site Hulu on Wednesday  setting its sights on the web TV market  and it raised its 2016 forecast on expectations of sustained growth in its traditional media business.",
        "date": "08032016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 5-Time Warner takes stake in Hulu  lifts profit forecast "
    },
    {
        "content": "* Sky sees better-than-expected 5-7 growth in revenue in 2016",
        "date": "07282016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-Sky says investment in products and content will keep revenue motoring "
    },
    {
        "content": "LONDON  July 28 European pay-TV group Sky  reported a 12 percent rise in full-year adjusted operating profit on Thursday  just ahead of forecasts  in what it said was another excellent year for the group.",
        "date": "07282016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Sky's full-year adjusted operating profit rises 12 pct "
    },
    {
        "content": "* Roger Ailes is at work. Review is ongoing. The only agreement that is in place is his existing employment agreement - Tweet  Further company coverage:",
        "date": "07192016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox says only agreement in place with Roger Ailes is existing employment agreement "
    },
    {
        "content": "* 21st Century Fox leaning towards cleaning house  removing many close to ailes following his departure - CNBC  citing source",
        "date": "07212016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-21st Century Fox leaning towards cleaning house  removing many close to Ailes following his departure - CNBC  citing source "
    },
    {
        "content": "The following is the full text of the resignation letter sent by Fox News Chief Executive Roger Ailes to Rupert Murdoch  the executive chairman of Twenty-First Century Fox Inc  the parent of Fox News.",
        "date": "07212016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Roger Ailes' resignation letter to Rupert Murdoch "
    },
    {
        "content": "July 21 The following is the full text of the resignation letter sent by Fox News Chief Executive Roger Ailes to Rupert Murdoch  the executive chairman of Twenty-First Century Fox Inc  the parent of Fox News.",
        "date": "07212016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "FULL TEXT -Roger Ailes' resignation letter to Rupert Murdoch "
    },
    {
        "content": "* Says statement from 21st Century Fox regarding complaint against Fox News chairman and CEO Roger Ailes",
        "date": "07062016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox says commenced an internal review of complaint against Fox News chairman and CEO Roger Ailes "
    },
    {
        "content": "July 6 Former Fox News anchor Gretchen Carlson sued Fox News Chairman and Chief Executive Roger Ailes on Wednesday claiming sexual harassment and that he wrongfully fired her after years of making unwanted advances.",
        "date": "07062016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "CORRECTED-Ex-Fox News host sues CEO Roger Ailes claiming sexual harassment "
    },
    {
        "content": "LONDON  June 30 The boss of Rupert Murdoch's News Corp said the timing of the U.S. group's offer for talkSPORT-owner Wireless after the post-Brexit drop in the pound was \"auspicious\"  although the companies had been in talks for some time.",
        "date": "06302016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp CEO says drop in pound \"auspicious\" for $295 mln Wireless deal "
    },
    {
        "content": "* Offer values entire existing issued and to be issued share capital of Wireless at approximately £220.3 million",
        "date": "06302016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-News Corp  Wireless agree on terms of cash offer "
    },
    {
        "content": "June 30 News Corp has agreed to buy London-listed broadcaster Wireless Group in a 220.3 million pound ($296 million) deal  which will give the U.S. media company access to the UK and Ireland radio markets.",
        "date": "06302016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp offers to buy UK's Wireless Group for about $296 mln "
    },
    {
        "content": "Twenty-First Century Fox Inc  said Jim Gianopulos would step down as chief executive of its film studio business in June next year and co-Chairman Stacey Snider would succeed him.",
        "date": "06162016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "21st Century Fox names Stacey Snider as CEO of film studio unit "
    },
    {
        "content": "MELBOURNE The leaders of Australia's two main political parties will hold an online debate for the first time in a national election campaign ahead of a July 2 vote  debate sponsors Facebook and Rupert Murdoch's News Corp said on Tuesday.",
        "date": "06142016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Australia to hold first online leader's debate ahead of July 2 poll "
    },
    {
        "content": "June 16 Twenty-First Century Fox Inc  said Jim Gianopulos would step down as chief executive of its film studio business in June next year and co-Chairman Stacey Snider would succeed him.",
        "date": "06162016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-21st Century Fox names Stacey Snider as CEO of film studio unit "
    },
    {
        "content": "* Its unit Move Inc  National Association Of Realtors  certain related entities entered into a settlement agreement and release with Zillow Inc",
        "date": "06062016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-News Corp's unit enters settlement agreement with Zillow "
    },
    {
        "content": "* CFO says he expects topline growth and improvement at bottomline at book publishing business in Q4 - conf call  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05052016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-News Corp CFO says he expects topline growth at book publishing business in Q4 "
    },
    {
        "content": "NEW YORK The former head of Venezuela's National Assembly filed a lawsuit on Thursday accusing the Wall Street Journal of libeling him in an article in which it was reported that he was the target of a U.S. drug trafficking probe.",
        "date": "05052016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Ex-Venezuela parliament head sues News Corp over drug article "
    },
    {
        "content": "Twenty-First Century Fox Inc  reported quarterly earnings in line with Wall Street expectations as the company's cable channels brought in higher affiliate fees and ad revenue while its movie studio turned out blockbuster film \"Deadpool.\"",
        "date": "05042016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Cable  'Deadpool' help Fox earnings meet forecasts "
    },
    {
        "content": "News Corp   owner of the Wall Street Journal and book publisher HarperCollins  reported its fifth drop in quarterly revenue in a row as print ad sales declined and a strong dollar hit income from outside the United States.",
        "date": "05062016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp's quarterly revenue falls 7.3 percent  posts loss "
    },
    {
        "content": "* 21st Century Fox reports third quarter total segment operating income before depreciation and amortization of $1.88 billion",
        "date": "05042016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox reports Q3 earnings of $0.44/share from continuing ops "
    },
    {
        "content": "* 21St century fox reports third quarter total segment operating income before depreciation and amortization of $1.88 billion",
        "date": "05042016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-21St Century Fox reports Q3 earnings per share $0.44 from cont-ops "
    },
    {
        "content": "AMSTERDAM  April 18 News Corp has expanded its complaint against Google to EU antitrust regulators investigating whether the Internet search engine abused its dominance  a person familiar with the matter said on Monday.",
        "date": "04182016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp broadens Google antitrust complaint - source "
    },
    {
        "content": "March 29 Tobin Smith  a former Fox News commentator  will pay nearly $258 000 to settle U.S. Securities and Exchange Commission charges that he fraudulently promoted a penny stock to investors  the regulator said on Tuesday.",
        "date": "03292016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Ex-TV commentator Tobin Smith settles SEC penny stock fraud case "
    },
    {
        "content": "Fox News Channel's total day and primetime ratings topped all U.S. basic cable channels from January through March  the first time in the network's history that it has led basic cable in both categories for a full quarter  according to Nielsen data.",
        "date": "03292016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox News ratings top basic cable in first quarter "
    },
    {
        "content": "March 29 Fox News Channel's total day and primetime ratings topped all U.S. basic cable channels from January through March  the first time in the network's history that it has led basic cable in both categories for a full quarter  according to Nielsen data.",
        "date": "03292016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Fox News ratings top basic cable in first quarter "
    },
    {
        "content": "March 29 Fox News Channel's total day and primetime ratings topped all basic cable channels from January through March  the first time in the network's nearly 20-year history that it has led basic cable in both categories for a full quarter  according to Nielsen data.",
        "date": "03292016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox News Channel ratings lead basic cable in first quarter "
    },
    {
        "content": "* EU antitrust regulators still undecided despite 6-year probe",
        "date": "03072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp CEO to meet EU antitrust chief  Google in focus "
    },
    {
        "content": "NEW YORK News Corp said on Monday that it had agreed to pay $280 million to resolve claims that it monopolized the market for in-store promotions at more than 50 000 retail stores across the United States.",
        "date": "03012016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp to settle in-store promotions litigation for $280 mln "
    },
    {
        "content": "NEW YORK News Corp said on Monday that it had agreed to pay $280 million to resolve claims that it monopolized the market for in-store promotions at more than 50 000 retail stores across the United States.",
        "date": "03012016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp to settle in-store promotions litigation for $280 million "
    },
    {
        "content": "NEW YORK  Feb 29 News Corp went to trial on Monday in a class action lawsuit that accuses the company of monopolizing the market for in-store promotions at some 52 500 retail stores across the United States.",
        "date": "02292016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp faces U.S. trial over monopoly of in-store ads "
    },
    {
        "content": "* EU antitrust regulators opened Google case six year ago   (Adds European Commission confirming the meeting)",
        "date": "03072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-News Corp CEO to meet EU antitrust chief  Google in focus "
    },
    {
        "content": "NEW YORK  Feb 29 News Corp said on Monday that it had agreed to pay $280 million to resolve claims that it monopolized the market for in-store promotions at more than 50 000 retail stores across the United States.",
        "date": "03012016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 3-News Corp to settle in-store promotions litigation for $280 mln "
    },
    {
        "content": "BOSTON/NEW YORK T. Rowe Price Group Inc plans to vote against key directors at companies with two classes of shares in the upcoming U.S. corporate annual meeting season  as the big asset manager steps up its push against companies that give extra voting clout to insiders.",
        "date": "03072016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Exclusive: T. Rowe Price to oppose key directors at super-voting share companies "
    },
    {
        "content": "NEW YORK  Feb 19 Verizon Communications Inc   which launched its pay TV plan \"Fios Custom TV\" last year to let viewers choose bundles of channels they want to watch  has redesigned the offering.",
        "date": "02232016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "REFILE-UPDATE 2-Verizon redesigns its Fios Custom TV offering "
    },
    {
        "content": "LONDON  Feb 20 Media tycoon Rupert Murdoch congratulated a close ally of Prime Minister David Cameron on Saturday for wanting to campaign to leave the European Union in an upcoming referendum.",
        "date": "02202016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Media tycoon Murdoch hails Cameron ally for wanting Britain to leave EU "
    },
    {
        "content": "NEW YORK  Feb 10 The managing editor of News Corp's social media news agency Storyful said on Wednesday she is leaving to manage journalism partnerships at Facebook Inc     as the social network broadens its push into news.",
        "date": "02102016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Storyful editor to join Facebook to manage journalism partnerships "
    },
    {
        "content": "Twenty-First Century Fox Inc reported lower-than-expected quarterly revenue  mainly due to a decline in DVD sales from a year ago  when \"X-Men: Days of Futures Past\" and \"Dawn of the Planet of the Apes\" were released for home viewing.",
        "date": "02082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Fox revenue misses on lackluster DVD sales "
    },
    {
        "content": "Feb 8 Twenty-First Century Fox Inc  reported lower-than-expected quarterly revenue  mainly due to a decline in DVD sales from a year ago  when \"X-Men: Days of Futures Past\" and \"Dawn of the Planet of the Apes\" were released for home viewing.",
        "date": "02082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 3-Fox revenue misses on lackluster DVD sales "
    },
    {
        "content": "Feb 8 Twenty-First Century Fox Inc  reported lower-than-expected quarterly adjusted revenue  hurt by a fall in sales in its filmed entertainment division.",
        "date": "02082016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox's second-quarter adjusted revenue falls "
    },
    {
        "content": "News Corp's revenue fell for the fourth quarter in a row  hurt by a stronger dollar and dwindling advertising revenue in its core news and information business  which includes the Wall Street Journal.",
        "date": "02042016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp's revenue falls for fourth quarter in a row "
    },
    {
        "content": "(Corrects to add dropped word in the headline) Feb 4 News Corp :  * Reports second quarter results for fiscal 2016  * Q2 adjusted earnings per share $0.20  * Q2 revenue $2.16 billion versus I/B/E/S view $2.13 billion  * Q2 earnings per share view $0.21 -- Thomson Reuters I/B/E/S  * Q2 earnings per share $0.15 from continuing operations  * Q2 News and information services segment EBITDA $158 million versus $216 million year ago  * Says decline in total qtrly reported revenues includes",
        "date": "02042016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "REFILE-BRIEF-News Corp reports Q2 adjusted earnings per share $0.20 "
    },
    {
        "content": "Feb 1 Twenty-First Century Fox said it would offer some of its employees voluntary exit options with \"generous\" benefit packages  with the aim of reducing costs.",
        "date": "02012016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Fox to offer some employees buyouts to save costs "
    },
    {
        "content": "Feb 4 News Corp's revenue fell for the fourth quarter in a row  hurt by a stronger dollar and dwindling advertising revenue in its core news and information services business  which includes Dow Jones and the Wall Street Journal.",
        "date": "02042016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "CORRECTED-UPDATE 1-News Corp's revenue falls for fourth quarter in a row "
    },
    {
        "content": "Feb 4 News Corp's quarterly revenue fell for the fourth quarter in a row  hurt by a slump in its core news and information services business  which includes Dow Jones and the Wall Street Journal.",
        "date": "02042016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp's revenue fall for fourth quarter in a row "
    },
    {
        "content": "Feb 4 Movie and TV studio Lions Gate Entertainment Corp said on Thursday it would explore a combination with media mogul John Malone's premium cable TV network Starz.",
        "date": "02042016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Lions Gate says to explore combination with Starz "
    },
    {
        "content": "LONDON James Murdoch is to return as chairman of Sky  four years after a phone-hacking scandal forced him out  potentially taking the Murdoch family a step closer to a deal for full ownership of the European pay-TV group.",
        "date": "01292016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "James Murdoch  who quit in phone-hacking scandal  returns to Sky "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 22 (Fitch) Fitch Ratings has affirmed the 'BBB+' Issuer  Default Ratings (IDRs) of Twenty-First Century Fox  Inc. (FOXA) and its wholly  owned subsidiary 21st Century Fox America  Inc. (21CFA). Fitch has also affirmed  the specific issuer ratings assigned to 21st Century Fox America  Inc. The  Rating Outlook remains Stable.  Approximately $19.8 billion of debt outstanding as of Sept. 30  2015  pro forma  for October 20",
        "date": "01222016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Fitch Affirms Twenty-First Century Fox's IDR at 'BBB+'; Outlook Stable "
    },
    {
        "content": "Jan 20 Rupert Murdoch's News Corp said rumors about the company's interest in buying microblogging site Twitter Inc or building a stake in it were untrue.",
        "date": "01202016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp denies rumors of Twitter bid  stake "
    },
    {
        "content": "LONDON  Jan 12 Media mogul Rupert Murdoch and former supermodel Jerry Hall got engaged over the weekend  announcing their plans to tie the knot in a classified ad on Tuesday in the Times newspaper  which is owned by Murdoch's News Corp.",
        "date": "01122016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "UPDATE 4-Rupert Murdoch  ex-model Jerry Hall announce engagement "
    },
    {
        "content": "Jan 12 Media baron Rupert Murdoch announced his engagement to former supermodel Jerry Hall in an advertisement published on Tuesday in The Times newspaper  which is owned by Murdoch's News Corp.",
        "date": "01122016",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Rupert Murdoch  Jerry Hall announce engagement "
    },
    {
        "content": "NEW YORK A sports marketing company that was described in a sweeping indictment this month as retaining contracts because of the \"support\" of corrupt soccer officials has longstanding ties to the U.S. entertainment company 21st Century Fox  according to securities filings and other government documents.",
        "date": "12142015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "U.S. investigates broadcasters in widening FIFA case "
    },
    {
        "content": "NEW YORK A sports marketing company that was described in a sweeping indictment this month as retaining contracts because of the \"support\" of corrupt soccer officials has longstanding ties to the U.S. entertainment company 21st Century Fox  according to securities filings and other government documents.",
        "date": "12142015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "EXCLUSIVE - U.S. investigates broadcasters in widening FIFA case "
    },
    {
        "content": "Nov 30 Tribune Publishing Co said it was not in talks or in the process of selling itself  after a tweet by News Corp's Rupert Murdoch on Friday that suggested its newspaper group would be sold.",
        "date": "11302015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Tribune Publishing says not in talks to sell itself "
    },
    {
        "content": "Laurene Powell Jobs  widow of Apple Inc  co-founder Steve Jobs  is the lead investor who funded the buyout of News Corp's  money losing digital education business Amplify earlier this year.",
        "date": "11212015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Laurene Powell Jobs backs Amplify education company bought from News Corp "
    },
    {
        "content": "Nov 20 Laurene Powell Jobs  widow of Apple Inc  co-founder Steve Jobs  is the lead investor who funded the buyout of News Corp's money losing digital education business Amplify earlier this year.",
        "date": "11202015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Laurene Powell Jobs backs Amplify education company bought from News Corp "
    },
    {
        "content": "News Corp  owner of the Wall Street Journal  reported its third straight quarter of revenue decline  hurt by a strong dollar and lower print ad sales  mainly in Australia.",
        "date": "11052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp's revenue falls for third straight quarter "
    },
    {
        "content": "* Adj profit $0.05/shr vs. est. $0.06/shr   (Adds details  quote)",
        "date": "11052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-News Corp's revenue falls for third straight quarter "
    },
    {
        "content": "SYDNEY  Nov 2 News Corp's Australian real estate website company REA Group Ltd said it plans to buy out smaller rival iProperty Group Ltd for A$580 million ($414 million)  seizing on the target company's footprint in Southeast Asia.",
        "date": "11022015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp property website to buy out rival for $414 mln to gain Asia presence "
    },
    {
        "content": "Twenty-First Century Fox Inc reported lower-than-expected quarterly revenue as a lack of major movie releases and poor collections from \"The Fantastic Four\" weighed on its film studio business and a strong dollar hurt overseas results.",
        "date": "11042015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "'Fantastic Four ' strong dollar weigh on Fox's revenue "
    },
    {
        "content": "Nov 5 News Corp's quarterly revenue fell 4.5 percent  the third straight quarter of decline  as revenue declined further in its core news and information services business  which includes Dow Jones and the Wall Street Journal.",
        "date": "11052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp's quarterly revenue falls 4.5 pct "
    },
    {
        "content": "Nov 4 Twenty-First Century Fox Inc  reported lower-than-expected quarterly revenue as a lack of major movie releases and poor collections from \"The Fantastic Four\" weighed on its film studio business and a strong dollar hurt overseas results.",
        "date": "11042015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-'Fantastic Four ' strong dollar weigh on Fox's revenue "
    },
    {
        "content": "Nov 4 Twenty-First Century Fox Inc  reported a 6.3 percent fall in quarterly adjusted revenue as a lack of major movie releases weighed on its studio business.",
        "date": "11042015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox's adjusted revenue falls 6.3 pct "
    },
    {
        "content": "SYDNEY  Oct 26 Australian broadcaster Ten Network Holdings Ltd said it would raise A$154 million ($111 million) by selling shares to the Australian pay TV unit of News Corp and existing shareholders as it racked up another hefty loss.",
        "date": "10252015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Australia's Ten plans equity boost from News Corp's Foxtel as losses mount "
    },
    {
        "content": "SYDNEY  Oct 26 Australian broadcaster Ten Network Holdings Ltd plans to raise A$154 million ($111 million) by selling shares to News Corp's Australian pay TV unit and other shareholders  after a licence writedown led to its third straight annual loss.",
        "date": "10252015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Australia's Ten plans equity boost from News Corp's Foxtel as losses mount "
    },
    {
        "content": "SYDNEY  Oct 22 Australia's antitrust regulator said on Thursday that it will let News Corp's local cable television company Foxtel buy a 15 percent stake of loss-making free-to-air broadcaster Ten Network Holdings Ltd .",
        "date": "10212015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Australia waves through News Corp buy-in to struggling free-to-air Ten "
    },
    {
        "content": "WASHINGTON  Oct 15 A Fox News guest terrorism analyst was arrested on Thursday after a grand jury indicted him on charges of falsely claiming to have been a CIA agent for decades  U.S. prosecutors said.",
        "date": "10152015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "CORRECTED-Fox News guest analyst arrested for lying about working for CIA "
    },
    {
        "content": "Sept 29 Twenty-First Century Fox Inc  said its board has nominated Jeffrey Ubben  chief executive of ValueAct Capital  for election to the media company's board.",
        "date": "09292015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox nominates ValueAct CEO to board "
    },
    {
        "content": "Sept 29 Twenty-First Century Fox Inc  said it agreed to nominate ValueAct Capital Chief Executive Jeffrey Ubben for election to its board as long as the hedge fund maintains a stake of at least 5 percent in the film and TV company.",
        "date": "09292015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Twenty-First Century Fox nominates ValueAct CEO to board "
    },
    {
        "content": "Sept 30 News Corp said it sold its digital education brand  Amplify  to a management team supported by a group of private investors following slowing growth in the digital curriculum market.",
        "date": "09302015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp sells digital education brand Amplify "
    },
    {
        "content": "Sept 15 Cable network operator AMC Networks Inc  was in preliminary talks to buy billionaire John Malone's premium TV cable network Starz  Bloomberg reported.",
        "date": "09152015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-AMC Networks in talks to buy Starz- Bloomberg "
    },
    {
        "content": "News Corp said it would buy Unruly Holdings Ltd  a UK-based video advertisement technology company  giving it the technology that analyzes historical sharing behavior to predict the potential for video ads to go viral.",
        "date": "09162015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp to acquire video ad technology company Unruly "
    },
    {
        "content": "Sept 16 News Corp said it would buy Unruly Holdings Ltd  a UK-based video advertisement technology company  giving it the technology that analyzes historical sharing behavior to predict the potential for video ads to go viral.",
        "date": "09162015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-News Corp to acquire video ad technology company Unruly "
    },
    {
        "content": "Sept 16 News Corp said it would acquire Unruly Holdings Ltd  a global advertisement technology company  for 58 million pounds ($89.60 million) in cash.",
        "date": "09162015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp to acquire ad technology company Unruly "
    },
    {
        "content": "SYDNEY  Sept 14 A proposal by Rupert Murdoch's cable TV firm Foxtel to buy 15 percent of struggling broadcaster Ten Network Holdings Ltd may hurt competition  an Australian antitrust regulator said  in a sign that it may block the A$77 million share sale.",
        "date": "09142015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Australian antitrust chief questions Murdoch play for Ten Network "
    },
    {
        "content": "LONDON Rebekah Brooks  the Rupert Murdoch protegee cleared last year of orchestrating a criminal campaign that damaged the British establishment  will return to her old job running the tycoon's British newspapers next week in a stunning comeback.",
        "date": "09022015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Murdoch favorite Brooks returns to UK job in remarkable comeback "
    },
    {
        "content": "Sept 1 Twenty-First Century Fox Inc's  Fox News Channel scored the highest prime-time ratings among all basic cable television networks in August  according to Nielsen data  led by the Republican presidential candidates' debate and anchor Megyn Kelly's \"The Kelly File.\"",
        "date": "09012015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox News Channel tops basic cable in August prime-time ratings "
    },
    {
        "content": "* CEO says not interested in parts of News Corp's  education business",
        "date": "08312015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "BRIEF-Bertelsmann would mull upping stake in Penguin Random House "
    },
    {
        "content": "LONDON Rebekah Brooks will return to her old job heading Rupert Murdoch's British newspaper division  the Financial Times reported  just over a year after being cleared of criminal charges in a phone-hacking scandal.",
        "date": "08282015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Rebekah Brooks returning to News Corp as UK chief: FT "
    },
    {
        "content": "LONDON  Aug 28 Rebekah Brooks will return to her old job heading Rupert Murdoch's British newspaper division  the Financial Times reported  just over a year after being cleared of criminal charges in a phone-hacking scandal.",
        "date": "08282015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 3-Rebekah Brooks returning to News Corp as UK chief - FT "
    },
    {
        "content": "Aug 28 Rebekah Brooks will return to News Corp  as chief executive of its UK division  the Financial Times reported  citing people familiar with the matter.",
        "date": "08282015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Rebekah Brooks returning to News Corp as UK chief - FT "
    },
    {
        "content": "News Corp  reported a better-than-expected quarterly profit on Wednesday  helped by cost cuts in its news and information services business that includes Dow Jones and the Wall Street Journal.",
        "date": "08122015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp profit beats as cost cuts in news business pay off "
    },
    {
        "content": "* Shares rise 4 pct in extended trading   (Adds analyst comment  conference call details; updates shares)",
        "date": "08122015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 3-News Corp profit beats as cost cuts in news business pay off "
    },
    {
        "content": "Aug 12 News Corp reported a 2 percent fall in quarterly revenue hurt by a strong dollar and a decline in advertising sales at its print publications such as the Wall Street Journal and the New York Post.",
        "date": "08122015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp quarterly revenue falls on strong dollar "
    },
    {
        "content": "Twenty-First Century Fox Inc's  reported a 9.3 percent fall in quarterly adjusted revenue as advertising sales fell in its television business and a lack of major film releases weighed on its studio business.",
        "date": "08052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Fox revenue misses estimates; company boosts buyback "
    },
    {
        "content": "Aug 5 Twenty-First Century Fox Inc's  reported a 9.3 percent fall in quarterly adjusted revenue as advertising sales fell in its television business and a lack of major film releases weighed on its studio business.",
        "date": "08052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Fox revenue misses estimates; company boosts buyback "
    },
    {
        "content": "Aug 5 Twenty-First Century Fox Inc  reported a 9.3 percent fall in quarterly adjusted revenue as advertising sales fell in its television business and a lack of major film releases weighed on its studio business.",
        "date": "08052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Twenty-First Century Fox posts fall in revenue  boosts buyback "
    },
    {
        "content": "CANNES James Murdoch  who will take the helm of Twenty-First Century Fox  next week  said there was little he and his father Rupert did not agree on with respect to the future of the family media empire.",
        "date": "06252015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "James Murdoch says family is united as he takes helm of Fox "
    },
    {
        "content": "Twenty-First Century Fox Inc  said Roger Ailes had signed a multi-year contract to stay on as Chairman and Chief Executive of Fox News and Fox Business Network  and would jointly report to Rupert  James and Lachlan Murdoch.",
        "date": "06252015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox News head Roger Ailes to report to three Murdochs "
    },
    {
        "content": "June 25 Twenty-First Century Fox Inc  said Roger Ailes had signed a multi-year contract to stay on as Chairman and Chief Executive of Fox News and Fox Business Network  and would jointly report to Rupert  James and Lachlan Murdoch.",
        "date": "06252015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Fox News head Roger Ailes to report to three Murdochs "
    },
    {
        "content": "June 25 21st Century Fox said Roger Ailes would continue as chairman and CEO of Fox News and Fox Business Network and had signed a new multi-year contract with the company.",
        "date": "06252015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Roger Ailes to continue to serve as Fox News CEO "
    },
    {
        "content": "NEW YORK  June 19 News Corp has been ordered by a Manhattan federal judge to face a class action lawsuit accusing it of monopolizing the market for in-store promotions at some 52 500 retail stores across the United States.",
        "date": "06192015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp must face Dial  Heinz ad monopoly class action - judge "
    },
    {
        "content": "Twenty-First Century Fox Inc's  Chase Carey will remain at the company for another year to support James and Lachlan Murdoch in their new positions running the media company. | Video ",
        "date": "06162015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Chase Carey to stay at Fox to advise newly promoted Murdoch sons "
    },
    {
        "content": "* Competition regulator will consider level of shareholding - Sims",
        "date": "06152015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "UPDATE 2-Australia's unprofitable Ten Network plans stake sale to News Corp's Foxtel "
    },
    {
        "content": "SYDNEY  June 19 News Corp will replace the chief executive officer of its Australian unit and create a new role of executive chairman to grow the global media company's business in Asia  one of its newspapers reported on Friday.",
        "date": "06182015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp Australia installs new leadership to spearhead Asia growth "
    },
    {
        "content": "June 16 Twenty-First Century Fox Inc's  Chase Carey will remain at the company for another year to support James and Lachlan Murdoch in their new positions running the media company.",
        "date": "06162015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-Chase Carey to stay at Fox to advise newly promoted Murdoch sons "
    },
    {
        "content": "June 16 Twenty-First Century Fox Inc  said Rupert Murdoch will hand over the chief executive reins at the entertainment conglomerate to his 42-year-old son James.",
        "date": "06162015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Rupert Murdoch to hand over Fox CEO reins to son James "
    },
    {
        "content": "June 18 News Corp  owner of the Wall Street Journal  is carrying out a major reorganization at its Dow Jones news publishing unit that will involve job cuts and shifting resources to digital media.",
        "date": "06182015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-News Corp to reorganize  cut jobs in news publishing business "
    },
    {
        "content": "June 18 News Corp  owner of the Wall Street Journal  is carrying out a major reorganization at its Dow Jones news publishing unit that will involve job cuts and shifting of resources into digital media  the Wall Street Journal reported.",
        "date": "06182015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp to reorganize  cut jobs in news publishing business-WSJ "
    },
    {
        "content": "NEW YORK Rupert Murdoch  the 84-year old media baron  will hand over the chief executive reins at entertainment conglomerate Twenty-First Century Fox Inc to his 42-year-old son James  a source familiar with the situation said on Thursday. | Video ",
        "date": "06112015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Rupert Murdoch to hand Fox CEO title to son James "
    },
    {
        "content": "NEW YORK Rupert Murdoch  the 84-year old media baron  will hand over the chief executive reins at entertainment conglomerate Twenty-First Century Fox Inc to his 42-year-old son James  a source familiar with the situation said on Thursday. | Video ",
        "date": "06122015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Rupert Murdoch to hand Fox CEO title to son James - source "
    },
    {
        "content": "NEW YORK Rupert Murdoch  the 84-year old media baron  will hand over the chief executive reins at entertainment conglomerate Twenty-First Century Fox Inc to his 42-year-old son James  a source familiar with the situation said on Thursday. | Video ",
        "date": "06122015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Rupert Murdoch to hand Fox CEO title to son James "
    },
    {
        "content": "James Murdoch  a Harvard drop out  former cartoonist and co-founder of a hip hop music label  did not always appear destined to follow his father as a media baron  but he will take the CEO job at Twenty-First Century Fox Inc with backing from some important investors.",
        "date": "06122015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "James Murdoch  Harvard dropout  steps into limelight at Fox "
    },
    {
        "content": "June 11 James Murdoch  a Harvard drop out  former cartoonist and co-founder of a hip hop music label  did not always appear destined to follow his father as a media baron  but he will take the CEO job at Twenty-First Century Fox Inc with backing from some important investors.",
        "date": "06122015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "REFILE-NEWSMAKER-James Murdoch  Harvard dropout  steps into limelight at Fox "
    },
    {
        "content": "News Corp   owner of the Wall Street Journal and HarperCollins  reported a decline in quarterly revenue and profit due to foreign currency changes and a drop in ad sales at its newspapers.",
        "date": "05052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp quarterly revenue falls on currency  lower ad sales "
    },
    {
        "content": "Twenty-First Century Fox  President Chase Carey said on Wednesday \"a vast majority of customers want a bundle of channels\" rather than to cherry pick networks  an option cable providers are increasingly offering in the face of declining subscriptions.",
        "date": "05062015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Fox says U.S. cable customers like bundles  pay-TV strong "
    },
    {
        "content": "May 5 News Corp  owner of the Wall Street Journal and HarperCollins  reported a decline in quarterly revenue and profit due to foreign currency changes and a drop in ad sales at its newspapers.",
        "date": "05052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-News Corp quarterly revenue falls on currency  lower ad sales "
    },
    {
        "content": "May 6 Twenty-First Century Fox  President Chase Carey said on Wednesday \"a vast majority of customers want a bundle of channels\" rather than to cherry pick networks  an option cable providers are increasingly offering in the face of declining subscriptions.",
        "date": "05062015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Fox says U.S. cable customers like bundles  pay-TV strong "
    },
    {
        "content": "May 6 Rupert Murdoch-controlled Twenty-First Century Fox Inc reported a 1.2 percent rise in quarterly adjusted revenue  helped by growth in its cable network business and the box office success of \"Taken 3\" and \"Kingsman: The Secret Service\".",
        "date": "05062015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox revenue rises 1.2 pct as cable network business grows "
    },
    {
        "content": "May 5 News Corp  the publisher of the Wall Street Journal  reported a marginal fall in quarterly revenue  hurt by the stronger dollar and dwindling advertising sales at its newspapers.",
        "date": "05052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp revenue falls marginally "
    },
    {
        "content": "Saudi Arabia's Prince Alwaleed bin Talal is in no doubt that James Murdoch is ready to take a much bigger role at Twenty-First Century Fox  by far the largest part of the media empire that James' father Rupert Murdoch built.",
        "date": "04212015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "With a prince's backing  James Murdoch may soon ascend at Fox "
    },
    {
        "content": "April 21 Saudi Arabia's Prince Alwaleed bin Talal is in no doubt that James Murdoch is ready to take a much bigger role at Twenty-First Century Fox  by far the largest part of the media empire that James' father Rupert Murdoch built.",
        "date": "04212015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "INSIGHT-With a prince's backing  James Murdoch may soon ascend at Fox "
    },
    {
        "content": "NEW YORK News Corp and 21st Century Fox  controlled by Rupert Murdoch  are in talks to build a joint headquarters in a new 88-story skyscraper at the World Trade Center in lower Manhattan  The New York Times said on Friday.",
        "date": "04102015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp  21st Century Fox seek World Trade Center base: report "
    },
    {
        "content": "NEW YORK  April 10 News Corp and 21st Century Fox  controlled by Rupert Murdoch  are in talks to build a joint headquarters in a new 88-story skyscraper at the World Trade Center in lower Manhattan  The New York Times said on Friday.",
        "date": "04102015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp  21st Century Fox seek World Trade Center base -report "
    },
    {
        "content": "Video streaming-device maker Roku Inc launched new search functions on Monday including a \"feed\" that updates people on movie availability and pricing.",
        "date": "04062015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Roku introduces new search functions  voice activated remote "
    },
    {
        "content": "FRANKFURT Sky Deutschland Chief Executive Brian Sullivan is leaving the company and two sources familiar with the matter said he was headed for a senior post at Rupert Murdoch's 21st Century Fox [NWSNA.UL].",
        "date": "03262015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Sky Deutschland CEO Sullivan quits for Fox: sources "
    },
    {
        "content": "* Expected to take up new job at Fox in LA -sources   (Adds detail about new CEO  background)",
        "date": "03262015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-Sky Deutschland CEO Sullivan quits for Fox -sources "
    },
    {
        "content": "SYDNEY/DUBLIN News Corp increased its stake in Australian media company APN News & Media Ltd  becoming the biggest foreign shareholder in the owner of some of the country's top rated radio shows with a $104 million share purchase.",
        "date": "03192015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "News Corp expands stake in Australia's APN media with $104 million deal "
    },
    {
        "content": "SYDNEY/DUBLIN  March 19 News Corp  increased its stake in Australian media company APN News & Media Ltd  becoming the biggest foreign shareholder in the owner of some of the country's top rated radio shows with a $104 million share purchase.",
        "date": "03192015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "CORRECTED-UPDATE 2-News Corp expands stake in Australia's APN media with $104 mln deal "
    },
    {
        "content": "SYDNEY  March 19 News Corp said on Thursday it has increased its stake in Australian media company APN News & Media Ltd from an undisclosed level to 14.99 percent  the maximum shareholding allowed in Australia without a formal takeover offer.",
        "date": "03192015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "News Corp says buys 14.99 pct of Australia's APN News & Media "
    },
    {
        "content": "LONDON Rebekah Brooks  the former Rupert Murdoch protegee cleared last year of running an illegal campaign to hack into phones for tabloid scoops  is in talks to return to the media conglomerate  a source said on Monday.",
        "date": "03022015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Rebekah Brooks in talks to return to News Corp: source "
    },
    {
        "content": "LONDON  March 2 Rebekah Brooks  the former Rupert Murdoch protegee cleared last year of running an illegal campaign to hack into phones for tabloid scoops  is in talks to return to the media conglomerate  a source said on Monday.",
        "date": "03022015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Rebekah Brooks in talks to return to News Corp - source "
    },
    {
        "content": "Former editor of the now-defunct tabloid News of the World  Rebekah Brooks is all set to make a comeback to her alma mater News Corp.  to run its social media news agency Storyful  the Financial Times reported.",
        "date": "03012015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Rebekah Brooks to return to News Corp to run social media news agency: FT "
    },
    {
        "content": "LOS ANGELES  Feb 22 Fox Searchlight  the arthouse film division of Rupert Murdoch's 21st Century Fox   dominated the Academy Awards on Sunday with eight awards including the coveted best picture prize for its absurd comedy-drama \"Birdman.\"",
        "date": "02232015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "'Birdman' leap makes Fox Searchlight shine at Oscars "
    },
    {
        "content": "March 1 Former editor of the now-defunct tabloid News of the World  Rebekah Brooks is all set to make a comeback to her alma mater News Corp.  to run its social media news agency Storyful  the Financial Times reported.",
        "date": "03012015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Rebekah Brooks to return to News Corp to run social media news agency -FT "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 27 (Fitch) Fitch Ratings has published its new Rating  Navigators for the following North American diversified Media companies: --CBS Corporation --Cox Enterprises  Inc. --Discovery Communications LLC --NBCUniversal Media LLC --Time Warner Inc. --Twenty-First Century Fox  Inc. --Viacom  Inc. --The Walt Disney Company  Inc.  These Rating Navigators should be read in tandem with its companion report  entitled 'Media:  R",
        "date": "02272015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Fitch Publishes Rating Navigators for U.S. Diversified Media Companies "
    },
    {
        "content": "* Spokesman says no truth in report company held takeover talks with discovery communications    Further company coverage:",
        "date": "02232015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "BRIEF-Twenty-First Century Fox spokesman says no truth in report company held takeover talks with Discovery Communications "
    },
    {
        "content": "NEW YORK Several top investors in Twenty-First Century Fox Inc are pressing for the right to swap their voting shares for ordinary shares  which are trading at an unusual premium  even though the move could hand even more control of the company to Rupert Murdoch  according to people familiar with the matter.",
        "date": "02072015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Exclusive: Top Fox investors seek to convert voting shares  Murdoch may benefit "
    },
    {
        "content": "NEW YORK Several top investors in Twenty-First Century Fox Inc are pressing for the right to swap their voting shares for ordinary shares  which are trading at an unusual premium  even though the move could hand even more control of the company to Rupert Murdoch  according to people familiar with the matter.",
        "date": "02062015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Exclusive: Top Fox investors seek to convert voting shares  Murdoch may benefit - sources "
    },
    {
        "content": "NEW YORK Several top investors in Twenty-First Century Fox Inc are pressing for the right to swap their voting shares for ordinary shares  which are trading at an unusual premium  even though the move could hand even more control of the company to Rupert Murdoch  according to people familiar with the matter.",
        "date": "02062015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Top Fox investors seek to convert voting shares  Murdoch may benefit: sources "
    },
    {
        "content": "Twenty-First Century Fox Inc's quarterly profit beat analysts' estimates  helped by higher affiliate and advertising revenue in its cable business and the box-office success of \"The Maze Runner\" and \"Gone Girl\".",
        "date": "02042015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Cable business  films help Fox beat estimates "
    },
    {
        "content": "Feb 4 Twenty-First Century Fox Inc's  quarterly profit beat analysts' estimates  helped by higher affiliate and advertising revenue in its cable business and the box-office success of \"The Maze Runner\" and \"Gone Girl\".",
        "date": "02042015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 1-Cable business  films help Fox beat estimates "
    },
    {
        "content": "DUBAI Saudi Arabia's Kingdom Holding   the investment firm owned by billionaire Prince Alwaleed bin Talal  sold most of its stake in media giant News Corp  as part of a portfolio review  it said on Wednesday.",
        "date": "02042015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Saudi's Kingdom Holding sells 5.6 percent stake in News Corp "
    },
    {
        "content": "Twenty-First Century Fox Inc cut its profit forecast for the next financial year after the dollar strengthened and as more viewers and advertisers swap its broadcast networks for on-demand TV. | Video ",
        "date": "02052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Fox says dollar  shifting viewers to weigh on 2016 profit "
    },
    {
        "content": "Feb 4 Twenty-First Century Fox Inc cut its profit forecast for the next financial year after the dollar strengthened and as more viewers and advertisers swap its broadcast networks for on-demand TV.",
        "date": "02052015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "UPDATE 2-Fox says dollar  shifting viewers to weigh on 2016 profit "
    },
    {
        "content": "The United States Department of Justice has decided not to prosecute News Corp  or its sister company Twenty-First Century Fox  after completing an investigation of scandals in Great Britain involving phone hacking and alleged bribery of public officials.",
        "date": "02022015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "topStory",
        "symbol": "FOX",
        "title": "Justice Department drops News Corp probe related to phone hacking "
    },
    {
        "content": "Feb 2 The United States Department of Justice has decided not to prosecute News Corp or its sister company Twenty-First Century Fox after completing an investigation of scandals in Great Britain involving phone hacking and alleged bribery of public officials.",
        "date": "02022015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "U.S. Justice Dept drops News Corp probe related to phone hacking "
    },
    {
        "content": "A U.S. judge has rejected portions of Twenty-First Century Fox Inc's lawsuit seeking to stop Dish Network Corp from selling devices that let viewers skip over commercials when playing back shows.",
        "date": "01212015",
        "name": "Twenty-First Century Fox Inc",
        "news_type": "normal",
        "symbol": "FOX",
        "title": "Fox loses U.S. copyright claims over Dish ad-skipper "
    }
]