[
    {
        "content": "* First Solar sells California flats project to Capital Dynamics",
        "date": "08222017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar sells California flats project to Capital Dynamics "
    },
    {
        "content": "* D. E. Shaw renewable investments acquires cuyama solar project from first solar",
        "date": "08172017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-D. E. Shaw Renewable Investments to buy Cuyama solar project from First Solar "
    },
    {
        "content": "* First Solar awarded 241MW module supply contract for Edify energy solar projects in Australia Source text for Eikon: Further company coverage:",
        "date": "08122017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar awarded 241MW module supply contract for Edify energy solar projects in Australia "
    },
    {
        "content": "First Solar Inc  on Thursday raised its revenue and earnings outlook for the year  citing strong demand for solar panels and robust U.S. investor interest in infrastructure that has boosted pricing of the power plants it builds and sells.",
        "date": "07272017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "First Solar raises 2017 forecast on strong solar demand "
    },
    {
        "content": "July 27 First Solar Inc on Thursday raised its revenue and earnings outlook for the year  citing strong demand for solar panels and robust U.S. investor interest in infrastructure that has boosted pricing of the power plants it builds and sells.",
        "date": "07272017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 1-First Solar raises 2017 forecast on strong solar demand "
    },
    {
        "content": "July 27 First Solar Inc on Thursday reported quarterly profit and sales that topped Wall Street estimates and raised its revenue and earnings outlook for the year due to lower costs  strong demand for its solar products and systems and a tax benefit.",
        "date": "07272017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar results top estimates  2017 view raised "
    },
    {
        "content": "* First Solar  Inc. announces second quarter 2017 financial results",
        "date": "07272017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar Inc Q2 earnings per share $0.50 "
    },
    {
        "content": "* First Solar Inc - on july 10  2017  first solar entered into second amended and restated credit agreement - sec filing",
        "date": "07142017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar says entered into second amended and restated credit agreement - SEC Filing "
    },
    {
        "content": "* EDF Renewable Energy announces acquisition of solar projects from First Solar",
        "date": "07132017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-EDF Renewable Energy acquires solar projects from First Solar "
    },
    {
        "content": "* First Solar appoints Molly Joseph to board of directors Source text for Eikon: Further company coverage:",
        "date": "06092017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar appoints Molly Joseph to board of directors "
    },
    {
        "content": "* First Solar Inc. Announces first quarter 2017 financial results",
        "date": "05022017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First solar says Q1 GAAP earnings per share $0.09 "
    },
    {
        "content": "First Solar Inc   the largest U.S. solar equipment manufacturer  posted a surprise profit  helped by the sale of the Moapa project and cost-cutting.",
        "date": "05022017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar posts surprise profit on lower costs  project sale "
    },
    {
        "content": "May 2 First Solar Inc  the largest U.S. solar equipment manufacturer  posted a surprise profit  helped by the sale of the Moapa project and cost-cutting.",
        "date": "05022017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 1-First Solar posts surprise profit on lower costs  project sale "
    },
    {
        "content": "May 2 First Solar Inc  the largest U.S. solar equipment manufacturer  reported 1.8 percent rise in quarterly revenue as the sale of the Moapa project partially offset lower third-party module sales.",
        "date": "05022017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar sales rise 1.8 pct "
    },
    {
        "content": "U.S. solar company First Solar Inc  on Wednesday said it was looking to sell its stake in a publicly traded company it formed with rival SunPower Corp  less than two years ago  at the height of investor euphoria over so-called \"yieldcos.\"",
        "date": "04052017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "First Solar wants out of 'yieldco' venture with SunPower "
    },
    {
        "content": "April 5 U.S. solar company First Solar Inc on Wednesday said it was looking to sell its stake in a publicly traded company it formed with rival SunPower Corp less than two years ago  at the height of investor euphoria over so-called \"yieldcos.\"",
        "date": "04052017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 1-First Solar wants out of 'yieldco' venture with SunPower "
    },
    {
        "content": "April 5 U.S. solar company SunPower Corp said on Wednesday it was exploring strategic alternatives for its yieldco joint venture with First Solar .",
        "date": "04052017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "SunPower says exploring options for JV with First Solar "
    },
    {
        "content": "* First Solar to review alternatives for the sale of its interests in 8point3 Energy Partners",
        "date": "04052017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar to review alternatives for the sale of its interests in 8point3 Energy Partners "
    },
    {
        "content": "* Sunpower comments on First Solar's announcement concerning its interests in 8point3 Energy Partners",
        "date": "04052017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "BRIEF-Sunpower comments on First Solar's announcement on 8point3 Energy Partners "
    },
    {
        "content": "* First Solar Inc - terms of deal were not disclosed Source text for Eikon: Further company coverage:",
        "date": "03302017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar sells Moapa solar project to capital dynamics "
    },
    {
        "content": "* First solar begins operation of 250 megawatt moapa southern paiute solar project  Source text for Eikon:  Further company coverage:",
        "date": "03172017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar begins operation of 250 megawatt Moapa Southern Paiute solar project "
    },
    {
        "content": "U.S. solar company First Solar Inc  raised its 2017 sales forecast due to the timing of the sale of a major project  but said a large facility in Arizona had been canceled due to opposition to its location on tribal lands.",
        "date": "02212017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "First Solar raises 2017 revenue view on project timing "
    },
    {
        "content": "Feb 21 U.S. solar company First Solar Inc  raised its 2017 sales forecast due to the timing of the sale of a major project  but said a large facility in Arizona had been canceled due to opposition to its location on tribal lands.",
        "date": "02212017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 2-First Solar raises 2017 revenue view on project timing "
    },
    {
        "content": "Feb 21 First Solar Inc  the largest U.S. solar equipment manufacturer  swung to a quarterly loss  as the company recorded charges related to a transition to a new module.",
        "date": "02212017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar swings to loss on restructuring  impairment charges "
    },
    {
        "content": "* WILL SUPPLY 63 MEGAWATTS DCOF ADVANCED THIN-FILM PHOTOVOLTAIC (PV) MODULES TO KIDSTON PHASE ONE SOLAR PROJECT IN QUEENSLAND  Source text for Eikon:  Further company coverage:",
        "date": "02132017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-FIRST SOLAR SELECTED FOR 63MW KIDSTON SOLAR PROJECT IN AUSTRALIA "
    },
    {
        "content": "* 62 pct owned unit Zorlu Holding signs cooperation agreement with First Solar",
        "date": "02132017",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "BRIEF-Zorlu Enerji says Zorlu Holding signs exclusive distribution agreement with First Solar "
    },
    {
        "content": "* Franklin Resources reports 6 percent passive stake in first Solar Inc as of December 31  2016 -SEC filing  Source text : [ID:http://bit.ly/2kTxa6G] Further company coverage:",
        "date": "02082017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-Franklin Resources reports 6 percent passive stake in First Solar as of Dec 31  2016 "
    },
    {
        "content": "* On Jan 20  co entered into a sixth amendment to amended and restated credit agreement dated as of October 15  2010 - sec filing",
        "date": "01272017",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First solar says entered into a sixth amendment to amended and restated credit agreement dated as of Oct. 15  2010 "
    },
    {
        "content": "First Solar Inc forecast 2017 sales well below analysts' estimate  and the company said it would slash about 1 600 jobs  or 27 percent of its global workforce  as it transitions to a new product ahead of schedule.",
        "date": "11162016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "First Solar 2017 sales forecast misses; to slash 27 percent jobs "
    },
    {
        "content": "* To advance production of Series 6 modules by a year to 2018",
        "date": "11162016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 2-First Solar 2017 sales forecast misses; to slash 27 pct jobs "
    },
    {
        "content": "* Says one impact of Series 6 pull forward is that 2017 production will be lower than previously communicated",
        "date": "11162016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar says will begin phasing out Series 4 production later this year-conf call "
    },
    {
        "content": "* To reduce First Solar's workforce by approximately 1 600 associates  or 27% of its approximately 6 000 global total",
        "date": "11162016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar to reduce workforce by about 1 600 associates "
    },
    {
        "content": "* First Solar  Inc. announces acceleration of Series 6 Solar Module Production to 2018; Restructures operations; Updates 2016 guidance & provides 2017 guidance",
        "date": "11162016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar to cut workforce "
    },
    {
        "content": "Nov 16 First Solar Inc  the largest U.S. solar equipment maker  said it would slash about 1 600 jobs  or 27 percent of its global workforce  to cut costs as it transitions to production of Series 6 modules.",
        "date": "11162016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar to slash 1 600 jobs "
    },
    {
        "content": "* First Solar  - entered into a power purchase agreement for electricity generated from 40MWACOF First Solar's little bear solar project in Fresno County  CA.",
        "date": "11012016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar  MCE sign power purchase agreement "
    },
    {
        "content": "First Solar Inc on Wednesday said a 30 percent slide in panel prices has forced it to walk away from some money-losing supply contracts and it is working to accelerate the introduction of a cheaper  more competitive module.",
        "date": "11022016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "First Solar says panel price slide harming bookings "
    },
    {
        "content": "Nov 2 First Solar Inc on Wednesday said a 30 percent slide in panel prices has forced it to walk away from some money-losing supply contracts and it is working to accelerate the introduction of a cheaper  more competitive module.",
        "date": "11022016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 2-First Solar says panel price slide harming bookings "
    },
    {
        "content": "* First Solar Inc announces third quarter 2016 financial results",
        "date": "11022016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar posts Q3 adj. earnings per share $1.22 "
    },
    {
        "content": "Nov 2 First Solar Inc  the largest U.S. solar equipment manufacturer  reported a 55.9 percent drop in quarterly profit on Wednesday  and the company cut its full-year revenue forecast for the second time.",
        "date": "11022016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar's profit slumps 56 pct; company cuts 2016 rev forecast "
    },
    {
        "content": "* Says Alexander R. Bradley has been appointed chief financial officer of first solar  effective Oct 24  Source text for Eikon: [ID:http://bit.ly/2dZKKkF] Further company coverage:",
        "date": "10142016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar says Alexander R. Bradley has been appointed CFO of co "
    },
    {
        "content": "* Board and James A. Hughes have mutually agreed that mr. Hughes will no longer serve in an advisory capacity to company",
        "date": "09022016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First solar announces board transition "
    },
    {
        "content": "* Orders were placed by Basariarge Enerji A.S. and Zorlu Enerji  Source text for Eikon:  Further company coverage:",
        "date": "08112016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar 160MW of module contracts in Turkey "
    },
    {
        "content": "First Solar Inc   the largest U.S. solar equipment manufacturer  on Wednesday dismissed concern about slowing growth in the industry  and posted quarterly profit and sales beat analysts' estimates due to higher demand.",
        "date": "08032016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "First Solar sees 'encouraging signs' for solar demand "
    },
    {
        "content": "Aug 3 First Solar Inc  the largest U.S. solar equipment manufacturer  on Wednesday dismissed concern about slowing growth in the industry  and posted quarterly profit and sales beat analysts' estimates due to higher demand.",
        "date": "08032016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 2-First Solar sees \"encouraging signs\" for solar demand "
    },
    {
        "content": "Aug 3 First Solar Inc posted a 86 percent drop in quarterly profit due to a restructuring charge of $86 million  primarily related to the decision to end production of the TetraSun crystalline silicon product.",
        "date": "08032016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar's profit falls 86 pct due to restructuring charge "
    },
    {
        "content": "* Co  D. E. Shaw renewable investments announced acquisition by Desri affiliate of 11 MW Acrancho Seco solar project",
        "date": "08032016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "BRIEF-D. E. Shaw Renewable Investments acquires Rancho Seco solar project from First Solar "
    },
    {
        "content": "* First Solar shifts malaysian production capacity to series 5 assembly",
        "date": "07052016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar shifts Malaysian production capacity to series 5 assembly "
    },
    {
        "content": "* First solar names Georges Antoun as chief commercial officer  Source text for Eikon:  Further company coverage:",
        "date": "05092016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First Solar names Georges Antoun chief commercial officer "
    },
    {
        "content": "* First solar  inc. Announces first quarter 2016 financial results",
        "date": "04272016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "BRIEF-First solar Q1 sales $848 million "
    },
    {
        "content": "* \"Our Q1 fleet average efficiency continued to improve  climbing to 16.2%\" - conf call   Further company coverage:    (Bengaluru newsroom)",
        "date": "04272016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "BRIEF-First solar CEO says Q1 fleet average efficiency climbs to 16.2 pct - conf call "
    },
    {
        "content": "Solar panel maker First Solar Inc reported its first revenue miss in four quarters  sending its shares down as much as 9 percent in after-market trading.",
        "date": "04272016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar stock slips after first revenue miss in four quarters "
    },
    {
        "content": "April 27 Solar panel maker First Solar Inc  reported its first revenue miss in four quarters  sending its shares down as much as 9 percent in after-market trading.",
        "date": "04272016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 1-First Solar stock slips after first revenue miss in four qtrs "
    },
    {
        "content": "April 27 Solar panel maker First Solar Inc  posted a quarterly profit  compared with a year-earlier loss  helped by higher revenue from the sale of a large California solar power plant to Southern Co.",
        "date": "04272016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar posts quarterly profit; appoints new CEO "
    },
    {
        "content": "Feb 23 Solar panel maker First Solar Inc  reported its third quarterly revenue beat in a row  sending its shares up 4.4 percent in after-hours trading.",
        "date": "02232016",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "UPDATE 1-First Solar's quarterly revenue beats estimates "
    },
    {
        "content": "Feb 23 Solar panel maker First Solar Inc  reported a 6.5 percent fall in quarterly sales in a historically slower quarter for solar companies.",
        "date": "02232016",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar's quarterly sales fall 6.5 pct "
    },
    {
        "content": "* Dow flat  S&P up 0.4 percent  Nasdaq up 0.8 percent   (Updates to early afternoon)",
        "date": "08052015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "US STOCKS-Tech leads Nasdaq  S&P 500; Disney sparks media selloff "
    },
    {
        "content": "First Solar Inc  on Tuesday reported sharply higher quarterly sales and earnings and said results for the year would top Wall Street estimates  sending its shares up 8.5 percent.",
        "date": "08042015",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "First Solar rallies as earnings  sales forecast top estimates "
    },
    {
        "content": "Aug 4 First Solar Inc on Tuesday reported sharply higher quarterly sales and earnings and said results for the year would top Wall Street estimates  sending its shares up 8.5 percent.",
        "date": "08042015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 1-First Solar rallies as earnings  sales forecast top estimates "
    },
    {
        "content": "Aug 4 U.S. solar company First Solar Inc  on Tuesday reported sharply higher quarterly sales and earnings due to increased revenue from a large project in Nevada and the sale of majority stakes in two others in California.",
        "date": "08042015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar 2nd-quarter earnings rise sharply "
    },
    {
        "content": "BANGKOK  June 16 Thailand's property developer Sena Development PCL signed a partnership deal with U.S.-based First Solar and private equity firm Confidence Capital to develop a solar rooftop business in Thailand  it said on Tuesday.",
        "date": "06162015",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "First Solar to supply solar rooftops to Thai developer Sena "
    },
    {
        "content": "June 10 8point3 Energy Partners LP  formed by solar companies First Solar Inc and SunPower Corp   said it expects its initial public offering to be priced between $19 and $21 per share.",
        "date": "06102015",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "UPDATE 1-8point3 Energy Partners expects IPO to be priced at $19-$21/share "
    },
    {
        "content": "June 10 8point3 Energy Partners LP  formed by solar companies First Solar Inc and SunPower Corp   said it expects its initial public offering to be priced between $19 and $21 per share.",
        "date": "06102015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "8point3 Energy Partners expects IPO to be priced at $19-$21/share "
    },
    {
        "content": "Solar panel makers SunPower Corp  and First Solar Inc  reported a quarterly loss  compared with a year-earlier profit  as they sold fewer power plants ahead of a spinoff of some of their assets into a joint public entity.",
        "date": "04302015",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "SunPower  First Solar post loss ahead of spinoff of some plants "
    },
    {
        "content": "April 30 Solar panel makers SunPower Corp  and First Solar Inc reported a quarterly loss  compared with a year-earlier profit  as they sold fewer power plants ahead of a spinoff of some of their assets into a joint public entity.",
        "date": "04302015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 1-SunPower  First Solar post loss ahead of spinoff of some plants "
    },
    {
        "content": "April 30 U.S. solar panel maker First Solar Inc  reported a quarterly loss  compared with a year-earlier profit  as it sold fewer power plants.",
        "date": "04302015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "Solar panel maker First Solar reports quarterly loss "
    },
    {
        "content": "Feb 23 First Solar Inc and SunPower Corp said they were in advanced talks to form a joint venture  which will hold some of their solar power-generating assets.",
        "date": "02232015",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "UPDATE 1-First Solar  SunPower in talks for solar power plants JV "
    },
    {
        "content": "Feb 23 First Solar Inc and SunPower Corp said they were in advanced talks to form a joint venture  which will hold some of their power-generating assets.",
        "date": "02232015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar  SunPower in talks to form JV for power-generating assets "
    },
    {
        "content": "U.S. solar company First Solar Inc  on Tuesday reported sharply higher quarterly earnings in part due to the sale of a large California solar power plant to Southern Co .",
        "date": "02242015",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "First Solar sees lower results as it pursues spin off "
    },
    {
        "content": "Feb 24 U.S. solar company First Solar Inc  on Tuesday reported sharply higher quarterly earnings in part due to the sale of a large California solar power plant to Southern Co.",
        "date": "02242015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 1-First Solar sees lower results as it pursues spin off "
    },
    {
        "content": "Feb 24 U.S. solar company First Solar Inc  on Tuesday reported sharply higher quarterly earnings in part due to the sale of a large California solar power plant to Southern Co.",
        "date": "02242015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "First Solar fourth-quarter profit jumps on power plant sale "
    },
    {
        "content": "* Shares of other solar companies also up   (Adds details from conference call  background  analyst quote)",
        "date": "02242015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 2-SunPower  First Solar JV talks boosts solar sector "
    },
    {
        "content": "SAN FRANCISCO  Feb 10 Apple Inc Chief Executive Tim Cook said on Tuesday the technology company is investing $850 million to build a solar farm in California with solar panel maker First Solar.",
        "date": "02102015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "Apple investing $850 million in California solar farm "
    },
    {
        "content": "SAN FRANCISCO  Feb 10 Apple Inc Chief Executive Tim Cook said on Tuesday the technology company is investing $850 million to help build a solar farm in California with solar panel maker First Solar.",
        "date": "02102015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 2-Apple investing $850 million in California solar farm "
    },
    {
        "content": "NEW DELHI India will struggle to hit its \"hugely ambitious\" renewable energy target if it fails to make more land available for plants and ensure utilities have the means to buy in clean energy  the head of U.S.-based First Solar said on Sunday.",
        "date": "02152015",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "Land  finance key to India renewables drive: First Solar CEO "
    },
    {
        "content": "SAN FRANCISCO  Feb 10 Apple Inc will buy about $850 million of power from a new California solar farm to cut its energy bill  the iPhone maker said on Tuesday as its stock market value closed above $700 billion for the first time.",
        "date": "02112015",
        "name": "First Solar Inc",
        "news_type": "topStory",
        "symbol": "FSLR",
        "title": "UPDATE 3-Apple in big solar power deal  market cap closes over $700 bln "
    },
    {
        "content": "Feb 11 Apple Inc's deal to buy nearly $1 billion of power from a massive First Solar Inc  plant could be the first of a stampede of contracts driven by the looming change in a solar tax incentive that makes such projects particularly attractive.",
        "date": "02122015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "Apple deal  tax change could spark corporate solar stampede "
    },
    {
        "content": "BOSTON  Jan 21 One of Fidelity Investments top stock pickers said he remains positive on solar power despite a drop in oil prices that hurt shares of First Solar Inc  and dragged on his own portfolio's performance.",
        "date": "01212015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "Fidelity's Wymer says oil plunge does not cloud solar bet "
    },
    {
        "content": "BOSTON  Jan 21 One of Fidelity Investments' top stock pickers said on Wednesday that he remains positive on solar power despite a drop in oil prices that hurt shares of First Solar Inc and dragged on his portfolio's performance.",
        "date": "01212015",
        "name": "First Solar Inc",
        "news_type": "normal",
        "symbol": "FSLR",
        "title": "UPDATE 1-Fidelity's Wymer says oil plunge does not cloud solar bet "
    }
]