[
    {
        "content": "* Awarded a subsea contract by Murphy Sabah Oil for the Phase 1A Block H Gas Development Project",
        "date": "11032017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC wins subsea contract with Murphy Sabah Oil in offshore Sabah  Malaysia "
    },
    {
        "content": "* FOR FY EXPECTS ONSHORE/OFFSHORE EBITDA MARGIN OF AT LEAST 9.5% (EXCLUDING. CHARGES  CREDITS) VERSUS PRIOR GUIDANCE OF AT LEAST 8% ‍​",
        "date": "10262017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC Q3 net income of $121 million ‍​ "
    },
    {
        "content": "* TechnipFMC Plc - ‍excluding charges and credits of $0.13 per share  adjusted diluted earnings per share of $0.39​ for quarter",
        "date": "10252017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC reports quarterly ‍diluted earnings per share of $0.26​ "
    },
    {
        "content": "* To acquire Plexus’s Wellhead exploration equipment and services business",
        "date": "10192017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC to buy Plexus’ exploration wellhead business "
    },
    {
        "content": "* PRESS RELEASE TECHNIPFMC AWARDED EPCI CONTRACT FOR THE STATOIL PEREGRINO PHASE II PROJECT IN BRAZIL Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "09282017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC awarded EPCI contract for the Statoil Peregrino Phase II project in Brazil "
    },
    {
        "content": "* Announces implementation of share repurchase program on the New York Stock Exchange and Euronext Paris",
        "date": "09262017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC announces share buyback programme "
    },
    {
        "content": "* TechnipFMC announces implementation of share repurchase program",
        "date": "09262017",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC announces implementation of share repurchase program "
    },
    {
        "content": "* TechnipFMC Plc -  on September 14 co units entered into new commercial paper dealer agreements - SEC filing",
        "date": "09202017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC - units enter new commercial paper dealer agreements "
    },
    {
        "content": "* Press release TechnipFMC awarded integrated EPCI contract for the Hurricane Lancaster EPS project West of Shetland",
        "date": "09142017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC awarded integrated EPCI contract for the Hurricane Lancaster EPS project west of Shetland "
    },
    {
        "content": "* Awarded EPCI (engineering  procurement  construction & installation) contract for the Husky Energy West White Rose project in Canada",
        "date": "08292017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC awarded EPCI contract for Husky Energy West White Rose project in Canada "
    },
    {
        "content": "KHOBAR  Saudi Arabia  Aug 22 State-run Bahrain Petroleum Co (Bapco) will meet a consortium led by France's Technip for further talks over the planned expansion of Bahrain's only oil refinery  sources close to the matter told Reuters.",
        "date": "08222017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "Bahrain's Bapco to meet Technip-led consortium for talks on refinery expansion "
    },
    {
        "content": "RIO DE JANEIRO Petróleo Brasileiro SA is in talks to amend terms of a contract on pipeline connections supplied by TechnipFMC Plc to ensure smooth exploration and production activities at the Brazilian oil company's most promising offshore development  a spokeswoman said on Friday.",
        "date": "06232017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "Exclusive: Petrobras to amend pre-salt riser contract with TechnipFMC "
    },
    {
        "content": "* TECHNIPFMC AWARDED INTEGRATED EPCI CONTRACT FOR THE STATOIL VISUND NORD IOR PROJECT",
        "date": "06132017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TECHNIPFMC AWARDED INTEGRATED EPCI CONTRACT FOR THE STATOIL VISUND NORD IOR PROJECT "
    },
    {
        "content": "* TechnipFMC has entered into a three-year frame agreement with Woodside Energy Ltd in Australia for Riserless Light Well Intervention (RLWI) and subsea services  including intervention  installation  and plug and abandonment services",
        "date": "06072017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC awarded a well intervention contract in Australia "
    },
    {
        "content": "* Sonatrach and TechnipFMC announce that the dispute related to the rehabilitation of the refinery in algiers has been definitively settled Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-Sonatrach and TechnipFMC announce that the dispute related to rehabilitation of the refinery in Algiers has been settled "
    },
    {
        "content": "* Press release TechnipFMC awarded a major integrated contract for the coral south flng project offshore Mozambique",
        "date": "06012017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC awarded a contract for the coral south FLNG project offshore Mozambique "
    },
    {
        "content": "* Bpifrance Participations SA reports 5.3 percent stake in TechnipFMC Plc as of May 18  2017 - sec filing Source text (http://bit.ly/2qxvAHC) Further company coverage:",
        "date": "05302017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-BpiFrance participations SA reports 5.3 pct stake in TechnipFMC as of May 18  2017 "
    },
    {
        "content": "COPENHAGEN  May 4 DONG Energy said it has reached a settlement with Daewoo Shipbuilding & Marine Engineering and Technip over who bears responsibility for construction errors concerning an offshore platform for the idled Hejre field.",
        "date": "05042017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "DONG Energy settles platform dispute  clears hurdle for oil unit sale "
    },
    {
        "content": "* Dong Energy and supplier consortium of Technip France and Daewoo Shipbuilding and Marine Engineering Co. Ltd (DSME) have entered into a settlement agreement regarding dispute  including arbitral claims  related to EPC contract for the Hejre platform",
        "date": "05042017",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "BRIEF-DONG Energy settles dispute with Technip and Daewoo over Hejre platform "
    },
    {
        "content": "* TechnipFMC awarded an integrated project for supply and installation of subsea equipment",
        "date": "03272017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC awarded contract by Shell Offshore Inc "
    },
    {
        "content": "* TechnipFMC Plc -  pursuant to exchange offers  issued approximately  $215.4 million in aggregate principal amount of new 2017 notes",
        "date": "03302017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC issues about $215.4 mln in aggregate principal amount "
    },
    {
        "content": "* Awarded a contract by Eni Ghana E&P Limited (a subsidiary of Eni  GNPC and Vitol)  for onshore part of OCTP development of Sankofa field",
        "date": "03212017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC awarded an onshore contract in Ghana "
    },
    {
        "content": "* Greece's Energean said on Thursday it signed a deal with oil and gas firm TechnipFMC  to help develop Israeli offshore gas fields Karish and Tanin.",
        "date": "02022017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "Energean choses TechnipFMC to help develop Israeli gas fields "
    },
    {
        "content": "* Technip and FMC Technologies  Inc announced on Friday TechnipFMC secures AMF Approval of its prospectus for listing its shares on Euronext Paris",
        "date": "01162017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-TechnipFMC secures AMF approval of its prospectus for listing its shares on Euronext Paris "
    },
    {
        "content": "* Fmc technologies - on jan 12 co and technip eurocash snc entered into a new $2.5 billion senior unsecured revolving credit facility agreement - sec filing",
        "date": "01132017",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies  Technip Eurocash SNC entered into new $2.5 bln senior unsecured revolving credit facility agreement - on Jan. 12 "
    },
    {
        "content": "* Technip S.A. contacted by U.S. DOJ  notably regarding offshore platform projects awarded between 2003 and 2007 performed in Brazil by a JV",
        "date": "11292016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies  Technip S.A. contacted by U.S. DOJ regarding offshore platform projects "
    },
    {
        "content": "* Technip and FMC Technologies announce designees to board of directors of combined company",
        "date": "11242016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-Technip  FMC announce designees to board of directors of combined company "
    },
    {
        "content": "* FMC Technologies and Technip announce EU antitrust clearance",
        "date": "11232016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies and Technip announce EU antitrust clearance "
    },
    {
        "content": "* Emerson expands global flow solutions capabilities with acquisition of blending & transfer systems business of FMC technologies",
        "date": "11082016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-Emerson to acquire blending & transfer systems business of FMC Technologies "
    },
    {
        "content": "* Statoil awards Trestakk contracts to FMC Technologies  Technip and Aker Solutions",
        "date": "11042016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-Statoil awards Trestakk contracts to FMC Technologies  Technip and Aker Solutions "
    },
    {
        "content": "* FMC Technologies and Technip alliance received a  integrated engineering  procurement  construction  and installation (EPCI) contract from Statoil for its Trestakk field in Norwegian Sea  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "11042016",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies and Technip alliance receives EPCI contract from Statoil for its Trestakk field in Norwegian Sea "
    },
    {
        "content": "* Technip's CEO Thierry Pilenko says he expected to sign at least one additional project in alliance with FMC Technologies  this year  after the companies recorded a first project  the track development of the Lancaster field in the North Sea.",
        "date": "10272016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-Technip expects another project with FMC this year -CEO "
    },
    {
        "content": "WASHINGTON Energy technology company FMC Technologies Inc will pay a $2.5 million penalty to settle charges that it overstated profits in one of its business segments  the U.S. Securities and Exchange Commission said on Thursday.",
        "date": "10202016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "FMC Technologies to pay $2.5 mln for accounting violations -SEC "
    },
    {
        "content": "* FMC Technologies reports third quarter 2016 diluted earnings per share from continuing operations of $0.20; excluding charges  adjusted diluted earnings per share from continuing operations of $0.35",
        "date": "10192016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies Q3 revenue $1.1 bln "
    },
    {
        "content": "WASHINGTON Energy technology company FMC Technologies Inc will pay a $2.5 million penalty to settle charges that it overstated profits in one of its business segments  the U.S. Securities and Exchange Commission said on Thursday.",
        "date": "10202016",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "FMC Technologies to pay $2.5 million for accounting violations: SEC "
    },
    {
        "content": "WASHINGTON  Oct 20 Energy technology company FMC Technologies Inc will pay a $2.5 million penalty to settle charges that it overstated profits in one of its business segments  the U.S. Securities and Exchange Commission said on Thursday.",
        "date": "10202016",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "UPDATE 1-FMC Technologies to pay $2.5 mln for accounting violations -SEC "
    },
    {
        "content": "WASHINGTON  Oct 20 Houston-based technology solutions company FMC Technologies Inc will pay a $2.5 million penalty to settle charges that it overstated profits in one of its business segments  U.S. regulators said.",
        "date": "10202016",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "FMC Technologies to pay $2.5 mln over overstating profits -U.S. SEC "
    },
    {
        "content": "* Thierry Pilenko says merger with FMC Technologies could be concluded at the start of 2017",
        "date": "10202016",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "BRIEF-Technip-FMC merger could be concluded at the start of 2017 - CEO "
    },
    {
        "content": "* Says on September 30  board of directors of company increased size of board from 11 to 12  Source text for Eikon:  Further company coverage:",
        "date": "09302016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies board increases size of board from 11 to 12 "
    },
    {
        "content": "* Qtrly backlog for company was $3.4 billion  including subsea technologies backlog of $2.9 billion",
        "date": "07202016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies Q2 earnings per share $0.01 "
    },
    {
        "content": "* FMC Technologies and Technip announce successful early conclusion of U.S. antitrust review",
        "date": "06272016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies and Technip announce early conclusion of U.S. antitrust review "
    },
    {
        "content": "PARIS  June 24 French oil services company Technip said on Friday  there was no reason for Britain's exit from the European Union to impact its merger with FMC Technologies  including plans for London to be the legal headquarters of the new group.",
        "date": "06242016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "Technip says London still natural HQ of TechnipFMC despite Brexit vote "
    },
    {
        "content": "* On June 14  co and Technip S.A entered into a definitive business combination agreement",
        "date": "06162016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies  Technip S.A enter merger agreement "
    },
    {
        "content": "PARIS France's Technip on Thursday announced an all-stock merger with U.S. rival FMC Technologies  as it seeks to offset weaker spending on exploration and production by cash-strapped oil companies.",
        "date": "05192016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "Technip  FMC target oil services 'big league' with merger deal "
    },
    {
        "content": "* French govt to remain long-term investor - source   (Adds analyst  shares  French government source)",
        "date": "05192016",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "UPDATE 1-Technip  FMC target oil services 'big league' with merger deal "
    },
    {
        "content": "PARIS  May 19 France's Technip  announced an all-stock merger with U.S. rival FMC Technologies  to create an oil services group with combined revenue of $20 billion.",
        "date": "05192016",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "Technip  FMC Technologies to merge in all-stock deal "
    },
    {
        "content": "* Combined company  which will be called TechnipFMC  would have an equity value of $13 billion based on pre-announcement share prices",
        "date": "05192016",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies and Technip to combine to form TechnipFMC "
    },
    {
        "content": "* All-Stock transaction: Technip shareholders to receive 2.0 shares of combined company for each share of Technip",
        "date": "05192016",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies and Technip to combine in TechnipFMC "
    },
    {
        "content": "* Acquisition agreement where co will acquire assets within FMC Technologies  Inc.'s wireline services business in canada us",
        "date": "05112016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-Reliance Oilfield to buy some FMC Technologies' wireline assets "
    },
    {
        "content": "* Says Douglas J. Pferdehirt will succeed John T. Gremp as CEO",
        "date": "05092016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies appoints Douglas Pferdehirt as CEO "
    },
    {
        "content": "* Fmc technologies reports first quarter 2016 diluted earnings per share of $0.22  excluding $0.13 of charges",
        "date": "04262016",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies Q1 EPS $0.22 excluding items "
    },
    {
        "content": "Dec 10 The following bids  mergers  acquisitions and disposals were reported by 1500 GMT on Thursday:",
        "date": "12102015",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "French oilfield services company Technip  is exploring a sale and has held talks with U.S. peer FMC Technologies Inc  about a potential combination  according to people familiar with the matter on Wednesday.",
        "date": "12092015",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "Technip explores sale  has held talks with FMC Technologies: sources "
    },
    {
        "content": "PARIS  Dec 9 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "12102015",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "French and Benelux stocks-Factors to watch on Dec 10 "
    },
    {
        "content": "Dec 9 French oilfield services company Technip  is exploring a sale and has held talks with U.S. peer FMC Technologies Inc about a potential combination  according to people familiar with the matter on Wednesday.",
        "date": "12092015",
        "name": "TechnipFMC plc",
        "news_type": "normal",
        "symbol": "FTI",
        "title": "UPDATE 1-Technip explores sale  has held talks with FMC Technologies -sources "
    },
    {
        "content": "* The contract involves establishment of a new and cost efficient standard for subsea equipment",
        "date": "09182015",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-FMC Technologies wins $160 mln Statoil contract "
    },
    {
        "content": "* Parties closed transaction making Forsys Subsea  a 50/50 joint venture  operational on June 1",
        "date": "06022015",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-Technip and FMC Technologies JV to be operational as of June 1 "
    },
    {
        "content": "* Announced on Sunday it signed an agreement with FMC Technologies Inc to form an exclusive alliance and to launch Forsys Subsea",
        "date": "03232015",
        "name": "TechnipFMC plc",
        "news_type": "topStory",
        "symbol": "FTI",
        "title": "BRIEF-Technip and FMC Technologies to launch Forsys Subsea joint venture "
    }
]