[
    {
        "content": "SAO PAULO  Nov 8 Brazilian steelmaker Gerdau SA still aims to invest around 1.3 billion reais ($400 million) this year  Chief Executive André Gerdau Johannpeter said on Wednesday  suggesting a surge in fourth-quarter capital spending.",
        "date": "11082017",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil steelmaker Gerdau holds 2017 investment target "
    },
    {
        "content": "BRASILIA Brazilian steelmaker Gerdau SA  could raise about 2 billion reais ($630.48 million) with the potential sale of its rebar-producing facilities in the United States this year  newspaper Valor Econômico reported on Tuesday.",
        "date": "10172017",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil's Gerdau may sell U.S. facilities for $630 million: report "
    },
    {
        "content": "BRASILIA  Oct 17 Brazilian steelmaker Gerdau SA could raise about 2 billion reais ($630.48 million) with the potential sale of its rebar-producing facilities in the United States this year  newspaper Valor Econômico reported on Tuesday.",
        "date": "10172017",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "UPDATE 1-Brazil's Gerdau may sell U.S. facilities for $630 mln -report "
    },
    {
        "content": "BRASILIA  Oct 17 Brazilian steelmaker Gerdau SA could raise about 2 billion reais ($630.48 million) with the potential sale of rebar-producing facilities in the United States this year  newspaper Valor Econômico reported on Tuesday.",
        "date": "10172017",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Gerdau mulls raising $630 mln with U.S. deal -report "
    },
    {
        "content": "SAO PAULO  Oct 4 Gerdau SA has agreed to sell a Chilean long steel unit to local firms Matco SA and Ingeniería & Inversiones SA for about $154 million  in a move aimed at helping the largest steelmaker in the Americas cut debt and boost profitability.",
        "date": "10042017",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "UPDATE 1-Gerdau to sell Chilean unit to Matco  I&I for $154 mln "
    },
    {
        "content": "SAO PAULO  Oct 4 Gerdau SA has agreed to sell a Chilean long steel unit to local players Matco Armacero SA and Ingeniería & Inversiones SA for about $154 million  in a move aimed at helping the largest steelmaker in the Americas cut debt and boost profitability.",
        "date": "10042017",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Gerdau to sell Chilean unit to Matco  I&I for $154 mln "
    },
    {
        "content": "SAO PAULO  Aug 24 Gerdau SA  a Brazilian steelmaker  has appointed Gustavo Werneck da Cunha as the company's new chief executive officer effective from Jan. 1  2018  according to a securities filing on Thursday.",
        "date": "08242017",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil's Gerdau appoints new CEO as controlling family leaves management "
    },
    {
        "content": "SAO PAULO An explosion at a Brazilian steel plant operated by Gerdau SA killed two people and injured 10 others on Tuesday  the company and local metalworkers union said.",
        "date": "08152017",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Explosion kills two at Gerdau steel plant in Brazil "
    },
    {
        "content": "SAO PAULO  Aug 9 Brazilian steelmaker Gerdau SA is maintaining its capital spending target this year and aims to invest about as much in 2018  when an economic recovery should spur more construction  the company's chief executive said on Wednesday.",
        "date": "08092017",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "UPDATE 1-Steelmaker Gerdau CEO expects 2018 Brazil recovery to boost building "
    },
    {
        "content": "SAO PAULO  Aug 9 Brazilian steelmaker Gerdau SA reported a net profit of 76.5 million reais ($24.5 million) in the second quarter  3 percent below a net profit of 79 million reais a year earlier  according to a securities filing on Wednesday.",
        "date": "08092017",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Gerdau posts small slide in second-quarter profit "
    },
    {
        "content": "SAO PAULO  May 4 Gerdau SA  the largest steelmaker in the Americas  swung to an unexpected first-quarter loss on Thursday  reflecting declining revenue and the impact of a recent Brazilian ruling on the booking of contingent liabilities.",
        "date": "05042017",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "UPDATE 1-Brazil's Gerdau posts unexpected loss as revenue falls 16 pct "
    },
    {
        "content": "SAO PAULO  May 4 Gerdau SA  the largest steelmaker in the Americas  posted a surprising first-quarter loss on Thursday  reflecting declining revenue and the impact of a recent Brazil ruling on the booking of contingent liabilities.",
        "date": "05042017",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Gerdau posts unexpected loss as revenue slips "
    },
    {
        "content": "SAO PAULO  March 29 Gerdau SA  the largest steelmaker in the Americas  has agreed to create a long steel joint venture in Colombia with Putney Capital Management amid efforts to cut debt and boost returns.",
        "date": "03292017",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Steelmaker Gerdau creates Colombian joint venture with Putney "
    },
    {
        "content": "SAO PAULO  March 22 Shareholders of Brazilian steelmaker Gerdau SA will have the chance to swap each of their common shares for a preferred share of the company  holding company Metalurgica Gerdau SA confirmed in a Wednesday securities filing.   (Reporting by Brad Haynes and Guillermo Parra-Bernal; Editing by Bill Rigby)",
        "date": "03222017",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil's Gerdau sets terms of common-to-preferred share swap "
    },
    {
        "content": "* Brazil's Gerdau CEO André B. Gerdau Johannpeter says on conference call for Q4 results that perspective for 2017 remains challenging  but expects gradual recovery of steel demand during the year",
        "date": "02222017",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "BRIEF-Brazil's Gerdau expects gradual recovery of steel demand in 2017 "
    },
    {
        "content": "BRASILIA  Feb 22 Brazilian steelmaker Gerdau SA  reported on Wednesday a net loss of 3.1 billion reais ($1.00 billion) in the fourth quarter  due to impairments and lower steel sales.",
        "date": "02222017",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "UPDATE 1-Brazil's Gerdau posts Q4 net loss of 3.1 bln reais "
    },
    {
        "content": "BRASILIA  Feb 22 Brazilian steelmaker Gerdau SA  reported on Wednesday a net loss of 3.1 billion reais ($1.00 billion) in the fourth quarter  due in large part to impairments and currency fluctuations.",
        "date": "02222017",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Gerdau posts Q4 net loss of 3.1 bln reais "
    },
    {
        "content": "SAO PAULO Brazilian steelmaker Gerdau SA  said on Wednesday that promised infrastructure spending by U.S. President-elect Donald Trump's government could support the steel sector  as it posted results showing a return to profit in the third quarter.",
        "date": "11092016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil's Gerdau says Trump infrastructure plan may boost steel "
    },
    {
        "content": "* Brazilian steelmaker Gerdau says increase in coal costs will have an impact on its results from 2017",
        "date": "11092016",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "BRIEF-Brazil's Gerdau says coal costs to impact results from 2017 "
    },
    {
        "content": "* Gerdau says non-traditional flat-steel output gaining clients",
        "date": "09152016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Gerdau bets on new Brazil line  exports  data to ease steel slump "
    },
    {
        "content": "* Brazilian steelmaker Gerdau SA said it is seeing some signs of a recovery in Brazilian steel demand",
        "date": "08102016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "BRIEF-Brazilian steelmaker Gerdau hopes reduce leverage by end of year "
    },
    {
        "content": "SAO PAULO  Aug 9 Brazilian steelmaker Gerdau SA  plans to buy back 10 million preferred shares or American Depository Receipts from Aug. 11  the company said in a filing published on Tuesday.",
        "date": "08092016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil's Gerdau plans 10 mln preferred share buyback "
    },
    {
        "content": "RIO DE JANEIRO  Aug 10 Brazilian steelmaker Gerdau SA reported on Wednesday net profit for the second quarter of 184 million reais ($59 million)  down 30.6 percent on the same quarter last year.",
        "date": "08102016",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil steelmaker Gerdau posts Q2 net profit of 184 mln reais "
    },
    {
        "content": "BRASÍLIA  July 13 Brazil's tax auditing court CARF ruled against steelmaker Gerdau SA on Wednesday in four cases where the company was questioning charges estimated at 4 billion reais ($1.2 billion).",
        "date": "07132016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil's tax court rules against Gerdau; shares fall "
    },
    {
        "content": "SAO PAULO  June 9 Brazilian steelmaker Gerdau SA  said in a securities filing on Thursday it has not yet been notified of investors' lawsuits filed in the United States.",
        "date": "06092016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil's Gerdau says not been notified of U.S. investors lawsuit "
    },
    {
        "content": "SAO PAULO New York investor rights law firm Pomerantz LLP filed a class action suit against Brazil's Gerdau SA  Latin America's largest steelmaker  alleging the company issued materially misleading business information filed to investors over tax liabilities.",
        "date": "05262016",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "U.S. firm files class action against Brazil steelmaker Gerdau "
    },
    {
        "content": "SAO PAULO  May 26 New York investor rights law firm Pomerantz LLP filed a class action suit against Brazil's Gerdau SA  Latin America's largest steelmaker  alleging the company issued materially misleading business information filed to investors over tax liabilities.",
        "date": "05262016",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "CORRECTED-U.S. firm files class action against Brazil steelmaker Gerdau "
    },
    {
        "content": "SAO PAULO  May 20 Brazilian steelmaker Gerdau SA  said on Friday it sealed a deal to sell its specialty steel unit in Spain to Clerbil SL for 155 million euros  with a potential of receiving an additional 45 million euros depending on future performance.",
        "date": "05202016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil's Gerdau says selling specialty steel unit in Spain "
    },
    {
        "content": "* Brazilian steelmaker Gerdau SA said on a conference call to discuss first quarter results that it sees opportunities to raise steel prices in Brazil and other countries due to the rise in commodity prices",
        "date": "05042016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "BRIEF-Brazil steelmaker Gerdau sees chance to raise steel prices "
    },
    {
        "content": "RIO DE JANEIRO  May 4 Brazilian steelmaker Gerdau SA reported on Wednesday a first quarter net profit of 14 million reais ($3.9 million)  creeping into the black in the midst of the country's deepest recession in decades and a slump in steel demand.",
        "date": "05042016",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil steelmaker Gerdau posts Q1 profit of 14 mln reais "
    },
    {
        "content": "BRASILIA/SAO PAULO  March 31 Brazilian prosecutors on Thursday charged Joseph Safra  the world's richest banker  in connection with an alleged scheme to pay bribes to government officials in return for waiving tax debts.",
        "date": "03312016",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "UPDATE 2-Brazil prosecutors charge billionaire Safra in bribery scheme "
    },
    {
        "content": "* Brazil's Gerdau says has not made financial provisions for police probe into alleged tax avoidance",
        "date": "03152016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "BRIEF-Gerdau sees 6-8 pct fall in Brazil steel demand in 2016 "
    },
    {
        "content": "RIO DE JANEIRO  March 15 Brazil's largest steelmaker Gerdau SA reported on Tuesday a non-adjusted net loss of 3.17 billion reais ($854 million) in the fourth quarter  driven by a steep recession in its domestic market and writedowns across its businesses.",
        "date": "03152016",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "UPDATE 1-Brazil's Gerdau posts 4th-qtr loss of 3.17 bln reais "
    },
    {
        "content": "RIO DE JANEIRO  March 15 Brazilian steelmaker Gerdau SA reported on Tuesday a non-adjusted net loss of 3.17 billion reais ($854 million) in the fourth quarter  driven by a steep recession in its domestic market and writedowns across its businesses.      (Reporting by Stephen Eisenhammer)",
        "date": "03152016",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Gerdau posts 4th-qtr loss of 3.17 bln reais "
    },
    {
        "content": "SAO PAULO Federal police raided the offices of Brazilian steelmaker Gerdau SA on Thursday and summoned its chief executive to testify on suspicion the company evaded hundreds of millions of dollars in taxes.",
        "date": "02262016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Police raid Brazil steelmaker Gerdau  summon CEO to testify "
    },
    {
        "content": "SAO PAULO  Feb 25 Federal police raided the offices of Brazilian steelmaker Gerdau SA on Thursday and summoned its chief executive to testify on suspicion the company evaded hundreds of millions of dollars in taxes.",
        "date": "02262016",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "UPDATE 4-Police raid Brazil steelmaker Gerdau  summon CEO to testify "
    },
    {
        "content": "NEW YORK  Feb 5 (IFR) - Bonds issued by Brazil's Gerdau quickly gave back earlier gains on Friday after Moody's demoted the steel company to junk with a three-notch downgrade.",
        "date": "02052016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Gerdau bonds give back gains on Moody's junk rating "
    },
    {
        "content": "SAO PAULO  Feb 4 Gerdau SA  the largest steelmaker in the Americas  and JFE Steel Corp have agreed to produce heavy slabs in Brazil  a venture that will allow them to cater for clients in the region and reduce Brazilian imports of the product.",
        "date": "02042016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Gerdau  JFE Steel sign accord for heavy slab deal in Brazil "
    },
    {
        "content": "Jan 27 Brazilian steelmaker Gerdau SA  will form a joint venture with Japan's Sumitomo Corp  and Japan Steel Works Ltd (JSW) to compete in the wind power sector in Brazil  Gerdau said on Wednesday.",
        "date": "01272016",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil's Gerdau  Japan's Sumitomo  JSW form wind power joint venture "
    },
    {
        "content": "RIO DE JANEIRO  Oct 29 Brazil's Gerdau SA  posted the largest quarterly net loss in at least five years in the third quarter  after the largest steelmaker in the Americas booked a heavy asset writedown due to a challenging business outlook.",
        "date": "10292015",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "UPDATE 2-Brazil's Gerdau posts biggest loss in five years on writedown "
    },
    {
        "content": "Oct 29 Comments made on conference call with reporters:",
        "date": "10292015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "BRIEF-Brazil's Gerdau sees leverage lower in coming quarters "
    },
    {
        "content": "SAO PAULO  Oct 29 Metalúrgica Gerdau SA   the Brazilian investment holding company that controls steelmaking group Gerdau SA  could raise about 1.24 billion reais ($319 million) from investors in a private transaction to help repay debt.",
        "date": "10292015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "UPDATE 1-Brazil's Metalúrgica Gerdau could raise $319 mln in offering "
    },
    {
        "content": "SAO PAULO  Oct 29 Metalúrgica Gerdau SA  the investment holding company that controls Brazilian steelmaking group Gerdau SA  unveiled on Thursday a plan to sell 500 million shares in a private transaction.",
        "date": "10292015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Metalúrgica Gerdau aims to raise $319 mln in private offer "
    },
    {
        "content": "RIO DE JANEIRO  Oct 29 Brazilian steelmaker Gerdau SA posted a net loss of 1.96 billion reais ($502 million) for the third quarter on Thursday  far from analyst forecasts that the company would break even.",
        "date": "10292015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Gerdau posts net loss of 2 bln reais  misses forecasts "
    },
    {
        "content": "RIO DE JANEIRO  Oct 21 The board of directors of Gerdau SA  Latin America's largest steelmaker  approved a plan to borrow as much as $1 billion from international banks to finance working capital  the company said Wednesday in a Brazilian securities filing.",
        "date": "10212015",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Board of Brazil steelmaker Gerdau approves plan for $1 bln loan "
    },
    {
        "content": "SAO PAULO  Oct 1 Matalúrgica Gerdau SA  which controls Brazilian steelmaking group Gerdau SA  said on Thursday that consideration of a potential share offering is preliminary and has yet to be decided  responding to a newspaper report saying the plan could help fetch 1.5 billion reais ($380 million) from investors.",
        "date": "10012015",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "UPDATE 1-Brazil's Metalúrgica Gerdau considers potential offering "
    },
    {
        "content": "SAO PAULO  Oct 1 Matalúrgica Gerdau SA  the investment holding company that controls Brazilian steelmaking group Gerdau SA  is considering raising about 1.5 billion reais ($380 million) in a private stock offering to repay debt  Valor Econômico newspaper said on Thursday.",
        "date": "10012015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Metalúrgica Gerdau considers share sale  Valor says "
    },
    {
        "content": "SAO PAULO  Sept 24 Fernando Iunes  managing director at investment bank Itau BBA  has taken a seat on the board of Gerdau SA  the Brazilian steelmaker said in a statement on Thursday.",
        "date": "09242015",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Itau BBA's Iunes to take seat on Gerdau board "
    },
    {
        "content": "SAO PAULO  Sept 11 Workers at the Pindamonhangaba mill of Brazil's Gerdau SA  Latin America's largest steelmaker  approved an accord that will result in the layoff of 200 workers for five months as a Brazilian economic recession cuts steel demand.",
        "date": "09112015",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Brazil's Gerdau to lay off 200 workers at Pindamonhangaba steel mill "
    },
    {
        "content": "SAO PAULO  Aug 12 Brazilian steelmaker Gerdau SA  posted a sharp drop in second quarter net profit on Wednesday as sales fell in both its domestic and North American divisions and said it is eyeing possible future asset sales.",
        "date": "08122015",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "UPDATE 1-Brazil's Gerdau sees income drop by nearly a third as sales sink "
    },
    {
        "content": "SAO PAULO  Aug 12 Brazilian steelmaker Gerdau SA  is re-evaluating the profitability of its joint ventures for potential future asset sales  Chief Executive Andre Gerdau Johannpeter told analysts in a conference call on Wednesday.   (Reporting by Reese Ewing and Alberto Alerigi Jr; Editing by Alan Crosby)",
        "date": "08122015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Gerdau considers potential asset sales "
    },
    {
        "content": "SAO PAULO  Aug 12 Brazilian steelmaker Gerdau SA  posted a sharp drop in second quarter net profit on Wednesday as sales fell in both its domestic and North American divisions.",
        "date": "08122015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Gerdau sees income drop by nearly a third as sales sink "
    },
    {
        "content": "SAO PAULO  July 17 Gerdau SA  the largest steelmaker in the Americas  said on Friday that a plan to spend 1.986 billion reais ($621 billion) buying out four units in a broad reorganization program took place under adequate valuations and market conditions.",
        "date": "07172015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Gerdau says buyout of units taking place at adequate valuation "
    },
    {
        "content": "SAO PAULO Investors may be underestimating the benefits of a reorganization plan at Gerdau SA that could help the company  the largest steelmaker in the Americas  spin off its North American unit in a few years  an analyst at Banco Fator said on Wednesday.",
        "date": "07152015",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "Do not underestimate benefits of Gerdau reorganization plan  Fator says "
    },
    {
        "content": "SAO PAULO  July 14 Shares of Brazil's Gerdau SA  plunged the most in almost four months on Tuesday after the Americas' largest steelmaking group announced plans to spend 1.986 billion reais ($633 million) buying out four units as part of a broad reorganization program.",
        "date": "07142015",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "UPDATE 3-Shares of Gerdau sink as investors shun reorganization plan "
    },
    {
        "content": "SAO PAULO  July 14 Gerdau SA  the Americas' largest steelmaking group  announced on Tuesday a broad corporate reorganization that aims at taking better advantage of the firm's growing size in markets other than home turf Brazil amid weak demand and pricing for steel products.",
        "date": "07142015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Gerdau plans broad reorganization amid grim steel outlook "
    },
    {
        "content": "RIO DE JANEIRO  May 6 Brazil's steelmaker Gerdau SA on Wednesday posted a 39 percent drop in first quarter net profit as sales fell amid a likely recession in Latin America's largest economy.",
        "date": "05062015",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "UPDATE 1-Brazil Gerdau Q1 profit drops 39 pct as steel sales fall "
    },
    {
        "content": "RIO DE JANEIRO  May 6 Brazilian steelmaker Gerdau SA reported first quarter net profit of 267 million reais ($88 million) on Wednesday  a 39 percent drop from the same period a year earlier.",
        "date": "05062015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazilian steelmaker Gerdau reports 39 pct drop in Q1 profit "
    },
    {
        "content": "RIO DE JANEIRO  March 4 Brazilian steelmaker Gerdau SA on Wednesday posted quarterly earnings that beat economists' estimates  sending its shares rallying more than 4 percent on the Sao Paulo stock exchange.",
        "date": "03042015",
        "name": "Gerdau SA",
        "news_type": "topStory",
        "symbol": "GGB",
        "title": "UPDATE 1-Brazil's Gerdau beats Q4 profit estimates  shares jump "
    },
    {
        "content": "RIO DE JANEIRO  March 4 Brazilian steelmaker Gerdau SA reported fourth quarter net profit of 393 million reais ($134 million) on Wednesday  beating analyst forecasts.",
        "date": "03042015",
        "name": "Gerdau SA",
        "news_type": "normal",
        "symbol": "GGB",
        "title": "Brazil's Gerdau posts 20 pct drop in fourth-quarter profit "
    }
]