[
    {
        "content": "Brookfield Property Partners LP   one of the world's largest commercial real estate companies  on Monday made an unsolicited bid to buy the 66 percent stake in mall owner GGP Inc  it does not already own for $14.8 billion.",
        "date": "11132017",
        "name": "GGP Inc",
        "news_type": "topStory",
        "symbol": "GGP",
        "title": "Brookfield Property offers to buy rest of mall owner GGP for $14.8 billion "
    },
    {
        "content": "* Brookfield Property shares fall 5 pct (Adds Breakingviews link)",
        "date": "11132017",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "UPDATE 3-Brookfield Property offers to buy rest of mall owner GGP for $14.8 bln "
    },
    {
        "content": "Nov 13 The following bids  mergers  acquisitions and disposals were reported by 1500 GMT on Monday:",
        "date": "11132017",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* GGP Inc. Confirms receipt of unsolicited proposal from Brookfield Property Partners L.P.",
        "date": "11132017",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "BRIEF-GGP Inc Confirms receipt of unsolicited proposal from Brookfield Property Partners L.P. "
    },
    {
        "content": "Nov 13 Brookfield Property Partners LP said on Monday it offered to take full control of mall owner GGP Inc  valuing the company at $21.6 billion.",
        "date": "11132017",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "Brookfield Property Partners offers to buy rest of mall owner GGP "
    },
    {
        "content": "* Brookfield Property Partners L.P. proposes to acquire GGP Inc. For $23.00 per share in a combination of cash and BPY units",
        "date": "11132017",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "BRIEF-Brookfield Property proposes to acquire GGP Inc. "
    },
    {
        "content": "* Brookfield is holding preliminary talks about GGP takeover - CNBC citing Bloomberg Further company coverage:",
        "date": "11072017",
        "name": "GGP Inc",
        "news_type": "topStory",
        "symbol": "GGP",
        "title": "BRIEF-Brookfield is holding preliminary talks about GGP takeover - CNBC citing Bloomberg "
    },
    {
        "content": "* GGP reports third quarter 2017 results and declares fourth quarter dividend",
        "date": "10312017",
        "name": "GGP Inc",
        "news_type": "topStory",
        "symbol": "GGP",
        "title": "BRIEF-GGP reports Q3 earnings per share $0.23 and declares fourth quarter dividend "
    },
    {
        "content": "NEW YORK  Aug 2 For an industry under siege by e-commerce and searching for relief  mall owner GGP Inc's announcement earlier on Wednesday that it is shelving plans to explore asset sales hit the stock hard and underscored the struggles facing brick-and-mortar retailers.",
        "date": "08022017",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "U.S. retail REITs cannot find upside despite strong numbers "
    },
    {
        "content": "NEW YORK Shares of GGP Inc   a large owner of malls and regional shopping centers  fell sharply on Wednesday after the company said it would stay the course and not sell assets following a board review of all \"strategic alternatives\" announced in May.",
        "date": "08022017",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "Shares of mall owner GGP drop after halting strategic alternative plan "
    },
    {
        "content": "* GGP Inc sees full year net income per share attributable to GGP $0.58 to $0.62",
        "date": "08022017",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "BRIEF-GGP Inc Q2 EPS $0.13 "
    },
    {
        "content": "NEW YORK  June 7 The head of GGP Inc  one of the biggest high-quality U.S. mall property owners  sees the recent spate of U.S. department store closings as a chance to expand its redevelopment operations with plans to buy 100 of the shuttered emporiums.",
        "date": "06072017",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "Mall owner GGP doubles down on brick and mortar retailing "
    },
    {
        "content": "* GGP reports first quarter 2017 results and declares second quarter dividend",
        "date": "05012017",
        "name": "GGP Inc",
        "news_type": "topStory",
        "symbol": "GGP",
        "title": "BRIEF-GGP reports Q1 earnings per share $0.11 "
    },
    {
        "content": "* Ceo sandeep mathrani's fy 2016 total compensation was $12.75 million versus $39.25 million in fy 2015 - sec filing",
        "date": "03242017",
        "name": "GGP Inc",
        "news_type": "topStory",
        "symbol": "GGP",
        "title": "BRIEF-GGP CEO Sandeep Mathrani's FY 2016 compensation $12.75 mln vs $39.25 mln in FY 2015 "
    },
    {
        "content": "* General Growth Properties - on Jan. 2  court entered order dismissing action with prejudice as to Paul Pezzoli - SEC filing",
        "date": "01062017",
        "name": "GGP Inc",
        "news_type": "topStory",
        "symbol": "GGP",
        "title": "BRIEF-General Growth Properties says court entered order dismissing action with prejudice as to Paul Pezzoli - SEC filing "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 06 (Fitch) Fitch Ratings has affirmed the long-term Issuer  Default Rating (IDR) on Macy's  Inc. (Macy's) and Macy's Retail Holdings  Inc.  (MRHI) at 'BBB' and affirmed the short-term IDR at 'F2'. The Rating Outlook has  been revised to Negative from Stable. A full list of rating actions follows at  the end of this release. The Negative Outlook reflects Fitch's reduced confidence in Macy's ability to  stabilize compara",
        "date": "01062017",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "Fitch Affirms Macy's  Inc. at 'BBB'; Outlook Revised to Negative "
    },
    {
        "content": "SAO PAULO  Nov 25 Aliansce Shopping Centers SA is eyeing several acquisition targets across Brazil's mall industry as a way to fuel growth in the near term  although prices seem too stretched at this point  Chief Executive Officer Renato Rique said on Friday.",
        "date": "11252016",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "Brazil's Aliansce considering mall M&A  sees prices as high "
    },
    {
        "content": "* General Growth Properties Inc - Same store leased percentage was 96.7% at quarter end",
        "date": "10312016",
        "name": "GGP Inc",
        "news_type": "topStory",
        "symbol": "GGP",
        "title": "BRIEF-General Growth Properties Q3 earnings per share view $0.12 "
    },
    {
        "content": "* Expects to realize a gain of $32 million from store sales in Q3 of fiscal year 2016  Source text for Eikon:  Further company coverage:",
        "date": "10312016",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "BRIEF-Macy's sells five stores to General Growth Properties "
    },
    {
        "content": "* On april 25  certain subsidiaries amended company's $1.4 billion corporate loan - sec filing",
        "date": "04292016",
        "name": "GGP Inc",
        "news_type": "topStory",
        "symbol": "GGP",
        "title": "BRIEF-General Growth Properties says subsidiaries amended its $1.4 bln corporate loan "
    },
    {
        "content": "Jan 29 Diary of U.S. corporate earnings for the week ahead.    ** This Diary does not provide the EPS estimate figures. EPS figures can be retrieved from Eikon.      Steps in Eikon to retrieve the EPS estimate:-     Eikon Indicator-> Equities Guide-> Top Indices-> S&P 500-> Events-> Select Event types-> Select the company-> Estimates              ** Please Note - All times given are in U.S. EST unless otherwise stated **            U.S. EARNINGS    -       Start ",
        "date": "01292016",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "DIARY-U.S. EARNINGS WEEK AHEAD "
    },
    {
        "content": "Feb 3 General Growth Properties Inc said on Wednesday that a statement concerning Amazon.com Inc  made by its chief executive  Sandeep Mathrani  was not intended to represent Amazon's plans.",
        "date": "02032016",
        "name": "GGP Inc",
        "news_type": "topStory",
        "symbol": "GGP",
        "title": "General Growth Properties CEO clarifies comment on Amazon "
    },
    {
        "content": "Brookfield Asset Management Inc  has been exploring an acquisition in recent months of General Growth Properties Inc (GGP)   the U.S. mall operator with a market value of $24 billion  according to people familiar with the matter.",
        "date": "01282016",
        "name": "GGP Inc",
        "news_type": "topStory",
        "symbol": "GGP",
        "title": "Exclusive: Brookfield mulls buying mall operator General Growth -sources "
    },
    {
        "content": "Jan 29 Canada's main stock index looked set to follow global markets higher after the Bank of Japan sprang a surprise by taking one of its main interest rates into negative territory.",
        "date": "01292016",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "CANADA STOCKS-Futures higher after BOJ's negative rate move "
    },
    {
        "content": "Jan 28 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "01282016",
        "name": "GGP Inc",
        "news_type": "normal",
        "symbol": "GGP",
        "title": "Deals of the day-Mergers and acquisitions "
    }
]