[
    {
        "content": "* Competition is growing  with Gilead drug also on US market (Adds comment from Novartis  details about rival market)",
        "date": "11062017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "UPDATE 1-Novartis seeks European approval for cell therapy Kymriah "
    },
    {
        "content": "LONDON Gilead Sciences  and GlaxoSmithKline  are heading for an HIV showdown  pushing rival treatment visions and competing products that are expected to hit the market in the next few months.",
        "date": "11022017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "GSK and Gilead go head to head as HIV drugs enter new phase "
    },
    {
        "content": "LONDON Medecins Sans Frontieres  the international nonprofit medical charity  said on Tuesday it had struck deals with generic manufacturers to buy hepatitis C drugs for as little as $1.40 a day  a dramatic reduction on original prices.",
        "date": "10312017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "MSF charity secures generic hepatitis C drugs for $1.40 a day "
    },
    {
        "content": "Gilead Sciences Inc  posted better-than-expected third-quarter profit on Thursday  but shares fell after hours as use of its flagship hepatitis C drugs waned further and the company said it expects to feel the full impact of more competition in the current quarter.",
        "date": "10262017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead weak hepatitis C sales outlook sends shares lower "
    },
    {
        "content": "Oct 26 Gilead Sciences Inc posted better-than-expected third-quarter profit on Thursday  but shares fell after hours as use of its flagship hepatitis C drugs waned further and the company said it expects to feel the full impact of more competition in the current quarter.",
        "date": "10262017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead weak hepatitis C sales outlook sends shares lower "
    },
    {
        "content": "Oct 26 Gilead Sciences Inc reported lower third-quarter profits on Thursday as use of its flagship hepatitis C drugs continued to wane  but the results beat Wall Street estimates due to lower costs.",
        "date": "10262017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead 3rd-quarter profit falls  but beats Wall Street estimates "
    },
    {
        "content": "* Announces Phase 2 results for GS-0976 in Nonalcoholic Steatohepatitis (NASH)",
        "date": "10242017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead announces Phase 2 results for GS-0976 in Nonalcoholic Steatohepatitis "
    },
    {
        "content": "A consumer group on Wednesday urged the U.S. Patent and Trademark Office to cancel patents owned by Gilead Sciences Inc on its blockbuster hepatitis C treatment Sovaldi in hopes of helping bring cheaper generic versions to market.",
        "date": "10252017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Consumer group challenges Gilead patents on hepatitis C drug "
    },
    {
        "content": "U.S. regulators approved on Wednesday a new therapy for a type of lymphoma  which was developed by Gilead Science Inc's  Kite Pharma  marking the second approval for this potentially revolutionary approach to fighting cancer.",
        "date": "10192017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "FDA approves Gilead cancer gene therapy; price set at $373 000 "
    },
    {
        "content": "* Gilead announces multiple scientific presentations demonstrating high cure rates in difficult-to-cure HCV patients and improved long-term bone and renal safety of vemlidy in HBV patients switched from viread Source text for Eikon: Further company coverage:",
        "date": "10202017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead announces multiple scientific presentations "
    },
    {
        "content": "Oct 18 U.S. regulators approved on Wednesday a new therapy for a type of lymphoma  which was developed by Gilead Science Inc's Kite Pharma  marking the second approval for this potentially revolutionary approach to fighting cancer.",
        "date": "10192017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-U.S. FDA approves Gilead cancer gene therapy; price set at $373 000 "
    },
    {
        "content": "* FDA approves CAR-T cell therapy to treat adults with certain types of large B-cell lymphoma",
        "date": "10182017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-FDA approves Gilead's CAR-T cell therapy "
    },
    {
        "content": "Oct 18 A new cancer therapy for a type of lymphoma developed by Kite Pharma  which was recently acquired by Gilead Sciences Inc  won U.S. Food and Drug Administration approval on Wednesday  six weeks ahead of schedule.",
        "date": "10182017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "FDA approves Gilead's Yescarta cancer immunotherapy "
    },
    {
        "content": "* Gilead Sciences Inc - ‍no patients in bictegravir treatment arm demonstrated treatment-emergent resistance through 48 weeks​",
        "date": "10042017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences presents results from late-stage study ‍​ "
    },
    {
        "content": "* Kevin Young CBE  chief operating officer  plans to retire  effective early 2018​",
        "date": "09282017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Kevin Young to retire as Gilead Sciences COO "
    },
    {
        "content": "* China Food and drug Administration approves Gilead’s Sovaldi (sofosbuvir) for treatment of chronic Hepatitis C virus infection",
        "date": "09252017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-China Food and Drug Administration approves Gilead’s Sovaldi "
    },
    {
        "content": "* Gilead receives approval in Canada for expanded indication of epclusa® (sofosbuvir/velpatasvir) for the treatment of chronic hepatitis C in patients co-infected with HIV",
        "date": "09212017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead receives approval in Canada for expanded indication of epclusa "
    },
    {
        "content": "* Gilead Sciences - On September 8  2017 co entered into a $6.0 billion term loan facility credit agreement - SEC Filing‍​",
        "date": "09132017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences entered into a $6 bln term loan facility credit agreement - SEC Filing‍​ "
    },
    {
        "content": "* Gilead Sciences to present at the Morgan Stanley global healthcare conference on Monday  September 11 Source text for Eikon: Further company coverage:",
        "date": "09052017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences to present at the Morgan Stanley Global Healthcare conference "
    },
    {
        "content": "* Gilead Sciences Inc files for potential mixed shelf; size not disclosed - SEC filing‍​ Source text: [http://bit.ly/2etaGsh] Further company coverage:",
        "date": "08312017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences files for potential mixed shelf size not disclosed "
    },
    {
        "content": "Aug 28 Gilead Sciences Inc agreed to buy Kite Pharma Inc in a nearly $12 billion deal on Monday  as it looks to replace flagging sales from hepatitis C drugs with an emerging and expensive class of cancer immunotherapies that are expected to generate billions of dollars in revenue.",
        "date": "08282017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "UPDATE 4-Gilead to buy Kite for promising cancer therapies in $12 bln deal "
    },
    {
        "content": "Gilead Sciences Inc agreed to buy Kite Pharma Inc in a nearly $12 billion deal on Monday  as it looks to replace flagging sales from hepatitis C drugs with an emerging and expensive class of cancer immunotherapies that are expected to generate billions of dollars in revenue.",
        "date": "08282017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead to buy Kite for promising cancer therapies in $12 billion deal "
    },
    {
        "content": "* Says it is not going quiet after this deal; will look for more opportunities : conf call",
        "date": "08282017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead says it is not going quiet after Kite deal "
    },
    {
        "content": "* Kite Pharma Inc - ‍Gilead will acquire Kite for $180.00 per share in cash​",
        "date": "08282017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences to acquire Kite Pharma for $11.9 billion "
    },
    {
        "content": "Aug 28 Gilead Sciences Inc has agreed to buy Kite Pharma Inc for about $11 billion in an all-cash deal  the Wall Street Journal reported on Monday  citing people familiar with the matter.",
        "date": "08282017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead to buy Kite Pharma in $11 bln deal  - WSJ "
    },
    {
        "content": "* Gilead to buy Kite Pharma for roughly $11 billion in cash - WSJ  citing sources Source text - http://on.wsj.com/2giy1NI Further company coverage:",
        "date": "08282017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead to buy Kite Pharma for roughly $11 billion in cash - WSJ "
    },
    {
        "content": "* Gilead receives approval in Canada for Vosevi™ (sofosbuvir/velpatasvir/voxilaprevir) for re-treatment of certain patients with chronic hepatitis c virus (HCV) infection Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead receives approval in Canada for Vosevi for re-treatment of certain patients with chronic hep c virus infection "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd cuts share stake in Gilead Sciences ‍​by 23 percent to 11.1 million shares - SEC filing",
        "date": "08142017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Temasek Holdings cuts share stake in Gilead Sciences "
    },
    {
        "content": "* Gilead announces U.S. fda priority review designation for fixed-dose combination of bictegravir  emtricitabine and tenofovir alafenamide for treatment of HIV",
        "date": "08102017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-FDA grants priority status to Gilead's HIV treatments "
    },
    {
        "content": "* Co reiterates 2017 adjusted profit forecast (Adds conference call details  shares)",
        "date": "07282017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 3-AbbVie to remain cautious on drug pricing  shares fall "
    },
    {
        "content": "Gilead Sciences Inc  on Wednesday reported lower second-quarter profits as use of its flagship hepatitis C drugs continued to decline  but the results still beat Wall Street estimates and the company raised its full-year sales outlook.",
        "date": "07262017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead Sciences profit falls  but beats Wall Street estimates "
    },
    {
        "content": "July 26 Gilead Sciences Inc on Wednesday reported lower second-quarter profits as use of its flagship hepatitis C drugs continued to decline  but the results still beat Wall Street estimates and the company raised its full-year sales outlook.",
        "date": "07262017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead Sciences profit falls  but beats Wall Street estimates "
    },
    {
        "content": "* Qtrly ‍total revenues were $7.1 billion in 2017 compared to $7.8 billion in 2016​",
        "date": "07262017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences qtrly ‍diluted earnings per share $2.33​ "
    },
    {
        "content": "July 26 Gilead Sciences Inc said on Wednesday its second-quarter profit fell 12 percent as use of its flagship hepatitis C drugs continued to decline  but the results beat Wall Street estimates and the company raised its full-year sales outlook.",
        "date": "07262017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead Sciences quarterly results beat Wall Street estimates "
    },
    {
        "content": "July 18 Gilead Sciences Inc said on Tuesday that the U.S. Food and Drug Administration approved its hepatitis C drug for patients who had failed to respond to prior treatments.",
        "date": "07182017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "FDA approves Gilead's drug for chronic hep C patients "
    },
    {
        "content": "* U.S. Food and Drug Administration approves Gilead’s Vosevi (sofosbuvir/velpatasvir/voxilaprevir) for re-treatment of adults with chronic hepatitis C virus",
        "date": "07182017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-U.S. FDA approves Gilead’s Vosevi for re-treatment of adults with chronic hepatitis C virus "
    },
    {
        "content": "* Spring Bank Pharmaceuticals Inc - ‍announced a second clinical trial collaboration with Gilead Sciences  Inc. for a clinical study examining SB 9200​",
        "date": "07102017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Spring Bank Pharmaceuticals announces clinical trial collaboration with Gilead Sciences for clinical study examining SB 9200​ "
    },
    {
        "content": "A U.S. appeals court on Friday revived a lawsuit accusing pharmaceutical maker Gilead Sciences Inc of making false statements about its regulatory compliance with regard to certain HIV drugs  causing federal healthcare programs to pay it billions of dollars.",
        "date": "07072017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead whistleblower lawsuit over HIV drugs revived on appeal "
    },
    {
        "content": "* European CHMP adopts positive opinion for Gilead's Vosevi (sofosbuvir/velpatasvir/voxilaprevir) for the treatment of all chronic Hepatitis C genotypes",
        "date": "06232017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-European CHMP adopts positive opinion for Gilead's Vosevi "
    },
    {
        "content": "An appeals court handed biopharmaceutical company Gilead Sciences Inc a victory on Tuesday in its litigation with Merck & Co Inc over the blockbuster hepatitis C drug Sovaldi.",
        "date": "06212017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead knocks out Merck patent on hepatitis C treatment "
    },
    {
        "content": "* Gilead receives approval in Canada for Vemlidy™ (tenofovir alafenamide) for the treatment of chronic hepatitis b virus infection",
        "date": "06192017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead receives approval in Canada for Vemlidy for treatment of chronic hepatitis b virus infection "
    },
    {
        "content": "* Gilead submits new drug application to U.S. Food and drug administration for fixed-dose combination of bictegravir  emtricitabine and tenofovir alafenamide for HIV treatment",
        "date": "06122017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead submits NDA for fixed-dose combination for HIV treatment "
    },
    {
        "content": " (This story corrects story published on May 30 to show that two  not three  of the studies had enrolled previously untreated patients  in third and fourth paragraphs from the bottom.)",
        "date": "05312017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead and GSK go head-to-head with similar HIV drug data "
    },
    {
        "content": "* Gilead integrase inhibitor proves just as effective as GSK's",
        "date": "05312017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "CORRECTED-Gilead and GSK go head-to-head with similar HIV drug data "
    },
    {
        "content": "May 30 Gilead Sciences Inc said on Tuesday its combination treatment for HIV met the main goal in four late-stage studies  paving the way for regulatory submissions.",
        "date": "05302017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead's HIV combination therapy succeeds in four late-stage studies "
    },
    {
        "content": "* Gilead-Stockholders did not approve proposal requesting board take steps to adopt policy that chairman of board be independent director-sec filing Source text (http://bit.ly/2r9rtBo) Further company coverage:",
        "date": "05122017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead says stockholders did not approve proposal requesting board take steps to adopt policy that chairman of board be independent director "
    },
    {
        "content": "Gilead Sciences Inc  on Tuesday reported a 25 percent drop in first-quarter profit as fewer patients were treated with its flagship drugs for hepatitis C  sending shares of the biotechnology company down 2.5 percent.",
        "date": "05022017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead profit falls as hepatitis C sales drop  shares down "
    },
    {
        "content": "May 2 Gilead Sciences Inc on Tuesday reported a 25 percent drop in first-quarter profit as fewer patients were treated with its flagship drugs for hepatitis C  sending shares of the biotechnology company down 2.5 percent.",
        "date": "05022017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead profit falls as hepatitis C sales drop  shares down "
    },
    {
        "content": "May 2 Gilead Sciences Inc on Tuesday reported a 25 percent drop in first-quarter profit as fewer patients were treated with its flagship drugs for hepatitis C  sending shares of the biotechnology company down 2 percent.",
        "date": "05022017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead net profit falls 25 percent on lower hepatitis C sales "
    },
    {
        "content": "April 24 Large drugmakers with piles of cash are on the hunt for promising medicines being developed by small companies to treat NASH  a progressive fatty liver disease poised to become the leading cause of liver transplants by 2020.",
        "date": "04242017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-NASH: The next untapped pharma market gives investors many options "
    },
    {
        "content": "April 24 Large drugmakers with piles of cash are on the hunt for promising medicines being developed by small companies to treat NASH  a progressive fatty liver disease poised to become the leading cause of liver transplants by 2020.",
        "date": "04242017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "RPT-INSIGHT-NASH: The next untapped pharma market gives investors many options "
    },
    {
        "content": "April 24 Large drugmakers with piles of cash are on the hunt for promising medicines being developed by small companies to treat NASH  a progressive fatty liver disease poised to become the leading cause of liver transplants by 2020.",
        "date": "04242017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "INSIGHT-NASH: The next untapped pharma market gives investors many options "
    },
    {
        "content": "* Results from 2 Phase 2 studies evaluating Harvoni tablets in chronic hepatitis C infected patient populations",
        "date": "04212017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead announces results from 2 Phase 2 studies evaluating Harvoni tablets in chronic hepatitis C infected patient populations "
    },
    {
        "content": "* U.S. FDA approves new indications for Harvoni and Sovaldi in pediatric patients 12 years and older with chronic hepatitis C infection",
        "date": "04072017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-FDA approves two of Gilead's hepatitis C drugs for pediatric patients "
    },
    {
        "content": "* Galapagos NV - Galapagos doses first psoriatic arthritis patient with filgotinib",
        "date": "04052017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Galapagos doses first psoriatic arthritis patient with filgotinib "
    },
    {
        "content": "* Gilead Sciences Inc- CEO John F. Milligan's 2016 total compensation was $13.9 million- SEC Filing",
        "date": "03272017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences CEO John Milligan's 2016 total compensation was $13.9 mln- SEC Filing "
    },
    {
        "content": "LONDON International groups representing doctors and patients have launched a fresh challenge to the patent on Gilead Sciences'  hepatitis C drug sofosbuvir at the European Patent Office in order to increase access to the treatment.",
        "date": "03272017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead hepatitis C drug patent faces European challenge "
    },
    {
        "content": "LONDON  March 27 International groups representing doctors and patients have launched a fresh challenge to the patent on Gilead Sciences'  hepatitis C drug sofosbuvir at the European Patent Office in order to increase access to the treatment.",
        "date": "03272017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-Gilead hepatitis C drug patent faces European challenge "
    },
    {
        "content": "* EPCLUSA  to treat all six genotypes of chronic Hepatitis C infection  added to Liste des médicaments de la RAMQ  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences says EPCLUSA added to Liste des médicaments de la RAMQ "
    },
    {
        "content": "* British Columbia lists EPCLUSA on public drug plan to treat all six genotypes of chronic hepatitis C infection  Source text for Eikon:  Further company coverage:",
        "date": "03212017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences lists EPCLUSA on public drug plan to treat chronic hepatitis C infection "
    },
    {
        "content": "Gilead Sciences Inc has asked a federal judge to overturn a record $2.54 billion jury verdict in a patent infringement lawsuit by rival Merck & Co Inc over Gilead's blockbuster hepatitis C drugs Sovaldi and Harvoni.",
        "date": "02272017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead seeks to overturn $2.54 bln verdict in hepatitis C drug case "
    },
    {
        "content": "* Gilead receives approval in Canada for Odefsey for the treatment of HIV-1 infection  Source text for Eikon:  Further company coverage:",
        "date": "02162017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead receives approval in Canada for Odefsey for treatment of HIV-1 infection "
    },
    {
        "content": "* Gilead announces 144-week data evaluating safety and efficacy of Genvoya for treatment of HIV-1 in treatment-naïve adults",
        "date": "02152017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead announces 144-week data evaluating safety and efficacy of Genvoya "
    },
    {
        "content": "LONDON  Feb 14 Gilead Sciences has thrown down a challenge to GlaxoSmithKline with good clinical trial results for an experimental HIV drug that works in the same way as the British group's successful dolutegravir.",
        "date": "02142017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead challenges GSK with strong HIV drug data "
    },
    {
        "content": "* Gilead presents new phase 2 data on Bictegravir  an investigational integrase strand transfer inhibitor for the treatment of HIV",
        "date": "02132017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead presents new phase 2 data on Bictegravir "
    },
    {
        "content": "* Gilead announces findings from new preclinical study evaluating novel class of HIV Capsid inhibitors",
        "date": "02132017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead announces findings from new preclinical study evaluating novel class of HIV Capsid inhibitors "
    },
    {
        "content": "NEW YORK  Feb 6 Shares of Gilead Sciences Inc  are languishing over concerns about the U.S. biotechnology company's declining hepatitis C drugs and profit outlook  but some value investors sense an opportunity with shares at extremely cheap levels.",
        "date": "02062017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Priced like an automaker  sputtering Gilead shares lure value bets "
    },
    {
        "content": "Feb 7 Gilead Sciences Inc on Tuesday projected disappointing sales for its hepatitis C drugs this year because of fewer patients being started on treatments and more competition  sending its shares down more than 5 percent after hours.",
        "date": "02072017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "UPDATE 3-Gilead 2017 hepatitis C sales forecast disappoints  shares drop "
    },
    {
        "content": "Feb 7 Gilead Sciences Inc on Tuesday posted lower fourth-quarter profits as fewer patients were treated with its pricey hepatitis C drugs  and said total product sales would be lower this year.",
        "date": "02072017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead's quarterly profit falls  lower sales expected in 2017 "
    },
    {
        "content": "LONDON  Feb 8 GlaxoSmithKline and Gilead Sciences will vie for business in treating HIV patients next week when both companies unveil clinical trial results at a medical meeting in Seattle.",
        "date": "02082017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "GlaxoSmithKline and Gilead to face off at HIV meeting next week "
    },
    {
        "content": "* Gilead Sciences announces fourth quarter and full year 2016 financial results",
        "date": "02072017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences reports Q4 earnings per share $2.34 "
    },
    {
        "content": "Gilead Sciences Inc's  shares fell as much as 10 percent on Wednesday  after the drugmaker forecast bleak sales for its hepatitis C drugs this year  underscoring the need for the company to strengthen its pipeline through acquisitions.",
        "date": "02082017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead shares slump after gloomy sales forecast for hep C drugs "
    },
    {
        "content": "* Increases quarterly dividend by 10 percent  Source text for Eikon:  Further company coverage:",
        "date": "02072017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences sets quarterly dividend of $0.52 per share "
    },
    {
        "content": "Feb 8 Gilead Sciences Inc's shares fell as much as 10 percent on Wednesday  after the drugmaker forecast bleak sales for its hepatitis C drugs this year  underscoring the need for the company to strengthen its pipeline through acquisitions.",
        "date": "02082017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-Gilead shares slump after gloomy sales forecast for hep C drugs "
    },
    {
        "content": "Feb 8 Shares of Gilead Sciences Inc fell as much as 10 percent to touch a near three-year low on Wednesday  a day after the drugmaker forecast disappointing sales for its hepatitis C drugs this year.",
        "date": "02082017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead shares slump after bleak sales forecast for Hep C drugs "
    },
    {
        "content": "* Gilead Sciences - Kennet Brysting appointed general manager of Gilead Sciences Canada; joins co's North America commercial senior leadership team  Source text for Eikon:  Further company coverage:",
        "date": "02082017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences names Kennet Brysting general manager of Gilead Sciences Canada "
    },
    {
        "content": "Gilead Sciences Inc  on Tuesday projected disappointing sales for its hepatitis C drugs this year because of fewer patients being started on treatments and more competition  sending its shares down more than 5 percent after hours.",
        "date": "02082017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead 2017 hepatitis C sales forecast disappoints  shares drop "
    },
    {
        "content": "* European Medicines Agency validates Gilead's marketing authorization application for investigational chronic hepatitis c therapy sofosbuvir/velpatasvir/voxilaprevir (sof/vel/vox)",
        "date": "01202017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-European Medicines Agency validates Gilead's marketing authorization application for investigational chronic hepatitis C therapy "
    },
    {
        "content": "* European Commission grants marketing authorization for Gilead's Vemlidy (Tenofovir Alafenamide  TAF) for the treatment of chronic hepatitis B virus infection  Source text for Eikon:  Further company coverage:",
        "date": "01112017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-European Commission grants marketing authorization for Gilead's Vemlidy (Tenofovir Alafenamide  TAF) for the treatment of chronic hepatitis B virus infection "
    },
    {
        "content": "* Gilead exec says slowdown in patients starting hepatitis c therapies to continue in 2017",
        "date": "01092017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead COO says slowdown in patients starting hep C therapies to continue in 2017 "
    },
    {
        "content": "* CEO says planning Phase III trials of NASH drug in patients with advanced fibrosis  Source text for Eikon:  Further company coverage:    (Reporting By Bill Berkrot)",
        "date": "01092017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences planning Phase III NASH trials "
    },
    {
        "content": "* Gilead pays $100M NASH related milestone to Phenex  Source text for Eikon:  Further company coverage:",
        "date": "01092017",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Immuron Ltd says Gilead pays $100M NASH related milestone to Phenex "
    },
    {
        "content": "ZURICH Gilead Sciences has hired a top cancer specialist from Swiss drugmaker Novartis as the U.S. healthcare group sharpens its focus on oncology.",
        "date": "01042017",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead poaches Novartis cancer specialist Riva "
    },
    {
        "content": "Merck & Co on Thursday was awarded $2.54 billion in royalties by a federal jury in a patent lawsuit against Gilead Sciences Inc over Gilead's blockbuster hepatitis C drugs Sovaldi and Harvoni.",
        "date": "12152016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Merck wins $2.54 billion in hepatitis C drug trial against Gilead "
    },
    {
        "content": "NEW YORK Gilead Sciences Inc has begun marketing its HIV treatment Truvada in a way thousands of consumers already use it – to prevent infection with the virus that causes AIDS.",
        "date": "11302016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Switching course  Gilead markets HIV drug for prevention "
    },
    {
        "content": "Early next month  Gilead Sciences Inc will try to convince a federal jury in Delaware that a Merck & Co patent on hepatitis C drugs is invalid.",
        "date": "11282016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead  Merck to face off before jury over hepatitis C drug patents "
    },
    {
        "content": "Gilead Sciences Inc has lost a bid to invalidate two Merck & Co patents on hepatitis C treatments  which Merck claims are infringed by Gilead's blockbuster Harvoni and Sovaldi.",
        "date": "11172016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead loses bid to invalidate two Merck hepatitis C patents ahead of trial "
    },
    {
        "content": "* Gilead Sciences Inc - non-inferiority was not achieved for key secondary endpoint of response rate in total symptom score (TSS)",
        "date": "11162016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead announces top-line results from two phase 3 studies "
    },
    {
        "content": "* Gilead Sciences Inc - results demonstrate improvement in fibrosis stage among nash patients with moderate to severe fibrosis",
        "date": "11142016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead - data for combination of selonsertib  gs-9674 in rodent model of advanced fibrosis resulted in greater anti-fibrotic activity than either agent alone "
    },
    {
        "content": "CHICAGO  Nov 9 An experimental HIV vaccine from Johnson & Johnson combined with an immune system booster from Gilead Sciences Inc showed promise at keeping the virus at bay in monkeys even after treatments had stopped  marking yet another step toward the development of a so-called functional cure for HIV.",
        "date": "11092016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "J&J vaccine plus Gilead immune booster shows promise as HIV fighter "
    },
    {
        "content": "Nov 10 Gilead Sciences Inc said on Thursday the U.S. Food and Drug Administration (FDA) approved its drug to treat chronic hepatitis B infection in patients with scarred liver.",
        "date": "11102016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "UPDATE 1-Gilead's hepatitis B drug gets U.S. approval "
    },
    {
        "content": "Nov 10 Gilead Sciences Inc said on Thursday the U.S. Food and Drug Administration approved its drug for patients with chronic hepatitis B virus infection.",
        "date": "11102016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead's hepatitis B drug wins U.S. approval "
    },
    {
        "content": "Gilead Sciences Inc  on Tuesday posted a 28 percent drop in quarterly net profit due to lower sales of its hepatitis C drugs Harvoni and Sovaldi  but its HIV drug sales beat Wall Street's expectations and the biotech company made no changes to its full-year outlook.",
        "date": "11012016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead 3rd-quarter profit falls  HIV sales rise "
    },
    {
        "content": "Nov 1 Gilead Sciences Inc on Tuesday posted a 28 percent drop in quarterly net profit due to lower sales of its hepatitis C drugs Harvoni and Sovaldi  but its HIV drug sales beat Wall Street's expectations and the biotech company made no changes to its full-year outlook.",
        "date": "11012016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead 3rd-quarter profit falls  HIV sales rise "
    },
    {
        "content": "Nov 1 Gilead Sciences Inc said on Tuesday its third-quarter net profit fell 28 percent  due to lower sales of its flagship hepatitis C drugs Harvoni and Sovaldi.",
        "date": "11012016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead third quarter net profit falls 28 percent "
    },
    {
        "content": "* Q3 sovaldi sales $825 million versus $1 466 million last year",
        "date": "11012016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Q3 earnings per share $2.49 "
    },
    {
        "content": "* Gilead announces top-line phase 2 results for GS-4997 (Selonsertib) in Nonalcoholic Steatohepatitis (NASH)  Pulmonary Arterial Hypertension (PAH) and Diabetic Kidney Disease (DKD)",
        "date": "10202016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences says phase 2 study of GS-4997 in PAH did not achieve primary endpoint "
    },
    {
        "content": "* Gilead announces SVR12 rates from four phase 3 studies of a once-daily  fixed-dose combination of Sofosbuvir  Velpatasvir and Voxilaprevir in treatment-naïve and treatment-experienced genotype 1-6 chronic HCV-infected patients",
        "date": "10202016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead announces SVR12 rates from four phase 3 studies of combination of Sofosbuvir  Velpatasvir And Voxilaprevir "
    },
    {
        "content": "* Gilead Sciences and the World Health Organization announce five-year visceral leishmaniasis collaboration",
        "date": "09272016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead sciences  WHO announce 5-year visceral leishmaniasis collaboration "
    },
    {
        "content": "* A phase 3 study of GS-5745 is ongoing in patients with Gastric Cancer",
        "date": "09212016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead terminates phase 2/3 study of GS-5745 in patients with Ulcerative Colitis "
    },
    {
        "content": "Sept 20 Botox maker Allergan Plc  in its third acquisition this month  said it would pay up to $1.7 billion for Tobira Therapeutics Inc to get a leg up in the race to develop therapies for NASH  an incurable fatty liver disease closely linked to obesity.",
        "date": "09202016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 3-Allergan to buy Tobira in push for fatty liver disease drugs "
    },
    {
        "content": "* Priced $1.25 billion of 2.950% senior notes maturing in 2027",
        "date": "09162016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences prices $5 bln of senior unsecured notes "
    },
    {
        "content": "* Says Kramer is currently Executive Vice President and Chief Financial Officer of Cisco Systems  Inc  Source text for Eikon:  Further company coverage:",
        "date": "08232016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Kelly Kramer joins Gilead Sciences' Board of Directors "
    },
    {
        "content": "* European Commission grants marketing authorization for Gilead's once-daily Truvada\u007f for reducing the risk of sexually acquired HIV-1",
        "date": "08222016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences - European Commission grants marketing authorization for Truvada "
    },
    {
        "content": "Aug 11 Gilead Sciences Inc is entitled to receive the attorney fees it incurred related to hepatitis C patent litigation with drugmaker Merck & Co Inc  a U.S. district judge has ruled.",
        "date": "08122016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead to get attorney fees in hepatitis C patent fight with Merck "
    },
    {
        "content": "* Genmab enters commercial license agreement with Gilead for DuoBody(R) Technology",
        "date": "08102016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Genmab enters commercial license agreement with Gilead for DuoBody(R)Technology "
    },
    {
        "content": "* In July 2016  Massachusetts attorney general's office notified co of their decision to suspend co's obligations under CID until further notice",
        "date": "08052016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "REFILE-BRIEF-Massachusetts attorney general's office notifies Gilead of decision to suspend co's obligations under CID until further notice "
    },
    {
        "content": "Gilead Sciences Inc urged a California federal judge on Tuesday to not put off a decision on whether it is owed $15.5 million in legal fees in a patent fight over a lucrative cure for hepatitis C with drugmaker Merck & Co.",
        "date": "07282016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead  Merck lock horns on legal fees in hepatitis C patent fight "
    },
    {
        "content": "Gilead Sciences Inc  on Monday lowered its full-year sales outlook  citing slower-than-expected demand for its key hepatitis C drugs  and said second-quarter profits fell 22 percent.",
        "date": "07252016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead cuts 2016 sales forecast  cites hepatitis C drugs "
    },
    {
        "content": "July 25 Gilead Sciences Inc said on Monday its second-quarter net profit fell 22 percent  due mostly to lower sales of its hepatitis C drug Harvoni.",
        "date": "07252016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead second-quarter net profit falls 22 percent "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.47per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07252016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences sets qtrly dividend of $0.47 per share "
    },
    {
        "content": "* Q2 Harvoni sales $ 2.56 billion versus $3.61 billion last year",
        "date": "07252016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences Q2 non-GAAP earnings per share $3.08 "
    },
    {
        "content": "* Odefsey\u007f (Emtricitabine  Rilpivirine  Tenofovir Alafenamide) Meets Primary 48-Week objective in two phase 3B studies",
        "date": "07212016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead's Odefsey meets primary objective in phase 3B studies "
    },
    {
        "content": "* European CHMP adopts positive opinion on Gilead's type II variation application for Truvada\u007f for reducing the risk of sexually acquired HIV.",
        "date": "07222016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-EMA adopts positive opinion on expanded approval of Gilead's HIV drug  Truvada "
    },
    {
        "content": "* Gilead receives approval in Canada for Epclusa (sofosbuvir/velpatasvir)  the first once-daily pan-genotypic (genotypes 1-6) single tablet regimen for the treatment of chronic Hepatitis C  Source text for Eikon:  Further company coverage:",
        "date": "07142016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences gets Canada approval for Hepatitis C treatment Epclusa "
    },
    {
        "content": "* Ligand enters into Omniab\u007f platform license agreement with Gilead Sciences",
        "date": "07082016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Ligand enters into Omniab platform license agreement with Gilead Sciences "
    },
    {
        "content": "A California federal judge has dismissed a lawsuit filed by the non-profit AIDS Healthcare Foundation challenging Gilead Sciences' patents on AIDS drugs and accusing it of suppressing competition.",
        "date": "07082016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "AIDS Healthcare Foundation lawsuit over Gilead AIDS drugs dismissed "
    },
    {
        "content": "Merck & Co has appealed a California federal judge's order that overturned a $200 million verdict it won in a patent case against Gilead Sciences over Gilead's lucrative hepatitis C drugs on the grounds that Merck engaged in extensive misconduct.",
        "date": "07072016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Merck appeals order reversing its $200 mln verdict against Gilead "
    },
    {
        "content": "Gilead Sciences Inc may have scored a dramatic and unexpected win over Merck & Co earlier this month in a patent dispute over the world's best-selling hepatitis C cure  but the war over this highly lucrative class of treatments has only just begun.",
        "date": "06292016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "After hepatitis C patent win over Merck  Gilead faces other foes "
    },
    {
        "content": "U.S. health regulators on Tuesday approved a combination drug by Gilead Sciences Inc that is the first available treatment for all six major forms of hepatitis C  advancing the company's leadership in the field and sending its shares up more than 4 percent.",
        "date": "06282016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead wins U.S. nod for drug for all types of hepatitis C "
    },
    {
        "content": "June 28 U.S. health regulators on Tuesday approved a combination drug by Gilead Sciences Inc that is the first available treatment for all six major forms of hepatitis C  advancing the company's leadership in the field and sending its shares up more than 4 percent.",
        "date": "06282016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead wins U.S. nod for drug for all types of hepatitis C "
    },
    {
        "content": "June 28 The U.S. Food and Drug Administration approved Gilead Sciences Inc's drug for treating chronic hepatitis C virus infection.",
        "date": "06282016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "U.S. FDA approves Gilead's hep C drug Epclusa "
    },
    {
        "content": "* European Commission grants marketing authorization for Gilead's single tablet regimen Odefsey\u007f (emtricitabine  rilpivirine  tenofovir alafenamide) for the treatment of HIV",
        "date": "06232016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead says European Commission grants marketing authorization for Odefsey\u007f "
    },
    {
        "content": "NEW YORK A U.S. judge on Monday found a pattern of misconduct by Merck & Co including lying under oath and other unethical practices  freeing Gilead Sciences Inc from paying any damages for infringing Merck's patents with its lucrative treatments for hepatitis C  Sovaldi and Harvoni.",
        "date": "06072016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead escapes liability in hepatitis C patent fight with Merck "
    },
    {
        "content": "NEW YORK  June 6 A U.S. judge on Monday found a pattern of misconduct by Merck & Co including lying under oath and other unethical practices  freeing Gilead Sciences Inc from paying any damages for infringing Merck's patents with its lucrative treatments for hepatitis C  Sovaldi and Harvoni.",
        "date": "06072016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead escapes liability in hepatitis C patent fight with Merck "
    },
    {
        "content": "May 27 An advisory panel to the European drug regulator recommended an approval for Gilead Sciences Inc's  new drug combination to treat hepatitis C.",
        "date": "05272016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "UPDATE 1-EU regulators back approval of Gilead's new hep C drug "
    },
    {
        "content": "May 27 Gilead Sciences Inc's new hepatitis C drug combination  which shares an active ingredient with blockbuster Sovaldi  was recommended for marketing approval by the European Medicines Agency.",
        "date": "05272016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "EU regulators recommend approving Gilead's new hepatitis C drug "
    },
    {
        "content": "* Paul R. Carter  executive vice president  commercial operations  has decided to depart Gilead",
        "date": "05242016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences appoints Kevin Young as COO "
    },
    {
        "content": "* Temasek Holdings raises share stake in Gilead Sciences Inc by 8.1 percent to 13.83 million shares  Source text for quarter ended March 31  2016: (http://1.usa.gov/1TguNln) Source text for quarted ended Dec. 31  2015: (http://1.usa.gov/1TguI11)",
        "date": "05162016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Temasek Holdings raises share stake in Gilead by 8.1 pct "
    },
    {
        "content": "May 10 India has reversed course and granted approval to Gilead Sciences Inc's patent for its hepatitis C drug Sovaldi  marking a setback for patient groups who said the move could stop affordable copies of the drug.",
        "date": "05102016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "India Patent Office approves Gilead's hepatitis C drug patent "
    },
    {
        "content": "India has reversed course and granted approval to Gilead Sciences Inc's patent for its hepatitis C drug Sovaldi  marking a setback for patient groups who said the move could stop affordable copies of the drug.",
        "date": "05112016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "India Patent Office approves Gilead's hepatitis C drug patent "
    },
    {
        "content": "* European chmp adopts positive opinion for gilead's taf-based single tablet regimen odefsey\u007f (emtricitabine  rilpivirine  tenofovir alafenamide) for treatment of hiv  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04292016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences says European CHMP adopts positive opinion for its drug "
    },
    {
        "content": "* EU Medicines Agency recommends approval of Biogen Inc  and AbbVie Inc's daclizumab to treat multiple sclerosis",
        "date": "04292016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-European regulators recommends approval of Gilead's new HIV treatment "
    },
    {
        "content": "Gilead Sciences Inc's first quarter net profit fell 18 percent as pricing pressure resulted in lower U.S. sales of hepatitis C drug Harvoni.",
        "date": "04282016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Price pressure hits Gilead first quarter U.S. hepatitis C drug sales "
    },
    {
        "content": "* European commission grants marketing authorization for Gilead's fixed-dose combination descovy (emtricitabine  tenofovir alafenamide) for treatment of HIV  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04252016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead's treatment for HIV receives marketing authorization from european commission "
    },
    {
        "content": "April 16 An experimental once-daily combination hepatitis C treatment being developed by AbbVie Inc  demonstrated very high cure rates across a wide range of disease genotypes  according to data presented on Saturday  likely giving the company a more competitive product if approved.",
        "date": "04162016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "New AbbVie hepatitis C regimen shows high cure rates -studies "
    },
    {
        "content": "TOKYO Global drugmakers said they could cut research spending in Japan due to new rules requiring them to slash prices on some blockbuster drugs  including Gilead Sciences Inc's highly effective but expensive hepatitis C drug  Sovaldi.",
        "date": "04012016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Drugmakers say Japan R&D spending at risk after government forces price cuts "
    },
    {
        "content": "Gilead Sciences Inc on Wednesday will attempt to wipe out $200 million in damages for infringing two Merck & Co patents with its blockbuster hepatitis C treatments by claiming that Merck was dishonest in obtaining the patents  an argument that attorneys say could be difficult to prove.",
        "date": "03292016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead says Merck 'deceitful' in hepatitis C drug patent fight "
    },
    {
        "content": "SAN JOSE  Calif.  March 24 A federal jury on Thursday ordered Gilead Sciences Inc to pay Merck & Co  $200 million in damages for infringing two Merck patents related to a lucrative cure for hepatitis C.",
        "date": "03242016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead ordered to pay Merck $200 mln in hepatitis C drug patent dispute "
    },
    {
        "content": "Wall Street closed lower on Wednesday as oil and materials share prices dropped while investors remained cautious a day after deadly bombing attacks in Belgium. | Video ",
        "date": "03242016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Wall Street rally fizzles out as oil  materials fall "
    },
    {
        "content": "SAN JOSE Merck & Co told a federal jury on Tuesday it was seeking more than $2 billion in damages from rival Gilead Sciences Inc after the jury upheld the validity of two Merck patents in a high-profile dispute over Gilead's blockbuster cure for hepatitis C.",
        "date": "03232016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Merck patents on Hepatitis C treatment found valid in Gilead dispute "
    },
    {
        "content": "SAN JOSE  Calif. /NEW YORK A federal jury on Thursday ordered Gilead Sciences Inc to pay Merck & Co  $200 million in damages for infringing two Merck patents related to a lucrative cure for hepatitis C.",
        "date": "03252016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead ordered to pay Merck $200 mln in hepatitis C drug patent dispute "
    },
    {
        "content": "SAN JOSE A federal jury on Tuesday upheld the validity of two Merck & Co patents in a high-profile dispute with rival Gilead Sciences Inc  which could be forced to hand over a portion of the billions of dollars in revenue from its blockbuster cure for hepatitis C.",
        "date": "03222016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Merck patents on Hepatitis C treatment found valid in Gilead dispute "
    },
    {
        "content": "* Indexes down: Dow 0.51 pct  S&P 0.63 pct  Nasdaq 1 pct   (Updates to afternoon)",
        "date": "03232016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Dropping commodities prices drag down Wall Street "
    },
    {
        "content": "SAN JOSE  Calif. /NEW YORK A federal jury on Thursday ordered Gilead Sciences Inc  to pay Merck & Co  $200 million in damages for infringing two Merck patents related to a lucrative cure for hepatitis C.",
        "date": "03252016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead ordered to pay Merck $200 million in hepatitis C drug patent dispute "
    },
    {
        "content": "NEW YORK  March 22 A federal jury on Tuesday upheld the validity of two Merck & Co patents in a high-profile dispute with rival Gilead Sciences Inc  which could be forced to hand over a portion of the billions of dollars in revenue from its blockbuster cure for hepatitis C.",
        "date": "03222016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Merck patents on Hepatitis C treatment found valid in dispute with Gilead "
    },
    {
        "content": "* Indexes down: Dow 0.16 pct  S&P 0.35 pct  Nasdaq 0.73 pct   (Updates to early afternoon)",
        "date": "03232016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Energy slide drags down indexes "
    },
    {
        "content": "SAN JOSE  Calif. /NEW YORK  March 24 A federal jury on Thursday ordered Gilead Sciences Inc to pay Merck & Co $200 million in damages for infringing two Merck patents related to a lucrative cure for hepatitis C.",
        "date": "03252016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 3-Gilead ordered to pay Merck $200 mln in hepatitis C drug patent dispute "
    },
    {
        "content": "* Indexes down: Dow 0.13 pct  S&P 0.22 pct  Nasdaq 0.56 pct   (Adds details  changes comment  updates prices)",
        "date": "03232016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Decline in energy stocks weighs on Wall St "
    },
    {
        "content": "SAN JOSE  March 22 Merck & Co told a federal jury on Tuesday it was seeking more than $2 billion in damages from rival Gilead Sciences Inc after the jury upheld the validity of two Merck patents in a high-profile dispute over Gilead's blockbuster cure for hepatitis C.",
        "date": "03232016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 3-Merck patents on Hepatitis C treatment found valid in Gilead dispute "
    },
    {
        "content": "NEW YORK  March 18 Shares of Gilead Sciences Inc  are trading at ultra cheap levels as investors broadly shed biotech holdings and question what the company could do for an encore after several years of torrid growth.",
        "date": "03182016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead shares look cheap but investors fret over growth "
    },
    {
        "content": "March 9 A Florida man admitted to conducting insider trading based on a tip he received from a former Morgan Stanley broker about Gilead Sciences Inc's  planned $11.2 billion purchase of Pharmasset Inc in 2011  federal prosecutors said.",
        "date": "03092016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Florida man pleads guilty in Gilead insider trading case "
    },
    {
        "content": "* U.S. Food And Drug Administration Approves Gilead's Second Taf-Based single tablet regimen odefsey\u007f (emtricitabine  rilpivirine  tenofovir alafenamide) for the treatment of HIV-1 infection",
        "date": "03012016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences says U.S. FDA approves Odefsey "
    },
    {
        "content": "Gilead Sciences Inc's experimental cocktail to treat HIV received a green light from European regulators on Friday  boosting the chances of the drug being formally approved by the European Commission.",
        "date": "02262016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead's HIV drug gets closer to getting Europe approval "
    },
    {
        "content": "Feb 26 Gilead Sciences Inc's  experimental cocktail to treat HIV received a green light from European regulators on Friday  boosting the chances of the drug being formally approved by the European Commission.",
        "date": "02262016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-Gilead's HIV drug gets closer to getting Europe approval "
    },
    {
        "content": "* Recommends Approval Of CSL Ltd's albutrepenonacog alfa to treat Haemophilia b",
        "date": "02262016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead's experimental cocktail for HIV gets positive EMA opinion "
    },
    {
        "content": "* Drug combination shows effective response in hep c patients",
        "date": "02172016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Regulus hep C combo drug effective in mid-stage study "
    },
    {
        "content": "Feb 16 The U.S. Food and Drug Administration has expanded the use of Gilead Sciences Inc's blockbuster drug Harvoni to some hepatitis C patients in the advanced stage of cirrhosis  including those who have undergone liver transplant.",
        "date": "02162016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "FDA expands use of Gilead's liver drug to rare subset of patients "
    },
    {
        "content": "NEW YORK The tumble in share prices for biotechnology stocks has created some buying opportunities  with drugmakers Celgene Corp  and Gilead Sciences  poised for a 30 percent rise over the next year  Barron's said.",
        "date": "02082016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Celgene  Gilead Sciences shares could rise 30 percent: Barron's "
    },
    {
        "content": "LONDON  Feb 3 Drug companies are likely to launch seven \"blockbuster\" drugs in 2016  each with $1 billion-plus annual sales potential  led by new treatments for liver disease and HIV  according to a Thomson Reuters analysis.",
        "date": "02032016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Seven $1 billion-plus drugs seen reaching market in 2016 "
    },
    {
        "content": "LOS ANGELES Gilead Sciences Inc's  hepatitis C drug sales edged past Wall Street estimates in the fourth quarter  helped by strong sales in Japan  but U.S. results were weaker than expected.",
        "date": "02022016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead hepatitis C drug sales beat estimates  but growth stalls "
    },
    {
        "content": "LOS ANGELES  Feb 2 Gilead Sciences Inc's  hepatitis C drug sales edged past Wall Street estimates in the fourth quarter  helped by strong sales in Japan  but U.S. results were weaker than expected.",
        "date": "02022016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead hepatitis C drug sales beat estimates  but growth stalls "
    },
    {
        "content": "Feb 2 Gilead Sciences Inc's sales of hepatitis C drugs beat Wall Street estimates in the fourth quarter  helping to push the biotechnology company's shares 2 percent higher on Tuesday.",
        "date": "02022016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead hepatitis C drug sales edge past Wall Street estimates "
    },
    {
        "content": "Massachusetts' attorney general is studying whether prices of Gilead Sciences' blockbuster treatments for hepatitis C violate state law  according to a letter the prosecutor sent to the California-based drugmaker.",
        "date": "01272016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Massachusetts official challenges Gilead's hepatitis C drug prices "
    },
    {
        "content": "Jan 29 U.S. health insurers and pharmacy benefit managers expect the launch of Merck & Co Inc's new hepatitis C pill to improve their leverage in price negotiations with drugmakers.",
        "date": "01292016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-Payers see price leverage with entry of Merck hepatitis C drug "
    },
    {
        "content": "Jan 27 Massachusetts' attorney general is studying whether prices of Gilead Sciences' blockbuster treatments for hepatitis C violate state law  according to a letter the prosecutor sent to the California-based drugmaker.",
        "date": "01272016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 3-Massachusetts official challenges Gilead's hepatitis C drug prices "
    },
    {
        "content": "Jan 27 Massachusetts' attorney general is studying whether the prices of Gilead Sciences Inc's  blockbuster treatments for hepatitis C violate state law  according to a letter the prosecutor sent to the California drugmaker.",
        "date": "01272016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Massachusetts challenges Gilead's hepatitis C drug prices "
    },
    {
        "content": "Jan 29 U.S. pharmacy benefit managers expect the launch of Merck & Co Inc's new hepatitis C pill to improve their leverage in price negotiations with drugmakers.",
        "date": "01292016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Payers see price leverage with entry of Merck hepatitis C drug "
    },
    {
        "content": "U.S. regulators on Thursday approved a new once-daily pill for the liver-destroying hepatitis C virus made by Merck & Co Inc  which said it will sell the drug at a lower list price than its competitors.",
        "date": "01292016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "FDA approves Merck's new hepatitis C pill "
    },
    {
        "content": "Jan 28 U.S. regulators on Thursday approved a new once-daily pill for the liver-destroying hepatitis C virus made by Merck & Co Inc  which said it will sell the drug at a lower list price than its competitors.",
        "date": "01292016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-U.S. FDA approves Merck's new hepatitis C pill "
    },
    {
        "content": "* Gilead Sciences through subsidiary Gilead Biopharmaceutics Ireland Unlimited company subscribing capital increase and thus receiving 6 760 701 new Galapagos shares  indirectly holds 14.75 pct of Galapagos shares\u007f  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "01252016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead holds 14.75% of Galapagos shares\u007f "
    },
    {
        "content": "* Said Galapagos and Gilead have been cleared by U.S. Federal trade Commission to close global partnership on filgotinib",
        "date": "01132016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "BRIEF-Gilead and Galapagos global partnership cleared by U.S. Federal Trade Commission "
    },
    {
        "content": "* Indexes up: Dow 0.13 pct  S&P 0.22 pct  Nasdaq 0.19 pct   (Updates to open)",
        "date": "01052016",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "US STOCKS-Wall St higher as investors recover from selloff "
    },
    {
        "content": "Gilead Sciences Inc said its experimental hepatitis B drug was found safer than but as effective as its approved treatment  Viread  in two late-stage studies.",
        "date": "01052016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead's hep B drug as effective as Viread but safer "
    },
    {
        "content": "Jan 5 Gilead Sciences Inc said its experimental hepatitis B drug was found safer than but as effective as its approved treatment  Viread  in two late-stage studies.",
        "date": "01052016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-Gilead's hep B drug as effective as Viread but safer "
    },
    {
        "content": "Jan 5 Gilead Sciences Inc said its once-daily experimental hepatitis B drug was found to be as effective as its approved drug  Viread  in two late-stage studies.",
        "date": "01052016",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead's hep B drug succeeds in late-stage trials "
    },
    {
        "content": "BRUSSELS  Dec 17 Belgium's Galapagos  has signed a deal potentially worth more than $2 billion with U.S. firm Gilead to develop a drug targeting inflammatory diseases  reviving a project abandoned by former partner AbbVie.",
        "date": "12172015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "UPDATE 1-Belgium's Galapagos signs $2 bln deal with U.S. company Gilead "
    },
    {
        "content": "BRUSSELS Belgian biotech company Galapagos  has signed a development deal for drugs targeting inflammatory diseases potentially worth more than $2 billion with U.S. group Gilead .",
        "date": "12172015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Belgium's Galapagos signs $2 billion deal with U.S. group Gilead "
    },
    {
        "content": "BRUSSELS  Dec 17 Belgian biotech company Galapagos has signed a development deal for drugs targeting inflammatory diseases potentially worth more than $2 billion with U.S. group Gilead.",
        "date": "12172015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Belgium's Galapagos signs $2 bln deal with US group Gilead "
    },
    {
        "content": "* Galapagos and Gilead announce global partnership to develop filgotinib for the treatment of rheumatoid arthritis and other inflammatory diseases\u007f",
        "date": "12172015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Galapagos and Gilead announce global partnership "
    },
    {
        "content": "U.S. state Medicaid programs spent $1.3 billion before rebates in 2014 on Gilead Sciences' new hepatitis C drugs to treat fewer than 2.4 percent of enrollees with the liver disease  according to a U.S. Senate investigation into pricing of the blockbuster medicines.",
        "date": "12012015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead put profit ahead of hepatitis C patients: U.S. Senate report "
    },
    {
        "content": "Dec 1 U.S. state Medicaid programs spent $1.3 billion before rebates in 2014 on Gilead Sciences' new hepatitis C drugs to treat fewer than 2.4 percent of enrollees with the liver disease  according to a U.S. Senate investigation into pricing of the blockbuster medicines.",
        "date": "12012015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead put profit ahead of hepatitis C patients -U.S. Senate report "
    },
    {
        "content": "Nov 16 A late stage trial of a Gilead Sciences  drug in previously treated patients with a particular type of leukemia was unblinded early after independent monitors determined the medicine provided significant benefit in delaying worsening of the disease  the company said on Monday.",
        "date": "11162015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead leukemia drug trial unblinded early due to success "
    },
    {
        "content": "Drugmaker Gilead Sciences Inc said on Thursday the U.S. Food and Drug Administration had approved the expanded use of its blockbuster hepatitis C drug  Harvoni.",
        "date": "11122015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "U.S. FDA approves Gilead's hepatitis C drug for expanded use "
    },
    {
        "content": "Gilead Sciences Inc said the U.S. Food and Drug Administration had approved its HIV drug cocktail  Genvoya  to treat patients aged 12 and above.",
        "date": "11052015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "FDA approves Gilead Sciences' HIV drug cocktail "
    },
    {
        "content": "Nov 5 Gilead Sciences Inc said the U.S. Food and Drug Administration had approved its HIV drug cocktail  Genvoya  to treat patients aged 12 and above.",
        "date": "11052015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-FDA approves Gilead Sciences' HIV drug cocktail "
    },
    {
        "content": "Gilead Sciences Inc  on Tuesday said its quarterly profit rose 70 percent  but sales growth for its hepatitis C drugs flattened as health insurers limited access to the expensive treatments.",
        "date": "10272015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead hepatitis C drug sales trend flattens  shares dip "
    },
    {
        "content": "Oct 27 Gilead Sciences Inc on Tuesday said its quarterly profit rose 70 percent  but sales growth for its hepatitis C drugs flattened as health insurers limited access to the expensive treatments.",
        "date": "10272015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 3-Gilead hepatitis C drug sales trend flattens  shares dip "
    },
    {
        "content": "Oct 27 Gilead Sciences Inc on Tuesday said its quarterly profit rose 70 percent  but sales of its key hepatitis C drugs were largely in line with Wall Street estimates  and shares of the biotechnology company were little changed.",
        "date": "10272015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead 3rd quarter profit rises  hepatitis C drug sales in line "
    },
    {
        "content": "Oct 22 Drugmaker Gilead Sciences Inc  said data from a late-stage study showed that its experimental drug  Genvoya  showed reduced side-effects compared with an older version of the drug in treating HIV-infected patients over a longer term.",
        "date": "10222015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead's new HIV drug shows lower side-effects over longer term "
    },
    {
        "content": "Sept 29 A seven-day selloff of U.S. biotechnology stocks has hit sector investors - especially hedge funds - hard. But some managers say it was overdone and are already eyeing bargains such as Gilead Sciences Inc and Amgen Inc.",
        "date": "09292015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "U.S. biotech bloodbath hits hedge funds but some bargains emerge "
    },
    {
        "content": "WASHINGTON  Sept 28 Five Florida residents including two attorneys and an accountant will collectively pay about $489 000 to settle civil charges over insider-trading ahead of Gilead Science's acquisition of Pharmasset  U.S. regulators said Monday.",
        "date": "09282015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "U.S. settles insider trading charges tied to Gilead acquisition "
    },
    {
        "content": "Sept 21 Gilead Sciences Inc is edging closer to the approval of the first drug to fight all forms of hepatitis C as the drugmaker's experimental combination showed high rates of effectiveness in four late-stage studies.",
        "date": "09212015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead experimental drug fights all forms of hep C: data "
    },
    {
        "content": "Gilead Sciences Inc said its experimental combination treatment was effective against all forms of hepatitis C infection  citing data from four late-stage studies.",
        "date": "09212015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead combo drug fights all forms of hep C infection: data "
    },
    {
        "content": "Sept 1 Gilead Sciences Inc said on Wednesday its experimental fixed-dose combination treatment for HIV proved as effective in a late-stage study as the company's widely used Truvada combo pill but with significantly less loss of bone mineral density and kidney function.",
        "date": "09022015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead combo HIV pill matches Truvada efficacy but safer in trial "
    },
    {
        "content": "Sept 2 Gilead Sciences Inc said on Wednesday its experimental fixed-dose combination treatment for HIV proved as effective in a late-stage study as the company's widely used Truvada combo pill but with significantly less loss of bone mineral density and kidney function.",
        "date": "09022015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-Gilead combo HIV pill matches Truvada efficacy but safer in trial "
    },
    {
        "content": "Gilead Sciences Inc  said on Tuesday sales of its hepatitis C drugs hit a record of nearly $5 billion  surpassing Wall Street estimates as strong demand offset pricing pressures and restrictions on patient use from U.S. health insurers.",
        "date": "07282015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead hepatitis C sales beat Wall Street  sales outlook raised "
    },
    {
        "content": "* Product sales rise 27 percent to $8.1 billion   (Adds company comment  updates share price)",
        "date": "07282015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead hepatitis C sales beat Wall Street  sales outlook raised "
    },
    {
        "content": "* Indexes close up: Dow 1.09 pct  S&P 1.24 pct  Nasdaq 0.98 pct   (Updates to close)",
        "date": "07282015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Wall Street ends sharply higher as China jitters ebb "
    },
    {
        "content": "July 28 Gilead Sciences Inc said on Tuesday its quarterly net  profit rose 32 percent  driven by sales of hepatitis C drugs that beat Wall Street estimates.",
        "date": "07282015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead 2nd-quarter profit increases 32 pct  2015 outlook raised "
    },
    {
        "content": "* Indexes up: Dow 1.06 pct  S&P 1.21 pct  Nasdaq 0.99 pct   (Updates to afternoon trade)",
        "date": "07282015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Wall Street rises after China market steadies "
    },
    {
        "content": "NEW YORK/SHANGHAI China has rejected a Gilead Sciences Inc patent application related to its costly hepatitis C drug  a U.S. advocacy group said  adding the move may lead to other countries to consider rejecting patents for the controversial treatment.",
        "date": "06192015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "China rejects patent linked to Gilead hepatitis C drug "
    },
    {
        "content": "June 19 China has rejected Gilead Sciences Inc's application for a new patent related to its costly hepatitis C drug Sovaldi  removing a potential barrier to generic versions of the drug there  a U.S. legal group announced on Friday.",
        "date": "06192015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "China rejects Gilead hepatitis C drug patent -advocacy group "
    },
    {
        "content": "A federal judge has dismissed a whistleblower lawsuit accusing drugmaker Gilead Sciences Inc of distributing HIV/AIDS drugs for about three years after switching manufacturers without government approval.",
        "date": "06152015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead gets whistleblower case over AIDS drug tossed "
    },
    {
        "content": "Drug developer GlobeImmune Inc said its experimental hepatitis B drug did not reduce infection in patients after 24 weeks of treatment in a mid-stage study  sending the company's shares down as much as 60 percent to a record low.",
        "date": "05272015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "GlobeImmune Hep B drug fails mid-stage study  shares plunge "
    },
    {
        "content": "* Shares fall as much as 60 pct to record low   (Adds background  analyst comment; updates shares)",
        "date": "05272015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-GlobeImmune Hep B drug fails mid-stage study  shares plunge "
    },
    {
        "content": "May 27 GlobeImmune Inc said its experimental hepatitis B drug did not meet the main goal of reducing infection in patients after 24 weeks  in a mid-stage trial.",
        "date": "05272015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "GlobeImmune  Gilead Hep B drug fails in mid-stage study "
    },
    {
        "content": "U.S. stocks bounced back sharply on Friday as investors snapped up beaten-down shares in the healthcare and technology sectors  and as data gave further signs of a pickup in the economy. | Video ",
        "date": "05012015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Wall St. ends up sharply as investors buy beaten-down shares "
    },
    {
        "content": "May 1 U.S. stocks bounced back sharply on Friday as investors snapped up beaten-down shares in the healthcare and technology sectors  and as data gave further signs of a pickup in the economy.",
        "date": "05012015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "CORRECTED-US STOCKS-Wall St ends up sharply as investors buy beaten-down shares "
    },
    {
        "content": "* Indexes up: Dow 0.95 pct  S&P 0.98 pct  Nasdaq 1.15 pct   (Updates to late afternoon)",
        "date": "05012015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Wall St rebounds as investors buy beaten-down shares "
    },
    {
        "content": "* Indexes up: Dow 0.7 pct  S&P 0.7 pct  Nasdaq 0.8 pct   (Updates to afternoon)",
        "date": "05012015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Nasdaq snaps four-day losing streak as health stocks rebound "
    },
    {
        "content": "* Indexes up: Dow 0.7 pct  S&P 0.6 pct  Nasdaq 0.8 pct   (Updates to open)",
        "date": "05012015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Wall St opens higher as tech  health stocks rebound "
    },
    {
        "content": "LOS ANGELES Gilead Sciences Inc on Thursday said its quarterly profit nearly doubled  driven by strong sales of its hepatitis C drugs  as it topped Wall Street estimates.",
        "date": "04302015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead first-quarter profit doubles on strong hepatitis C drug sales "
    },
    {
        "content": "LOS ANGELES  April 30 Gilead Sciences Inc  on Thursday said its quarterly profit nearly doubled  driven by strong sales of its hepatitis C drugs  as it topped Wall Street estimates.",
        "date": "04302015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead first-quarter profit doubles on strong hepatitis C drug sales "
    },
    {
        "content": "* Indexes down: Dow 1.1 pct  S&P 1 pct  Nasdaq 1.6 pct   (Updates close with LinkedIn  solar company shares down after the bell  Gilead up  small caps down  new quote)",
        "date": "04302015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Wall St drops with tech shares; LinkedIn falls late "
    },
    {
        "content": "April 30 Gilead Sciences Inc said on Thursday its quarterly net profit nearly doubled  driven by sales of its novel hepatitis C drugs  as it topped Wall Street estimates.",
        "date": "04302015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead 1st-qtr profit doubles on strong hepatitis C drug sales "
    },
    {
        "content": "NEW YORK  April 24 Healthcare companies on a seven-year tear have been top performers so far in 2015  helping to push broad stock indexes to record levels  but traders are now looking to protect themselves from a selloff as they await major earnings reports in the sector.",
        "date": "04242015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Wall St Week Ahead-Investors seek protection against healthcare stock decline "
    },
    {
        "content": "LONDON Gilead Sciences is seeking to convince governments and multilateral agencies worldwide that hepatitis C can be eliminated with a demonstration project in Georgia offering free drugs to all those who need them.",
        "date": "04222015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead uses Georgia as free-drug testbed for hepatitis C elimination "
    },
    {
        "content": "* Indexes: Dow up 0.34 pct  S&P up 0.18 pct  Nasdaq off 0.01 pct",
        "date": "03232015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "CORRECTED-US STOCKS-Wall St little changed as energy retreats "
    },
    {
        "content": "March 23 Gilead Sciences Inc shares slid 2 percent on Monday after the company warned about potentially fatal risks for patients being treated with its top-selling hepatitis c drugs who also take the potent heart drug amiodarone.",
        "date": "03232015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead shares dip after warning about hepatitis C drug interaction "
    },
    {
        "content": " ",
        "date": "03232015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Stocks up as dollar adds to losses  oil gains "
    },
    {
        "content": "U.S. regulators have accepted Bristol-Myers Squibb Co's re-submitted marketing application for an experimental hepatitis C treatment after the drugmaker was forced last year to withdraw its initial request.",
        "date": "03122015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "FDA to review re-submitted Bristol-Myers hepatitis C drug "
    },
    {
        "content": "March 12 U.S. regulators have accepted Bristol-Myers Squibb Co's re-submitted marketing application for an experimental hepatitis C treatment after the drugmaker was forced last year to withdraw its initial request.",
        "date": "03122015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-FDA to review re-submitted Bristol-Myers hepatitis C drug "
    },
    {
        "content": "* Natco to pay Gilead royalties on sales of drugs   (Adds comments from Delhi Network of Positive People  BDR Pharma MD  stock price)",
        "date": "03022015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "UPDATE 1-India's Natco Pharma ties up with Gilead on hepatitis C drugs "
    },
    {
        "content": "MUMBAI  March 2 India's Natco Pharma Limited  said on Monday it signed a licensing deal with Gilead Sciences Inc to make and sell generic versions of the U.S. drugmaker's chronic hepatitis C medicines.",
        "date": "03022015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "India's Natco Pharma ties up with Gilead on hepatitis C drugs "
    },
    {
        "content": "Ninety-seven percent of hepatitis C patients also infected with HIV were cured of the liver-destroying virus after 12 weeks of treatment with Bristol-Myers Squibb's daclatasvir and Gilead Sciences' Sovaldi  according to data from a study presented on Thursday.",
        "date": "02262015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Bristol hep C drug helps cure 97 percent of HIV coinfected patients: study "
    },
    {
        "content": "Feb 26 Ninety-seven percent of hepatitis C patients also infected with HIV were cured of the liver-destroying virus after 12 weeks of treatment with Bristol-Myers Squibb's daclatasvir and Gilead Sciences'  Sovaldi  according to data from a study presented on Thursday.",
        "date": "02262015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Bristol hep C drug helps cure 97 pct of HIV coinfected patients-study "
    },
    {
        "content": "NEW YORK  Feb 10 Gilead Sciences Inc  said on Tuesday it expects the number of hepatitis C patients treated in Europe with its Sovaldi drug to increase dramatically this year  and that approvals for the newer combination pill  Harvoni  could come quickly.",
        "date": "02102015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead expects big increase in Europeans treated with hep C drug "
    },
    {
        "content": "Achillion Pharmaceuticals Inc's experimental hepatitis C drug  when used with Gilead Sciences Inc's Sovaldi  eradicated signs of the virus in six weeks  the shortest duration and highest response achieved by any two-drug treatment.",
        "date": "02092015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Promising data bodes well for all-Achillion hep C treatment "
    },
    {
        "content": "* Indexes down: Dow 0.28 pct  S&P 0.12 pct  Nasdaq 0.02 pct   (Updates to afternoon trade  commentary)",
        "date": "02092015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Wall St down on China  Greek worry; energy gains "
    },
    {
        "content": "* Study shows Achillion's inhibitor looks best-in-class: analyst",
        "date": "02092015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Promising data bodes well for all-Achillion hep C treatment "
    },
    {
        "content": "* Indexes off: Dow 0.33 pct  S&P 0.18 pct  Nasdaq 0.24 pct   (Updates to late morning trade)",
        "date": "02092015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Wall St dips on China  Greek worry; energy gains "
    },
    {
        "content": "* Qualcomm near deal with China on antitrust dispute  shares climb",
        "date": "02092015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Wall St dips after China data; Greek worry continues "
    },
    {
        "content": "* Futures off: Dow 105 pts  S&P 12 pts  Nasdaq 24 pts   (Adds quote  updates prices)",
        "date": "02092015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-Wall St to open lower on China data  Greek worry "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P off 0.3 pct  Nasdaq down 0.1 pct   (Updates to afternoon)",
        "date": "02042015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "US STOCKS-S&P  Nasdaq slip after 2-day run up; energy drops with oil "
    },
    {
        "content": "Gilead Sciences Inc  on Tuesday said it is offering steeper-than-expected discounts on its hepatitis C drugs to health insurers and other group payers who had complained about the price  and the drugmaker's shares slid more than 5 percent.",
        "date": "02032015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead boosts hepatitis C drug discounts  shares slide "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P off 0.4 pct  Nasdaq down 0.2 pct   (Updates to midday  changes byline)",
        "date": "02042015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "US STOCKS-S&P  Nasdaq down after 2-day run up; biotechs  energy fall "
    },
    {
        "content": "Feb 3 Gilead Sciences Inc on Tuesday said it is offering steeper-than-expected discounts on its hepatitis C drugs to health insurers and other group payers who had complained about the price  and the drugmaker's shares slid more than 5 percent.",
        "date": "02032015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Gilead boosts hepatitis C drug discounts  shares slide "
    },
    {
        "content": "Feb 4 Healthcare shares plunged on Wednesday  lead by biotechnology stocks  after Gilead Sciences Inc  said it gave health insurers steeper-than-expected discounts on its hepatitis C drugs  fueling worries that the broader sector would face increasing price pressure.",
        "date": "02042015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead drags healthcare shares down on drug price worries "
    },
    {
        "content": "* Estimates 2015 gross to net hepatitis C drug adjustments at 46 percent versus 22 percent at end 2014  Source text for Eikon:  Further company coverage:    (Reporting By Deena Beasley)",
        "date": "02032015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "BRIEF-Gilead Sciences estimates 2015 gross to net hepatitis C drug adjustments at 46 percent versus 22 percent at end 2014 "
    },
    {
        "content": "Feb 3 Gilead Sciences Inc posted strong quarterly sales of its hepatitis C drugs Harvoni and Sovaldi  sending the drugmaker's net profit up more than four-fold for the quarter.",
        "date": "02032015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead 4th-qtr profit quadruples  $3.84 bln in hep C drug sales "
    },
    {
        "content": "Feb 3 Pharmacy benefit manager Catamaran Corp  said on Tuesday that it will back Gilead Sciences Inc's  Harvoni and Sovaldi as exclusive hepatitis C treatments on its drug coverage lists.",
        "date": "02032015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Catamaran backs Gilead's hepatitis C treatment over AbbVie competitor "
    },
    {
        "content": "Jan 30 AbbVie Inc's chief executive said on Friday the company's new oral hepatitis C treatment Viekira Pak has the potential to capture a \"meaningful share\" of the U.S. market  where it is competing against Gilead Sciences .",
        "date": "01302015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "UPDATE 2-AbbVie expects hep C drug sales to top $3 billion per year "
    },
    {
        "content": "Jan 28 UnitedHealth Group Inc on Wednesday backed Gilead Sciences Inc's hepatitis C treatment Harvoni on its 2015 commercial drug coverage list over a new competitor  Viekira Pak from AbbVie Inc.",
        "date": "01282015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UnitedHealth backs Gilead's Harvoni as preferred hepatitis C treatment "
    },
    {
        "content": "AbbVie Inc's  chief executive said on Friday the company's new hepatitis C treatment Viekira Pak has the potential to capture a \"meaningful share\" of the U.S. market  where it is competing against Gilead Sciences .",
        "date": "01302015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "AbbVie expects more than $3 billion in annual hepatitis C drug sales "
    },
    {
        "content": "Jan 28 UnitedHealth Group Inc  the largest U.S. health insurer  on Wednesday backed Gilead Sciences Inc's Harvoni as the preferred hepatitis C treatment on its 2015 commercial drug coverage list  another victory for Gilead over competitor AbbVie Inc.",
        "date": "01282015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-UnitedHealth backs Gilead's Harvoni as preferred hepatitis C treatment "
    },
    {
        "content": "Aetna Inc   the third largest U.S. health insurer  raised its 2015 profit forecast after negotiating a price cut from Gilead Sciences Inc  on hepatitis C treatments for this year.",
        "date": "02032015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Health insurer Aetna raises 2015 profit forecast "
    },
    {
        "content": "Feb 3 Aetna Inc  the third largest U.S. health insurer  raised its 2015 profit forecast after negotiating a price cut from Gilead Sciences Inc on hepatitis C treatments for this year.",
        "date": "02032015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 3-Health insurer Aetna raises 2015 profit forecast "
    },
    {
        "content": "Jan 30 AbbVie Inc's top executive said on Friday that the company's new hepatitis C treatment Viekira Pak has the potential to capture a \"meaningful share\" of the U.S. market  where it is competing against Gilead Sciences Inc .",
        "date": "01302015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "AbbVie says it will take meaningful share of hepatitis C market "
    },
    {
        "content": "Jan 26 Pharmacy benefits manager EnvisionRx said on Monday it reached an agreement to provide its customers with Gilead Sciences Inc's hepatitis C drugs on an exclusive basis  the latest Gilead victory in a market share battle with AbbVie over their new treatments for the liver destroying virus.",
        "date": "01262015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "PBM EnvisionRx chooses Gilead hepatitis C drugs for its formulary "
    },
    {
        "content": "Aetna Inc  the third-largest U.S. health insurer  said it negotiated a discount with Gilead Sciences Inc for its hepatitis C treatment and will offer it as the preferred choice to nearly 11 million commercial customers.",
        "date": "01162015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Aetna backs Gilead's hepatitis C treatment  gets discount "
    },
    {
        "content": "Jan 16 Aetna Inc  the third-largest U.S. health insurer  said it negotiated a discount with Gilead Sciences Inc for its hepatitis C treatment and will offer it as the preferred choice to nearly 11 million commercial customers.",
        "date": "01162015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 2-Aetna backs Gilead's hepatitis C treatment  gets discount "
    },
    {
        "content": "Kite Pharma Inc plans to open conversations with insurers this year to lay the groundwork for an experimental cancer treatment that could cost hundreds of thousands of dollars if it works and is approved by regulators  top executives said this week.",
        "date": "01152015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Kite CEO plans to learn from Gilead's pricing playbook "
    },
    {
        "content": "Shares of Gilead Sciences Inc closed down 6 percent on Tuesday  after a pharmacy benefit manager said it would cover both Gilead and rival AbbVie Inc's hepatitis C offering  renewing concerns of pricing pressure.",
        "date": "01132015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "Gilead  AbbVie hit by fresh concerns on Hep C discounting "
    },
    {
        "content": "MUMBAI  Jan 14 India's patent office has rejected an application from U.S.-based Gilead Sciences Inc  for its hepatitis C drug Sovaldi  paving the way for local drugmakers to launch cheaper generic versions of the $1 000-a-pill medicine.",
        "date": "01142015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "India rejects Gilead's Hepatitis C drug patent request "
    },
    {
        "content": "Jan 16 Aetna Inc  the third-largest U.S. health insurer  said it has negotiated a discount with Gilead Sciences Inc for its hepatitis C treatment and will offer it as the preferred choice to nearly 11 million commercial customers.",
        "date": "01162015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "REFILE-Aetna backs Gilead's hepatitis C treatment  gets discount "
    },
    {
        "content": "Express Scripts  the largest U.S. pharmacy benefit manager  on Tuesday said cost savings on expensive cancer treatments could be achieved if the company were involved earlier in the decision-making process.",
        "date": "01132015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Express Scripts sees opportunity to lower cancer treatment cost "
    },
    {
        "content": "Jan 16 Aetna Inc  the third-largest U.S. health insurer  said it has negotiated a discount with Gilead Sciences Inc for its hepatitis C treatment and will offer it as the preferred choice to its nearly 11 million commercial customers.",
        "date": "01162015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "CORRECTED (OFFICIAL)-Aetna backs Gilead's hepatitis C treatment  gets discount "
    },
    {
        "content": "Jan 13 Express Scripts  the largest U.S. pharmacy benefit manager  on Tuesday said cost savings on expensive cancer treatments could be achieved if the company were involved earlier in the decision-making process.",
        "date": "01132015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-Express Scripts sees opportunity to lower cancer treatment cost "
    },
    {
        "content": "Jan 16 Aetna Inc  the third-largest U.S. health insurer  said it has negotiated a discount with Gilead Sciences Inc for its hepatitis C treatment and will offer it as the preferred choice to its nearly 20 million commercial customers.",
        "date": "01162015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Aetna backs Gilead's hepatitis C treatment and gets discount "
    },
    {
        "content": "MUMBAI  Jan 16 U.S.-based Gilead Sciences Inc  will appeal the Indian patent office's rejection of its application for hepatitis C drug Sovaldi  a move that could allow local drugmakers to launch cheaper generic versions of the $1 000-a-pill medicine.",
        "date": "01162015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Gilead to appeal India patent ruling on hepatitis C drug "
    },
    {
        "content": "Jan 8 Health insurer Anthem Inc on Thursday said it reached a deal under which Gilead Sciences Inc's hepatitis C drug Harvoni will be the primary treatment for patients infected with the most common strain of the liver-destroying virus.",
        "date": "01092015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "CORRECTED-UPDATE 1-Anthem selects Gilead as primary supplier of hepatitis C drugs "
    },
    {
        "content": "Jan 8 Health insurer Anthem Inc on Thursday said it reached a deal under which Gilead Sciences Inc's hepatitis C drug Harvoni will be the primary treatment for patients infected with the most common strain of the liver-destroying virus.",
        "date": "01082015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "UPDATE 1-Anthem selects Gilead as primary supplier of hepatitis C drugs "
    },
    {
        "content": "CVS Health Corp  one of the largest U.S. managers of drug benefits  said it would give preferred status to the hepatitis C treatments from Gilead Sciences and cover a new competing treatment from AbbVie Inc only as an exception.",
        "date": "01052015",
        "name": "Gilead Sciences Inc",
        "news_type": "topStory",
        "symbol": "GILD",
        "title": "CVS to cover Gilead hepatitis C treatment over AbbVie regimen "
    },
    {
        "content": "Jan 8 Health insurer Anthem Inc on Thursday said it reached a deal under which Gilead Sciences Inc's hepatitis C drug Harvoni will be the primary treatment for patients infected with the most common strain of the liver-destroying virus.",
        "date": "01082015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "Anthem selects Gilead as primary supplier of hepatitis C drugs "
    },
    {
        "content": "(Recasts with attribution from CVS; adds Express Scripts  analyst comment  background)",
        "date": "01052015",
        "name": "Gilead Sciences Inc",
        "news_type": "normal",
        "symbol": "GILD",
        "title": "UPDATE 1-CVS to cover Gilead hepatitis C treatment over AbbVie regimen "
    }
]