[
    {
        "content": "* General Mills Inc - ‍second-quarter adjusted gross margin and adjusted operating profit margin are expected to be below last year​",
        "date": "11142017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills reaffirms guidance for fiscal 2018 "
    },
    {
        "content": "* General Mills - ‍on Nov 6  board of General Mills Inc elected Jeffrey Harmening to serve as chairman of board  effective January 1  2018 - SEC filing​",
        "date": "11082017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills says elected Jeffrey Harmening to serve as chairman of board "
    },
    {
        "content": "* General Mills announces retirement of Ken Powell as chairman of the board and the election of Jeffrey Harmening as the new chairman Source text for Eikon: Further company coverage:",
        "date": "11082017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "BRIEF-General Mills announces retirement of Ken Powell as chairman of the board "
    },
    {
        "content": "* Files preliminary prospectus supplement related to a potential offering of notes due 2022 - SEC filing‍​ Source text: (http://bit.ly/2gb6R8y) Further company coverage:",
        "date": "10042017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills files preliminary prospectus supplement related to a potential offering of notes due 2022 "
    },
    {
        "content": "* General Mills Inc - ‍board of directors declared a quarterly dividend at prevailing rate of $0.49 per share​ Source text for Eikon: Further company coverage:",
        "date": "09262017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills says ‍board of directors declared a quarterly dividend at prevailing rate of $0.49 per share​ "
    },
    {
        "content": "General Mills Inc  reported a smaller-than-expected quarterly profit as yogurt and cereal sales declined in North America  sending the company's shares down 9 percent to their lowest levels in nearly two years.",
        "date": "09202017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "General Mills profit misses as U.S. yogurt sales sour "
    },
    {
        "content": "Sept 20 General Mills Inc reported a smaller-than-expected quarterly profit as yogurt and cereal sales declined in North America  sending the company's shares down 9 percent to their lowest levels in nearly two years.",
        "date": "09202017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 2-General Mills profit misses as U.S. yogurt sales sour "
    },
    {
        "content": "* CFO- we expect sales results to strengthen & 1st quarter margin headwinds to lessen in remainder of the year  driving growth on profit EPS in the 2nd half Source text for Eikon: Further company coverage:",
        "date": "09202017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "BRIEF-General Mills CFO says we expect sales results to strengthen "
    },
    {
        "content": "* Q1 earnings per share view $0.76 -- Thomson Reuters I/B/E/S",
        "date": "09202017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "BRIEF-General Mills reports Q1 adjusted non-GAAP EPS of $0.71 "
    },
    {
        "content": "Sept 20 Cheerios cereal maker General Mills Inc reported a 3.5 percent fall in quarterly sales  hurt by weak demand for its Yoplait Greek and Yoplait Light yogurts in North America.",
        "date": "09202017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills sales drop on weak demand for Yoplait yogurts "
    },
    {
        "content": "* FY 2018 earnings per share view $3.11  revenue view $15.33 billion -- Thomson Reuters I/B/E/S Source text for Eikon: Further company coverage:",
        "date": "09072017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills reaffirms guidance for fiscal 2018 "
    },
    {
        "content": "CHICAGO Target Corp  said on Monday it has hired two former executives from Wal-Mart Inc  and General Mills Inc  to join its food and beverage business  as the retailer seeks to revamp its grocery aisles.",
        "date": "08142017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "Target appoints Walmart  General Mills executives to shore up grocery business "
    },
    {
        "content": "CHICAGO  Aug 14 Target Corp said on Monday it has hired two former executives from Wal-Mart Inc and General Mills Inc to join its food and beverage business  as the retailer seeks to revamp its grocery aisles.",
        "date": "08142017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "Target appoints Walmart  General Mills execs to shore up grocery business "
    },
    {
        "content": "* Says Kendall J. Powell‍​'s FY 2017 total compensation was $9.2 million versus about $11 million in FY 2016 - SEC filing",
        "date": "08142017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "BRIEF-General Mills says Kendall Powell‍​'s FY 2017 total compensation was $9.2 mln "
    },
    {
        "content": "* Says  E-Commerce represents about 1.5 percent of company's total sales in U.S. Currently",
        "date": "07122017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills Inc expects E-Commerce sales to grow to 5 percent by fiscal year 2020 "
    },
    {
        "content": "* CEO -  we've pulled back too far on investments in some key categories and our overall execution was not up to our normal standards in fy2017",
        "date": "06282017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills CEO - We've pulled back too far on investments in some key categories in FY2017 "
    },
    {
        "content": "Cheerios cereal maker General Mills Inc  reported a better-than-expected quarterly profit and its first sales beat in a year  sending its shares up as much as 4.1 percent.",
        "date": "06282017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills posts first sales beat in a year  shares rise "
    },
    {
        "content": "* Shares rise as much as 4.1 pct (Adds details from conference call; updates shares)",
        "date": "06282017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 2-General Mills posts first sales beat in a year  shares rise "
    },
    {
        "content": "* General Mills reports fourth-quarter and full-year fiscal 2017 results; provides 2018 outlook",
        "date": "06282017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "BRIEF-General Mills reports Q4 earnings per share $0.69 "
    },
    {
        "content": "June 28 Cheerios cereal maker General Mills Inc reported a 7.7 percent rise in quarterly profit on Wednesday as the company kept a tight lid on costs and cut back on promotions.",
        "date": "06282017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills reports 7.7 pct rise in profit "
    },
    {
        "content": "A U.S. appeals court has rejected a request by former General Mills Inc employees who claimed they were laid off because of their age to overturn its recent decision sending their case to arbitration.",
        "date": "05162017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "8th Circuit rejects bid to revive General Mills age bias claims "
    },
    {
        "content": "* Report that 3G Capital is interested in General Mills is not true - CNBC",
        "date": "05042017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-Report that 3G Capital is interested in General Mills is not true - CNBC "
    },
    {
        "content": "CHICAGO  May 4 Central Grocers Inc  a wholesale grocery cooperative in the Chicago area  filed for bankruptcy on Thursday as it tried to close or sell businesses after struggling to adapt to consumer shifts to online and gourmet shopping and \"big box\" stores.",
        "date": "05042017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "Illinois' Central Grocers files for bankruptcy as winds down business "
    },
    {
        "content": "* General Mills Inc says a credit agreement entered previously was scheduled to terminate  subject to extension  on May 18  2021",
        "date": "05012017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills says a credit agreement entered previously was scheduled to terminate "
    },
    {
        "content": "May 3 Cheerios cereal maker General Mills Inc said its Chief Operating Officer Jeffrey Harmening will take over as chief executive from Ken Powell  who will retire next year.",
        "date": "05032017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills promotes COO Harmening to chief executive "
    },
    {
        "content": "* Jeff Harmening named chief executive officer of General Mills",
        "date": "05032017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "BRIEF-General Mills names Jeff Harmening CEO "
    },
    {
        "content": "NEW YORK  April 24 Wells Fargo & Co directors could have avoided a  shareholder backlash over a sales practices scandal if they had paid more attention to scores of whistleblowers who complained  in vain  for years.",
        "date": "04242017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "Wells Fargo board pays price for letting whistleblowers whistle in the wind "
    },
    {
        "content": "* General International Holdings  Inc reports 9.8 percent stake in Lightbridge Corp as of  August 2  2016 - sec filing Source text - http://bit.ly/2p4KOWC Further company coverage:",
        "date": "04212017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General International Holdings reports 9.8 pct stake in Lightbridge "
    },
    {
        "content": "A U.S. appeals court has sent age discrimination claims by nearly three dozen former General Mills Inc employees to individual arbitration  rejecting their allegations that a waiver they signed was invalid.",
        "date": "04172017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "8th Circuit sends General Mills age bias case to arbitration "
    },
    {
        "content": "* J&J Snack Foods Corp says partnership with General Mills by announcing launch of Pillsbury Churro Bites Source text for Eikon: Further company coverage:",
        "date": "04112017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-J&J Snack Foods Corp says partnership with General Mills by announcing launch of Pillsbury Churro Bites "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 07 (Fitch) Fitch Ratings has affirmed General Mills Inc.'s (General Mills) Long-Term Issuer Default Rating (IDR) at 'BBB+' and short-term IDR at F2. The ratings apply to approximately $9.7 billion of total outstanding debt. The Rating Outlook has been revised to Negative from Stable. A full list of rating actions follows at the end of this release. The Outlook revision to Negative reflects the potential risk that that Gen",
        "date": "04072017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "Fitch Affirms General Mills Inc.'s IDR at 'BBB+'; Outlook to Negative "
    },
    {
        "content": "General Mills Inc  reported its seventh straight decline in quarterly sales on Tuesday as the maker of Cheerios breakfast cereal limited discounting in a bid to boost margins  amid stiff pricing competition.",
        "date": "03212017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "General Mills' inability to cut prices eats into sales "
    },
    {
        "content": "* Expects FY organic sales to fall 4 pct   (Adds details  updates shares)",
        "date": "03212017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 2-General Mills' inability to cut prices eats into sales "
    },
    {
        "content": "* Indexes up: Dow 0.28 pct  S&P 0.32 pct  Nasdaq 0.40 pct   (Updates to open)",
        "date": "03212017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "US STOCKS-Wall Street higher as Apple gains; Nasdaq hits record high "
    },
    {
        "content": "* Futures up: Dow 10 pts  S&P 3.5 pts  Nasdaq 10.25 pts   (Adds details  comment  updates prices)",
        "date": "03212017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "US STOCKS-Wall St set to open higher  tracking European markets "
    },
    {
        "content": "March 21 Food maker General Mills Inc reported a bigger-than-expected 5.2 percent fall in quarterly sales on Tuesday  hurt by weak sales of yogurt and baking products in the United States  its biggest market.",
        "date": "03212017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "Cheerios maker General Mills' sales miss estimates "
    },
    {
        "content": "* Q3 earnings per share view $0.71 -- Thomson Reuters I/B/E/S",
        "date": "03212017",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "BRIEF-General Mills Q3 adjusted earnings per share $0.72 "
    },
    {
        "content": "* Says board of directors declared a quarterly dividend at prevailing rate of $0.48 per share  Source text for Eikon:  Further company coverage:",
        "date": "03142017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills declared quarterly dividend of $0.48/share "
    },
    {
        "content": "* Files for  offering of up to EURO 300 million of floating rate notes due 2019 - sec filing  Source text : http://bit.ly/2nrpgmT Further company coverage:",
        "date": "03162017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills files for offering of up to EURO 300 mln of floating rate notes due 2019 "
    },
    {
        "content": "* General Mills updates key financial targets for fiscal 2017",
        "date": "02172017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills updates key financial targets for fiscal 2017 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 10 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to  General Mills' $750 million 3.2% senior unsecured notes due 2027. Proceeds from  the notes along will commercial paper borrowings will be used to refinance the  $1 billion 5.7% senior unsecured notes due February 2017. The Rating Outlook is  Stable.  A full list of ratings follows at the end of this release. KEY RATING DRIVERS Strong Brands  Modest Growth: Fitch ",
        "date": "01102017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "Fitch Rates General Mills' $750MM Sr Unsecured Notes 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Files for potential notes offering  size not disclosed - sec filing",
        "date": "01092017",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills files for potential notes offering  size not disclosed "
    },
    {
        "content": "General Mills Inc  reported lower-than-expected quarterly profit and revenue as intense competition and lower spending on promotions hurt sales of its Yoplait yogurt and Progresso soups in the United States  its biggest market.",
        "date": "12202016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "Yoplait yogurt  Progresso soups drag on General Mills' sales "
    },
    {
        "content": "General Mills Inc   the maker of Cheerios cereal  said it would cut as many as 600 jobs globally as part of a new organizational structure and eliminate the position of international chief operating officer.",
        "date": "12052016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "General Mills to cut as many as 600 jobs globally "
    },
    {
        "content": "* New owners of plant intend to auction the remaining equipment in early 2017",
        "date": "11152016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills sells plant in Indiana to Investor Group "
    },
    {
        "content": "* General Mills elects Alicia S. Boler Davis to board of directors  Source text for Eikon:  Further company coverage:    ;))",
        "date": "11072016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills elects Alicia S. Boler Davis to board of directors "
    },
    {
        "content": "* General Mills Inc - announced anticipated departure of Christopher O'Leary  executive vice president and chief operating officer  international",
        "date": "10122016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills announces anticipated departure of Christopher O'Leary "
    },
    {
        "content": "* Shares rise as much as 8.2 pct   (Adds executive comments and company background; updates share move)",
        "date": "09292016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 2-ConAgra's profit beats on higher prices  less discounting "
    },
    {
        "content": "* Says declared a quarterly dividend at prevailing rate of $0.48 per share",
        "date": "09272016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills increases FY dividend by 8 percent to $1.92 per share "
    },
    {
        "content": "LONDON  Sept 26 A group of 40 investors managing $1.25 trillion in assets have launched a campaign to encourage 16 global food companies to change the way they source protein for their products to help to reduce environmental and health risks.",
        "date": "09262016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "Investors urge food companies to shift from meat to plants "
    },
    {
        "content": "* Executive on conf call says Q1 U.S. cereal net sales down 4 percent due to lower customer inventory levels",
        "date": "09212016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills CFO says 60 pct of co's yogurt portfolio to be renovated by year end - Conf call "
    },
    {
        "content": "General Mills Inc  reported a better-than-expected quarterly profit as lower expenses and cost-cutting programs helped limit the impact of weak sales in the United States.",
        "date": "09212016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills' profit beats estimates as costs fall "
    },
    {
        "content": "Sept 21 General Mills Inc reported a better-than-expected quarterly profit as lower expenses and cost-cutting programs helped limit the impact of weak sales in the United States.",
        "date": "09212016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 1-General Mills' profit beats estimates as costs fall "
    },
    {
        "content": "* Q1 earnings per share view $0.75 -- Thomson Reuters I/B/E/S",
        "date": "09212016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "BRIEF-General Mills reports fiscal 2017 first-quarter results "
    },
    {
        "content": "Sept 21 General Mills Inc reported a drop in quarterly net sales for the fifth straight quarter  hurt mainly by weak demand for its Yoplait yogurt and Progresso soup and the sale of its Green Giant frozen vegetable business.",
        "date": "09212016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills sales fall for fifth straight quarter "
    },
    {
        "content": "* General Mills teams up with Yahoo Esports as First Sponsor of New Live Shows  Source text for Eikon:  Further company coverage:",
        "date": "09122016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills teams up with Yahoo Esports as sponsor of New Live Shows "
    },
    {
        "content": "* FY2017 earnings per share view $3.11  revenue view $16.19 billion -- Thomson Reuters I/B/E/S",
        "date": "09072016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills reaffirms key fiscal 2017 financial targets "
    },
    {
        "content": "* General mills announces leadership changes in U.S. Retail and Europe-Australasia businesses",
        "date": "08302016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills makes leadership changes in U.S. Retail and Europe-Australasia businesses "
    },
    {
        "content": "* CEO Kendall J. Powell's 2016 total compensation was $11 million versus $13.4 million in 2015 - SEC Filing",
        "date": "08152016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills CEO Kendall J. Powell's 2016 total compensation $11 mln "
    },
    {
        "content": "* Expands the Good Table product line with new dinnertime solution  freezer to plate  Source text for Eikon:  Further company coverage:",
        "date": "08032016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills expands the Good Table product line "
    },
    {
        "content": "* To eliminate excess capacity  will close snacks manufacturing facility in Marília  Brazil",
        "date": "07212016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills to close snacks manufacturing facility in Marília  Brazil - SEC Filing "
    },
    {
        "content": "* Five varieties of gluten-free Cheerios cereals available in stores by end of summer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom : +1-646-223-8780)",
        "date": "07202016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills Canada Corp says 5 varieties of gluten-free Cheerios available by end of summer "
    },
    {
        "content": "* Two flavors of Betty Crocker cake mix sold in U.S.  one flavor sold in Canada added to company's announced flour recall from July 1  2016",
        "date": "07112016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills announces addition to July 1 flour recall "
    },
    {
        "content": "* Expanding its recall of Gold Medal flour  Wondra flour  and Signature Kitchens flour to include flour made earlier in fall",
        "date": "07012016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills expands flour recall to include additional dates from last fall "
    },
    {
        "content": "* General Mills reports fiscal 2016 results with EPS above previous guidance; increases margin expansion target",
        "date": "06292016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills reports Q4 adj earnings per share $0.66 "
    },
    {
        "content": "June 29 General Mills Inc  the maker of Cheerios cereal and Yoplait yogurt  reported a better-than-expected quarterly profit  helped by cost cuts and higher demand in markets outside the United States.",
        "date": "06292016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills quarterly profit beats estimates "
    },
    {
        "content": "* Partnership with Organic Valley to help about 20 dairy farms add around 3 000 acres to organic dairy production over next 3 years  Source text for Eikon:  Further company coverage:",
        "date": "06082016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills announces partnership with Organic Valley "
    },
    {
        "content": "* Recall is being issued as part of sunflower kernel supplier sunopta's ongoing national recall for potential presence of listeria monocytogenes",
        "date": "06022016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills issues recall of 4 flavors of Nature Valley bars "
    },
    {
        "content": "* Collaborating With Health Officials To Investigate An Ongoing  Multistate Outbreak Of E. Coli O121",
        "date": "05312016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills says recalling some brands of Flour Due to possible E. Coli contamination "
    },
    {
        "content": "* On May 18  2016  General Mills Inc terminated its five-year credit agreement  dated as of April 16  2012",
        "date": "05182016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills terminates two five-year credit agreements "
    },
    {
        "content": "* Uribe retired in 2015 from his role as global productivity and organization transformation officer at procter & gamble  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05032016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General mills elects Jorge Uribe to board "
    },
    {
        "content": "* General mills says achieved its 2015 targets related to ghg emissions and packaging within its direct operations  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "04132016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills achieves 2015 target for greenhouse gas emissions "
    },
    {
        "content": "* Net sales growth continues to be impacted by high levels of competitive activity in US yogurt and lower display merchandising",
        "date": "03232016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "BRIEF-General Mills- Sales growth continues to be impacted by competitive activity in U.S. yogurt and lower display merchandising- conf call "
    },
    {
        "content": "* In connection with project compass  expect to eliminate about 725 to 775 positions - SEC filing",
        "date": "03232016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "BRIEF-General Mills Inc says in connection with Project Compass  expects to eliminate about 725 to 775 positions - SEC filing "
    },
    {
        "content": "* Fy2016 earnings per share view $2.87  revenue view $16.64 billion -- Thomson Reuters I/B/E/S",
        "date": "03232016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "BRIEF-General Mills Q3 earnings per share $0.59 "
    },
    {
        "content": "March 23 General Mills Inc  the maker of Cheerios cereal and Yoplait yogurt  reported lower-than-expected quarterly sales  hurt by a strong dollar and weaker sales in the United States.",
        "date": "03232016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills sales miss on strong dollar  weak U.S. demand "
    },
    {
        "content": "General Mills Inc said on Friday it would begin putting labels on U.S. products that contain genetically engineered ingredients  a move it said was forced by a Vermont law that will require food packages in that state to include such information on July 1.",
        "date": "03182016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "Cheerios maker General Mills to label GMOs in U.S. products "
    },
    {
        "content": "March 18 General Mills Inc said on Friday it would begin putting labels on U.S. products that contain genetically engineered ingredients  a move it said was forced by a Vermont law that will require food packages in that state to include such information on July 1.",
        "date": "03182016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 1-Cheerios maker General Mills to label GMOs in U.S. products "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT) WEEK AHEAD  Markets lean into next week adjusting positions for the Federal Reserve  with the dollar experiencing more weakness due to rising inflation indicators and a more dovish outlook from the U.S. central bank. Stocks are expected to extend gains",
        "date": "03182016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "What to Watch in the Week Ahead and on Monday  March 21 "
    },
    {
        "content": "March 18 General Mills Inc on Friday said it would begin putting labels on its products that contain genetically engineered ingredients  a move that comes days after U.S. Senators failed to advance legislation aimed at blocking Vermont from requiring such labels on July 1.",
        "date": "03182016",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "Cheerios seller General Mills to label GMOs in products "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 12 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to  General Mills  Inc.'s (General Mills)  issuance of EUR500MM senior unsecured  notes due January 2020. The Rating Outlook is Stable.  The company plans to refinance upcoming maturities with the proceeds. The  company has a $250 million floating rate note (FRN)  a $500 million FRN and a  $250 million .875% note  all of which are due between Jan. 28 and 29 2016. Th",
        "date": "01122016",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "Fitch Rates General Mills's Sr. Unsecured EUR500 Notes 'BBB+'; Outlook Stable "
    },
    {
        "content": "General Mills Inc reported a bigger-than-expected drop in quarterly sales  hurt by a strong dollar and weak demand for its snacks and baking products in the United States  and cut its full-year sales forecast.",
        "date": "12172015",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "General Mills sales miss estimates on weak U.S. demand  strong dollar "
    },
    {
        "content": "* Co's U.S. retail sales fall 4 percent   (Adds details  updates share movement)",
        "date": "12172015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 2-General Mills sales miss estimates on weak US demand  strong dollar "
    },
    {
        "content": "Dec 17 General Mills Inc reported its second straight fall in quarterly sales  hurt by a strong dollar and weak demand for its snacks and baking products in the United States  and the company cut its full-year sales forecast.",
        "date": "12172015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "CORRECTED-UPDATE 1-General Mills cuts full-year sales forecast "
    },
    {
        "content": "Dec 17 General Mills Inc's quarterly sales fell 6 percent  the second straight quarter of decline  hurt by a strong dollar and weak demand for snacks and baking products in the United States  its biggest market.",
        "date": "12172015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills quarterly sales fall 6 pct "
    },
    {
        "content": "NEW YORK General Mills Inc said on Tuesday that it had reduced sodium by at least 20 percent in seven product categories  fewer than it had targeted  as part of the food industry's effort to cut back on an ingredient said to increase the risk of serious illnesses.",
        "date": "12152015",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "General Mills meets sodium-reduction goal in seven of ten product categories "
    },
    {
        "content": "NEW YORK  Dec 15 General Mills Inc said on Tuesday that it had reduced sodium by at least 20 percent in seven product categories  fewer than it had targeted  as part of the food industry's effort to cut back on an ingredient said to increase the risk of serious illnesses.",
        "date": "12152015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills meets sodium-reduction goal in 7 of 10 product categories "
    },
    {
        "content": "PARIS/BERLIN  Dec 8 Kellogg  Sony   Coca-Cola Enterprises and a group of other companies have committed to targets certified by independent assessors to cut their carbon emissions  they said on Tuesday.",
        "date": "12082015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "Kellogg  Sony and others sign up to emissions goals "
    },
    {
        "content": "Nov 24 General Mills Inc will use only cage-free eggs in its U.S. operations by 2025  it said on Tuesday  marking the first time the packaged food company has given a timeline for the switch.",
        "date": "11242015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills to use only cage-free eggs in U.S. by 2025 "
    },
    {
        "content": "NEW YORK  Nov 20 There are no picky eaters on Thanksgiving - as long as the menu is hormone and antibiotic free  locally grown and convenient.",
        "date": "11202015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "Wall St Week Ahead-Food stocks on the menu for Thanksgiving week "
    },
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit  click on http://www.reuters.com/summit/Investment16",
        "date": "11202015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "REUTERS SUMMIT-Heading into 2016  U.S. consumers look up  dress down "
    },
    {
        "content": "General Mills Inc is recalling 1.8 million boxes of gluten-free Cheerios cereal because they may contain wheat  which can cause adverse reactions in people with gluten allergies.",
        "date": "10052015",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "General Mills recalls 1.8 million boxes of gluten-free Cheerios "
    },
    {
        "content": "Oct 5 General Mills Inc is recalling 1.8 million boxes of gluten-free Cheerios cereal because they may contain wheat  which can cause adverse reactions in people with gluten allergies.",
        "date": "10052015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 1-General Mills recalls 1.8 mln boxes of gluten-free Cheerios "
    },
    {
        "content": "LONDON  Sept 29 The owners of Quorn  a line of meat-free packaged foods  is facing takeover interest from a range of parties from Asia  Europe and North America  as they look to cash in on the world's growing appetite for healthier food.",
        "date": "09292015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 2-Quorn fields takeover interest from range of parties -sources "
    },
    {
        "content": "Sept 22 General Mills Inc  the maker of Cheerios cereal and Yoplait yogurt  reported a better-than-expected quarterly net profit as U.S. sales showed further recovery.",
        "date": "09222015",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "UPDATE 1-General Mills profit beats estimates as US sales rise "
    },
    {
        "content": "Sept 22 General Mills Inc  the maker of Cheerios cereal and Yoplait yogurt  reported a 23.6 percent rise in quarterly net profit  helped by higher sales of its cereals  meals and yogurts in the United States.",
        "date": "09222015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills Q1 profit rises "
    },
    {
        "content": "Snack food company B&G Foods Inc  said it would buy General Mills Inc's  Green Giant frozen foods and Le Sueur canned vegetables brands for about $765 million to expand its distribution network and enter the frozen foods market.",
        "date": "09032015",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "B&G to buy General Mills' Green Giant frozen foods business "
    },
    {
        "content": "* B&G to also buy General Mills' Le Sueur canned vegetables unit",
        "date": "09032015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 2-B&G to buy General Mills' Green Giant frozen foods business "
    },
    {
        "content": "July 30 Bellisio Foods Inc  a U.S. maker and distributor of frozen meals sold under the Boston Market and Chili's brands  is exploring a sale it hopes could value it as much as $800 million  including debt  according to people familiar with the matter.",
        "date": "07302015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "Frozen meals company Bellisio Foods seeks sale -sources "
    },
    {
        "content": "French food group Bonduelle SCA  is in discussions to team up with Centerview Partners in a bid to acquire General Mills Inc's  Green Giant frozen and canned vegetable business  according to people familiar with the matter.",
        "date": "07212015",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "Exclusive: Bonduelle prepares bid for Green Giant "
    },
    {
        "content": "LONDON  July 21 European shares headed for a flat to slightly higher open on Tuesday  with investors focusing on company results as the second-quarter earnings season gathered pace in Europe.",
        "date": "07212015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "European Factors to Watch-Shares seen flat to higher  focus on earnings "
    },
    {
        "content": "French food group Bonduelle SCA  is in discussions to team up with Centerview Partners in a bid to acquire General Mills Inc's  Green Giant frozen and canned vegetable business  according to people familiar with the matter.",
        "date": "07202015",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "Exclusive: Bonduelle prepares bid for Green Giant - sources "
    },
    {
        "content": "NEW YORK By removing artificial colors and flavors and selling gluten-free cereals  General Mills Inc  Chief Executive Officer Ken Powell is betting his company can buck a broader decline in U.S. cereal sales.",
        "date": "07152015",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "General Mills hopes natural ingredients will boost U.S. cereal sales "
    },
    {
        "content": "General Mills Inc   the maker of Cheerios cereal and Betty Crocker cake mixes  said fourth-quarter profit halved as it recorded a $260 million charge to write down the value of one of its frozen and canned vegetable businesses.",
        "date": "07012015",
        "name": "General Mills Inc",
        "news_type": "topStory",
        "symbol": "GIS",
        "title": "General Mills profit halves due to $260 million impairment charge "
    },
    {
        "content": "July 1 General Mills Inc  the maker of Cheerios cereal and Betty Crocker cake mixes  said fourth-quarter profit halved as it recorded a $260 million charge to write down the value of one of its frozen and canned vegetable businesses.",
        "date": "07012015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "UPDATE 1-General Mills profit halves due to $260 mln impairment charge "
    },
    {
        "content": "July 1 General Mills Inc  the maker of Cheerios cereal and Betty Crocker cake mixes  said fourth-quarter profit halved as it recorded an intangible asset impairment charge of $260 million.",
        "date": "07012015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills profit halves due to asset impairment charge "
    },
    {
        "content": "NEW YORK  March 18 General Mill Inc  which owes its return to growth in the United States to its purchase of organic macaroni-and-cheese maker Annie's Inc and the popularity of its yogurt  faces a challenge with its traditional cereal brands.",
        "date": "03182015",
        "name": "General Mills Inc",
        "news_type": "normal",
        "symbol": "GIS",
        "title": "General Mills resumes U.S. growth  but without help from cereals "
    }
]