[
    {
        "content": "* Gaming And Leisure Properties Inc announces second quarter 2017 results",
        "date": "07272017",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming And Leisure Properties qtrly EPS $0.45 "
    },
    {
        "content": "* Gaming And Leisure Properties expands board with appointment of Barry F. Schwartz",
        "date": "05232017",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties expands board with appointment of Barry Schwartz "
    },
    {
        "content": "* Gaming And Leisure Properties Inc - CEO Peter M. Carlino's 2016 total compensation $12.0 million versus $16.8 million in 2015 - SEC Filing Source text (http://bit.ly/2ppStyW) Further company coverage:",
        "date": "04272017",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties Inc CEO Peter M. Carlino's 2016 total compensation $12.0 mln vs $16.8 mln in 2015 "
    },
    {
        "content": "* Gaming and leisure properties  inc. announces first quarter 2017 results",
        "date": "04272017",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "normal",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties posts Q1 EPS of $0.45 "
    },
    {
        "content": "* Gaming and Leisure Properties Inc announces acquisition of the real estate assets of Bally’S Casino Tunica and Resorts Casino Tunica",
        "date": "03282017",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties to acquire the real estate assets of Bally’S Casino Tunica and Resorts Casino Tunica "
    },
    {
        "content": "* Gaming and leisure properties expands board with appointment of Earl Shanks  Source text for Eikon:  Further company coverage:",
        "date": "03082017",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties expands board with appointment of Earl Shanks "
    },
    {
        "content": "* Gaming and Leisure Properties Inc Announces fourth quarter and full year 2016 results",
        "date": "02022017",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming And Leisure Properties Qtrly earnings per share $0.45 "
    },
    {
        "content": "* Gaming and leisure properties inc - revises full year guidance",
        "date": "11082016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties reports qtrly eps $0.43 "
    },
    {
        "content": "* Q2 earnings per share view $0.38  revenue view $211.7 million -- Thomson Reuters I/B/E/S",
        "date": "08092016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties Q2 earnings per share $ 0.39 "
    },
    {
        "content": "* Files for common stock offering of up to $400 million - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "08092016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "normal",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming And Leisure Properties files for stock offering up to $400 mln "
    },
    {
        "content": "* On June 1  shareholders approved amendment  restatement of articles of incorporation to declassify co's board - SEC filing",
        "date": "06022016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties shareholders approve declassification of board - SEC filing "
    },
    {
        "content": "* Announces pricing of secondary offering of common stock by selling shareholders",
        "date": "05192016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties announces pricing of secondary offering of common stock "
    },
    {
        "content": "* Gaming and leisure properties  inc. Announces q1 2016 results",
        "date": "04262016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming And Leisure Properties qtrly FFO per diluted common share $ 0.47 "
    },
    {
        "content": "* Colorado Ltd Gaming Control Commission grants approvals for co to complete its transaction with Gaming And Leisure Properties",
        "date": "04212016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Pinnacle Entertainment gets approval to complete deal with Gaming And Leisure Properties "
    },
    {
        "content": "* Pinnacle Entertainment receives Louisiana gaming control board approval to complete its proposed transaction with Gaming & Leisure Properties Inc",
        "date": "04182016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Pinnacle Entertainment gets approval to complete its deal with Gaming & Leisure Properties "
    },
    {
        "content": "* Gaming and leisure properties inc says notes will be offered in two tranches  first of which will be due 2022 and second of which will be due 2026",
        "date": "04112016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties says notes will be offered in two tranches "
    },
    {
        "content": "* Pinnacle Entertainment enters into definitive agreement to acquire the operations of the meadows racetrack and casino from Gaming & Leisure Properties Inc.",
        "date": "03292016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Pinnacle Entertainment to buy Meadows from Gaming & Leisure Properties for $138 mln "
    },
    {
        "content": "* Shareholder approval of transaction with pinnacle entertainment",
        "date": "03152016",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "BRIEF-Gaming and Leisure Properties shareholders approve transaction with Pinnacle "
    },
    {
        "content": "Gaming and Leisure Properties Inc   which buys real estate leased to casino operators  went hostile with its offer to buy Pinnacle Entertainment Inc's  real estate assets due to the casino operator's \"failure to engage\" in talks.",
        "date": "03092015",
        "name": "Gaming and Leisure Properties Inc",
        "news_type": "topStory",
        "symbol": "GLPI",
        "title": "Gaming and Leisure goes hostile with bid for Pinnacle's real estate "
    }
]