[
    {
        "content": "SAO PAULO  Nov 8 Brazilian airline Gol Linhas Aereas Inteligentes SA expects its occupancy rates to rise in the fourth quarter from a year earlier based on reservations for upcoming flights  according to a securities filing on Wednesday.",
        "date": "11082017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil's Gol sees aircraft occupancy rates rising in Q4 "
    },
    {
        "content": "* Contrarian Capital Management L.L.C reports 7.87 percent passive stake in Gol Intelligent Airlines Inc as of September 28  2017 - SEC filing‍​ Source text: (http://bit.ly/2i0xdya) Further company coverage:",
        "date": "10102017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Contrarian Capital reports 7.87 pct passive stake in Gol Intelligent Airlines "
    },
    {
        "content": "* Brazil airline Gol Linhas Aéreas Inteligentes SA forecasts non-recurring operating margins between 12.0 and 12.5 percent in the third quarter",
        "date": "10052017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Brazil's Gol sees Q3 non-recurring operating margins at 12-12.5 pct "
    },
    {
        "content": "* GOL discloses its preliminary traffic figures for August 2017 Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-GOL discloses its preliminary traffic figures for August 2017 "
    },
    {
        "content": "SAO PAULO  Aug 9 Gol Linhas Aereas Inteligentes SA  Brazil's largest domestic airline  reported a second-quarter net loss of 406.3 million reais ($129.9 million)  down from a net profit of 309.5 million reais a year earlier  according to a securities filing on Wednesday.",
        "date": "08092017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil's Gol swings to 2nd quarter loss "
    },
    {
        "content": "* Gol discloses its preliminary traffic figures for June 2017",
        "date": "07102017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Gol posts preliminary traffic figures for June 2017 "
    },
    {
        "content": "SAO PAULO  July 5 Gol Linhas Aéreas Inteligentes   Brazil's largest domestic airline  said on Wednesday its operating margins and profitability likely rose in the second quarter from the year before.",
        "date": "07052017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil airline Gol sees stronger Q2 margins  profitability "
    },
    {
        "content": "* Gol increases 2017 guidance Source text for Eikon: Further company coverage:",
        "date": "06192017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Gol increases 2017 guidance "
    },
    {
        "content": "SAO PAULO Gol Linhas Aéreas Inteligentes SA  Brazil's No. 2 airline  plans to reorganize a customer loyalty subsidiary  tapping significant tax savings from a simplified corporate structure  according to a securities filing on Tuesday.",
        "date": "06062017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil's Gol to reorganize customer loyalty unit for tax purposes: filing "
    },
    {
        "content": "SAO PAULO  June 6 Gol Linhas Aéreas Inteligentes SA  Brazil's No. 2 airline  plans to reorganize a customer loyalty subsidiary  tapping significant tax savings from a simplified corporate structure  according to a securities filing on Tuesday.",
        "date": "06062017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil's Gol to reorganize customer loyalty unit for tax purposes -filing "
    },
    {
        "content": "SAO PAULO  May 12 Nene Constantino Oliveira  patriarch of the family that created Brazilian airline Gol   has been found guilty of homicide in connection with the 2001 murder of an activist who led a group of squatters occupying land owned by the family  a court in Brasilia said on Friday.",
        "date": "05122017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Patriarch of Brazil airline Gol's founding family convicted of homicide "
    },
    {
        "content": "SAO PAULO  May 10 Brazilian airline Gol Linhas Aereas Inteligentes SA has seen price competition subsiding since April after a spike in March  Chief Financial Officer Richard Lark told analysts on a Wednesday conference call.",
        "date": "05102017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Gol says airline price competition subsided since April "
    },
    {
        "content": "SAO PAULO  May 10 Brazilian airline Gol Linhas Aéreas Inteligentes SA reported stronger-than-expected quarterly profit on Wednesday as rising cargo revenue and tight cost controls contributed to a gradual recovery despite fragile domestic demand.",
        "date": "05102017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "UPDATE 1-Brazil airline Gol posts $74 mln first-quarter profit "
    },
    {
        "content": "SAO PAULO  May 10 Brazilian airline Gol Linhas Aéreas Inteligentes SA on Wednesday reported net income of 233 million reais ($74 million) in the first quarter  down 69 percent from a year earlier  according to a securities filing.",
        "date": "05102017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil airline Gol posts $74 mln first-quarter profit "
    },
    {
        "content": "* GOL announces configuration of boeing 737 max-8 combining operating cost reductions and improved customer experience",
        "date": "03282017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-GOL announces configuration of Boeing 737 max-8 combining operating cost reductions "
    },
    {
        "content": "* Financial expenses fall 77 pct to 163.6 mln reais   (Adds management comments throughout)",
        "date": "02172017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "UPDATE 3-Gol shares jump as airline narrows quarterly loss by 97 pct "
    },
    {
        "content": "SAO PAULO  Feb 17 Gol Linhas Aéreas Inteligentes SA  Brazil's No. 2 airline  posted a smaller than expected fourth-quarter net loss as declining borrowing costs and a strengthening real helped offset the impact of stagnant revenue growth.",
        "date": "02172017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil's Gol posts smaller than expected loss as financial expenses slump "
    },
    {
        "content": "* Gol announces sale and leaseback agreement for five Boeing 737 max 8 aircraft",
        "date": "02142017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Gol announces sale and leaseback agreement for five Boeing 737 max 8 aircraft "
    },
    {
        "content": "* GOL Linhas Aereas - ratio change in program from ratio of one ADS representing ten preferred shares to one ADS representing five preferred shares  Source text for Eikon:  Further company coverage:",
        "date": "02162017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-GOL reports change in ADS ratio "
    },
    {
        "content": "BRASILIA  Jan 12 Brazilian airline Gol  said on Thursday that total demand for seats on its flights fell 6.5 percent in 2016 compared with the previous year.",
        "date": "01122017",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil's Gol says demand for seats in 2016 fell 6.5 pct on year "
    },
    {
        "content": "SAO PAULO  Nov 7 Brazilian airline Gol Linhas Aereas Inteligentes SA will trim its fleet by another five airplanes next year  which will help reduce debt levels and limit capacity   executives said on a Monday earnings call.",
        "date": "11072016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil airline Gol to keep trimming fleet in 2017 "
    },
    {
        "content": "* Gol Linhas Aereas Inteligentes Sa- partnership is expected to come into effect by end of October/early November timeframe",
        "date": "10112016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Gol announces codeshare partnership with Emirates "
    },
    {
        "content": "RIO DE JANEIRO  Aug 16 Brazilian airline Gol Linhas Aereas  expects operating profit this year to cover debt payments  marking a turning point for the debt-burdened company after the country's stronger currency helped it post a second-quarter net profit.",
        "date": "08162016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "UPDATE 1-Brazil's Gol sees operating profit covering debt costs  shares rally "
    },
    {
        "content": "RIO DE JANEIRO  Aug 16 Brazilian airline Gol Linhas Aereas should be able to cover debt payments with its operating profit if the company hits new profitability targets issued on Tuesday  Chief Executive Paulo Kakinoff told reporters on an earnings call.",
        "date": "08162016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil's Gol sees operating profit covering debt payments -CEO "
    },
    {
        "content": " ",
        "date": "08022016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil airline Gol swaps CFO and board members amid restructuring "
    },
    {
        "content": "SAO PAULO  July 4 Brazilian airline Gol Linhas Aereas SA is still looking for ways to resolve its costly debt load  a senior executive said on Monday  renegotiating bank loans this month after about 20 percent of bondholders accepted a restructuring.",
        "date": "07042016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "UPDATE 1-Brazil's Gol still looking for solution to debt issues -CFO "
    },
    {
        "content": "SAO PAULO  July 4 Brazilian airline Gol Linhas Aereas SA is satisfied with the results of a debt swap involving about 20 percent of its bondholders  but the company is still looking for ways to resolve its overall debt situation  Chief Financial Officer Edmar Lopes Neto said on Monday.",
        "date": "07042016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil's Gol still looking for solution for debt issues -CFO "
    },
    {
        "content": "BRASILIA  July 4 Brazilian airline Gol Linhas Aereas Inteligentes SA on Monday said creditors agreed to swap $174.7 million in notes and bonds in a debt restructuring offer concluded last week.",
        "date": "07042016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil's Gol says bondholders tendered $174.7 mln of bonds in swap deal "
    },
    {
        "content": "SAO PAULO  June 20 Brazilian airline Gol Linhas Aereas Inteligentes SA sweetened a debt restructuring offer on Monday  extending the deadline to July 1 and reducing the proposed discount to lure more investors  the company said in a securities filing.",
        "date": "06202016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "UPDATE 1-Brazil's Gol sweetens bond swap offer  extends deadline "
    },
    {
        "content": "* Gol announces extension of the expiration time for its private exchange offers",
        "date": "06162016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Gol Linhas Aereas Inteligentes SA - extends time for private exchange offers "
    },
    {
        "content": "BRASILIA  June 16 Brazilian airline Gol Linhas Aereas said on Thursday it was extending the deadline for a bond swap to June 2  while maintaining the terms of the exchange.",
        "date": "06162016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil's Gol extends deadline for debt swap until June 22 "
    },
    {
        "content": "BRASILIA  June 9 Brazilian airline Gol Linhas Aereas said on Thursday it was extending the deadline for a bond swap to June 15  while maintaining the terms of the exchange.",
        "date": "06092016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil's Gol extends deadline for debt swap until June 15 "
    },
    {
        "content": "SAO PAULO  June 2 Brazilian airline Gol Linhas Aereas said on Thursday it was extending the deadline for a bond swap to June 8  while maintaining the terms of the exchange.",
        "date": "06022016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil's Gol extends deadline for debt swap until June 8 "
    },
    {
        "content": "* Gol announces extension of the early participation premium for its private exchange offers",
        "date": "05232016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Gol Linhas extends early participation premium for private exchange offers "
    },
    {
        "content": "SAO PAULO  May 23 Gol  has extended the deadline for a bond swap by 10 days after questions from investors last week  the Brazilian airline said in a securities filing on Monday.",
        "date": "05232016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil airline Gol extends deadline for bond exchange offer "
    },
    {
        "content": "SAO PAULO  May 12 Gol Linhas Aéreas Inteligentes SA  Brazil's most indebted airline  has proposed creditors a restructuring plan that is \"the best possible out there \" Chief Executive Officer Paulo Kakinoff said on Thursday.",
        "date": "05122016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil's Gol CEO says restructuring offer 'not negotiable' "
    },
    {
        "content": "SAO PAULO  May 3 Gol Linhas Aéreas Inteligentes SA plans to propose to bondholders taking losses of up to 70 percent on some of their bonds  as Brazil's second-largest airline struggles to overcome a steep recession and plunging demand for air travel.",
        "date": "05032016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil's Gol wants bondholders to take up to 70 pct loss in debt plan "
    },
    {
        "content": "SAO PAULO  May 6 A group of bondholders in Brazil's Gol Linhas Aereas Inteligentes SA decided on Thursday to reject the exchange offer announced by the airline  the law firms representing them said.",
        "date": "05062016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "UPDATE 1-Brazil\u007fs Gol bondholders reject restructuring proposal "
    },
    {
        "content": "SAO PAULO  May 4 Shares in Gol Linhas Aéreas Inteligentes SA posted their biggest intraday gain in over five weeks on Wednesday  a day after Brazil's most indebted airline proposed investors to take losses of up to 70 percent on $780 million of outstanding bonds.",
        "date": "05042016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Shares in Brazil's Gol soar on plan to restructure bond debt "
    },
    {
        "content": "SAO PAULO  May 6 A group of bondholders in Brazil's Gol Linhas Aereas Inteligentes SA decided on Thursday to reject the exchange offer announced by the airline  the law firms representing them said.",
        "date": "05062016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil\u007fs Gol bondholders reject restructuring proposal "
    },
    {
        "content": "SAO PAULO  May 3 Gol Linhas Aéreas Inteligentes SA plans to propose bondholders take losses of up to 70 percent in some of their bonds as Brazil's second-largest airline strives to overcome a steep recession and plunging air travel demand.",
        "date": "05042016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "CORRECTED-UPDATE 1-Brazil's Gol wants bondholders to take loss in debt plan "
    },
    {
        "content": "* Announced this week final phase of comprehensive restructuring plan begun in mid-2015  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05062016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "BRIEF-GOL continues to execute comprehensive restructuring plan "
    },
    {
        "content": "SAO PAULO  April 27 A group of bondholders in Brazilian airline Gol Linhas Aereas Inteligentes SA  has hired law firm White & Case LLP to advise on a planned debt restructuring.",
        "date": "04272016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Gol bondholders hire White & Case to advise on debt restructuring "
    },
    {
        "content": "SAO PAULO  March 30 Brazilian airline Gol Linhas Aereas faces no risk of insolvency in the short term  Chief Executive Paulo Kakinoff told journalists on an earnings call on Wednesday  adding that the company was looking to renegotiate its debts due to medium- and long-term concerns.   (Reporting by Brad Haynes; Editing by Chizu Nomiyama)",
        "date": "03302016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil's Gol faces no insolvency risk in short term -CEO "
    },
    {
        "content": "SAO PAULO  March 30 Brazilian airline Gol Linhas Aereas  made deeper capacity cuts following a heavy fourth-quarter loss as an economic crisis sapped demand and weakened the local currency  driving up the cost of servicing hefty foreign debts.",
        "date": "03302016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil airline Gol slashes capacity after heavy quarterly loss "
    },
    {
        "content": "SAO PAULO  March 11 Shares of Brazil's airline Gol Linhas Aereas Inteligentes SA seesawed on Friday after the company denied a media report saying Delta Airlines  would inject capital in the embattled company through a share offering.",
        "date": "03112016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Shares of Brazil's Gol seesaw on talk of Delta capital injection "
    },
    {
        "content": "RIO DE JANEIRO  Feb 27 Brazil's second biggest airline Gol Linhas Aereas Inteligentes SA said it will get a cash injection of up to 1 billion reais ($251 million) and announced cuts to its routes and aircraft fleet in an effort to trim costs amid weak demand.",
        "date": "02272016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil airline Gol to get $251 mln cash injection  trim routes "
    },
    {
        "content": "* Brazilian airline Gol says will allow pregnant travelers to zika regions to reschedule flights or receive credit  Further company coverage:    (Reporting By Rosalba O'Brien)",
        "date": "01282016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Brazil airline Gol says pregnant travelers to Zika area can reschedule "
    },
    {
        "content": "SAO PAULO/BRASILIA  Feb 1 Shares of Brazilian airline Gol soared nearly 30 percent on Monday on higher ticket prices and a newspaper report that the government could scrap limits on foreign ownership of domestic airlines to attract investment to the struggling sector.",
        "date": "02012016",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "UPDATE 2-Gol shares jump on news Brazil may lift foreign stake limit "
    },
    {
        "content": "* CFO of Brazilian airline Gol says sees pressure to refinance company debt after 2020",
        "date": "12072015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Brazil's Gol sees pressure to refinance debt only after 2020 "
    },
    {
        "content": "* Company sees 4 to 6 percent reduction in domestic market air traffic in first half of 2016 -filing  Source text for Eikon:  Further company coverage:    (Writing by Reese Ewing; editing by Jason Neely)",
        "date": "12072015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "BRIEF-Brazil's Gol expects 4-6 pct drop air traffic in H1 2016 "
    },
    {
        "content": "* Brazil's GOL Linhas Aéreas Inteligentes SA said on Wednesday that domestic seat capacity fell 5.1 percent in October while demand fell 9 percent.",
        "date": "11252015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "BRIEF-Brazil's GOL October capacity fell 5.1 pct  demand 9 pct "
    },
    {
        "content": "SAO PAULO  Nov 12 Brazilian airline Gol Linhas Aereas  cut its 2015 operational profit forecast to a loss and trimmed fleet plans through 2017 after a weak currency and meager demand triggered a heavy third-quarter loss.",
        "date": "11122015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil airline Gol scraps 2015 profit target  trims fleet plan "
    },
    {
        "content": "Oct 14 Delta Air Lines Inc expects the United States and Brazil to reach an aviation deal that removes restrictions on flights between the countries in the next year  the airline's president told investors on a call Wednesday.",
        "date": "10142015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Airline partners Delta  Gol expect to apply for immunity from antitrust law soon "
    },
    {
        "content": "SAO PAULO  Aug 14 Brazilian airline Gol Linhas Aereas SA may adjust its fleet plan due to an adverse economic outlook  Chief Executive Paulo Kakinoff said on a Friday conference call to discuss a sharp second-quarter net loss.",
        "date": "08142015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil airline Gol may trim fleet plan due to slowdown -CEO "
    },
    {
        "content": "SAO PAULO  July 23 Brazil's antitrust watchdog Cade approved with no restrictions a $446 million agreement between U.S. carrier Delta Air Lines Inc and Brazil's Gol Linhas Aereas Inteligentes SA to expand their alliance.",
        "date": "07232015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil regulator approves Delta Air Lines  Gol deal "
    },
    {
        "content": "SAO PAULO  July 10 U.S. carrier Delta Air Lines Inc will expand its alliance with Brazil's Gol Linhas Aereas Intelligentes SA  under a $446 million stock and loan agreement  Gol said on Friday in a statement.",
        "date": "07112015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "UPDATE 3-Delta  Gol boost air accord in $446 mln stock  debt deal "
    },
    {
        "content": "SAO PAULO U.S. carrier Delta Air Lines Inc  will expand its alliance with Brazil's Gol Linhas Aereas Intelligentes SA   under a $446 million stock and loan agreement  Gol said on Friday in a statement.",
        "date": "07102015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Delta  Gol boost air accord in $446 million stock  debt deal "
    },
    {
        "content": "SAO PAULO  July 10 U.S. carrier Delta Air Lines Inc will expand its alliance with Brazil's Gol Linhas Aereas Intelligentes SA  under a $446 million stock and loan agreement  Gol said on Friday in a statement.",
        "date": "07102015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "UPDATE 2-Delta  Gol boost air accord in $446 mln stock  debt deal "
    },
    {
        "content": "SAO PAULO  July 10 U.S. carrier Delta Air Lines Inc will expand its alliance with Brazil's Gol Linhas Aereas Intelligentes SA  under a $446 million stock and loan agreement  Gol said on Friday in a statement.",
        "date": "07102015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Delta in $446 mln stock  loan deal to increase stake in Brazil's Gol "
    },
    {
        "content": "SAO PAULO  May 12 Brazilian airline Gol Linhas Aereas  posted its 13th consecutive quarterly loss on Tuesday as sales stagnated and a strong dollar drove up costs.",
        "date": "05132015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "UPDATE 1-Brazil airline Gol posts 13th straight quarterly loss "
    },
    {
        "content": "SAO PAULO  May 12 Brazilian airline Gol Linhas Aereas  posted its 13th consecutive quarterly loss on Tuesday as sales stagnated and a strong dollar drove up costs.",
        "date": "05122015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil airline Gol posts 13th straight quarterly loss "
    },
    {
        "content": "SAO PAULO  March 30 Brazilian airline Gol Linhas Aereas SA expects positive operating income in 2015 and an operating margin (EBIT) of between 2 and 5 percent  the company said in a securities filing on Monday.",
        "date": "03312015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "UPDATE 1-Brazil's Gol estimates positive operating income in 2015 "
    },
    {
        "content": "SAO PAULO  March 30 Brazilian airline Gol Linhas Aereas SA expects positive operating income in 2015 and an operating margin (EBIT) of between 2 and 5 percent  the company said in a securities filing on Monday.",
        "date": "03302015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil airline Gol estimates positive operating income in 2015 "
    },
    {
        "content": "SAO PAULO  March 24 Brazilian airline Gol Linhas Aereas SA may revise down its outlook for stable seat capacity this year  Chief Executive Paulo Kakinoff told journalists at an industry event on Tuesday.",
        "date": "03242015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "topStory",
        "symbol": "GOL",
        "title": "Brazil airline Gol may trim capacity this year - CEO "
    },
    {
        "content": "SAO PAULO  Jan 12 Brazilian airline Gol Linhas Aereas  has struck a codesharing agreement with Copa Airlines  whose Panama City hub offers an array of American destinations to Brazil's legion of U.S.-bound travelers.",
        "date": "01122015",
        "name": "Gol Linhas Aereas Inteligentes SA",
        "news_type": "normal",
        "symbol": "GOL",
        "title": "Brazil airline Gol strikes codesharing deal with Copa "
    }
]