[
    {
        "content": "* Graphic Packaging Holding Co agrees to acquire Seydaco Packaging Corp and its affiliates",
        "date": "11092017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging agrees to acquire Seydaco Packaging Corp and its affiliates "
    },
    {
        "content": "* Graphic Packaging Holding Company reports third quarter 2017 results",
        "date": "10242017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging holding company reports Q3 earnings per share $0.15 "
    },
    {
        "content": "* Graphic Packaging to create a $6 billion integrated paper-based packaging company by combining with International Paper's North America consumer packaging business",
        "date": "10242017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging to create a $6 billion integrated paper-based packaging company "
    },
    {
        "content": "Oct 24 International Paper Co has agreed to combine its North America consumer packaging business with Graphic Packaging Holding Co in a deal that values the International Paper division at $1.8 billion  the companies said on Tuesday.",
        "date": "10242017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "International Paper to combine unit with Graphic Packaging "
    },
    {
        "content": "* International paper and Graphic Packaging create leading consumer packaging platform",
        "date": "10242017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "BRIEF-International Paper to combine unit with Graphic Packaging in $1.8 bln deal "
    },
    {
        "content": "* Graphic Packaging announces closure of Santa Clara  California Paperboard Mill",
        "date": "09062017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging announces closure of Santa Clara  California Paperboard Mill "
    },
    {
        "content": "* Sets quarterly dividend of $0.075 per share Source text for Eikon: Further company coverage:",
        "date": "07282017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging Holding sets quarterly dividend of $0.075 per share "
    },
    {
        "content": "July 13 Foreign investors stepped up their investments into Asian domestic bond markets in the first half of the year  but analysts expect the pace of inflows to drop off for the rest of the 2017 as global interest rates rise.",
        "date": "07132017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "REFILE-GRAPHIC-Buoyant foreign flows into Asian bonds unlikely to sustain in second half  analysts say "
    },
    {
        "content": "* Graphic Packaging completes acquisition of Carton Craft Corporation Source text for Eikon: Further company coverage:",
        "date": "07102017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging completes acquisition of Carton Craft Corp "
    },
    {
        "content": "LONDON  July 10 Someone has it wrong. Either sentiment about the euro zone's economic future is too rosy  or projections of economic growth are too pessimistic.",
        "date": "07102017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "REFILE-GRAPHIC-Euro zone sentiment versus growth: a disconnect ahead? "
    },
    {
        "content": "LONDON  July 6 A large price premium for the cash tin contract over the three-month forward on the London Metal Exchange should theoretically attract large amounts of metal to LME approved warehouses.",
        "date": "07062017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "GRAPHIC-No immediate respite for historically low LME tin stocks "
    },
    {
        "content": "July 5 Foreign investors are reassessing their positions in Asian equities  given rising global yields and the modest earnings outlook for Asian companies for the rest of the year.",
        "date": "07052017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "CORRECTED-GRAPHIC-Foreign inflows into Asian equities slow in June  put rally in doubt "
    },
    {
        "content": "LONDON  July 7 Following are five big themes likely to dominate thinking of investors and traders in the coming week and the Reuters stories related to them.",
        "date": "07072017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "GRAPHIC-Take Five: World markets themes for the week ahead "
    },
    {
        "content": "LONDON  June 30 Emerging markets have had one of their best first halves to a year on record  with stocks up 17.5 percent and a 15 percent surge by Mexico's peso underscoring how worries about U.S. President Donald Trump's policies have been forgotten for now.",
        "date": "06302017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "GRAPHIC-Emerging markets enjoy vintage start to year "
    },
    {
        "content": "LONDON If shifts in major banks' currency views are anything to go by  Tuesday's speech by European Central Bank Governor Mario Draghi may mark an early end to the dollar's third big rally since the late 1970s.",
        "date": "06282017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "Graphic - Trump  Draghi  Fed doubts: is the dollar rally done? "
    },
    {
        "content": "    * Gold down 2 pct in June and 0.4 pct in Q2     * Gold still up 8 pct in H1 after strong start to year     * Silver worst Q2 performer  down 9 pct; palladium up 6.1 pct     * GRAPHIC-2017 asset returns: http://tmsnrt.rs/2jvdmXl   (Updates prices  adds comment)     By Jan Harvey     LONDON  June 30 Gold eased on Friday to stay on track for its first monthly loss this year  as hints from leading central banks that the era of easy money may be coming to a close pushed bond yields hi",
        "date": "06302017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold heads for first monthly loss this year as rally stalls in Q2 "
    },
    {
        "content": "* Dollar rallies since Bretton-Woods: http://tmsnrt.rs/2g7ph8E",
        "date": "06282017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "GRAPHIC-Trump  Draghi  Fed doubts: is the dollar rally done? "
    },
    {
        "content": "    * Gold down 2 pct in June and 0.4 pct in Q2     * Gold still up 8 pct in H1 after strong start to year     * Silver worst Q2 performer  down 9 pct; palladium up 5.6 pct     * GRAPHIC-2017 asset returns: http://tmsnrt.rs/2jvdmXl   (Updates prices)     By Jan Harvey     LONDON  June 30 Gold eased on Friday to stay on track for its first monthly loss this year  as hints from leading central banks that the era of easy money may be coming to a close pushed bond yields higher.     The ",
        "date": "06302017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold heads for first monthly loss this year "
    },
    {
        "content": "LONDON  June 30 World stocks were on track for their best start to a year since 2003 while oil and the dollar were facing their biggest first-half drop for years.",
        "date": "06302017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "GRAPHIC-Stocks fly in first half but oil and dollar big losers "
    },
    {
        "content": "June 30 Germany's parliament voted by a wide margin on Friday to legalise same-sex marriage. Here is a graphic of where same-sex marriage is legal:",
        "date": "06302017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "GRAPHIC-Legalisation of same-sex marriage "
    },
    {
        "content": "LONDON  June 23 Data on Friday confirmed Italian industry entered the second quarter on a down note with contractions in sales and orders to go along with an earlier production slide.",
        "date": "06232017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "GRAPHIC-Italian industry started second quarter in the red "
    },
    {
        "content": "* GRAPHIC: Oil supply and demand in 2016 (http://reut.rs/2rWrM5X)",
        "date": "06132017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "UPDATE 1-Global energy demand stumbles for third year - BP "
    },
    {
        "content": "* GRAPHIC - Qatar fallout on LNG market http://tmsnrt.rs/2syp5FR (adds Maersk Line comment)",
        "date": "06062017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "WRAPUP 2-Port bans choke Qatar's commodity trade as gas supply worries grow "
    },
    {
        "content": "    * World equities scale record highs     * Fed says prudent to confirm recent slowdown is temporary     * GRAPHIC-2017 asset returns: http://tmsnrt.rs/2jvdmXl   (Recasts  updates prices; adds analyst and Fed comments  second byline  NEW YORK dateline)     By Marcy Nicholson and Zandi Shabalala     NEW YORK/LONDON  May 25 Gold eased on Thursday as the dollar came off its lows and world stock markets scaled fresh highs  giving back some gains from the prior session when U.S. Federal",
        "date": "05252017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold eases as dollar steadies  stocks rise to records "
    },
    {
        "content": "    * Fed minutes scheduled for release at 1800 GMT     * World stocks under pressure from China downgrade     * GRAPHIC-2017 asset returns: http://tmsnrt.rs/2jvdmXl   (Updates prices  adds comment)     By Jan Harvey     LONDON  May 24 Gold steadied just above $1 250 an ounce on Wednesday  taking a breather after the previous day's fall as investors awaited minutes of the Federal Reserve's latest meeting for clues on the outlook for U.S. interest rates.     The metal is highly sensit",
        "date": "05242017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold steadies above $1 250/oz ahead of Fed minutes "
    },
    {
        "content": "LONDON  May 16 Of the euro zone's top five economies  Italy is stuggling to keep growth going  though it is only slightly worse for wear than France.",
        "date": "05162017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "GRAPHIC-Italy lags in euro zone's Big Five economies "
    },
    {
        "content": "    * Gold heads for 3.2 pct weekly loss  biggest since November     * Demand dented by fading expectations of Le Pen victory     * GRAPHIC-2017 asset returns: http://tmsnrt.rs/2jvdmXl   (Updates prices; adds comment  second byline  NEW YORK dateline)     By Marcy Nicholson and Jan Harvey     NEW YORK/LONDON  May 5 Gold pared gains on Friday after data showed U.S. job growth rebounded in April and stayed on track for its biggest weekly loss in six months as expectations for a U.S. in",
        "date": "05052017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold heads for biggest weekly drop in six months "
    },
    {
        "content": "* Graphic packaging holding company reports first quarter 2017 results",
        "date": "04252017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging Q1 adjusted earnings per share $0.14 "
    },
    {
        "content": "    * Dollar index touches three-week high in Asian trade     * Concerns over N. Korea and Middle East underpin gold     * GRAPHIC-2017 asset returns: http://tmsnrt.rs/2jvdmXl   (Updates prices  adds comment)     By Jan Harvey     LONDON  April 10 Gold slipped further on Monday from the previous session's five-month high  as expectations that the Federal Reserve will press ahead with interest rate hikes counterweighed concerns over political tensions in North Korea and the Middle Eas",
        "date": "04102017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold slips further from five-month high on Fed expectations "
    },
    {
        "content": "* GRAPHIC-Rise and fall of RBS assets: http://tmsnrt.rs/2mPV7La",
        "date": "04032017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "INSIGHT-RBS rising from ruins as shadow of former self "
    },
    {
        "content": "LONDON  March 29 On the face of it  the first quarter of the year followed the 'risk on' script.",
        "date": "03292017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "GRAPHIC-Q1 follows Trumpflation script for markets  but it may be unravelling "
    },
    {
        "content": "    * Dollar trades flat but headed for best week since mid-Feb     * Gold to average $1 259 an ounce this year -GFMS     * Palladium up 17.7 percent this quarter     * GRAPHIC-2017 asset returns:   http://tmsnrt.rs/2jvdmXl   (Updates prices  adds comment  milestones)     By Devika  Krishna Kumar and Peter Hobson     NEW YORK/LONDON March 31 Gold notched a quarterly gain of about 8.4 percent on Friday  marking its best quarter in a year  as uncertainty over U.S. President Donald Trum",
        "date": "03312017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold posts best quarter in a year amid political uncertainty "
    },
    {
        "content": "LONDON  March 31 On the face of it  the first quarter of the year followed the 'risk on' script.",
        "date": "03312017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "GRAPHIC-Q1 follows Trumpflation script for markets  but it may be unravelling "
    },
    {
        "content": "    * Spot gold on track for best quarter since Jan-March 2016     * Silver off highs hit in previous session     * Platinum heads for worst month since August 2016     * Palladium has risen over 16 percent this quarter     * GRAPHIC-2017 asset returns:   http://tmsnrt.rs/2jvdmXl   (Updates prices  adds details)     By Arpan Varghese     March 31 Gold remained steady on Friday with global political uncertainty  the upcoming elections in Europe in particular  seen supporting prices of",
        "date": "03312017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold set for best quarter in a year on political uncertainty "
    },
    {
        "content": "* GRAPHIC: UK retail sales shrink http://reut.rs/2ngKd2G   (Adds market and economist reaction  CBI retail data)",
        "date": "03232017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "UPDATE 1-British retail sales suffer biggest squeeze in nearly 7 years as inflation bites "
    },
    {
        "content": "    * Gold set for biggest weekly retreat since early November     * Expectations of March U.S. rate hike rise sharply     * GRAPHIC-2017 asset returns: http://tmsnrt.rs/2jvdmXl   (Updates prices; adds comment  second byline  NEW YORK dateline)     By Marcy Nicholson and Jan Harvey     NEW YORK/LONDON  March 3 Gold fell 1 percent on Friday and was on track for its biggest weekly loss in 2017 as speculation grew that the U.S. Federal Reserve would press ahead with a rate increase this",
        "date": "03032017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold heads for weekly drop on talk of March rate rise "
    },
    {
        "content": "* Polish inflation and interest rates - http://bit.ly/2lbUG00",
        "date": "03032017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "GRAPHIC-Negative real interest rates in Poland for a year? "
    },
    {
        "content": "LONDON  Feb 14 A spike in expectations of European equity market volatility around the first round of France's presidential election suggests investors are belatedly starting to worry about the outcome and potential price swings.",
        "date": "02142017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "GRAPHIC-French political risk finally shows in equity markets "
    },
    {
        "content": "* Graphic Packaging Holding Company reports fourth quarter and full year 2016 results",
        "date": "02072017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging Holding Co posts adj. earnings $0.14/shr "
    },
    {
        "content": "MOSCOW  Feb 3 Russia will resume buying dollars next week for the first time since a brief burst in 2015  but sources told Reuters the purchases will go ahead only after a reluctant central bank won assurances it could distance itself from the operations.",
        "date": "02032017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "Russian central bank seeks to keep dollar purchase plan at arm's length-sources "
    },
    {
        "content": "MOSCOW  Feb 2 Russia will resume buying dollars next week for the first time since a brief burst in 2015  but sources told Reuters the purchases will go ahead only after a reluctant central bank won assurances it could distance itself from the operations.",
        "date": "02022017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "Russian central bank seeks to keep dollar purchase plan at arm's length-sources "
    },
    {
        "content": "* Graphic packaging holding company announces new share repurchase plan authorization",
        "date": "01112017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic packaging holding company announces new share repurchase plan authorization "
    },
    {
        "content": "LONDON  Jan 11 The Turkish lira skidded 2 percent to record lows on Wednesday  unnerved by authorities' failure to announce decisive stabilising steps as the currency decoupled from broader emerging markets  which mostly traded firmer.",
        "date": "01112017",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "EMERGING MARKETS-Turkish lira's slump sours emerging market mood "
    },
    {
        "content": "* Metal trims losses as dollar steadies  but still depressed     * Holdings of largest gold ETF hit lowest since June     * GRAPHIC-2016 asset returns: http://reut.rs/1WAiOSC   (Updates prices)     By Jan Harvey     LONDON  Nov 18 Gold hit its lowest since late May on Friday as the dollar surged to a near 14-year peak on expectations for a U.S. rate hike next month and higher fiscal spending from U.S. President-elect Donald Trump's incoming administration.     The dollar is on track ",
        "date": "11182016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold slides to 5-1/2 month low on dollar surge "
    },
    {
        "content": "* Solid U.S. payrolls data supports bruised dollar     * All eyes on outcome of Tuesday's U.S. election     * GRAPHIC-2016 asset returns: http://reut.rs/1WAiOSC   (Releads  updates prices  adds comment)     By Jan Harvey     LONDON  Nov 4 Gold steadied on Friday  heading for its biggest weekly rise since mid-September as jitters over next week's U.S. election offset a solid payrolls report that shored up expectations for a U.S. interest rate hike next month.     The dollar gained and",
        "date": "11042016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold steadies as U.S. election jitters offset solid U.S. data "
    },
    {
        "content": "* Gold range-bound on U.S. Fed rate-hike bets     * Silver off over 2-week highs hit Monday     * GRAPHIC-2016 asset returns: http://reut.rs/1WAiOSC   (Updates prices)     By Zandi Shabalala     Oct 25 Gold rose on Tuesday due to rising physical demand from India  but growing expectations of a U.S. interest rate hike kept a lid on prices.     The metal is highly sensitive to rising U.S. rates  which lift the opportunity cost of holding non-yielding assets while boosting the dollar.  ",
        "date": "10252016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold rises on higher demand  Fed rate hike prospects weigh "
    },
    {
        "content": "* Q3 earnings per share view $0.21 -- Thomson Reuters I/B/E/S",
        "date": "10252016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging Q3 adjusted EPS $0.20 "
    },
    {
        "content": "* GRAPHIC-2016 metal returns: http://tmsnrt.rs/2eqHKkL   (Updates with closing prices)",
        "date": "10282016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "METALS-Tin hits two-year peak  aluminium at highest since July 2015 "
    },
    {
        "content": "* Dollar index hits fresh near 9-month high     * No.1 gold ETF sees biggest 1-day outflow since April 2013 GRAPHIC-2016 asset returns: http://reut.rs/1WAiOSC   (Updates throughout  adds quote  NEW YORK dateline  previous LONDON)     By Devika  Krishna Kumar and Jan Harvey     NEW YORK/LONDON  Oct 24 Gold prices slipped on Monday as the dollar strengthened to a fresh near nine-month high on growing speculation that the U.S. Federal Reserve would hike interest rates in December.     R",
        "date": "10242016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold eases as dollar jumps to fresh near 9-month high "
    },
    {
        "content": "* Dollar index pulls back from earlier near 9-month high     * No.1 gold ETF sees biggest 1-day outflow since April 2013 GRAPHIC-2016 asset returns: http://reut.rs/1WAiOSC   (Updates prices  adds comment)     By Jan Harvey     LONDON  Oct 24 Gold rose on Monday as the dollar retreated from an earlier near nine-month high  though uncertainty over the timing of a U.S. interest rate hike kept prices hemmed in a range.     Signs of improving physical demand in major Asian consumers helpe",
        "date": "10242016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold firms as dollar retreats from near 9-month high "
    },
    {
        "content": "* Markets to watch ECB policy meeting on Thursday     * Coming up: Final U.S. presidential debate late Wednesday   (Updates prices; adds comment  second byline  NEW YORK dateline)     By Marcy Nicholson and Clara Denina      NEW YORK/LONDON  Oct 19 Gold rose to a two-week high on Wednesday  gaining for the third straight session and breaching the 200-day moving average amid uncertainty over the timing of a U.S. interest rate increase and ahead of the final U.S. presidential debate.  ",
        "date": "10192016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold rises above key technical level amid Fed rate hike uncertainty "
    },
    {
        "content": "* HSBC pushing for investment banking business as rivals falter",
        "date": "10202016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "Ex-Goldman recruit drives HSBC's investment banking ambitions "
    },
    {
        "content": "* All eyes on Draghi statement for policy clues     * Gold closes back above 200-day moving average     * GRAPHIC-2016 asset returns: http://reut.rs/1WAiOSC   (Releads  updates prices  adds comment)     By Jan Harvey     LONDON  Oct 20 Gold rose for a third day on Thursday  helped by an uptick in the euro  after the European Central Bank left interest rates unchanged and maintained the parameters of its 1.74 trillion euro ($1.95 trillion) asset buying scheme.       The ECB has provid",
        "date": "10202016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold extends 3-day rise  awaits comments from ECB's Draghi "
    },
    {
        "content": "* Deal brings together Newport  Lucky Strike  Pall Mall brands",
        "date": "10212016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "UPDATE 7-BAT offers to buy U.S. tobacco firm Reynolds in $47 billion deal "
    },
    {
        "content": "* HSBC pushing for investment banking business as rivals falter",
        "date": "10212016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "RPT-Ex-Goldman recruit drives HSBC's investment banking ambitions "
    },
    {
        "content": "LONDON  Oct 13 As sterling plumbs the depths  foreign investors are withdrawing from British stocks and leaving domestic funds to push the benchmark bluechip index to record highs - for now.",
        "date": "10142016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "RPT-It's lonely at the top for Britain's FTSE 100 index "
    },
    {
        "content": "* Downbeat U.S. payrolls data helps gold rebound     * Chinese buyers return from Golden Week holiday     * Palladium snaps 5-session losing streak     * GRAPHIC-2016 asset returns: http://reut.rs/1WAiOSC   (Updates prices; adds comment  second byline  NEW YORK dateline)     By Marcy Nicholson and Jan Harvey     NEW YORK/LONDON  Oct 10 Gold recovered on Monday from its biggest weekly drop since November after downbeat U.S. payrolls data on Friday dampened speculation of a near-term i",
        "date": "10102016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold recovers after biggest weekly drop this year "
    },
    {
        "content": "* Prices up more than 2 pct this week on Fed caution     * Platinum snaps 7 weeks of losses with 3.3 pct rise     * GRAPHIC-2016 asset returns: http://reut.rs/1WAiOSC   (Recasts  updates prices; adds comment  second byline  NEW YORK dateline)     By Marcy Nicholson and Jan Harvey     NEW YORK/LONDON  Sept 23 Gold steadied in a lackluster session as the U.S. dollar also flattened on Friday  but bullion stayed on track for its biggest weekly gain in nearly two months after the Federal ",
        "date": "09232016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold heads for best week since July as Fed fears fade "
    },
    {
        "content": "* GRAPHIC-2016 asset returns: http://reut.rs/1WAiOSC   (Updates prices; adds comment  second byline  NEW YORK dateline)",
        "date": "09202016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold steadies as investors bet against Fed hike "
    },
    {
        "content": "* Markets expected to be quiet during Chinese holiday     * Federal Reserve policy meeting on Sep 20-21     * GRAPHIC-2016 asset returns:http://reut.rs/1WAiOSC   (Updates prices  adds comment)     By Clara Denina      LONDON  Sept 15 Gold slipped to a two-week low on Thursday as the dollar edged upwards despite a mixed bag of U.S. economic data ahead of next week's U.S. Federal Reserve policy meeting.     Spot gold fell as much as 1 percent to $1 309.25 an ounce and was down 0.7 perc",
        "date": "09152016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "PRECIOUS-Gold hits two-week low on steadier dollar ahead of Fed meeting "
    },
    {
        "content": "* Graphic Packaging announces pricing of senior notes offering",
        "date": "08082016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging announces pricing of senior notes offering "
    },
    {
        "content": "* Files for senior notes offering of up to $300 million - SEC filing  Source text : (http://bit.ly/2b7v9Rl) Further company coverage:",
        "date": "08082016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "normal",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging Holding files for senior notes offering of up to $300 mln "
    },
    {
        "content": "* David W. Scheible resigned as Chairman and a member of board of directors - SEC filing",
        "date": "05262016",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic Packaging names Philip Martens chairman of board - SEC filing "
    },
    {
        "content": "* Q3 revenue 616 256 zlotys ($156 454) versus 728 628 zlotys year on year",
        "date": "11132015",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic SA Q3 revenue down at 0.6 mln zlotys vs 0.7 mln zlotys yoy "
    },
    {
        "content": "* Q2 revenue 623 326 zlotys versus 732 754 zlotys year on year",
        "date": "08142015",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic's Q2 net result swings to profit of 37 139 zlotys "
    },
    {
        "content": "* Q4 revenue 648 250 zlotys ($177 384) versus 826 874 zlotys year ago",
        "date": "02132015",
        "name": "Graphic Packaging Holding Company",
        "news_type": "topStory",
        "symbol": "GPK",
        "title": "BRIEF-Graphic SA Q4 net profit up at 176 818 zlotys "
    }
]