[
    {
        "content": "* Global Payments reports third quarter 2017 earnings and increases 2017 outlook",
        "date": "11082017",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments Q3 adjusted earnings per share $1.15 "
    },
    {
        "content": "* Global Payments Inc files for resale of up to an aggregate of 6.4 million shares of common stock by the selling stockholders ‍​- SEC filing Source text: (http://bit.ly/2vPAuqd) Further company coverage:",
        "date": "09072017",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments Inc files for resale of up to an aggregate of 6.4 million shares "
    },
    {
        "content": "* ‍entered deal with Hyundai Motor UK to provide payment technology services to Hyundai Motor UK's online car buying platform​ Source text for Eikon: Further company coverage:",
        "date": "05302017",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments ‍enters into a deal with Hyundai Motor UK "
    },
    {
        "content": "* Global Payments Inc says  to offer merchants in Taiwan ability to accept credit and debit card payments via Apple Pay Source text for Eikon: Further company coverage:",
        "date": "05022017",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments announces support for Apple Pay in Taiwan "
    },
    {
        "content": "* Global Payments announces renewed relationship with Caesars Entertainment for gaming technologies Source text for Eikon: Further company coverage:",
        "date": "04242017",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments announces renewed relationship with Caesars Entertainment for gaming technologies "
    },
    {
        "content": "NEW YORK The stock of payment processing company Global Payments Inc could rise by 15 percent to $90 in the year ahead as revenue and profits increase  according to Barron's.",
        "date": "02262017",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "Global Payments stock could rise 15 percent: Barron's "
    },
    {
        "content": "NEW YORK  Feb 26 The stock of payment processing company Global Payments Inc could rise by 15 percent to $90 in the year ahead as revenue and profits increase  according to Barron's.",
        "date": "02262017",
        "name": "Global Payments Inc",
        "news_type": "normal",
        "symbol": "GPN",
        "title": "Global Payments stock could rise 15 percent -Barron's "
    },
    {
        "content": "* Global payments promotes Cameron M. Bready to senior executive vice president and chief financial officer  Source text for Eikon:  Further company coverage:",
        "date": "03012017",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments promotes Cameron Bready to CFO "
    },
    {
        "content": "* Says closed an amendment to its credit facility agreement on october 31  2016",
        "date": "11012016",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments says closed an amendment to its credit facility agreement on Oct 31 "
    },
    {
        "content": "* Global payments reports first quarter earnings and increases fiscal 2017 outlook",
        "date": "10052016",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments Q1 adjusted earnings per share $0.86 "
    },
    {
        "content": "* For 2017 expects constant currency diluted cash earnings per share of $3.50 to $3.60",
        "date": "07282016",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments expects 2017 EPS of $3.50 to $3.60 "
    },
    {
        "content": "* Wellington Management Group LLP  reports a passive stake of 10.15 pct in Global Payments Inc as of June 30  2016  -  SEC Filing  Source text - http://bit.ly/29y8aZX    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07112016",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Wellington Management Group LLP reports 10.15 pct passive stake in Global Payments "
    },
    {
        "content": "* Global Payments announces support for Apple Pay in Singapore  Source text for Eikon:  Further company coverage:",
        "date": "05252016",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments announces support for Apple Pay in Singapore "
    },
    {
        "content": "* Global payments renews multi-year agreement to support yum! brands in canada and is recognized as upgc supplier of the year  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05032016",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global Payments renews multi-year agreement to support Yum Brands in Canada "
    },
    {
        "content": "* Global payments announces $50 million accelerated share repurchase plan",
        "date": "04262016",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global payments announces $50 mln accelerated share repurchase plan "
    },
    {
        "content": "* S&P Midcap 400 constituent Global Payments Inc to replace Gamestop Corp in S&P 500 after close of trading on April 22",
        "date": "04192016",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-S&P Dow Jones Indices says Global Payments Inc to join S&P 500 "
    },
    {
        "content": "* On march 29  2016  company and certain units  entered into a lender Joinder agreement to amended credit facility agreement - sec filing",
        "date": "03312016",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "BRIEF-Global payments enters into a lender Joinder agreement to amended credit facility agreement "
    },
    {
        "content": "BRUSSELS  March 14 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03142016",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "EU mergers and takeovers (March 14) "
    },
    {
        "content": "U.S. payments processor Global Payments Inc  will buy smaller rival Heartland Payment Systems Inc  in a $4.3 billion cash-and-stock deal that will expand its merchant base and reach at a very competitive time in the industry.",
        "date": "12162015",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "Payments processor Global Payments to buy rival Heartland for $4.3 billion "
    },
    {
        "content": "Payments processor Global Payments Inc  will buy smaller rival Heartland Payment Systems Inc  in a $4.3 billion cash-and-stock deal.",
        "date": "12152015",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "Global Payments to buy Heartland Payment Systems for $4.3 billion "
    },
    {
        "content": "Dec 15 Payments processor Global Payments Inc  will buy smaller rival Heartland Payment Systems Inc  in a $4.3 billion cash-and-stock deal.",
        "date": "12152015",
        "name": "Global Payments Inc",
        "news_type": "normal",
        "symbol": "GPN",
        "title": "Global Payments to buy Heartland Payment Systems for $4.3 bln "
    },
    {
        "content": "Payments processor Global Payments Inc  is in talks to buy smaller rival Heartland Payment Systems Inc   Bloomberg reported  citing people familiar with the matter.",
        "date": "12102015",
        "name": "Global Payments Inc",
        "news_type": "topStory",
        "symbol": "GPN",
        "title": "Global Payments in talks to buy Heartland Payment: Bloomberg "
    },
    {
        "content": "Dec 10 Payments processor Global Payments Inc  is in talks to buy smaller rival Heartland Payment Systems Inc  Bloomberg reported  citing people familiar with the matter.",
        "date": "12102015",
        "name": "Global Payments Inc",
        "news_type": "normal",
        "symbol": "GPN",
        "title": "UPDATE 1-Global Payments in talks to buy Heartland Payment-Bloomberg "
    },
    {
        "content": "Dec 10 Payment processor Global Payments Inc  is in talks to buy smaller rival Heartland Payment Systems Inc  Bloomberg reported  citing people familiar with the matter.",
        "date": "12102015",
        "name": "Global Payments Inc",
        "news_type": "normal",
        "symbol": "GPN",
        "title": "Global Payments in talks to buy Heartland Payment-Bloomberg "
    }
]