[
    {
        "content": "* Garmin - co  Fit Pay announced Garmin Pay Now Live on Garmin's Vívoactive 3 smartwatch  available to cardholders of issuing banks supporting new service​ Source text for Eikon: Further company coverage:",
        "date": "11172017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin and FitPay announce Garmin Pay Now Live on Garmin smartwatches "
    },
    {
        "content": "* Garmin announces integration with UnitedHealthcare motion wellness program  enabling eligible plan participants to earn more than $1 000 in annual rewards Source text for Eikon: Further company coverage:",
        "date": "11172017",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin announces integration with UnitedHealthcare Motion wellness program "
    },
    {
        "content": "Garmin Ltd  beat profit estimates for the eighth straight quarter and raised its full-year forecasts amid higher demand for its outdoor  marine and aviation devices  sending its shares up 5 percent.",
        "date": "11012017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "Garmin beats profit estimates on strong demand for outdoor gadgets "
    },
    {
        "content": "Nov 1 Garmin Ltd beat profit estimates for the eighth straight quarter and raised its full-year forecasts amid higher demand for its outdoor  marine and aviation devices  sending its shares up 5 percent.",
        "date": "11012017",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "UPDATE 2-Garmin beats profit estimates on strong demand for outdoor gadgets "
    },
    {
        "content": "* Garmin reports third quarter revenue and profit growth; raises guidance",
        "date": "11012017",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin reports qtrly ‍GAAP EPS was $0.78​ "
    },
    {
        "content": "Nov 1 Garmin Ltd reported a 2.9 percent rise in quarterly revenue on Wednesday  helped by demand for its outdoor activity gadgets such as GPS-based watches.",
        "date": "11012017",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "Garmin's quarterly revenue rises 2.9 pct "
    },
    {
        "content": "* Says has acquired Navionics S.p.A.​ Source text for Eikon: Further company coverage:",
        "date": "10272017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin acquires Navionics "
    },
    {
        "content": "* Garmin Ltd - ‍jury found that Garmin had \"willfully infringed\" two Navico \"downscan\" patents and awarded damages in amount of $38 million​",
        "date": "09082017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin announces verdict in another Navico patent lawsuit "
    },
    {
        "content": "* NXT-ID Inc - NXT-ID subsidiary FitPay to power Garmin Pay on Garmin vivoactive 3 smartwatch Source text for Eikon: Further company coverage:",
        "date": "09052017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-FitPay to power Garmin Pay on Garmin vivoactive 3 smartwatch "
    },
    {
        "content": "* Mastercard Inc - ‍announced that it is adding payment capabilities to newly launched Garmin Vívoactive 3​ Source text for Eikon: Further company coverage:",
        "date": "08312017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Mastercard ‍announces addition of payment capabilities to newly launched Garmin Vívoactive 3​ "
    },
    {
        "content": "* ‍Subsidiary Fitpay to power Garmin Pay on Garmin Vívoactive 3 smartwatch​ Source text for Eikon: Further company coverage:",
        "date": "08312017",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "BRIEF-Nxt-ID ‍subsidiary Fitpay to power Garmin Pay on Garmin Vívoactive 3 smartwatch​ "
    },
    {
        "content": "* Visa inc - enabled payments on new Garmin vívoactive 3 smartwatch​ Source text for Eikon: Further company coverage:",
        "date": "08312017",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "BRIEF-Visa Inc says enabled payments on new Garmin vívoactive 3 smartwatch​ "
    },
    {
        "content": "GPS-based gadgets maker Garmin Ltd  reported a better-than-expected quarterly profit  as robust demand for devices aimed at outdoor enthusiasts helped make up for flagging sales in its automobile products business.",
        "date": "08022017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "Garmin beats profit estimates as outdoor device sales soar "
    },
    {
        "content": "* 2nd-qtr adj profit 88 cents/shr vs est 81 (Adds analyst comment)",
        "date": "08022017",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "UPDATE 3-Garmin beats profit estimates as outdoor device sales soar "
    },
    {
        "content": "* Garmin reports second quarter revenue and earnings growth; raises guidance",
        "date": "08022017",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin Ltd Q2 EPS $0.91 "
    },
    {
        "content": "Aug 2Garmin Ltd  a maker of GPS-based gadgets  reported a 6.1 percent rise in quarterly profit on Wednesday  as strong sales of its fitness products more than offset weak demand for navigation products used in automobiles.",
        "date": "08022017",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "Garmin's quarterly profit rises 6.1 pct "
    },
    {
        "content": "* Majority of associates will be retained and will continue working in Montreal  Canada as part of deal Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin acquires Alphamantis "
    },
    {
        "content": "* Garmin disagrees with initial determination and will seek review by ITC  which is expected to issue a final determination in August 2017.",
        "date": "05262017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin to appeal ITC initial determination "
    },
    {
        "content": "* garmin® announces g5000h upgrade program for the sikorsky s-70 and uh-60 black hawk helicopters",
        "date": "04262017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin announces G5000H upgrade program for Sikorsky S-70 and UH-60 Black Hawk helicopters "
    },
    {
        "content": "* Medtronic- Co Garmin announce integration of Garmin wearable device data into Medtronic Care Management Services' remote patient monitoring platform Source text for Eikon: Further company coverage:",
        "date": "04132017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Medtronic syncs Garmin activity tracker data directly into remote patient monitoring mobile platform "
    },
    {
        "content": "* Garmin International Inc- European IFR Autorouting  flight plan filing & more are available with latest Garmin pilot update for apple mobile devices",
        "date": "04042017",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin announces expanded feature set for Garmin pilot application on Apple  Android mobile devices "
    },
    {
        "content": "* Garmin reports third quarter revenue and EPS growth; raises guidance",
        "date": "10262016",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin posts Q3 earnings of $0.66/share "
    },
    {
        "content": "GPS-based devices maker Garmin Ltd  reported a 6.3 percent rise in quarterly revenue as sales strengthened in its fitness and outdoor businesses.",
        "date": "10262016",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "Garmin posts a 6.3 percent rise in quarterly revenue "
    },
    {
        "content": "Oct 26 GPS-based devices maker Garmin Ltd  reported a 6.3 percent rise in quarterly revenue as sales strengthened in its fitness and outdoor businesses.",
        "date": "10262016",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "Garmin posts a 6.3 pct rise in quarterly revenue "
    },
    {
        "content": "* Terms of acquisition were not disclosed  Source text for Eikon:  Further company coverage:",
        "date": "09302016",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin Co has completed acquisition of Iiyonet Inc "
    },
    {
        "content": "* Breaking ground on a $200 million facility expansion at its Olathe  Kansas campus  Source text for Eikon:  Further company coverage:",
        "date": "08262016",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin Ltd - to embark on $200 mln campus expansion "
    },
    {
        "content": "* Garmin reports second quarter revenue and EPS growth; raises guidance",
        "date": "07272016",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin posts Q2 earnings of $0.85/share "
    },
    {
        "content": "* Garmin introduces d2 bravo titanium aviator watch; d2 bravo titanium available for a suggested retail price of $899.00  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05172016",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin introduces D2 bravo Titanium aviator watch "
    },
    {
        "content": "Garmin Ltd  reported a better-than-expected rise in quarterly revenue as strong demand for its GPS-based fitness devices more than offset a decline in sales of navigation products used in vehicles.",
        "date": "04272016",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "Garmin's revenue beats on healthy demand for fitness products "
    },
    {
        "content": "April 27 Garmin Ltd reported a better-than-expected rise in quarterly revenue as strong demand for its GPS-based fitness devices more than offset a decline in sales of navigation products used in vehicles.",
        "date": "04272016",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "UPDATE 1-Garmin's revenue beats on healthy demand for fitness products "
    },
    {
        "content": "* Q1 earnings per share view $0.42 -- Thomson Reuters I/B/E/S",
        "date": "04272016",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "BRIEF-Garmin reports Q1 earnings $0.46/shr "
    },
    {
        "content": "April 27 Garmin Ltd reported a 6.6 percent increase in quarterly revenue as strong sales of its GPS-based fitness devices more than offset weak demand for products used in vehicles.",
        "date": "04272016",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "Garmin revenue rises 6.6 percent "
    },
    {
        "content": "GPS-based gadget maker Garmin Ltd reported higher-than-expected quarterly revenue  helped by strong demand for navigational devices used in aircraft and fitness trackers.",
        "date": "02172016",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "Garmin beats on strong demand for fitness  aviation gadgets "
    },
    {
        "content": "* Pro forma earnings 74 cents/shr vs est 48 cents/shr   (Adds CEO comments; updates shares)",
        "date": "02172016",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "UPDATE 3-Garmin beats on strong demand for fitness  aviation gadgets "
    },
    {
        "content": "Feb 17 GPS-based devices maker Garmin Ltd  reported a 2.7 percent fall in quarterly revenue as lower demand for its products used in automobiles offset strong growth in its fitness and aviation businesses.",
        "date": "02172016",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "Garmin revenue falls on lower demand for auto gadgets "
    },
    {
        "content": "April 29 GPS-based gadgets maker Garmin Ltd's  quarterly revenue rose much less than expected as a strong dollar ate into its overseas income.",
        "date": "04292015",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "UPDATE 1-Garmin's revenue up less than expected due to strong dollar "
    },
    {
        "content": "April 29 Garmin Ltd  a maker of GPS-based gadgets  reported a 43.8 percent fall in quarterly profit  hurt by a strong dollar and weakness in its auto and outdoor businesses.",
        "date": "04292015",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "Garmin profit falls 43.8 pct "
    },
    {
        "content": "MALLORCA  Spain Years of scepticism toward scientific and technological innovation have been wiped out recently as cycling has been recovering from major drugs scandals  according to former professional rider and now team manager Jonathan Vaughters.",
        "date": "02202015",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "Doping in decline so technology now matters: Vaughters "
    },
    {
        "content": "GPS-based-device maker Garmin Ltd  which is seeing high growth in its fitness business  has prevailed in a patent dispute with a small San Diego company whose smartphone application synchronizes music to a user's workout.",
        "date": "02182015",
        "name": "Garmin Ltd",
        "news_type": "topStory",
        "symbol": "GRMN",
        "title": "Garmin wins appeal in fitness patent dispute "
    },
    {
        "content": "Garmin Ltd   a maker of GPS-based gadgets  said a stronger dollar would slow revenue growth and forecast a profit below market estimates for the full year.",
        "date": "02182015",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "Garmin expects stronger dollar to slow growth "
    },
    {
        "content": "Feb 18 Garmin Ltd  a maker of GPS-based gadgets  said a stronger dollar would slow revenue growth and forecast a profit below market estimates for the full year.",
        "date": "02182015",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "UPDATE 2-Garmin expects stronger dollar to slow growth "
    },
    {
        "content": "* Dow flat  S&P down 1.25 pt  Nasdaq up 1.5 pt   (Updates prices  adds Garmin outlook)",
        "date": "02182015",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "US STOCKS-Futures flat as Greece clarity sought; S&P at record "
    },
    {
        "content": "Feb 18 Garmin Ltd  a maker of GPS-based gadgets  reported a 5.7 percent rise in quarterly revenue  helped by strong sales of its fitness products.",
        "date": "02182015",
        "name": "Garmin Ltd",
        "news_type": "normal",
        "symbol": "GRMN",
        "title": "Navigation gear maker Garmin revenue rises 5.7 pct "
    }
]