[
    {
        "content": "* RECEIVES EUROPEAN MARKETING AUTHORISATION FOR SELF-INJECTABLE FORMULATION OF BENLYSTA FOR TREATMENT OF SYSTEMIC LUPUS ERYTHEMATOSUS​",
        "date": "11132017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithkline receives European marketing authorisation for self-injectable formulation of Benlysta for treatment of systemic lupus erythematosus "
    },
    {
        "content": "* ‍GlaxoSmithKline PLC reports a 13.3 percent stake in Spero Therapeutics Inc as of November 6 - SEC filing​ Source text: (http://bit.ly/2infUEI) Further company coverage:",
        "date": "11162017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-‍GlaxoSmithKline reports 13.3 percent stake in Spero Therapeutics "
    },
    {
        "content": "* Q1 CONSOL NET PROFIT EGP 18.2 ‍​MILLION VERSUS LOSS OF EGP 72.9 ‍​MILLION YEAR AGO",
        "date": "11142017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline posts Q1 consol profit "
    },
    {
        "content": "LONDON  Nov 16 Europe has approved GlaxoSmithKline's new three-in-one inhaler for chronic lung disease  which the group hopes will help it keep its lead in respiratory medicine despite falling sales of older drug Advair.",
        "date": "11162017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Europe approves GlaxoSmithKline's new triple lung drug "
    },
    {
        "content": "* ‍HAL BARRON HAS BEEN APPOINTED CHIEF SCIENTIFIC OFFICER AND PRESIDENT  RESEARCH AND DEVELOPMENT​",
        "date": "11082017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline says ‍Hal Barron appointed as chief scientific officer and president  research and development​ "
    },
    {
        "content": "LONDON  Nov 9 AstraZeneca is enjoying booming drug sales in China  helped by reforms to the country's regulatory system and an increased sales force  in sharp contrast to its British rival GlaxoSmithKline.",
        "date": "11092017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "AstraZeneca rides China wave as rival GlaxoSmithKline struggles "
    },
    {
        "content": "* TRELEGY ELLIPTA ONCE-DAILY SINGLE INHALER TRIPLE THERAPY GAINS MARKETING AUTHORISATION IN EUROPE FOR TREATMENT OF COPD​ Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline says European Commission grants marketing authorisation for Trelegy Ellipta "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  November 01 (Fitch) Fitch Ratings has affirmed UK-based pharmaceuticals company GlaxoSmithKline PLC's (GSK) Long-Term Issuer Default Rating (IDR) at 'A' with Stable Outlook. Fitch has also affirmed the senior unsecured rating at 'A' for the debt issued by GlaxoSmithKline PLC  GlaxoSmithKline Capital PLC  and GlaxoSmithKline Capital Inc. The affirmation reflects Fitch's expectation that GSK's leverage should remain at the top end",
        "date": "11012017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Fitch Affirms GSK at 'A'; Stable Outlook "
    },
    {
        "content": "* French company had first-half sales of $78 mln (Adds Breakingviews link  further detail on Novartis cancer drugs)",
        "date": "10302017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 3-Novartis to buy French cancer specialist AAA for $3.9 bln "
    },
    {
        "content": "* GSK STUDY DEMONSTRATES SUPERIORITY OF ANORO ELLIPTA TO STIOLTO RESPIMAT IN IMPROVING LUNG FUNCTION IN CHRONIC OBSTRUCTIVE PULMONARY DISEASE",
        "date": "11012017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK and Innoviva announce positive data from COPD study "
    },
    {
        "content": "* ‍GSK - VIIV HEALTHCARE ANNOUNCES POSITIVE PHASE 3 RESULTS FROM BRIGHTE STUDY OF FOSTEMSAVIR IN HEAVILY TREATMENT-EXPERIENCED PATIENTS WITH HIV​",
        "date": "10272017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-ViiV Healthcare announces positive phase 3 results from BRIGHTE study of fostemsavir "
    },
    {
        "content": "Oct 20 The U.S. Food and Drug Administration approved GlaxoSmithKline's Shingrix shingles vaccine for use in adults aged 50 and over  a move widely expected after an advisory panel to the agency last month voted unanimously to recommend its approval  the company announced on Friday.",
        "date": "10202017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline adult shingles vaccine wins U.S. approval "
    },
    {
        "content": "* Shingrix approved in the us for prevention of shingles in adults aged 50 and over‍​ ‍​",
        "date": "10202017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline says Shingrix approved in US "
    },
    {
        "content": "LONDON/SHANGHAI  Oct 19 Investors are betting on China's potential to feed the global pharmaceutical pipeline  putting a multi-billion-dollar price tag on a handful of stocks  even as the country struggles to close a huge R&D gap with the West.",
        "date": "10192017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "INSIGHT-China biotech's 'coming out party' masks long road ahead "
    },
    {
        "content": "Oct 13 Canadian health regulators have approved GlaxoSmithKline's key shingles vaccine  the company said on Friday.",
        "date": "10132017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline's shingles vaccine gets approval in Canada "
    },
    {
        "content": "* ‍SHINGRIX HAS BEEN APPROVED IN CANADA FOR PREVENTION OF SHINGLES (HERPES ZOSTER) IN PEOPLE AGED 50 YEARS OR OLDER​",
        "date": "10132017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline says ‍shingles vaccine approved in Canada "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Painkillers and pile cream: these are either the recipe for a terrible night in  or a potentially good corporate deal. Pfizer  the $215 billion U.S. drugmaker  has tasked investment banks with looking into a spinoff or sale of its consumer-goods division  which makes Advil and Preparation H. New GlaxoSmithKline boss Emma Walmsley would be well placed to offer a home.",
        "date": "10102017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Breakingviews - Pfizer and Glaxo may find romance over the counter "
    },
    {
        "content": "LONDON  Oct 5 Britain's pharmaceuticals industry has thrown in the towel in a legal battle over new cost curbs imposed by the state-run health service  after failing to secure a judicial review.",
        "date": "10052017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-Drug industry gives up legal battle over new UK cost curbs "
    },
    {
        "content": "* ‍JAPANESE MHLW APPROVED BENLYSTA FOR TREATMENT OF ADULT PATIENTS WITH SLE WHO ARE INADEQUATE RESPONDERS TO EXISTING THERAPIES​ Further company coverage:",
        "date": "09272017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline receives approval for Benlysta in Japan for treatment of systemic lupus erythematosus "
    },
    {
        "content": "Sept 22 The U.S. Food and Drug Administration has declined to approve Johnson & Johnson's rheumatoid arthritis drug sirukumab  saying additional clinical data is needed to further evaluate its safety  the company said on Friday.",
        "date": "09252017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "CORRECTED-UPDATE 2-FDA declines to approve J&J arthritis drug sirukumab "
    },
    {
        "content": "* Theravance Biopharma highlights positive headline results from impact study of Trelegy Ellipta announced by Glaxosmithkline and Innoviva",
        "date": "09202017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Theravance Biopharma highlights positive results from impact study of Trelegy Ellipta "
    },
    {
        "content": "LONDON U.S. regulators have approved GlaxoSmithKline's three-in-one inhaler for chronic lung disease  a key new product for the group as it strives to keep its lead in respiratory medicine despite falling sales of the older drug Advair.",
        "date": "09192017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GlaxoSmithKline breathes easier as U.S. approves triple lung drug "
    },
    {
        "content": "* CO  INNOVIVA REPORT POSITIVE HEADLINE RESULTS FROM STUDY SHOWING SINGLE INHALER TRIPLE THERAPY TRELEGY ELLIPTA REDUCED COPD EXACERBATIONS",
        "date": "09202017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithkline and Innoviva announces positive impact results for Trelegy in COPD "
    },
    {
        "content": "* CEO sees it as one of three \"critical\" new drug launches (Adds detail on competition  analyst reaction  shares)",
        "date": "09192017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GlaxoSmithKline breathes easier as U.S. approves triple lung drug "
    },
    {
        "content": "Sept 18 GlaxoSmithKline Plc and Innoviva Inc said on Monday the U.S. Food and Drug Administration has approved their  triple drug inhaler for treatment of chronic obstructive pulmonary disease (COPD).",
        "date": "09182017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "U.S. FDA approves GSK's three-in-one drug inhaler for COPD "
    },
    {
        "content": "JOHANNESBURG  Sept 14 South Africa's Aspen Pharmacare reported a 46 percent rise in full-year profit  buoyed by a revenue boost from an anaesthetics portfolio acquired from AstraZeneca and GlaxoSmithKline  the company said on Thursday.",
        "date": "09142017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "South Africa's Aspen Pharmacare posts 46 pct profit jump "
    },
    {
        "content": "* FDA ADVISORY COMMITTEE VOTES UNANIMOUSLY FOR SHINGRIX (HZ/SU) IN US FOR PREVENTION OF HERPES ZOSTER (SHINGLES) IN ADULTS AGES 50 AND OVER​ Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "09142017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline announces unanimous FDA approval for Shingrix in over 50s "
    },
    {
        "content": "PARIS  Sept 15 French biotech company Neovacs is confident that its experimental drug to treat lupus could grab significant market share from standard treatments of the auto-immune disease  its chief executive said.",
        "date": "09152017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "France's Neovacs takes on GSK and AstraZeneca in battle to treat lupus "
    },
    {
        "content": "* GSK RECEIVES CHMP POSITIVE OPINION FOR SELF-INJECTABLE FORMULATION OF BENLYSTA FOR SYSTEMIC LUPUS ERYTHEMATOSUS",
        "date": "09152017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK gets EU greenlight for self-injectable version of lupus drug "
    },
    {
        "content": "GlaxoSmithKline said on Friday that a European Medicines Agency (EMA) panel has recommended the company's three-in-one inhaled lung drug.",
        "date": "09152017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK's three-in-one inhaler gets positive opinion from EU agency "
    },
    {
        "content": "* ANNOUNCES PHASE III RESULTS PUBLISHED IN NEJM OF MEPOLIZUMAB IN PATIENTS WITH EOSINOPHILIC COPD AT RISK OF EXACERBATIONS",
        "date": "09122017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline announces mepolizumab phase III results in patients with COPD "
    },
    {
        "content": "Sept 15 GlaxoSmithKline said on Friday that a European Medicines Agency (EMA) panel has recommended the company's three-in-one inhaled lung drug.",
        "date": "09152017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK's three-in-one inhaler gets positive opinion from EU agency "
    },
    {
        "content": "* STUDY WAS DESIGNED TO EXPLORE EFFECTIVENESS OF AN ASTHMA MEDICINE WHEN USED WITH MINIMAL INTERVENTION IN BROAD GROUP OF PEOPLE WITH ASTHMA Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "09112017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline announce positive results from SLS lung study "
    },
    {
        "content": "* TRELEGY ELLIPTA ONCE-DAILY SINGLE INHALER TRIPLE THERAPY RECEIVES POSITIVE OPINION FROM THE CHMP IN EUROPE FOR APPROPRIATE PATIENTS WITH COPD",
        "date": "09152017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline says Trelegy Ellipta once-daily single inhaler triple therapy receives positive opinion from CHMP in Europe "
    },
    {
        "content": "* BOARD APPROVES DIVIDEND OF 5 PERCENT FOR YEAR 2016 Source:(http://bit.ly/2gpnSyR) Further company coverage:",
        "date": "08302017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline board approves FY dividend "
    },
    {
        "content": "* Propeller Health announces expansion of digital health collaboration with GlaxoSmithKline to improve management of asthma and COPD Source text for Eikon: Further company coverage:",
        "date": "08242017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Propeller Health to expand digital health collaboration with GlaxoSmithKline "
    },
    {
        "content": "LONDON  Aug 24 Novartis has appointed a senior retail expert to the new post of chief digital officer  following a similar move by GlaxoSmithKline last month  underscoring how drugmakers are grappling with the impact of new technology.",
        "date": "08242017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Novartis picks retail expert for new role of digital chief "
    },
    {
        "content": "Aug 2 The benefits of Johnson & Johnson's experimental rheumatoid arthritis drug sirukumab do not outweigh the risks  an advisory panel to the U.S. Food and Drug Administration concluded on Wednesday.",
        "date": "08022017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-U.S. FDA panel votes against approval of J&J arthritis drug "
    },
    {
        "content": "July 31 There were more deaths in patients taking Johnson & Johnson's experimental rheumatoid arthritis drug sirukumab than among those taking a placebo  staff reviewers for the U.S. Food and Drug Administration said in a report published Monday.",
        "date": "07312017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 3-J&J arthritis drug sirukumab raises safety concerns -FDA staff "
    },
    {
        "content": "LONDON GlaxoSmithKline's new chief executive announced plans on Wednesday to narrow the focus of the group's drug research by ditching more than 30 drug projects to improve returns in its core pharmaceuticals business.",
        "date": "07262017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GlaxoSmithKline's new boss streamlines R&D  axes slew of drugs "
    },
    {
        "content": "LONDON  July 26 GlaxoSmithKline's new chief executive announced plans on Wednesday to narrow the focus of the group's drug research by ditching more than 30 drug projects to improve returns in its core pharmaceuticals business.",
        "date": "07262017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "REFILE-UPDATE 3-GlaxoSmithKline's new boss streamlines R&D  axes slew of drugs "
    },
    {
        "content": "LONDON  July 26 GlaxoSmithKline's new Chief Executive Emma Walmsley announced plans on Wednesday to streamline drug research in a bid to improve returns in the group's core pharmaceuticals business.",
        "date": "07262017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline's new boss streamlines drug research "
    },
    {
        "content": "* VIIV HEALTHCARE  MAJORITY OWNED BY GSK  WITH PFIZER AND SHIONOGI AS SHAREHOLDERS  ANNOUNCED POSITIVE INTERIM RESULTS FROM DAWNING Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "07252017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-ViiV announces positive results from DAWNING "
    },
    {
        "content": "* Proposals announced today for Worthing and Slough will result in a reduction of approximately 320 permanent jobs over next 4 years",
        "date": "07192017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK to sell UK Horlicks business "
    },
    {
        "content": "* GSK submits EU filing for extended use of Relvar Ellipta in patients with controlled asthma on an ICS/LABA combination Source text for Eikon: Further company coverage:",
        "date": "07212017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK and Innoviva submit EU filing for extended use of Relvar Ellipta "
    },
    {
        "content": "* Submits EU filing for extended use of Relvar Ellipta in patients with controlled asthma on an ICS/LABA combination Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "07212017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline submits EU filing for Relvar Ellipta extension "
    },
    {
        "content": "* Glaxosmithkline Plc says begun shipping quadrivalent vaccine doses to U.S. healthcare providers",
        "date": "07142017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK begins shipping quadrivalent vaccine doses to U.S. healthcare providers "
    },
    {
        "content": "* Receives FDA approval for a new self-injectable formulation of benlysta (belimumab) for systemic lupus erythematosus",
        "date": "07212017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline receives FDA approval for new self-injectable formulation of Benlysta "
    },
    {
        "content": "LONDON  July 21 GlaxoSmithKline's new chief executive  who has already made her mark with plans to divest some nutritional products  will turn next week to the main business of focusing the company's pipeline of new drugs.",
        "date": "07212017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline's new CEO prepares to trim drug pipeline "
    },
    {
        "content": "* Oncomed Pharmaceuticals Inc - on July 7  received a letter  dated June 30  2017 from Glaxosmithkline LLC- SEC filing",
        "date": "07102017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Oncomed says GSK terminates license agreement with company "
    },
    {
        "content": "* Q1 standalone net loss after tax EGP 45.6 million versus loss of EGP 69 million year ago",
        "date": "07062017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Egypt's Glaxosmithkline Q1 standalone loss narrows "
    },
    {
        "content": "* GSK starts phase III study with Mepolizumab in patients with nasal polyps",
        "date": "06272017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline starts phase III study for nasal polyps drug "
    },
    {
        "content": "* Glaxosmithkline Plc CEO Emma Walmsley is pursuing a sale of Maxinutrition  a nutritional products brand - Sky News Source text : http://bit.ly/2s0Hw4u Further company coverage:",
        "date": "06222017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK CEO Walmsley pursuing sale of Maxinutrition brand - Sky News "
    },
    {
        "content": "June 21 A U.S. jury has ordered Teva Pharmaceutical Industries Ltd to pay GlaxoSmithKline Plc more than $235 million for infringing a patent covering its blood pressure drug Coreg  court documents showed.",
        "date": "06212017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK wins $235 million from Teva in Coreg patent trial "
    },
    {
        "content": "* ‍GSK and Medicines for Malaria Venture announced positive results from two phase III studies of Tafenoquine​",
        "date": "06122017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline announces positive results from two phase III studies of Tafenoquine​ "
    },
    {
        "content": "* GSK and MMV announce positive headline Phase III results showing single-dose tafenoquine reduces risk of relapse in patients with Plasmodium vivax malaria Further company coverage: (Reporting by UK bureau)",
        "date": "06122017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK reports positive results with single-dose tafenoquine in malaria "
    },
    {
        "content": "* FY consol net loss EGP 3.9 million versus profit of EGP 69.1 million year ago",
        "date": "06062017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline posts FY consol loss "
    },
    {
        "content": "* KUEHNE + NAGEL AND GLAXOSMITHKLINE EXPAND PARTNERSHIP WITH NEW UK DOMESTIC DISTRIBUTION CONTRACT Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "05172017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Kuehne und Nagel and GlaxoSmithKline expand partnership with new UK domestic distribution contract "
    },
    {
        "content": "LONDON British fund manager Neil Woodford said on Friday he had sold out of pharma company GlaxoSmithKline  after a \"frustrating\" stint as an investor spanning more than 15 years.",
        "date": "05122017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Top-10 Glaxo investor Woodford sells out  criticises board "
    },
    {
        "content": "* Buys into 'well-managed' Lloyds Banking Group (Adds Glaxo statement)",
        "date": "05122017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-Top-10 Glaxo investor Woodford sells out  criticises board "
    },
    {
        "content": "LONDON GlaxoSmithKline is likely to escape generic competition to its blockbuster lung drug Advair in the United States this year  after a second application for a cut-price equivalent form of the medicine was turned down by U.S. regulators.",
        "date": "05112017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK escapes Advair hit for now as second generic bid fails "
    },
    {
        "content": "LONDON  May 12 High-profile British fund manager Neil Woodford said on Friday he had sold out of pharmaceutical company GlaxoSmithKline after holding shares in the company for more than 15 years.",
        "date": "05122017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Top-10 Glaxo investor Woodford sells out  fires broadside at board "
    },
    {
        "content": "LONDON  May 11 Hikma Pharmaceuticals said on Thursday that U.S. regulators had decided not to approve its generic copy of GlaxoSmithKline's blockbuster lung drug Advair at this time  due to 'major' issues with its application.",
        "date": "05112017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Hikma's generic Advair faces U.S. delay  2017 approval unlikely "
    },
    {
        "content": "* Announced positive results from innovative Salford Lung Study (SLS) in asthma",
        "date": "05052017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline announces positive results for asthma drug study "
    },
    {
        "content": "May 11 Britain's FTSE 100 index is seen opening 11 points lower on Thursday  according to financial bookmakers  with futures up 0.05 percent ahead of the cash market open.",
        "date": "05112017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-UK Stocks-Factors to watch on May 11 "
    },
    {
        "content": "    May 11 Britain's FTSE 100 index is seen opening 11 points lower on Thursday  according to financial bookmakers.           * BHP: Workers at BHP Billiton's  Cerro Colorado copper mine in Chile will strike for 24 hours in the coming weeks to protest recent layoffs and the company's general attitude toward miners  the main union told Reuters on Wednesday.     * MYLAN/GLAXO: Generic drug maker Mylan NV on Wednesday said it disagrees with the reasoning behind the U.S. Food and Drug Ad",
        "date": "05112017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UK Stocks-Factors to watch on May 11 "
    },
    {
        "content": "* Bluebird bio enters lentiviral vector patent license agreement with Glaxosmithkline for commercialization of gene therapies",
        "date": "05022017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Bluebird Bio enters into patent license agreement with Glaxosmithkline for commercialization of Gene Therapies "
    },
    {
        "content": "* Q1 group loss before tax of 8.3 million naira versus profit of 167.5 million naira year ago",
        "date": "04282017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Glaxo Smithkline Consumer Nig reports Q1 group loss before tax of 8.3 mln naira "
    },
    {
        "content": "* Q1 adjusted EPS 25.0 pence vs consensus 24.5p (Adds analyst comment  latest shares)",
        "date": "04262017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 2-New GlaxoSmithKline CEO wants fewer  bigger new drug launches "
    },
    {
        "content": "LONDON GlaxoSmithKline's  new chief executive reported slightly better than expected first-quarter results on Wednesday  keeping the drugmaker on track to hit financial targets in 2017 as it braces for generic competition to blockbuster lung drug Advair.",
        "date": "04262017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Weak sterling boosts GlaxSmithKline as new CEO takes over "
    },
    {
        "content": "Teva Pharmaceutical Industries Ltd on Thursday launched an asthma inhaler that will be the first direct competition to GlaxoSmithKline's best-selling Advair.",
        "date": "04202017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Teva's new asthma inhaler poses first competition for GSK's Advair "
    },
    {
        "content": "* JV between GSK  Daiichi Sankyo submitted new drug application in Japan seeking approval for candidate shingles vaccine  shingrix Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "04182017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK seeks Japanese approval for shingles vaccine "
    },
    {
        "content": "April 20 Teva Pharmaceutical Industries Ltd on Thursday launched an asthma inhaler that will be the first direct competition to GlaxoSmithKline's best-selling Advair.",
        "date": "04202017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-Teva's new asthma inhaler poses first competition for GSK's Advair "
    },
    {
        "content": "April 20 Teva Pharmaceutical Industries Ltd launched its asthma inhaler and the authorized generic of the drug on Thursday  nearly three months after it got U.S. approval to market a copy of GlaxoSmithKline's best-selling Advair.",
        "date": "04202017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Teva launches copy of asthma inhaler Advair "
    },
    {
        "content": "April 13 Drug company Innoviva Inc said on Thursday it would undertake a review of its costs  including executive compensation following pressure from activist investor Sarissa Capital Management LP.",
        "date": "04132017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 1-Innoviva to review costs  executive pay following Sarissa pressure "
    },
    {
        "content": "* As a result of its latest review  GSK will be making following change to its financial reporting from Q1 2017.",
        "date": "04112017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK makes changes to financial reporting; sees growth in emerging markets "
    },
    {
        "content": "April 10 OncoMed Pharmaceuticals Inc said it would discontinue a trial testing its experimental therapy demcizumab as an initial treatment for advanced pancreatic cancer  after the addition of the drug to standard-of-care failed a mid-stage study.",
        "date": "04112017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "CORRECTED-UPDATE 2-OncoMed sinks as cancer drug fails; Bayer opts against licensing drugs "
    },
    {
        "content": "* GlaxoSmithKline - The debt securities will be issued by co or through one of its finance subsidiaries Source text: [http://bit.ly/2oCKaNv] Further company coverage:",
        "date": "04032017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline files for debt shelf of up to $10 bln - SEC Filing "
    },
    {
        "content": "April 4 GSK Plc is voluntarily recalling more than 593 000 Ventolin asthma inhalers from U.S. hospitals  pharmacies  retailers and wholesalers due to a defect that may cause them to deliver fewer doses of the medicine than indicated  the British drugmaker said on Tuesday.",
        "date": "04042017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Drugmaker GSK recalling nearly 600 000 asthma inhalers in U.S. "
    },
    {
        "content": "* GSK starts phase III study with Mepolizumab in patients with severe Hypereosinophilic syndrome Source text for Eikon:",
        "date": "03312017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline starts phase III study with Mepolizumab in patients with severe Hypereosinophilic syndrome "
    },
    {
        "content": "Mylan NV said on Wednesday the U.S. Food and Drug Administration declined to approve its generic version of GlaxoSmithKline Plc's  blockbuster Advair asthma treatment  but provided no details of the agency's concerns or how long the product might be delayed.",
        "date": "03292017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "FDA declines to approve Mylan's generic of GSK's Advair for now "
    },
    {
        "content": "March 29 Mylan NV said on Wednesday the U.S. Food and Drug Administration declined to approve its generic version of GlaxoSmithKline Plc's blockbuster Advair asthma treatment  but provided no details of the agency's concerns or how long the product might be delayed.",
        "date": "03292017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-FDA declines to approve Mylan's generic of GSK's Advair for now "
    },
    {
        "content": "March 29 Mylan NV said on Wednesday its application to market a generic copy of GlaxoSmithKline Plc's blockbuster inhaled lung drug Advair was rejected by the U.S. Food and Drug Administration.",
        "date": "03292017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "U.S. FDA rejects Mylan's generic version of GSK's Advair "
    },
    {
        "content": "LONDON British businesses have endured a roller coaster ride since the vote to leave the European Union  with some ramping up their investment in the country and others pulling market flotations and ditching takeover deals.",
        "date": "03292017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Factbox: British business navigates rocky path to Brexit "
    },
    {
        "content": "* GSK announces US regulatory submission seeking expanded indication for Fluarix Quadrivalent (Influenza vaccine) for infants 6 months and older  Source text for Eikon:  Further company coverage:",
        "date": "03152017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK announces U.S. regulatory submission seeking expanded indication for Fluarix Quadrivalent for infants 6 months and older "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - GlaxoSmithKline’s chief executive pay cut is a false economy. The pharmaceutical group will pay new boss Emma Walmsley a quarter less than her predecessor  Andrew Witty  on account of her experience. Yet the modest gains seem out of kilter with the potential cost of inexperience.",
        "date": "03152017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Glaxo boss pay cut is a false economy "
    },
    {
        "content": "* Phase IIIB Musca study successfully met all its primary and secondary endpoints",
        "date": "03062017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK says asthma drug Nucala (Mepolizumab) meets primary endpoints "
    },
    {
        "content": "* Feb. 23 2017 positive results for Relvar Ellipta lung function study in patients with well-controlled asthma positive headline results from a non-inferiority lung function study read more",
        "date": "03022017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline says for results positive in asthma study "
    },
    {
        "content": "* Aspen Holdings is pleased to announce that this transaction completed   Source text for Eikon:  Further company coverage:",
        "date": "03012017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Aspen completes acquisition of a portfolio of anaesthetics with GlaxoSmithKline "
    },
    {
        "content": "* Positive results for Relvar Ellipta lung function study in patients with well-controlled asthma",
        "date": "02232017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK reports positive results in study for controlled asthma "
    },
    {
        "content": "* GSK  AZ  Shire welcome update   (Adds GSK statement  analyst comment  details)",
        "date": "02232017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-China updates key drug list in boost for Big Pharma "
    },
    {
        "content": "GlaxoSmithKline has urged a federal judge in Illinois to toss several claims to a lawsuit alleging that a generic version of its antidepressant Paxil caused a Reed Smith partner's suicide.",
        "date": "02132017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK asks judge to toss several claims from generic Paxil case "
    },
    {
        "content": "LONDON  Feb 14 Gilead Sciences has thrown down a challenge to GlaxoSmithKline with good clinical trial results for an experimental HIV drug that works in the same way as the British group's successful dolutegravir.",
        "date": "02142017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Gilead challenges GSK with strong HIV drug data "
    },
    {
        "content": "* Announces detailed positive phase III results for investigational two-drug regimen of dolutegravir and rilpivirine for HIV treatment",
        "date": "02142017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK announces positive final stage results for two-drug HIV treatment "
    },
    {
        "content": "Feb 14 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "02142017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "PRESS DIGEST- Financial Times - Feb 14 "
    },
    {
        "content": "LONDON  Feb 6 Emma Walmsley  GlaxoSmithKline's  incoming CEO  will take over Britain's biggest drugmaker at a challenging time but the 47-year-old also inherits the flexibility to do deals and make key choices on new drugs.",
        "date": "02062017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "New GlaxoSmithKline CEO prepares for R&D choices  potential deals "
    },
    {
        "content": "LONDON  Feb 8 GlaxoSmithKline and Gilead Sciences will vie for business in treating HIV patients next week when both companies unveil clinical trial results at a medical meeting in Seattle.",
        "date": "02082017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline and Gilead to face off at HIV meeting next week "
    },
    {
        "content": "* GSK Consumer Healthcare - announced nationwide launch of flonase sensimist allergy relief  Source text for Eikon:  Further company coverage:",
        "date": "02082017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK says launched flonase sensimist allergy relief nationwide "
    },
    {
        "content": "LONDON  Feb 8 GlaxoSmithKline sales and profits jumped in the fourth quarter  helped by falling sterling  but the drugmaker cautioned profit growth could be impacted in 2017 by generic competition to its top-selling lung drug Advair.",
        "date": "02082017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Weak pound buoys GSK but drugmaker warns on 2017 generic threat "
    },
    {
        "content": "* Innoviva Inc - on January 28  2017  Glaxosmithkline (GSK) announced launch of Anoro (umeclidinium/vilanterol) in France  Source text - http://bit.ly/2jnKvV8 Further company coverage:",
        "date": "01302017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Innoviva says GSK announces launch of Anoro in France "
    },
    {
        "content": "LONDON Israel's Teva Pharmaceutical Industries has won U.S. approval to market a copy of GlaxoSmithKline's best-selling Advair inhaler  although the real battle is still to come.",
        "date": "01302017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "As Teva wins U.S. approval for GSK Advair copy  main fight yet to come "
    },
    {
        "content": "LONDON  Jan 30 Israel's Teva Pharmaceutical Industries has won U.S. approval to market a copy of GlaxoSmithKline's best-selling Advair inhaler  although the real battle is still to come.",
        "date": "01302017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "As Teva wins US approval for GSK Advair copy  main fight yet to come "
    },
    {
        "content": "GlaxoSmithKline has asked a federal judge to throw out a future damages claim and block the introduction of evidence about branding issues in a lawsuit alleging the company's antidepressant Paxil caused birth defects.",
        "date": "01262017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK asks judge to limit damages  evidence in Paxil birth-defect trial "
    },
    {
        "content": "* Inclusion makes medicines accessible through state insurance",
        "date": "01262017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Cancer  hepatitis treatments set for boost as China overhauls drugs list "
    },
    {
        "content": "* Miels was head of Astra's European business   (Adds interview with GSK CEO in Davos  further details)",
        "date": "01192017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 2-GSK grabs Astra executive to replace pharma head "
    },
    {
        "content": "* Luke Miels appointed president  global pharmaceuticals  gsk",
        "date": "01192017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline appoints Luke Miels President  Global Pharma "
    },
    {
        "content": "* Abbas hussain  president  global pharmaceuticals has decided to leave company. He has agreed with gsk that he will leave company later this year  Source text for Eikon:  Further company coverage:    (Reporting By UK Bureau)",
        "date": "01192017",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK's pharmaceuticals president Abbas Hussain to leave in 2017 "
    },
    {
        "content": "LONDON Drugmaker GlaxoSmithKline is bolstering scientific expertise on its board by establishing a new science committee  charged with overseeing research  as a new chief executive prepares to take over.",
        "date": "12192016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK boosts board-level science as new CEO prepares to take over "
    },
    {
        "content": "LONDON GlaxoSmithKline said on Tuesday its HIV unit ViiV Healthcare had started a large study to test an experimental long-acting injection for preventing the virus that causes AIDS.",
        "date": "12202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK launches big study to test new injection for HIV prevention "
    },
    {
        "content": "LONDON GlaxoSmithKline's already fast-growing HIV drug business has received an important boost after two major clinical studies successfully tested a new two-drug treatment regimen to control the virus that causes AIDS.",
        "date": "12202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK's two-drug HIV therapy shines in two big studies "
    },
    {
        "content": "LONDON GlaxoSmithKline said on Monday that Dominique Limet would step down at the end of March 2017 as head of the drugmaker's majority-owned HIV business ViiV Healthcare  to be replaced by GSK insider Deborah Waterhouse.",
        "date": "12052016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK insider Waterhouse to head drugmaker's HIV unit ViiV "
    },
    {
        "content": "* GSK announces EU regulatory submission of candidate vaccine for prevention of shingles",
        "date": "11252016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline submits marketing application for shingles vaccine to EMA "
    },
    {
        "content": "LONDON GlaxoSmithKline has started pivotal trials of an experimental anemia drug  chasing AstraZeneca in the race to develop a medicine that mimics the body's response to high altitude.",
        "date": "11242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK chases Astra with start of big anemia drug trials "
    },
    {
        "content": "LONDON  Nov 24 GlaxoSmithKline has started pivotal trials of an experimental anaemia drug  chasing AstraZeneca in the race to develop a medicine that mimics the body's response to high altitude.",
        "date": "11242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK chases Astra with start of big anaemia drug trials "
    },
    {
        "content": "* Phase lll study of mepolizumab meets co-primary endpoints and all secondary endpoints in patients with eosinophilic granulomatosis with polyangiitis",
        "date": "11232016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK's Mepolizumab meets endpoints in phase 3 EGPA study "
    },
    {
        "content": "* GSK receives FDA approval for expanded indication for flulaval\u007f quadrivalent (influenza vaccine) for infants 6 months and older  Source text for Eikon:  Further company coverage:",
        "date": "11212016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK receives FDA approval for expanded indication for flulaval\u007f quadrivalent (influenza vaccine) for infants 6 months and older "
    },
    {
        "content": "* GSK files regulatory submission of candidate vaccine for prevention of shingles in Canada",
        "date": "11212016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK files regulatory submission of candidate vaccine "
    },
    {
        "content": "LONDON  Nov 21 GlaxoSmithKline said on Monday it had filed its new three-in-one inhaled lung drug for U.S. approval  putting it on track to reach the market ahead of rivals in 2017  assuming it wins a green light.",
        "date": "11212016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline seeks U.S. approval for triple lung drug "
    },
    {
        "content": "Nov 17 Britain's FTSE 100 index is seen opening 19 to 21 points higher  or up as much as 0.3 percent on Thursday  according to financial bookmakers.          * The UK blue chip index ended down 0.6 percent on Wednesday after gaining in the previous two sessions  with companies such as jet engine maker Rolls-Royce and the country's biggest housebuilder Barratt  slipping.      * ANGLO AMERICAN: Global miner Anglo American said on Wednesday it was suspending all operations at its Los Br",
        "date": "11172016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UK Stocks-Factors to watch on Nov 17 "
    },
    {
        "content": "* Files regulatory submission in US for once-daily closed triple combination therapy ff/umec/vi for patients with copd",
        "date": "11212016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK files regulatory submission in U.S. for COPD treatment "
    },
    {
        "content": "LONDON  Nov 15 Two of Europe's biggest drugmakers warned on Tuesday there would be no let up in pressure on U.S. medicine prices after last week's presidential election win for Republican Donald Trump  which sent pharmaceutical and biotech shares soaring.",
        "date": "11152016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Sanofi  GSK expect further price pressure  more M&A under Trump "
    },
    {
        "content": "LONDON  Nov 16 Two former corporate investigators have sued GlaxoSmithKline  alleging the drugmaker misled them and induced them to investigate an innocent person  resulting in their imprisonment.",
        "date": "11162016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Ex-sleuths sue GlaxoSmithKline over imprisonment in China "
    },
    {
        "content": "* Q3 consol net profit EGP 103.7 million versus net loss EGP 27.4 million year ago",
        "date": "11152016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline posts Q3 net profit "
    },
    {
        "content": "* Move follows similar by rival drugmaker GSK   (Adds response from MSF  background on pressure)",
        "date": "11112016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 1-Pfizer offers cut-price pneumonia shot for humanitarian crises "
    },
    {
        "content": "LONDON  Nov 11 U.S. pharmaceuticals giant Pfizer  is to offer its pneumococcal vaccine at the lowest possible price to non-governmental organisations seeking to protect vulnerable people from illness in humanitarian crises.",
        "date": "11112016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Pfizer offers cut-price pneumonia shot for humanitarian crises "
    },
    {
        "content": "The U.S. Supreme Court on Monday refused to hear an appeal of a decision holding that GlaxoSmithKline PLC's license of its anti-seizure drug Lamictal to Teva Pharmaceutical Industries Ltd may have been an anticompetitive \"pay-for-delay\" deal  allowing an antitrust lawsuit against the companies to go forward.",
        "date": "11072016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Supreme Court will not hear pay-for-delay case over GSK's Lamictal "
    },
    {
        "content": "* GlaxoSmithKline Plc reports 8.3 percent stake in Crispr Therapeutics AG as of Oct. 18 - SEC filing",
        "date": "10282016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline reports 8.3 pct stake in Crispr Therapeutics AG "
    },
    {
        "content": "* Gsk receives european approval for updated Boostrix and Boostrix Polio label to benefit pregnant women  Further company coverage:",
        "date": "11012016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK gets European nod for Boostrix vaccine label changes "
    },
    {
        "content": "LONDON GlaxoSmithKline has filed its shingles vaccine Shingrix for U.S. regulatory approval  the drugmaker said on Monday  bringing the potential $1 billion-a-year seller a step closer to market.",
        "date": "10242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK files potential $1 billion shingles vaccine for U.S. approval "
    },
    {
        "content": "* Consensus forecasts point to $1.05 billion sales in 2021   (Adds sales forecast  background on rival vaccines)",
        "date": "10242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK files potential $1 bln shingles vaccine for U.S. approval "
    },
    {
        "content": "LONDON  Oct 24 GlaxoSmithKline said on Monday it had filed its shingles vaccine Shingrix for U.S. regulatory approval  bringing the potential blockbuster a step closer to market.",
        "date": "10242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK seeks U.S. approval for shingles vaccine Shingrix "
    },
    {
        "content": "* Announces U.S. regulatory submission of candidate vaccine for prevention of Shingles",
        "date": "10242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK submits U.S. application for Shingles vaccine "
    },
    {
        "content": "LONDON  Oct 26 GlaxoSmithKline comments on China during third-quarter results:",
        "date": "10262016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Drugmaker GSK returns to growth in China after torrid time "
    },
    {
        "content": "* Fimbrion - co  and GSK to develop novel antibacterial therapy for urinary tract infections  Source text for Eikon:  Further company coverage:",
        "date": "10252016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Fimbrion  GSK to develop novel antibacterial therapy for UTIs "
    },
    {
        "content": "LONDON GlaxoSmithKline  beat quarterly sales and profit expectations and said it expected even bigger gains in 2016 thanks to a weak pound  which has continued to fall after Britain's vote in June to leave the European Union.",
        "date": "10262016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline beats forecasts as weak pound provides windfall "
    },
    {
        "content": "A divided appeals court on Tuesday rejected British drugmaker GlaxoSmithKline's attempts to revive a patent application for its orally-inhaled influenza drug  Relenza.",
        "date": "10192016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Federal Circuit rejects GSK patent on oral flu drug "
    },
    {
        "content": "* Q3 revenue 7.54 bln pounds vs consensus 7.28 bln   (Adds CEO comment on UK prices  analyst reaction  product details)",
        "date": "10262016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-GlaxoSmithKline beats forecasts as weak pound provides windfall "
    },
    {
        "content": "Oct 26 GlaxoSmithKline CEO Andrew Witty told reporters:",
        "date": "10262016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK CEO says weak pound hasn't impacted company's UK pricing "
    },
    {
        "content": "LONDON  Oct 26 Drugmaker GlaxoSmithKline  said on Wednesday it expected even bigger profit gains in 2016 thanks to a weak pound  which has continued to fall after Britain's vote in June to leave the European Union  as quarterly results beat expectations.",
        "date": "10262016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline enjoys big windfall as pound slides "
    },
    {
        "content": "WASHINGTON GlaxoSmithKline Plc  will pay $20 million to settle civil charges that it masked bribes to foreign officials in China by disguising them as legitimate travel  entertainment and marketing expenses  U.S. regulators said on Friday.",
        "date": "09302016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GlaxoSmithKline to pay $20 million to settle U.S. foreign bribery case "
    },
    {
        "content": "WASHINGTON  Sept 30 GlaxoSmithKline Plc  will pay $20 million to settle civil charges that it masked bribes to foreign officials in China by disguising them as legitimate travel  entertainment and marketing expenses  U.S. regulators said on Friday.",
        "date": "09302016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GlaxoSmithKline to pay $20 mln to settle U.S. foreign bribery case "
    },
    {
        "content": "WASHINGTON  Sept 30 GlaxoSmithKline will pay $20 million to settle civil charges that it masked improper bribes to foreign officials in China on its books by disguising them as legitimate travel  entertainment and marketing expenses  U.S. regulators said Friday.",
        "date": "09302016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline to pay $20 mln to settle foreign bribery related charges "
    },
    {
        "content": "LONDON  Sept 29 GlaxoSmithKline has promoted a former Novartis executive to lead its consumer healthcare business  following the appointment last week of the unit's previous head  Emma Walmsley  as CEO designate of the drugmaker.",
        "date": "09292016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "After CEO move  GSK picks ex-Novartis exec to head consumer unit "
    },
    {
        "content": "* GlaxoSmithKline plc appoints Brian McNamara as CEO of GSK consumer healthcare",
        "date": "09292016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline appoints new consumer healthcare CEO "
    },
    {
        "content": "* Gross proceeds of Aspen transaction are equivalent to £477 million  Source text for Eikon:  Further company coverage:    (Reporting by UK bureau)",
        "date": "09292016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK gets 477 mln stg gross proceeds from Aspen Pharmacare stake sale "
    },
    {
        "content": "* Intends to sell its remaining stake in Aspen Pharmacare Holdings Ltd",
        "date": "09282016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK says to sell remaining stake in Aspen Pharmacare "
    },
    {
        "content": "* GlaxosmithKline Consumer Healthcare has entered into a licence agreement with Israel's Nutritional Growth Solutions (NG Solutions) for Horlicks Growth+  a formula aimed at boosting height and weight in short and thin children aged 3 to 9  NG said on Wednesday.",
        "date": "09282016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK in deal to produce Israeli nutritional growth formula to children "
    },
    {
        "content": "* Says GSK will provide EUR35 million support over a four year period",
        "date": "09282016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK  Oncodesign announce agreement for Oncodesign's Acquisition of GSK's Research Centre in France "
    },
    {
        "content": "* GSK announces regulatory submissions for subcutaneous formulation of Benlysta (Belimumab) for patients with systemic lupus disease",
        "date": "09232016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK files regulatory submissions in U.S. and Europe for lupus drug "
    },
    {
        "content": "LONDON  Sept 20 Emma Walmsley  GlaxoSmithKline's  incoming CEO  breaks the mould as the first woman to lead a top global drugmaker and stands out among Big Pharma bosses as a consumer brands guru rather than a prescription medicines expert.",
        "date": "09202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "NEWSMAKER-Breaking the mould: GSK picks Big Pharma's first female CEO "
    },
    {
        "content": "LONDON  Sept 19 GlaxoSmithKline is cutting the price charged for its pneumococcal vaccine when given to refugees  following complaints about the product's \"exorbitant\" cost by medical charity Medecins Sans Frontieres.",
        "date": "09192016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK cuts vaccine price for refugees  bowing to pressure "
    },
    {
        "content": "* GSK shares slip 0.5 percent   (Adds investor reaction  more on consumer business and dividend)",
        "date": "09202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 3-GlaxoSmithKline names insider Emma Walmsley as new CEO "
    },
    {
        "content": "* Emma Walmsley  currently chief executive officer (CEO) of GSK's consumer healthcare division  is appointed GSK ceo designate",
        "date": "09202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK appoints Emma Walmsley as new CEO "
    },
    {
        "content": "LONDON  Sept 20 GlaxoSmithKline said on Tuesday it had chosen Emma Walmsley  head of consumer healthcare  as its new chief executive  after considering internal and external candidates.",
        "date": "09202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline names consumer head Walmsley new CEO "
    },
    {
        "content": "LONDON  Sept 16 Britain's biggest drugmaker GlaxoSmithKline said it had been forced to shut a factory at Maidenhead west of London due to flooding  potentially causing disruption to the site which produces toothpaste and mouthwash.",
        "date": "09162016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK closes UK factory due to flooding "
    },
    {
        "content": "* Earns $6 million milestone payment from Glaxosmithkline for initiation of clinical development with first in-class PRMT5 inhibitor",
        "date": "09152016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Epizyme earns $6 million from Glaxosmithkline for initiation of clinical development "
    },
    {
        "content": "JOHANNESBURG South Africa's Aspen Pharmacare Holdings  will use its recent acquisitions of GlaxoSmithKline and AstraZeneca product lines to move into China  the firm's chief executive said.",
        "date": "09142016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Aspen Pharmacare moves into China as South Africa sales dip "
    },
    {
        "content": "JOHANNESBURG  Sept 14 South Africa's Aspen Pharmacare Holdings will use its recent acquisitions of GlaxoSmithKline and AstraZeneca product lines to move into China  the firm's chief executive said.",
        "date": "09142016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-Aspen Pharmacare moves into China as South Africa sales dip "
    },
    {
        "content": "LONDON GlaxoSmithKline  is to sell its portfolio of anesthetic drugs to South Africa's Aspen Pharmacare  for up to 280 million pounds ($372 million) as part of a drive by the British drugmaker to focus on core therapy areas.",
        "date": "09122016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK sells anesthetics to Aspen for up to $370 million "
    },
    {
        "content": "LONDON  Sept 12 GlaxoSmithKline is to sell its portfolio of anaesthetic drugs to South Africa's Aspen Pharmacare for up to 280 million pounds ($372 million) as part of a drive by the British drugmaker to focus on core therapy areas.",
        "date": "09122016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK sells anaesthetics to Aspen for up to $370 mln "
    },
    {
        "content": "* Signed an agreement with GSK whereby AGI will acquire a portfolio of anaesthetics globally with exception of certain territories",
        "date": "09122016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Aspen Pharma to buy almost entire of GSK's anaesthetics portfolio "
    },
    {
        "content": "* Highlights positive results from pivotal phase 3 FULFIL study of the closed triple announced by GlaxoSmithKline and Innoviva at ERS international congress",
        "date": "09072016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Theravance Biopharma says positive results received from late stage FULFIL study "
    },
    {
        "content": "* Gsk presents positive results from phase iii fulfil study of closed triple combination therapy ff/umec/vi versus symbicort\u007f turbohaler\u007f in copd at ers international congress",
        "date": "09062016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK presents positive results from phase III FULFIL study "
    },
    {
        "content": "* Announce positive results from copd salford lung study published in nejm and presented at european respiratory congress",
        "date": "09052016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline sees positive results from COPD Salford Lung study "
    },
    {
        "content": "LONDON  Sept 6 An experimental three-in-one inhaled drug from GlaxoSmithKline significantly cut flare-ups in patients with chronic lung disease in a clinical trial  researchers said on Tuesday.",
        "date": "09062016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK's triple drug cuts flare-ups in chronic lung disease "
    },
    {
        "content": "* Announces amendment of strategic agreement signed with GlaxoSmithKline (GSK) on March 19  2015",
        "date": "09012016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-MolMed announces review of strategic agreement with GlaxoSmithKline "
    },
    {
        "content": "* GSK Consumer Healthcare - Approval of flonase allergy relief for over the counter use in Canada",
        "date": "08312016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK Consumer Healthcare announces Flonase allergy relief for OTC use in Canada "
    },
    {
        "content": "* FDA approved flonase sensimist allergy relief as otc treatment for symptoms associated with seasonal and perennial allergies  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Gsk Consumer Healthcare says FDA approved Flonase Sensimist allergy relief as OTC treatment "
    },
    {
        "content": "* Net profit in June quarter last year was 1.56 billion rupees as per Ind-AS; net sales was 10.19 billion rupees    Source text - (http://bit.ly/2amHCiM)     Further company coverage:    (Bengaluru newsroom)",
        "date": "08052016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline Consumer Healthcare June-qtr profit up about 2.9 pct "
    },
    {
        "content": "LONDON GlaxoSmithKline and Google parent Alphabet's life sciences unit are creating a new company focused on fighting diseases by targeting electrical signals in the body  jump-starting a novel field of medicine called bioelectronics.",
        "date": "08012016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK and Google parent forge $715 million bioelectronic medicines firm "
    },
    {
        "content": "* Uses miniaturised implants attached to individual nerves   (Adds interview with executive  further details)",
        "date": "08012016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-GSK and Google parent forge $715 mln bioelectronic medicines firm "
    },
    {
        "content": "LONDON  Aug 1 GlaxoSmithKline said on Monday it had teamed up with Alphabet's life sciences unit to create a new company focused on fighting diseases by targeting electrical signals in the body.",
        "date": "08012016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK creates $715 mln bioelectronics company with Alphabet unit "
    },
    {
        "content": "* Vectura initiates legal proceedings against GlaxoSmithKline Plc (GSK)",
        "date": "07272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Vectura initiates legal proceedings against GSK in the U.S. "
    },
    {
        "content": "LONDON GlaxoSmithKline plans 275 million pounds ($361 million) of new investments at three drug manufacturing sites in Britain  signaling its confidence in the country despite last month's vote to leave the European Union.",
        "date": "07272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline invests $360 million in UK despite Brexit "
    },
    {
        "content": "* Weak pound could boost 2016 earnings by 19 percent   (Adds Q2 earnings  further CEO and analyst comment  latest shares)",
        "date": "07272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 4-GlaxoSmithKline invests $360 mln in UK despite Brexit "
    },
    {
        "content": "* Ceo says board looking at internal and external candidates to be new ceo  decision around end year",
        "date": "07272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK CEO: UK competitive post-Brexit but questions over drug regulation  science "
    },
    {
        "content": "LONDON  July 27 Demand for new medicines helped GlaxoSmithKline grow earnings in the second quarter and the drugmaker is set for big gains in the rest of 2016 thanks to a weak pound  after Britain's vote to leave the European Union.",
        "date": "07272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK outlook brightens as Brexit brings currency windfall "
    },
    {
        "content": "LONDON GlaxoSmithKline has bought global rights to an experimental drug from Johnson & Johnson for up to 175 million pounds ($230 million)  raising its bet on a new generation of biotech medicines for severe asthma.",
        "date": "07272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK chases next biotech asthma drug with $230 million J&J deal "
    },
    {
        "content": "LONDON  July 27 GlaxoSmithKline has bought global rights to an experimental drug from Johnson & Johnson for up to 175 million pounds ($230 million)  raising its bet on a new generation of biotech medicines for severe asthma.",
        "date": "07272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK chases next biotech asthma drug with $230 mln J&J deal "
    },
    {
        "content": "LONDON  July 27 GlaxoSmithKline plans 275 million pounds ($361 million) of new investments at three drug manufacturing sites in Britain  signalling its confidence in the country despite last month's vote to leave the European Union.   (Reporting by Ben Hirschler; Editing by David Holmes)",
        "date": "07272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline invests $360 mln in post-Brexit UK manufacturing "
    },
    {
        "content": "* GSK ships 2016-17 seasonal influenza vaccines for US market",
        "date": "07202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline ships 2016-17 seasonal influenza vaccines for US market "
    },
    {
        "content": "HONG KONG  July 18 Drugmaker GlaxoSmithKline Plc  said on Monday the China Food and Drug Administration (CFDA) has approved its human papillomavirus (HPV) vaccine  Cervarix  for use in the country to help women fight cervical cancer.",
        "date": "07182016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "China approves use of GSK vaccine Cervarix for cervical cancer "
    },
    {
        "content": "Novartis  is happy with the performance of its consumer health joint venture with GlaxoSmithKline   in which the Swiss drugmaker has a minority stake  and is in no rush to exit the collaboration early  its chief executive said.",
        "date": "07192016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Novartis in no rush to sell down stake on GSK consumer venture "
    },
    {
        "content": "* U.S. launch of Dutasteride capsules  0.5 mg  generic version of GlaxoSmithKline's avodart capsules  Source text for Eikon:  Further company coverage:",
        "date": "06242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Mylan launches generic version of GSK's avodart capsules "
    },
    {
        "content": "LONDON  June 23 The GAVI global vaccine alliance has offered funding of up to $27.5 million for pilot tests of GlaxoSmithKline's first-generation malaria vaccine  but only if other organisations promise to match that commitment.",
        "date": "06232016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GAVI alliance offers matched funds for GSK malaria vaccine pilot "
    },
    {
        "content": "* Glaxosmithkline says though the eu referendum result creates uncertainty and potentially complexity ... It does not currently anticipate a material adverse impact on the business  group's results or financial position  Source text for Eikon:  Further company coverage:",
        "date": "06242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline says though the eu referendum result creates uncertainty and potentially complexity ... It does not currently anticipate a material adverse impact on the business  group's results or financial position "
    },
    {
        "content": "* Highlights positive top-line results from pivotal phase 3 fulfil study of closed triple announced by Glaxosmithkline  Innoviva",
        "date": "06212016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Theravance Biopharma highlights positive results from phase 3 fulfil study of closed triple announced by Glaxosmithkline  Innoviva "
    },
    {
        "content": "June 20 Drugmaker GlaxoSmithKline Plc  said its experimental combination therapy for a chronic lung problem met the main goal of a late-stage study  allowing the company to apply for marketing of the drug by the end of 2016.",
        "date": "06202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline says lung drug meets late-stage study goals "
    },
    {
        "content": "LONDON  June 17 Manufacturing problems at a factory in Italy have disrupted production of some GlaxoSmithKline medicines  leading to shortages of a commonly used opioid anaesthetic in Denmark.",
        "date": "06172016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Factory snag hits GSK supply  causing Danish anaesthetic shortage "
    },
    {
        "content": "* Fulfil study shows superiority of closed triple combination therapy ff/umec/vi versus symbicort turbohaler",
        "date": "06202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline says lung drug meets late-stage study goals "
    },
    {
        "content": "June 14 Drugmaker GlaxoSmithKline Plc  said Moncef Slaoui  chairman of its vaccines business  would retire next year.",
        "date": "06142016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline says vaccines business head to retire "
    },
    {
        "content": "* Moncef Slaoui  Chairman  Vaccines  has indicated to board his intention to retire from company in 2017",
        "date": "06142016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline says vaccines chairman Slaoui to retire in 2017 "
    },
    {
        "content": "* New phase III data shows greater treatment response with GSK's Benlysta (Belimumab) versus placebo in patients with highly active SLE  Source text: (http://bit.ly/1t8d1u6) Further company coverage:",
        "date": "06082016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK rheumatoid arthritis  SLE drug meets late stage study goal "
    },
    {
        "content": "WASHINGTON The U.S. Supreme Court on Monday declined to hear GlaxoSmithKline Plc's bid to throw out lawsuits by union health and welfare funds that said the company's misrepresentation of heart-related risks of its diabetes medication Avandia caused them to pay too much for the drug for insured patients.",
        "date": "06062016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Supreme Court rejects GSK bid to throw out racketeering lawsuits "
    },
    {
        "content": "June 6 A Novartis trial of two drugs against an aggressive lung cancer bodes well for broadening their use beyond melanoma  the Swiss drugmaker told the American Society of Clinical Oncology's conference in Chicago on Monday.",
        "date": "06062016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "CORRECTED-Novartis study shows skin cancer combo also works on lungs "
    },
    {
        "content": "WASHINGTON  June 6 The U.S. Supreme Court on Monday declined to hear GlaxoSmithKline Plc's bid to throw out lawsuits by union health and welfare funds that said the company's misrepresentation of heart-related risks of its diabetes medication Avandia caused them to pay too much for the drug for insured patients.",
        "date": "06062016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-U.S. top court rejects GSK bid to throw out racketeering lawsuits "
    },
    {
        "content": "LONDON An HIV drug first approved less than three years ago is being rolled out in Botswana as a core medicine for newly diagnosed patients  following the largest ever tender secured by GlaxoSmithKline's HIV business in Africa.",
        "date": "06032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Botswana gets GSK's modern HIV drug in largest ever Africa deal "
    },
    {
        "content": "WASHINGTON  June 6 The U.S. Supreme Court on Monday declined to hear GlaxoSmithKline Plc's bid to throw out lawsuits by union health and welfare funds that said the company's misrepresentation of heart-related risks of its diabetes medication Avandia caused them to pay too much for the drug for insured patients.",
        "date": "06062016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "U.S. top court rejects GSK bid to throw out racketeering lawsuits "
    },
    {
        "content": "LONDON  June 3 An HIV drug first approved less than three years is to be rolled out in Botswana as a first-line core medicine to treat newly diagnosed patients under a contract agreed between the government and ViiV Healthcare.",
        "date": "06032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK's modern HIV drug to be rolled out in Botswana "
    },
    {
        "content": "LONDON GlaxoSmithKline moved to consolidate its lead in a new class of three-in-one inhaled lung drugs on Thursday with plans to file its product for U.S. approval by the end of 2016  rather than the first half of 2018 as previously expected.",
        "date": "06022016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK seeks lead in triple lung drug market with 2016 filing plan "
    },
    {
        "content": "* Rivals in triple drug space include AstraZeneca  Novartis   (Adds more details on competitive market)",
        "date": "06022016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK seeks lead in triple lung drug market with 2016 filing plan "
    },
    {
        "content": "LONDON  June 2 GlaxoSmithKline said on Thursday it now expects to file its new three-in-one inhaled lung drug for U.S. approval by the end of 2016  rather than the first half of 2018 as previously expected  in a boost for its pivotal respiratory business.",
        "date": "06022016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK to file 3-in-1 lung drug for U.S. approval this year "
    },
    {
        "content": "* Regulatory update on us filing plans for closed triple combination therapy ff/umec/vi in patients with copd",
        "date": "06022016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithkline accelerates filing of COPD triple-therapy drug "
    },
    {
        "content": "* Downgrade reflects fitch's view of a weakening business risk profile for GlaxoSmithKline PLC",
        "date": "05272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Fitch downgrades GSK to 'A' with stable outlook "
    },
    {
        "content": "May 26 Ionis Pharmaceuticals Inc's  shares plunged 40 percent on Thursday  wiping out over $900 million from its market value  after the company said GlaxoSmithKline Plc had scrapped plans to test their heart drug in a late-stage trial.",
        "date": "05262016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Ionis shares slump 40 pct as GSK scraps heart drug trial plans "
    },
    {
        "content": "* Key efficacy endpoint for analysis was survival. All 18 patients were alive after a median follow-up of 6.9 years at data cut on 8th may 2014",
        "date": "05252016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK says gene therapy for immune disorder meets main goal "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 27 (Fitch) Fitch Ratings  London  27 May 2016: Fitch Ratings has  downgraded UK-based pharmaceuticals company GlaxoSmithKline PLC's (GSK)  Long-Term Issuer Default Rating (IDR) and senior unsecured rating to 'A' from  'A+'. The Outlook is Stable.  Fitch has also downgraded the senior unsecured rating for the debt issued under  GlaxoSmithKline Capital PLC to 'A' from 'A+' and has assigned a senior unsecured  rating of 'A' to ",
        "date": "05272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Fitch Downgrades GSK to 'A'  Outlook Stable "
    },
    {
        "content": "May 26 Ionis Pharmaceuticals Inc's  shares plunged 40 percent on Thursday  wiping out over $900 million from its market value  after the company said GlaxoSmithKline Plc had scrapped plans to test their heart drug in a late-stage trial.",
        "date": "05262016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-Ionis shares plummet as GSK scraps heart drug trial plans "
    },
    {
        "content": "LONDON  May 27 The world's first life-saving gene therapy for children  developed by GlaxoSmithKline  and Italian scientists  was approved for sale in Europe on Friday  in a step forward for the pioneering technology to fix faulty genes.",
        "date": "05272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK gets EU approval for first gene therapy for children "
    },
    {
        "content": "LONDON  May 24 GlaxoSmithKline's new inhaled medicine Breo proved significantly better than standard care in a large British study that tested it in everyday use  providing a fillip for the product after the failure of another big trial in 2015.",
        "date": "05242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK lung drug succeeds in big UK study  after earlier miss "
    },
    {
        "content": "ZURICH With seven departures in the space of five months  Novartis's  top management is in upheaval just as CEO Joe Jimenez tries to tackle a list of challenges that have seen the drug firm's share price fall 25 percent since July.",
        "date": "05232016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Novartis executive exodus complicates drugmaker's rebuilding job "
    },
    {
        "content": "* 8.4 pct reduction in exacerbations vs standard care   (Adds comment from GSK executive and analyst)",
        "date": "05242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK lung drug succeeds in big UK study  after earlier miss "
    },
    {
        "content": "* Dr Vivienne Cox  CBE  has been appointed to board of company as a non-executive director with effect from 1 July 2016  Source text for Eikon:  Further company coverage:",
        "date": "05272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline appoints Vivienne Cox to board "
    },
    {
        "content": "SHANGHAI/LONDON Chinese health authorities announced price cuts of up to two-thirds for three drugs on Friday in the latest move to reduce the cost of healthcare for patients in the world's second-biggest economy.",
        "date": "05202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Drugmakers eye volume growth as China cuts prices by up to 67 percent "
    },
    {
        "content": "* Co and Innoviva announced positive headline results from innovative salford lung study in chronic obstructive pulmonary disease",
        "date": "05242016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline and Innoviva report positive headline results in Salford Lung study "
    },
    {
        "content": "SHANGHAI/LONDON  May 20 Chinese health authorities announced price cuts of up to two-thirds for three expensive drugs on Friday in the latest move to reduce the cost of healthcare for patients in the world's second-biggest economy.",
        "date": "05202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "China slashes GSK  AstraZeneca drug prices in cost-cutting drive "
    },
    {
        "content": "* GSK's Bexsero achieves primary and secondary endpoints with reduced 3-dose schedule (2+1) in safety and immunogenicity study in infants and children",
        "date": "05132016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK says its meningitis vaccine achieves study goals "
    },
    {
        "content": "LONDON A break-up of GlaxoSmithKline  is not something that is being considered \"at all\" at present  the chairman of Britain's biggest drugmaker said on Thursday.",
        "date": "05052016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK chairman rules out near-term break-up of drugmaker "
    },
    {
        "content": "LONDON Improving margins and growing demand for new drugs lifted GlaxoSmithKline's  underlying earnings a better-than-expected 14 percent in the first quarter  keeping it on course to achieve a promised return to growth in 2016.",
        "date": "04272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GlaxoSmithKline rebound gathering pace  says outgoing CEO "
    },
    {
        "content": "LONDON  April 27 It has been one of the pharmaceutical industry's most closely watched experiments: does ending payments to doctors undermine drug sales?",
        "date": "04272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK finds axing doctor payments needn't torpedo sales "
    },
    {
        "content": "* Shares up 2.7 pct at 1230 GMT   (Adds more on CEO succession  analyst comment)",
        "date": "04272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-GlaxoSmithKline rebound gathering pace  says outgoing CEO "
    },
    {
        "content": "April 27 GlaxoSmithKline Chief Executive Andrew Witty told reporters:",
        "date": "04272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK CEO expects successor to be named towards end of 2016 "
    },
    {
        "content": "LONDON  April 27 Improving margins in consumer health and growing demand for new drugs helped lift GlaxoSmithKline's underlying earnings a better-than-expected 14 percent in the first quarter  keeping it on course to achieve a promised return to growth in 2016.",
        "date": "04272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Better margins and new drugs keep GlaxoSmithKline on track "
    },
    {
        "content": "New Jersey-based generic drugmaker Amneal Pharmaceuticals LLC has sued GlaxoSmithKline in federal court in Delaware  asking the court to find that its proposed generic version of GSK's epilepsy drug Lamictal XR would not infringe two GSK patents.",
        "date": "04272016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Amneal sues GlaxoSmithKline over planned generic epilepsy drug "
    },
    {
        "content": "LONDON  April 1 The world's first life-saving gene therapy for children  developed by Italian scientists and GlaxoSmithKline  has been recommended for approval in Europe  boosting the pioneering technology to fix faulty genes.",
        "date": "04012016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Europe gives green light to first gene therapy for children "
    },
    {
        "content": "LONDON GlaxoSmithKline is to adopt a graduated approach to patenting its medicines  depending on the wealth of different countries  in order to make drugs more affordable in the developing world.",
        "date": "03312016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GlaxoSmithKline promises reduced drug patents to help world's poor "
    },
    {
        "content": "* GSK plans to pool patents on next-generation cancer drugs   (Adds reaction  CEO comment on profits  country details)",
        "date": "03312016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GlaxoSmithKline promises reduced drug patents to help world's poor "
    },
    {
        "content": "* Receives marketing authorisation for nucala \u007f (mepolizumab) in Japan",
        "date": "03292016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Japan approves GlaxoSmithkline's asthma drug Nucala "
    },
    {
        "content": "LONDON GlaxoSmithKline said on Thursday its Chief Executive Andrew Witty would retire in 12 months after leading the British drugmaker through a series of changes since 2008 that have failed to ignite the share price.",
        "date": "03172016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GlaxoSmithKline's CEO Witty to bow out in March 2017 "
    },
    {
        "content": "* Witty says departure not linked to break-up calls   (Adds CEO interview  shareholder comment  graphic)",
        "date": "03172016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 3-GlaxoSmithKline's CEO Witty to bow out in March 2017 "
    },
    {
        "content": "LONDON Fund manager Neil Woodford  a top investor in GlaxoSmithKline and a critic of the drugmaker's current structure  said on Thursday he wanted to see an outsider replace Andrew Witty as the group's chief executive.",
        "date": "03172016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Investor Woodford calls for outsider to head GlaxoSmithKline "
    },
    {
        "content": "* Sir Deryck maughan  Stephanie Burns  Daniel Podolsky and Hans Wijers will not stand for re-election to board at GSK's annual general meeting on 5 May 2016  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "03172016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK says four non-executive directors not to seek re-election at AGM "
    },
    {
        "content": "* \u007fAdvair Diskus achieves primary endpoint in LABA safety study of children aged 4-11 years with asthma\u007f  Source text for Eikon:  Further company coverage:    (Reporting by UK bureau)",
        "date": "03172016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK's Advair achieves primary endpoint in safety study of children "
    },
    {
        "content": "LONDON  March 17 GlaxoSmithKline said its Chief Executive Andrew Witty would retire in 2017 having held the position since 2008  prompting the British pharmaceutical company to start looking for his successor.",
        "date": "03172016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline says CEO Witty to retire next year "
    },
    {
        "content": "* \u007fadvair had a safety profile comparable to  fluticasone propionate (fp)  including no asthma-related deaths in either arm\u007f",
        "date": "03072016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK says \u007fAdvair had safety profile comparable to fluticasone propionate in study "
    },
    {
        "content": "March 5 GlaxoSmithKline Plc said on Saturday its asthma drug  Nucala  which is already approved in the United States and Europe  showed a similar safety profile in a long-term study compared with previous studies.",
        "date": "03052016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK asthma drug Nucala's long-term study supports safety profile "
    },
    {
        "content": "* New long-term organ damage analysis published for GSK's Benlysta\u007f (belimumab)",
        "date": "03032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK publishes long-term organ damage analysis for Benlysta "
    },
    {
        "content": "* GSK dumped U.S. approval bid for Basilea skin drug in January",
        "date": "02292016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Swiss Basilea says profits still 2-3 years away "
    },
    {
        "content": "LONDON  Feb 29 GlaxoSmithKline's  chairman is starting the process of seeking a new chief executive to succeed Andrew Witty  although a handover at the top of Britain's biggest drugmaker is not expected before 2017.",
        "date": "02292016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline starts hunt for successor to CEO Witty "
    },
    {
        "content": "* \u007fCompletion of both transactions follows antitrust approval by relevant regulatory authorities in US  with integration process beginning immediately\u007f",
        "date": "02222016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK's ViiV completes deal to buy Bristol-Myers Squibb's R&D HIV assets\u007f "
    },
    {
        "content": "* \u007fViiV Healthcare announces phase II study results for first two drug  long-acting injectable regimen for HIV-1 treatment\u007f",
        "date": "02232016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK's ViiV announces mid-stage results for HIV injection drugs "
    },
    {
        "content": "* Shares fall 10 pct to nearly 3-year low   (Adds analysts comments  conference call comments  updates shares)",
        "date": "02182016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 3-Perrigo's adjusted profit misses for first time in 5 qtrs "
    },
    {
        "content": "LONDON Britain's competition watchdog has fined GlaxoSmithKline  37.6 million pounds ($54.4 million) for market abuse in striking deals to delay the launch of cheap generic copies of its former blockbuster antidepressant Seroxat.",
        "date": "02122016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UK watchdog fines GSK $54 million over 'pay-for-delay' drug deals "
    },
    {
        "content": "LONDON  Feb 12 Britain's competition body said on Friday it had fined GlaxoSmithKline 37.6 million pounds ($54.42 million) for market abuse in striking deals to delay the launch of generic copies of its antidepressant Seroxat.",
        "date": "02122016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UK watchdog fines GSK $54 mln over 'pay-for-delay' drug deals "
    },
    {
        "content": "* Signs new research and development collaboration with GlaxoSmithKline for EB66 cell line\u007f",
        "date": "02082016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Valneva signs new research and development collaboration with GlaxoSmithKline "
    },
    {
        "content": "NEW YORK  Feb 8 Pernix Therapeutics Holdings Inc   a U.S. specialty pharmaceutical company  is exploring strategic alternatives  including a potential sale  people familiar with the matter said on Monday.",
        "date": "02082016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-U.S. drugmaker Pernix Therapeutics explores sale -sources "
    },
    {
        "content": "* Announces U.S. regulatory submission seeking expanded indication for flulaval quadrivalent (influenza vaccine) for infants 6 mos+\u007f",
        "date": "02022016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK says seeking U.S. approval for expanded indication for influenza vaccine\u007f "
    },
    {
        "content": "LONDON Index Ventures  an early investor in technology hits like Skype and Dropbox  is spinning off its biotech portfolio into a new $1 billion (695 million pounds) business  with backing from drug giants GlaxoSmithKline  and Johnson & Johnson .",
        "date": "02022016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK and J&J back $1 billion biotech spin-off from Index Ventures "
    },
    {
        "content": "LONDON  Feb 3 GlaxoSmithKline said on Wednesday it would not be pushed into an early spin-off or sale of its consumer health business  despite speculation the unit could be a target for the likes of Reckitt Benckiser or Procter & Gamble.",
        "date": "02032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK refuses to be bounced into early consumer unit spin-off "
    },
    {
        "content": "LONDON GlaxoSmithKline  said on Wednesday the chance of it spinning off or selling its consumer health business before 2018 was \"extraordinarily low\"  arguing the group's strategy was delivering  helped by rising sales of new medicines.",
        "date": "02032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK dismisses near-term split as new drugs offset falling Advair "
    },
    {
        "content": "* Q4 sales 6.29 bln stg vs consensus 6.25 bln   (Adds more on options for consumer health business)",
        "date": "02032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 3-GSK dismisses near-term split as new drugs offset falling Advair "
    },
    {
        "content": " ",
        "date": "02032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "New drugs help GSK offset drag of flagging Advair sales "
    },
    {
        "content": "LONDON  Feb 3 Growing demand for new drugs helped GlaxoSmithKline beat forecasts for fourth-quarter earnings by a small margin on Wednesday  offsetting a continued slide in sales of its older Advair respiratory medicine.",
        "date": "02032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "RPT-New drugs help GSK offset drag of flagging Advair sales "
    },
    {
        "content": "* Have also published our latest estimate for the rate of return in research and development  which has been maintained at 13 pct",
        "date": "02032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline says latest estimate for R&D rate of return of 13 pct "
    },
    {
        "content": "* Q4 revenue \u007f6 286\u007f million stg (thomson reuters consensus 6 256 million stg)",
        "date": "02032016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK Q4 core EPS beats estimate "
    },
    {
        "content": "GlaxoSmithKline Plc is concluding feasibility studies evaluating whether its vaccine technology is suitable for the Zika virus  which has been linked to brain damage in thousands of babies in Brazil  a spokeswoman told Reuters.",
        "date": "01252016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Glaxo evaluating possibility of using vaccine technology for Zika "
    },
    {
        "content": "Jan 25 GlaxoSmithKline Plc  is concluding feasibility studies evaluating whether its vaccine technology is suitable for the Zika virus  which has been linked to brain damage in thousands of babies in Brazil  a spokeswoman told Reuters.",
        "date": "01252016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-Glaxo evaluating possibility of using vaccine technology for Zika "
    },
    {
        "content": "Jan 25 GlaxoSmithKline Plc  is concluding \"feasibility\" studies to see if its vaccine technology might be suitable for the Zika virus  a company spokeswoman told Reuters.",
        "date": "01252016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK evaluating possibility of using vaccine technology for Zika "
    },
    {
        "content": "* \u007fGSK informs Basilea that it has elected not to continue its U.S. alitretinoin program\u007f",
        "date": "01212016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Basilea says GSK drops U.S. alitretinoin program\u007f "
    },
    {
        "content": "Pharmaceutical group GlaxoSmithKline Plc  is said to be in discussions with chipmaker Qualcomm Inc  to form a joint venture as GSK looks for ways to develop medical technology  Bloomberg reported on Wednesday.",
        "date": "01202016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK said to be in talks with Qualcomm to form JV: Bloomberg "
    },
    {
        "content": "Five people  including two former GlaxoSmithKline  researchers  were charged with a scheme to steal trade secrets from the British drugmaker for potential sale in China  according to indictments announced by the U.S. Attorney's Office in Philadelphia on Wednesday.",
        "date": "01212016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Five charged in U.S. with stealing secrets from GlaxoSmithKline "
    },
    {
        "content": "Jan 20 Five people  including two former GlaxoSmithKline researchers  were charged with a scheme to steal trade secrets from the British drugmaker for potential sale in China  according to indictments announced by the U.S. Attorney's Office in Philadelphia on Wednesday.",
        "date": "01212016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "CORRECTED-UPDATE 1-Five charged in U.S. with stealing secrets from GlaxoSmithKline "
    },
    {
        "content": "Jan 20 Five people  including two scientists who did research for GlaxoSmithKline  were charged with a scheme to steal trade secrets from the British drugmaker for potential sale in China  according to indictments announced by the U.S. Attorney's Office in Philadelphia on Wednesday.",
        "date": "01212016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "CORRECTED-Five charged in U.S. with stealing secrets from GlaxoSmithKline "
    },
    {
        "content": "DAVOS  Switzerland GlaxoSmithKline's chief executive  under pressure from some investors to break up the group  said on Thursday the drugmaker's large consumer healthcare unit had the potential to be a standalone unit at some stage.",
        "date": "01212016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK chief reiterates standalone consumer unit is an option "
    },
    {
        "content": "* \u007fKuehne und Nagel and GlaxoSmithKline sign long term global logistics partnership contract\u007f  Source text  - http://bit.ly/1JI6Nby Further company coverage:    (Gdynia Newsroom)",
        "date": "01122016",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Kuehne und Nagel and GlaxoSmithKline sign logistics contract \u007f "
    },
    {
        "content": "* \u007fJesse Goodman has been appointed to board of company as a non-executive director and scientific and medical expert\u007f  Source text for Eikon:  Further company coverage:",
        "date": "12232015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK appoints Jesse Goodman as non-executive director "
    },
    {
        "content": "Dec 21 An independent nonprofit organization that evaluates clinical and cost effectiveness of new medicines found the price of GlaxoSmithKline's new drug for severe asthma should be as much as 76 percent lower to justify its value  according to the group's latest draft report.",
        "date": "12212015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Independent group says new Glaxo asthma drug far too expensive "
    },
    {
        "content": "LONDON Pharmaceutical group GlaxoSmithKline said its majority-owned HIV business would buy drugs at different stages of development from U.S. rival Bristol-Myers Squibb for an initial $350 million.",
        "date": "12182015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK to buy HIV drugs from Bristol-Myers Squibb for initial $350 million "
    },
    {
        "content": "LONDON  Dec 18 Pharmaceutical group GlaxoSmithKline said its majority-owned HIV business would buy drugs at different stages of development from U.S. rival Bristol-Myers Squibb for an initial $350 million.",
        "date": "12182015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK to buy HIV drugs from Bristol-Myers Squibb for initial $350 mln "
    },
    {
        "content": "* \u007fComic Relief and GSK form five-year partnership to fight malaria and strengthen health systems\u007f\u007f",
        "date": "12152015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK says signs five-year partnership with Comic Relief to fight malaria "
    },
    {
        "content": "* \u007fThere were no unexpected safety findings relative to known effects of anti-il-6 inhibitors\u007f",
        "date": "12162015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK receives positive results from sirukumab phase III programme "
    },
    {
        "content": "LONDON  Dec 18 British pharmaceutical company GlaxoSmithKline said it would buy HIV drugs at different stages of development from U.S. rival Bristol-Myers Squibb  in a deal which would boost its ViiV Healthcare unit.",
        "date": "12182015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK to buy HIV drugs from Bristol-Myers Squibb "
    },
    {
        "content": "* Futures up: Dow 119 pts  S&P 18 pts  Nasdaq 35.5 pts   (Adds details  comments  updates prices)",
        "date": "12152015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "US STOCKS-Indexes set to open higher as oil recovers; Fed meets "
    },
    {
        "content": "Dec 15 Britain's FTSE 100 futures were up 0.94 percent by 0750 GMT ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "12152015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Dec 15 "
    },
    {
        "content": "LONDON  Dec 15 European equity futures rose on Tuesday  pointing to a stabilisation for the region's stock markets after a slump in the previous session which saw European shares fall to their lowest level in two-and-a-half months.",
        "date": "12152015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "European Factors to Watch-Equity futures rise "
    },
    {
        "content": "Dec 14 Amgen Inc on Monday said it had reached a deal with British drugmaker GlaxoSmithKline to reacquire the sales rights to three of its products in 48 countries  including Australia as well as markets in Asia  South America and Europe.",
        "date": "12142015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Amgen reacquires rights to three drugs from Glaxo in 48 countries "
    },
    {
        "content": "Dec 15 Britain's FTSE 100 index is seen opening up 68 points  or 1.2 percent  on Tuesday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index was down 1.3 percent at 5 874.06 at its close  its eight straight session of losses  pulled lower by a drop in oil and mining shares as commodity prices continued to fall.      * STANDARD CHARTERED: Standard Chartered has axed at least half a dozen oil and gas ",
        "date": "12152015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UK Stocks-Factors to watch on Dec 15 "
    },
    {
        "content": "LONDON  Dec 15 European stocks were seen opening higher on Tuesday  with markets expected to stabilise after a slump in the previous session which saw European shares fall to their lowest level in two-and-a-half months.",
        "date": "12152015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "European Factors to Watch-Shares seen rising at open "
    },
    {
        "content": "* \u007fVindi Banga  senior independent director designate and independent non-executive director  has been appointed a member of audit & risk  nominations and remuneration committees",
        "date": "12102015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK says \u007fVindi Banga appointed to audit & risk  nominations and remuneration committees "
    },
    {
        "content": "* Receives European marketing authorisation for Nucala (mepolizumab) in 31 countries",
        "date": "12022015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline says receives EC's marketing authorisation for Nucala "
    },
    {
        "content": "SHANGHAI  Nov 29 China  already a global powerhouse in high-tech areas from solar panels to bullet trains  is turning its industrial might to the challenge of making more of its own drugs for a vast and ageing population.",
        "date": "11292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Beijing aims to refill medicine chest with \"Made in China\" drugs "
    },
    {
        "content": "SHANGHAI GlaxoSmithKline Plc  has cut 40 percent of its sales reps in China and axed some units as it eyes a return to growth in 2016  after sales plunged during a bribery scandal that landed it with a record $490 million fine in 2014. | Video ",
        "date": "11262015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK in China: escaping the shadow of a scandal "
    },
    {
        "content": "Nov 20 Novartis AG  said on Friday it received the U.S. Food and Drug Administration's regular approval for a drug combination to treat an aggressive form of skin cancer.",
        "date": "11202015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Novartis gets FDA approval for skin cancer drug combination "
    },
    {
        "content": "* Announces start of phase III study of sirukumab in giant cell arteritis  Further company coverage:",
        "date": "11252015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline announces start of late-stage study of arteritis drug "
    },
    {
        "content": "* NIH launches initiative to develop long-acting HIV treatment and prevention tools in partnership with GlaxoSmithKline",
        "date": "11182015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-NIH partners with GSK on long-acting HIV treatment and prevention "
    },
    {
        "content": "WASHINGTON GlaxoSmithKline Plc won U.S. regulatory approval for its drug Nucala to treat severe asthma  the Food and Drug Administration said on Wednesday.",
        "date": "11042015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "FDA approves GSK's drug Nucala for severe asthma "
    },
    {
        "content": "WASHINGTON  Nov 4 GlaxoSmithKline Plc  won U.S. regulatory approval for its drug Nucala to treat severe asthma  the Food and Drug Administration said on Wednesday.",
        "date": "11042015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-FDA approves GSK's drug Nucala for severe asthma "
    },
    {
        "content": "GlaxoSmithKline  Roche and Sanofi all hold investor days this week. Below are three new drugs to watch from each company  with consensus annual sales in 2020  according to Thomson Reuters Cortellis.",
        "date": "11012015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Factbox: Drugs to watch at Roche  Sanofi and GSK "
    },
    {
        "content": "LONDON GlaxoSmithKline could file up to 20 new drugs for regulatory approval before 2020 as it seeks to revitalize a portfolio hit by falling sales of best-selling inhaled lung treatment Advair  the company said on Tuesday.",
        "date": "11032015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK plan to file up to 20 new drugs by 2020 underwhelms market "
    },
    {
        "content": "LONDON  Nov 1 Three of Europe's top drugmakers - GlaxoSmithKline  Roche and Sanofi - face health checks this week at high-profile presentations designed to show they can overcome looming market threats.",
        "date": "11012015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Drugged up: GSK  Roche and Sanofi to set out their stalls "
    },
    {
        "content": "* Shares fall 1.5 pct   (Adds further comment from CEO and analysts  closing shares)",
        "date": "11032015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 3-GSK plan to file up to 20 new drugs by 2020 underwhelms market "
    },
    {
        "content": "* Pfizer and Allergan decline to comment   (Adds Allergan shares up in premarket trade)",
        "date": "10292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 6-Pfizer said to be in talks with Allergan to forge $330 bln drugs giant "
    },
    {
        "content": "LONDON GlaxoSmithKline  reported better-than-expected earnings on Wednesday  helped by strong demand for HIV drugs and flu vaccines  which offset a further slide in sales of respiratory medicine  sending its shares 3 percent higher.",
        "date": "10282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GlaxoSmithKline beats forecasts as HIV drugs  flu vaccines shine "
    },
    {
        "content": "A long-acting two-drug injection given once every eight weeks worked as well as three daily pills in suppressing HIV  the virus that causes AIDS  according to a clinical trial backed by Johnson & Johnson and GlaxoSmithKline.",
        "date": "11032015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Bi-monthly injection blocks HIV in study from J&J and GSK "
    },
    {
        "content": "* Q3 core EPS 23.0 pence vs consensus 19.3p; shares up 3 pct   (Adds further CEO and analyst comments)",
        "date": "10282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-GlaxoSmithKline beats forecasts as HIV drugs  flu vaccines shine "
    },
    {
        "content": "Nov 3 A cocktail of Johnson & Johnson's  HIV compound and an experimental drug from ViiV Healthcare met the main goal of a mid-stage study  becoming the second combination to do so.",
        "date": "11032015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Johnson & Johnson HIV combination succeeds in mid-stage study "
    },
    {
        "content": "Oct 28 GlaxoSmithKline Plc CEO Andrew Witty told reporters:",
        "date": "10282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK CEO still expects respiratory to return to growth in 2016 "
    },
    {
        "content": "* Calls out Nucala for severe asthma  Shingrix for shingles as exciting products  along with daprodustat in anaemia and drugs for viral diseases",
        "date": "11032015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK CEO sees Nucala  Shingrix  anaemia pill  antivirals as pipeline highlights "
    },
    {
        "content": "LONDON  Oct 28 GlaxoSmithKline reported better-than-expected quarterly earnings on Wednesday  helped by strong demand for HIV drugs and flu vaccines  which offset a continued slide in sales of respiratory medicine.",
        "date": "10282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "HIV drugs and flu vaccines help GlaxoSmithKline beat forecasts "
    },
    {
        "content": "* Announces that GlaxoSmithKline Plc (GSK) has exercised an option to obtain a non-exclusive licence for two rare orphan disease indications under Oxford BioMedica's LentiVector platform technology patents",
        "date": "10282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Oxford BioMedica says GSK exercises option on co's LentiVector patents "
    },
    {
        "content": "LONDON  Nov 3 GlaxoSmithKline's chief executive declined to comment on Tuesday on a report that Pfizer  had approached the British drugmaker about a possible takeover in recent weeks but was rebuffed.",
        "date": "11032015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK boss silent on report drugmaker rebuffed Pfizer "
    },
    {
        "content": "LONDON An experimental heart drug from GlaxoSmithKline failed to work as hoped in the first part of a large clinical trial  the company said on Tuesday  dealing a blow to its pipeline of new medicines.",
        "date": "10272015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK heart drug flops in study  shingles vaccine on track "
    },
    {
        "content": "** Simon Gergel  CIO UK equities at Allianz Global Investors  has been topping up holdings in GlaxoSmithKline  after dramatic reshape of its portfolio",
        "date": "10262015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BUZZ-View from the buyside: AllianzGI buys more GlaxoSmithKline "
    },
    {
        "content": "* Shingrix 90 pct effective in over-70s in latest trial   (Adds detail on both products)",
        "date": "10272015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK heart drug flops in study  shingles vaccine on track "
    },
    {
        "content": "LONDON  Oct 27 An experimental heart drug from GlaxoSmithKline called losmapimod failed to work as hoped in the first part of a large clinical trial  the company said on Tuesday  dealing a blow to its pipeline of new medicines.",
        "date": "10272015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK heart drug disappoints in study  shingles vaccine on track "
    },
    {
        "content": "* GSK receives CHMP positive opinion to expand indication for volibris\u007f in pulmonary arterial hypertension",
        "date": "10232015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK receives CHMP positive opinion to expand indication for Volibris "
    },
    {
        "content": "* GSK profiles innovative research and development portfolio to investors",
        "date": "11032015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline aims to file up to 20 new drugs for approval by 2020 "
    },
    {
        "content": "* Positive results from two head-to-head studies directly comparing efficacy and safety of Incruse \u007f Ellipta \u007f",
        "date": "10202015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline reports positive data for Incruse Ellipta comparisons "
    },
    {
        "content": "* Says interim review of data from part a of losmapimod cardiovascular study did not indicate efficacy against primary endpoint",
        "date": "10272015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK says losmapimod cardiovascular study fails to show required efficacy "
    },
    {
        "content": "LONDON  Oct 22 British pharmaceutical company GlaxoSmithKline will profile its drug development pipeline  including a new class of antibiotic  on Nov. 3  its chief executive said on Thursday.",
        "date": "10222015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK to profile new class of antibiotic at Nov. 3 investor day "
    },
    {
        "content": "LONDON  Oct 21 Scientists have found a genetic explanation for why the world's first malaria vaccine is not very effective in protecting some African children against the deadly mosquito-borne disease.",
        "date": "10212015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Genetics help explain poor showing for GSK malaria vaccine "
    },
    {
        "content": "LONDON  Nov 3 GlaxoSmithKline said on Tuesday it had the potential to file up to 20 new drugs for approval before 2020 as it seeks to revitalise a portfolio hit by falling sales of best-selling inhaled lung treatment Advair.",
        "date": "11032015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK aims to file up to 20 new drugs for approval by 2020 "
    },
    {
        "content": "* GSK's candidate shingles vaccine demonstrates 90 pct efficacy against shingles in people 70 years of age and over",
        "date": "10272015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK's shingles vaccine candidate shows 90 pct efficacy "
    },
    {
        "content": "* GSK's Advair Diskus achieves primary endpoint in LABA safety study of patients with asthma",
        "date": "10272015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK asthma drug meets main goal in safety study "
    },
    {
        "content": "LONDON  Oct 21 GlaxoSmithKline's chief executive is joining a new panel to promote trade between Britain and China  just over a year after the drugmaker was handed a record fine of nearly $500 million for bribing Chinese doctors.",
        "date": "10212015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK joins China trade push as UK trumpets healthcare deals "
    },
    {
        "content": "ZURICH  Oct 27 Novartis reported third-quarter core net income fell  missing analyst forecasts as the cancer portfolio acquired from GlaxoSmithKline and the Swiss company's newer products failed to offset continuing weakness at its eye-care business Alcon.",
        "date": "10272015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Novartis Q3 income misses forecast as Alcon  dollar hit results "
    },
    {
        "content": "* Has submitted a regulatory application to European Medicines Agency (EMA) for its antiseptic chlorhexidine gel",
        "date": "10122015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK submits application to EMA for its antiseptic chlorhexidine gel "
    },
    {
        "content": "A federal judicial panel has created new multidistrict litigation for products liability cases over power morcellators made by Johnson & Johnson's Ethicon Inc  GlaxoSmithKline's anti-nausea medication Zofran and Honda CR-Vs  while a second bid to consolidate cases over Eli Lilly's Cymbalta again fell short.",
        "date": "10162015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "MDL Watch: Consolidation granted for Ethicon morcellators  GSK's Zofran  Honda cars "
    },
    {
        "content": "LONDON GlaxoSmithKline may get a green light from European regulators as early as this week for a new biotech medicine to treat severe asthma  boosting prospects for its struggling respiratory business.",
        "date": "09232015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK may get EU green light for new biotech asthma drug this week "
    },
    {
        "content": "Drugmaker GlaxoSmithKline has won summary judgment in an antitrust class action accusing it of colluding with generic rivals to delay off-brand versions of its Wellbutrin XL antidepressant.",
        "date": "09242015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GlaxoSmithKline defeats Wellbutrin pay-for-delay lawsuit "
    },
    {
        "content": "GlaxoSmithKline Plc said the European health regulator had recommended an approval for its injectable drug to treat asthma patients who don't respond well to traditional inhalers.",
        "date": "09242015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "EU regulator backs approval for GSK injectable asthma drug "
    },
    {
        "content": "Sept 24 GlaxoSmithKline Plc  said the European health regulator had recommended an approval for its injectable drug to treat asthma patients who don't respond well to traditional inhalers.",
        "date": "09242015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-EU regulator backs approval for GSK injectable asthma drug "
    },
    {
        "content": "Sept 24 GlaxoSmithKline Plc  said the European health regulator had recommended approving its injectable drug to treat asthma patients who don't respond well to traditional inhalers.",
        "date": "09242015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "European regulator recommends approving GSK injectable asthma drug "
    },
    {
        "content": "* Receives positive CHMP opinion in Europe for novel anti-IL5 biological nucala for treatment of patients with severe refractory eosinophilic asthma",
        "date": "09242015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK gets European regulators approval for biotech asthma drug "
    },
    {
        "content": "* This decision follows results from an additional global phase 3 efficacy and safety study.",
        "date": "09242015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK and Theravance to file Relvar Ellipta for COPD in Japan "
    },
    {
        "content": "GlaxoSmithKline's inhaled medicine Breo failed to prolong life in patients with chronic respiratory disease in a high-stakes clinical trial of 16 500 people  torpedoing hopes of a sales boost for the drug.",
        "date": "09092015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GlaxoSmithKline lung drug fails to extend life in huge study "
    },
    {
        "content": "* GSK shares down 1.5 pct; partner Theravance tumbles 15 pct   (Adds further reaction  details on drug sales)",
        "date": "09092015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 3-GlaxoSmithKline lung drug fails to extend life in huge study "
    },
    {
        "content": "Sept 8 GlaxoSmithKline Plc  and its partner Theravance Inc on Tuesday said their inhaled medicine Breo failed in a huge  high-stakes clinical trial to prolong life of patients with chronic pulmonary respiratory disease.",
        "date": "09082015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Glaxo  Theravance Breo lung drug fails to extend life in huge study "
    },
    {
        "content": "LONDON  Sept 9 European shares got a boost from a rally in Ryanair shares on Wednesday  which hit an all-time high after the airline lifted its full-year profit forecast by 25 percent.",
        "date": "09092015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "European shares boosted by Ryanair after profit forecast hike "
    },
    {
        "content": "Sept 8 GlaxoSmithKline Plc  and its partner Theravance Inc on Tuesday said their inhaled medicine Breo failed to prolong life of patients with chronic respiratory disease in a high-stakes clinical trial of 16 500 people.",
        "date": "09082015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-Glaxo  Theravance Breo lung drug fails to extend life in huge study "
    },
    {
        "content": "* Says starts build of its largest Indian tablet manufacturing pharmaceutical factory in Vemgal  Karnataka",
        "date": "09082015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK starts work on new 100 mln pounds Indian pharmaceutical factory "
    },
    {
        "content": "BRUSSELS  Aug 19 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08212015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "EU mergers and takeovers (Aug 21) "
    },
    {
        "content": "BRUSSELS  Aug 21 The European Commission cleared on Friday U.S. drugmaker Perrigo's acquisition of certain assets from Britain's GSK.",
        "date": "08212015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "EU Commission clears Perrigo to buy GSK units "
    },
    {
        "content": "BRUSSELS  Aug 18 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08182015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "EU mergers and takeovers (Aug 18) "
    },
    {
        "content": "ZURICH Novartis has agreed to buy all remaining rights to Ofatumumab from Britain's GlaxoSmithKline for up to $1 billion  boosting the Swiss drugmaker's stable of multiple sclerosis (MS) treatments.",
        "date": "08212015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Novartis buys remaining rights to GSK treatment for up to $1 billion "
    },
    {
        "content": "* Will pay royalties of up to 12 pct on future net sales   (Adds comment from head of Novartis Pharmaceuticals  detail)",
        "date": "08212015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-Novartis buys remaining rights to GSK treatment for up to $1 bln "
    },
    {
        "content": "ZURICH  Aug 21 Swiss drugmaker Novartis  said on Friday it had agreed to buy all remaining rights to Ofatumumab  which is being developed for relapsing remitting multiple sclerosis and other autoimmune indications  from Britain's GlaxoSmithKline.",
        "date": "08212015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Novartis buys remaining rights to GSK treatment in deal up to $1 bln "
    },
    {
        "content": "* GSK to divest ofatumumab for auto-immune indications to Novartis for up to $1 billion plus royalties",
        "date": "08212015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK to divest ofatumumab auto-immune rights to Novartis for up to $1 bln "
    },
    {
        "content": "LONDON  Aug 13 GlaxoSmithKline is banking on a major clinical trial to revive its flagging respiratory medicine business  with billions of dollars of sales riding on a positive result.",
        "date": "08132015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK hopes big clinical trial can breath new life into lung drug "
    },
    {
        "content": "Aug 11 Drugmaker GlaxoSmithKline closed its North Carolina factory on Tuesday after testing at a cooling tower found bacteria that causes deadly Legionnaire's disease  a company spokeswoman said.",
        "date": "08112015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK closes North Carolina plant after Legionnaires' bacteria found "
    },
    {
        "content": "Aug 12 Drugmaker GlaxoSmithKline temporarily closed a North Carolina factory on Tuesday after testing at a cooling tower found bacteria that causes deadly Legionnaire's disease.",
        "date": "08122015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK shuts U.S. plant due to bacteria  no supply disruption seen "
    },
    {
        "content": "GlaxoSmithKline subsidiary Stiefel Laboratories has filed suit against the Canadian company that agreed to purchase the rights to make  sell and distribute its brand-name psoriasis drug Soriatane for $180 million.",
        "date": "07292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK subsidiary fights to close Soriatane sale "
    },
    {
        "content": "LAGOS  July 28 GSK's Nigerian unit  said on Tuesday its first-half pretax profit fell to 424.8 million naira ($2.14 million)  down 66.05 percent from a year ago.",
        "date": "07282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK's Nigerian unit reports 66 pct drop in first-half profit "
    },
    {
        "content": "LONDON  July 29 Britain's top share index advanced on Wednesday  with Hikma Pharmaceuticals leading the market higher on positive broker comments and GlaxoSmithKline gaining after reporting a lower-than-expected fall in quarterly earnings.",
        "date": "07292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 3-FTSE finishes higher  Hikma and GlaxoSmithKline boost "
    },
    {
        "content": "July 29 GlaxoSmithKline Plc CEO Andrew Witty told analysts:  * CEO says headline results of SUMMIT trial with Breo likely around Sept/Oct  * CEO says big-to-big pharma deals have high \"pain\" threshold and risky; GSK",
        "date": "07292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK sees headline results of SUMMIT trial with Breo around Sept/Oct "
    },
    {
        "content": "LONDON  July 29 Britain's top share index advanced on Wednesday  with Hikma Pharmaceuticals leading the market higher on positive broker comments and GlaxoSmithKline gaining after reporting a lower-than-expected fall in quarterly earnings.",
        "date": "07292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "FTSE extends gains  Hikma and GlaxoSmithKline support "
    },
    {
        "content": "LONDON GlaxoSmithKline moved to reclaim its prowess as a research powerhouse on Wednesday by flagging up dozens of new drugs and vaccines in development  as demand for new HIV medicines helped it beat quarterly profit forecasts.",
        "date": "07292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK flags up pipeline as HIV drugs help it beat profit forecasts "
    },
    {
        "content": "* WHO to assess vaccine in October before possible rollout   (Adds WHO giving date for its review  WHO quotes)",
        "date": "07242015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 3-World's first malaria vaccine gets regulatory go-ahead  faces WHO review "
    },
    {
        "content": "* GSK says has around 40 new drugs and vaccines in Phase II/III",
        "date": "07292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-GSK flags up pipeline as HIV drugs help it beat profit forecasts "
    },
    {
        "content": "LONDON  July 24 The world's first malaria vaccine got a green light on Friday from European drugs regulators who recommended it as safe and effective to use in babies in Africa at risk of the mosquito-borne disease.",
        "date": "07242015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "CORRECTED-UPDATE 1-World's first malaria vaccine gets go-ahead from EU regulators "
    },
    {
        "content": "July 29 GlaxoSmithKline Plc CEO Andrew Witty told reporters:  * CEO says research and development event in November will be \"key moment\" for",
        "date": "07292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline CEO says Nov R&D day will be \"key moment\" for company "
    },
    {
        "content": "* GSK's malaria candidate vaccine  mosquirixtm (rts s)  receives positive opinion from european regulators for prevention of malaria  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "07242015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline malaria vaccine Mosquirix gets EMA nod "
    },
    {
        "content": "LONDON  July 29 A further slide in sales of lung drug Advair and lower profit margins following a business overhaul hit GlaxoSmithKline in the second quarter  although core earnings per share fell by a less-than-expected 9 percent.",
        "date": "07292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline Q2 beats despite Advair hit  lower margins "
    },
    {
        "content": "* Abbott  GSK  Lupin and Ipca among firms affected   (Adds details on government's position  results of new study )",
        "date": "07162015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 1-India expands medicine price control list to include 39 more drugs "
    },
    {
        "content": "LONDON  July 14 GlaxoSmithKline said on Tuesday it had forged a collaboration with the Francis Crick Institute  making it the first pharmaceutical company to link up with the new biomedical centre based in London.",
        "date": "07132015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK first drugmaker to tie up with new Crick institute "
    },
    {
        "content": "LONDON  July 17 Britain's top shares edged slightly lower on Friday  lagging euro zone stocks  with retailer Marks & Spencer leading the falls after announcing the departure of its clothing boss.",
        "date": "07172015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Britain's FTSE led lower by M&S  GlaxoSmithKline "
    },
    {
        "content": "GlaxoSmithKline has asked a federal judicial panel to consolidate a dozen lawsuits alleging that its anti-nausea medication Zofran can cause birth defects in children born to women who took the drug while pregnant.",
        "date": "07072015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GlaxoSmithKline seeks MDL for Zofran birth-defect cases "
    },
    {
        "content": "LONDON  July 2 China will receive cut-price supplies of GlaxoSmithKline's new HIV drug Tivicay  following a deal for Shanghai-based Desano Pharmaceuticals to become an additional manufacturer of the medicine's active ingredient.",
        "date": "07022015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Manufacturing deal wins China cheap supply of GSK's new HIV drug "
    },
    {
        "content": "* Takes direct control over marketing & distribution of Ixiaro",
        "date": "06222015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Valneva takes direct control over marketing & distribution of Ixiaro "
    },
    {
        "content": "LONDON  June 22 GlaxoSmithKline has agreed to sell two meningitis vaccines to Pfizer to satisfy antitrust concerns after its recent acquisition of vaccines business of Novartis.",
        "date": "06222015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK sells two vaccines to Pfizer to ease competition concerns "
    },
    {
        "content": "LONDON/BEIJING  June 18 A British corporate investigator freed from a Chinese jail last week has accused officials there of deliberately withholding medical treatment to try to force him to confess to a role in a scandal involving drugmaker GlaxoSmithKline Plc (GSK).",
        "date": "06182015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UK investigator says Chinese officials mistreated him to get GSK confession "
    },
    {
        "content": "LONDON  June 15 GlaxoSmithKline has agreed with life sciences investment firm Avalon Ventures to bankroll three more new biotech firms  bringing to six the number of start-ups formed since the partners announced a $495 million alliance two years ago.",
        "date": "06152015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline and Avalon bankroll three more biotech start-ups "
    },
    {
        "content": "SHANGHAI A British corporate sleuth and his American wife and business partner  both linked to a bribery scandal in China involving drugmaker GlaxoSmithKline PLC  were deported on Wednesday after their jail terms were reduced this month.",
        "date": "06172015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "China deports British  American investigators linked to GSK scandal "
    },
    {
        "content": "SHANGHAI  June 17 A British corporate sleuth and his American wife and business partner  both linked to a bribery scandal in China involving drugmaker GlaxoSmithKline PLC   were deported on Wednesday after their jail terms were reduced this month.",
        "date": "06172015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "REFILE-China deports British  American investigators linked to GSK scandal "
    },
    {
        "content": "LONDON British drugmaker GlaxoSmithKline is investing $95 million to create a new U.S. research institute led by a top genomics professor to investigate how a cell's operating system  works.",
        "date": "06172015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK invests $95 million in effort to demystify cell 'operating system' "
    },
    {
        "content": "LONDON  June 17 British drugmaker GlaxoSmithKline is investing $95 million to create a new U.S. research institute led by a top genomics professor to investigate how a cell's operating system  works.",
        "date": "06172015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK invests $95 mln in effort to demystify cell 'operating system' "
    },
    {
        "content": "June 11 An advisory committee to the U.S. Food and Drug Administration recommended approval on Thursday of GlaxoSmithKline Plc's drug for severe asthma in patients aged 18 and older.",
        "date": "06112015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "FDA panel backs approval of GSK asthma drug in adults "
    },
    {
        "content": "SHANGHAI A British corporate investigator linked to a bribery scandal in China involving drugmaker GlaxoSmithKline PLC is to be released early from a 2 1/2-year sentence in a Chinese jail  a source close to his family said on Tuesday.",
        "date": "06092015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK-linked investigator freed early from China jail: source "
    },
    {
        "content": "SHANGHAI  June 9 A British corporate investigator linked to a bribery scandal in China involving drugmaker GlaxoSmithKline PLC is to be released early from a 2 1/2-year sentence in a Chinese jail  a source close to his family said on Tuesday.",
        "date": "06092015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK-linked investigator freed early from China jail - source "
    },
    {
        "content": "SHANGHAI  June 9 A British corporate investigator linked to a bribery scandal involving drugmaker GlaxoSmithKline PLC has been told he will be released early from a 2-1/2 year prison sentence in China  a person close to his family said on Tuesday.",
        "date": "06092015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK-linked investigator to be freed early from China prison - source "
    },
    {
        "content": "* Submits Japan regulatory application for mepolizumab in severe eosinophilic asthma",
        "date": "05222015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK submits application for Japanese approval of asthma drug "
    },
    {
        "content": "* Says Russell Greig  former President of Pharmaceuticals International  GlaxoSmithKline plc  joins the Board as Chairman",
        "date": "05132015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Bionor Pharma appoints Russell Greig Chairman "
    },
    {
        "content": "LONDON  May 14 Britain's FTSE 100 index ended higher on Thursday  with encouraging updates from companies such as 3i Group supporting the broader stock market.",
        "date": "05142015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "FTSE ends higher; 3i Group leads after strong earnings "
    },
    {
        "content": "LONDON  May 14 Britain's blue-chip FTSE 100 index edged higher in afternoon trading on Thursday  with encouraging updates from companies such as 3i Group supporting the broader stock market.",
        "date": "05142015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "FTSE edges higher; 3i Group leads after strong earnings "
    },
    {
        "content": "LONDON  May 14 Britain's blue-chip FTSE 100 index edged down on Thursday  broadly in line with European shares hit by a persistent bond-market sell-off  after a mixed bag of corporate earnings and weaker commodity prices.",
        "date": "05142015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Britain's FTSE edges lower  miners weigh "
    },
    {
        "content": "LONDON  May 11 Britain's GlaxoSmithKline   which decided last week to retain rather than float off its HIV drugs business  is to collaborate with U.S. scientists in developing a cure for AIDS.",
        "date": "05112015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Hunt for AIDS cure accelerates as GSK and U.S. experts link up "
    },
    {
        "content": "LONDON  May 7 GlaxoSmithKline's new chairman Philip Hampton has thrown his support behind the company's current structure and chief executive despite pressure from some shareholders for a change.",
        "date": "05072015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 2-New GSK chairman backs CEO Witty to stay at helm "
    },
    {
        "content": "* GRAPHIC: http://graphics.thomsonreuters.com/15/UK-election/index.html   (Adds leaders' tweets  French finance minister)",
        "date": "05072015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 4-Gridlock looms in Britain; last election poll sees no clear winner "
    },
    {
        "content": "LONDON  May 7 GlaxoSmithKline's new chairman Philip Hampton expressed support for the company's current structure and its chief executive on Thursday while speaking to reporters after the drugmaker's annual meeting.",
        "date": "05072015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "New GSK chairman backs CEO Witty to stay at helm "
    },
    {
        "content": "* Manvinder Singh (Vindi) Banga will join board of company as a non-executive director on 1 September  2015",
        "date": "05072015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK appoints Manvinder Singh Banga as non-executive director "
    },
    {
        "content": "LONDON  May 5 GlaxoSmithKline said on Tuesday it had submitted a gene therapy for approval in Europe  becoming the first big drugmaker to seek marketing authorisation for the technology to fix faulty genes.",
        "date": "05052015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Gene therapy takes step forward as GSK files for EU approval "
    },
    {
        "content": "* Announce EU regulatory submission for gene therapy to treat rare disease ADA-SCID",
        "date": "05052015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK submits gene therapy marketing application to EMA "
    },
    {
        "content": "LONDON  May 7 British voters get to decide on Thursday who they want to rule the world's fifth-largest economy in a tight election that could yield weak government  propel the United Kingdom towards a vote on EU membership and stoke Scottish desire for secession.",
        "date": "05062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "United Kingdom votes in most unpredictable election in decades "
    },
    {
        "content": "LONDON  May 6 After relying for years on its top-selling lung drug Advair  GlaxoSmithKline is now braced for the worst in the form of cheap generics - but not just yet.",
        "date": "05062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK sees little prospect of U.S. generic Advair in 2016 "
    },
    {
        "content": "The U.S. Food and Drug Administration on Thursday approved the sale of Breo Ellipta as a once-daily treatment for asthma in patients aged 18 and older  GlaxoSmithKline and Theravance Inc said.",
        "date": "05012015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "U.S. FDA approves Glaxo  Theravance's Breo Ellipta asthma drug "
    },
    {
        "content": "LONDON GlaxoSmithKline  scrapped plans to float its HIV drug business on Wednesday and promised to pay a steady dividend for three years  setting out long-term growth targets after the biggest shake-up in its 15-year history.",
        "date": "05062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK scraps plan to list HIV drugs business and shields dividend "
    },
    {
        "content": "LONDON GlaxoSmithKline  may ditch a plan to return 4 billion pounds ($6.1 billion) to investors  some analysts believe  as the drugmaker prepares to set out its vision for the reshaped group and a new chairman takes the helm.",
        "date": "05012015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Doubts grow over GlaxoSmithKline's $6 billion capital return plan "
    },
    {
        "content": "LONDON  May 1 GlaxoSmithKline may ditch a plan to return 4 billion pounds ($6.1 billion) to investors  some analysts believe  as the drugmaker prepares to set out its vision for the reshaped group and a new chairman takes the helm.",
        "date": "05012015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Doubts grow over GlaxoSmithKline's $6 bln capital return plan "
    },
    {
        "content": "* Q1 revenue 5.62 billion pounds  in line with consensus   (Adds reaction and context)",
        "date": "05062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-GSK scraps plan to list HIV drugs business and shields dividend "
    },
    {
        "content": "* Ceo says ~has different view from other companies on further drug pricing pressures",
        "date": "05062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline CEO comments from media roundtable "
    },
    {
        "content": "LONDON Consumers from New York to New Delhi are digging deeper in their pockets for over-the-counter remedies and health products  a trend GlaxoSmithKline  is banking on to help shape the next chapter in its evolution.",
        "date": "05062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "New-look GSK bets on consumer health spending "
    },
    {
        "content": "LONDON  May 6 GlaxoSmithKline laid out growth targets for its biggest businesses on Wednesday  hoping to convince investors that focusing on consumer health and vaccines would return the drugmaker to long-term growth.",
        "date": "05062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline targets growth across units  scraps ViiV IPO "
    },
    {
        "content": "* Group revenue expected to grow at a cagr of low-to-mid single digits over five year period 2016-2020 on cer basis",
        "date": "05062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithkline sees 2015 earnings fall before pick-up "
    },
    {
        "content": "* Candidate vaccine for prevention of Shingles demonstrates overall efficacy of 97.2 pct which does not diminish in age groups studied",
        "date": "04282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK's Shingles vaccine shows 97 pct efficacy in phase 3 study "
    },
    {
        "content": "LONDON GlaxoSmithKline is close to seeking European approval for a gene therapy drug to fight adenosine deaminase severe combined immune deficiency (ADA-SCID) in the latest sign of a renaissance in the technology to fix faulty genes.",
        "date": "04272015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK readies 'bubble boy' drug as big pharma bets on gene therapy "
    },
    {
        "content": "LONDON  April 27 GlaxoSmithKline is close to seeking European approval for a gene therapy drug to fight the immune deficiency disorder known as \"bubble boy\" disease  in the latest sign of a renaissance in the technology to fix faulty genes.",
        "date": "04272015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK readies \"bubble boy\" drug as big pharma bets on gene therapy "
    },
    {
        "content": "LONDON  March 29 GlaxoSmithKline has reached a deal with the British government to supply a new meningitis B vaccine  following a lengthy stand-off over price with the product's previous owner Novartis.",
        "date": "03292015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK agrees UK deal for meningitis shot after Novartis stand-off "
    },
    {
        "content": "* Press release - GSK receives approval for Encruse Ellipta (umeclidinium) in Japan for the treatment of COPD",
        "date": "03262015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK receives approval for Encruse Ellipta in Japan "
    },
    {
        "content": "NEW YORK  March 30 GlaxoSmithKline Plc  has agreed to settle a lawsuit by Johnson & Johnson  accusing it of using false advertising at the start of the U.S. allergy season to grab market share.",
        "date": "03302015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "J&J  Glaxo settle U.S. lawsuit over allergy ads "
    },
    {
        "content": "March 19 GlaxoSmithKline Plc's drug to treat chronic breathing problems is safe and effective enough for adults with asthma to use but not adolescents  an advisory panel to the U.S. Food and Drug Administration concluded on Thursday.",
        "date": "03192015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 2-FDA panel backs Glaxo asthma drug for adults  not adolescents "
    },
    {
        "content": "GlaxoSmithKline Plc's respiratory treatment for chronic breathing problems did not show any new safety problems while being tested to treat asthma  a preliminary review by U.S. Food and Drug Administration staff found.",
        "date": "03172015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "FDA staff finds no new safety problems with Glaxo's asthma drug "
    },
    {
        "content": "March 17 GlaxoSmithKline Plc's  respiratory treatment for chronic breathing problems did not show any new safety problems while being tested to treat asthma  a preliminary review by U.S. Food and Drug Administration staff found.",
        "date": "03172015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-FDA staff finds no new safety problems with Glaxo's asthma drug "
    },
    {
        "content": "* GSK announces start of phase III programme to evaluate retosiban for spontaneous preterm labour",
        "date": "03172015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK announces start of phase III programme to evaluate retosiban "
    },
    {
        "content": "* Backers include British govt  GSK  J&J  Pfizer  Lilly  Biogen",
        "date": "03172015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-Dementia drug research aided by $100 mln venture capital fund "
    },
    {
        "content": "LONDON GlaxoSmithKline  has taken profits in Aspen Pharmacare  by selling half its stake in the South African drugmaker for $853 million  following a long investment in the firm.",
        "date": "03132015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK raises $853 million by halving stake in South African drugmaker "
    },
    {
        "content": "* British group retains 6.2 percent stake in Aspen   (Updates with actual amount raised following sale)",
        "date": "03132015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-GSK raises $853 mln by halving stake in S.African drugmaker "
    },
    {
        "content": "SINGAPORE/LONDON Drugmaker GlaxoSmithKline  will establish a new headquarters for Asia in Singapore to make quicker decisions for the region  a move that follows a recent rocky ride in China due to a damaging bribery scandal.",
        "date": "03112015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Drugmaker GSK to steer Asian business from new Singapore headquarters "
    },
    {
        "content": "* APN - GSK announces completion of the sale of half its stake in Aspen",
        "date": "03132015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-Aspen says David Redfern to remain director post GSK's stake sale "
    },
    {
        "content": "* GSK completes partial sale of Aspen Pharmacare Holdings Ltd shares - LSE announcement",
        "date": "03132015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK raises $853 mln via partial sale of Aspen Pharmacare shares "
    },
    {
        "content": "NEW YORK  March 12 Johnson & Johnson  sued rival drugmaker GlaxoSmithKline PLC on Thursday  alleging that Glaxo is trying to unlawfully grab market share with false advertising at the start of spring allergy season in the United States.",
        "date": "03122015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Johnson & Johnson sues Glaxo over allergy ads as spring nears "
    },
    {
        "content": "LONDON Drugmaker GlaxoSmithKline   which was fined 3 billion yuan ($479 million) in China last year for bribery  is dismissing 110 employees in the country for misconduct  people familiar with the matter said on Friday.",
        "date": "03062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK sacks 110 China staff in wake of drug bribery case: sources "
    },
    {
        "content": "LONDON GlaxoSmithKline  has decided to take profits in Aspen Pharmacare  by halving its stake in the South African drugmaker  following a long investment in the firm.",
        "date": "03122015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK to pocket $890 million by halving stake in South African drugmaker "
    },
    {
        "content": "LONDON  March 12 GlaxoSmithKline has decided to take profits in Aspen Pharmacare by halving its stake in the South African drugmaker  following a long investment in the firm.",
        "date": "03122015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK to pocket $890 mln by halving stake in S.African drugmaker "
    },
    {
        "content": "LONDON  March 12 GlaxoSmithKline has launched a $890 million share sale in South African drug company Aspen Pharmacare  a source familiar with the matter said on Thursday.",
        "date": "03122015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK launches $890mln placement in Aspen Pharmacare - source "
    },
    {
        "content": "* WHO says effective Ebola shot could be a \"game-changer\"   (Adds details of \"ring vaccination\" plans  quotes)",
        "date": "03052015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 2-Guinea to start final trials of Ebola vaccines this week "
    },
    {
        "content": "* Intends to sell approximately half of its 12.4 pct stake in Aspen Pharmacare Holdings Ltd",
        "date": "03122015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK to sell half of 12.4 pct stake in Aspen Pharmacare "
    },
    {
        "content": "JOHANNESBURG Africa's biggest generic drugmaker Aspen Pharmacare Holdings Ltd  reported a 22 percent increase in half-year profit on Thursday as contributions from recent acquisitions offset the impact of unfavorable currency moves.",
        "date": "03052015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "South Africa's Aspen first-half earnings up 22 percent as acquisitions kick-in "
    },
    {
        "content": "* GSK's Australian opiates business 2013 revenue was $69.6 mln   (Adds Sun Pharma comment  details on Australia poppy industry  share move)",
        "date": "03032015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UPDATE 1-India's Sun Pharma to buy Glaxo's opiates business in Australia "
    },
    {
        "content": "MUMBAI  March 3 Sun Pharmaceutical Industries Ltd  India's largest drugmaker by sales  said on Tuesday it has agreed to buy GlaxoSmithKline's opiates business in Australia.",
        "date": "03032015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "India's Sun Pharma to buy GSK's opiates business in Australia "
    },
    {
        "content": "LONDON  March 2 GlaxoSmithKline and Novartis said on Monday they had completed a series of asset swaps worth more than $20 billion that will reshape both drugmakers.",
        "date": "03022015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK and Novartis complete deals to reshape both drugmakers "
    },
    {
        "content": "LONDON  March 2 GlaxoSmithKline and Novartis said on Monday they had completed a series of asset swaps worth more than $20 billion that will reshape both drugmakers.",
        "date": "03022015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK and Novartis complete deals to reshape both drugmakers "
    },
    {
        "content": "LONDON GlaxoSmithKline  said on Wednesday it expected to conclude a $20 billion-plus three-part asset swap with Novartis  in the week commencing March 2  following progress in obtaining clearances for the deal.",
        "date": "02252015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "GSK set to complete $20 billion Novartis asset swap next week "
    },
    {
        "content": "LONDON  Feb 25 GlaxoSmithKline said on Wednesday it expected to conclude a $20 billion-plus three-part asset swap with Novartis in the week commencing March 2  following progress in obtaining clearances for the deal.",
        "date": "02252015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK set to complete $20 bln Novartis asset swap next week "
    },
    {
        "content": "* Expects to complete transaction in week commencing 2 march 2015.  Source text for Eikon:  Further company coverage:",
        "date": "02252015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GSK expects deal with Novartis to complete in March "
    },
    {
        "content": "LONDON  Feb 26 GlaxoSmithKline said on Thursday that its chairman-designate Philip Hampton would take charge of Britain's biggest drugmaker from May 7  marking an earlier transition than initially anticipated.",
        "date": "02262015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK's new chairman Hampton to take charge in May "
    },
    {
        "content": "* GSK facing tough times; CEO's 2014 bonus cut by 51 pct   (Adds detail on CEO's reduced bonus  paragraph 5)",
        "date": "02262015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-GSK's new chairman Hampton to take charge in May "
    },
    {
        "content": "WASHINGTON Novartis AG has won U.S. antitrust approval to buy GlaxoSmithKline’s oncology drugs  with conditions  the U.S. Federal Trade Commission said on Monday.",
        "date": "02232015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "Novartis AG wins approval to buy GSK cancer drugs  with conditions "
    },
    {
        "content": "WASHINGTON  Feb 23 Novartis AG has won U.S. antitrust approval to buy GlaxoSmithKline's  oncology drugs  with conditions  the U.S. Federal Trade Commission said on Monday.",
        "date": "02232015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-Novartis AG wins approval to buy GSK cancer drugs  with conditions "
    },
    {
        "content": "OTTAWA  Feb 23 Canada's Competition Bureau on Monday approved a deal between GlaxoSmithKline PLC and Novartis AG  noting in a statement that U.S. authorities had already said the transaction could go ahead.",
        "date": "02232015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Canada competition bureau approves GlaxoSmithKline/Novartis deal "
    },
    {
        "content": "WASHINGTON  Feb 23 Novartis AG has won U.S. antitrust approval to buy GlaxoSmithKline's  oncology drugs with conditions  the Federal Trade Commission said on Monday.",
        "date": "02232015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "CORRECTED-Novartis AG wins approval to buy GSK cancer drugs with conditions "
    },
    {
        "content": "* Glaxo lifted by UBS upgrade     * Commodity stocks boosted by higher metal  oil price     * FTSE up 0.5 pct      By Sudip Kar-Gupta     LONDON  Feb 13 Britain's top equity index advanced on Friday  lifted by commodity stocks which benefited from a rise in copper and oil prices.     The blue-chip FTSE 100 index was up by 0.5 percent at 6 860.72 points in early trading.     London copper prices hit a three-week high  helping to drive the FTSE 350 Mining Index up by 2.9 percent  while",
        "date": "02132015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UK's FTSE gains  lifted by commodity stocks  Glaxo "
    },
    {
        "content": "* GSK press release: gsk strengthens early stage vaccine pipeline with acquisition of Glycovaxyn AG",
        "date": "02112015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Glaxosmithkline acquires rest of Glycovaxyn "
    },
    {
        "content": "* Successfully agreed sale of 4 471 202 shares in Genmab  which represents GSK's entire shareholding of about 7.9 percent of share capital of genmab",
        "date": "02052015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK agrees sale of Genmab stake for 194 mln stg "
    },
    {
        "content": "LONDON  Feb 4 GlaxoSmithKline said on Wednesday it expected to start to regain market share in respiratory medicine after weak demand for lung drug Advair again hurt fourth-quarter sales  capping a rough year for Britain's top drugmaker.",
        "date": "02042015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GlaxoSmithKline sees better signs for lung drugs after tough 2014 "
    },
    {
        "content": "COPENHAGEN  Feb 4 Positive results from a trial by biotech company Genmab of its bone marrow cancer treatment could lead to the launch of a blockbuster drug earning $3.5 billion a year  analysts said on Wednesday  sending its shares up by over 10 percent.",
        "date": "02042015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-Genmab data seen pointing to blockbuster drug "
    },
    {
        "content": "LONDON  Feb 4 GlaxoSmithKline has put its 7.9 percent stake in Danish biotech company Genmab  up for sale to institutional investors  the British drugs giant said on Wednesday.",
        "date": "02042015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "REFILE-GSK sells stake in Denmark's Genmab "
    },
    {
        "content": "LONDON  Feb 4 GlaxoSmithKline has put its 7.9 percent stake in Danish biotech company Genmab  up for sale to institutional investors  the British drugs giant said on Wednesday.",
        "date": "02042015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK sells stake in Denmark's Genmab "
    },
    {
        "content": "* Novartis deal on track to close in first half of 2015   (Adds further CEO comment  analyst  updates shares)",
        "date": "02042015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 2-GlaxoSmithKline sees better signs for lung drugs after tough 2014 "
    },
    {
        "content": "* GSK announces EU regulatory submission seeking additional indication for eltrombopag (Revolade)",
        "date": "02062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-GSK seeks EU approval for additional indication of ITP drug "
    },
    {
        "content": "LONDON GlaxoSmithKline  set out a roadmap for a potential 2016 flotation of its HIV medicines business on Wednesday as it hired three leading banks to advise on what would be the drug industry's largest ever initial public share sale.",
        "date": "02042015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK gives roadmap for potential 2016 listing of HIV drugs business "
    },
    {
        "content": "* Two new HIV drugs performing better than expected   (Recasts with GSK CEO comments)",
        "date": "02042015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-GSK gives roadmap for potential 2016 listing of HIV drugs business "
    },
    {
        "content": "* Positive overall survival results from phase iii combi-d study of dabrafenib (tafinlar\u007f) and trametinib (mekinist\u007f) combination  Source text for Eikon:  Further company coverage:",
        "date": "02062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline reports positive result from Phase III COMBI-d study "
    },
    {
        "content": "Feb 4 GlaxoSmithKline Plc CEO Andrew Witty tells reporters:  * CEO says any ViiV IPO likely to be 2016 event  * CEO says globally scaled businesses post-Novartis deal will have more options  * CEO says not giving any guidance for 2016 dividend  * CEO says share of new respiratory patients in Japan  U.S. has started to go",
        "date": "02042015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-GlaxoSmithKline CEO says any ViiV IPO likely to be 2016 event "
    },
    {
        "content": "BRUSSELS  Jan 28 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "EU mergers and takeovers (Jan 28) "
    },
    {
        "content": "The European Commission on Wednesday approved a plan by Novartis and GlaxoSmithKline to trade more than $20 billion worth of assets  part of a reshaping of the drug industry at a time of healthcare spending cuts and more competition.",
        "date": "01282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "EU clears plans by drugmakers GSK and Novartis to trade assets "
    },
    {
        "content": "* Large companies try to focus on leading businesses   (Recasts with oncology business  adds details)",
        "date": "01282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "UPDATE 1-EU clears plans by drugmakers GSK and Novartis to trade assets "
    },
    {
        "content": "* Received clearance from European Commission of its proposed three-part transaction with Novartis",
        "date": "01282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "BRIEF-EU clears GSK-Novartis three-part deal with conditions "
    },
    {
        "content": "BRUSSELS  Jan 28 The European Commission said on Wednesday it had approved drugmaker GlaxoSmithKline's  acquisition of Novartis' vaccines business  as well as a consumer healthcare joint venture between the two.",
        "date": "01282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "RPT-EU clears GSK's acquisition of Novartis vaccines with conditions "
    },
    {
        "content": "BRUSSELS  Jan 28 The European Commission said on Wednesday it had approved drugmaker GlaxoSmithKline's  acquisition of Novartis' vaccines business  as well as a consumer healthcare joint venture between the two.",
        "date": "01282015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "EU clears GSK's acquisition of Novartis vaccines with conditions "
    },
    {
        "content": "* Ablynx successfully opposes patent appeal case by Domantis (GSK)",
        "date": "01222015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "BRIEF-Ablynx says successfully opposes Domantis patent appeal case "
    },
    {
        "content": "LONDON  Jan 20 the international charity Medecins Sans Frontieres urged drugmakers GlaxoSmithKline  and Pfizer on Tuesday to slash the price of their pneumococcal vaccines to $5 per child in poor countries.",
        "date": "01202015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "MSF slams expensive vaccines  urges GSK and Pfizer to cut prices "
    },
    {
        "content": "LONDON GlaxoSmithKline could consider more partial public share offerings for component units as it evolves in the coming years  potentially pointing to a break-up of the group if this offers value to shareholders.",
        "date": "01162015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "More unit IPOs an option for evolving GlaxoSmithKline "
    },
    {
        "content": "LONDON  Jan 15 Britain's top equity index fell on Thursday after the Swiss National Bank (SNB) unexpectedly scrapped its cap on the euro value of the franc  hitting blue-chip stocks across Europe.",
        "date": "01152015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "UK's FTSE falls as Swiss central bank unnerves stock markets "
    },
    {
        "content": "LONDON  Jan 16 GlaxoSmithKline is feeling the heat from the rapid growth in electronic cigarettes  with enthusiasm for the nicotine delivery devices dampening sales of the British drugmaker's patches and gum  its chief executive said.",
        "date": "01162015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "GSK's nicotine patches and gum feel the heat from e-cigarettes "
    },
    {
        "content": "LONDON GlaxoSmithKline could consider more partial public share offerings for component units as it evolves in the coming years  potentially pointing to a break-up of the group if this offers value to shareholders.",
        "date": "01162015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "normal",
        "symbol": "GSK",
        "title": "Exclusive: More unit IPOs an option for evolving GlaxoSmithKline "
    },
    {
        "content": "BRUSSELS  Jan 9 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01092015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "EU mergers and takeovers (Jan 9) "
    },
    {
        "content": "BRUSSELS  Jan 6 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01062015",
        "name": "GlaxoSmithKline PLC",
        "news_type": "topStory",
        "symbol": "GSK",
        "title": "EU mergers and takeovers (Jan 6) "
    }
]