[
    {
        "content": "* Hain Celestial reports first quarter fiscal year 2018 financial results",
        "date": "11072017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial reports Q1 earnings per share $0.19 "
    },
    {
        "content": "Hain Celestial Group Inc  under pressure from activist shareholder Engaged Capital LLC to make drastic changes at the U.S. organic food company  said on Thursday it would name six new directors to its board  including the hedge fund's founder.",
        "date": "09282017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "Organic food maker Hain revamps board in win for activist investor "
    },
    {
        "content": "Sept 28 Hain Celestial Group Inc  under pressure from activist shareholder Engaged Capital LLC to make drastic changes at the U.S. organic food company  said on Thursday it would name six new directors to its board  including the hedge fund's founder.",
        "date": "09282017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "normal",
        "symbol": "HAIN",
        "title": "UPDATE 2-Organic food maker Hain revamps board in win for activist investor "
    },
    {
        "content": "* Hain Celestial Group - co entered into an agreement on Sept. 27 with certain individuals affiliated with  investment funds managed by Engaged Capital  LL‍​",
        "date": "09282017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "normal",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial Group - Co entered into agreement with individuals affiliated with funds managed by Engaged Capital‍​ "
    },
    {
        "content": "* ‍hain Celestial announces 2017 annual meeting of stockholders date  reconstitution of board of directors and cooperation agreement with Engaged Capital​",
        "date": "09282017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "normal",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial announces 2017 annual stockholders meeting date  reconstitution of board  cooperation agreement with Engaged Capital‍​ "
    },
    {
        "content": "Sept 28 Hain Celestial reached an agreement with activist investor Engaged Capital LLC for changes in its board  which could pave the way for a potential sale of the organic food and beverage company  the Wall Street Journal reported on Thursday.",
        "date": "09282017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "normal",
        "symbol": "HAIN",
        "title": "Hain Celestial  activist investor agree on board changes - WSJ "
    },
    {
        "content": "* Hain Celestial announces fourth quarter and fiscal year financial 2017 results",
        "date": "08292017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial Group reports qtrly adjusted earnings per diluted share of $0.43 "
    },
    {
        "content": "* Hain Celestial receives anticipated notice of Nasdaq non-compliance due to delayed annual meeting Source text for Eikon: Further company coverage:",
        "date": "07132017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial receives anticipated notice of Nasdaq non-compliance due to delayed annual meeting "
    },
    {
        "content": "* Hain Celestial's cultivate ventures announces first strategic acquisition",
        "date": "06282017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial's cultivate ventures announces first strategic acquisition "
    },
    {
        "content": "* Engaged Capital LLC reports 9.9 percent stake in Hain celestial group inc  as of June 22  2017  - sec filing",
        "date": "06292017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Engaged Capital reports 9.9 pct stake in Hain Celestial Group  as of June 22  2017 "
    },
    {
        "content": "* Hain Celestial announces financial results and expands strategic plan to deliver enhanced shareholder value",
        "date": "06222017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial sees full year 2017 net sales $2.84-$2.86 bln "
    },
    {
        "content": "* Hain Celestial appoints James M. Langrock executive vice president and Chief Financial Officer",
        "date": "06222017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "normal",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial names James Langrock as CFO "
    },
    {
        "content": "* HAIN CELESTIAL RECEIVES NASDAQ EXTENSION AND LENDER WAIVER AND EXTENSION OF CREDIT FACILITY",
        "date": "06152017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-HAIN CELESTIAL RECEIVES NASDAQ EXTENSION AND LENDER WAIVER AND EXTENSION OF CREDIT FACILITY "
    },
    {
        "content": "* Hain Celestial receives lender waiver and extension of credit facility to June 15th",
        "date": "05302017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial receives lender waiver and extension of credit facility to June 15th "
    },
    {
        "content": "* Hain Celestial announces executive appointments  Source text for Eikon:  Further company coverage:",
        "date": "03062017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial announces executive appointments "
    },
    {
        "content": "* Hain Celestial Group Inc - As of December 31  2016 there was $790 million in borrowings under credit facility",
        "date": "02272017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial receives lender waiver and extension of credit facility "
    },
    {
        "content": "* Hain Celestial receives expected notice of Nasdaq non-compliance due to delayed filing of second quarter form 10-q  Source text for Eikon:  Further company coverage:",
        "date": "02232017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial receives expected notice of Nasdaq non-compliance "
    },
    {
        "content": "* Hain Celestial Group Inc - deal is expected to be accretive to Hain Celestial's earnings in fiscal year 2018",
        "date": "02162017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial announces strategic acquisition "
    },
    {
        "content": "* Hain Celestial Group Inc files for non timely 10-Q - SEC filing",
        "date": "02102017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial files for non timely 10-Q "
    },
    {
        "content": "* Hain Celestial announces strategic alliance with Future Consumer Limited in India",
        "date": "01202017",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial announces strategic alliance with Future Consumer Limited in India "
    },
    {
        "content": "* Hain Celestial Group filing for non timely 10-Q  Source text for Eikon:  Further company coverage:    ;))",
        "date": "11102016",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial Group filing for non timely 10-Q "
    },
    {
        "content": "* Cultivate will be managed under rest of world segment along with Hain Celestial Canada and Hain Celestial Europe",
        "date": "11012016",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial Group launches cultivate ventures "
    },
    {
        "content": "* Hain Celestial receives lender limited waiver and extension of credit facility",
        "date": "09262016",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial receives lender limited waiver and extension of credit facility "
    },
    {
        "content": "* Hain Celestial's sale of own-label juice business to Multiple Marketing Ltd. approved by competition and markets authority  Source text for Eikon:  Further company coverage:",
        "date": "09232016",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial's sale of own-label juice business approved by competition  markets authority "
    },
    {
        "content": "Aug 16 Hain Celestial Group Inc's  shares fell 30 percent to their lowest in five months in early trading after the organic food maker said it had started an internal probe into its accounting practices and would not meet its full-year forecasts.",
        "date": "08162016",
        "name": "The Hain Celestial Group Inc",
        "news_type": "normal",
        "symbol": "HAIN",
        "title": "Hain Celestial shares sink on news of internal accounting probe "
    },
    {
        "content": "* Currently evaluating whether revenue associated with those concessions was accounted for in correct period",
        "date": "08152016",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial says currently evaluating its internal control over financial reporting "
    },
    {
        "content": "* Hain celestial announces third quarter fiscal year 2016 results",
        "date": "05042016",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "BRIEF-Hain Celestial posts Q3 adjusted earnings per share $0.49 "
    },
    {
        "content": "Oct 19 Stremicks Heritage Foods LLC  a U.S. maker and distributor of dairy products  is exploring a sale that it hopes could value it at more than $1 billion  including debt  according to people familiar with the matter.",
        "date": "10232015",
        "name": "The Hain Celestial Group Inc",
        "news_type": "normal",
        "symbol": "HAIN",
        "title": "Stremicks Heritage Foods seeks sale-sources "
    },
    {
        "content": "Hain Celestial Group Inc failed to persuade a federal judge to dismiss a lawsuit accusing it of deceiving consumers into overpaying for its Earth's Best baby food  infant food and baby and home care products by falsely labeling them \"organic\" or \"all natural.\"",
        "date": "05082015",
        "name": "The Hain Celestial Group Inc",
        "news_type": "topStory",
        "symbol": "HAIN",
        "title": "Hain Celestial must face lawsuit over baby-food labeling "
    }
]