[
    {
        "content": "Mattel Inc has rebuffed Hasbro Inc's latest takeover approach  people familiar with the matter said on Wednesday  casting uncertainty over the potential combination of the world's two largest toy companies.",
        "date": "11162017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Exclusive: Mattel snubs Hasbro's latest acquisition approach - sources "
    },
    {
        "content": "Nov 16 The following bids  mergers  acquisitions and disposals were reported by 1400 GMT on Thursday:",
        "date": "11162017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Hasbro makes takeover approach to Mattel - CNBC citing   Dow Jones Source: http://cnb.cx/2hpJf46 Further company coverage:",
        "date": "11102017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro makes takeover approach to Mattel - CNBC citing   Dow Jones "
    },
    {
        "content": "Nov 16 U.S. stocks were set to bounce back on Thursday after two straight days of losses on the back of strong earnings from companies  including Wal-Mart and Cisco.",
        "date": "11162017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS-Wall St set to rebound as Wal-Mart  Cisco results impress "
    },
    {
        "content": "Nov 10 Toymaker Hasbro Inc has made a takeover approach for rival Mattel Inc  the Wall Street Journal reported on Friday.",
        "date": "11102017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Hasbro makes takeover offer for Mattel - WSJ "
    },
    {
        "content": "NEW YORK U.S. stocks fell on Wednesday as energy sector shares dropped for a fourth straight session  tracking crude prices  while a late run-up was thwarted by concerns over the passage of a tax revamp after Republican senators were critical of the proposal. | Video ",
        "date": "11162017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Wall Street falls with energy shares; tax angst weighs "
    },
    {
        "content": "Hasbro Inc  has made an approach to acquire rival Mattel Inc   a source familiar with the matter said on Friday  the latest attempt to combine the two biggest U.S. toymakers in more than two decades.",
        "date": "11112017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "U.S. toymaker Hasbro makes new approach to buy Mattel: source "
    },
    {
        "content": "BOSTON  Nov 7 U.S. investors who want to divest from firearms and ammunition makers may find it not so straightforward: They are hidden among the stocks and bonds of hospitals  toymakers and greeting card companies.",
        "date": "11072017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Guns  ammo lumped with hospitals  greeting cards in U.S. fund filings "
    },
    {
        "content": "Nov 10 Hasbro Inc has made an approach to acquire rival Mattel Inc  a source familiar with the matter said on Friday  the latest attempt to combine the two biggest U.S. toymakers in more than two decades.",
        "date": "11112017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 3-U.S. toymaker Hasbro makes new approach to buy Mattel -source "
    },
    {
        "content": "* Paramount Pictures and Hasbro to produce and distribute live action and animated content under five year exclusive relationship",
        "date": "11032017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Paramount Pictures and Hasbro teams up to produce content "
    },
    {
        "content": "Hasbro Inc  warned of holiday season fallout from the Toys'R'Us bankruptcy  issuing a weaker-than-expected forecast on Monday that sent the toy maker's shares down 10 percent. | Video ",
        "date": "10242017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Toys'R'Us collapse to hit Hasbro holiday sales "
    },
    {
        "content": "* Hasbro CEO- Q3 operating profit margin would have been about 100 basis points higher excluding incremental bad debt expense related to Toys R Us bankruptcy -conf call",
        "date": "10232017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro signs agreement with Toys R Us on receivables "
    },
    {
        "content": "Oct 23 Hasbro Inc warned of holiday season fallout from the Toys'R'Us bankruptcy  issuing a weaker-than-expected forecast on Monday that sent the toy maker's shares down 10 percent.",
        "date": "10232017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 4-Toys'R'Us collapse to hit Hasbro holiday sales "
    },
    {
        "content": "Oct 23 Hasbro Inc  the No. 2 U.S. toymaker  reported a 7 percent rise in quarterly revenue on Monday  helped by its gaming unit and strong demand for toys based on its My Little Pony and Transformers franchises.",
        "date": "10232017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Hasbro's quarterly revenue rises 7 pct "
    },
    {
        "content": "* Hasbro reports revenue  net earnings and earnings per share growth for third quarter 2017",
        "date": "10232017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro reports Q3 earnings per share $2.09 "
    },
    {
        "content": "Sept 18 Shares of Mattel Inc and Hasbro Inc  the two largest U.S. toy makers  fell on Monday on concerns that retailer Toys \"R\" Us  a major customer  could be filing for bankruptcy protection before the holiday sales season.",
        "date": "09182017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "UPDATE 2-Toy companies' shares tumble on concerns of Toys 'R' Us bankruptcy "
    },
    {
        "content": "Sept 18 Shares of U.S. toy companies Mattel Inc and Hasbro Inc fell on Monday on concerns that retailer Toys \"R\" Us  a major customer  could be filing for bankruptcy before the holiday sales season.",
        "date": "09182017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Toy companies' shares fall on concerns of Toys \"R\" Us bankruptcy "
    },
    {
        "content": "* Hasbro Inc files for potential debt shelf offering; size not disclosed - SEC filing‍​ Source text (http://bit.ly/2iZzv0z) Further company coverage:",
        "date": "09052017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro Inc files for potential debt shelf offering  size not disclosed "
    },
    {
        "content": "* Says ‍on March 30  2015  it and its unit entered into a second amended and restated revolving credit agreement - SEC filing",
        "date": "08282017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro  unit enter into a second amended  restated revolving credit agreement "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.57 per share Source text for Eikon: Further company coverage:",
        "date": "08022017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro sets quarterly cash dividend of $0.57 per share "
    },
    {
        "content": "Hasbro Inc  the maker of games ranging from Monopoly to foam Nerf balls  has ended talks to acquire U.S. movie studio and entertainment company Lions Gate Entertainment Corp  people familiar with the matter said on Wednesday.",
        "date": "08022017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Exclusive: Hasbro ends talks to buy Lions Gate Entertainment - sources "
    },
    {
        "content": "* Announcement of Stretch Armstrong and Flex Fighters  a new original series from Hasbro studios premiering on Netflix Source text for Eikon: Further company coverage:",
        "date": "07312017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro and Netflix announce new original series "
    },
    {
        "content": "Toymaker Hasbro Inc's  quarterly sales scraped past analysts' estimates  marking its smallest beat in more than one and a half years  propped up by demand for its Transformers and Nerf toys in the United States. | Video ",
        "date": "07242017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Hasbro posts smallest sales beat in 1-1/2 years  shares drop "
    },
    {
        "content": "* Hasbro's shares slump as much as 9.2 pct (Adds analyst  CFO comments; updates shares)",
        "date": "07242017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 3-Hasbro posts smallest sales beat in 1-1/2 years  shares drop "
    },
    {
        "content": "* Qtrly net revenues for international segment $426.6 million  up 6 percent",
        "date": "07242017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro Inc reports Q2 earnings per share $0.53 "
    },
    {
        "content": "July 24 Hasbro Inc  the No. 2 U.S. toymaker  reported a 10.6 percent rise in quarterly revenue  helped by demand for its Transformers and Nerf toys in the United States.",
        "date": "07242017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Hasbro's quarterly sales rise 10.6 pct "
    },
    {
        "content": "* Hasbro Inc - ‍monopoly brand from Hasbro and Nintendo announced launch of monopoly gamer edition game​",
        "date": "06282017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro and Nintendo introduce monopoly gamer "
    },
    {
        "content": "June 19 Hasbro Inc  the No. 2 U.S. toymaker  said on Monday it launched a subscription service to deliver sets of board games in the United States.",
        "date": "06192017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Hasbro launches board game subscription service "
    },
    {
        "content": "* Hasbro launches gaming subscription service Source text for Eikon: Further company coverage:",
        "date": "06192017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro launches gaming subscription service "
    },
    {
        "content": "CASCAIS  Portugal Confusion surrounding the trade policies of U.S. President Donald Trump's administration means U.S. companies no longer know the rules of the game  a board member and former CEO of toymaker Hasbro  told an international conference on Monday.",
        "date": "05292017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "U.S. companies no longer know rules of game under Trump  Hasbro director says "
    },
    {
        "content": "CASCAIS  Portugal  May 29 Confusion surrounding the trade policies of U.S. President Donald Trump's administration means U.S. companies no longer know the rules of the game  a board member and former CEO of toymaker Hasbro told an international conference on Monday.",
        "date": "05292017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US companies no longer know rules of game under Trump  Hasbro director says "
    },
    {
        "content": "* Declared a quarterly cash dividend of $0.57 per common share Source text for Eikon: Further company coverage:",
        "date": "05182017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro inc sets quarterly cash dividend of $0.57/shr "
    },
    {
        "content": "Hasbro Inc   the No. 2 U.S. toymaker  reported higher-than-expected quarterly earnings as strong demand for digital games more than doubled profit in its entertainment and licensing business  sending its shares to a record high.",
        "date": "04242017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Hasbro profit beats on gaming demand  shares hit record high "
    },
    {
        "content": "* Shares jump as much as 8.5 pct to $104.14 in morning trading (Adds details  updates shares)",
        "date": "04242017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 3-Hasbro profit beats on gaming demand  shares hit record high "
    },
    {
        "content": "April 24 Hasbro Inc  the no. 2 U.S. toymaker  reported a 2.2 percent rise in quarterly revenue helped by higher demand for toys based on franchises such as \"Nerf\" and \"Transformers\".",
        "date": "04242017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Hasbro quarterly revenue rises 2.2 pct "
    },
    {
        "content": "* Hasbro and Marmalade Game Studio extend their relationship with the introduction of clue/cluedo game for mobile  Source text for Eikon:  Further company coverage:",
        "date": "03142017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro  Marmalade Game Studio extend relationship with introduction of clue/cluedo game for mobile "
    },
    {
        "content": "Hasbro Inc   the No. 2 U.S. toymaker  reported record holiday-quarter revenue  helped by strong demand for Disney princess dolls and its board games  sending the company's shares up 17 percent to an all-time high. | Video ",
        "date": "02062017",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Hasbro's record holiday quarter lifts shares to all-time high "
    },
    {
        "content": "* Shares rise 16.6 pct to record high of $96.34   (Adds CEO comment)",
        "date": "02062017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 4-Hasbro's record holiday quarter lifts shares to all-time high "
    },
    {
        "content": "Feb 6 Hasbro Inc reported an 11.2 percent rise in quarterly revenue on Monday  helped by strong demand for its Disney Princess and Frozen dolls in the all-important holiday selling season in the United States.",
        "date": "02062017",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Toymaker Hasbro's quarterly sales rise 11.2 pct "
    },
    {
        "content": "Hasbro Inc reported better-than-expected quarterly revenue and profit  helped by strong demand for Disney Princess  Frozen and Trolls dolls  and said it was seeing \"strong sales trends\" heading into the holiday shopping season. | Video ",
        "date": "10172016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Hasbro revenue  profit beat as Disney Princess dolls dazzle "
    },
    {
        "content": "* Hasbro executive - Rogue One Star Wars product was on shelf on Sept. 30  later than 2015's on-shelf date of Sept. 4 which notably impacted us pos results",
        "date": "10172016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro says the later on-shelf date of Rogue One Star Wars products impacted U.S. POS "
    },
    {
        "content": "* Q3 profit $2.03/shr vs est of $1.74/shr   (Adds details from conference call  updates shares)",
        "date": "10172016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 2-Hasbro revenue  profit beat as Disney Princess dolls dazzle "
    },
    {
        "content": "Oct 17 U.S. stocks inched higher at the open on Monday  helped by strong earnings reports from key companies including Bank of America and Hasbro.",
        "date": "10172016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS SNAPSHOT-Wall St inches up at open  boosted by BofA "
    },
    {
        "content": "* Hasbro reports revenue  operating profit and net earnings growth for third quarter 2016",
        "date": "10172016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro Q3 earnings per share $2.03 "
    },
    {
        "content": "Oct 17  Hasbro Inc  the No. 2 U.S. toymaker  reported a 14.2 percent rise in quarterly revenue  helped by strong demand for toys in the girls category such as Disney Princess  Frozen and Trolls dolls.",
        "date": "10172016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Toymaker Hasbro reports 14.2 pct rise in quarterly revenue "
    },
    {
        "content": "* Co  Hasbro Inc announced a partnership to develop a multiplayer mobile game inspired by Transformers franchise  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "08012016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Kabam and Hasbro announce partnership to develop multiplayer mobile game inspired by Transformers franchise "
    },
    {
        "content": "Hasbro Inc  reported higher-than-expected quarterly profit and revenue  driven by strong demand for Disney Princess and Frozen dolls and action figures based on \"Star Wars\" movies.",
        "date": "07182016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Hasbro beats estimates on strong demand for Disney Princess dolls "
    },
    {
        "content": "* Shares fall as much as 7.6 pct   (Adds details  analyst comments; updates shares)",
        "date": "07182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 3-Hasbro beats estimates on strong demand for Disney Princess dolls "
    },
    {
        "content": "* Terms of transaction  which closed on July 13  2016  were not disclosed",
        "date": "07132016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro buys Boulder Media Animation Studio "
    },
    {
        "content": "* To date  co has not seen a negative impact on its business after Brexit - conf call",
        "date": "07182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro has not seen negative impact on its business after Brexit - CEO "
    },
    {
        "content": "* Hasbro Inc qtrly girls category revenue $172.3 million versus $127.5 million",
        "date": "07182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro Q2 earnings per share $0.41 "
    },
    {
        "content": "July 18 Toymaker Hasbro Inc's quarterly revenue rose 10.2 percent  driven by strong demand for its Disney Princess and Frozen dolls and its action figures based on \"Star Wars\" movies.",
        "date": "07182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Toymaker Hasbro's quarterly revenue rises 10 pct "
    },
    {
        "content": "* Danish toymaker LEGO plans to spend more than 1 billion Danish crowns ($148.7 million) on new headquarters as it aims to keep up with the strong growth it's seen in recent years",
        "date": "07062016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "LEGO to build new headquarters to cope with strong growth "
    },
    {
        "content": "* Says Hope Cochran and Mary Beth West join Hasbro's board of directors  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06282016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro Inc says Hope Cochran and Mary Beth West to join board of directors "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.51 per share  Source text for Eikon:  Further company coverage:",
        "date": "05192016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro sets qtrly cash dividend of $0.51/share "
    },
    {
        "content": "April 26 Comcast Corp  the largest U.S. cable operator  is in talks to buy Hollywood studio owner DreamWorks Animation SKG Inc for more than $3 billion  The Wall street Journal reported  citing people familiar with the matter.",
        "date": "04272016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 1-Comcast in talks to buy DreamWorks Animation for more than $3 bln - WSJ "
    },
    {
        "content": "NEW YORK  April 18 The Dow Jones industrial average climbed to a nine-month high on Monday  as Hasbro and Disney shares lifted the consumer discretionary sector while investors braced for a flurry of quarterly earnings reports through the week.",
        "date": "04182016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "US STOCKS SNAPSHOT-Disney  Hasbro lift Wall St as earnings heat up "
    },
    {
        "content": "* Indexes up: Dow 0.49 pct  S&P 0.52 pct  Nasdaq 0.34 pct   (Updates to afternoon  adds detail throughout)",
        "date": "04182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS-Dow reclaims 18 000 as quarterly reports begin to flow "
    },
    {
        "content": "* Indexes up: Dow 0.57 pct  S&P 0.56 pct  Nasdaq 0.31 pct   (Updates to early afternoon)",
        "date": "04182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS-Wall St rises on oil recovery  gains in Hasbro  Disney "
    },
    {
        "content": "* Indexes up: Dow 0.28 pct  S&P 0.32 pct  Nasdaq 0.26 pct   (Adds details  changes comment  updates prices)",
        "date": "04182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS-Wall St reverses course as oil pares losses "
    },
    {
        "content": "* Shares up 4.2 pct   (Adds comment from conference call; updates share move)",
        "date": "04182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 3-Disney princesses  Star Wars propel Hasbro results "
    },
    {
        "content": "Hasbro Inc   the No. 2 U.S. toymaker  reported better-than-expected quarterly profit and revenue  driven by strong demand for \"Star Wars\" action figures and the addition of Disney Princess dolls to its basket of toys.",
        "date": "04182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Disney princesses  Star Wars propel Hasbro results "
    },
    {
        "content": "* Q1 earnings per share view $0.24 -- Thomson Reuters I/B/E/S",
        "date": "04182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "BRIEF-Hasbro reports Q1 earnings per share $0.38 "
    },
    {
        "content": "April 18Hasbro Inc's quarterly revenue rose 16.5 percent  driven by the success of toys based on Hollywood blockbuster \"Star Wars: The Force Awakens\" and popular Disney Princesses.",
        "date": "04182016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Toymaker Hasbro's quarterly revenue rises 16.5 pct "
    },
    {
        "content": "Feb 25 Having captivated boys with its Star Wars figures  Hasbro Inc is turning to Disney Princesses and the launch of its first animated movie to arrest a five-quarter slump in sales of its toys for girls.",
        "date": "02252016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Ponies and princesses: Hasbro launches charm offensive for girls "
    },
    {
        "content": "Hasbro Inc  reported its biggest rise in quarterly revenue in nearly five years  handily beating analysts' estimates  driven by demand for toys based on the \"Star Wars: The Force Awakens\" and \"Jurassic World\" movies. | Video ",
        "date": "02082016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Star Wars powers Hasbro's strongest growth in nearly five years "
    },
    {
        "content": "* Company raises dividend to $0.51/share   (Adds CEO comment  background; updates shares)",
        "date": "02082016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 3-Star Wars powers Hasbro's strongest growth in nearly 5 years "
    },
    {
        "content": "Feb 4 U.S. toymakers Mattel Inc and Hasbro Inc have held talks about a possible merger  Bloomberg reported on Thursday  citing people familiar with the matter.",
        "date": "02042016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "UPDATE 2-Toymakers Mattel  Hasbro held talks on possible merger-Bbg "
    },
    {
        "content": "Feb 8 Hasbro Inc's quarterly revenue jumped 12.8 percent  helped by strong holiday demand for toys based on \"Star Wars: The Force Awakens\" and \"Jurassic World\" movies  which were released last year.",
        "date": "02082016",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Toymaker Hasbro's quarterly revenue rises 12.8 pct "
    },
    {
        "content": "U.S. toymakers Mattel Inc  and Hasbro Inc  have held talks about a possible merger  Bloomberg reported on Thursday  citing people familiar with the matter. | Video ",
        "date": "02052016",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Toymakers Mattel  Hasbro held talks on possible merger: Bloomberg "
    },
    {
        "content": "Fox News anchorwoman Harris Faulkner  who took toy company Hasbro Inc to court for allegedly portraying her as a plastic hamster  has urged a federal judge to reject Hasbro's attempt to throw out one of the main claims in her $5 million lawsuit.",
        "date": "12082015",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Fox News anchor slams Hasbro's attempt to narrow $5 mln suit "
    },
    {
        "content": "Toymaker Hasbro Inc  reported lower-than-expected quarterly revenue  hurt by a strong dollar and lower sales of its games and toys for girls.",
        "date": "10192015",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Hasbro revenue misses as sales of games  girls' toys fall further "
    },
    {
        "content": "* Shares fall as much as 8.2 pct   (Adds analysts comments  details from conference call; updates shares)",
        "date": "10192015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 2-Hasbro revenue misses as sales of games  girls' toys fall further "
    },
    {
        "content": "Oct 19 Hasbro Inc reported a 15 percent rise in quarterly profit as toys based on \"Star Wars\" and \"Jurassic World\" movie series boosted sales of its toys targeted at boys.",
        "date": "10192015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Toymaker Hasbro's quarterly profit rises 15 pct "
    },
    {
        "content": "From T-Rex to Yoda  Hasbro  has its toy cupboard full for the next two years.",
        "date": "07202015",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "The Force is with Hasbro as movie licenses power sales "
    },
    {
        "content": "* Shares rise as much as 11 pct to record-high   (Recasts throughout  adds analysts' comments  updates shares)",
        "date": "07202015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 2-The Force is with Hasbro as movie licenses power sales "
    },
    {
        "content": "July 20 U.S. toymaker Hasbro Inc  reported a near 4 percent fall in quarterly revenue  hurt by the strong dollar.",
        "date": "07202015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Toymaker Hasbro's sales fall 4 pct due to strong dollar "
    },
    {
        "content": "July 1 Toy maker Hasbro Inc is bringing the Monopoly board game to the silver screen  in a movie about a boy's quest to make his fortune and avoid jail time.",
        "date": "07012015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Hasbro  Lions Gate to roll dice with Monopoly movie "
    },
    {
        "content": "* Royal Caribbean falls as strong dollar hurts onboard spending",
        "date": "04202015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS-Wall St rallies on China stimulus ahead of tech earnings "
    },
    {
        "content": "* Royal Caribbean falls as strong dollar hurts onboard spending",
        "date": "04202015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS-Wall St rallies on China stimulus  cautious earnings optimism "
    },
    {
        "content": "* Indexes up: Dow 1.4 pct  S&P 1 pct  Nasdaq 1.2 pct   (Updates to midday)",
        "date": "04202015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS-Wall St rallies on China stimulus  earnings "
    },
    {
        "content": "* Indexes up: Dow 1.3 pct  S&P 0.9 pct  Nasdaq 0.9 pct   (Updates to morning trading)",
        "date": "04202015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS-Wall St bounces back with eyes on earnings  China "
    },
    {
        "content": "Hasbro Inc  reported a surprise rise in quarterly revenue  helped by strong sales of boys' toys such as those based on characters in Transformers movies and Marvel Comics  sending its shares up about 8 percent in early trading.",
        "date": "04202015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Superheroes power Hasbro's surprise revenue rise "
    },
    {
        "content": "* Shares rise 8 pct   (Adds details  analyst quote  updates shares)",
        "date": "04202015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 2-Superheroes power Hasbro's surprise revenue rise "
    },
    {
        "content": "* Futures up: Dow 103 pts  S&P 10 pts  Nasdaq 17 pts   (Updates prices  adds comment)",
        "date": "04202015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS-Wall St to rise at open with eyes on China  earnings "
    },
    {
        "content": "NEW YORK  April 20 U.S. stock index futures rose on Monday  following a sharp decline in the previous session  as Chinese steps to stimulate its slowing economy and earnings including those from Morgan Stanley lured money back into equities.",
        "date": "04202015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "US STOCKS-Futures bounce back with eyes on China  Morgan Stanley "
    },
    {
        "content": "Sequels to \"Star Wars\"  \"The Avengers\" and \"Jurassic Park\" movies are expected to boost Hasbro Inc's  sales this year  helping the toymaker to further narrow the lead of Mattel Inc   its bigger rival.",
        "date": "02102015",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Toymaker Hasbro to further close gap with Mattel in 2015 "
    },
    {
        "content": "Feb 9 Sequels to \"Star Wars\"  \"The Avengers\" and \"Jurassic Park\" movies are expected to boost Hasbro Inc's  sales this year  helping the toymaker to further narrow the lead of Mattel Inc  its bigger rival.",
        "date": "02102015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "UPDATE 5-Toymaker Hasbro to further close gap with Mattel in 2015 "
    },
    {
        "content": "Feb 9 Sequels to \"Star Wars\"  \"The Avengers\" and \"Jurassic Park\" movies are expected to boost Hasbro Inc's  sales this year  helping the toymaker further narrow the gap with Mattel Inc  its bigger but struggling rival.",
        "date": "02092015",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "UPDATE 4-Toymaker Hasbro to further close gap with Mattel in 2015 "
    },
    {
        "content": "Hasbro Inc  reported a better-than-expected quarterly adjusted profit  helped by demand for its toys for boys based on Transformers movies and characters from Marvel comics in the holiday shopping season.",
        "date": "02092015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Transformers  Marvel toys drive Hasbro's profit beat "
    },
    {
        "content": "MEXICO CITY The world's No. 2 toymaker  Hasbro Inc  has paid $65 million to Mexican tax authorities in a settlement  a spokeswoman for the company said on Wednesday  following a probe into the company for possible for tax avoidance.",
        "date": "02042015",
        "name": "Hasbro Inc",
        "news_type": "topStory",
        "symbol": "HAS",
        "title": "Exclusive: Hasbro pays Mexico tax authorities $65 million in settlement after probe "
    },
    {
        "content": "Feb 9 Hasbro Inc  the second-largest U.S. toymaker  reported a nearly 31 percent rise in quarterly profit  helped by demand for its Transformers  Nerf and Marvel toys in the holiday shopping season.",
        "date": "02092015",
        "name": "Hasbro Inc",
        "news_type": "normal",
        "symbol": "HAS",
        "title": "Hasbro's holiday quarter profit rises about 31 pct "
    }
]