[
    {
        "content": "* HCP announces transactions to further reduce Brookdale portfolio concentration",
        "date": "11022017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP reports transactions to further reduce Brookdale portfolio concentration "
    },
    {
        "content": "* HCP announces results for the quarter ended september 30  2017",
        "date": "11022017",
        "name": "HCP Inc",
        "news_type": "normal",
        "symbol": "HCP",
        "title": "BRIEF-HCP announces Q3 FFO per share $0.33 "
    },
    {
        "content": "* Brookdale enters into multi-part transaction agreement with HCP",
        "date": "11022017",
        "name": "HCP Inc",
        "news_type": "normal",
        "symbol": "HCP",
        "title": "BRIEF-Brookdale enters into multi-part transaction agreement with HCP "
    },
    {
        "content": "* HCP announces closing of $2.0 billion credit facility Source text for Eikon: Further company coverage:",
        "date": "10192017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP announces closing of $2.0 billion credit facility "
    },
    {
        "content": "* HCP - ‍HCP's preliminary assessment indicates that its assets in impacted regions incurred either no or limited wind  flood or other storm-related damage​",
        "date": "09152017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP provides update on impact of hurricane Irma "
    },
    {
        "content": "* Announced a new organizational structure and several updates to its executive leadership team",
        "date": "08302017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP announces changes to executive leadership team "
    },
    {
        "content": "* HCP Inc - reaffirmed full-year 2017 FFO as adjusted and SPP cash NOI guidance ranges",
        "date": "08012017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP reports Q2 FFO per share $0.35 "
    },
    {
        "content": "* HCP Inc - tender offer results to purchase for cash up to an aggregate principal amount of $500 million of hcp's 5.375pct senior notes due 2021 Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP Inc says tender offer results to purchase for cash up to an aggregate principal amount of $500 million "
    },
    {
        "content": "* HCP Inc - ‍tender offer will expire at 11:59 p.m.  Eastern Time  on August 8  2017​",
        "date": "07122017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP announces tender offer for outstanding notes "
    },
    {
        "content": "* Shawn Johnston to join HCP as senior vice president and chief accounting officer Source text for Eikon: Further company coverage:",
        "date": "07112017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-Shawn Johnston to join HCP as senior vice president and chief accounting officer "
    },
    {
        "content": "* HCP Inc- for full year 2017  we expect: EPS to range between $1.43 and $1.49",
        "date": "05022017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP sees FY 2017 FFO per share $1.99 to $2.05 "
    },
    {
        "content": "* Justin Hutchens to leave HCP to become chief executive officer of UK-based operator HC-One",
        "date": "04032017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-Justin Hutchens to leave HCP to become CEO of UK-based operator HC-One "
    },
    {
        "content": "* HCP announces results for the quarter and year ended december 31  2016",
        "date": "02132017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP Inc reports qtrly FFO per share of $0.35 "
    },
    {
        "content": "* Peter Scott to join HCP as executive vice president and chief financial officer",
        "date": "01232017",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-Peter Scott to join HCP as CFO "
    },
    {
        "content": "* HCP Inc - also intends to elect Justin Hutchens  HCP's current chief investment officer  as president",
        "date": "11142016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP - Intends to elect Tom Herzog as CEO and a member of board "
    },
    {
        "content": "* HCP inc - excluding qcp  full year 2016 guidance for spp cash noi growth of 2.75% - 3.75% and spp noi growth of 1.7% - 2.7%",
        "date": "11012016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP announces Q3 FFO per share $0.65 "
    },
    {
        "content": "* Intends to use proceeds from deal primarily to pay down debt",
        "date": "11012016",
        "name": "HCP Inc",
        "news_type": "normal",
        "symbol": "HCP",
        "title": "BRIEF-Hcp to sell a portfolio of 64 brookdale communities for $1.125 billion "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 27 (Fitch) Fitch Ratings has removed HCP  Inc. from Rating  Watch Negative and affirmed the company's Issuer Default Rating (IDR) and debt  ratings at 'BBB'. The Rating Outlook is Stable. A full list of rating actions  follows at the end of this release.  KEY RATING DRIVERS The 'BBB' IDR and Stable Outlook reflect Fitch's expectation that HCP's leverage  and liquidity will stabilize pro forma following its spin-off of ",
        "date": "10272016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "Fitch Removes HCP from Rating Watch Negative; Affirms 'BBB' IDR "
    },
    {
        "content": "* board of directors approves spin-off of Quality Care Properties  Inc.",
        "date": "10132016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP board approves spin-off of Quality Care Properties Inc "
    },
    {
        "content": "* Announces pricing of debt financing by Quality Care Properties in connection with planned spin-off",
        "date": "10032016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-Hcp announces pricing of debt financing by Quality Care Properties "
    },
    {
        "content": "* Hcp inc sees for full year 2016 eps to range between $1.83 and $1.89",
        "date": "08092016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP Q2 FFO per share $0.71 "
    },
    {
        "content": "* Board of directors will initiate process of appointing a permanent CEO  which is expected to take between three and six months",
        "date": "07112016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP announces CEO transition "
    },
    {
        "content": "* Expects that spin-off will be completed in second half of 2016.",
        "date": "06172016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP expects REIT spin-off to be completed in second half of 2016 "
    },
    {
        "content": "* Says herzog will replace HCP's outgoing executive vice president and CFO  Tim Schoen",
        "date": "05122016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-Tom Herzog to join HCP as executive VP and CFO "
    },
    {
        "content": "HCP Inc  said it would spin off its beleaguered HCR ManorCare skilled nursing and assisted living business into a publicly traded real estate investment trust (REIT) to focus on assets that are less dependent on government reimbursement.",
        "date": "05092016",
        "name": "HCP Inc",
        "news_type": "normal",
        "symbol": "HCP",
        "title": "Healthcare REIT HCP to spin off troubled HCR ManorCare unit "
    },
    {
        "content": "* HCP shares rise as much as 6.8 pct   (Adds details  background)",
        "date": "05092016",
        "name": "HCP Inc",
        "news_type": "normal",
        "symbol": "HCP",
        "title": "UPDATE 2-Healthcare REIT HCP to spin off troubled HCR ManorCare unit "
    },
    {
        "content": "* HCP announces results for quarter ended March 31  2016 and expands executive leadership team",
        "date": "05092016",
        "name": "HCP Inc",
        "news_type": "normal",
        "symbol": "HCP",
        "title": "BRIEF-HCP posts Q1 adjusted FFO per share $0.69 "
    },
    {
        "content": "* To spin off HCR Manorcare portfolio into independent  publicly-traded REIT",
        "date": "05092016",
        "name": "HCP Inc",
        "news_type": "normal",
        "symbol": "HCP",
        "title": "BRIEF-HCP to spin off HCR Manorcare portfolio into publicly-traded REIT "
    },
    {
        "content": "May 9 HCP Inc said it would spin off its skilled nursing and assisted living properties into an independent  publicly-traded real estate investment trust (REIT).",
        "date": "05092016",
        "name": "HCP Inc",
        "news_type": "normal",
        "symbol": "HCP",
        "title": "HCP to spin off skilled nursing  assisted living assets into REIT "
    },
    {
        "content": "* Hcp announces cfo transition; mr. Schoen will leave to become president of biomed realty",
        "date": "03282016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP CFO Schoen will leave to become president of BioMed Realty "
    },
    {
        "content": "* Says CEO Lauralee Martin's FY 2015 total compensation $6.9 million versus $12.4 million in FY 2014 - sec filing  Source text: http://1.usa.gov/1pOSRDZ Further company coverage:",
        "date": "03172016",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "BRIEF-HCP says CEO's 2015 total compensation was $6.9 million "
    },
    {
        "content": "April 21 Healthcare real estate investment trust HCP Inc said the U.S. Department of Justice filed a lawsuit against one of its clients over the company's billing practices.",
        "date": "04212015",
        "name": "HCP Inc",
        "news_type": "normal",
        "symbol": "HCP",
        "title": "HCP says DoJ to sue client over billing practices "
    },
    {
        "content": "April 21 Healthcare real estate investment trust HCP Inc said the U.S. Department of Justice had filed a lawsuit against one of its clients over the company's billing practices.",
        "date": "04212015",
        "name": "HCP Inc",
        "news_type": "normal",
        "symbol": "HCP",
        "title": "UPDATE 1-HCP says DoJ to sue client over billing practices "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 15 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to the  $600 million aggregate principal amount of 3.40% senior unsecured notes due 2025  and the GBP220 million unsecured term loan due 2019 issued by HCP  Inc. (NYSE:  HCP). The 2025 notes were issued at 99.185% of par value to yield 3.497% or 160  basis points (bps) over the benchmark rate. The term loan bears interest at GBP  LIBOR plus 97.5 bps and HCP entered ",
        "date": "01152015",
        "name": "HCP Inc",
        "news_type": "topStory",
        "symbol": "HCP",
        "title": "Fitch Rates HCP's Sr Unsecured Notes Due 2025 and GBP Term Loan 'BBB+' "
    }
]