[
    {
        "content": "* The Home Depot declares third quarter dividend of 89 cents Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Home Depot declares Q3 dividend of 89 cents "
    },
    {
        "content": "Home Depot Inc   the largest U.S. home improvement chain   on Tuesday raised its full-year profit and sales forecast after Hurricanes Harvey and Irma spurred demand for generators  flashlights and rebuilding materials. | Video ",
        "date": "11142017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Home Depot lifts full-year forecasts as hurricanes spur demand "
    },
    {
        "content": "* Hurricanes add $282 mln to comp sales (Adds CFO comment from conference call  background; updates share move)",
        "date": "11142017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 4-Home Depot lifts full-year forecasts as hurricanes spur demand "
    },
    {
        "content": "* On conf call - online sales rose about 19 percent in q3  now representing about 6.2% of total sales",
        "date": "11142017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot CFO- Don't see housing market slowdown in 2018  2019 and 2020 "
    },
    {
        "content": "* The Home Depot announces third quarter results; updates fiscal year 2017 guidance",
        "date": "11142017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot says Q3 earnings per share $1.84 "
    },
    {
        "content": "Nov 14 Home Depot Inc  the largest U.S. home improvement chain  reported a 10 percent jump in third-quarter profit on Tuesday  lifted by demand from customers looking to repair their homes damaged by hurricanes Harvey and Irma.",
        "date": "11142017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot's quarterly profit jumps 10 pct "
    },
    {
        "content": "* Outlet converters recalled by Ningbo Litesun Electric with Home Depot due to shock and fire hazards",
        "date": "10102017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-U.S. CPSC says outlet converters recalled by Ningbo Litesun Electric with Home Depot "
    },
    {
        "content": "Sept 12 Industry-wide retail sales in August and September will fall in the wake of hurricanes Harvey and Irma  with apparel retailers such as Gap Inc expected to take a longer-term hit than restaurant operators including Starbucks Corp.",
        "date": "09122017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Harvey  Irma to hit US apparel retailers more than restaurants "
    },
    {
        "content": "CHICAGO  Sept 6 Home improvement retailers Home Depot Inc and Lowe's Inc said on Wednesday they have started shipping emergency material to Florida in anticipation of Hurricane Irma  even as they continue recovery efforts after Hurricane Harvey in Texas.",
        "date": "09062017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "UPDATE 1-Home Depot  Lowe's ship emergency material to Florida ahead of hurricane "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 05 (Fitch) Fitch Ratings has assigned an 'A' rating to The Home Depot  Inc.'s proposed issuance of senior unsecured notes  which Fitch expects could be for up to $1 billion. The proceeds from the issue will be used for repayment of $500 million of maturing debt and general corporate purposes  including share repurchases. A full list of ratings follows at the end of this release. KEY RATING DRIVERS The rating reflects",
        "date": "09052017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Fitch Rates The Home Depot  Inc.'s Proposed Sr. Unsecured Notes 'A' "
    },
    {
        "content": "* Home Depot Inc files preliminary prospectus supplement with U.S. SEC related to a potential notes offering - SEC filing‍​ Source text (http://bit.ly/2vHCDUE) Further company coverage:",
        "date": "09052017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot files preliminary prospectus supplement with U.S. sec related to potential notes offering "
    },
    {
        "content": "Almost three days before Hurricane Harvey hit Texas  hardware retailer Home Depot Inc received an alert from a weather service and activated its disaster-response plan to get supplies to those in the storm's path  while turning a profit  too. | Video ",
        "date": "08312017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "As Harvey gained fury  Home Depot raced to respond "
    },
    {
        "content": "Aug 31 Almost three days before Hurricane Harvey hit Texas  hardware retailer Home Depot Inc received an alert from a weather service and activated its disaster-response plan to get supplies to those in the storm's path  while turning a profit  too.",
        "date": "08312017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 1-As Harvey gained fury  Home Depot raced to respond "
    },
    {
        "content": "Home Depot has agreed to pay $5.7 million to settle charges by the Consumer Product Safety Commission that it sold nearly 3 000 recalled items in its stores  according to an entry in the Federal Register published on Tuesday.",
        "date": "08302017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Home Depot to enter $5.7 mln settlement over recalled products "
    },
    {
        "content": "Aug 31 Almost three days before Hurricane Harvey hit Texas  hardware retailer Home Depot Inc received an alert from a weather service and activated its disaster-response plan to get supplies to those in the storm's path  while turning a profit  too.",
        "date": "08312017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "CORRECTED-As Harvey gained fury  Home Depot raced to respond "
    },
    {
        "content": "* Dow off 0.17 pct  S&P up 0.12 pct  Nasdaq up 0.17 pct (Updates prices  changes comment  byline)",
        "date": "08282017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Energy  bank shares weigh on Wall St as Harvey pummels Texas "
    },
    {
        "content": "* Indexes up: Dow 0.08 pct  S&P 0.18 pct  Nasdaq 0.21 pct (Updates to open)",
        "date": "08282017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St edges up as health  home improvement chains climb "
    },
    {
        "content": "* Futures up: Dow 22 pts  S&P 3.75 pts  Nasdaq 1.25 pts (Adds details  comments  updates price)",
        "date": "08282017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St set for higher open; Harvey puts energy in focus "
    },
    {
        "content": "Days before Hurricane Harvey barreled into the Texas coast on Friday  home improvement retailers were preparing truckloads of lumber  shingles and other materials that property owners in the storm-raked communities will need to rebuild.",
        "date": "08282017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Harvey disrupts business  but some set to benefit "
    },
    {
        "content": "Aug 27 Days before Hurricane Harvey barreled into the Texas coast on Friday  home improvement retailers were preparing truckloads of lumber  shingles and other materials that property owners in the storm-raked communities will need to rebuild.",
        "date": "08282017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 1-Harvey disrupts business  but some set to benefit "
    },
    {
        "content": "* Sets quarterly dividend of $0.89per share Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Home Depot sets quarterly dividend of $0.89 per share "
    },
    {
        "content": "* Home Depot Inc - ‍Home Depot converting 50 rooftops to solar farms​ Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-‍Home Depot converting 50 rooftops to solar farms​ "
    },
    {
        "content": "NEW YORK  Aug 15 U.S. stocks ended little changed on Tuesday as declines in Home Depot and other retailers following results offset upbeat U.S. retail sales data.",
        "date": "08152017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "US STOCKS SNAPSHOT-Wall Street ends flat as Home Depot drags "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P up 0.01 pct  Nasdaq down 0.1 pct (Updates to late afternoon)",
        "date": "08152017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St steady; economic data offsets retailer results "
    },
    {
        "content": "Home Depot Inc  raised its full-year forecasts but concerns over a looming slowdown in the U.S. housing market due to supply constraints weighed on the retailer's stock. | Video ",
        "date": "08152017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Looming housing slowdown clouds Home Depot's strong results "
    },
    {
        "content": "* Shares fall as much as 3.9 percent to $148.30 (Adds Breakingviews link)",
        "date": "08152017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 5-Looming housing slowdown clouds Home Depot's strong results "
    },
    {
        "content": "* Indexes up: Dow 0.04 pct  S&P 0.01 pct  Nasdaq 0.05 pct (Updates to early afternoon)",
        "date": "08152017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St little changed as discretionary stocks weigh "
    },
    {
        "content": "* On conf call- pro sales once again outpaced diy sales in Q2",
        "date": "08152017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot on conf call- Q2 big-ticket transactions up 12.4% "
    },
    {
        "content": "* Dow up 0.03 pct  S&P off 0.05 pct  Nasdaq down 0.08 pct (Adds details  changes comment  updates prices)",
        "date": "08152017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St little changed as retail  energy stocks weigh "
    },
    {
        "content": "* Indexes up: Dow 0.13 pct  S&P 0.05 pct  Nasdaq 0.02 pct (Updates to open)",
        "date": "08152017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St opens flat as North Korea tensions fade "
    },
    {
        "content": "* The Home Depot announces second quarter results; updates fiscal year 2017 guidance",
        "date": "08152017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot Q2 earnings per share $2.25 "
    },
    {
        "content": "* Dow off 0.08 pct  S&P up 0.08 pct  Nasdaq up 0.16 pct (Updates to early afternoon)",
        "date": "07202017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-S&P  Dow flat as retailers weigh; Nasdaq edges higher "
    },
    {
        "content": "* Acquisition of Centaur Media Plc's Home Interest division for an enterprise value of £32m and placing to raise £22m",
        "date": "07072017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Future Plc to buy Centaur Media's Home Interest division "
    },
    {
        "content": "* The Home Depot agrees to purchase Compact Power Equipment  Inc",
        "date": "07062017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-The Home Depot agrees to purchase Compact Power Equipment Inc "
    },
    {
        "content": "* Lumicentro Internacional with Home Depot recalls about 10 500 crystal chandeliers due to fire & burn hazards",
        "date": "07052017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-U.S. CPSC says Lumicentro Internacional with Home Depot recalls about 10 500 crystal chandeliers "
    },
    {
        "content": "* Has determined to divest its 'your Home Depot' (YHD) business",
        "date": "05292017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Harris Technology says it has determined to divest its 'Your Home Depot' business "
    },
    {
        "content": "Lowe's Cos Inc   the No. 2 U.S. home improvement retailer  reported quarterly profit and comparable sales that missed analysts' estimates  in contrast to the strong results reported by larger rival Home Depot Inc  last week. | Video ",
        "date": "05242017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Lowe's results disappoint in contrast to rival Home Depot "
    },
    {
        "content": "* Home Depot's sales  profit beat analysts estimates last week",
        "date": "05242017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "REFILE-UPDATE 3-Lowe's results disappoint in contrast to rival Home Depot "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 24 (Fitch) Fitch Ratings has assigned an 'A' rating to The Home Depot  Inc.'s (Home Depot) proposed issuance of senior unsecured notes  which Fitch expects could be for up to $2 billion. The proceeds from the issue will be used for general corporate purposes  including share repurchases. A full list of ratings follows at the end of this release. KEY RATING DRIVERS The rating reflects Home Depot's strong track record of com",
        "date": "05242017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Fitch Rates The Home Depot  Inc.'s Proposed Sr. Unsecured Notes 'A' "
    },
    {
        "content": "* Files preliminary prospectus supplement related to a 3-part notes offering Source text: (http://bit.ly/2rTEtvj) Further company coverage:",
        "date": "05242017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot files preliminary prospectus supplement related to a 3-part notes offering "
    },
    {
        "content": "U.S. home improvement retailer Lowe's Cos Inc  said it would buy Maintenance Supply Headquarters  a wholesale retailer of maintenance supplies  for $512 million  as it seeks to sell more to construction contractors.",
        "date": "05182017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Lowe's to buy maintenance supplies retailer for $512 million "
    },
    {
        "content": "Home Depot Inc's  first-quarter profit and same-store sales topped estimates as customers spent more on expensive items such as appliances and flooring and roofing materials. | Video ",
        "date": "05162017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Home Depot's profit tops on higher sales of big-ticket items "
    },
    {
        "content": "* Shares hit record high at $160.83 (Adds details from conference call  updates shares)",
        "date": "05162017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 3-Home Depot's profit tops on higher sales of big-ticket items "
    },
    {
        "content": "* On conf call- Q1  Interline sales growth outpaced the company average",
        "date": "05162017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot on conf call- Q1 drivers behind increase in big-ticket purchases were appliances  flooring and roofing "
    },
    {
        "content": "* Futures up: Dow 33 pts  S&P 1.75 pt  Nasdaq 6.5 pts (Adds details  comments  updates prices)",
        "date": "05162017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St on track to open at record highs "
    },
    {
        "content": "* The Home Depot announces first quarter results; updates fiscal year 2017 guidance",
        "date": "05162017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot posts Q1 earnings per share $1.67 "
    },
    {
        "content": "May 16 Home Depot Inc  the No. 1 U.S. home improvement chain  reported a 12 percent rise in quarterly profit on Tuesday  helped by higher customer traffic and more average spending at its stores amid a strong housing market.",
        "date": "05162017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot's quarterly profit jumps 12 pct "
    },
    {
        "content": "April 28 Tesla Inc on Friday said that its subsidiary SolarCity will curtail door-to-door sales of rooftop solar installations over the next month as Tesla seeks to absorb the company into its high-end brand.",
        "date": "04282017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Tesla says it will stop selling solar door-to-door "
    },
    {
        "content": "* Home Depot Inc - CEO Craig Menear's total compensation for 2016 was $11.5 million versus $11.6 million in 2015 - SEC filing",
        "date": "04032017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Home Depot says CEO Craig Menear's total compensation for 2016 was $11.5 mln vs $11.6 mln in 2015 - SEC filing "
    },
    {
        "content": "March 24 A federal appeals court on Friday said Home Depot Inc must face a lawsuit claiming that the retailer's negligence led to a supervisor's murdering a pregnant employee by strangulation and raping her corpse.",
        "date": "03242017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot must again face lawsuit over employee's murder -US court "
    },
    {
        "content": "A federal appeals court on Friday said Home Depot Inc must face a lawsuit claiming that the retailer's negligence led to a supervisor's murdering a pregnant employee by strangulation and raping her corpse.",
        "date": "03242017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot must again face lawsuit over employee's murder: U.S. court "
    },
    {
        "content": "* Home Depot - in Jan 2017  co became aware of investigation by EPA's criminal investigation division into co’s compliance with lead-safe work practices",
        "date": "03242017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot says became aware of EPA investigation into co's compliance with lead-safe work practices in Jan "
    },
    {
        "content": "* Ordinary dividend of 2.50 euros per share (fy 2015: 2.25 euros) and an extraordinary dividend of 5.00 euros per share  Source text for Eikon:  Further company coverage:  ($1 = 0.9477 euros)   (Gdynia Newsroom)",
        "date": "03092017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Bet At Home Com plans to pay dividend of 7.50 euros/shr "
    },
    {
        "content": "* Shares rise as much as 11.4 pct to $82.85   (Adds CEO comment  details from conference call)",
        "date": "03012017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 4-Lowe's forecasts strong sales growth this year  shares soar "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 22 (Fitch) Fitch Ratings has affirmed its Long-Term Issuer  Default Rating (IDR) for The Home Depot  Inc. (Home Depot) at 'A'. The Rating  Outlook is Stable. A full list of ratings follows at the end of this release. KEY RATING DRIVERS The rating reflects Home Depot's strong track record of comparable store sales  (comps) growth  margin expansion and cash flow generation. Fitch expects the  company to maintain leverag",
        "date": "02222017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Fitch Affirms The Home Depot  Inc.'s IDR at 'A'; Outlook Stable "
    },
    {
        "content": "Home Depot Inc  reported higher-than-expected quarterly profit and sales  boosted by a strong housing market in the United States  and set a $15 billion share repurchase program.",
        "date": "02212017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Home Depot's profit beat  $15 billion buyback lift shares to new high "
    },
    {
        "content": "* Shares rise as much as 2 pct to record high   (Adds details  background  CEO and analyst comment; updates shares)",
        "date": "02212017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 3-Home Depot's profit beat  $15 bln buyback lift shares to new high "
    },
    {
        "content": "* Futures up: Dow 61 pts  S&P 4.5 pts  Nasdaq 9 pts   (Adds details  comment  updates prices)",
        "date": "02212017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St to open near record-highs on strong retail earnings "
    },
    {
        "content": "* The Home Depot announces fourth quarter and fiscal 2016 results;",
        "date": "02212017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot Q4 EPS $1.44 "
    },
    {
        "content": "Feb 21 Home Depot Inc  the world's largest home improvement chain  reported a 5.8 percent rise in quarterly sales on Tuesday as more customers visited its stores in the United States  and said it would repurchase shares worth $15 billion.",
        "date": "02212017",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "REFILE-Home Depot's quarterly sales rise 5.8 pct "
    },
    {
        "content": "* Home depot - energy purchased from wind farm is enough to power 100 home depot stores for year while also providing $150 000 in local community benefits",
        "date": "01312017",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-The Home Depot taps Texas wind farm for renewable energy "
    },
    {
        "content": "Lowe's Cos Inc   the No. 2 U.S. home improvement chain  reported disappointing quarterly results and tempered its full-year forecast as fewer of its do-it-yourself customers remodeled homes due to an unseasonably hot fall season.",
        "date": "11162016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Lowe's third-quarter results disappoint  in contrast to rival Home Depot "
    },
    {
        "content": "* Sets quarterly dividend of $0.69per share  Source text for Eikon:  Further company coverage:",
        "date": "11172016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Home Depot sets quarterly dividend of $0.69per share "
    },
    {
        "content": "* Lowe's shares drop 5.6 pct  Home Depot up 0.5 pct   (Adds CEO and analyst comments; updates shares)",
        "date": "11162016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 3-Lowe's Q3 results disappoint  in contrast to rival Home Depot "
    },
    {
        "content": "Home Depot Inc   the No. 1 U.S. home improvement chain  did not lift its full-year sales forecast  implying a weaker-than-expected fourth quarter amid an improving housing market and higher consumer spending in the United States. | Video ",
        "date": "11152016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Home Depot maintains full-year sales forecast  disappointing investors "
    },
    {
        "content": "WASHINGTON  Nov 15 U.S. retail sales rose more than expected in October as households bought motor vehicles and a range of other goods  pointing to sustained economic strength that could allow the Federal Reserve to raise interest rates next month.",
        "date": "11152016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "WRAPUP 3-Strong U.S. retail sales reinforce December interest rate hike "
    },
    {
        "content": "* CEO on conf call-  Buy online deliver from store remains on track to be rolled out by end of fiscal year",
        "date": "11152016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot CFO- expect to repurchase approximately $2.4 billion of outstanding shares in fourth quarter "
    },
    {
        "content": "* Shares fall 3 pct  reversing course from premarket   (Adds details from conference call  analyst comments)",
        "date": "11152016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 4-Home Depot maintains full-year sales forecast  disappointing investors "
    },
    {
        "content": "* Fy earnings per share view $6.33  revenue view $94.16 billion -- Thomson Reuters I/B/E/S",
        "date": "11152016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot Q3 EPS $1.60 "
    },
    {
        "content": "Nov 15 Home Depot Inc  the No. 1 U.S. home improvement chain  reported a 6.1 percent rise in quarterly sales  helped by higher traffic and more spending at its stores.",
        "date": "11152016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot quarterly sales rise 6.1 pct "
    },
    {
        "content": "* 9-month gross betting and gaming revenue increased by 14.7 pct to 100.4 million euros ($110.94 million)",
        "date": "11072016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-bet-at-home.com 9-month gross betting and gaming revenue up 14.7 pct at 100.4 mln euros "
    },
    {
        "content": "* Jeff Boyd is interim chief executive officer and president of Priceline Group  Inc",
        "date": "10062016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-The Home Depot names Jeff Boyd to its board of directors "
    },
    {
        "content": "* S&P - Home Depot Inc.'s proposed senior unsecured notes rated 'A'  Source text (http://bit.ly/2c4GJbI) Further company coverage:",
        "date": "09062016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-S&P says Home Depot Inc.'s proposed senior unsecured notes rated 'A' "
    },
    {
        "content": "* Fitch rates Home Depot  Inc.'s proposed Sr. unsecured notes 'A'  Source text for Eikon:",
        "date": "09062016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Fitch rates Home Depot Inc.'s proposed Sr. unsecured notes 'A' "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 06 (Fitch) Fitch Ratings has assigned an 'A' rating to The  Home Depot  Inc.'s (Home Depot) proposed issuance of senior unsecured notes. The  approximately $2 billion of expected proceeds from the issue will primarily be  used for general corporate purposes including share repurchases. A full list of  ratings follows at the end of this release. KEY RATING DRIVERS The rating reflects Home Depot's strong track record o",
        "date": "09062016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Fitch Rates The Home Depot  Inc.'s Proposed Sr. Unsecured Notes 'A' "
    },
    {
        "content": "* Shares fall as much as 6.8 pct to $75.90   (Adds details from conference call  analyst comment; updates shares)",
        "date": "08172016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 2-Lowe's sales miss estimates as short spring hurts "
    },
    {
        "content": "Home Depot Inc  reported a 9.3 percent rise in quarterly profit and boosted its full-year earnings forecast as it kept a tight lid on costs  while benefiting from a strong U.S. housing market. | Video ",
        "date": "08162016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Home Depot lifts profit forecast as housing market strengthens "
    },
    {
        "content": "* Home Depot declares second quarter dividend of 69 cents  Source text for Eikon:  Further company coverage:",
        "date": "08182016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Home Depot declares Q2 dividend of 69 cents "
    },
    {
        "content": "* 2nd-qtr sales up 6.6 pct   (Adds details from conference call; updates shares)",
        "date": "08162016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 3-Home Depot lifts profit forecast as housing market strengthens "
    },
    {
        "content": "* On conf call - 'buy online  pickup in store' rollout expected to be completed by end of fiscal year",
        "date": "08162016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot CFO- \"Encouraged by strength of core business as housing market continues to recover\" "
    },
    {
        "content": "Aug 16 Home Depot Inc raised its full-year earnings forecast after reporting a 6.6 percent rise in quarterly sales as customers spent more in a strong housing market.",
        "date": "08162016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "CORRECTED-UPDATE 1-Home Depot raises full-year profit forecast "
    },
    {
        "content": "* Q2 earnings per share view $1.97 -- Thomson Reuters I/B/E/S",
        "date": "08162016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot Q2 EPS $1.97 "
    },
    {
        "content": "NEW YORK  July 7 Fund managers on the hunt for dividends find themselves wading into the shares of consumer companies that typically attract investors looking for growth instead.",
        "date": "07072016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Dividend-focused fund managers find more appeal in U.S. consumer stocks "
    },
    {
        "content": "LOS ANGELES  June 20 California's power grid operators warned homes and businesses on Monday to conserve electricity as rising demand for air conditioning stoked by a record-setting heat wave across the U.S. Southwest tested the region's generating capacity.",
        "date": "06212016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 4-Heat wave tests Southern California's power grid amid gas shortage "
    },
    {
        "content": "NEW YORK  June 24 Britain's unexpected decision to leave the European Union spurred a global stock market selloff that has inspired some opportunistic U.S. investors to move in the opposite direction.",
        "date": "06242016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Amid 'Brexit' selloff  some fund managers are bargain shopping "
    },
    {
        "content": "* Betclic Everest Group SAS  majority shareholder  notified of its intention to replace up to 350 000 shares  corresponding to approx. 10 pct of bet-at-home.com AG's share capital  with institutional investors within scope of a structured process",
        "date": "06152016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-bet-at-home: replacement of shares by majority shareholder "
    },
    {
        "content": "* Sets quarterly dividend of $0.69 per share    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05192016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Home Depot sets quarterly dividend of $0.69 per share "
    },
    {
        "content": "Lowe's Cos Inc  followed larger rival Home Depot Inc  in reporting better-than-expected quarterly sales as strength in the U.S. housing market and favorable weather powered demand for building and home renovation products.",
        "date": "05182016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Lowe's sales beat estimates; shares hit record high "
    },
    {
        "content": "U.S. consumer prices likely picked up in April on rising gasoline and rental costs  pointing to a steady increase in inflation that could allow the Federal Reserve to raise interest rates later this year. The consumer price index likely increased 0.3 percent last month  according to a Reuters survey of economists  after edging up 0.1 percent in March. Excluding food and energy  the so-called core CPI is forecast to rise 0.2 percent after March's 0.1 percent increase. (0830/1230) Housing starts a",
        "date": "05162016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "What to Watch in the Day Ahead - Tuesday  May 17 "
    },
    {
        "content": "A.G. Schneiderman announces settlement with home depot and lowe's over alleged widespread violations of state law protecting new york waters",
        "date": "05182016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-A.G. Schneiderman settles with Home Depot and Lowe's over alleged violations of state law protecting New York waters "
    },
    {
        "content": "NEW YORK  May 16 Former SAC executive Gabe Plotkin's Melvin Capital took a new position in streaming video service Netflix Inc  buying 950 000 shares and a call option for 1.45 million shares  according to regulatory filings on Monday. Hoplite Capital also took a new position in Netflix  buying 236 456 shares  while Blue Ridge took a new position  buying 1.4 million shares.",
        "date": "05162016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "HIGHLIGHTS-Top U.S. hedge funds bet on Netflix  Yahoo  consumer stocks "
    },
    {
        "content": "NEW YORK  May 17 Wall Street sold off on Tuesday as investors boosted their bets on the Federal Reserve raising rates later this year  while Home Depot dragged on indexes following its quarterly report.",
        "date": "05172016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "US STOCKS SNAPSHOT-Wall St falls on rate hike jitters  Home Depot "
    },
    {
        "content": "NEW YORK Former SAC executive Gabe Plotkin's Melvin Capital took a new position in streaming video service Netflix Inc  buying 950 000 shares and a call option for 1.45 million shares  according to regulatory filings on Monday. Melvin Capital also took a new position in Home Depot Inc  buying 475 000 shares. And Passport Capital added 3.3 million Yahoo Inc shares  upping its stake by 243 percent  filings show.",
        "date": "05162016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Highlights: Top U.S. hedge funds bet on Alphabet  Netflix and retailers "
    },
    {
        "content": "Home Depot Inc  boosted its sales and profit forecasts for the year on Tuesday after a stronger-than-expected first quarter  driven by a healthy housing market and favorable weather that encouraged Americans to spruce up their homes. | Video ",
        "date": "05172016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot raises forecasts after strong start to the year "
    },
    {
        "content": "* Indexes down: Dow 1.01 pct  S&P 0.96 pct  Nasdaq 1.13 pct   (Updates with late afternoon trading)",
        "date": "05172016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St sells off as rate hike expectations rise "
    },
    {
        "content": "* 1st-qtr U.S. comparable sales rise 7.4 pct vs. est. 4.9 pct",
        "date": "05172016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 7-Home Depot raises forecasts after strong start to the year "
    },
    {
        "content": "* CEO - \"weather had somewhat of a positive impact ...and certainly drove variability in demand   Q1 was not an early spring story\"",
        "date": "05172016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot CEO on conf call- Believe housing data indicates continued tailwinds for our business "
    },
    {
        "content": "* 1st-qtr U.S. comparable sales rise 7.4 pct vs. est. 4.9 pct",
        "date": "05172016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "CORRECTED-UPDATE 4-Home Depot raises forecasts after strong start to the year "
    },
    {
        "content": "* The Home Depot announces first quarter results; raises fiscal year 2016 guidance",
        "date": "05172016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "BRIEF-Home Depot posts Q1 earnings per share $1.44 "
    },
    {
        "content": "May 17 Home Depot Inc  the world's biggest home improvement chain  reported a 9 percent rise in quarterly sales  saying that inconsistent weather drove demand across the board.",
        "date": "05172016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot's quarterly sales jump 9 pct "
    },
    {
        "content": "* Says CEO Craig A. Menear's total compensation for FY 2015 was $11.6 million versus $10.2 million in FY 2014 - SEC filing",
        "date": "04042016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Home depot says CEO Craig A. Menear's 2015 compensation was $11.6 mln "
    },
    {
        "content": "SAN FRANCISCO  March 30 Amazon.com Inc  said on Wednesday customer orders for home services like plumbing and mounting TVs had increased 20 percent per month on average since the online retailer launched the platform last year.",
        "date": "03302016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Amazon says home services orders grew 20 pct per month since launch "
    },
    {
        "content": "Home Depot Inc  agreed to pay at least $19.5 million to compensate U.S. consumers harmed by a 2014 data breach affecting more than 50 million cardholders.",
        "date": "03082016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot settles consumer lawsuit over big 2014 data breach "
    },
    {
        "content": "March 8 Home Depot Inc agreed to pay at least $19.5 million to compensate U.S. consumers harmed by a 2014 data breach affecting more than 50 million cardholders.",
        "date": "03082016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 3-Home Depot settles consumer lawsuit over big 2014 data breach "
    },
    {
        "content": "March 8 Home Depot Inc has agreed to pay $13 million to compensate consumers affected by a 2014 data breach in which payment card and other personal data was stolen from tens of millions of people.",
        "date": "03082016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot settles lawsuit over 2014 data breach "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 25 (Fitch) Fitch Ratings has affirmed the 'A' long-term  Issuer Default Rating (IDR) for The Home Depot  Inc. (Home Depot). The Rating  Outlook is Stable. A full list of ratings follows at the end of this release. KEY RATING DRIVERS The rating reflects Home Depot's strong track record of comparable store sales  (comps) growth  margin expansion and cash flow generation. Fitch expects the  company to maintain leverage (",
        "date": "02252016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Fitch Affirms The Home Depot  Inc.'s IDR at 'A'; Outlook Stable "
    },
    {
        "content": "Home Depot Inc   the world's largest home improvement chain  reported better-than-expected sales  boosted by an improving housing market and mild weather in the holiday quarter that encouraged customers continue outdoor activities and home renovations. | Video ",
        "date": "02232016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Home Depot sales beat on housing recovery  outdoor demand "
    },
    {
        "content": "* Shares up as much as 3.5 pct   (Adds conference call details and comments  background; updates shares)",
        "date": "02232016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 4-Home Depot sales beat on housing recovery  outdoor demand "
    },
    {
        "content": "Feb 23 Home Depot Inc  the No. 1 U.S. home improvement chain  reported a 9.5 percent rise in quarterly sales  helped by a recovery in the housing market.",
        "date": "02232016",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot quarterly sales rise 9.5 pct "
    },
    {
        "content": "Jan 20 Britain's biggest pet shop group  Pets at Home  said trading for the fiscal year remained in line with forecasts as it posted a 7.1 percent rise in third-quarter revenue.",
        "date": "01202016",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "UK's Pets at Home posts 7.1 pct rise in revenue "
    },
    {
        "content": "WASHINGTON  Dec 2 AB Electrolux's  deal to buy General Electric Co's appliance business will tie together two companies facing stiff competition from Asian competitors and be good for consumers  Home Depot Inc  executive Bob Baird testified in U.S. federal court on Wednesday.",
        "date": "12022015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot executive defends Electrolux deal for GE in U.S. court "
    },
    {
        "content": "* Indexes: Dow down 0.09 pct  S&P down 0.06 pct  Nasdaq up 0.05 pct   (Updates with reaction to soccer match bomb scare)",
        "date": "11172015",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "US STOCKS-Wall Street loses gains after Germany bomb report "
    },
    {
        "content": "Home Depot Inc  on Tuesday reported a better-than-expected rise in quarterly sales at stores open at least a year and said full-year profit and same-store sales would be at the top end of its forecast.",
        "date": "11172015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot third-quarter sales beat amid U.S. housing recovery "
    },
    {
        "content": "* Shares up 3 pct in early trade   (Adds CEO comments  details on transactions  share action)",
        "date": "11172015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 3-Home Depot 3rd-quarter sales beat amid U.S. housing recovery "
    },
    {
        "content": "* Indexes down: Dow 0.06 pct  S&P 0.09 pct  Nasdaq 0.11 pct   (Updates to open)",
        "date": "11172015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St little changed as energy stocks weigh "
    },
    {
        "content": "* Futures up: Dow 64 pts  S&P 5.5 pts  Nasdaq 14.25 pts   (Adds details  comment  updates prices)",
        "date": "11172015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St set to open higher after Wal-Mart results "
    },
    {
        "content": "Nov 17 U.S. stock index futures were higher on Tuesday after better-than-expected earnings from Dow components Wal-Mart and Home Depot following a sharp selloff in retail stocks last week.",
        "date": "11172015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Futures higher on Wal-Mart  Home Depot results "
    },
    {
        "content": "Nov 17 Home Depot Inc  the world's No.1 home improvement retailer by revenue  reported a 6.4 percent rise in quarterly net sales  helped by strong demand from professional contractors and builders.",
        "date": "11172015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot quarterly sales rise 6.4 pct "
    },
    {
        "content": "* 9-month profit before income tax increased by 28.8 pct to 23.1 million euros ($24.88 million)",
        "date": "11092015",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "BRIEF-Bet at home com 9-month EBT up 28.8 pct at EUR 23.1 mln "
    },
    {
        "content": "* Profit $1.20/share vs est. $1.24   (Adds CEO comment  details; updates shares)",
        "date": "08192015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 4-Lowe's sales beat on demand for appliances  outdoor equipment "
    },
    {
        "content": "An improving U.S. housing market helped Home Depot Inc  beat quarterly sales forecasts on Tuesday  and the world's No. 1 home-improvement retailer lifted its full-year earnings and revenue forecasts.",
        "date": "08182015",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Home Depot sales beat amid U.S. housing recovery "
    },
    {
        "content": "* Stock at all-time high  up nearly 14 pct this year   (Adds company comments  details on buyback and breach-related expenses)",
        "date": "08182015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 3-Home Depot sales beat amid U.S. housing recovery "
    },
    {
        "content": "(Removes entry on economist Bill Witherell's LIVECHAT as the event got cancelled.)       WEEK AHEAD      The stragglers for the earnings season - Home Depot  Wal-Mart and a few others - will report results to close out the quarter next week  with expectations that retailers would see decent sales after recent revisions show better-than-expected activity in the second quarter. The markets will also continue to watch the Chinese yuan after its unexpected devaluation this week  with anticipation",
        "date": "08142015",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "UPDATE 1-What to Watch in the Week Ahead and on Monday  Aug. 17 "
    },
    {
        "content": "* Indexes: Dow down 0.06 pct  S&P up 0.02 pct  Nasdaq off 0.16 pct   (Adds details  adds quote  updates prices)",
        "date": "08182015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Home Depot  strong housing data helps Wall St pare losses "
    },
    {
        "content": "* Indexes down: Dow 0.3 pct  S&P 0.3 pct  Nasdaq 0.4 pct   (Updates to open)",
        "date": "08182015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St falls as Wal-Mart results disappoints  China weighs "
    },
    {
        "content": "Aug 18 Home Depot Inc  the world's No.1 home improvement chain by revenue  reported a 4.3 percent rise in quarterly net sales  helped by a recovery in the U.S. housing market.",
        "date": "08182015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot quarterly sales rise 4.3 pct "
    },
    {
        "content": "Home Depot Inc  said it agreed to buy home repair and maintenance products seller Interline Brands Inc [ISHLDI.UL] for about $1.63 billion in cash to expand its Pro division  which caters to professional contractors and builders.",
        "date": "07222015",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Home Depot to buy Interline Brands for $1.63 billion "
    },
    {
        "content": "July 22 Home Depot Inc said it agreed to buy home repair and maintenance products seller Interline Brands Inc for about $1.63 billion in cash to expand its Pro division  which caters to professional contractors and builders.",
        "date": "07222015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 1-Home Depot to buy Interline Brands for $1.63 bln "
    },
    {
        "content": "July 22 Home Depot Inc said it agreed to buy home repair and maintenance product seller Interline Brands Inc for $1.63 billion.",
        "date": "07222015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot to buy Interline Brands for $1.63 bln "
    },
    {
        "content": "SEATTLE  July 22 Amazon said on Wednesday it would expand a marketplace that offers services from plumbing to fence repairs in 15 cities and help customers find contractors for more expensive home projects as it develops its role as a middleman for third-party vendors.",
        "date": "07222015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Amazon expands local services marketplace in U.S. cities "
    },
    {
        "content": "LONDON  June 4 Britain's biggest pet shop group Pets at Home said trading in its new fiscal year had begun in line with forecasts as it posted a 10 percent rise in full-year earnings.",
        "date": "06042015",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "UK's Pets at Home upbeat as profits rise "
    },
    {
        "content": "CHICAGO  May 20 Lowe's Companies Inc  failed to launch spring discounts during the coldest months this year  while rival Home Depot Inc piled on marketing to storm-hit homeowners  and the two chains saw sharply different first quarter results.",
        "date": "05212015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Different responses to winter: Lowe's misses and Home Depot beats expectations "
    },
    {
        "content": "Home Depot Inc  reported higher-than-expected quarterly profit and sales on Tuesday and raised its full-year forecast as North American customers spent more on home repairs after a harsh winter. | Video ",
        "date": "05192015",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Home Depot profit beats amid U.S. housing recovery "
    },
    {
        "content": "* Shares trade 0.7 pct lower   (Adds company comment  background on housing market  updates shares)",
        "date": "05192015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 3-Home Depot profit beats amid U.S. housing recovery "
    },
    {
        "content": "May 19 Home Depot Inc  the world's largest home improvement chain by sales  reported a 14.5 percent rise in quarterly profit as customers in North America spent more on home repairs after a harsher-than-usual winter.",
        "date": "05192015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot's profit rises 14.5 pct "
    },
    {
        "content": "CHICAGO  March 30 Amazon.com Inc is launching a home services marketplace that will connect customers with electricians  plumbers and painters in a move to have its services tied to every product sold on its website.",
        "date": "03302015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Amazon.com expands into professional services with home marketplace "
    },
    {
        "content": "Lowe's Cos Inc   the No. 2 U.S. home improvement chain  reported same-store sales well above analysts' estimates as lower gas prices and an improving job market encouraged Americans to spend more on home renovations.",
        "date": "02252015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Higher home renovation spending drives sales at Lowe's "
    },
    {
        "content": "Feb 25 Lowe's Cos Inc  the No. 2 U.S. home improvement chain  reported same-store sales well above analysts' estimates as lower gas prices and an improving job market encouraged Americans to spend more on home renovations.",
        "date": "02252015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 1-Higher home renovation spending drives sales at Lowe's "
    },
    {
        "content": "CHICAGO  Feb 24 Results from Home Depot Inc  and Toll Brothers Inc bode well for a continued recovery in the housing market this year  thanks largely to an improving jobs market and low gasoline prices  industry officials and analysts said.",
        "date": "02242015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Pickup in U.S. home investment pushes broader housing rebound "
    },
    {
        "content": "* Fed to consider hikes on \"meeting-by-meeting\" basis - Yellen",
        "date": "02242015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Dow  S&P finish at records after Yellen comments "
    },
    {
        "content": "* Fed to consider hikes on \"meeting-by-meeting\" basis - Yellen",
        "date": "02242015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Dow  S&P edge up  hit intraday records after Yellen comments "
    },
    {
        "content": "* Fed to consider hikes on \"meeting-by-meeting\" basis - Yellen",
        "date": "02242015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Dow  S&P edge up to record highs after Yellen comments "
    },
    {
        "content": "Home Depot Inc   the world's No. 1 home improvement chain  posted a better-than-expected rise in quarterly same-store sales on Tuesday but the company warned that a strong dollar will likely hurt 2015 earnings. | Video ",
        "date": "02242015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "Home Depot sales beat estimates; warns on currency "
    },
    {
        "content": "Feb 24 Home Depot Inc  the world's No. 1 home improvement chain  posted a better-than-expected rise in quarterly same-store sales on Tuesday but the company warned that a strong dollar will likely hurt 2015 earnings.",
        "date": "02242015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 2-Home Depot sales beat estimates; warns on currency "
    },
    {
        "content": "* Yellen's two-day testimony before Congress to start at 10 a.m.",
        "date": "02242015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St little changed with Yellen testimony on deck "
    },
    {
        "content": "* Yellen's two-day testimony before Congress to start at 10 a.m.",
        "date": "02242015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "US STOCKS-Wall St to open flat ahead of Yellen testimony "
    },
    {
        "content": "WASHINGTON  Jan 13 President Barack Obama sent a bill to Congress on Tuesday to strengthen U.S. cybersecurity laws to protect government  businesses and consumers while protecting privacy  after recent hacking attacks against Sony Pictures  Home Depot Inc and Target Corp   and on Monday the federal government itself.",
        "date": "01142015",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "UPDATE 3-Obama seeks enhanced cybersecurity laws to fight hackers "
    },
    {
        "content": "WASHINGTON President Barack Obama on Tuesday renewed a push to beef up U.S. cybersecurity laws after recent headline-grabbing hacking attacks against companies like Sony Pictures   Home Depot  and Target .",
        "date": "01132015",
        "name": "Home Depot Inc (The)",
        "news_type": "topStory",
        "symbol": "HD",
        "title": "Obama seeks enhanced cybersecurity laws to fight hackers "
    },
    {
        "content": "WASHINGTON  Jan 13 President Barack Obama on Tuesday renewed a push to beef up U.S. cybersecurity laws after recent headline-grabbing hacking attacks against companies like Sony Pictures  Home Depot and Target.",
        "date": "01132015",
        "name": "Home Depot Inc (The)",
        "news_type": "normal",
        "symbol": "HD",
        "title": "UPDATE 2-Obama seeks enhanced cybersecurity laws to fight hackers "
    }
]