[
    {
        "content": "* Seeing growth in both retail and wholesale loans (Adds management comment  details on bad loans)",
        "date": "10242017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "UPDATE 2-India's HDFC Bank posts record profit  bad loans stable "
    },
    {
        "content": "* Exec says ‍​have seen uptick in working capital requirements",
        "date": "10242017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank exec says co plans to add close to 200 branches annually "
    },
    {
        "content": "Oct 24 HDFC Bank Ltd  India's No.2 lender by assets  on Tuesday reported a 20 percent rise in second-quarter profit  almost in line with analysts' estimates.",
        "date": "10242017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q2 profit rises 20 pct y/y "
    },
    {
        "content": "* HDFC Bank Ltd consensus forecast for sept quarter profit was 41.61 billion rupees",
        "date": "10242017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-India's HDFC Bank Sept qtr profit up about 20 pct "
    },
    {
        "content": "Sept 25 Indian shares ended lower on Monday  tracking weakness in Asian peers  with index heavyweights ITC Ltd and HDFC Bank Ltd dragging down the indexes.",
        "date": "09252017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "Indian shares end lower; ITC  HDFC Bank down "
    },
    {
        "content": "MUMBAI  Sept 4 Reserve Bank of India has added HDFC Bank to a list of \"domestic systemically important banks\"  or the equivalent of \"too big to fail\"  according to a statement on Monday.",
        "date": "09042017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "India cenbank gives HDFC Bank \"too big to fail\" status along with SBI and ICICI "
    },
    {
        "content": "* Says announced a revision in its savings bank interest rate effective August 19  2017",
        "date": "08172017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank revises savings bank interest rate effective Aug 19 "
    },
    {
        "content": "(The following statement was released by the rating agency) COLOMBO  August 10 (Fitch) Fitch Ratings has placed Housing Development Finance Corporation Bank of Sri Lanka's (HDFC Bank) National Long-Term Rating of 'BBB(lka)'on Rating Watch Negative (RWN). The agency also placed HDFC Bank's senior secured and senior unsecured debentures  rated at 'BBB(lka)'  on RWN. KEY RATING DRIVERS The RWN reflects the risk that the state (B+/Stable)  as major shareholder  will not raise the bank's capital to m",
        "date": "08102017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "Fitch Places Sri Lanka's HDFC Bank on Rating Watch Negative "
    },
    {
        "content": "* Agriculture sector delinquencies drive non-performing loans",
        "date": "07242017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "UPDATE 2-India's HDFC Bank awaits farm loan waiver details after higher Q1 provisions "
    },
    {
        "content": "July 24 India's HDFC Bank Deputy Managing Director Paresh Sukthankar says:",
        "date": "07242017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-India's HDFC Bank exec: have seen healthy growth in both wholesale and retail loans "
    },
    {
        "content": "July 24 HDFC Bank  India's second-biggest lender by assets  on Monday reported a 20 percent increase in its first-quarter profit   missing analysts' estimates.",
        "date": "07242017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q1 net profit rises  but lags estimates "
    },
    {
        "content": "* June quarter net profit 38.94 billion rupees versus net profit of 32.39 billion rupees year ago",
        "date": "07242017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-India's HDFC Bank June-qtr profit up about 20 pct "
    },
    {
        "content": "* Says approved closure of account with HDFC Bank Ltd Source text - (http://bit.ly/2uI3bEj) Further company coverage:",
        "date": "07192017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-India's Amba Enterprises approves closure of account with HDFC Bank "
    },
    {
        "content": "* Allotted 7.56% unsecured  subordinated  fully paid-up  non-convertible  basel III compliant  tier 2 bonds amounting to INR 20 billion Source text for Eikon: Further company coverage:",
        "date": "06292017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank allots 7.56% unsecured tier 2 bonds amounting to 20 bln rupees "
    },
    {
        "content": "* Agreement for HDFC Bank to offer co's Dynamic Currency Conversion (DCC) solution Pay in Your Currency to its merchants in India Source text for Eikon: Further company coverage:",
        "date": "05022017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-Planet Payment and HDFC Bank announce agreement to offer Pay in Your Currency "
    },
    {
        "content": "April 24 Indian shares closed 1 percent higher on Monday  posting their biggest daily percentage gains in nearly six weeks following a slew of good quarterly results including from HDFC Bank Ltd  and cement makers.",
        "date": "04242017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "Indian shares end 1 pct higher; HDFC Bank leads gains "
    },
    {
        "content": "* Bad loan ratio sequentially stable at 1.05 pct  provisions rise",
        "date": "04212017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "UPDATE 2-India's HDFC Bank profit rise drives shares to record "
    },
    {
        "content": "* Exec says haven't seen capex related loan demand yet  substantial part of wholesale loan growth in Q4 from  working capital  short-term loans Further company coverage:",
        "date": "04212017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank exec says Q4 wholesale loan growth driven by working capital demand "
    },
    {
        "content": "* Says approved re-appointment of Shyamala Gopinath as part time non-executive chairperson of bank",
        "date": "04212017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank approves issue of perpetual debt instruments  bonds of up to 500 bln rupees "
    },
    {
        "content": "MUMBAI  April 21 HDFC Bank Ltd  India's second-biggest lender by assets  reported fourth-quarter net profit rose 18.3 percent on higher interest and fee income  slightly ahead of estimates.",
        "date": "04212017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q4 net profit rises 18 pct  bad loans stable "
    },
    {
        "content": "* March-quarter interest earned 181.14 billion rupees versus 159.97 billion rupees year ago",
        "date": "04212017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank March-qtr profit up about 18 pct "
    },
    {
        "content": "* HDFC Bank - proposes to raise funds by issuing perpetual debt instruments tier II capital bonds and senior long term infrastructure bonds up to INR 500 billion Source text: (http://bit.ly/2nZC2pw) Further company coverage:",
        "date": "04102017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank to issue bonds up to 500 bln rupees "
    },
    {
        "content": "* Says approved re-appointment of Paresh Sukthankar as deputy managing director of the bank for the period from june 13  2017 to june 12  2020  Source text - (http://bit.ly/2mr6KGy) Further company coverage:",
        "date": "03152017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank approves re-appointment of Paresh Sukthankar as deputy MD "
    },
    {
        "content": "* Says allots NCDs worth 2 billion rupees to HDFC Bank Ltd  Source text:http://bit.ly/2mRmg2T Further company coverage:",
        "date": "03072017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-Apollo Hospitals Enterprise allots NCDs worth 2 bln rupees to HDFC Bank "
    },
    {
        "content": "* India cenbank says foreign investor holding in HDFC Bank has crossed overall 74 percent of paid up capital limit",
        "date": "02172017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-India cbank bans fresh foreign buying in HDFC Bank "
    },
    {
        "content": "* RBI: Monitoring of foreign investment under PIS in Indian companies - removal from the ban list – HDFC Bank Ltd.",
        "date": "02162017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-India cenbank removes HDFC Bank from foreign investment ban list "
    },
    {
        "content": "* RBI - Monitoring of foreign investment under PIS in Indian companies - incorporation in ban list – HDFC Bank Ltd.",
        "date": "02172017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-India cenbank adds HDFC Bank back in FII ban list "
    },
    {
        "content": "Jan 24 Indian shares closed at their highest levels in two-and-a-half months on Tuesday as banks rallied on expectations for stronger earnings  while hopes for economic incentives at the annual budget next week lifted sentiment.",
        "date": "01242017",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "Indian shares hit over 2-1/2-month closing high; HDFC Bank gains "
    },
    {
        "content": "* Gross bad loans 1.05 pct in Dec qtr vs 1.02 pct in Sept qtr   (Adds details  updates shares)",
        "date": "01242017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "UPDATE 1-India's HDFC Bank Q3 profit up 15 pct  beats estimates "
    },
    {
        "content": "MUMBAI  Jan 24 HDFC Bank Ltd  India's third-biggest lender by assets  on Tuesday reported a 15 percent rise in third-quarter net profit  above analyst estimates  due to higher interest and fee income.",
        "date": "01242017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q3 profit up 15 pct  beats estimates "
    },
    {
        "content": "* Consensus forecast for Dec quarter net profit was 37.88 billion rupees",
        "date": "01242017",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank Dec-qtr profit up about 15 pct "
    },
    {
        "content": "MUMBAI  Oct 25 India's HDFC Bank exec says comfortable remaining in nim band of 4-4.3 pct   (Reporting by Devidutta Tripathy)",
        "date": "10252016",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "India's HDFC Bank exec says comfortable remaining in NIM band of 4-4.3 percent "
    },
    {
        "content": "MUMBAI  Oct 25 HDFC Bank Ltd  India's second-biggest private sector lender by assets  on Tuesday reported a 20.4 percent rise in second-quarter net profit  just beating analyst estimates  as income from interest and fees grew.",
        "date": "10252016",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q2 net profit up 20 pct  beats estimates "
    },
    {
        "content": "* Consensus forecast for Sept-quarter net profit was 34.15 billion rupees",
        "date": "10252016",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank Sept-qtr profit up 20 pct "
    },
    {
        "content": "* HDFC Bank says our systems detected a potential compromise of debit cards arising from usage at a non-HDFC Bank atm network a few weeks ago",
        "date": "10202016",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank says detected potential compromise of some debit cards "
    },
    {
        "content": "* The provisional freeze of a current account with HDFC Bank  Source text: http://bit.ly/2d9E5TR Further company coverage:    (Bengaluru newsroom)",
        "date": "09282016",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-63 moons technologies says provisional freeze of a current account with HDFC Bank "
    },
    {
        "content": "* Issued and allotted non-convertible bonds in the nature of debentures amounting to 67 billion rupees  Source text: (http://bit.ly/2cMPqwN) Further company coverage:    (Bengaluru newsroom)",
        "date": "09222016",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "BRIEF-HDFC bank issues non-convertible bonds worth 67 bln rupees "
    },
    {
        "content": "MUMBAI  July 21 HDFC Bank Ltd  India's second-biggest private sector lender by assets  reported a 20 percent rise in quarterly profit on higher interest and fee income  in line with analysts' estimates  although its bad loans rose.",
        "date": "07212016",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q1 net up 20 pct  bad loans tick up "
    },
    {
        "content": "May 12 India's HDFC Bank Ltd appointed K. Balasubramanian  head of corporate banking.",
        "date": "05122016",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "MOVES-HDFC Bank appoints K. Balasubramanian corporate banking head "
    },
    {
        "content": "* Outpaces growth in lending market  asset quality stable   (Adds management comment)",
        "date": "04222016",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "UPDATE 1-India's HDFC Bank seeing growth in corporate lending "
    },
    {
        "content": "MUMBAI  April 22 HDFC Bank Ltd  India's second-biggest private sector lender by assets  said its quarterly net profit rose about a fifth  in line with analysts' estimates.",
        "date": "04222016",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q4 net rises a fifth  bad loan ratio eases "
    },
    {
        "content": "MUMBAI India's stock markets ended largely flat on Monday as gains in stocks such as HDFC Bank  were offset by volatility in crude oil prices and caution ahead of the derivatives contracts' expiry later in the week.",
        "date": "01252016",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "Sensex barely holds on to gains  HDFC Bank earnings in line "
    },
    {
        "content": "MUMBAI  Jan 25 Indian shares ended largely flat on Monday as gains in stocks such as HDFC Bank were offset by volatility in crude oil prices and caution ahead of the derivatives contracts' expiry later in the week.",
        "date": "01252016",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "Indian stocks barely hold on to gains  HDFC Bank earnings in line "
    },
    {
        "content": "* Exec says not looking at dropping deposit rates at this point of time  Further company coverage:    (Reporting By Devidutta Tripathy)",
        "date": "01252016",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-HDFC Bank exec says not looking at dropping deposit rates currently "
    },
    {
        "content": "MUMBAI HDFC Bank Ltd  India's second-biggest private sector lender by assets  met analyst expectations with an about 20 percent increase in quarterly profit even as its bad loans ticked up.",
        "date": "01252016",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "HDFC Bank Q3 net up 20 pct as expected  bad loans tick up "
    },
    {
        "content": "* Gross bad loans ratio widens sequentially to 0.97 pct   (Adds credit growth  provisions)",
        "date": "01252016",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "UPDATE 1-India's HDFC Bank Q3 net up 20 pct as expected  bad loans tick up "
    },
    {
        "content": "MUMBAI  Jan 25 HDFC Bank Ltd  India's second-biggest private sector lender by assets  said its quarterly net profit rose by a fifth  broadly in line with analysts' estimates.",
        "date": "01252016",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q3 net up 20 pct as expected  bad loans rise "
    },
    {
        "content": "MUMBAI  Jan 25 Indian stocks edged up on Monday as financial firms rose ahead of HDFC Bank's quarterly results later in the day but caution before of the derivatives contracts' expiry later in the week kept a lid on gains.",
        "date": "01252016",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "Indian stocks hold on to gains  HDFC Bank earnings eyed "
    },
    {
        "content": "MUMBAI HDFC Bank Ltd  India's second-largest private sector lender by assets  grew loans faster than expected in the second quarter as more people borrowed to buy cars and homes  making up for a slower pickup in big-ticket corporate credit.",
        "date": "10212015",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "HDFC Bank predicts stronger loan growth after Q2 shine "
    },
    {
        "content": "* Gross bad loans ratio eases from Q1   (Adds management comment  details)",
        "date": "10212015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "UPDATE 2-India's HDFC Bank predicts stronger loan growth after Q2 shine "
    },
    {
        "content": "* Exec says getting loan refinancing proposals from companies",
        "date": "10212015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "BRIEF-India's HDFC Bank exec says does not see asset quality deteriorating "
    },
    {
        "content": "MUMBAI  Oct 21 HDFC Bank Ltd  India's second-biggest private sector lender by assets  reported on Wednesday a 20.5 percent rise in quarterly net profit  in line with analysts' estimates  on higher interest income.",
        "date": "10212015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q2 net up a fifth  in line with estimates "
    },
    {
        "content": "(The following statement was released by the rating agency) COLOMBO  October 12 (Fitch) Fitch Ratings has today assigned Housing Development  Finance Corporation Bank of Sri Lanka's (HDFC Bank; BBB(lka)/Stable) proposed  senior unsecured debentures of up to LKR4.0bn  a final National Long-Term Rating  of 'BBB(lka)'.  The assignment of the final rating follows the receipt of documents conforming  to information already received  and the final rating is the same as the  expected ratings assigned o",
        "date": "10122015",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "Fitch Rates HDFC Bank's Senior Debentures Final 'BBB(lka)' "
    },
    {
        "content": "MUMBAI HDFC Bank Ltd  India's second-biggest private sector lender by assets  reported a smaller-than-expected increase in first-quarter profit due to higher provisions for bad loans.",
        "date": "07212015",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "HDFC Bank Q1 profit lags  bad loans edge higher "
    },
    {
        "content": "* Bad loans higher sequentially   (Adds details  analyst comment)",
        "date": "07212015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "UPDATE 1-India's HDFC Bank Q1 profit lags  bad loans edge higher "
    },
    {
        "content": "MUMBAI  July 21 HDFC Bank Ltd  India's second-biggest private sector lender by assets  reported on Tuesday a 20.7 percent rise in quarterly profit  lagging estimates  as bad loans rose.",
        "date": "07212015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q1 net up 20.7 pct  bad loans rise "
    },
    {
        "content": "* Sees its loan growth outpacing the banking sector   (Adds details  management comment)",
        "date": "04232015",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "UPDATE 1-India's HDFC Bank sees strong loan growth after profit rises "
    },
    {
        "content": "MUMBAI  April 23 HDFC Bank Ltd  India's second-biggest private sector lender by assets  reported on Thursday a 20.6 percent rise in quarterly profit  beating estimates.",
        "date": "04232015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q4 net profit rises 20.6 pct  beats estimates "
    },
    {
        "content": "MUMBAI  April 7 India's HDFC Bank Ltd  the country's second-biggest private sector lender by assets  will reduce its base lending rate by 15 basis points to 9.85 percent  effective April 13  an executive at the bank said on Tuesday.",
        "date": "04072015",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "India's HDFC Bank to cut base lending rate by 15 bps - exec "
    },
    {
        "content": "* Sees pickup in corporate credit demand in next two quarters   (Adds management comments after results  details  context)",
        "date": "02142015",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "UPDATE 1-India's HDFC Bank Q3 profit up 20.2 pct as loan demand rises "
    },
    {
        "content": "MUMBAI  Feb 14 HDFC Bank Ltd  India's second-biggest private sector lender by assets  reported on Saturday a 20.2 percent increase in quarterly profit  beating estimates.",
        "date": "02142015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank Q3 net profit up 20.2 pct  beats estimates "
    },
    {
        "content": "MUMBAI  Feb 3 India's HDFC Bank Ltd is expected to sell shares worth up to 100 billion rupees ($1.6 billion) as early as this week  with an offering that will include overseas and domestic stock  sources with direct knowledge of the matter said on Tuesday.",
        "date": "02032015",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "India's HDFC Bank $1.6 bln share sale likely this week - sources "
    },
    {
        "content": "MUMBAI  Feb 5 HDFC Bank's $324 million share offering in India was more than 4 times oversubscribed  according to bankers and  investors  a strong reception that is expected to encourage a rush of domestic equity sales from other companies.",
        "date": "02052015",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "UPDATE 1-HDFC Bank's India offer oversubscribed  seen encouraging other sales "
    },
    {
        "content": "MUMBAI HDFC Bank Ltd   India's largest lender by market value  launched a share offer in the United States and India on Wednesday to raise up to $1.6 billion.",
        "date": "02042015",
        "name": "HDFC Bank Limited",
        "news_type": "topStory",
        "symbol": "HDB",
        "title": "HDFC Bank launches U.S. and Indian share offers to raise up to $1.6 billion "
    },
    {
        "content": "MUMBAI  Feb 5 Indian shares rose on Thursday on value buying in blue-chips  after closing at their lowest in two weeks in the previous session  while a strong response to HDFC Bank's $1.6 billion share offering also bolstered sentiment for its rivals.",
        "date": "02052015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "Indian stocks rise on value buying  HDFC Bank's $1.6 bln share sale "
    },
    {
        "content": "MUMBAI  Feb 4 HDFC Bank Ltd  India's largest lender by market value  launched a share offer in the United States and India on Wednesday to raise up to $1.6 billion.",
        "date": "02042015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "UPDATE 1-HDFC Bank launches US and Indian share offers to raise up to $1.6 bln "
    },
    {
        "content": "HONG KONG  Feb 5 HDFC Bank Ltd    India's largest lender by market value  has set 1 057-1 067 rupees per share price range for its domestic share offering  a term sheet showed on Thursday.",
        "date": "02052015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "India's HDFC Bank sets 1 057-1 067 rupees price range for offering - term sheet "
    },
    {
        "content": "MUMBAI  Feb 4 India's HDFC Bank Ltd  the largest lender by market capitalisation  is raising as much as 20 billion rupees ($324 million) by selling shares to domestic portfolio investors  according to a term sheet seen by Reuters on Wednesday.",
        "date": "02042015",
        "name": "HDFC Bank Limited",
        "news_type": "normal",
        "symbol": "HDB",
        "title": "HDFC Bank raising up to $324 mln from share sale to Indian investors "
    }
]