[
    {
        "content": "William Ackman said on Wednesday he has bought options to sell shares of Herbalife Ltd  as a new way to bet against the nutritional supplement company he has described as a pyramid scheme.",
        "date": "11012017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Ackman makes new bet against Herbalife with options "
    },
    {
        "content": "Nov 1 William Ackman said on Wednesday he has bought options to sell shares of Herbalife Ltd as a new way to bet against the nutritional supplement company he has described as a pyramid scheme.",
        "date": "11012017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 4-Ackman makes new bet against Herbalife with options "
    },
    {
        "content": "Nov 1 Billionaire investor William Ackman  who has been betting for five years that Herbalife's stock price would tumble to zero  said on Wednesday that his firm recently restructured its position in the nutrition and supplements maker.",
        "date": "11012017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Ackman says his firm restructured Herbalife position-CNBC "
    },
    {
        "content": "* HBL Swiss Financing GMBH reports 5.25 pct passive stake in herbalife Ltd as of Oct 16 - sec filing Source text (http://bit.ly/2yM25qk) Further company coverage:",
        "date": "10252017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-HBL Swiss Financing GMBH reports 5.25 pct passive stake in Herbalife as of Oct 16 "
    },
    {
        "content": "* Carl Icahn reports 26.22 percent stake in Herbalife Ltd ‍​as of October 11 - SEC filing",
        "date": "10112017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Carl Icahn reports 26.22 pct stake in Herbalife Ltd "
    },
    {
        "content": "SAN FRANCISCO Herbalife Ltd  shares jumped 11 percent on Friday to their highest since 2014 after the company said it was buying back about 7 percent of its stock  a potential blow to activist investor Bill Ackman  who has bet against the dietary supplements seller.",
        "date": "10062017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife soars on buyback  pressures Ackman's short bet "
    },
    {
        "content": "* Herbalife Ltd says ‍\"we could face additional risks resulting from changes in china's data privacy and cybersecurity requirements\" - SEC filing​",
        "date": "10022017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife Ltd says ‍\"we could face additional risks resulting from changes in China's data privacy and cybersecurity requirements\" "
    },
    {
        "content": "* Herbalife announces amendment and extension of its tender offer for common shares",
        "date": "09182017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife announces amendment and extension of its tender offer for common shares "
    },
    {
        "content": "* Says ‍has waived share price condition related to its previously announced $600 million cash tender offer for its common shares​ Source text for Eikon: Further company coverage:",
        "date": "08282017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife says ‍has waived share price condition related to its previously announced $600 million cash tender offer for its common shares​ "
    },
    {
        "content": "* All three indexes below their 50-day moving avg (Adds details  changes comment  updates prices)",
        "date": "08212017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "US STOCKS-Wall St edges lower  led by tech and financial stocks "
    },
    {
        "content": "Aug 21 Herbalife Ltd said on Monday it had started buying back up to $600 million of its shares in the form of a modified Dutch tender  after talks with an investor to take the company  private fell through.",
        "date": "08212017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife starts buybacks after going-private talks fall through "
    },
    {
        "content": "Aug 21 Herbalife Ltd said it had started buying back up to $600 million of its shares in a modified Dutch tender offer  after talks with an investor to take the company private fell through.",
        "date": "08212017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 1-Herbalife starts buybacks after going-private talks fall through "
    },
    {
        "content": "* Herbalife announces self-tender offer seeking to purchase up to $600 million of its outstanding common shares",
        "date": "08212017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife announces self-tender offer to purchase up to $600 mln of outstanding shares "
    },
    {
        "content": "NEW YORK/SHANGHAI Shares in U.S. multi-level marketing (MLM) companies Herbalife Ltd  NU Skin Enterprises Inc and USANA Health Sciences Inc tumbled in high volume on Monday after a Chinese government regulator announced a crackdown on pyramid schemes.",
        "date": "08152017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Shares in Herbalife  Nu Skin tumble as China cracks down on pyramid schemes "
    },
    {
        "content": "* Comes after death of a Chinese student prompts public outcry",
        "date": "08152017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "RPT-UPDATE 1-Shares in Herbalife  Nu Skin tumble as China cracks down on pyramid schemes "
    },
    {
        "content": "* Comes after death of a Chinese student prompts public outcry (Updates with details from Chinese govt statement)",
        "date": "08152017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 1-Shares in Herbalife  Nu Skin tumble as China cracks down on pyramid schemes "
    },
    {
        "content": "NEW YORK  Aug 14 Shares in multi-level marketing companies Herbalife Ltd  NU Skin Enterprises Inc and USANA Health Sciences Inc tumbled in high volume on Monday after a Chinese government website announced a crackdown on pyramid schemes.",
        "date": "08142017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife  Nu Skin shares fall on worries about China market "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Herbalife Ltd - sec filing",
        "date": "08142017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Herbalife  Mcdonalds "
    },
    {
        "content": "* Herbalife says SEC and Department Of Justice requested from co documents  other information relating to company’s anti-corruption compliance in China",
        "date": "08012017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife says SEC  DoJ requested information "
    },
    {
        "content": "* Herbalife nutrition announces new appointments to corporate leadership team",
        "date": "06132017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife names Frank Lamberti as EVP  managing director for americas and worldwide marketing "
    },
    {
        "content": "Herbalife Ltd  said on Sunday it expects current-quarter revenue to fall more than previously expected  after sales were hurt amid efforts by the nutritional supplement maker to comply with regulatory requirements related to its business practices.",
        "date": "06052017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife says second-quarter sales to fall more than expected "
    },
    {
        "content": "BOSTON Herbalife Ltd  has named a new acting general counsel in a wave of management changes as the nutrition and supplements company works to comply with a legal settlement with U.S. regulators last year over deceiving customers  according to a person familiar with the hiring decision.",
        "date": "06052017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife hires new lawyer  makes personnel changes: source "
    },
    {
        "content": "BOSTON Herbalife Ltd  hired Rick Werber as its acting general counsel  a source familiar with the decision said on Monday.",
        "date": "06052017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife hired Rick Werber as acting general counsel: source "
    },
    {
        "content": "BOSTON  June 5 Herbalife Ltd has named a new acting general counsel in a wave of management changes as the nutrition and supplements company works to comply with a legal settlement with U.S. regulators last year over deceiving customers  according to a person familiar with the hiring decision.",
        "date": "06052017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 1-Herbalife hires new lawyer  makes personnel changes -source "
    },
    {
        "content": "BOSTON  June 5 Herbalife Ltd hired Rick Werber as its acting general counsel  a source familiar with the decision said on Monday.",
        "date": "06052017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife hired Rick Werber as acting general counsel -source "
    },
    {
        "content": "BOSTON  June 5 Mark Friedman  Herbalife Ltd's general counsel who signed the nutrition and supplement company's 2016 settlement with U.S. regulators about deceiving investors  no longer holds that position  according to company documents and a person familiar with the development.",
        "date": "06052017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife's Friedman leaves general counsel role -document and source "
    },
    {
        "content": "June 5 Herbalife Ltd said on Sunday it expects current-quarter revenue to fall more than previously expected  after sales were hurt amid efforts by the nutritional supplement maker to comply with regulatory requirements related to its business practices.",
        "date": "06052017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 2-Herbalife says 2nd-qtr sales to fall more than expected "
    },
    {
        "content": "June 4 Nutritional supplement maker Herbalife Ltd on Sunday raised its current-quarter adjusted profit forecast and said it exceeded a key threshold under its agreement with the U.S.  Federal Trade Commission.",
        "date": "06052017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "CORRECTED-UPDATE 1-Herbalife raises profit forecast  tops key FTC threshold "
    },
    {
        "content": "* Herbalife to cut sales guidance; exceeds key FTC mandate - cnbc",
        "date": "06052017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife to cut sales guidance; exceeds key FTC mandate - CNBC "
    },
    {
        "content": "June 4 Nutritional supplement maker Herbalife Ltd said it will lower its sales outlook for the current quarter before Monday's market open  CNBC reported Sunday.",
        "date": "06052017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife to cut sales guidance - CNBC "
    },
    {
        "content": "* CEO Michael Johnson engaged in net exercise transaction involving 730 000 stock appreciation rights due to expire in Feb 2018 and Feb 2019 Source text for Eikon: Further company coverage:",
        "date": "05192017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife CEO Michael Johnson engaged in net exercise transaction "
    },
    {
        "content": "BEVERLY HILLS  Calif. After years of discord with a prominent hedge-fund manager  a federal investigation and bad publicity  Herbalife Ltd  Chief Executive Officer Michael Johnson is taking a victory lap.",
        "date": "05042017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife CEO talks about obesity  vindication at Milken Conference "
    },
    {
        "content": "BEVERLY HILLS  May 3 After years of discord with a prominent hedge-fund manager  a federal investigation and bad publicity  Herbalife Ltd Chief Executive Michael Johnson is taking a victory lap.",
        "date": "05032017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife CEO Johnson talks obesity  'fake news' at Milken Conference "
    },
    {
        "content": "BEVERLY HILLS  Calif.  May 3 After years of discord with a prominent hedge-fund manager  a federal investigation and bad publicity  Herbalife Ltd Chief Executive Officer Michael Johnson is taking a victory lap.",
        "date": "05042017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 2-Herbalife CEO talks about obesity  vindication at Milken Conference "
    },
    {
        "content": "* Herbalife International of America Inc issues voluntary recall for its protein bar - peanut butter due to trace amounts of undeclared fish allergen Source text for Eikon: Further company coverage:",
        "date": "05032017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife issues voluntary recall for peanut butter protein bar due to traces of fish allergen "
    },
    {
        "content": "WASHINGTON  March 27 Several Democratic senators pressed billionaire investor Carl Icahn on Monday to clarify his role as an adviser to President Donald Trump  saying his position in the administration raised \"alarming\" questions about potential conflicts of interest with his stakes in the biofuels and pharmaceutical industries.",
        "date": "03272017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Senators press Icahn on White House influence  business conflicts "
    },
    {
        "content": "WASHINGTON  March 23 Jay Clayton  the Wall Street attorney tapped by President Donald Trump to lead the U.S. Securities and Exchange Commission  on Thursday defended himself against Democrats' charges that multiple conflicts of interest would force him to miss too many SEC votes.",
        "date": "03232017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 4-U.S. Senate panel presses SEC nominee Clayton on conflicts "
    },
    {
        "content": "WASHINGTON Jay Clayton  the Wall Street attorney tapped by President Donald Trump to lead the U.S. Securities and Exchange Commission  on Thursday defended himself against Democrats' charges that multiple conflicts of interest would force him to miss too many SEC votes.",
        "date": "03232017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "U.S. Senate panel presses SEC nominee Clayton on conflicts "
    },
    {
        "content": "* CEO Michael Johnson's fy 2016 total compensation $10.9 million versus $9.9 million in fy 2015 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "03132017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife CEO fy 2016 total compensation $10.9 mln - sec filing "
    },
    {
        "content": "* Carl Icahn reports purchase of 372 324 shares of Herbalife's common stock on March 10  2017 at $51.35 per share - SEC filing  Source text: (http://bit.ly/2n0phgW) Further company coverage:",
        "date": "03132017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Carl Icahn reports purchase of 372 324 shares of Herbalife on Mar. 10 2017 "
    },
    {
        "content": "* Carl Icahn reports 24.57 percent stake in Herbalife Ltd as on March 10  2017 - SEC filing",
        "date": "03132017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Carl Icahn reports 24.57 pct stake in Herbalife Ltd as of March 10 "
    },
    {
        "content": "* Says Herbalife nutrition partners with Syngene to establish nutrition research and development lab in India",
        "date": "03022017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Syngene International & Herbalife partner to establish nutrition R&D lab in India "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn increased his holdings in Herbalife Ltd  and Hertz Global Holdings Inc  in the fourth quarter  and exited Voltari Corp .",
        "date": "02152017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Icahn raises stakes in Herbalife  Hertz  cuts Freeport-McMoran in fourth quarter "
    },
    {
        "content": "NEW YORK  Feb 14 Billionaire activist investor Carl Icahn increased his holdings in Herbalife Ltd and Hertz Global Holdings Inc in the fourth quarter  and exited Voltari Corp.",
        "date": "02152017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Icahn raises stakes in Herbalife  Hertz  cuts Freeport-McMoran in 4Q "
    },
    {
        "content": "* Vanguard Group Inc reports a 6.57 percent passive stake in Herbalife Ltd as of Dec 31  2016  - SEC filing  Source text : (http://bit.ly/2l7rs1k) Further company coverage:",
        "date": "02132017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Vanguard Group reports 6.57 pct passive stake in Herbalife - SEC filing "
    },
    {
        "content": "BOSTON William Stiritz  one of the largest investors in Herbalife Ltd  cut his stake in the nutrition and weight loss company to 1.4 percent at the end of the fourth quarter from 5.2 percent a year ago  according to a regulatory filing on Tuesday.",
        "date": "02142017",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife investor Stiritz cuts holding; Icahn lifts his: filing "
    },
    {
        "content": "BOSTON  Feb 14 William Stiritz  one of the largest investors in Herbalife Ltd  cut his stake in the nutrition and weight loss company to 1.4 percent at the end of the fourth quarter from 5.2 percent a year ago  according to a regulatory filing on Tuesday.",
        "date": "02142017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife investor Stiritz cuts holding; Icahn lifts his -filing "
    },
    {
        "content": "* Carl Icahn ups shared share stake in Herbalife Ltd by 14.7 percent to 22.5 million shares - SEC filing",
        "date": "02142017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Carl Icahn ups shared share stake in Herbalife  cuts in Freeport "
    },
    {
        "content": "* Soros Fund Management takes share stake in facebook inc of 353 686 shares",
        "date": "02142017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Soros Fund Management takes in Facebook  ups in T Mobile and Alphabet "
    },
    {
        "content": "* Route one investment company lp reports 5.6 percent passive stake in herbalife ltd as of december 31  2016 - sec filing  Source text (http://bit.ly/2lHiOaF) Further company coverage:",
        "date": "02142017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Route One Investment Company LP reports 5.6 pct passive stake in Herbalife Ltd as of Dec 31  2016 "
    },
    {
        "content": "The U.S. government is investigating dietary supplement maker Herbalife  over whether it violated foreign bribery laws while conducting business in China  the company revealed in a regulatory filing on Friday.",
        "date": "01202017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "U.S. investigating Herbalife over foreign bribery in China "
    },
    {
        "content": "Jan 20 The U.S. government is investigating dietary supplement maker Herbalife over whether it violated foreign bribery laws while conducting business in China  the company revealed in a regulatory filing on Friday.",
        "date": "01202017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 2-U.S. investigating Herbalife over foreign bribery in China "
    },
    {
        "content": "Jan 20 Dietary supplements maker Herbalife Ltd  said on Friday its fourth-quarter sales would be below its expectations  hurt by a strong dollar  and that volumes would be near the low-end of its previous forecast.",
        "date": "01202017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife says fourth-quarter sales to be lower than expected "
    },
    {
        "content": "* Says expects Q4 volume to be toward low end of guidance provided on Nov. 1  2016",
        "date": "01202017",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife sees Q4 volume to be towards low end of guidance "
    },
    {
        "content": "NEW YORK Carl Icahn  the activist investor who owns over $1.2 billion worth of Herbalife  shares  said the stock is cheap  especially now that the cloud of a government investigation has lifted  and that the company will create a lot of jobs.",
        "date": "11162016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Icahn says Herbalife is undervalued  business can create jobs "
    },
    {
        "content": "NEW YORK  Nov 16 Carl Icahn  the activist investor who owns over $1.2 billion worth of Herbalife  shares  said the stock is cheap  especially now that the cloud of a government investigation has lifted  and that the company will create a lot of jobs.",
        "date": "11162016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "REUTERS SUMMIT-Icahn says Herbalife is undervalued  business can create jobs "
    },
    {
        "content": "* Carl Icahn reports 24.18 pct stake in Herbalife Ltd as of Nov 8 versus previous stake of 23.05 percent - SEC filing  Source text - (http://bit.ly/2fx1CP9) Further company coverage:",
        "date": "11082016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Carl Icahn reports 24.18 pct stake in Herbalife "
    },
    {
        "content": "* Carl Icahn reports 23.05 percent stake in herbalife ltd as of november 3 - sec filing",
        "date": "11032016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Carl Icahn reports 23.05 pct stake in Herbalife as of Nov. 3 "
    },
    {
        "content": "Nov 3 Activist investor Carl Icahn has raised his stake in Herbalife Ltd to 23.1 percent as of Nov. 3  according to a regulatory filing on Thursday.",
        "date": "11032016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Icahn raises stake in Herbalife "
    },
    {
        "content": "Herbalife Ltd  Chief Executive Michael Johnson will step down next year  capping a tumultuous 13-year tenure that was marked by a bitter fight with activist investor William Ackman.",
        "date": "11012016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife CEO to step down next year  COO to take over "
    },
    {
        "content": "Nov 1 Herbalife Ltd Chief Executive Michael Johnson will step down next year  capping a tumultuous 13-year tenure that was marked by a bitter fight with activist investor William Ackman.",
        "date": "11012016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 2-Herbalife CEO to step down next year  COO to take over "
    },
    {
        "content": "* Herbalife - new CEO Goudis will receive an annual salary of $1 million  will be eligible for annual bonus targeted at 120 pct of annual salary - SEC filing  Source text for Eikon:  Further company coverage:    ;))",
        "date": "11012016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife's new CEO Richard Goudis will receive annual salary of $1 mln - SEC filing "
    },
    {
        "content": "* Herbalife Ltd - COO Richard Goudis to succeed Johnson as CEO",
        "date": "11012016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife says Richard Goudis to succeed Michael Johnson as CEO "
    },
    {
        "content": "NEW YORK  Sept 13 Billionaire investor Carl Icahn continued to throw his support behind the Republican U.S. presidential candidate on Tuesday  saying Donald Trump would reduce the regulation of U.S. companies.",
        "date": "09132016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "UPDATE 1-Icahn says Trump better for U.S. economy than Clinton "
    },
    {
        "content": "* Herbalife posts fourth video demonstrating how Bill Ackman's tactics are being called into question  Source text for Eikon:  Further company coverage:",
        "date": "09132016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife posts fourth video demonstrating Bill Ackman's tactics "
    },
    {
        "content": "* Carl Icahn reports open market purchase of 306 846 shares of co's common stock at average price of $60.39 per share on august 31 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "09022016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife- Icahn reports open market purchase of 306 846 shares of co's common stock "
    },
    {
        "content": "* Carl Icahn in WSJ opinion piece - had no \"plans or proposals\" to sell Herbalife stock that would have required SEC disclosure and have none now",
        "date": "08302016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Carl Icahn in WSJ says had no plans to sell Herbalife stock that would have required SEC disclosure "
    },
    {
        "content": "BOSTON  Aug 28 After U.S. multi-level marketing company Herbalife settled a probe of its sales practices with the U.S. Federal Trade Commission last month  top executives assured investors that the company would be able to thrive under the new rules.",
        "date": "08282016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife may have misled investors  SEC on impact of FTC deal  one short-seller says "
    },
    {
        "content": "BOSTON  Aug 28 After U.S. multi-level marketing company Herbalife settled a probe of its sales practices with the U.S. Federal Trade Commission last month  top executives assured investors that the company would be able to thrive under the new rules.",
        "date": "08292016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "RPT-Herbalife may have misled investors  SEC on impact of FTC deal  one short-seller says "
    },
    {
        "content": "Carl Icahn said he did not attempt to sell his Herbalife Ltd  stake  and had instead bought more shares in the health supplements maker  rejecting hedge fund manager Bill Ackman's claim that he had been offered some of Icahn's shares.",
        "date": "08262016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Icahn denies attempt to sell Herbalife stock  buys more shares "
    },
    {
        "content": "* Icahn says bought another 2.3 mln Herbalife shares on Friday",
        "date": "08262016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 3-Icahn denies attempt to sell Herbalife stock  buys more shares "
    },
    {
        "content": "* \"Appreciate support of all of our investors and are particularly grateful to Carl Icahn\"  Source text for Eikon:  Further company coverage:",
        "date": "08262016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife responds to Carl Icahn's purchase of 2.3 mln shares "
    },
    {
        "content": "* Carl Icahn reports 20.78 pct stake in Herbalife Ltd as of August 26 -SEC filing",
        "date": "08262016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Carl Icahn reports 20.78 percent stake in Herbalife Ltd as of Aug 26 "
    },
    {
        "content": "* Indexes up: Dow 0.57 pct  S&P 0.64 pct  Nasdaq 0.73 pct   (Adds details  comments  updates price)",
        "date": "08262016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "US STOCKS-Wall St rises as Yellen says case for rate hike stronger "
    },
    {
        "content": "* Indexes up: Dow 0.29 pct  S&P 0.3 pct  Nasdaq 0.26 pct   (Updates to open)",
        "date": "08262016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "US STOCKS-Wall St rises as traders count down to Yellen speech "
    },
    {
        "content": "* Futures down: Dow 43 pts  S&P 0.5 pts  Nasdaq 3.75 pts   (Adds details  comments  updates prices)",
        "date": "08262016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "US STOCKS-Wall St set to open flat as traders count down to Yellen "
    },
    {
        "content": "Aug 26 Billionaire investor Carl Icahn was lately in talks to sell his stake in nutritional supplement maker Herbalife Ltd to a group that includes hedge fund manager Bill Ackman  the Wall Street Journal reported citing people familiar with the matter.",
        "date": "08262016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Icahn explored selling Herbalife stake to group that includes Ackman - WSJ "
    },
    {
        "content": "* Carl Icahn recently discussed selling his stake in Herbalife to a group including William Ackman - WSJ  citing source",
        "date": "08262016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Carl Icahn recently discussed selling his stake in Herbalife - WSJ "
    },
    {
        "content": "BOSTON  Aug 12 One of Herbalife Ltd's largest investors sold more of the company's stock  just weeks after the U.S. government told the protein shake maker to reorganize its business  according to a filing with the U.S. Securities and Exchange Commission.",
        "date": "08122016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Ackman cheers as Fidelity funds unload more Herbalife shares "
    },
    {
        "content": "Herbalife Ltd's  on Wednesday posted second-quarter results that beat forecasts as strong demand for the marketing company's nutrition products helped offset a $203 million payment to settle a U.S. probe into its business practices.",
        "date": "08042016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife tops estimates  to make agreed U.S. changes in 10 months "
    },
    {
        "content": "Aug 3 Herbalife Ltd's quarterly sales rose 3.4 percent  helped by higher demand for its weight management and targeted nutrition products in North America and Europe  Middle and Africa.",
        "date": "08032016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife's quarterly sales rise 3.4 percent "
    },
    {
        "content": "* Has won approval from China's ministry of commerce to operate in Gansu  Ningxia and Inner Mongolia Provinces",
        "date": "08102016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife has won approval from China's ministry of commerce to operate in 3 additional provinces "
    },
    {
        "content": "Aug 3 Herbalife Ltd's on Wednesday posted second-quarter results that beat forecasts as strong demand for the marketing company's nutrition products helped offset a $203 million payment to settle a U.S. probe into its business practices.",
        "date": "08042016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 2-Herbalife tops estimates  to make agreed U.S. changes in 10 mths "
    },
    {
        "content": "WASHINGTON/NEW YORK Herbalife Ltd agreed to pay $200 million and change the way it does business to avoid being labeled a pyramid scheme by regulators  a blow to hedge fund manager Bill Ackman who for years has been betting against the dietary supplements maker. | Video ",
        "date": "07162016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife settles pyramid scheme case with regulator  in blow to Pershing's Ackman "
    },
    {
        "content": "NEW YORK Billionaire investor Bill Ackman said on Thursday that he was still betting against Herbalife Ltd shares and that the company needed to make \"material changes to its incentive structure.\"",
        "date": "07142016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Hedge fund manager Ackman still betting against Herbalife "
    },
    {
        "content": "* Carl Icahn reports 18.32 pct stake in Herbalife as of July 15 - SEC filing  Source text: (http://bit.ly/29WtBGk) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07152016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Carl Icahn reports 18.32 percent stake in Herbalife "
    },
    {
        "content": "NEW YORK  July 14 Billionaire investor Bill Ackman said on Thursday that he was still betting against Herbalife Ltd shares and that the company needed to make \"material changes to its incentive structure.\"",
        "date": "07142016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 2-Hedge fund manager Ackman still betting against Herbalife "
    },
    {
        "content": "WASHINGTON/NEW YORK Herbalife Ltd agreed to pay $200 million and change the way it does business to avoid being labeled a pyramid scheme by regulators  a blow to hedge fund manager Bill Ackman who for years has been betting against the dietary supplements maker.",
        "date": "07152016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife settles pyramid scheme case with regulator  in blow to Pershing's Ackman "
    },
    {
        "content": "NEW YORK  July 14 Bill Ackman said on Thursday that he's still betting against the shares of Herbalife Ltd  and that the company needs to make \"material changes to its incentive structure.\"",
        "date": "07142016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Ackman still betting against Herbalife because of its business model "
    },
    {
        "content": "WASHINGTON/NEW YORK  July 15 Herbalife Ltd  agreed to pay $200 million and change the way it does business to avoid being labeled a pyramid scheme by regulators  a blow to hedge fund manager Bill Ackman who for years has been betting against the dietary supplements maker.",
        "date": "07152016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 4-Herbalife settles pyramid scheme case with regulator  in blow to Pershing's Ackman "
    },
    {
        "content": "* Herbalife and the Federal Trade Commission reach settlement agreement",
        "date": "07152016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife  FTC reach settlement agreement "
    },
    {
        "content": "WASHINGTON  July 15 Weight-loss products maker Herbalife Ltd has agreed to  pay $200 million and restructure its U.S. business operations under a settlement with the Federal Trade Commission  the U.S. agency said on Friday.",
        "date": "07152016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "FTC says Herbalife will restructure  pay $200 million to settle charges "
    },
    {
        "content": "July 15 Herbalife Ltd is expected to announce a settlement with the Federal Trade Commission  under which the regulatory body has determined that the weight-loss products maker is not a pyramid scheme  CNBC tweeted  citing Dow Jones.",
        "date": "07152016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "FTC determines Herbalife not a pyramid scheme-CNBC "
    },
    {
        "content": "* Pershing Square says releases 11th in a series of videos showing Herbalife's \"false and misleading claims continue\"",
        "date": "07052016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Pershing Square releases 11th video showing Herbalife's \"false and misleading claims continue\" "
    },
    {
        "content": "BOSTON  June 20 Billionaire investor William Ackman revved up his campaign against Herbalife on Monday as investors await the outcome of a U.S. Federal Trade Commission (FTC) probe into the business practices of the nutritional supplements maker.",
        "date": "06202016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Ackman releases new Herbalife video; stock climbs "
    },
    {
        "content": "May 24 Shares of Herbalife Ltd jumped as much as 8.5 percent amid conflicting reports on whether the company had reached an agreement in principle with the U.S. Federal Trade Commission to settle a probe into whether it runs a pyramid scheme.",
        "date": "05242016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife shares volatile amid conflicting FTC settlement reports "
    },
    {
        "content": "* No settlement is imminent between Herbalife and the FTC - CNBC citing source  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05242016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-No settlement imminent between Herbalife and FTC - CNBC "
    },
    {
        "content": "* Herbalife has reached agreement in principle with U.S. FTC to settle a years-long probe into whether it was a pyramid scheme - NY Post",
        "date": "05242016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife reaches preliminary settlement with FTC - NY Post "
    },
    {
        "content": "Herbalife Ltd  which has been accused by billionaire investor William Ackman of being a fraud  said it was in advanced talks with the U.S. Federal Trade Commission to settle a probe into whether it runs a pyramid scheme.",
        "date": "05062016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife in advanced talks to settle FTC probe  issues remain "
    },
    {
        "content": "* Herbalife said talks with FTC are in advanced stages  and it could face a payment of about $200 million - CNBC  Source text -(http://cnb.cx/1Wb42Em) Further company coverage:    (Bengaluru Newsroom)",
        "date": "05052016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "BRIEF-Herbalife said talks with FTC are in advanced stages - CNBC "
    },
    {
        "content": "Nutritional supplements maker Herbalife Ltd  said a database error caused the company to overstate growth in new members over the past three quarters  potentially adding fuel to short-seller Bill Ackman's campaign against the company.",
        "date": "03032016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife database snafu overstates member growth numbers "
    },
    {
        "content": "March 3 Nutritional supplements maker Herbalife Ltd said a database error caused the company to overstate growth in new members over the past three quarters  potentially adding fuel to short-seller Bill Ackman's campaign against the company.",
        "date": "03032016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "CORRECTED-UPDATE 3-Herbalife database snafu overstates member growth numbers "
    },
    {
        "content": "BOSTON William Stiritz  one of the largest investors in Herbalife Ltd   cut his stake in the nutrition and weight loss company to 5.2 percent  down from 8.2 percent  according to a regulatory filing on Tuesday.",
        "date": "02162016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Stiritz cuts stake in Herbalife to 5.2 percent: filing "
    },
    {
        "content": "BOSTON  Feb 16 William Stiritz  one of the largest investors in Herbalife Ltd  cut his stake in the nutrition and weight loss company to 5.2 percent  down from 8.2 percent  according to a regulatory filing on Tuesday.",
        "date": "02162016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 1-Stiritz cuts stake in Herbalife to 5.2 pct -filing "
    },
    {
        "content": "BOSTON  Feb 16 William Stiritz  one of the largest investors in Herbalife Ltd  cut his stake the nutrition and weight loss company to 5.2 percent of the company  down from 8.2 percent  according to a new regulatory filing made on Tuesday.",
        "date": "02162016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "William Stiritz cuts stake in Herbalife to 5.2 pct - filing "
    },
    {
        "content": "BOSTON  Feb 9 Hedge fund manager William Ackman  who has a $1 billion short bet on Herbalife stock  on Tuesday released a video of former Herbalife sellers claiming the company misled them.",
        "date": "02092016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife foe releases video of former sellers claiming they were duped "
    },
    {
        "content": "Two government probes into the conduct of longtime antagonists Pershing Square Holdings and Herbalife have failed to find sufficient evidence of criminal wrongdoing by either party  the Wall Street Journal said  citing people familiar with the matter.",
        "date": "01312016",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Ackman  Herbalife unscathed by probes: WSJ "
    },
    {
        "content": "Jan 31 Two government probes into the conduct of longtime antagonists Pershing Square Holdings and Herbalife have failed to find sufficient evidence of criminal wrongdoing by either party  the Wall Street Journal said  citing people familiar with the matter.",
        "date": "01312016",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Ackman  Herbalife unscathed by probes - WSJ "
    },
    {
        "content": "A federal judge dismissed a lawsuit accusing Herbalife Ltd  and Chief Executive Officer Michael Johnson of defrauding shareholders by misrepresenting that the weight-loss and nutritional products company's complied with laws designed to prevent pyramid schemes.",
        "date": "11252015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife  CEO prevail in 'pyramid scheme' lawsuit "
    },
    {
        "content": "* William Ackman made $1 billion bet against Herbalife   (Adds details from decision  allegations  other litigation  William Ackman bet  Herbalife comment  case citation  byline)",
        "date": "11252015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 1-Herbalife  CEO prevail in 'pyramid scheme' lawsuit "
    },
    {
        "content": "Nov 25 A federal judge has dismissed a shareholder lawsuit against Herbalife Ltd and Chief Executive Officer Michael Johnson  claiming they misrepresented the weight-loss and nutritional products company's compliance with laws designed to prevent pyramid schemes.",
        "date": "11252015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "U.S. judge dismisses shareholder lawsuit against Herbalife  CEO "
    },
    {
        "content": "NEW YORK  Nov 16 Soros Fund Management  one of the hedge funds industry's most closely watched investors  exited its bet on Herbalife  the nutrition company that rival investor William Ackman has called a fraud.",
        "date": "11172015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Soros Fund Management exits its bet on Herbalife "
    },
    {
        "content": "Nov 16 Soros Fund Management  which manages the investments of billionaire George Soros and his family  took new stakes in video streaming company Netflix Inc and casino operator Wynn Resorts Ltd during the third quarter.",
        "date": "11162015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Soros checks into Netflix  bids Herbalife adieu "
    },
    {
        "content": "Nov 16 Soros Fund Management  which manages the investments of billionaire George Soros and his family  took new stakes in video streaming company Netflix Inc and casino operator Wynn Resorts Ltd during the third quarter.",
        "date": "11162015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 1-Soros checks into Netflix  bids Herbalife adieu "
    },
    {
        "content": "NEW YORK  Nov 3 Just before Bill Ackman gave a presentation on Friday to defend one of his biggest investments  Valeant Pharmaceuticals  from allegations of accounting and insurance fraud  he was taunted by John Hempton  who runs a small hedge fund from Australia. It was the latest act in a long-running feud.",
        "date": "11032015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Valeant's crisis fuels feud between Ackman and Australian fund manager Hempton "
    },
    {
        "content": "NEW YORK  Oct 30 Influential short-seller Citron Research tweeted Friday that the shares of Valeant Pharmaceuticals International have a better chance of going to zero than Herbalife Ltd.",
        "date": "10302015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Citron tweets Valeant has better chance of going to zero than Herbalife ever will "
    },
    {
        "content": "BOSTON  Oct 21 Hedge fund mogul William Ackman has become one of the biggest casualties of a meltdown in pharmaceutical firm Valeant   with losses on the position amounting to roughly $1.8 billion so far this year  including more than $800 million at one point on Wednesday.",
        "date": "10212015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 1-Hedge fund mogul Ackman hit hard by huge Valeant bet "
    },
    {
        "content": "BOSTON/NEW YORK  Oct 7 Shares in nutrition company Herbalife Ltd  which billionaire investor William Ackman has accused of being a fraud  fell 7.5 percent on Wednesday  feeling the pressure from rival cosmetics maker Nu Skin's cut to sales forecasts.",
        "date": "10072015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife shares slump on Nu Skin  Ackman's 'new' information "
    },
    {
        "content": "NEW YORK  Sept 11 William Ackman  head of hedge fund firm Pershing Square Capital Management  said on Friday that stocks were cheap at current levels and that Mondelez International Inc could be an acquisition target.",
        "date": "09112015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "UPDATE 2-Pershing Square's Ackman tells CNBC Mondelez could be takeover target "
    },
    {
        "content": "July 29 A federal judge has dismissed a lawsuit accusing Herbalife Ltd and its chief executive officer of misrepresenting the weight-loss and nutritional products maker's sales practices as legitimate when the company was \"at its core\" a pyramid scheme.",
        "date": "07292015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "U.S. judge dismisses 'pyramid scheme' lawsuit vs Herbalife  CEO "
    },
    {
        "content": "A federal judge has dismissed a lawsuit accusing Herbalife Ltd  and its chief executive officer of misrepresenting the weight-loss and nutritional products maker's sales practices as legitimate when the company was \"at its core\" a pyramid scheme.",
        "date": "07292015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Judge dismisses 'pyramid scheme' lawsuit versus Herbalife  CEO "
    },
    {
        "content": "July 22 Herbalife Ltd filed a petition seeking information from micro-blogging company Twitter Inc  to identify an anonymous user who posted defamatory tweets against the weight-loss and nutritional products maker.",
        "date": "07222015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife files petition to seek user information from Twitter "
    },
    {
        "content": "July 22 Herbalife Ltd filed a petition seeking information from micro-blogging company Twitter Inc  to identify an anonymous user who posted defamatory tweets against the weight-loss and nutritional products maker.",
        "date": "07222015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "RPT-Herbalife files petition to seek user information from Twitter "
    },
    {
        "content": "BOSTON  June 26 Hedge fund manager William Ackman  who has made a $1 billion bet against Herbalife Ltd   on Friday asked the company's chief executive officer to release a video and say why he told an audience years ago that participating in Herbalife was a \"lottery ticket.\"",
        "date": "06272015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Hedge fund mogul Ackman asks Herbalife CEO to release video "
    },
    {
        "content": "BOSTON  May 15 A handful of big money managers boosted their stakes in Herbalife Ltd during the first quarter  joining billionaire investors Carl Icahn and George Soros in their gamble the company will overcome a raft of U.S. federal investigations.",
        "date": "05152015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "A few managers boost Herbalife stakes in first quarter joining Soros  Icahn "
    },
    {
        "content": "BOSTON  May 12 A union representing workers in New Jersey gambling hub Atlantic City said on Tuesday it asked the state's top prosecutor to investigate Herbalife Ltd  saying it is worried the nutrition supplements company could \"prey\" on unemployed workers in the casino industry.",
        "date": "05122015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Union calls on New Jersey Attorney General to probe Herbalife "
    },
    {
        "content": "Weight-loss and nutritional products maker Herbalife Ltd  raised its full-year profit forecast  encouraged by growing sales in China  sending its shares soaring after-hours.",
        "date": "05052015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife raises profit forecast as China sales jump  shares soar "
    },
    {
        "content": "May 5 Weight-loss and nutritional products maker Herbalife Ltd raised its full-year profit forecast  encouraged by growing sales in China  sending its shares soaring after-hours.",
        "date": "05052015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 1-Herbalife raises profit forecast as China sales jump  shares soar "
    },
    {
        "content": "May 5 Nutritional products maker Herbalife Ltd  reported a 5 percent rise in quarterly profit as costs fell and the company raised its full-year profit and sales forecasts.",
        "date": "05052015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife profit rises 5 pct as costs fall "
    },
    {
        "content": "NEW YORK  April 13 Billionaire investor William Ackman  who has long accused Herbalife Ltd of being a fraud  said on Monday that the top executives at the nutrition and supplements company are hiring their own lawyers as government investigations pick up pace.",
        "date": "04132015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Ackman says Herbalife execs are hiring their own lawyers "
    },
    {
        "content": "* Indexes up: Dow 0.52 pct  S&P 0.55 pct  Nasdaq 0.45 pct   (Updates to morning trading  adds data)",
        "date": "04062015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "US STOCKS-Wall Street up as Fed seen delaying move; utilities jump "
    },
    {
        "content": "BOSTON Some of the world's most prominent hedge fund managers suffered losses last month as the U.S. stock market's rally stalled  but most are still boasting gains for the quarter.",
        "date": "04032015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Some big name fund managers lose money in March as rally stalls "
    },
    {
        "content": "U.S. federal law enforcement agencies contacted several top Herbalife Ltd  members last week seeking information on their business practices  CNBC reported  citing sources familiar with the matter.",
        "date": "04062015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Top Herbalife members contacted by law enforcement agencies: CNBC "
    },
    {
        "content": "April 6 U.S. federal law enforcement agencies contacted several top Herbalife Ltd members last week seeking information on their business practices  CNBC reported  citing sources familiar with the matter.",
        "date": "04062015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 1-Top Herbalife members contacted by law enforcement agencies -CNBC "
    },
    {
        "content": "* Futures off: Dow 129 pts  S&P 14.5 pts  Nasdaq 30 pts   (Adds upcoming data  Uniqure  Qualcomm  Tesla; updates prices)",
        "date": "04062015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "US STOCKS-Wall Street to open lower in wake of weak jobs data "
    },
    {
        "content": "NEW YORK  April 6 U.S. stock index futures fell in low volume on Monday as Wall Street was set to open for the first time since Friday's surprisingly weak jobs data.",
        "date": "04062015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "US STOCKS-Futures fall in wake of weak payrolls data "
    },
    {
        "content": "BOSTON  March 30 Hedge fund mogul William Ackman  who has spent more than two years accusing Herbalife Ltd  of running a pyramid scheme  said on Monday that shutting down the company is the most important thing he can do.",
        "date": "03302015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Ackman says shutting Herbalife down is key to him "
    },
    {
        "content": "April 6 U.S. federal law enforcement agencies contacted several top Herbalife Ltd members last week for information about their own business practices  CNBC reported  citing sources familiar with the matter.",
        "date": "04062015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Top Herbalife members contacted by law enforcement agencies -CNBC "
    },
    {
        "content": "WASHINGTON  March 30 Hedge fund mogul William Ackman  who has spent more than two years accusing Herbalife Ltd  of running a pyramid scheme  said on Monday that shutting down the company is \"one of  the most important things\" he can do.",
        "date": "03302015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 1-Ackman says shutting Herbalife down is key to him "
    },
    {
        "content": "The hedge fund firm run by activist investor William Ackman said on Friday a federal judge's recent dismissal of a shareholder lawsuit against Herbalife Ltd did not \"exonerate or bless\" its business practices.",
        "date": "03202015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife not exonerated by U.S. judge: Pershing Square "
    },
    {
        "content": "Herbalife Ltd  won the dismissal of a lawsuit that claimed the maker of weight-loss and nutritional products fraudulently portrayed itself as a legitimate company  and that shareholders lost money because it was actually an illegal pyramid scheme.",
        "date": "03182015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife wins dismissal of U.S. 'pyramid scheme' lawsuit "
    },
    {
        "content": "March 20 The hedge fund firm run by activist investor William Ackman said on Friday a federal judge's recent dismissal of a shareholder lawsuit against Herbalife Ltd  did not \"exonerate or bless\" its business practices.",
        "date": "03202015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 2-Herbalife not exonerated by U.S. judge -Pershing Square "
    },
    {
        "content": "March 18 Herbalife Ltd won the dismissal of a lawsuit that claimed the maker of weight-loss and nutritional products fraudulently portrayed itself as a legitimate company  and that shareholders lost money because it was actually an illegal pyramid scheme.",
        "date": "03182015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 2-Herbalife wins dismissal of U.S. 'pyramid scheme' lawsuit "
    },
    {
        "content": "March 18 Herbalife Ltd has won the dismissal of a lawsuit that claims shareholders lost money because the maker of weight-loss and nutritional products portrayed itself as a legitimate company when it was actually an illegal pyramid scheme.",
        "date": "03182015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife wins dismissal of shareholder lawsuit "
    },
    {
        "content": "BOSTON Billionaire investor William Ackman has purchased a five percent stake in Valeant Pharmaceuticals    his hedge fund said on Monday  making him the Canadian drug company's fifth-largest stakeholder.",
        "date": "03092015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Exclusive: Ackman's Pershing Square makes $3.3 billion bet on Valeant "
    },
    {
        "content": "NEW YORK U.S. authorities investigating potential manipulation of Herbalife Ltd's shares by consultants working for billionaire investor William Ackman will find it difficult to prove that false statements were deliberately made to drive down the company's value  securities lawyers said.",
        "date": "03142015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Probe of Ackman team over Herbalife campaign may go nowhere: legal experts "
    },
    {
        "content": "Billionaire investor Bill Ackman said some people hired by a consulting group working for his hedge fund had received subpoenas from federal agencies investigating possible manipulation of Herbalife Ltd's  stock. | Video ",
        "date": "03132015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "People linked to Pershing Square probed over Herbalife: Ackman "
    },
    {
        "content": "March 13 Billionaire investor Bill Ackman said some people hired by a consulting group working for his hedge fund had received subpoenas from federal agencies investigating possible manipulation of Herbalife Ltd's stock.",
        "date": "03132015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "UPDATE 3-People linked to Pershing Square probed over Herbalife - Ackman "
    },
    {
        "content": "BOSTON Herbalife Ltd  cut the pay of Chief Executive Michael Johnson 36 percent for 2014 after the nutrition and weight loss company failed to meet performance goals set for him and other top executives  according to a securities filing on Friday.",
        "date": "02282015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Herbalife cuts pay of CEO Johnson 36 percent after missed targets "
    },
    {
        "content": "BOSTON  Feb 28 Herbalife Ltd cut the pay of Chief Executive Michael Johnson 36 percent for 2014 after the nutrition and weight loss company failed to meet performance goals set for him and other top executives  according to a securities filing on Friday.",
        "date": "02282015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Herbalife cuts pay of CEO Johnson 36 pct after missed targets "
    },
    {
        "content": "BOSTON Three of the top 20 investors in Herbalife Ltd  liquidated their positions during the fourth quarter when the nutrition and weight loss company missed Wall Street earnings estimates  but Soros Fund Management increased its holdings by roughly 80 percent  regulatory filings show.",
        "date": "02172015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Some top investors exit Herbalife  Soros added shares in fourth quarter "
    },
    {
        "content": "BOSTON  Feb 17 Three of the top 20 investors in Herbalife Ltd liquidated their positions during the fourth quarter when the nutrition and weight loss company missed Wall Street earnings estimates  but Soros Fund Management increased its holdings by roughly 80 percent  regulatory filings show.",
        "date": "02172015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "Some top investors exit Herbalife  Soros added shares in 4th qtr "
    },
    {
        "content": "Hedge fund Pershing Square Capital Management is pressing for seats on animal health company Zoetis Inc's board of directors  with an eye to pushing through cost cuts and a possible merger  according to sources familiar with the negotiations.",
        "date": "02042015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Exclusive: Ackman poised to win Zoetis board seats - sources "
    },
    {
        "content": "CHICAGO  Jan 13 Two years after first accusing the U.S.'s Herbalife Ltd of fraud  billionaire investor William Ackman reiterated on Monday that he expects the nutrition company's stock price to collapse to zero and said it would happen within a year.",
        "date": "01132015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Billionaire investor renews Herbalife attack with share collapse prediction "
    },
    {
        "content": "BOSTON  Jan 9 William Ackman is putting his money where his mouth is.",
        "date": "01092015",
        "name": "Herbalife LTD",
        "news_type": "normal",
        "symbol": "HLF",
        "title": "U.S. hedge fund manager Ackman makes $10 mln charity donation "
    },
    {
        "content": "NEW YORK The portfolio manager who led Soros Fund Management's bullish investment in nutritional supplements company Herbalife has left the investment firm  CNBC reported on Tuesday  citing unnamed sources.",
        "date": "01062015",
        "name": "Herbalife LTD",
        "news_type": "topStory",
        "symbol": "HLF",
        "title": "Soros portfolio manager who led Herbalife bet left firm: CNBC "
    }
]