[
    {
        "content": "ISLAMABAD  Nov 9 A body representing oil companies in Pakistan said Honda Motor Co  which has blamed local gasoline companies for damage to engines in one of its vehicle models  appears to know the engines are incompatible with Pakistani fuel standards and need to be calibrated.",
        "date": "11092017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda at fault in complaint over Pakistan gasoline  oil cos say "
    },
    {
        "content": "ISLAMABAD Pakistan's state oil and gas regulator said on Thursday it would investigate a complaint that fuel suppliers including local units of Shell and Total as well as Pakistan State Oil (PSO) had added manganese to their gasoline.",
        "date": "11022017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda says fuel from Shell  Total  PSO harms engines in Pakistan "
    },
    {
        "content": "ISLAMABAD  Nov 2 Pakistan's state oil and gas regulator said on Thursday it will investigate a complaint that fuel suppliers including local subsidiaries of Shell and Total as well as Pakistan State Oil (PSO) have added manganese to their gasoline.",
        "date": "11022017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Pakistan to probe complaint that Shell  Total  PSO added manganese to gasoline "
    },
    {
        "content": "ISLAMABAD  Nov 3 Pakistan's fuel suppliers said on Friday that gasoline sold locally meets regulatory requirements following a complaint filed by Honda Motor Co's Pakistan subsidiary accusing suppliers of adding a manganese-based additive to improve the octane rating.",
        "date": "11032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Pakistan's gasoline suppliers respond to Honda's complaint over quality "
    },
    {
        "content": "* American Honda Motor Co Inc. reported October sales of 127 353 Honda and Acura vehicles  an increase of 0.9 percent vs October 2016‍​ Source text: (http://bit.ly/2ikKf69) Further company coverage:",
        "date": "11012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-American Honda reports Oct sales of 127 353 Honda and Acura vehicles "
    },
    {
        "content": "TOKYO  Nov 2 Japan's Nikkei share average extended its strong rally to top a new 21-year peak on Thursday  ahead of a long weekend  with investors piling into miners and companies such as Honda Motor and Sony on robust earnings prospects.",
        "date": "11022017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Nikkei climbs to new 21-year peak; Honda  Sony shine "
    },
    {
        "content": "BEIJING Toyota Motor Corp   Japan's biggest automaker by volume  has fallen to the No. 3 spot among Japanese automakers in China  due to lack of presence in a key segment – a situation experts say will likely prevail well past the middle of 2018.",
        "date": "11032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Toyota China sales likely to grow steadily but lag Japan rivals "
    },
    {
        "content": "BEIJING  Nov 3 Toyota Motor Corp  Japan's biggest automaker by volume  has fallen to the No. 3 spot among Japanese automakers in China  due to lack of presence in a key segment – a situation experts say will likely prevail well past the middle of 2018.",
        "date": "11032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Toyota China sales likely to grow steadily but lag Japan rivals "
    },
    {
        "content": "TOKYO Honda Motor Co Ltd  on Wednesday raised its forecast for full-year operating profit by 2.8 percent as it expects to sell more cars and motorcycles this year  particularly in Asia  while it also sees cost reductions and a weaker yen boosting its bottom line.",
        "date": "11012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda raises full-year operating profit outlook on Asia sales "
    },
    {
        "content": "TOKYO  Nov 2 Japan's Nikkei share average extended its strong rally to top a new 21-year peak on Thursday morning  with the mining sector getting a boost while buyers continued to pile into companies such as Honda Motor and Sony on robust earnings prospects.",
        "date": "11022017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Nikkei at 21-year high; Honda  Sony up on earnings boost "
    },
    {
        "content": "* Posts 32.9 pct fall in Q2 operating profit (Adds executive comments on China  details on dividend and U.S. sales)",
        "date": "11012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda raises full-year operating profit outlook on Asia sales "
    },
    {
        "content": "* changes dividend policy to aim for shareholder returns of 30 percent with dividend alone  versus previous policy of combining dividend and share buybacks Further company coverage:",
        "date": "11012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda says changes dividend policy to aim for shareholder returns of 30 percent with dividend alone "
    },
    {
        "content": "* have reported to Japan transport ministry that they have found no issues with inspection process Source text for Eikon: Further company coverage:",
        "date": "10272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Toyota  Honda say reported to transport ministry that no issues found with inspection process "
    },
    {
        "content": "TOKYO Honda Motor Co  said on Wednesday it would begin selling compact electric vehicles (EVs) in Japan in 2020 following a release in Europe in 2019  but its chief executive said it remained a tough business.",
        "date": "10252017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda to add compact EVs in Japan in 2020  cost hurdles remain: CEO "
    },
    {
        "content": "TOKYO  Oct 25 Honda Motor Co said on Wednesday it would begin selling compact electric vehicles (EVs) in Japan in 2020 following a release in Europe in 2019  but its chief executive said it remained a tough business.",
        "date": "10252017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "AUTOSHOW-Honda to add compact EVs in Japan in 2020  cost hurdles remain -CEO "
    },
    {
        "content": "* Says board approves car financing JV to issue up to 4.0 billion yuan  ($604.32 million) car mortgage asset-backed securities",
        "date": "10202017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Guangzhou Automobile's unit plans financing  JV with Honda to start AC model project "
    },
    {
        "content": "* Japan's Honda Motor plans to start selling motorized scooters that run on detachable batteries in Southeast Asia starting as early as 2019 - Nikkei‍​ Source: http://s.nikkei.com/2yAZDoz Further company coverage:",
        "date": "10182017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor eyeing electric scooter that can power home appliances - Nikkei‍​ "
    },
    {
        "content": "* China may not hit 5 pct annual growth forecast- industry body",
        "date": "10122017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-China monthly vehicle sales rise again; may miss annual target -industry body "
    },
    {
        "content": "* World's top auto market picking up speed in recent months (Adds Honda sales figures  analyst comments  context)",
        "date": "10102017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-Japan carmakers enjoy cruise in China fast lane "
    },
    {
        "content": "DETROIT  Oct 3 Major automakers on Tuesday posted higher U.S. new vehicle sales in September as consumers in hurricane-hit parts of the country  replaced flood-damaged cars  extending a rally in their shares that began when Hurricane Harvey hit southeast Texas in late August.",
        "date": "10032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 4-Hurricane recovery helps boost U.S. September new auto sales "
    },
    {
        "content": "* Honda Motor is set to shift production of Super Cub motorcycle back to Japan from China - Nikkei Source text: (http://s.nikkei.com/2xaRVgl) Further company coverage:",
        "date": "10022017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor to shift production of Super Cub motorcycle back to Japan -Nikkei "
    },
    {
        "content": "* Says slimmed down operations will allow more focus on EVs (Adds industry context)",
        "date": "10042017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 3-Honda to cut Japanese production by a quarter as domestic sales stagnate "
    },
    {
        "content": "TOKYO Honda Motor Co  plans to end production at its Sayama plant in Japan by 2022  cutting domestic capacity by around 24 percent as it shifts focus to electric cars (EVs) and other new technologies.",
        "date": "10042017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to cut Japanese production by a quarter as domestic sales stagnate "
    },
    {
        "content": "* Honda is considering consolidating 2 saitama plants - kyodo Source text for Eikon: Further company coverage:",
        "date": "10042017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda is considering consolidating 2 saitama plants - kyodo "
    },
    {
        "content": "TOKYO  Oct 4 Honda Motor Co said Chief Executive Takahiro Hachigo would hold a news conference at 3:30 p.m. (0630 GMT) on Wednesday at the company's headquarters.",
        "date": "10042017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda CEO to hold news conference at 0630 GMT "
    },
    {
        "content": "SINGAPORE Formula One engine supplier Honda  having parted ways with McLaren  is setting its sights on challenging among the top-three next season with new partners Toro Rosso  a senior executive said.",
        "date": "09152017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Motor racing: Honda set top-three goal with new partner Toro Rosso "
    },
    {
        "content": "SINGAPORE  Sept 14 Former world champions Red Bull and engine supplier Renault are set to part company after the 2018 Formula One season  media reports said on Thursday.",
        "date": "09142017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-Red Bull and Renault set to split after 2018 - reports "
    },
    {
        "content": "SINGAPORE  Sept 15 Formula One engine supplier Honda  having parted ways with McLaren  is setting its sights on challenging among the top-three next season with new partners Toro Rosso  a senior executive said.",
        "date": "09152017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-Honda set top-three goal with new partner Toro Rosso "
    },
    {
        "content": "DETROIT Honda Motor Co Ltd  said on Monday its has invested $267 million and will add 300 new jobs to support increased production of its revamped 2018 Accord sedan model at the Japanese automaker's plant in Marysville  Ohio.",
        "date": "09182017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda invests $267 million  to add 300 jobs for new Accord model "
    },
    {
        "content": "SINGAPORE Former champions McLaren will swap their Honda engines for Renault ones at the end of the Formula One season after calling time on a troubled three-year partnership marked by frustration and failure.",
        "date": "09152017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing: McLaren split from Honda and switch to Renault "
    },
    {
        "content": "* Spanish driver Carlos Sainz moves to Renault for 2018 (Repeats adding link to earlier story)",
        "date": "09152017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Motor racing-McLaren split from Honda and switch to Renault "
    },
    {
        "content": "SINGAPORE  Sept 15 Former champions McLaren will swap their Honda engines for Renault ones at the end of the Formula One season after calling time on a troubled three-year partnership marked by frustration and failure.",
        "date": "09152017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-McLaren split from Honda and switch to Renault "
    },
    {
        "content": "DETROIT  Sept 18 Honda Motor Co Ltd said on Monday its has invested $267 million and will add 300 new jobs to support increased production of its revamped 2018 Accord sedan model at the Japanese automaker's plant in Marysville  Ohio.",
        "date": "09182017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda invests $267 mln  to add 300 jobs for new Accord model "
    },
    {
        "content": "SINGAPORE Russian Formula One driver Daniil Kvyat dodged questions about Toro Rosso's expected 2018 engine deal with Honda on Wednesday  saying he saw \"good things ahead\" for his Red Bull-owned team.",
        "date": "09132017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Motor racing - Toro Rosso's Kvyat expects 'good things' as Honda deal awaited "
    },
    {
        "content": "SINGAPORE  Sept 13 Russian Formula One driver Daniil Kvyat dodged questions about Toro Rosso's expected 2018 engine deal with Honda on Wednesday  saying he saw \"good things ahead\" for his Red Bull-owned team.",
        "date": "09132017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-Toro Rosso's Kvyat expects \"good things\" as Honda deal awaited "
    },
    {
        "content": "* Says unit has signed MOU with Honda Motor in first half of 2017 on business development in areas such as electric vehicles",
        "date": "09132017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-China's Neusoft signs MOU  in advance discussions with Honda Motor "
    },
    {
        "content": "* Honda Motor to discontinue production and sales of diesel version of CR-V in Europe  prompted by increasingly strict regulations - Nikkei Source text: [ID:http://s.nikkei.com/2j8L3i5] Further company coverage:",
        "date": "09072017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motors to discontinue production and sales of diesel version of CR-V in Europe - Nikkei "
    },
    {
        "content": "TOKYO  Sept 7 The driver punched the air as his red and white Honda McLaren roared over the finish line. It was Suzuka  Japan  1988  and Ayrton Senna had just become Formula One world champion for the first time. The McLaren racing team and its engine maker  Honda Motor  were unstoppable that year  their drivers winning all but one of the 16 grand prix races.",
        "date": "09072017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "SPECIAL REPORT-How Honda lost its mojo - and the mission to get it back "
    },
    {
        "content": "BEIJING General Motors Co’s  vehicle sales in China rose 12 percent in August from a year earlier to 328 425 units  following a 6.3 percent increase in July  the Detroit-based automaker said on Tuesday.",
        "date": "09052017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "GM August China vehicle sales up 12 percent year on year "
    },
    {
        "content": "BEIJING Toyota Motor Corp’s sales in China grew 13.2 percent in August from a year earlier while smaller rival Honda's sales jumped over a fifth for the month  keeping intact a trend of Honda outselling Toyota in the world's biggest auto market.",
        "date": "09042017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda again outsells Toyota in China "
    },
    {
        "content": "* Toyota China Aug sales up 13.2 pct yoy  Jan-Aug sales up 7.1 pct",
        "date": "09042017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda again outsells Toyota in China "
    },
    {
        "content": "MONZA  Italy McLaren's unhappy partnership with Honda appeared to be heading for divorce on Sunday after an Italian Grand Prix of hefty grid penalties  poor performance and no points for the former champions.",
        "date": "09032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Divorce on the cards for unhappy McLaren and Honda "
    },
    {
        "content": "MONZA  Italy  Sept 3 McLaren's unhappy partnership with Honda appeared to be heading for divorce on Sunday after an Italian Grand Prix of hefty grid penalties  poor performance and no points for the former champions.",
        "date": "09032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-Divorce on the cards for unhappy McLaren and Honda "
    },
    {
        "content": "* Honda says reached agreement to resolve economic loss claims in Takata Airbag inflator multidistrict class action litigation in the United States",
        "date": "09012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda says reaches agreement to settle Takata Airbag inflator MDL "
    },
    {
        "content": "DETROIT  Sept 1 Shares of the Big Three Detroit automakers rose on Friday despite lackluster August sales  with investors focusing on a likely surge in demand as residents of the U.S. Gulf Coast replace flood-damaged cars and trucks.",
        "date": "09012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 4-Automaker shares rise as Texans must replace drowned cars "
    },
    {
        "content": "Sept 1 Honda Motor Co will announce a $605 million economic loss settlement on Friday covering 11.4 million owners of U.S. vehicles with potentially faulty Takata air bag inflators  sources briefed on the matter said.",
        "date": "09012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda reaches $605 mln U.S. settlement over Takata air bags "
    },
    {
        "content": "WASHINGTON Honda Motor Co  said it agreed to a $605 million so-called economic loss settlement on Friday covering up to 16.5 million U.S. vehicles with potentially faulty Takata air bag inflators.",
        "date": "09012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda reaches $605 million U.S. settlement over Takata air bags "
    },
    {
        "content": "WASHINGTON  Sept 1 Honda Motor Co said it agreed to a $605 million so-called economic loss settlement on Friday covering up to 16.5 million U.S. vehicles with potentially faulty Takata air bag inflators.",
        "date": "09012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda reaches $605 mln U.S. settlement over Takata air bags "
    },
    {
        "content": "* American Honda Motor says reported total august sales of 146 015 Honda and Acura vehicles  a slight decrease of 2.4 percent versus August 2016 Source text (http://prn.to/2iOASPg) Further company coverage:",
        "date": "09012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-American Honda Motor reports August sales of 146 015 Honda and Acura vehicles "
    },
    {
        "content": "* Honda Cars India-registers 25 pct sales growth in August 2017",
        "date": "09012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda Cars India says August sales grew 25 pct y-o-y "
    },
    {
        "content": "SPA-FRANCORCHAMPS  Belgium McLaren may have no choice but to stay with Honda next season after the Japanese manufacturer played down talk of a switch to Toro Rosso  and Renault said supplying more than three teams would hurt their current partners.",
        "date": "08252017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "McLaren may have to stick with Honda "
    },
    {
        "content": "SPA-FRANCORCHAMPS  Belgium  Aug 25 McLaren may have no choice but to stay with Honda next season after the Japanese manufacturer played down talk of a switch to Toro Rosso  and Renault said supplying more than three teams would hurt their current partners.",
        "date": "08252017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-McLaren may have to stick with Honda "
    },
    {
        "content": "SINGAPORE  Aug 4 Uber Technologies Inc said on Friday it has taken action to fix defective cars that it had rented to drivers in Singapore and was coordinating with regulators in the city state to resolve any concerns.",
        "date": "08042017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Uber takes action to fix unsafe cars rented to Singapore drivers "
    },
    {
        "content": " (This August 1 story corrects fourth paragraph to say Honda's North American vehicle sales fell 5.7 percent in the first quarter  not 7.6 percent  and Asian sales rose 15.5 percent  not 10.8 percent)",
        "date": "08032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda posts strong first quarter  sees higher annual profit on favorable forex "
    },
    {
        "content": "* Total July 2017 sales of 150 980 Honda and Acura vehicles  a decrease of 1.2 percent versus July 2016 Source text for Eikon: [http://bit.ly/2ugOkfv] Further company coverage:",
        "date": "08012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-American Honda Motor reports total July sales of 150 980 Honda and Acura vehicles  down 1.2 pct "
    },
    {
        "content": "BUDAPEST  July 28 Sauber have signed a multi-year agreement to continue using  Ferrari engines after this season  the Swiss Formula One team said on Friday.",
        "date": "07282017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-Sauber to stay with Ferrari engines in 2018 "
    },
    {
        "content": "* Honda revises USD/JPY rate to 107 yen vs pvs f'cast 105 yen",
        "date": "08032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "CORRECTED-UPDATE 2-Honda posts strong Q1  sees higher annual profit on favourable forex "
    },
    {
        "content": "DETROIT  Aug 1 U.S. carmakers said on Tuesday they continued to slash low-margin sales to daily rental fleets in July as the overall pace of U.S. car and light truck sales fell for the fifth straight month.",
        "date": "08012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 5-U.S. auto sales fall in July as carmakers slash rental fleet sales "
    },
    {
        "content": "TOKYO  Aug 1 Honda Motor Co. posted a 0.9 percent rise in operating profit for the first quarter as strong Asian sales of cars and  motorcycles helped offset a slide in North American demand  while a positive currency impact also aided the bottom line.",
        "date": "08012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Japan's Honda posts stronger-than-expected Q1 operating profit "
    },
    {
        "content": "BEIJING Honda Motor Co is outselling its bigger  deeper-pocketed rival Toyota Motor Corp in China this year  data from the Japanese companies shows  helped by new model launches and strong sport-utility vehicle (SUV) offerings.",
        "date": "08022017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda's new model launches  SUVs help it outsell Toyota in China "
    },
    {
        "content": "* Toyota sells 732 900 in same period  up 6.2 pct yoy (Recasts; adds Honda numbers and analyst comments)",
        "date": "08022017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda's new model launches  SUVs help it outsell Toyota in China "
    },
    {
        "content": "LONDON Honda protege Nobuharu Matsushita will have his first experience of driving a Formula One car when he tests with Sauber in Hungary next week  the Swiss-based team said on Monday.",
        "date": "07242017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Matsushita to test with Sauber F1 team "
    },
    {
        "content": "Honda Motor Co said on Thursday that a Takata airbag inflator ruptured in car crash last week in Florida  in what could be the 19th death worldwide linked to faulty airbags recalled as part of the largest automotive safety campaign in history.",
        "date": "07272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda says Florida crash death may be linked to Takata air bag inflator "
    },
    {
        "content": "LONDON  July 24 Honda protege Nobuharu Matsushita will have his first experience of driving a Formula One car when he tests with Sauber in Hungary next week  the Swiss-based team said on Monday.",
        "date": "07242017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-Matsushita to test with Sauber F1 team "
    },
    {
        "content": "July 27 Honda Motor Co said on Thursday that a Takata airbag inflator ruptured in car crash last week in Florida  in what could be the 19th death worldwide linked to faulty airbags recalled as part of the largest automotive safety campaign in history.",
        "date": "07272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda says Florida crash death may be linked to Takata air bag inflator "
    },
    {
        "content": "Honda Motor Co said on Thursday that a Takata airbag inflator ruptured in car crash last week in Florida  in what could be the 19th death worldwide linked to faulty airbags recalled as part of the largest automotive safety campaign in history.",
        "date": "07272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda says Florida crash death could be linked to Takata inflator "
    },
    {
        "content": "BUDAPEST Sauber's planned Formula One partnership with troubled Japanese engine maker Honda from next season has been canceled  both parties announced at the Hungarian Grand Prix on Thursday.",
        "date": "07272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Sauber and Honda cancel planned F1 partnership "
    },
    {
        "content": "* Swiss team says move made for strategic reasons (Adds Honda statement  background  byline)",
        "date": "07272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Motor racing-Sauber and Honda cancel planned F1 partnership "
    },
    {
        "content": "BUDAPEST  July 27 Sauber's planned Formula One partnership with troubled engine maker Honda from 2018 has been cancelled  the Swiss-based team said in a statement at the Hungarian Grand Prix on Thursday.",
        "date": "07272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-Sauber cancel planned F1 engine deal with Honda "
    },
    {
        "content": "DETROIT  July 13 Honda Motor Co Ltd on Friday will unveil its newest-generation Accord  one of four re-engineered midsize sedans that Asian automakers are betting on to win market share as Detroit automakers shift focus to SUVs  crossovers and pickup trucks.",
        "date": "07132017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "New Honda Accord charges into a slumping U.S. sedan market "
    },
    {
        "content": "DETROIT Honda Motor Co Ltd  on Friday will unveil its newest-generation Accord  one of four re-engineered midsize sedans that Asian automakers are betting on to win market share as Detroit rivals shift focus to SUVs  crossovers and pickup trucks.",
        "date": "07142017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "New Honda Accord charges into a slumping U.S. sedan market "
    },
    {
        "content": "DETROIT  July 13 Honda Motor Co Ltd on Friday will unveil its newest-generation Accord  one of four re-engineered midsize sedans that Asian automakers are betting on to win market share as Detroit rivals shift focus to SUVs  crossovers and pickup trucks.",
        "date": "07142017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-New Honda Accord charges into a slumping U.S. sedan market "
    },
    {
        "content": "WASHINGTON  July 14 Honda Motor Co said on Friday it would recall about 2.1 million vehicles worldwide to replace battery sensors due to the risk of fire.",
        "date": "07142017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda recalls 2.1 million vehicles worldwide over fire risk "
    },
    {
        "content": "DETROIT  July 13 Honda Motor Co Ltd on Friday will unveil its newest-generation Accord  one of four re-engineered midsize sedans that Asian automakers are betting on to win market share as Detroit automakers shift focus to SUVs  crossovers and pickup trucks.",
        "date": "07142017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "RPT-New Honda Accord charges into a slumping U.S. sedan market "
    },
    {
        "content": "WASHINGTON  July 10 Honda Motor Co said Monday it had confirmed an 11th U.S. death involving one of its vehicles tied to a faulty Takata Corp air bag inflator.",
        "date": "07102017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda confirms 11th U.S. death tied to ruptured Takata air bag inflator "
    },
    {
        "content": "WASHINGTON  July 10 Honda Motor Co said on Monday it had confirmed an 11th U.S. death involving one of its vehicles tied to a faulty Takata Corp air bag inflator.",
        "date": "07102017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda confirms 11th U.S. death tied to ruptured Takata air bag inflator "
    },
    {
        "content": "* American Honda Motor Co - total June sales of 139 793 Honda and Acura vehicles  an increase of 0.8 percent over June 2016. Source text for Eikon: Further company coverage:",
        "date": "07032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-American Honda Motor reports total June sales of 139 793 Honda and Acura vehicles "
    },
    {
        "content": "* Honda Motor Co says no final agreement reached with Takata Corp over inflator recall responsibilities",
        "date": "06262017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda says no final agreement with Takata over inflator recall responsibilities "
    },
    {
        "content": "* Honda Motor  Toyota Motor and Nissan Motor will continue to financially support Takata after it files for bankruptcy protection - Nikkei",
        "date": "06222017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda  Toyota  Nissan to continue to financially support Takata after bankruptcy filing - Nikkei "
    },
    {
        "content": "DETROIT  June 23 Honda Motor Co on Friday released a 2013 email in which one of its engineers suggested that he knew some hidden truth about \"the root cause\" of Takata Corp air bag failures  but the engineer later said he was mistaken.",
        "date": "06232017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda engineer debunks own claim about cause of Takata air bag failures "
    },
    {
        "content": "TOKYO  June 21 Honda Motor Co said on Wednesday it halted production at a domestic vehicle plant for a day this week after finding the WannaCry ransomware that struck globally last month in its computer network.",
        "date": "06212017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda halts Japan car plant after WannaCry virus hits computer network "
    },
    {
        "content": "DETROIT  June 23 Honda Motor Co on Friday released a 2013 email in which one of its engineers suggested that he knew some hidden truth about \"the root cause\" of Takata Corp air bag failures  but the engineer later said he was mistaken.",
        "date": "06232017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda engineer debunks own claim about cause of Takata air bag failures "
    },
    {
        "content": "* Honda adding staff to accelerate Chinese SUV Output - Nikkei",
        "date": "06132017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda adding staff to accelerate Chinese SUV Output - nikkei "
    },
    {
        "content": "* Mid-term plan highlights need to look beyond conventional cars",
        "date": "06082017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to focus on self-driving cars  robotics  EVs through 2030 "
    },
    {
        "content": "LONDON British manufacturer Triumph will replace Honda as Moto2's exclusive engine supplier from 2019 on a three-year deal  series organizers announced on Saturday.",
        "date": "06032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Triumph to replace Honda as Moto2 supplier in 2019 "
    },
    {
        "content": "SEOUL  June 2 Vehicle sales in China for Hyundai Motor  South Korea's biggest car maker  fell 65 percent in May  following political tensions between the two Asian countries over the deployment of a United States missile system.",
        "date": "06022017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Hyundai Motor China sales dive 65 percent in May amid political tensions "
    },
    {
        "content": "* American Honda Motor Co.  Inc. says reported total May sales of 148 414 Honda and Acura vehicles  an increase of 0.9 percent over May 2016 Source text - (http://bit.ly/2rfqkv3) Further company coverage:",
        "date": "06012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-American Honda Motor reports total May sales of 148 414 Honda and Acura vehicles  up 0.9 pct "
    },
    {
        "content": "LONDON  June 3 British manufacturer Triumph will replace Honda as Moto2's exclusive engine supplier from 2019 on a three-year deal  series organisers announced on Saturday.",
        "date": "06032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motorcycling-Triumph to replace Honda as Moto2 supplier in 2019 "
    },
    {
        "content": "* China sales in April totalled 109 518 vehicles  up 29.4 percent a year earlier",
        "date": "05092017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda's China sales in April up 29.4 pct y/y "
    },
    {
        "content": "SOCHI  Russia Honda will supply the Swiss-based Sauber Formula One team with engines from 2018 as well as McLaren in a move that the Japanese manufacturer hopes will help speed up the development of its troubled power unit.",
        "date": "04302017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Motor racing: Honda to supply engines to Sauber from 2018 "
    },
    {
        "content": "* Japanese manufacturer behind others on performance (Adds detail)",
        "date": "04302017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Motor racing-Honda to supply engines to Sauber from 2018 "
    },
    {
        "content": "TOKYO  May 1 The United States will begin an investigation into whether thermoplastic components used in some Japanese and German vehicle models sold in the country violate its patent laws  trade authorities said late last week.",
        "date": "05012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "U.S. to probe Japanese  German automakers over alleged patent violations "
    },
    {
        "content": "SOCHI  Russia  April 30 Honda will supply the Sauber Formula One team with engines from the 2018 season  both sides announced on Sunday at the Russian Grand Prix.",
        "date": "04302017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-Honda to supply Sauber F1 team with engines from 2018 "
    },
    {
        "content": "* Honda Motor  which plans to release an electric vehicle in the chinese market next year  is expected to produce it locally - Nikkei",
        "date": "04252017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor  which plans to release an electric vehicle in Chinese market next year  expects to produce locally- Nikkei "
    },
    {
        "content": "SOCHI  Russia McLaren's beleaguered engine partners Honda are talking to several teams about a possible supply for next season  the Japanese manufacturer's Formula One chief Yusuke Hasegawa said on Friday.",
        "date": "04282017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Motor racing: Honda talking to 'various teams' about Formula One engine supply "
    },
    {
        "content": "SOCHI  Russia  April 28 McLaren's beleaguered engine partners Honda are talking to several teams about a possible supply for next season  the Japanese manufacturer's Formula One chief Yusuke Hasegawa said on Friday.",
        "date": "04282017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Motor racing-Honda talking to 'various teams' about F1 engine supply "
    },
    {
        "content": "TOKYO Honda Motor Co  forecast a 16 percent fall in operating profit for the current financial year as the Japanese automaker sees higher auto sales being offset by a stronger yen and research and development costs.",
        "date": "04282017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda sees auto sales edging up  profit sliding in 2017/18 "
    },
    {
        "content": "* Honda sees 705 bln yen operating profit  -16.1 pct from 16/17",
        "date": "04282017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda sees auto sales edging up  profit sliding in 2017/18 "
    },
    {
        "content": "TOKYO  April 28 Honda Motor Co forecast on Friday a 16.1 percent fall in operating profit for the current financial year as the Japanese automaker expects a stronger yen  changes to its pension plan and research and development costs will weigh on earnings even as auto sales rise.",
        "date": "04282017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda forecasts lower operating profit in 2017/18 "
    },
    {
        "content": "* Honda Motor said it aims to boost its two-wheeler sales in India by 20% to 6 million units  including exports  in current FY ending March - Nikkei",
        "date": "04202017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor said it aims to boost its two-wheeler sales in India by 20% in current FY - Nikkei "
    },
    {
        "content": "WASHINGTON Honda Motor Co Ltd said on Wednesday a driver of a 2002 Accord was seriously injured after a faulty Takata air bag inflator ruptured during a March 3 crash in Las Vegas  Nevada.",
        "date": "04192017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda says U.S. driver seriously injured in Takata inflator rupture "
    },
    {
        "content": "WASHINGTON  April 19 Honda Motor Co Ltd said on Wednesday a driver of a 2002 Accord was seriously injured after a faulty Takata air bag inflator ruptured during a March 3 crash in Las Vegas  Nevada.",
        "date": "04192017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda says U.S. driver seriously injured in Takata inflator rupture "
    },
    {
        "content": "* Honda Motor will roll out its first electric vehicle for the Chinese market in 2018- Nikkei Source text for Eikon: Further company coverage:",
        "date": "04192017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor will roll out its first electric vehicle for the Chinese market in 2018- Nikkei "
    },
    {
        "content": "TOKYO  April 12 Toyota Motor Corp said it will commercialise rehabilitation robots later this year when it makes its robotic walk assist system available for rent  joining Honda Motor Co in marketing mobility devices for Japan's ageing population.",
        "date": "04122017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Toyota robot to keep elderly mobile  one step at a time "
    },
    {
        "content": "* Industry had feared weak Q1 sales on tax cut rollback (Adds CAAM official quote)",
        "date": "04112017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-China Q1 auto sales strongest since 2014 despite tax cut rollback "
    },
    {
        "content": "DETROIT  April 3 U.S. sales of new vehicles in March at major automakers came in below market expectations  according to figures released on Monday  sending shares of General Motors Co and Ford Motor Co down more than 2 percent.",
        "date": "04032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "U.S. March new auto sales fall short of market expectations "
    },
    {
        "content": "* EGP floatation had negative impact of EGP 100.2 million fy results",
        "date": "03262017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Egypt's Suez Canal Bank posts FY profit "
    },
    {
        "content": "* Top management change in Honda Motorcycle & Scooter India Pvt. Ltd",
        "date": "03272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motorcycle & Scooter India appoints Minoru Kato as president  CEO "
    },
    {
        "content": "TOKYO  March 27 After three decades building an airplane from scratch  Michimasa Fujino  56  chief engineer of the Hondajet  might have to reach a ripe old age to see Honda Motor Co's pet aviation project recoup its development costs.",
        "date": "03272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda faces long haul to recoup jet costs "
    },
    {
        "content": "March 6 Honda Motor Co Ltd said on Monday it had invested nearly $150 million in two U.S. plants for making 10-speed automatic transmission for front-wheel-drive vehicles.",
        "date": "03062017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to begin U.S. production of new 10-speed transmission "
    },
    {
        "content": "ATHENS  March 7 Greece's second-largest lender National Bank (NBG) agreed to sell its entire 99.8 percent stake in its South Africa Bank of Athens (SABA) subsidiary to AFGRI Holdings as part of an EU-approved restructuring plan  the bank said on Tuesday.",
        "date": "03072017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Greece's National Bank agrees to sell South African unit "
    },
    {
        "content": "* Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"AA\" -R&I",
        "date": "02272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-R&I affirms Honda Motor Co Ltd's rating at \"AA\" and changes outlook to stable from negative -R&I "
    },
    {
        "content": "* Honda Canada Inc says president and Ceo Jerry Chenkin to retire",
        "date": "02212017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Canada says president  CEO Jerry Chenkin to retire "
    },
    {
        "content": "MOSCOW  Feb 21 Russia's standards agency  Rosstandart  said the local retailer of Honda and Acura cars had informed it of the recall of up to 135 491 cars due to possible airbag faults.",
        "date": "02212017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Russia announces recall of 135 491 Honda and Acura cars "
    },
    {
        "content": "JAKARTA  Feb 20 Indonesia's anti-monopoly agency said on Monday that two companies that make and distribute Yamaha and Honda motorbikes  there were guilty of price-fixing.",
        "date": "02202017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Indonesia watchdog says Yamaha  Honda distributors guilty of price-fixing "
    },
    {
        "content": "* Sumitomo Mitsui Trust Holdings Inc reports a 5.3 percent passive stake in Honda Motor Co Ltd as of december 31  2016 -sec filing  Source text : [ID:http://bit.ly/2kzoHoI] Further company coverage:",
        "date": "02102017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Sumitomo Mitsui Trust Holdings reports a 5.3 percent passive stake in Honda Motor Co as of Dec 31  2016 "
    },
    {
        "content": "TOKYO Honda Motor Co Ltd and Hitachi Ltd's auto parts subsidiary plan to form a joint venture to develop  produce and sell motors for electric vehicles (EV)  joining forces to better compete in the highly specialized \"green\" car segment.",
        "date": "02072017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda  Hitachi Automotive to form EV motor joint venture "
    },
    {
        "content": "* Analyst: High tech costs require more industry tie-ups   (Adds details of partnership  analyst comments)",
        "date": "02072017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda  Hitachi Automotive to form EV motor joint venture "
    },
    {
        "content": "TOKYO  Feb 7 Honda Motor Co Ltd and Hitachi Ltd's automotive unit said on Tuesday they would form a joint venture to develop  produce and sell motors for electric cars.",
        "date": "02072017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda  Hitachi Automotive say to form EV motor joint venture "
    },
    {
        "content": "TOKYO  Feb 7 Honda Motor Co Ltd and parts supplier Hitachi Automotive Systems Ltd on Tuesday said they would hold a news conference on an operational partnership later in the day.",
        "date": "02072017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda  Hitachi Automotive to hold briefing on operational partnership "
    },
    {
        "content": "* Honda Motor will reduce its number of sales networks in Japan from five to two by april 2018  the company said Monday - Nikkei",
        "date": "02062017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor  Kawasaki Heavy Industries to reduce number of sales networks in Japan - Nikkei "
    },
    {
        "content": "TOKYO Japan's Honda Motor Co Ltd  on Friday said it would need to rethink its operations in Mexico if the United States  its biggest market  raised tariffs on imports from the country as proposed by U.S. President Donald Trump.",
        "date": "02032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda says U.S. tariffs on Mexican imports would prompt operational rethink "
    },
    {
        "content": "* Around two-thirds of U.S. 2016 sales were locally made   (Adds comments on Trump tariff proposal  details on U.S.  Mexico operations)",
        "date": "02032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda says U.S. tariffs on Mexican imports would prompt operational rethink "
    },
    {
        "content": "Feb 3 Honda Motor Co Ltd Executive Vice President Seiji Kuraishi says:",
        "date": "02032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda exec: Hope Trump understands Honda's presence in U.S. "
    },
    {
        "content": "DETROIT  Feb 1 U.S. car and light truck sales slipped 1.8 percent in January as automakers pulled back on bulk sales to rental  government and business fleets and concentrated on more profitable retail sales to individual consumers.",
        "date": "02012017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 3-U.S. car  truck sales downshift in January; Toyota falls 11 pct "
    },
    {
        "content": "TOKYO  Jan 30 Honda Motor Co Ltd and General Motors Co (GM) will jointly produce hydrogen fuel cell power systems in the United States from around 2020  to cut costs and ramp up output in the hope of increasing take-up of the zero-emission cars.",
        "date": "01302017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda  GM to jointly produce fuel cell power systems in U.S. from 2020 "
    },
    {
        "content": "TOKYO  Feb 3 Honda Motor Co on Friday lifted its annual net profit forecast for the second time in as many quarters due to cost-cutting and the impact of a weakening yen  while sales in China remained strong.",
        "date": "02032017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda raises full-year profit outlook on lower costs  weaker yen "
    },
    {
        "content": "TOKYO/DETROIT  Jan 30 Honda Motor Co Ltd  and General Motors Co (GM) will jointly produce pollution-free hydrogen fuel cell power systems in the United States from around 2020  the companies said Monday  despite President Donald Trump's promises to dismantle U.S. environmental regulations intended to spur green car demand.",
        "date": "01302017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda  GM to jointly produce fuel cell power systems in U.S. from 2020 "
    },
    {
        "content": "DETROIT General Motors Co and Honda Motor Co are expected on Monday to announce an expansion of their collaboration on fuel cell technology development  people familiar with the plans said following a notice of a press conference.",
        "date": "01272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "GM  Honda to announce fuel cell technology advance: sources "
    },
    {
        "content": "DETROIT  Jan 27 General Motors Co and Honda Motor Co are expected on Monday to announce an expansion of their collaboration on fuel cell technology development  people familiar with the plans said following a notice of a press conference.",
        "date": "01272017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "GM  Honda to announce fuel cell technology advance -sources "
    },
    {
        "content": "TOKYO  Jan 17 Japan's Nikkei fell to its lowest level in more than a month on Tuesday as a strong yen soured sentiment  while shares of Honda tumbled after it said an air bag made by Takata Corp had ruptured in one of its cars in Japan.",
        "date": "01172017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Nikkei falls to near 6-week low on strong yen; Honda tumbles "
    },
    {
        "content": "* Honda to sell Civic sedan in Japan for first time since 2010",
        "date": "01132017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Back home: Honda brings Civic sedan to Japan in branding push "
    },
    {
        "content": "* Honda Motor will halt one of its three automobile assembly lines in Thailand by the end of March - Nikkei",
        "date": "01122017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor to halt one automobile assembly line in Thailand - Nikkei "
    },
    {
        "content": "NEW YORK Japan's Takata Corp is expected to plead guilty to criminal wrongdoing as early as Friday as part of a $1 billion settlement with the U.S. Justice Department over its handling of air bag ruptures linked to 16 deaths worldwide  sources said.",
        "date": "01122017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Takata to pay $1 bln to settle U.S. air bag probe -sources "
    },
    {
        "content": "NEW YORK  Jan 12 Japan's Takata Corp is expected to plead guilty to criminal wrongdoing as early as Friday as part of a $1 billion settlement with the U.S. Justice Department over its handling of air bag ruptures linked to 16 deaths worldwide  sources said.",
        "date": "01122017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 3-Takata to pay $1 bln to settle U.S. air bag probe -sources "
    },
    {
        "content": "* Honda of Canada Mfg announced that it will invest $492 million over next three years to modernize its Ontario manufacturing facilities  Source text for Eikon:  Further company coverage:",
        "date": "01092017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda to invest $492 mln to modernize Ontario manufacturing facilities "
    },
    {
        "content": "Global automakers kicked off 2017 displaying a wide array of future vehicles at the North American International Auto Show in Detroit. Luxury sedans and small sport utility vehicles jostled for the spotlight along with electric cars and diesel-powered pickup trucks. When it came to industry profits  the trucks and SUVs were at center-stage. | Video ",
        "date": "01092017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Automakers reveal new models at the Detroit auto show "
    },
    {
        "content": "TOKYO The presidents of Toyota Motor Corp  and Honda Motor Co Ltd  said they have no immediate plans to curb production in Mexico  preferring to wait until after Donald Trump's inauguration as U.S. President this month before deciding whether to make any changes.",
        "date": "01052017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Toyota  Honda say no immediate plans to curb Mexico production "
    },
    {
        "content": "* Toyota China sales +8.2 pct  predicts 2017 sales almost flat",
        "date": "01062017",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-China sales vroom in 2016 for global automakers; dull 2017 looms "
    },
    {
        "content": "BEIJING  Jan 6 Sales surged for global automakers in China in 2016 as consumers rushed to buy cars to make the most of a tax incentive  with Honda Motor Co Ltd  seeing a particularly brisk pace of business ahead of Ford and Toyota Motor Corp.",
        "date": "01062017",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Sales surge for global carmakers in China  Honda overtakes rivals "
    },
    {
        "content": "DETROIT Honda Motor Co  said on Thursday it will recall nearly 650 000 Odyssey minivans in the United States covering 2011 to 2016 model years because second-row seats may not lock in the event of a crash.",
        "date": "12292016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda to recall about 650 000 Odyssey minivans in U.S. "
    },
    {
        "content": "Honda Motor Co Ltd said customer deliveries of its hydrogen fuel-cell car  dubbed Clarity Fuel Cell  began on Monday at select Honda dealerships across Southern California.",
        "date": "12202016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda begins deliveries of fuel-cell cars in Southern California "
    },
    {
        "content": "SAN FRANCISCO/TOKYO Honda Motor Co Ltd said it is in talks to supply vehicles for Alphabet Inc's Waymo to test self-driving technology  in the latest instance of a carmaker teaming up with a tech firm to supplement its own automation efforts.",
        "date": "12222016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda  Alphabet's Waymo in talks over self-driving tech "
    },
    {
        "content": "SINGAPORE Southeast Asian ride-hailing service Grab disclosed on Monday that Japan's Honda Motor Co had invested in the firm  as part of a $750 million funding announced previously  to collaborate on motorbike-hailing services.",
        "date": "12122016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Japan's Honda ties up with ride-hailing service Grab "
    },
    {
        "content": "BEIJING Honda Motor's  joint venture with Dongfeng Motor Group  will invest roughly 3 billion yuan ($436 million) in a new factory in China  the Japanese automaker said in a statement on its website on Thursday.",
        "date": "12082016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda confirms new $436 million China factory amid sales surge "
    },
    {
        "content": "BEIJING Honda Motor Co's  sales in China surpassed those of Toyota Motor Corp  for the first 11 months of 2016 as new models lured consumers and set the Japanese rivals up for a photo finish in their rankings for full-year sales in the world's top auto market.",
        "date": "12022016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda outselling Toyota in China  sets up photo finish for 2016 "
    },
    {
        "content": "TOKYO Honda Motor Co.  will stick with its North American production plans as it waits to see if U.S. President-elect Donald Trump will follow through on a campaign pledge to dump the North American Free Trade Agreement (NAFTA) when he takes office  the automaker's CEO said on Monday.",
        "date": "11212016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda CEO says to stick with North American production plans for now "
    },
    {
        "content": "* Honda CEO says unable to make sudden changes to production plans",
        "date": "11212016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda CEO says to stick with N.American production plans for now "
    },
    {
        "content": "TOKYO  Nov 21 Honda Motor Co. will stick with its North American production plans as it waits to see whether Donald Trump follows through on a campaign pledge to dump the North American Free Trade Agreement (NAFTA) when he takes office  the automaker's CEO  Takahiro Hachigo  said on Monday.",
        "date": "11212016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda CEO says to stick with Nth American production plans for now "
    },
    {
        "content": "GREENSBORO  United States  Nov 12 Honda Motor Co  expects to ramp up production of business jets as part of its plan to expand in the growing industry  the head of the Japanese automaker's aircraft operations said in the United States.",
        "date": "11132016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda plans to produce 80 business jets annually by March 2019 "
    },
    {
        "content": "* Honda to make more Pilot  Ridgeline and Odyssey at Alabama plant",
        "date": "11112016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "CORRECTED-(OFFICIAL)-Honda plans N.American production shifts to make more SUVs "
    },
    {
        "content": "SAO PAULO Honda Motor Co Ltd will produce a new SUV model \"WRV\" in Brazil from the first half of 2017 and sell it throughout South America  executives at the automaker said on Tuesday.",
        "date": "11082016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda to produce new compact SUV 'WRV' in Brazil  executive says "
    },
    {
        "content": "SAO PAULO  Nov 8 Honda Motor Co Ltd will produce a new SUV model \"WRV\" in Brazil from the first half of 2017 and sell it throughout South America  executives at the automaker said on Tuesday.",
        "date": "11082016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to produce new compact SUV \"WRV\" in Brazil  executive says "
    },
    {
        "content": "Automakers have \"ultimate responsibility\" for the costs of replacing potentially deadly Takata Corp  airbags  no matter what happens to the Japanese supplier  the top U.S. vehicle safety regulator said on Wednesday.",
        "date": "11022016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Automakers are responsible for Takata air bag recalls -NHTSA "
    },
    {
        "content": "Nov 2 Automakers have \"ultimate responsibility\" for the costs of replacing potentially deadly Takata Corp  airbags  no matter what happens to the Japanese supplier  the top U.S. vehicle safety regulator said on Wednesday.",
        "date": "11032016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 2-Automakers are responsible for Takata air bag recalls - NHTSA "
    },
    {
        "content": "* American Honda Motor Co Inc - reported October sales of 126 161 Honda and Acura vehicles  a decrease of 4.2 percent versus October 2015  Source text - http://bit.ly/2evZMwH Further company coverage:",
        "date": "11012016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-American Honda says October sales of 126 161 Honda and Acura vehicles  down 4.2 pct "
    },
    {
        "content": "TOKYO Honda Motor Co  lifted its full-year net profit forecast by 6 percent  betting that Chinese customers will keep buying its XR-V and Vezel SUVs and the popular Civic sedan after robust demand there boosted Asian sales sharply in the latest quarter.",
        "date": "10312016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda raises profit forecast on strong China sales "
    },
    {
        "content": "DETROIT  Nov 1 U.S. auto sales fell an estimated 6 percent in October despite increased consumer discounts on many popular models  as the trend toward pickup trucks and SUVs continued  automakers and WardsAuto reported on Tuesday.",
        "date": "11012016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 3-U.S. auto sales drop 6 pct despite discounts  GM off 1.7 pct "
    },
    {
        "content": "* China demand for SUVs  Civics to drive Asia yr sales up 11 pct",
        "date": "10312016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda raises profit forecast on strong China sales "
    },
    {
        "content": "DETROIT  Nov 1 General Motors Co's sales in October fell a less-than-forecast 1.7 percent as hefty gains for smaller pickups and big SUVs offset declines in sedans  marking vehicle trends that could be seen at other large automakers.",
        "date": "11012016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "CORRECTED-UPDATE 2-GM sales drop 1.7 pct; U.S. auto sales seen off despite discounts "
    },
    {
        "content": "* Honda announces $53 million investment in Central Ohio Facilities to strengthen north american operations  Source text for Eikon: [http://bit.ly/2egpLKX] Further company coverage:",
        "date": "11012016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda announces $53 mln investment in Central Ohio Facilities "
    },
    {
        "content": "Oct 31 Honda Motor Co Ltd Executive Vice President Seiji Kuraishi:",
        "date": "10312016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda exec: no major plans for further partnerships at moment "
    },
    {
        "content": "TOKYO  Oct 31 Honda Motor Co lifted on Monday its full-year operating profit forecast by 8.3 percent as it expects increased sales  particularly in Asia  will offset the impact of a stronger currency.",
        "date": "10312016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda lifts annual profit forecast by 8.3 pct on higher vehicle sales "
    },
    {
        "content": "* American Honda Motor - Honda clarity fuel cell sedan received an EPA fuel economy rating of 68 miles per gallon of gasoline-equivalent combined",
        "date": "10242016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda clarity fuel cell sedan receives EPA driving range rating of 366 miles "
    },
    {
        "content": "* Honda Motor plans to triple production of its seven-seat business jet to six planes a month - Nikkei",
        "date": "10192016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor plans to triple production of its 7-seat business jet to 6 planes a month - Nikkei "
    },
    {
        "content": "TOKYO Honda Motor Co  plans to build a new factory in China that will produce passenger cars from 2019  boosting its output capacity in the country by about a fifth  two people familiar with the matter said on Tuesday.",
        "date": "10182016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda planning new China car factory for 2019 start: sources "
    },
    {
        "content": "* Honda Motor will set up a vehicle assembly plant in inland China with plans to start operations in the spring of 2019- Nikkei",
        "date": "10172016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor will set up a vehicle assembly plant in inland China- Nikkei "
    },
    {
        "content": "* Dongfeng Honda operating at close to full capacity   (Recasts with confirmation from sources  Honda comments)",
        "date": "10182016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda planning new China car factory for 2019 start -sources "
    },
    {
        "content": "TOKYO  Oct 18 Honda Motor Co will build a new factory in Wuhan  China  that would begin producing compact cars in spring 2019  boosting its output capacity in the country by about a fifth  the Nikkei business daily said on Tuesday.",
        "date": "10182016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to build new factory in China for compact cars - Nikkei "
    },
    {
        "content": "(The following statement was released by the rating agency) SINGAPORE/SEOUL  October 14 (Fitch) Fitch Ratings has affirmed Japan-based Honda  Motor Co.  Ltd's (Honda) Long-Term Foreign- and Local-Currency Issuer Default  Ratings (IDRs) and senior unsecured debt rating at 'A'. The Outlook is Stable.   Fitch has also affirmed the company's Short-Term Foreign- and Local-Currency  IDRs at 'F1'. KEY RATING DRIVERS Strong Business Profile: Honda's ratings reflect its leading market shares in  key mark",
        "date": "10142016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Fitch Affirms Honda at 'A'; Outlook Stable "
    },
    {
        "content": "* Japan's Honda Motor and Yamaha Motor to partner in motorcycle production and development - Nikkei",
        "date": "10042016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Japan's Honda Motor and Yamaha Motor to partner on scooters in Japan - Nikkei "
    },
    {
        "content": "TOKYO Japan's Honda Motor Co Ltd  and Yamaha Motor Co Ltd  on Wednesday said they were joining forces to develop scooters for the domestic market  burying the hatchet on a decades-old rivalry and consolidating production in response to a shrinking motorcycle market.",
        "date": "10052016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Once rivals  Honda  Yamaha Motor announce scooter tie-up "
    },
    {
        "content": "* Companies competed fiercely for domestic market share in 1980s   (Adds official announcement  details of partnership)",
        "date": "10052016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Once rivals  Honda  Yamaha Motor announce scooter tie-up "
    },
    {
        "content": "TOKYO  Oct 5 Japan's Honda Motor Co and Yamaha Motor Co said they would hold a joint news conference at 3:30 p.m. (0630 GMT) on Wednesday concerning their motorcycle businesses.",
        "date": "10052016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "REFILE-Honda  Yamaha Motor to hold news conference regarding motorcycle biz "
    },
    {
        "content": "KUALA LUMPUR  Sept 28 Honda Motor Co Ltd  said on Wednesday that the driver-side airbag inflator ruptured during a fatal crash in Malaysia  in the fourth death this year in the Southeast Asian country linked to airbags from supplier Takata Corp.",
        "date": "09282016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda reports another Takata airbag rupture in fatal Malaysia crash "
    },
    {
        "content": "WASHINGTON/TOKYO  Sept 24 Japanese air bag supplier Takata Corp said it failed to inform the U.S. auto safety agency of a 2003 rupture of one of its air bag inflators in Switzerland  according to an internal Takata report released by U.S. regulators on Friday.",
        "date": "09242016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 5-Takata failed to report 2003 air bag rupture to US road authority "
    },
    {
        "content": "TOKYO Honda Motor Co  on Thursday said it was recalling about 668 000 vehicles in Japan to replace air bag inflators supplied by Takata Corp   as part of an expanded nationwide recall announced earlier this year.",
        "date": "09082016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda recalls 668 000 more cars in Japan over Takata air bags "
    },
    {
        "content": "* Fit  Civic  Accord models recalled over passenger-side air bags",
        "date": "09082016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda recalls 668 000 more cars in Japan over Takata air bags "
    },
    {
        "content": "TOKYO  Sept 8 Honda Motor Co on Thursday said it was recalling around 668 000 vehicles in Japan to replace air bags supplied by Takata Corp.",
        "date": "09082016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "CORRECTED-(OFFICIAL) Honda recalls more vehicles in Japan over Takata air bags "
    },
    {
        "content": "DETROIT  Sept 1 U.S. auto sales fell 4.2 percent in August as some major automakers said a long-expected decline due to softer consumer demand had begun  possibly sparking a shift to juicer customer incentives and slower production.",
        "date": "09012016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 4-August U.S. auto sales fall; carmakers say industry has peaked "
    },
    {
        "content": "TOKYO Honda Motor Co.  posted a stronger-than-expected 11.5 percent rise in first-quarter operating profit as higher vehicle and motorcycle sales as well as lower costs offset the impact of a stronger yen.",
        "date": "08022016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda first-quarter profit beats forecasts as sales boost offsets forex impact "
    },
    {
        "content": "* Honda Q1 op profit 266.8 bln Y vs 183.3 bln view of analysts",
        "date": "08022016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda Q1 profit beats forecasts as sales boost offsets FX impact "
    },
    {
        "content": "TOKYO  Aug 2 Honda Motor Co. posted an 11.5 percent rise in operating profit in the first quarter as cost-reduction measures and higher vehicle and motorcycle sales offset the impact of a stronger yen.",
        "date": "08022016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda Q1 operating profit up 11.5 percent  higher sales offset FX impact "
    },
    {
        "content": "TOKYO  July 21 On the heels of its $32 billion takeover of chip designer ARM Holdings  SoftBank Corp  founder Masayoshi Son is embarking on another \"crazy idea\": talking cars that can read a driver's emotions.",
        "date": "07212016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Softbank  Honda: Sit back  relax  let the car do the talking "
    },
    {
        "content": "WASHINGTON  July 20 Nishikawa Rubber Co Ltd  has agreed to plead guilty and pay a $130 million criminal fine for its role in a price-fixing conspiracy involving automotive parts  the U.S. Justice Department said on Wednesday.",
        "date": "07202016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Nishikawa agrees to plead guilty  pay $130 mln fine for price-fixing -U.S. "
    },
    {
        "content": "JAKARTA Indonesia's anti-monopoly agency said on Tuesday that two separate companies making and distributing Yamaha and Honda motorbikes in the country were suspected of price fixing.",
        "date": "07192016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Indonesia watchdog says Yamaha  Honda motorbike firms suspected of price fixing "
    },
    {
        "content": "July 18 Japan's Takata Corp has routinely manipulated results of airbag inflator tests reported to Honda Motor Co Ltd  Bloomberg reported on Monday  citing an ongoing audit commissioned by both companies.",
        "date": "07182016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda audit finds Takata manipulated airbag tests - Bloomberg "
    },
    {
        "content": "* Jakarta court to rule on price-fixing allegation   (Adds comment from Astra Honda Motor)",
        "date": "07192016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Indonesia watchdog says Yamaha  Honda motorbike firms suspected of price fixing "
    },
    {
        "content": "* Takata Corp routinely manipulated results of air bag inflator tests reported to Honda Motor  according to ongoing audit by parts maker- Bloomberg",
        "date": "07182016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Takata Corp routinely manipulated results of air-bag inflator tests reported to Honda Motor  according to ongoing audit by parts maker- Bloomberg "
    },
    {
        "content": "TOKYO/WASHINGTON Takata Corp  had engaged in widespread manipulation of test results for air bag inflators supplied to Honda Motor Co   according to an audit  the automaker said  but the review had shown no safety risks in cars not already recalled.",
        "date": "07192016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Takata air bag data manipulation widespread  says Honda "
    },
    {
        "content": "NEW DELHI  July 14 Japanese carmaker Honda Motor Co's India unit is recalling 190 578 vehicles in the country to replace Takata Corp's passenger front airbag inflators  the company said in a statement on Thursday.",
        "date": "07142016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda Motor to recall 190 578 cars in India to replace Takata airbag inflators "
    },
    {
        "content": "TOKYO Japan's Honda Motor Co has co-developed the world's first hybrid car motor without using heavy rare earth metals  which it says will reduce its dependence on the expensive materials mainly supplied by China.",
        "date": "07122016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda co-develops first hybrid car motor free of heavy rare earth metals "
    },
    {
        "content": "* Automakers are seeking to ease dependence on Chinese resources",
        "date": "07122016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda co-develops first hybrid car motor free of heavy rare earth metals "
    },
    {
        "content": "The pace of U.S. auto sales slowed in June compared to a year ago  as slumping sales of sedans offset strong demand for pickups and sport utility vehicles.",
        "date": "07012016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "U.S. auto sales growth falls short of estimates "
    },
    {
        "content": "MONTREAL  July 4 Fiat Chrysler Automobiles  and Honda Motor Co Ltd both on Monday reported a 2 percent rise in June Canadian sales  compared to the same month in 2015  because of increased demand for light trucks.",
        "date": "07042016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Fiat Chrysler and Honda report higher June Canadian sales "
    },
    {
        "content": "WASHINGTON U.S. auto safety regulators warned on Thursday that Takata air bag inflators on more than 300 000 unrepaired recalled Honda vehicles show a substantial risk of rupturing  and urged owners to stop driving the \"unsafe\" cars until they have been fixed.",
        "date": "06302016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "U.S. calls for urgent repairs of 300 000 recalled Honda vehicles "
    },
    {
        "content": "WASHINGTON  June 30 U.S. auto safety regulators warned on Thursday that Takata air bag inflators on more than 300 000 unrepaired recalled Honda vehicles show a substantial risk of rupturing  and urged owners to stop driving the \"unsafe\" cars until they have been fixed.",
        "date": "06302016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-U.S. calls for urgent repairs of 300 000 recalled Honda vehicles "
    },
    {
        "content": "KUALA LUMPUR Honda Motor Co Ltd recalled 147 894 vehicles in Malaysia on Thursday to replace front passenger air bag inflators  as part of a global recall involving potentially deadly air bags from supplier Takata Corp.",
        "date": "06232016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda recalls nearly 150 000 cars in Malaysia to replace air bag inflators "
    },
    {
        "content": "* Driver-side inflators ruptured in two fatal crashes in Malaysia   (Adds Honda comments  context)",
        "date": "06232016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda recalls nearly 150 000 cars in Malaysia to replace air bag inflators "
    },
    {
        "content": "TOKYO  June 22 Honda Motor Co. said on Wednesday that its brand image in Japan had been tarnished by a series of recalls over quality issues related to its Fit model and this was weighing on domestic sales.",
        "date": "06212016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda says domestic brand image hit by Fit recalls "
    },
    {
        "content": "DETROIT  June 21 Faraday Future plans to begin testing prototype self-driving electric vehicles on California roads later this year after winning approval from the state  an industry source said on Tuesday.",
        "date": "06212016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Tesla rival Faraday approved to test self-driving cars on California roads "
    },
    {
        "content": "TOKYO Honda Motor Co said on Thursday it was recalling around 784 000 vehicles in Japan  part of an expanded recall for potentially deadly Takata Corp airbags.",
        "date": "06092016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda recalls more vehicles in Japan over Takata air bags "
    },
    {
        "content": "* Recalls mount after Takata declared more airbags defective   (Updates recalled vehicle count  adds details on global recall)",
        "date": "06092016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda recalls more vehicles in Japan over Takata air bags "
    },
    {
        "content": "TOKYO  June 9 Honda Motor Co on Thursday recalled a total of around 780 000 vehicles in Japan over air bags made by Takata Corp.",
        "date": "06092016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda recalls more vehicles in Japan over air bags "
    },
    {
        "content": "* May China vehicle sales +23.9 pct y/y at 99 456 vehicles  versus +18.3 pct in April",
        "date": "06022016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda says May China vehicle sales rise 23.9 pct y/y "
    },
    {
        "content": "* Honda Motor to hike North American HR-V output 60 pct - Nikkei",
        "date": "05272016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor to hike North American HR-V output 60 pct - Nikkei "
    },
    {
        "content": "The U.S. Virgin Islands sued Takata Corp  and Honda Motor Co late on Wednesday over the sale of millions of recalled airbags linked to deadly ruptures.",
        "date": "05262016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "U.S. Virgin Islands sues Takata  Honda over airbags "
    },
    {
        "content": "May 26 The U.S. Virgin Islands sued Takata Corp  and Honda Motor Co late on Wednesday over the sale of millions of recalled airbags linked to deadly ruptures.",
        "date": "05262016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-U.S. Virgin Islands sues Takata  Honda over airbags "
    },
    {
        "content": "DETROIT  May 16 Fiat Chrysler Automobiles   and Nissan Motor Co are lagging behind top North American competitors in the health of their working relationships with suppliers  an annual study found on Monday.",
        "date": "05162016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Nissan  FCA lag in study of North American auto supplier relations "
    },
    {
        "content": "TOKYO Honda Motor Co  posted a quarterly loss on Friday  hit by massive recall costs for Takata air bags but forecast a rebound this year as it took dramatic steps to put the debacle behind it.",
        "date": "05132016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda posts loss as it seeks to draw a line under Takata recalls "
    },
    {
        "content": "* Q4 net loss 93.4 bln yen vs mkt estimate of 115.35 bln profit",
        "date": "05132016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda posts loss as it seeks to draw a line under Takata recalls "
    },
    {
        "content": "TOKYO  May 13 Honda Motor Co forecast on Friday a 13.2 pct increase in net profit for the current year as brisk global auto sales are expected offset a negative impact of a stronger yen.",
        "date": "05132016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda forecasts 13.2 pct increase in FY net profit on sales growth "
    },
    {
        "content": "* Honda Motor Co : assumes average dollar rate of 105 yen in fy2016/17",
        "date": "05132016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda assumes average dollar rate of 105 yen in fy2016/17 "
    },
    {
        "content": "TOKYO Honda Motor Co  on Monday said it had not made any announcements on additional air bags recalls after the Nikkei newspaper reported it would recall at least 20 million more of the safety devices made by Takata Corp .",
        "date": "05092016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda to recall 20 million more Takata airbags: Nikkei "
    },
    {
        "content": "TOKYO  April 28 Honda Motor Co on Thursday said it planned to resume production in stages at its motorcycle plant in southern Japan beginning May 6  after the factory suffered damage during a series of earthquakes earlier this month.",
        "date": "04282016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda expects quake-hit plant to resume full operation in August "
    },
    {
        "content": "BEIJING Honda Motor Co  targets selling 1.07 million vehicles in China this year  a company executive said on Monday at the Beijing autoshow.",
        "date": "04252016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda targets 2016 China sales of 1.07 million vehicles: China exec "
    },
    {
        "content": "BEIJING  April 25 Honda Motor Co  targets selling 1.07 million vehicles in China this year  a company executive said on Monday at the Beijing autoshow.",
        "date": "04252016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda targets 2016 China sales of 1.07 mln vehicles - China exec "
    },
    {
        "content": "DETROIT  April 21 Honda Motor Co will roll out three environmentally friendly sedans under the Clarity name in the United States by the end of 2017  the Japanese automaker said on Thursday  as it aims to boost green vehicle sales.",
        "date": "04212016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to add three green cars under Clarity name "
    },
    {
        "content": "TOKYO Manufacturers including Honda Motor  and Sony Corp  halted production at plants in southwestern Japan on Friday to inspect for any damage from the previous night's earthquake. No major damage was reported.",
        "date": "04152016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Quake stalls manufacturing in southern Japan; no major damage reported "
    },
    {
        "content": "* March sales of 138 221 honda and acura vehicles  an increase of 9.4 percent for the month  Source (http://bit.ly/1oq9mVD) Further company coverage:",
        "date": "04012016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-American Honda says march sales of 138 221 honda and acura vehicles  up 9.4 pct "
    },
    {
        "content": "* Honda recalling around 164 000 vehicles in Japan - transport ministry  Further company coverage:    (Reporting by Maki Shiraki)",
        "date": "04042016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda recalling around 164 000 vehicles in Japan - transport ministry "
    },
    {
        "content": "TOKYO  April 4 Japan's Nikkei share average struggled on Monday as the dollar sagged against the yen despite a stronger-than-expected U.S. jobs report  while automakers skidded after posting disappointing sales.",
        "date": "04042016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Concerns over firm yen keep Nikkei in check  automakers skid "
    },
    {
        "content": "* Takata faces massive costs if responsible for faulty airbags   (Adds comment from Honda  context to airbag recall)",
        "date": "03292016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Takata plans to increase capital around Sept as recall costs mount-Kyodo "
    },
    {
        "content": "TOKYO  March 10 Honda Motor Co. is in talks with General Motors over how to manufacture and procure parts for hydrogen fuel cell stacks as part of a technology development partnership  the Japanese automaker's chief executive said on Thursday.",
        "date": "03102016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda says working with GM on fuel cell manufacturing  parts procurement "
    },
    {
        "content": "Honda Motor Co  is preparing to compensate U.S. dealers for depreciation costs of vehicles they cannot sell because of the massive recall linked to potentially faulty air bag inflators made by Takata Corp   Automotive News reported.",
        "date": "03102016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to compensate U.S. dealers for losses over air bag recalls: Automotive News "
    },
    {
        "content": "March 10 Honda Motor Co is preparing to compensate U.S. dealers for depreciation costs of vehicles they cannot sell because of the massive recall linked to potentially faulty air bag inflators made by Takata Corp  Automotive News reported.",
        "date": "03102016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to compensate U.S. dealers for losses over air bag recalls - Automotive News "
    },
    {
        "content": "TOKYO Honda Motor Co Ltd  on Wednesday said it aimed for new-energy vehicles to account for two-thirds of its line-up by 2030 from around 5 percent now  as increasingly stringent global emissions regulations prompt automakers to make greener cars.",
        "date": "02242016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda aims for green cars to make up two-thirds of line-up by 2030 "
    },
    {
        "content": "* Honda reiterates no new support for Takata   (Recasts  adds CEO comments  strategy update  context)",
        "date": "02242016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda aims for green cars to make up two-thirds of line-up by 2030 "
    },
    {
        "content": "TOKYO Nearly a year into his job  Honda Motor Co  CEO Takahiro Hachigo plans a back-to-the-future shift at the Japanese automaker  driving clearer demarcation lines between those who develop cars and those who sell them  two senior company insiders told Reuters.",
        "date": "02232016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Exclusive: Honda CEO to shift gears  distance sales teams from car design process - sources "
    },
    {
        "content": "TOKYO  Feb 24 Japan's Honda Motor Co Ltd  on Wednesday said it was not planning to extend financial support to Takata Corp  as a costly global recall of the air bag maker's potentially faulty inflators broadens.",
        "date": "02242016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda says has no plans to offer financial support to Takata "
    },
    {
        "content": "DETROIT/WASHINGTON U.S. auto safety regulators are examining whether an additional 70 million to 90 million Takata Corp airbag inflators should be recalled because they may endanger drivers  according to a person with knowledge of the matter.",
        "date": "02222016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Up to 90 million more Takata airbag inflators may face U.S. recalls "
    },
    {
        "content": "* Automaker taps Asako Suzuki as first female operating officer   (Adds details on personnel changes  background)",
        "date": "02232016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda reshuffles management in bid to inject youth  diversity "
    },
    {
        "content": "DETROIT/WASHINGTON U.S. auto safety regulators are examining whether an additional 70 million to 90 million Takata Corp  airbag inflators should be recalled because they may endanger drivers  according to a person with knowledge of the matter. | Video ",
        "date": "02222016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Exclusive: Up to 90 million more Takata airbag inflators may face U.S. recalls "
    },
    {
        "content": "TOKYO  Feb 23 Honda Motor Co on Tuesday said it will promote its top official in China to the role of company executive vice president  as the Japanese automaker's new chief executive reshuffles his management team ahead of a strategy update on Wednesday.",
        "date": "02232016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to promote head of China operations to executive VP role "
    },
    {
        "content": "DETROIT/WASHINGTON U.S. auto safety regulators are examining whether an additional 70 million to 90 million Takata Corp airbag inflators should be recalled because they may endanger drivers  according to a person with knowledge of the matter.",
        "date": "02222016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "EXCLUSIVE: Up to 90 million more Takata airbag inflators may face U.S. recalls "
    },
    {
        "content": "TOKYO Feb 11 Honda Motor Co Ltd plans to start making gasoline-electric hybrid cars in China later this year  to meet increasingly stringent fuel economy regulations in a country blighted by worsening air pollution.",
        "date": "02112016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to start making gasoline-electric cars in China this year "
    },
    {
        "content": "TOKYO  Feb 5 Honda Motor Co on Friday said it was recalling about 443 000 vehicles including its Fit compact cars in Japan over potentially faulty air bags manufactured by Takata Corp  as a global recall continues to mount.",
        "date": "02052016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to recall more cars in Japan due to Takata airbag issue "
    },
    {
        "content": "Feb 5 Continental Automotive Systems said on Thursday it supplied potentially defective air bag control units to 5 million vehicles used by Honda  Fiat Chrysler  Mercedes-Benz  and three other manufacturers built over a five-year period worldwide  widening an air bag safety crisis.",
        "date": "02052016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Timeline for Continental air bag recall issue "
    },
    {
        "content": "DETROIT  Feb 2 U.S. auto sales fared better than expected in January as the industry continued to benefit from low gasoline prices  easy credit and moderate economic growth  major automakers said on Tuesday.",
        "date": "02022016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 5-U.S. January auto sales stronger than expected "
    },
    {
        "content": "Feb 3 Honda Motorcycle and Scooter India says to launch 15 new models this calender year",
        "date": "02032016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motorcycle and Scooter India to launch 15 new models in 2016-statement "
    },
    {
        "content": "* Executive says wants Takata to identify air bag fault quickly",
        "date": "01292016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda's Q3 operating profit slides on recall costs "
    },
    {
        "content": "TOKYO  Jan 29 Honda Motor attended a meeting with air bag maker Takata Corp on Friday  the executive vice president of Japan's third-largest automaker  Tetsuo Iwamura  told an earnings briefing.",
        "date": "01292016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda attended meeting with Takata on Friday - Honda exec "
    },
    {
        "content": "DETROIT/WASHINGTON Honda Motor Co Ltd is expanding its recall in North America of late-model vehicles equipped with potentially defective Takata air bags  adding 2.23 million vehicles.",
        "date": "02042016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda adds 2.2 million vehicles to Takata air bag recall "
    },
    {
        "content": "* Honda has previously recalled over 6 mln U.S. cars since 2008",
        "date": "02042016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 4-Honda adds 2.2 million vehicles to Takata air bag recall "
    },
    {
        "content": "Jan 21 Honda Motor Co said on Thursday it will start selling its new hydrogen fuel cell vehicle in California by year's end.",
        "date": "01212016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to offer new fuel cell vehicle in California in 2016 "
    },
    {
        "content": "Jan 21 Honda Motor Co Ltd said on Thursday its hydrogen fuel cell car  dubbed Clarity Fuel Cell  will be launched in California before the end of 2016.",
        "date": "01212016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to launch hydrogen fuel-cell car in California this year "
    },
    {
        "content": "BEIJING As part of a broader makeover  and even the survival  of its stalled luxury Acura brand  Japan's Honda Motor Co  will launch a new small crossover sport utility vehicle this year in China to compete with BMW  and Audi  in the world's biggest car market  two individuals closely involved in the effort said.",
        "date": "01092016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Exclusive: With luxury Acura makeover  Honda aims for brand survival  China revival "
    },
    {
        "content": "DETROIT Honda Motor Co Ltd plans to launch a plug-in hybrid vehicle in North America by 2018 in response to increasingly tough and more stringent U.S. fuel economy requirements  the company's top executive said at the Detroit auto show on Monday.",
        "date": "01112016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda to launch plug-in hybrid in North America by 2018: CEO "
    },
    {
        "content": "BEIJING Honda Motor Co's  line-up of small sports utility vehicles gave it the edge over Ford Motor Co  in the world's biggest auto market last year  according to China sales figures released by the Japanese and U.S. automakers on Friday.",
        "date": "01082016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Ford  Honda China sales tell diverging tales of slowing market "
    },
    {
        "content": "DETROIT  Jan 11 Honda Motor Co Ltd  plans to launch a plug-in hybrid vehicle in North America by 2018 in response to increasingly tough and more stringent U.S. fuel economy requirements  the company's top executive said at the Detroit auto show on Monday.",
        "date": "01112016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "AUTOSHOW-Honda to launch plug-in hybrid in North America by 2018 -CEO "
    },
    {
        "content": "BEIJING  Jan 8 Honda Motor Co's line-up of small sports utility vehicles gave it the edge over Ford Motor Co in the world's biggest auto market last year  according to China sales figures released by the Japanese and U.S. automakers on Friday.",
        "date": "01082016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Ford  Honda China sales tell diverging tales of slowing market "
    },
    {
        "content": "BEIJING  Jan 8 Honda Motor Co and its Chinese joint venture partners sold 1.01 million vehicles in China in 2015  up 32.5 percent from the previous year  the Japanese automaker said on Friday.",
        "date": "01082016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda says China vehicle sales up 32.5 pct in 2015 "
    },
    {
        "content": "DETROIT  Jan 5 Automakers on Tuesday set a new U.S. sales record for 2015 even as December sales fell short of expectations  and most forecasters said sales should rise to another record this year.",
        "date": "01052016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 6-U.S. auto sales in 2015 set record after strong December "
    },
    {
        "content": "* Will launch 15 new models in three years   (Adds planned new model launches  context)",
        "date": "01042016",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda China car sales beat target as Japanese brands play catch-up "
    },
    {
        "content": "LAS VEGAS  Jan 3 Toyota Motor Corp and Ford Motor Co said on Monday they will adopt the same software to link smartphone apps to vehicle dashboard screens and invited other automakers to join them to counter Apple Inc  and Google's push to control cars of the future.",
        "date": "01042016",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Ford  Toyota ally to counter Silicon Valley in dashboard war "
    },
    {
        "content": "WASHINGTON  Dec 16 Fiat Chrysler Automobiles NV  which lags the auto industry in fuel efficiency  purchased U.S. greenhouse gas emissions credits from rival automakers Toyota Motor Corp  Tesla Motors Inc and Honda Motor Co  a government report released on Wednesday show.",
        "date": "12162015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Fiat Chrysler buys Tesla  Toyota  Honda emissions credits "
    },
    {
        "content": "NEW DELHI  Dec 15 Honda Motor Co is looking at the possibility of building a small car specifically for India  a top company official said on Tuesday  aiming to gain a bigger share in the world's fifth-largest car market.",
        "date": "12152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda studying India-specific car to be designed and built locally "
    },
    {
        "content": "NEW DELHI  Dec 10 Japanese carmaker Honda Motor Co will recall 90 210 diesel vehicles in India to replace their fuel return pipe  the company's local unit said in a statement on Thursday.",
        "date": "12102015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Japanese carmaker Honda to recall 90 210 diesel vehicles in India "
    },
    {
        "content": "NEW DELHI  Dec 1 Hero Motocorp Ltd  India's largest maker of motorcycles and scooters  said on Tuesday its November sales rose 0.6 percent from a year earlier.",
        "date": "12012015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "India's Hero Motocorp Nov vehicle sales up 0.6 pct y/y "
    },
    {
        "content": "STOCKHOLM  Nov 10 Swedish car safety equipment maker Autoliv could capitalise on the crisis engulfing its rival Takata Corp by finally extending its global leadership to the one major auto hub it has been unable to dominate - Japan.",
        "date": "11112015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "RPT-Takata air bag crisis hands Autoliv chance to go big in Japan "
    },
    {
        "content": "STOCKHOLM  Nov 11 Swedish car safety equipment maker Autoliv could capitalise on the crisis engulfing its rival Takata Corp by finally extending its global leadership to the one major auto hub it has been unable to dominate - Japan.",
        "date": "11102015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Takata air bag crisis hands Autoliv chance to go big in Japan "
    },
    {
        "content": "* Takata plunges as Honda says will no longer use its inflators",
        "date": "11052015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Nikkei rises as weak yen helps sentiment after Yellen comments; JT surges "
    },
    {
        "content": "* Takata to announce interim financial results on Friday   (Adds Mazda comment)",
        "date": "11052015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 3-Takata shares sink by a quarter  more car makers may snub inflators "
    },
    {
        "content": "TOKYO/WASHINGTON Honda Motor Co said it will no longer use front air bag inflators made by Japan's Takata Corp  raising questions about the future of the embattled parts supplier. | Video ",
        "date": "11042015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Dumped by Honda  air bag maker faces fresh questions over future "
    },
    {
        "content": "TOKYO Mazda Motor Corp  on Thursday said it would not use air bag inflators manufactured by Takata Corp  containing ammonium nitrate in its new cars after such products were banned by U.S. regulators the previous day.",
        "date": "11052015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Mazda to stop using Takata air bag inflators containing ammonium nitrate "
    },
    {
        "content": "TOKYO Honda Motor Co  on Wednesday slightly lifted its full-year revenue forecast after quarterly net profit rose 6.9 percent due to strong vehicle sales in North America.",
        "date": "11042015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda lifts full-year revenue forecast on weak yen "
    },
    {
        "content": "TOKYO  Nov 5 Shares of Japanese supplier Takata Corp plunged 21 percent on Thursday  extending a sharp fall from the day before when top customer Honda Motor Co  said it would stop buying a component at the heart of a multi-million-vehicle recall.",
        "date": "11052015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Takata shares at 6-1/2-year low after supplier snubbed by Honda "
    },
    {
        "content": "TOKYO  Nov 4 Honda Motor Co on Wednesday slightly lifted its full-year revenue forecast after quarterly net profit rose 6.9 percent due to strong vehicle sales in North America.",
        "date": "11042015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "CORRECTED-Honda lifts full-year revenue forecast on weak yen "
    },
    {
        "content": "SAO PAULO  Oct 30 Honda Motor Co has postponed the start of production at a new Brazilian factory in the city of Itirapina due to a sharp downturn in the local auto market  the company said in an emailed statement on Friday.",
        "date": "10302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda delays new factory in Brazil  to hold output steady in 2016 "
    },
    {
        "content": "Nov 4 Honda Motor Co Executive Vice President Tetsuo Iwamura says:",
        "date": "11042015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda exec: sees quality costs rising to 1.9 pct of revenue this FY "
    },
    {
        "content": "TOKYO Honda Motor Co  is confident it can achieve its 2015 sales target of 950 000 cars in China  but is cautious about increasing production in the world's No.2 economy given the uncertain economic outlook  Chief Executive Officer Takahiro Hachigo told Reuters.",
        "date": "10282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda to meet China sales targets  but outlook uncertain: CEO "
    },
    {
        "content": "TOKYO  Oct 21 Honda Motor Co said on Wednesday it aims to sell a car with automated highway driving functions around 2020  joining the race to market self-driving vehicles that pits traditional automakers against tech firms like Google.",
        "date": "10212015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda Motor says plans to market partial self-driving car in 2020 "
    },
    {
        "content": "Honda Motor Co  will delay the construction of a planned $822 million plant in Wuhan  China  as demand slows in the world's largest auto market  Bloomberg reported.",
        "date": "10222015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda delays plans for $822 million China plant on slower demand: Bloomberg "
    },
    {
        "content": "DETROIT  Oct 20 General Motors Co on Tuesday outlined a wide-ranging partnership with Korean electronics firm LG Corp for production of the 2017 Chevrolet Bolt electric car that could establish a blueprint for such collaborations in the future.",
        "date": "10202015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "GM  LG partnership on Chevy Bolt may be roadmap for future deals "
    },
    {
        "content": "Oct 22 Honda Motor Co will delay the construction of a planned $822 million plant in Wuhan  China  as demand slows in the world's largest auto market  Bloomberg reported.",
        "date": "10222015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda delays plans for $822 mln China plant on slower demand-Bloomberg "
    },
    {
        "content": "(The following statement was released by the rating agency) SINGAPORE/SEOUL  October 15 (Fitch) Fitch Ratings has affirmed Japan-based Honda  Motor Co.  Ltd's (Honda) Long-Term Foreign- and Local-Currency Issuer Default  Ratings (IDRs) and senior unsecured debt rating at 'A'. The Outlook is Stable.   Fitch has also affirmed the company's Short-Term Foreign- and Local-Currency  IDRs at 'F1'. KEY RATING DRIVERS Strong Business Profile: Honda's ratings reflect its leading market share in key  marke",
        "date": "10152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Fitch Affirms Honda at 'A'; Outlook Stable "
    },
    {
        "content": "* Automaker targets zero CO2 emissions among new models by 2050",
        "date": "10142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Toyota targets fuel-cell car sales of 30 000 a year by 2020 "
    },
    {
        "content": "MILFORD  Mich.  Oct 1 General Motors Co's  product chief  Mark Reuss on Thursday told investors the company will announce new technology development cooperation with Honda Motor Co  but gave no specifics.",
        "date": "10012015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "GM says will announce new technology co-development with Honda "
    },
    {
        "content": "DETROIT  Sept 16 Honda Motor Co  unveiled the tenth generation of its Civic small car Wednesday  aiming to reinvigorate its best-selling model at a time when many consumers are bypassing small sedans for sport utility vehicles.",
        "date": "09172015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda launches a new Civic small car into an SUV crazy world "
    },
    {
        "content": "* Contrasts with double-digit gains for Toyota  Honda  Daimler",
        "date": "09072015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "GM's sales drop in August highlights automaker divide in China "
    },
    {
        "content": "U.S. safety regulators have opened an investigation into air bags on Honda Motor Co's 2008 Accord sedans after 19 complaints of malfunctioning air bags including a front crash that resulted in injuries  federal officials said on Friday.",
        "date": "08212015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "U.S. agency opens probe into 2008 Honda Accord air bag controller "
    },
    {
        "content": "SEOUL South Korea's LG Electronics Inc will supply Honda Motor Co Ltd and Porsche with in-car displays  a person with direct knowledge of the matter said on Friday  as the firm tries to grow its auto business to counter weak sales at its mainstay television and smartphone units.",
        "date": "08212015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "LG Elec to supply auto displays to Honda  Porsche: source "
    },
    {
        "content": "* Sister firm LG Display already a major car display supplier",
        "date": "08212015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "CORRECTED-UPDATE 1-LG Elec to supply auto displays to Honda  Porsche - source "
    },
    {
        "content": "SEOUL  Aug 21 South Korea's LG Electronics Inc  will supply center information displays for cars to automakers Honda Motor Co Ltd and Porsche  a person with direct knowledge of the matter told Reuters on Friday.",
        "date": "08212015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "LG Elec to supply auto displays to Honda  Porsche - source "
    },
    {
        "content": "SAO PAULO  Aug 10 Honda Motor Co still aims to start delivering its HondaJet during the \"late summer\" in the United States  but its top aviation executive recognized on Monday that the deadline would depend on final certification there.",
        "date": "08102015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-HondaJet holding out hope for 'late summer' U.S. delivery "
    },
    {
        "content": "* Weak yen prompts some Japanese carmakers to manufacture at home",
        "date": "08062015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Weak yen  returning carmakers throw lifeline to Japan's steel mills "
    },
    {
        "content": "SAO PAULO  Aug 10 Deliveries of four-passenger HondaJets will start in 2017 in Brazil  Michimasa Fujino  chief executive of the Honda Aircraft unit of Honda Motor Co  said at an event in Sao Paulo on Monday.",
        "date": "08102015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "HondaJet deliveries to start in Brazil in 2017 - CEO "
    },
    {
        "content": "TOKYO Honda Motor Co  said on Friday its quarterly net profit jumped 20 percent  beating estimates  as strong sales in the United States and a weak yen helped it absorb the impact of higher quality-related costs.",
        "date": "07312015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda profit up 20 percent as robust U.S. sales  weak yen offset quality costs "
    },
    {
        "content": "* Strong China performance helps Asia sales climb 19 pct   (Adds sales details  recall costs context)",
        "date": "07312015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda profit up 20 pct as robust US sales  weak yen offset quality costs "
    },
    {
        "content": "July 31 Honda Motor Co Executive Vice President Tetsuo Iwamura says:",
        "date": "07312015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda: new Brazil car plant to start slightly later than planned "
    },
    {
        "content": "TOKYO  July 31 Honda Motor Co said on Friday its quarterly net profit grew 20 percent  beating estimates as strong sales in North America  its biggest market  and a weak yen helped it absorb the impact of higher quality-related costs.",
        "date": "07312015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda Q1 net profit up 20 pct on robust US sales  weak yen "
    },
    {
        "content": "WASHINGTON  July 14 A U.S. auto finance arm of Honda Motor Co will pay $24 million in restitution over allegations that its loan pricing practices caused minority customers to pay higher interest rates than white borrowers did  U.S. regulators said on Tuesday.",
        "date": "07142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda's U.S. auto finance arm to pay $24 mln over loan pricing problems "
    },
    {
        "content": "WASHINGTON A U.S. auto finance arm of Honda Motor Co  will pay $24 million in restitution over allegations that its loan pricing practices caused minority customers to pay higher interest rates than white borrowers did  U.S. regulators said on Tuesday.",
        "date": "07142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda's U.S. auto finance arm to pay $24 million over loan pricing problems "
    },
    {
        "content": "WASHINGTON  July 14 A U.S. auto finance arm of Honda Motor Co will pay $24 million in restitution over allegations that its loan pricing practices caused minority customers to pay higher interest rates than white borrowers did  U.S. regulators said on Tuesday.",
        "date": "07142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "REFILE-UPDATE 2-Honda's U.S. auto finance arm to pay $24 mln over loan pricing problems "
    },
    {
        "content": "* Consumers delaying purchases as economy deteriorates   (Updates auto sales data to H1)",
        "date": "07142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Japan automakers cling to Indonesia targets as sales speed downhill "
    },
    {
        "content": "JAKARTA  July 14 Japanese automakers are sticking to their targets in Indonesia in defiance of the longest sales decline in six years  resorting to steep discounts to entice tight-spending consumers into showrooms that remain stubbornly empty.",
        "date": "07132015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Japan automakers cling to Indonesia targets as sales speed downhill "
    },
    {
        "content": "TOKYO  July 9 Honda Motor Co's chief executive expects the automaker to record higher sales in China this fiscal year  even as overall vehicle sales in the world's biggest auto market weaken amid a slowing economy and the recent stock market turmoil.",
        "date": "07102015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "CORRECTED-UPDATE 1-Honda CEO expects higher China sales even as economy slows "
    },
    {
        "content": "NEW DELHI  July 8 Increasing the local content in cars and improving the quality of its supply chain will be a priority for Honda Motor Co in India  the new chief executive of the Japanese carmaker's local unit told Reuters on Wednesday.",
        "date": "07082015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda India CEO to increase local content in cars  improve quality "
    },
    {
        "content": "TOKYO Honda Motor Co said on Thursday it is recalling about 4.5 million more cars globally to replace air bag inflators made by supplier Takata Corp  the latest move in the Japanese automaker's efforts to deal with a safety scare that has seen firms around the world recall tens of millions of cars.",
        "date": "07092015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda expands recall to replace Takata-made air bags "
    },
    {
        "content": "* No plans to provide financial aid to Takata - CEO   (Adds details of recall  Honda comments)",
        "date": "07092015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda expands recall to replace Takata-made air bags "
    },
    {
        "content": "TOKYO Honda Motor Co's  new chief executive said the Japanese automaker has no plans for now to provide financial aid to Takata Corp   the air bag supplier at the center of a costly global safety recall that has dented Honda's public image as well as its earnings.",
        "date": "07062015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "New Honda CEO says no plans to help air bag firm Takata fund global recalls "
    },
    {
        "content": "* Exec says India is biggest market for Honda in Asia and oceanic region",
        "date": "07082015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor Co to invest 3.8 bln rupees to increase Rajasthan plant capacity-India CEO "
    },
    {
        "content": "* Honda ceo: will continue working with takata as business partners  but will not give financial aid",
        "date": "07092015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda says will not give financial aid to Takata "
    },
    {
        "content": "* Younger buyers still a source of growth - CEO   (Recasts lede  adds CEO comment)",
        "date": "07092015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda CEO: Sees slight sales decline in China amid economy  market jitters "
    },
    {
        "content": "* Now making cars in Africa for 1st time at Nigeria plant   (Recasts with CEO comments on Takata  Nigeria )",
        "date": "07062015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-New Honda CEO says no plans to help air bag firm Takata fund global recalls "
    },
    {
        "content": "TOKYO  July 9 Honda Motor Co is recalling about 1.63 million more cars in Japan to replace air bag inflators made by supplier Takata Corp  a filing with the Japanese transport ministry showed on Thursday.",
        "date": "07092015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda expands recall to replace Takata-made airbags "
    },
    {
        "content": "TOKYO  July 6 Honda Motor Co's new chief executive said on Monday he wanted to consider tying up with other automakers if that brings benefits to Honda and its customers.",
        "date": "07062015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda CEO: open to partnering other automakers if it benefits Honda "
    },
    {
        "content": "* GM  Ford  Toyota report drop in car sales  rise in SUV sales",
        "date": "07012015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "CORRECTED-UPDATE 3-Strong truck  SUV demand helped Ford  GM raise prices in June "
    },
    {
        "content": "TOKYO  June 26 Honda Motor Co on Friday restated its financial results for the business year ended March  to account for additional costs to cover an expanded recall of cars equipped with Takata Corp air bag parts.",
        "date": "06262015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda restates earnings after booking expanded airbag recall costs "
    },
    {
        "content": "Honda Motor Co's U.S. unit said on Friday it has linked the September 2014 death of a woman in Los Angeles  California   to the rupture of a Takata airbag inflator  bringing to eight the number of fatalities related to defective Takata airbags.",
        "date": "06192015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda confirms eighth death linked to Takata airbags "
    },
    {
        "content": "June 19 Honda Motor Co's U.S. unit said on Friday it has linked the September 2014 death of a woman in Los Angeles  California   to the rupture of a Takata airbag inflator  bringing to eight the number of fatalities related to defective Takata airbags.",
        "date": "06192015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda confirms eighth death linked to Takata airbags "
    },
    {
        "content": "DETROIT  June 16 Toyota Motor Corp will recall almost 1.37 million more vehicles in the United States due to potentially deadly front passenger-side air bags made by Japan's Takata Corp   Toyota said on Tuesday.",
        "date": "06162015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-Toyota expands Takata U.S. air bag recalls by 1.37 mln vehicles "
    },
    {
        "content": "DETROIT Honda Motor Co Ltd on Monday said it will recall 1.39 million Accord and Civic model sedans with potentially faulty front passenger-side air bags made by Japan's Takata Corp.",
        "date": "06152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda recalls 1.39 mln cars with passenger-side Takata air bags "
    },
    {
        "content": "DETROIT Honda Motor Co Ltd on Monday said it will recall 1.39 million Accord and Civic model sedans with potentially faulty front passenger-side air bags made by Japan's Takata Corp.",
        "date": "06152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda recalls 1.39 million cars with passenger-side Takata air bags "
    },
    {
        "content": "WASHINGTON  June 12 The top U.S. auto safety regulator said on Friday a ruptured Takata Corp air bag was likely involved in the April 5 car crash that killed a 22-year-old Louisiana woman  which would make her death the seventh linked to an air bag defect.",
        "date": "06122015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-U.S. officials say Takata air bag likely involved in fatal crash "
    },
    {
        "content": "DETROIT  June 15 Honda Motor Co Ltd on Monday said it will recall 1.39 million Accord and Civic model sedans with potentially faulty front passenger-side air bags made by Japan's Takata Corp.",
        "date": "06152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda recalls 1.39 mln cars with passenger-side Takata air bags "
    },
    {
        "content": "DETROIT  June 15 Honda Motor Co on Monday said it will recall an additional 1.39 million Accord and Civic sedans with potentially faulty front passenger-side air bags made by Takata Corp.",
        "date": "06152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda recalls another 1.39 mln US vehicles with Takata air bags "
    },
    {
        "content": "WASHINGTON  June 12 The top U.S. auto safety regulator said on Friday a ruptured Takata Corp air bag was likely involved in the April 5 car crash that killed a 22-year-old Louisiana woman  which would make her death the seventh linked to an air bag defect.",
        "date": "06122015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "U.S. officials say Takata air bag likely involved in fatal crash "
    },
    {
        "content": "DETROIT  June 15 Honda Motor Co will introduce a new hydrogen fuel cell vehicle in 2016 and stop production of its natural gas Civic  the U.S. sales head of its American Honda auto division said on Monday.",
        "date": "06152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to stop making natural gas car  to rely more on fuel cells "
    },
    {
        "content": "* Concerns over Greece  Fed policy outlook cap markets     * Investors remain bullish on market on whole     * Exporters shares lead losses     * Honda down after earning restatement on additional recall costs      By Hideyuki Sano     TOKYO  June 15 Japanese share prices dipped on Monday on worries over the deadlock between Greece and its creditors as well as a caution ahead of the U.S. Federal Reserve's monetary policy committee meeting.      The Nikkei share average fell 0.2 perce",
        "date": "06152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Japanese shares dip on Greece concerns  nerves over Fed outlook "
    },
    {
        "content": "TOKYO Honda Motor Co  said on Friday it would restate its financial results for the last business year  to account for about $360 million in additional costs to pay for an expanded recall of cars equipped with air bag parts made by Takata Corp .",
        "date": "06122015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to restate earnings to reflect expanded air bag recalls "
    },
    {
        "content": "* Op profit 652 bln yen in FY ended March 31  down 13 pct   (Recasts  adds details on U.S. accounting rules)",
        "date": "06122015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda to restate earnings to reflect expanded air bag recalls "
    },
    {
        "content": "TOKYO  June 12 Honda Motor Co said on Friday it expects to spend 44.8 billion yen ($363 million) in quality-related costs to pay for the recall of cars fitted with air bag parts made by Takata Corp after the supplier agreed to an expanded recall in the United States.",
        "date": "06122015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda says expanded air bag recalls to cost $360 mln  no change in guidance "
    },
    {
        "content": "* Surge due to stream of new models -Honda spokeswoman   (Adds new models  industry comparison  context)",
        "date": "06022015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda sales surge in China as new models beat back rivals "
    },
    {
        "content": "BEIJING  June 2 Honda Motor Co Ltd and its two Chinese joint ventures sold 80 298 vehicles in China in May  a surge of 32 percent from the same period a year earlier  the Japanese automaker said on Tuesday.",
        "date": "06022015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda Motor posts 32 pct China sales surge in May "
    },
    {
        "content": "* May China auto sales total 80 298  up 32.3 percent y/y versus 11.7 percent rise in April",
        "date": "06022015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "CORRECTED-BRIEF-Honda says May China auto sales up 32.3 percent y/y "
    },
    {
        "content": "DETROIT Five automakers on Thursday widened recalls of cars and trucks with Takata Corp  air bags and the U.S. Congress set a hearing next week on the safety issue that has been linked to six deaths.",
        "date": "05282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Congress sets hearing on Takata  automakers expand recalls "
    },
    {
        "content": "TOKYO Honda Motor Co  called back about 690 000 cars in Japan and the United States to replace air bag inflators made by Takata Corp  after the Tokyo-based parts supplier last week agreed to comply with U.S. orders to expand some of its previous recalls.",
        "date": "05282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda expands air bag recall after Takata complies with U.S. order "
    },
    {
        "content": "TOKYO  May 28 Honda Motor Co called back about 690 000 cars in Japan and the United States to replace air bag inflators made by Takata Corp after the Tokyo-based parts supplier last week agreed to comply with U.S. orders to expand some of its previous recalls.",
        "date": "05282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda expands air bag recall after Takata complies with U.S. order "
    },
    {
        "content": "TOKYO Honda Motor Co called back about 340 000 cars in Japan to replace air bag inflators made by Takata Corp after the Tokyo-based parts supplier last week agreed to comply with U.S. orders to expand some of its previous recalls.",
        "date": "05282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda expands air bag recall after Takata complies with US order "
    },
    {
        "content": "TOKYO  May 28 Honda Motor Co said on Thursday it was recalling about 340 000 more cars in Japan to replace air bag inflators made by top supplier Takata Corp .",
        "date": "05282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda expands Takata air bag recall by 340 000 cars in Japan "
    },
    {
        "content": "TOKYO The head of Japan's auto lobby said on Thursday he hopes for an interim report on the cause of Takata Corp's  air bag problems by the end of the year from any one of the teams investigating the issue.",
        "date": "05212015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Japan auto lobby chief: hopes for report on Takata problems by year-end "
    },
    {
        "content": "DETROIT  May 21 Prosecutors in Detroit have joined the U.S. federal probe into Takata Corp's defective air bag inflators that are linked to at least six deaths globally.",
        "date": "05212015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Detroit prosecutors join criminal probe of Takata over air bags "
    },
    {
        "content": "DETROIT  May 21 Prosecutors in Detroit have joined the U.S. federal probe into Takata Corp's  defective air bag inflators that are linked to at least six deaths globally.",
        "date": "05212015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Detroit prosecutors join criminal probe of Takata over air bags "
    },
    {
        "content": "Following are some key events in the cumulative global recall by more than 10 automakers since 2008 of more than 31 million cars fitted with potentially defective air bags made by Japanese firm Takata Corp.",
        "date": "05192015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Timeline: Takata air bag recalls "
    },
    {
        "content": "Following are some key events in the cumulative global recall by more than 10 automakers since 2008 of more than 31 million cars fitted with potentially defective air bags made by Japanese firm Takata Corp .",
        "date": "05202015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Timeline: Takata air bag recalls "
    },
    {
        "content": "TOKYO Air bag manufacturer Takata Corp  and Japanese carmakers including Honda Motor Co are locked in the commercial equivalent of a bad marriage; not entirely happy in each other's company but unable to break apart and wary of potentially costly court battles.",
        "date": "05182015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "As recalls mount  Takata  Japan automakers stuck in uneasy reliance "
    },
    {
        "content": "* Estimated cost of recall up to $5 billion -analyst   (Adds global number of vehicles  Takata comment  lawyer comment  financial details)",
        "date": "05192015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 6-Takata doubling U.S. recall for defective air bags to 34 mln vehicles "
    },
    {
        "content": "WASHINGTON/DETROIT Japanese air bag manufacturer Takata Corp is doubling a recall of potentially deadly air bags to nearly 34 million vehicles  making it the largest automotive recall in American history  U.S. safety regulators said on Tuesday.",
        "date": "05202015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Takata doubling U.S. recall for defective air bags to 34 mln vehicles "
    },
    {
        "content": "* Takata shares slide 10 pct in Tokyo   (Adds comment from Japanese carmakers  updates share prices  advances date)",
        "date": "05202015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 8-Takata doubling U.S. recall for defective air bags to 34 mln vehicles "
    },
    {
        "content": "DETROIT  May 18 For the fifth straight year  Toyota Motor Corp and Honda Motor Co topped a study of automakers with U.S. plants in supplier relations  helping them get the best parts at the lowest cost.",
        "date": "05182015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Toyota  Honda have best supplier relations in U.S. - study "
    },
    {
        "content": "TOKYO  May 17 Air bag manufacturer Takata Corp  and Japanese carmakers including Honda Motor Co  are locked in the commercial equivalent of a bad marriage; not entirely happy in each other's company but unable to break apart and wary of potentially costly court battles.",
        "date": "05172015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "As recalls mount  Takata  Japan automakers stuck in uneasy reliance "
    },
    {
        "content": "NEW DELHI  May 15 Honda Motor Co's  local unit will recall 11 381 vehicles in India to replace potentially faulty air bags  the company said in a statement on Friday  a day after its Japanese parent said it would recall 5 million vehicles for the same reason.",
        "date": "05152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda Motor to recall 11 381 cars in India to replace air bags "
    },
    {
        "content": "TOKYO Honda Motor Co  on Thursday recalled close to 5 million vehicles fitted with potentially faulty Takata Corp  air bag inflators  as investigations showed the problem behind one of the biggest auto safety crises may be more widespread than thought.",
        "date": "05142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda adds to Takata air bag recalls; global tally now around 36 million "
    },
    {
        "content": "TOKYO  May 13 Japan's three biggest carmakers are expanding a huge global recall triggered by potentially fatal air bags made by Takata Corp  saying on Wednesday they will take back millions of vehicles worldwide for investigation.",
        "date": "05132015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 5-Japan's 3 top carmakers to expand Takata air bag recalls by millions "
    },
    {
        "content": "TOKYO Honda Motor Co on Thursday recalled close to 5 million vehicles fitted with potentially faulty Takata Corp air bag inflators  as investigations showed the problem behind one of the biggest auto safety crises may be more widespread than thought.",
        "date": "05142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda adds to Takata air bag recalls; global tally now around 36 mln "
    },
    {
        "content": "* Takata shares close down 5.4 pct   (Recasts  adds details  context)",
        "date": "05142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda adds to Takata air bag recalls; global tally now around 36 mln "
    },
    {
        "content": "Declines to disclose estimated cost of latest Takata related recalls",
        "date": "05142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda declines to disclose estimated cost of latest Takata-related recalls "
    },
    {
        "content": "TOKYO  May 13 Japan's three biggest carmakers are expanding a huge global recall triggered by potentially fatal air bags made by Takata Corp  saying on Wednesday they will take back millions of vehicles worldwide for investigation.",
        "date": "05132015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "CORRECTED-UPDATE 3-Japan's 3 top carmakers to expand Takata air bag recalls by millions "
    },
    {
        "content": "TOKYO  May 15 Honda Motor Co could see an impact on sales in Japan from this week's recall to replace potentially fatal air bags  a top executive said on Friday.",
        "date": "05152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda exec says latest air bag-linked recall may impact Japan sales "
    },
    {
        "content": "TOKYO  May 14 Honda Motor Co said on Thursday it would recall another 4.8 million cars globally to replace potentially fatal air bag inflators made by Japan's Takata Corp  already at the centre of one of the biggest automotive recalls to date.",
        "date": "05142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to recall 4.8 mln more cars globally for Takata air bags "
    },
    {
        "content": "Following are some key events in the cumulative global recall by more than 10 automakers since 2008 of more than 31 million cars fitted with potentially defective air bags made by Japanese firm Takata Corp.",
        "date": "05132015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "TIMELINE-Takata air bag recalls "
    },
    {
        "content": "* Transport minister to ask more automakers to consider recalls   (Adds Honda exec  Japan transport minister comments  details)",
        "date": "05152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda exec says latest air bag-linked recall may impact Japan sales "
    },
    {
        "content": "NEW DELHI  May 6 The Indian arm of Japanese automaker Honda Motor Co plans to invest 17.75 billion rupees ($280 million) this financial year to bolster its two-wheeler operations  a top company official said on Wednesday.",
        "date": "05062015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda's India unit to invest $280 mln to boost two-wheeler production "
    },
    {
        "content": "(The following statement was released by the rating agency) SINGAPORE/SEOUL  May 06 (Fitch) Fitch Ratings has affirmed Japan-based Honda  Motor Co.  Ltd's (Honda) Long-Term Foreign- and Local-Currency Issuer Default  Ratings (IDRs) and senior unsecured debt rating at 'A'. The Outlook is Stable.  Fitch has also affirmed the company's Short-Term Foreign- and Local-Currency  IDRs at 'F1'. KEY RATING DRIVERS Strong Business Profile: Honda's ratings reflect its leading market shares in  key markets  ",
        "date": "05062015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Fitch: Affirms Honda at 'A'; Outlook Stable "
    },
    {
        "content": "* Nikkei  Topix post biggest loss in almost 4 months     * Speculators lock in gains after market's rally     * Honda  NTT Docomo  Oriental Land hit by earning disappointment     * Nikkei extends losses after BOJ refrains from easing      By Hideyuki Sano     TOKYO  April 30 Japanese shares suffered their biggest loss in four months on Thursday on weak U.S. growth figures and lacklustre earnings from Japanese companies including Honda Motor.     The Nikkei share average fell 2.7 perc",
        "date": "04302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Nikkei posts biggest loss in 4 months on weak U.S. GDP  lacklustre earnings "
    },
    {
        "content": "BEIJING  May 6 One of China's biggest state-owned automakers  Dongfeng Motor Corp  said on Wednesday a provincial Communist Party official would become its new chairman amid media reports the government was preparing to merge it with peer China FAW Group Corp.",
        "date": "05062015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-China's Dongfeng Motor names new chairman amid merger reports "
    },
    {
        "content": "* Speculators lock in gains after market's rally     * Soft U.S. data  fall in European shares trigger selling     * Honda  NTT Docomo  Oriental Land hit by earning disappointment      By Hideyuki Sano     TOKYO  April 30 Japanese shares tumbled on Thursday as traders locked in profits from recent gains  discouraged by weak U.S. growth figures  a retreat in overseas shares and disappointing earnings from Honda Motor and a few other companies.     The Nikkei share average fell 1.9 per",
        "date": "04302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Nikkei tumbles on weak U.S. GDP  earnings disappointment "
    },
    {
        "content": "TOKYO  April 28 Honda Motor Co forecast on Tuesday a scant 0.4 percent rise in net profit for the year that began on April 1  saying higher quality-related costs and currency losses would offset gains from vehicle sales growth.",
        "date": "04302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "RPT-UPDATE 2-Honda forecasts flat profit this year as quality fixes weigh "
    },
    {
        "content": "TOKYO Honda Motor Co  forecast on Tuesday a scant 0.4 percent rise in net profit for the year that began on April 1  saying higher quality-related costs and currency losses would offset gains from vehicle sales growth.",
        "date": "04282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda forecasts flat profit this year as quality fixes weigh "
    },
    {
        "content": "TOKYO  April 28 Honda Motor Co forecast on Tuesday a scant 0.4 percent rise in net profit for the year that began on April 1  saying higher quality-related costs and currency losses would offset gains from vehicle sales growth.",
        "date": "04282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda forecasts flat profit this year as quality fixes weigh "
    },
    {
        "content": "* Honda Motor Executive Vice President Tetsuo Iwamura says half of shortfall in FY2014/15 operating profit versus guidance was due to additional quality costs  other half due to lower sales in U.S.  Japan",
        "date": "04282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda aims to boost US sales without relying on heavy sales incentives "
    },
    {
        "content": "Apr 28 (Reuters)-            Honda Motor Co Ltd            CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                   Year ended      Year ended       Year to        NEXT                 Mar 31  2015    Mar 31  2014   Mar 31  2016      YEAR                      LATEST         YEAR-AGO        COMPANY      COMPANY                     RESULTS         RESULT        FORECAST    H1 FORECAST    Sales        12.65 trln      11.84 trln                                 ",
        "date": "04282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "TABLE-Honda Motor -2014/15 group results (SEC) "
    },
    {
        "content": "TOKYO  April 28 Honda Motor Co forecast a scant 0.4 percent rise in net profit for the financial year that began on April 1  providing a tough outlook after falling short of its guidance in the just-ended year as quality problems delayed vehicle development and hampered sales.",
        "date": "04282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda forecasts flat profit this year after tough 2014/15 "
    },
    {
        "content": "* Honda says aims for global car sales of 4.715 million vehicles in fy2015/16  under new international accounting standards",
        "date": "04282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor currency  vehicle sales forecasts "
    },
    {
        "content": "Apr 28 (Reuters)-            Honda Motor Co Ltd            PARENT-ONLY FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                  Year ended      Year ended       Year to       NEXT                  Mar 31  2015    Mar 31  2014   Mar 31  2016     YEAR                       LATEST         YEAR-AGO        COMPANY      COMPANY                     RESULTS         RESULTS       FORECAST    H1 FORECAST    Sales         3.33 trln       3.49 trln      3.50 trln                    ",
        "date": "04282015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "TABLE-Honda Motor -2014/15 parent results "
    },
    {
        "content": "* Honda Motor Co Ltd says targeting China sales of 950 000 cars this year - China head",
        "date": "04202015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda says targets China sales of 950 000 cars this year "
    },
    {
        "content": "April 10 Faulty air bags supplied by Takata Corp  have been linked to another injury involving a Honda Motor Co car in Florida in March.",
        "date": "04102015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Takata air bag on Honda Civic linked to another injury "
    },
    {
        "content": "April 10 Faulty air bags supplied by Takata Corp have been linked to another injury involving a Honda Motor Co car in Florida in March.",
        "date": "04102015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Takata air bag on Honda Civic linked to another injury "
    },
    {
        "content": "* Ford beats expectations; GM  Honda miss expectations   (Adds GM  Ford share prices)",
        "date": "04012015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 5-U.S. auto sales edge higher in March "
    },
    {
        "content": "* March China vehicle sales up 14.7 percent y/y  vs 9.1 percent decrease in February",
        "date": "04022015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "BRIEF-Honda March China vehicle sales up 14.7 pct y/y "
    },
    {
        "content": "TOKYO  March 31 Honda Motor Co said on Tuesday it would spend more than 200 million pounds ($296 million) to upgrade its UK plant  turning it into a global production hub for the next-generation five-door Civic.",
        "date": "03312015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda says to invest 200 mln pounds in UK plant "
    },
    {
        "content": "DETROIT U.S. consumer demand for new vehicles began to thaw in March  especially for luxury cars and big trucks  but not every carmaker participated in the uptick.",
        "date": "04012015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "U.S. auto sales demand begins to thaw in March "
    },
    {
        "content": "DETROIT  April 1 U.S. consumer demand for new vehicles began to thaw in March  especially for luxury cars and big trucks  but not every carmaker participated in the uptick.",
        "date": "04012015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "CORRECTED-UPDATE 4-U.S. auto sales demand begins to thaw in March "
    },
    {
        "content": "TORONTO  March 30 Honda Motor Co said on Monday that its Canadian unit will produce the next generation CR-V model for the European market  marking the first time that its Canadian arm will export vehicles to Europe.",
        "date": "03302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda Canada to manufacture CR-V model for the European market "
    },
    {
        "content": "MUMBAI  April 1 Hero Motocorp Ltd  India's largest maker of motorcycles and scooters  said on Wednesday its sales for the year ended March 31 rose 6.2 percent from a year earlier to 6.63 million units.",
        "date": "04012015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "India's Hero MotoCorp vehicle sales up 6.2 pct in 2014-15 "
    },
    {
        "content": "March 27 Honda Motor Co Ltd said on Friday that it would invest 9.65 billion rupees ($154 million) to expand its motorcycle and automobile production in India  targeting growing demand in Asia's third-largest economy.",
        "date": "03272015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda to invest $154 mln to expand India motorcycle  car output "
    },
    {
        "content": "TOKYO Honda Motor Co  has hired Exponent  a U.S.-based engineering consulting company enlisted by Toyota Motor Corp  during its recall crisis in 2010  to investigate the cause of ruptures in some air bags made by Takata Corp .",
        "date": "03232015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda hires U.S. engineering firm Exponent to probe Takata air bags "
    },
    {
        "content": "DETROIT  March 19 Honda Motor Co said on Thursday it will add more than 100 000 vehicles to a U.S. recall related to potentially defective air bags made by Takata Corp that can deploy with too much force and spray occupants with metal shards.",
        "date": "03192015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda expands recall for Takata air bags by over 100 000 vehicles "
    },
    {
        "content": "* Confident Nissan can overtake Honda in U.S. - exec   (Adds background on U.S. performance  executive's comments)",
        "date": "02272015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-Nissan says can meet U.S. sales goal with capacity in S.Korea  Japan "
    },
    {
        "content": "TOKYO Honda Motor Co  on Monday named an experienced  yet little known  engineer as its new chief executive  who will take over in late-June with the Japanese automaker battling the fallout from a slew of recalls that have shaken its reputation for quality.",
        "date": "02232015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda CEO to step down  replaced by low-profile engineer "
    },
    {
        "content": "* Ito pushed reforms to Honda's supply chain   (Adds comments from news conference)",
        "date": "02232015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 3-Honda CEO to step down  replaced by low-profile engineer "
    },
    {
        "content": "WASHINGTON Honda Motor Co  on Saturday praised an agreement to end a labor dispute at U.S. West Coast ports but said shipping delays will cost the company about 25 000 vehicles this month.",
        "date": "02212015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "West Coast port dispute costing Honda 25 000 vehicles "
    },
    {
        "content": "(The following statement was released by the rating agency) JAKARTA  February 23 (Fitch) PT Fitch Ratings Indonesia telah memberikan  peringkat Nasional Jangka Panjang â€˜AAA(idn)â€™ dan peringkat Nasional Jangka  Pendek â€˜F1+(idn)â€™ untuk program obligasi senior PT Federal International  Financeâ€™s (FIF; AAA(idn)/Stable) sebesar maksimum 10 trilyun Rupiah. Fitch juga  telah memberikan peringkat untuk obligasi senior yang akan diterbitkan sebagai  berikut:  - Peringkat Nasional Jangka Panjang",
        "date": "02232015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Fitch Peringkat Obligasi Senior FIF â€˜AAA(idn)â€™ "
    },
    {
        "content": "TOKYO  Feb 23 Honda Motor Co  in an unexpected move  said on Monday that Chief Executive Officer Takanobu Ito would step down in late June  making way for Managing Officer Takahiro Hachigo after six years in the top post.",
        "date": "02232015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda  in unexpected move  says CEO Ito to step down "
    },
    {
        "content": "* Honda slowing North American car production as parts held up",
        "date": "02162015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "WRAPUP 2-Asian supply lines hit by U.S. West Coast ports dispute "
    },
    {
        "content": "SAN FRANCISCO  Feb 15 Japanese carmaker Honda Motor Co Ltd plans to slow production at some of its plants in North America due to a parts shortage caused by a partial shutdown of ports along the West Coast.",
        "date": "02152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to slow U.S. output due to West Coast ports dispute "
    },
    {
        "content": "ASAHIKAWA  Japan Honda Motor Co  is backing away from its goal of selling 6 million cars a year by March 2017  its chief executive said  conceding that recent quality woes may have had something to do with pressure to meet the lofty target.",
        "date": "02132015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda backing away from 6 million a year car sales goal: CEO "
    },
    {
        "content": "ASAHIKAWA  Japan  Feb 14 Honda Motor Co  is looking to reduce the number of variations on its cars by a fifth to focus more on quality  its R&D chief said  as Japan's third-biggest automaker tries to emerge from a year of product recalls and quality problems.",
        "date": "02142015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda aims to cut car model variations by a fifth to focus on quality "
    },
    {
        "content": "SAN FRANCISCO  Feb 15 Japanese carmaker Honda Motor Co Ltd plans to slow production at some of its plants in North America due to a parts shortage caused by a partial shutdown of ports along the West Coast.",
        "date": "02152015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda to slow U.S. output due to West Coast ports dispute "
    },
    {
        "content": "ASAHIKAWA  Japan  Feb 13 Honda Motor Co  is backing away from its goal of selling 6 million cars a year by March 2017  its chief executive said  conceding that recent quality woes may have had something to do with pressure to meet the lofty target.",
        "date": "02132015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda backing away from 6 million a year car sales goal - CEO "
    },
    {
        "content": "Honda Motor CEO Takanobu Ito  under fire for how he is dismantling the traditional way the Japanese car maker sources parts and technologies  has resisted moves for his ouster and will fight on for another two-year term  according to four people with direct knowledge of the matter.",
        "date": "02122015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Exclusive: Honda CEO shrugs off critics; will see through his supply reforms "
    },
    {
        "content": "ASAHIKAWA  Japan  Feb 13 Honda Motor Co  is backing away from its goal of selling 6 million cars a year by March 2017 to allow enough time for development  its chief executive said  conceding that recent quality woes may have had something to do with the lofty target.",
        "date": "02132015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda backing away from 6 million a year car sales goal - CEO "
    },
    {
        "content": "NEW YORK  Feb 6 Dozens of lawsuits against Takata Corp and several car manufacturers over faulty air bags that prompted a wave of recalls will be heard in a Florida federal court  a judicial panel has ruled.",
        "date": "02062015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 1-Takata air bag lawsuits sent to Florida court "
    },
    {
        "content": "DETROIT Honda Motor Co Ltd  on Friday said it has confirmed that a Takata Corp  air bag inflator ruptured in a Jan. 18 crash in Texas that killed the driver.",
        "date": "01312015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Honda says fatal crash involved Takata air bag inflator rupture "
    },
    {
        "content": "Jan 31 The auto industry's air bag troubles deepened on Saturday as U.S. federal safety regulators said three big automakers will recall about 2.1 million older vehicles to fix defects that could cause air bags to deploy when they are not supposed to.",
        "date": "02012015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "UPDATE 4-U.S. regulators recall 2.1 million vehicles in new air bag issue "
    },
    {
        "content": "DETROIT Honda Motor Co said on Thursday that a driver was killed last week in a Houston suburb in a 2002 Accord equipped with a Takata Corp air bag that may have ruptured.",
        "date": "01292015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Driver killed in Houston crash in Honda with Takata air bags "
    },
    {
        "content": "DETROIT  Jan 29 Honda Motor Co said on Thursday that a driver was killed last week in a Houston suburb in a 2002 Accord equipped with a Takata Corp air bag that may have ruptured.",
        "date": "01292015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Driver killed in Houston crash in Honda with Takata air bags "
    },
    {
        "content": "TOKYO  Jan 30 As Japan's Honda Motor Co  pays hundreds of millions of dollars to replace potentially deadly air bags  hitting earnings  a new headache lies around the bend - cheaper U.S. petrol could lure buyers away from its fuel-efficient cars.",
        "date": "01292015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda recalls to squeeze profit  cloud guidance as cheap fuel poses new threat "
    },
    {
        "content": "DETROIT  Jan 26 January U.S. auto sales will rise 12.4 percent from a relatively low base a year ago  industry consultants J.D. Power and LMC Automotive said on Monday.",
        "date": "01262015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "J.D. Power sees January U.S. auto sales rising 12.4 percent "
    },
    {
        "content": "DETROIT  Jan 30 Honda Motor Co on Friday said it has confirmed that a Takata Corp air bag inflator ruptured in a Jan. 18 crash in Texas that killed the driver.",
        "date": "01302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda says fatal crash involved Takata air bag inflator rupture "
    },
    {
        "content": "BEIJING/TOKYO Honda Motor Co  has chosen a competitor of embattled Takata Corp  to supply air bags for the next North American version of its Accord sedan  the automaker's best-selling vehicle  two people with knowledge of the decision said.",
        "date": "01232015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Exclusive: Honda opts for Takata rival to supply Accord air bags - sources "
    },
    {
        "content": "TOKYO Japan's Honda Motor Co sliced 6.5 percent off its core annual profit forecast as it set aside hundreds of millions of dollars in extra cash to cover an extended car recall to replace potentially faulty air bags made by Takata Corp.",
        "date": "01302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda cuts profit target as Takata air bag recalls bite "
    },
    {
        "content": "* Reduced sales offset by positive impact of weak yen   (Adds executive comment  results and forecasts)",
        "date": "01302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 1-Honda cuts profit target as Takata air bag recalls bite "
    },
    {
        "content": "Jan 30 Honda Motor Executive Vice President Tetsuo Iwamura says:",
        "date": "01302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda not seeing negative impact on N.America sales from air bag recalls "
    },
    {
        "content": "TOKYO  Jan 30 Japan's Honda Motor Co on Friday cut its annual operating profit forecast by 6.5 percent as it set aside more cash to cover an expanded recall of cars to replace potentially faulty air bags made by supplier Takata Corp .",
        "date": "01302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda cuts profit guidance as recall costs  sluggish Japan sales bite "
    },
    {
        "content": "* Says sees 2014/15 global group sales at 4.450 million cars versus previous forecast of 4.620 million",
        "date": "01302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "BRIEF-Honda Motor 2014/15 sales  currency rate forecasts "
    },
    {
        "content": "Jan 30 (Reuters)-            Honda Motor Co Ltd            CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                   9 months ended      9 months ended       Year to                  Dec 31  2014        Dec 31  2013     Mar 31  2015                     LATEST             YEAR-AGO          COMPANY                       RESULTS             RESULT          FORECAST      Sales           9.29 trln           8.75 trln       12.90 trln                    (+6.3 pct)",
        "date": "01302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "TABLE-Honda Motor -9-MTH group results (SEC) "
    },
    {
        "content": "TOKYO  Jan 19 Japan's Nikkei share average rose on Monday after strong U.S.  economic data buoyed sentiment and the weaker yen helped exporters such as Honda Motor Co  but Sharp Corp tumbled on a profit warning.     The Nikkei rose 0.9 percent to 17 014.29  recovering from a 2-1/2-month low of 16 592.57 hit on Friday.     But trading was thin  with only 2.040 billion shares changing hands  the lowest since Dec. 30 as there were fewer participants with the U.S. markets shut on Monday ",
        "date": "01192015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "Nikkei rises on strong U.S. data  weak yen; Sharp tumbles on profit warning "
    },
    {
        "content": "DETROIT Honda Motor Co said on Thursday that a driver was killed last week in a Houston suburb in a 2002 Accord equipped with a Takata Corp air bag that may have ruptured.",
        "date": "01302015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Driver killed in Houston crash in Honda with Takata air bags "
    },
    {
        "content": "WASHINGTON Honda Motor Co  has agreed to pay $70 million to the U.S. government in penalties for failing to report hundreds of injuries  deaths and other consumer claims involving its cars  transportation officials said on Thursday.",
        "date": "01082015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to pay $70 million for failure to report deaths  injuries "
    },
    {
        "content": "WASHINGTON  Jan 8 Honda Motor Co has agreed to pay $70 million in penalties to the U.S. government for failing to report hundreds of injuries  deaths and other consumer claims involving its cars  transportation officials said on Thursday.",
        "date": "01082015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "UPDATE 2-Honda to pay $70 million for failure to report deaths  injuries "
    },
    {
        "content": "WASHINGTON  Jan 8 Honda Motor Co has agreed to pay $70 million to the U.S. government in penalties for failing to report hundreds of injuries  deaths and other consumer claims involving its cars  transportation officials said on Thursday.",
        "date": "01082015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda to pay $70 million in fines for failure to report deaths  injuries-u.s. Agency "
    },
    {
        "content": "SHANGHAI  Jan 8 Honda Motor Co Ltd and its two Chinese joint ventures sold 788 276 vehicles in China in 2014  up 4.1 percent from the previous year  the Japanese automaker said on Thursday.",
        "date": "01082015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Honda says 2014 China auto sales up 4.1 pct y/y "
    },
    {
        "content": "DETROIT Automakers reported strong December U.S. sales on Monday  boosted by falling gasoline prices  but industry executives and analysts cautioned that growth would slow in 2015 after five years of rapid recovery from the recession. | Video ",
        "date": "01052015",
        "name": "Honda Motor Company Ltd",
        "news_type": "topStory",
        "symbol": "HMC",
        "title": "U.S. auto sales end 2014 strong but slower growth looms "
    },
    {
        "content": "DETROIT  Jan 5 Nissan Motor Co's  December U.S. sales narrowly topped and Honda Motor Co <7267.T) sales fell short of expectations as the Japanese companies led off what is expected to be strong sales figures for major automakers in the U.S. market on Monday.",
        "date": "01052015",
        "name": "Honda Motor Company Ltd",
        "news_type": "normal",
        "symbol": "HMC",
        "title": "Nissan tops U.S. December sales expectations  Honda misses "
    }
]