[
    {
        "content": "A federal appeals court on Friday upheld the validity of Honeywell International Inc patents on chemical refrigerant technology that had been challenged by Mexican industrial group Mexichem.",
        "date": "11182017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Appeals court upholds Honeywell refrigerant patents challenged by Mexichem "
    },
    {
        "content": "* ‍Major air carrier selects Honeywell data-loading solution to empower connected aircraft capabilities​ Source text for Eikon: Further company coverage:",
        "date": "11152017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-‍Major air carrier selects Honeywell's Aircraft Data Gateway solution "
    },
    {
        "content": "A U.S. appeals court has dismissed a proposed class action by Honeywell International Inc retirees who said the company violated federal benefits and labor laws when it sold the Ohio plant where they had worked and stopped paying for their health benefits.",
        "date": "11092017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell retirees not owed lifetime health benefits - 6th Circuit "
    },
    {
        "content": "* Honeywell announces determination of pricing terms of private exchange offers for four series of notes",
        "date": "11032017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell announces determination of pricing terms of private exchange offers "
    },
    {
        "content": "DETROIT  Oct 31 Industrial conglomerate Honeywell International Inc and U.S. truck fleet services company Omnitracs said on Tuesday they are rolling out software for large less-than-truckload (LTL) firms to comply with a looming federal regulation for drivers to log hours electronically and manage trucker workflow.",
        "date": "10312017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell  Omnitracs launch U.S. trucker work compliance software "
    },
    {
        "content": "* Trakopolis Iot Corp - ‍ expanding on its existing exclusive partnership for Honeywell's Connext Loneworker​ Source text for Eikon: Further company coverage:",
        "date": "10242017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Trakopolis Iot Corp says expanding on existing partnership for Honeywell's Connext Loneworker​ "
    },
    {
        "content": "* Honeywell announces private exchange offers for four series of notes",
        "date": "10232017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell announces private exchange offers for four series of notes "
    },
    {
        "content": "Honeywell International Inc  expects its aerospace profit margins to keep widening  helped by strong demand for service and spare parts  though margins will not improve as much as they did in the third quarter  the company's chief financial officer said on Friday as Honeywell reported results.",
        "date": "10202017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell sees aero margin widening  hikes 2017 revenue forecast "
    },
    {
        "content": "* ‍SIGNS BINDING AGREEMENT FOR PURCHASE OF 51% OF NEWCO IN WHICH 78% OF TECH-VALUE WILL BE CONFERRED​",
        "date": "10192017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Tech-Value founders confer 78 pct stake in Newco  to sell 51 pct of Newco to Sesa "
    },
    {
        "content": "Oct 20 Honeywell International Inc expects its aerospace profit margins to keep widening  helped by strong demand for service and spare parts  though margins will not improve as much as they did in the third quarter  the company's chief financial officer said on Friday as Honeywell reported results.",
        "date": "10202017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 2-Honeywell sees aero margin widening  hikes 2017 revenue forecast "
    },
    {
        "content": "* Honeywell says intend to undertake additional restructuring projects in Q4  enabled by lower effective tax rate",
        "date": "10202017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell to grow dividends at pace equal to or greater than earnings post 2018 - Conf Call‍​ "
    },
    {
        "content": "* Honeywell - sees 2017 total Honeywell sales $40.2 billion - $40.4 billion - presentation‍​",
        "date": "10202017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell sees 2017 sales of $40.2 bln - $40.4 bln "
    },
    {
        "content": "* Honeywell delivers earnings per share of $1.75 and sales of $10.1 billion",
        "date": "10202017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell reports quarterly earnings per share of $1.75 "
    },
    {
        "content": "Oct 20 Honeywell International Inc reported an 8.7 percent rise in third-quarter profit  driven by its aerospace business.",
        "date": "10202017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell profit rises 8.7 percent "
    },
    {
        "content": "* Says Cook succeeds Anne Madden  who was recently named as Honeywell's senior vice president and general counsel​ Source text for Eikon: Further company coverage:",
        "date": "10132017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell names Brian S. Cook global head of M&A "
    },
    {
        "content": "* Areva says output and job cuts matter of survival (Adds Areva comment)",
        "date": "10112017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "UPDATE 1-France's Areva to cut Niger uranium production on price drop "
    },
    {
        "content": "NEW YORK Honeywell International Inc said Tuesday it will pare its focus to four business lines  including aerospace  and spin off two businesses with $7.5 billion in revenue to help fund acquisitions. | Video ",
        "date": "10102017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell seeks M&A as it keeps aero  spins off two units "
    },
    {
        "content": "Oct 9 U.S. industrial conglomerate Honeywell International Inc said on Monday it would disclose the results of its portfolio review before markets open on Tuesday.",
        "date": "10092017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell to disclose results of portfolio review on Tuesday "
    },
    {
        "content": "* New investors would join Russian tycoon Mamut (Adds details throughout  pictures)",
        "date": "10132017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-Swiss helicopter maker preps $154 mln capital hike for liftoff "
    },
    {
        "content": "NIAMEY  Oct 11 French uranium mining and nuclear fuel group Areva NewCo's two uranium mines in Niger will cut staff and output in the face of falling uranium prices  a local union leader said on Wednesday.",
        "date": "10112017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Areva's Niger uranium mines to cut staff  slash production -union "
    },
    {
        "content": "* Conglomerate to spin off two business after corporate rethink",
        "date": "10102017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 5-Honeywell seeks M&A as it keeps aero  spins off 2 units "
    },
    {
        "content": "* Says “we are pleased\" that Honeywell board conducted portfolio review and agreed company should narrow its business focus‍​",
        "date": "10102017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Third Point says pleased with Honeywell portfolio review "
    },
    {
        "content": "Oct 6 Apple Inc said on Friday that Bruce Sewell will retire as general counsel and will be succeeded by former Honeywell International Inc executive Katherine Adams.",
        "date": "10062017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Apple names former Honeywell exec as new general counsel "
    },
    {
        "content": "* Honeywell to hold conference call on Tuesday  October 10 to discuss the results of its comprehensive portfolio review Source text for Eikon: Further company coverage:",
        "date": "10092017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell to hold conference call on Oct 10 to discuss results of portfolio review "
    },
    {
        "content": "* Indexes up: Dow 0.22 pct  S&P 0.26 pct  Nasdaq 0.34 pct (Updates to open)",
        "date": "10102017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Wall St scales new records on gains in Wal-Mart  energy stocks "
    },
    {
        "content": "* Honeywell names Anne T. Madden General Counsel Source text for Eikon: Further company coverage:",
        "date": "10062017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell names Anne Madden General Counsel "
    },
    {
        "content": "Honeywell International Inc  plans to spin off non-core assets and create at least two new publicly listed companies  as the U.S. industrial conglomerate seeks to streamline its business  according to people familiar with the matter.",
        "date": "10092017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Exclusive: Honeywell prepares to spin off businesses - sources "
    },
    {
        "content": "U.S. manufacturer Honeywell International Inc will spin off its home and ADI global distribution business and transportation systems into two independent  publicly-traded companies by the end of 2018  the company said on Tuesday.",
        "date": "10102017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell spins off units worth $7.5 billion in sales  keeps aerospace "
    },
    {
        "content": "* AstroNova - on Sept 28 co signed an exclusive worldwide asset purchase and licensing agreement with Honeywell International  Inc's aerospace division",
        "date": "10022017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-AstroNova signs asset purchase and licensing agreement with Honeywell's aerospace unit "
    },
    {
        "content": "Oct 8 The business jet market is expected to get a tailwind from the global economy's steady pace of growth and as Corporate America upgrades to newer aircraft.",
        "date": "10092017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell sees steady business jet sales over 10 years "
    },
    {
        "content": "Oct 10 U.S. manufacturer Honeywell International Inc will spin off its home and ADI global distribution business and transportation systems into two independent  publicly-traded companies by the end of 2018  the company said on Tuesday.",
        "date": "10102017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "CORRECTED-Honeywell spins off units worth $7.5 bln in sales  keeps aerospace "
    },
    {
        "content": "* Honeywell - ‍planned separation transactions are intended to be tax-free spins to Honeywell shareowners for U.S. Federal income tax purposes​",
        "date": "10102017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell to spin off Homes & ADI Global Distribution into two independent  publicly-traded cos by end of 2018​ "
    },
    {
        "content": "Oct 10 Honeywell International Inc is expected to unveil a corporate makeover on Tuesday that ties its growth more strongly to aerospace technology - the opposite of what activist investor Third Point Capital has urged since April.",
        "date": "10102017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell puts more of its chips on aerospace "
    },
    {
        "content": "U.S. industrial conglomerate Honeywell International Inc  announced plans to increase its annual divided by 12 percent on Friday as it resists pressure from investors to part with its aerospace unit.",
        "date": "09292017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell ups dividend  seeks to avoid aerospace spinoff "
    },
    {
        "content": "LONDON  Sept 29 (IFR) - Areva's bonds defied an S&P downgrade  after the company transferred its debt to a new entity just under a year ago.",
        "date": "09292017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Areva’s \"NewCo\" bonds resist downgrade "
    },
    {
        "content": "* China's Chengzhi Yongqing to use Honeywell's technology to convert coal into plastics",
        "date": "09282017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-China's Chengzhi Yongqing to use Honeywell's technology to convert coal into plastics "
    },
    {
        "content": "* Honeywell seeks rehearing of D.C. circuit court decision regarding EPA's Snap program",
        "date": "09222017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell seeks rehearing of D.C. circuit court decision regarding EPA's Snap program "
    },
    {
        "content": "Sept 29 U.S. industrial conglomerate Honeywell International Inc announced plans to increase its annual divided by 12 percent on Friday as it resists pressure from investors to part with its aerospace unit.",
        "date": "09292017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 2-Honeywell ups dividend  seeks to avoid aerospace spinoff "
    },
    {
        "content": "Sept 29 U.S. industrial conglomerate Honeywell International Inc will increase its annual divided by 12 percent as of the fourth quarter of this year  the company said on Friday  as it resists pressure from investors to part with its aerospace unit.",
        "date": "09292017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell ups dividend  CNBC says aerospace spinoff on ice "
    },
    {
        "content": "* Honeywell not expected to spin aerospace segment - CNBC  citing sources",
        "date": "09292017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell not expected to spin aerospace segment - CNBC "
    },
    {
        "content": "* Honeywell to increase annual dividend by 12 pct effective in the fourth quarter 2017",
        "date": "09292017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell increases annual dividend by 12 pct "
    },
    {
        "content": "* China-Russia C929 JV will involve more work by Chinese suppliers",
        "date": "09202017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "China-Russia wide-body C929 jet to rely on western suppliers for systems "
    },
    {
        "content": "PARIS  Sept 13 Pratt & Whitney's grip on the regional turboprop market could come under threat after Europe's ATR said it would look closely at alternative engines for its planes in future.",
        "date": "09132017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "ATR challenges Pratt's hold on turboprop engine market "
    },
    {
        "content": "* Lear Corp - co  Honeywell collaborating on automotive cybersecurity software solutions​",
        "date": "09122017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Lear Corp says collaborating with Honeywell on automotive cybersecurity software solutions​ "
    },
    {
        "content": "* Sonus Networks Inc - ‍Raymond Dolan will be president and chief executive officer​ of NewCo post Sonus and GENBAND Source text: (http://bit.ly/2uGgOnL) Further company coverage:",
        "date": "08152017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Sonus Networks - ‍Raymond Dolan will be CEO of NewCo post Sonus and GENBAND "
    },
    {
        "content": "* Change in holdings are as of June 30  2017 and compared with the previous quarter ended as of March 31  2017​ Source text for quarter ended June 30  2017: (http://bit.ly/2uDCtgE)",
        "date": "08142017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Chesapeake  Honeywell "
    },
    {
        "content": "WASHINGTON  Aug 11 The U.S. Federal Trade Commission said on Friday it had closed its investigation of several agreements between Honeywell International Inc and E I du Pont de Nemours and Co related to the sale of a next-generation refrigerant in automotive air conditioning systems.",
        "date": "08112017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "FTC says it closes investigation of Honeywell  Du Pont agreements "
    },
    {
        "content": "* Entered investment agreement between Newco shareholders and Newco relating to subscription by co of 20% of issued share capital of Newco​",
        "date": "08012017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Global Yellow Pages enters licensing  investment and subscription agreements​ "
    },
    {
        "content": "July 30 Honeywell International Inc shares could rise nearly 13 percent to $154 in the next year  driven by strong earnings growth  Barron's said in its July 31 edition.",
        "date": "07302017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell shares could leap 13 percent on profit gains -Barron's "
    },
    {
        "content": "WASHINGTON Honeywell International Inc  was awarded a $409 million contract for the Next Generation Thermal  Power  and Controls  program  \"a multiple government agency and industry joint effort to develop revolutionary and innovative technologies by 2024 timeframe \" the Pentagon said in a statement on Friday.",
        "date": "07282017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell wins $409 million U.S. defense contract: Pentagon "
    },
    {
        "content": "Honeywell International Inc  reported a better-than-expected quarterly profit  as sales in its aerospace unit and the business that caters to the energy industry were not as bad as it had feared. | Video ",
        "date": "07242017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell beats profit estimates  lifts full-year forecasts "
    },
    {
        "content": "WASHINGTON  July 28 Honeywell International Inc was awarded a $409 million contract for the Next Generation Thermal  Power  and Controls  program  \"a multiple government agency and industry joint effort to develop revolutionary and innovative technologies by 2024 timeframe \" the Pentagon said in a statement on Friday.",
        "date": "07282017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell wins $409 million U.S. defense contract -Pentagon "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.665per share Source text for Eikon: Further company coverage:",
        "date": "07282017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell International sets regular quarterly dividend of $0.665 per share "
    },
    {
        "content": "* Q2 revenue $10.08 bln vs est $9.89 bln (Adds details from CFO interview)",
        "date": "07212017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "UPDATE 3-Honeywell beats profit estimates  lifts full-year forecasts "
    },
    {
        "content": "* Says in quarter-ended June 30  recognized repositioning charges of $123 million for workforce reductions of 1 902 manufacturing  administrative positions‍​",
        "date": "07212017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says recognized repositioning charges of $123 mln for workforce reductions in Q2 "
    },
    {
        "content": "* Honeywell says it will likely continue to see softness in its mobility business  part of its safety and productivity solutions unit  until early 2018",
        "date": "07212017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says looking at 3-5 things \"very seriously\" from M&A perspective - Conf call "
    },
    {
        "content": "* Q3 earnings per share view $1.74  revenue view $9.83 billion -- Thomson Reuters I/B/E/S Source text for Eikon: (http://bit.ly/2vIe1GU) Further company coverage:",
        "date": "07212017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell sees Q3 sales down 1% - up 1% - presentation‍​ "
    },
    {
        "content": "July 21 Honeywell International Inc reported a 5.5 percent rise in second-quarter profit  helped by strength in its aerospace  and performance materials and technologies businesses.",
        "date": "07212017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell's profit rises 5.5 percent "
    },
    {
        "content": "* Yandex and Uber to combine their ridesharing businesses in russia and neighboring countries",
        "date": "07132017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Yandex and Uber to combine their ridesharing businesses in Russia and neighboring countries "
    },
    {
        "content": "* Further to announcement on 23 January 2017  FCFM Group properties IV Ltd  repaid £3 million commercial property SPV loan to group on 30 June 2017",
        "date": "07032017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Frenkel Topping Group says repayment of 3 mln stg SPV Loan "
    },
    {
        "content": "A federal appeals court has signed off on a $10 million settlement by Honeywell International to resolve complaints that one of its predecessor companies contaminated New Jersey residents' property with hexavalent chromium  a known carcinogen.",
        "date": "06292017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "3rd Circuit affirms $10 mln Honeywell chromium settlement "
    },
    {
        "content": "WASHINGTON The governments of the United States  Minnesota and Wisconsin on Thursday announced an $8.2 million settlement with Honeywell International Inc   Domtar Corp  and privately held XIK LLC to resolve a claim over natural resource damages at a Superfund site  the Justice Department said in a statement.",
        "date": "06292017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell  Domtar in $8.2 million settlement over U.S. Superfund site "
    },
    {
        "content": "LONDON/FRANKFURT  June 26 The field of prospective bidders for Japanese conglomerate  Toshiba Corp.'s Swiss-based smart meter group Landis+Gyr has narrowed to two  three banking sources said on Monday.",
        "date": "06262017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Bidders for Toshiba's Landis+Gyr narrows to two - sources "
    },
    {
        "content": "WASHINGTON  June 29 The governments of the United States  Minnesota and Wisconsin  on Thursday announced an $8.2 million settlement with Honeywell International Inc   Domtar Corp and privately held XIK LLC to resolve a claim over natural resource damages at a Superfund site  the Justice Department said in a statement.",
        "date": "06292017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell  Domtar in $8.2 mln settlement over U.S. Superfund site "
    },
    {
        "content": "* Honeywell's connected aircraft maintenance offering to reduce flight delays and cancellations for cathay pacific",
        "date": "06192017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell's says co  Cathay Pacific sign contract to deploy Honeywell's connected aircraft maintenance offering "
    },
    {
        "content": "* Honeywell invests in cyber security innovation center in asia pacific",
        "date": "06082017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell invests in cyber security innovation center in Asia Pacific "
    },
    {
        "content": "MONTREAL Honeywell International Inc's  aerospace business  under review as part of a spinoff proposal  has performed well and benefited from heavy investment from the U.S. technology and manufacturing company  Executive Chairman David Cote said on Monday.",
        "date": "06122017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell aerospace unit under review for spinoff has fared well: chairman "
    },
    {
        "content": "MONTREAL  June 12 Honeywell International Inc's aerospace business  under review as part of a spinoff proposal  has performed well and benefited from heavy investment from the U.S. technology and manufacturing company  Executive Chairman David Cote said on Monday.",
        "date": "06122017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 2-Honeywell aerospace unit under review for spinoff has fared well -chairman "
    },
    {
        "content": "MONTREAL  June 12 Honeywell International 's aerospace business  now under review as part of a proposal to spin off the unit  has performed well and has benefited from heavy investment from the U.S. technology and manufacturing company  executive chairman David Cote said on Monday.",
        "date": "06122017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell aerospace unit under review for spinoff has performed well -chairman "
    },
    {
        "content": "* Honeywell to acquire industrial cyber security software leader Nextnine",
        "date": "06122017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell to acquire Nextnine "
    },
    {
        "content": "* Honeywell and Vietjet Air sign $100 million agreement for nearly 100 131-9a auxiliary power units and more than a decade of maintenance service",
        "date": "05312017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell and Vietjet Air sign agreement for nearly 100 131-9A auxiliary power units "
    },
    {
        "content": "* ARKEMA FILES A NEW COMPLAINT WITH THE EUROPEAN COMMISSION ON THE USE OF THE REFRIGERANT 1234YF IN CAR AIR CONDITIONING",
        "date": "06022017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Arkema files a new complaint with European Commission against Honeywell "
    },
    {
        "content": "CAPE CANAVERAL  Fla.  May 24 Europe's Schiaparelli spacecraft came very close to a successful landing on Mars last year  but engineers failed to realize how jarring the probe's parachute descent could be  dooming the touchdown  a report released on Wednesday said.",
        "date": "05242017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Poorly understood Mars landing conditions led to probe’s demise - report "
    },
    {
        "content": "May 23 Honeywell International Inc said on Tuesday it would decide by fall this year whether to separate its aerospace business  a move hedge fund Third Point LLC wants the U.S. industrial conglomerate to pursue.",
        "date": "05232017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell to decide by fall whether to spin off aerospace unit "
    },
    {
        "content": "* Honeywell files International Trade Commission complaint against Code Corp. over bar code reading patent infringement Source text for Eikon: Further company coverage:",
        "date": "05232017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell files International Trade Commission complaint against Code Corp. over bar code reading patent infringement "
    },
    {
        "content": "* Honeywell CEO says aerospace restructuring is \"interesting\" and sees \"opportunity to simplify portfolio\"",
        "date": "05232017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell CEO sees \"opportunity to simplify portfolio\" - EPG 2017 Conf "
    },
    {
        "content": "* Sees Q2 earnings per share $1.75 - $1.80 - Electrical products group conference presentation",
        "date": "05232017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell reaffirms full year 2017 guidance - presentation "
    },
    {
        "content": "* Honeywell starts up $300 million automotive refrigerant production facility in Louisiana",
        "date": "05162017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell starts up $300 mln automotive refrigerant production facility in Louisiana "
    },
    {
        "content": "May 17 Honeywell International Inc launched a $100 million investment fund on Wednesday that will focus on technology startups.",
        "date": "05172017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell launches $100 million venture fund "
    },
    {
        "content": "The son of a New York state couple who died in a 2014 small plane crash in open water near Jamaica can pursue a products liability lawsuit against Honeywell International in state court  a federal judge in Newark  New Jersey ruled.",
        "date": "05112017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Lawsuit against Honeywell over small plane crash moved to N.J. court "
    },
    {
        "content": "* Honeywell says CFO Thomas Szlosek reports open market sale of 36 080 shares of co's common stock at average price of $131.16/share on May 8 - SEC filing Source text for Eikon: (http://bit.ly/2qXjo2y) Further company coverage:",
        "date": "05092017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says CFO Thomas Szlosek reports open market sale of 36 080 shares "
    },
    {
        "content": "* Honeywell International recalls about 900 units swift wireless gateway",
        "date": "05122017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-U.S. CPSC says Honeywell recalls about 900 units of SWIFT wireless gateway "
    },
    {
        "content": "* Honeywell and paragon to create life support technology for future nasa space missions Source text for Eikon: Further company coverage:",
        "date": "05012017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell  Paragon to create life support technology for future NASA space missions "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Daniel Loeb may be spinning his Honeywell International story a bit too far. The activist investor wants the $100 billion conglomerate to hive off its aerospace unit. That could be an option  but Loeb's pitch that it would boost shareholder value by $20 billion is a stretch.",
        "date": "05052017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Dan Loeb’s Honeywell spin goes too far "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.665 per share Source text for Eikon: Further company coverage:",
        "date": "04242017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell sets regular quarterly dividend of $0.665 per share "
    },
    {
        "content": "* Honeywell - on April 28  2017  co entered into a $1.5 billion 364-day credit agreement",
        "date": "04282017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell enters into a $1.5 bln 364-day credit agreement "
    },
    {
        "content": "Honeywell International Inc  said on Friday its commercial aviation after-sales business was benefiting from robust air travel  while its energy division was getting a lift from stable oil prices  sending shares to a record high.",
        "date": "04212017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell profit beats; shares hit record high "
    },
    {
        "content": "* Honeywell - \"Honeywell will continue executing its 2017 plan\"",
        "date": "04272017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell comments on Third Point's investment thesis "
    },
    {
        "content": "April 28 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04282017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "PRESS DIGEST - Wall Street Journal - April 28 "
    },
    {
        "content": "* Shares hit record high at $128.30 (Adds details from CFO interview; Updates shares)",
        "date": "04212017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 3-Honeywell profit beats; shares hit record high "
    },
    {
        "content": "NEW YORK Third Point LLC said Honeywell International Inc.  should separate its aerospace division  a move that would create more than $20 billion in shareholder value  according to the hedge fund.",
        "date": "04272017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Third Point wants Honeywell to spin off aerospace "
    },
    {
        "content": "NEW YORK  April 27 Third Point LLC said Honeywell International Inc. should separate its aerospace division  a move that would create more than $20 billion in shareholder value  according to the hedge fund.",
        "date": "04272017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-Third Point wants Honeywell to spin off aerospace "
    },
    {
        "content": "* Says orders for its PMT unit  which caters to the energy industry  have been \"very strong\"",
        "date": "04212017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says improving oil and gas markets will drive continued growth - Conf call "
    },
    {
        "content": "NEW YORK  April 27 Third Point LLC said Honeywell International Inc. should separate its aerospace division  a move that would create more than $20 billion in shareholder value  according to the hedge fund.",
        "date": "04272017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Third Point says Honeywell should spin off aerospace division "
    },
    {
        "content": "April 21 Diversified U.S. manufacturer Honeywell International Inc reported a 9 percent rise in quarterly profit  helped by higher-than-expected sales in its aerospace and energy businesses.",
        "date": "04212017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell's profit rises 9 percent "
    },
    {
        "content": "* Reported on Monday that unit Edos Srl signed a preliminary agreement with Trentinotre for acquisition of 100 pct in NewCo that at the time of sale will own a nursing home in Lombardy",
        "date": "04192017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-EuKedos unit to acquire NewCo owning nursing home in Lombardy "
    },
    {
        "content": "* Honeywell - announced a facility infrastructure modernization project at 21 federal aviation administration operated facilities across united states",
        "date": "04062017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell to modernize 21 FAA Buildings "
    },
    {
        "content": "* Honeywell's new satellite-based connected worker solution keeps remote workers safe Source text for Eikon: Further company coverage:",
        "date": "04042017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell's announces satellite-based solution for remote workers safety "
    },
    {
        "content": "* Honeywell leads $243 million infrastructure modernization project at Tinker air force base  Source text for Eikon:  Further company coverage:",
        "date": "03272017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell leads $243 mln infrastructure project at Tinker air force base "
    },
    {
        "content": "* diamond green diesel facility will expand its annual production capacity of renewable diesel from 10 000 barrels per day to 18 000 bpd",
        "date": "03172017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says Diamond Green diesel facility to expand annual production capacity of renewable diesel from 10 000 bpd to 18 000 bpd "
    },
    {
        "content": "* Honeywell - announced an $11 million modernization project at U.S. Air force base in Los Angeles  California.",
        "date": "03072017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell announced $11 mln modernization project at U.S. air force base in Los Angeles "
    },
    {
        "content": "* forecasts 3 900 to 4 400 global helicopter deliveries over next five years  Further company coverage:",
        "date": "03072017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell forecasts 3 900 to 4 400 global helicopter deliveries over next five years "
    },
    {
        "content": "* Honeywell forecasts 3 900 to 4 400 global helicopter deliveries over next five years  Source text for Eikon:  Further company coverage:",
        "date": "03062017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell forecasts 3 900 to 4 400 global helicopter deliveries over next 5 years "
    },
    {
        "content": "* UAW Honeywell retirees at Greenville  Ohio  plant win right to keep health care benefits  Further company coverage:",
        "date": "03012017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-UAW Honeywell retirees at Greenville  Ohio  plant win right to keep health care benefits "
    },
    {
        "content": "* Incoming CEO Darius Adamczyk says can deploy co's cash to buybacks or M&A if there is a tax regime change",
        "date": "03012017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell incoming CEO says can deploy co's cash to buybacks or M&A if there is tax regime change - Investor conf "
    },
    {
        "content": "* Honeywell hosts annual investor conference; reaffirms first quarter and full-year 2017 outlook",
        "date": "03012017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says targeting double-digit earnings growth in 2017 "
    },
    {
        "content": "* Alarm.Com Holdings - on Feb 22    waiting period under Hart-Scott-Rodino act as extended by previously disclosed timing agreement between co  Icontrol and FTC expired",
        "date": "02232017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Alarm.Com Holdings says waiting period under Hart-Scott-Rodino act expired "
    },
    {
        "content": "* Honeywell announces energy management  carbon reduction project with Denmark's largest retailer",
        "date": "02232017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell announces energy management  carbon reduction project with Denmark's largest retailer "
    },
    {
        "content": "* Afterpay Holdings Limited and Touchcorp Limited signed a heads of agreement (HOA) relating to an in principle agreement for a proposed merger",
        "date": "02222017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Touchcorp says intends to pursue a merger with Afterpay "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.665 per share  Source text for Eikon:  Further company coverage:",
        "date": "02092017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell sets regular quarterly dividend of $0.665/share "
    },
    {
        "content": "* Honeywell and Seeq collaborate to help industrial customers become safer  more efficient and more reliable  Source text for Eikon:  Further company coverage:",
        "date": "02142017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell and Seeq announce collaboration "
    },
    {
        "content": "* Honeywell - on February 10  2017  elected Darius Adamczyk as chief executive officer - SEC filing",
        "date": "02102017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says Darius Adamczyk named CEO  effective March 31 "
    },
    {
        "content": "* Third Point Llc dissolves share stake in Allergan Plc - SEC Filing",
        "date": "02102017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Third Point LLC takes share stake in JPMorgan  Bank of America - SEC Filing "
    },
    {
        "content": "A federal judge in New York has largely rejected Saint-Gobain's and Honeywell's bid to toss a proposed class action accusing the companies of contaminating local groundwater with a toxic chemical  lowering property values and exposing residents of a small upstate town to health risks.",
        "date": "02082017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Saint-Gobain  Honeywell must face C-8 contamination lawsuit "
    },
    {
        "content": "* Says received funding worth 35 million euros to back development of aerospace technologies in support of initiative",
        "date": "02082017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell receives funding for Clear Sky initiative "
    },
    {
        "content": "* Honeywell international- Borealis AG selected Co's UOP'S process technology for proposed plant in Kallo  Belgium  that converts propane into propylene  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says Borealis AG selected co's UOP's process technology for proposed plant in Kallo  Belgium "
    },
    {
        "content": "* Honeywell receives notice to proceed to support Sandia National Laboratories",
        "date": "01252017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell receives notice to proceed to support Sandia National Laboratories "
    },
    {
        "content": "* Google says its home assistant product google home will now have belkin wemo and honeywell as partners",
        "date": "01242017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Google says home assistant product Google Home will now have Belkin Wemo  Honeywell as partners "
    },
    {
        "content": "* Says positive sentiment in oil and gas business continues  sees signs of improving activity",
        "date": "01272017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell COO Darius Adamczyk says need clarity sooner on trade policies related to Mexico  China - Conf call "
    },
    {
        "content": "Diversified manufacturer Honeywell International Inc  posted fourth-quarter revenue that was roughly flat compared with a year earlier  while analysts were expecting an increase  hurt by weakness in its aerospace and energy businesses.",
        "date": "01272017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell revenue stays flat on weak aerospace  energy sales "
    },
    {
        "content": "* Intends to implement a proposed restructuring of company by way of a scheme of arrangement between co and scheme shareholders",
        "date": "01232017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Uni-Asia to restructure company; enters implementation deal with NewCo "
    },
    {
        "content": "Jan 27 Diversified manufacturer Honeywell International Inc posted fourth-quarter revenue that was roughly flat compared with a year earlier  while analysts were expecting an increase  hurt by weakness in its aerospace and energy businesses.",
        "date": "01272017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-Honeywell revenue stays flat on weak aerospace  energy sales "
    },
    {
        "content": "* Says Q4 aerospace segment margin 20.2 percent versus 21.5 percent last year",
        "date": "01272017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell reports 4th-qtr earnings of $1.34 per share "
    },
    {
        "content": "Jan 27 Diversified U.S. manufacturer Honeywell International Inc reported a 13.4 percent drop in fourth-quarter profit  hurt by weakness in its aerospace business.",
        "date": "01272017",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell profit falls 13.4 pct on weak aerospace businesses "
    },
    {
        "content": "* Honeywell files lawsuit against Code Corporation claiming widespread patent infringement",
        "date": "01202017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell files lawsuit against Code Corp "
    },
    {
        "content": "* Honeywell - co  aereon will collaborate on solutions to leverage honeywell's industrial internet of things ecosystem  Source text for Eikon:  Further company coverage:",
        "date": "01102017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell  Aereon will collaborate on solutions to leverage Honeywell's industrial internet of things ecosystem "
    },
    {
        "content": "PARIS  Jan 11 France will buy out minority shareholders in Areva  and delist the troubled nuclear group  the government said on Wednesday as talks with potential investors in a new nuclear fuel company being spun out of Areva neared a conclusion.",
        "date": "01112017",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "UPDATE 2-France to buy out Areva shareholders in bid for nuclear fix "
    },
    {
        "content": "Aerospace parts maker Honeywell International Inc on Friday forecast 2017 organic sales growth rate to improve for the first time in three years  partly helped by the stabilizing oil and gas market.",
        "date": "12162016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell forecasts 2017 organic sales growth of 1-3 percent "
    },
    {
        "content": "* Third-party investment needed so EU views govt support as legal",
        "date": "11222016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-Chinese  Japanese  Kazakh firms in talks about Areva stake -source "
    },
    {
        "content": "* Honeywell -intends to finance payment for notes tendered pursuant to offer with a portion of proceeds raised from new notes offering",
        "date": "10312016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell announces satisfaction of financing condition  consideration for any and all cash tender offer "
    },
    {
        "content": "* Honeywell International Inc - has delivered a notice of redemption to holders of outstanding 5.30% senior notes due 2017",
        "date": "11012016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell announces redemption of notes "
    },
    {
        "content": "* Honeywell and Flowserve collaborate on industrial internet of things (IIOT) solutions  Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell and Flowserve collaborate on industrial internet of things solutions "
    },
    {
        "content": "* Honeywell International - Announced pricing of registered public offering of $1.25 billion 1.400% senior notes due 2019  $250 million floating rate notes due 2019",
        "date": "10242016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell announces public offering of senior notes "
    },
    {
        "content": "* Honeywell and NASA bring STEM Education to life with hip-hop dance and beats  Source text for Eikon:  Further company coverage:",
        "date": "10242016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell and NASA bring STEM Education to life with hip-hop dance and beats "
    },
    {
        "content": "* Honeywell to increase dividend by 12% effective in the fourth quarter 2016",
        "date": "10282016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says 12 pct increase in regular annual cash dividend rate "
    },
    {
        "content": "* Offer will expire at 5:00 p.m.  New York City time  on October 31  2016  unless extended or earlier terminated",
        "date": "10242016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell announces cash tender offer "
    },
    {
        "content": "PARIS  Oct 24 Shares in French aircraft seats maker Zodiac Aerospace rose sharply on Monday after U.S. rival B/E Aerospace agreed to be bought by Rockwell Collins for $6.4 billion.",
        "date": "10242016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Rockwell deal to buy B/E Aero rekindles speculation over Zodiac "
    },
    {
        "content": "Oct 21 Honeywell International Inc said on Friday it had cut 3 017 positions across all its businesses in the third quarter  mainly related to the separation of its automation and control solutions business into two new reporting segments.",
        "date": "10212016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell cut 3 017 jobs in third quarter "
    },
    {
        "content": "* Honeywell reports third quarter 2016 sales of $9.8 billion  up 2%; earnings per share of $1.60",
        "date": "10212016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell reports Q3 earnings per share of $1.60 "
    },
    {
        "content": "* Honeywell International says targeting double-digit EPS growth in 2017 - SEC filing",
        "date": "10132016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says targets double-digit EPS growth in 2017 "
    },
    {
        "content": "Oct 6 Aero parts supplier Honeywell International Inc lowered its 2016 sales and profit forecast  partly due to lower shipments in its aerospace division.",
        "date": "10062016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell lowers upper end of 2016 profit forecast "
    },
    {
        "content": "Oct 6 Aero parts supplier Honeywell International Inc lowered the upper end of its 2016 sales and profit forecast range  partly due to fewer business jet and general aviation shipments in its aerospace division.",
        "date": "10062016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 2-Honeywell lowers upper end of 2016 profit forecast "
    },
    {
        "content": "* Honeywell updates financial guidance for new reporting segments  portfolio enhancements  and segment outlooks",
        "date": "10062016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell lowers its 2016 sales and profit forecast "
    },
    {
        "content": "* Crius Energy to expand solar energy business with proposed purchase of assets from Verengo",
        "date": "09232016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Crius Energy to expand solar energy business "
    },
    {
        "content": "* Transaction was funded through KBR's existing line of credit facility.",
        "date": "09192016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-KBR acquires Honeywell Government Services Provider HTSI "
    },
    {
        "content": "* Co's board of directors declares spin-off dividend of Advansix shares",
        "date": "09072016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell's board declares spin-off dividend of Advansix shares "
    },
    {
        "content": "PARIS  Aug 30 French nuclear group Areva  said on Tuesday it had formally started the process to transfer its nuclear fuel cycle activities to a new company.",
        "date": "08302016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Areva restructuring takes shape with assets transfer to NewCo "
    },
    {
        "content": "* Honeywell completes acquisition of Intelligrated  Source text for Eikon:  Further company coverage:",
        "date": "08302016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell completes acquisition of Intelligrated "
    },
    {
        "content": "* Honeywell reaches agreement to sell Honeywell Technology Solutions (HTSI) to KBR",
        "date": "08122016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell International reaches deal to sell HTSI to KBR for about $300 mln "
    },
    {
        "content": "* Controlling shareholders to acquire all outstanding shares of Kazax minerals in a going-private transaction",
        "date": "08102016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Kazax Minerals controlling shareholders to buy all shares of Kazax Minerals "
    },
    {
        "content": "Honeywell International Inc is in talks to acquire JDA Software Group Inc  in a deal that could value the U.S. supply chain management software company at around $3 billion  including debt  according to people familiar with the matter.",
        "date": "08082016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Exclusive: Honeywell explores acquisition of JDA Software - sources "
    },
    {
        "content": "* Honeywell UOP and Exxonmobil announced a technology licensing agreement with Hainan Handi Sunshine Petrochemical Co Ltd",
        "date": "08032016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell and Exxonmobil announce technology licensing agreement with Hainan Handi Sunshine Petrochemical "
    },
    {
        "content": "* Says entered into a $1.5 billion 364-day credit agreement with banks  financial institutions - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "08052016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says enters $1.5 bln 364-day credit agreement - SEC filing "
    },
    {
        "content": "* Facility will be able to process 10 million metric tons of LNG a year  have storage capacity of 690 000 cubic meters; startup expected in 2021",
        "date": "08012016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell to provide safety systems for LNG in Canada "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.595 per share  Source text for Eikon:  Further company coverage:",
        "date": "07292016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell sets quarterly dividend of $0.595/shr "
    },
    {
        "content": "* Net Element Inc says entered into a binding letter of intent with Paystar Inc- Sec filing",
        "date": "07212016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Net Element enters into binding letter of intent with Paystar Inc "
    },
    {
        "content": "* Says Lufthansa  Honeywell and Airbus want to develop a new safety system",
        "date": "07212016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Lufthansa  Honeywell  Airbus to develop runway safety system "
    },
    {
        "content": "Honeywell International Inc  lowered its 2016 sales forecast after weak demand in the second quarter led to an unexpected drop in revenue at its aerospace division.",
        "date": "07222016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell cuts 2016 sales forecast on weak aerospace demand "
    },
    {
        "content": "July 22 Honeywell International Inc  lowered its 2016 sales forecast after weak demand in the second quarter led to an unexpected drop in revenue at its aerospace division.",
        "date": "07222016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "CORRECTED-UPDATE 3-Honeywell cuts 2016 sales forecast on weak aerospace demand "
    },
    {
        "content": "* Indexes up: Dow 0.04 pct  S&P 0.21 pct  Nasdaq 0.31 pct   (Adds details  comments  updates)",
        "date": "07222016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Wall St inches up  led by telecoms; GE holds back Dow "
    },
    {
        "content": "* Says monitoring macro environment in light of Britain's recently announced exit from the EU; says expect minimal near-term impact",
        "date": "07222016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says weak biz jet demand weighing on aerospace div sales - Conf Call "
    },
    {
        "content": "July 22 Honeywell International Inc  a U.S. manufacturer of aerospace parts and climate control systems  reported a 7.4 percent rise in quarterly profit  helped by strength in its automation and control solutions business.",
        "date": "07222016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell quarterly profit rises 7.4 pct "
    },
    {
        "content": "* Temasek portfolio expected to show first drop in value in 7 yrs",
        "date": "07042016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Singapore's Temasek eyes U.S. investments to offset first portfolio drop in 7 years "
    },
    {
        "content": "Diversified industrial conglomerate Honeywell International Inc  agreed to buy distribution systems and logistics company Intelligrated Inc for $1.5 billion from a company backed by the Permira funds.",
        "date": "07012016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell to buy logistics company Intelligrated for $1.5 billion "
    },
    {
        "content": "July 1 Diversified industrial conglomerate Honeywell International Inc agreed to buy distribution systems and logistics company Intelligrated Inc for $1.5 billion from a company backed by the Permira funds.",
        "date": "07012016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-Honeywell to buy logistics company Intelligrated for $1.5 bln "
    },
    {
        "content": "July 1 Diversified industrial conglomerate Honeywell International Inc agreed to buy distribution systems and logistics company Intelligrated Inc for $1.5 billion from a company backed by the Permira funds.",
        "date": "07012016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell to buy logistics company Intelligrated for $1.5 bln "
    },
    {
        "content": "* Honeywell to acquire Intelligrated  a leader in supply chain and warehouse automation technologies",
        "date": "07012016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell International to acquire Intelligrated for $1.5 bln "
    },
    {
        "content": "June 28 Honeywell International Inc said Chief Operating Officer Darius Adamczyk will succeed company veteran Dave Cote as chief executive next year.",
        "date": "06282016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell names Darius Adamczyk to succeed Dave Cote as CEO "
    },
    {
        "content": "Japan's Toyota Industries Corp  is competing against U.S. diversified industrial conglomerate Honeywell International Inc  to acquire U.S. distribution systems and logistics company Intelligrated Inc  people familiar with the matter said.",
        "date": "07012016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Exclusive: Toyota Industries  Honeywell in bid to buy Intelligrated - sources "
    },
    {
        "content": "* Cote will continue as executive chairman until company's annual shareowners meeting in April 2018",
        "date": "06282016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell names Darius Adamczyk to succeed Dave Cote as CEO "
    },
    {
        "content": "* Honeywell UOP openes a new production line at its catalyst manufacturing facility in Shreveport",
        "date": "06142016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell UOP openes new production line at its catalyst manufacturing facility in Shreveport "
    },
    {
        "content": "MONTREAL Honeywell International Inc  would not rule out bidding for another major aerospace supplier  among other possible acquisition targets  after merger talks collapsed in March with rival United Technologies Corp   the company's chief executive said on Monday.",
        "date": "06132016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell won't rule out aerospace M&A targets "
    },
    {
        "content": "Honeywell International Inc   a U.S. manufacturer of aerospace parts and climate control systems  said it would spin off its $1.3 billion resins and chemicals operations into a standalone company  as it focuses on higher-growth businesses.",
        "date": "05122016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell to spin off its $1.3 billion resins and chemicals business "
    },
    {
        "content": "May 12 Honeywell International Inc  a U.S. manufacturer of aerospace parts and climate control systems  said it would spin off its $1.3 billion resins and chemicals operations into a standalone company  as it focuses on higher-growth businesses.",
        "date": "05122016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 2-Honeywell to spin off its $1.3 bln resins and chemicals business "
    },
    {
        "content": "* Erin Kane named as president and chief executive officer of Advansix",
        "date": "05122016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says to spin off resins and chemicals unit "
    },
    {
        "content": "May 12 Honeywell International Inc  a U.S. manufacturer of aerospace parts and climate control systems  said it would spin off its resins and chemicals business into a standalone  publicly traded company.",
        "date": "05122016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell to spin off resins and chemicals business "
    },
    {
        "content": "* Engineering and F-Net AG on May 11  executed agreement for sale and transfer of 51 pct of DST shares Consulting GmbH (DST)and EMDS GmbH  (EMDS)to Engineering",
        "date": "05122016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Engineering Ingegneria Informatica: acquisition of 51% of DST Consulting and EMDS "
    },
    {
        "content": "* Agreement fully resolves pending patent litigation between honeywell and nest labs",
        "date": "05052016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Google and Honeywell resolve patent dispute "
    },
    {
        "content": "* Says Kathleen Winters will succeed Bob Qutub as CFO  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04272016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-MSCI says Kathleen Winters appointed CFO "
    },
    {
        "content": "* Entered into a $1.5 billion 364-day credit agreement - SEC filing",
        "date": "04292016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell enters into $1.5 billion credit agreement "
    },
    {
        "content": "A proposed class action alleging that Honeywell International sold defective humidifiers and made it hard to enforce the warranty can move forward  a Philadelphia federal judge has ruled.",
        "date": "04282016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Suit alleging Honeywell dehumidifier defects can proceed -judge "
    },
    {
        "content": "April 28 Index provider MSCI Inc said Kathleen Winters would replace Bob Qutub as chief financial officer  effective May 2.",
        "date": "04282016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "MOVES-MSCI names Honeywell's Kathleen Winters as CFO "
    },
    {
        "content": "Honeywell International Inc   a U.S. manufacturer of aerospace parts and climate control systems  said its board authorized the company to repurchase up to $5 billion of its common stock.",
        "date": "04252016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell to repurchase up to $5 billion of shares "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.595 per share  Source text for Eikon:  Further company coverage:",
        "date": "04252016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell sets regular quarterly dividend of $0.595/shr "
    },
    {
        "content": "* Says on conf call segment margin was lower than guidance  due to higher than-expected sales of lower margin products",
        "date": "04222016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell says higher sales of lower margin products hurt Q1 margins - Conf Call "
    },
    {
        "content": "April 25 Honeywell International Inc  a U.S. manufacturer of aerospace parts and climate control systems  said its board authorized the company to repurchase up to $5 billion of its common stock.",
        "date": "04252016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell to repurchase up to $5 bln of shares "
    },
    {
        "content": "* Says authorization as part of its cash deployment strategy  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "04252016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell International announces $5 bln share repurchase program "
    },
    {
        "content": "Honeywell International Inc  posted a 6.3 percent rise in quarterly profit  helped by higher sales in its automation and climate control systems division  and the company raised the low end of its full-year earnings forecast.",
        "date": "04222016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell quarterly profit rises 6.3 percent "
    },
    {
        "content": "April 22 Honeywell International Inc  posted a 6.3 percent rise in quarterly profit  helped by higher sales in its automation and climate control systems division  and the company raised the low end of its full-year earnings forecast.",
        "date": "04222016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-Honeywell quarterly profit rises 6.3 pct "
    },
    {
        "content": "April 22 Honeywell International Inc  posted a 6.3 percent rise in quarterly profit  helped by strength in its automation and climate control systems businesses.",
        "date": "04222016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell quarterly profit rises 6.3 pct "
    },
    {
        "content": "* Honeywell CEO David Cote on CNBC-\"have a tough time seeing Honeywell-UTX deal return\"",
        "date": "04082016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell CEO David Cote on CNBC-\"have a tough time seeing Honeywell-UTX deal return\" "
    },
    {
        "content": "* Honeywell said to consider sale of nylon chemicals business - Bloomberg citing sources",
        "date": "04072016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell said to consider sale of nylon chemicals business- Bloomberg "
    },
    {
        "content": "NEW YORK  April 4 Honeywell International Inc  on Monday named Darius Adamczyk as its first president and chief operating officer  a newly-created role seen as a step toward designating a successor to Chief Executive Dave Cote  who has led the company for 14 years.",
        "date": "04042016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell names chief operating officer seen as CEO-in-waiting "
    },
    {
        "content": "April 7 The head of marketing for the U.S. online business of Wal-Mart Stores has left the retailer to return to a business-conference firm he founded  a company statement said on Thursday.",
        "date": "04072016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Wal-Mart's head of U.S. online marketing leaves for startup "
    },
    {
        "content": "* Honeywell International Inc partners with Chinese manufacturing leader to meet increased worldwide demand for low-global-warming-potential auto refrigerant",
        "date": "04072016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell partners with Chinese manufacturer to produce Solstice yf "
    },
    {
        "content": "NEW YORK  April 4 Honeywell International Inc  on Monday named Darius Adamczyk as its first president and chief operating officer  a newly created role seen as a step toward designating a successor to Chief Executive Dave Cote  who has led the company for 14 years.",
        "date": "04042016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-Honeywell names chief operating officer seen as CEO-in-waiting "
    },
    {
        "content": "* COO Adamczyk will receive a base salary of $1.2 million  effective as of date of his promotion - SEC filing  Source text - http://1.usa.gov/25LuPdH Further company coverage:",
        "date": "04062016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Honeywell COO Adamczyk to get base salary of $1.2 mln - SEC filing "
    },
    {
        "content": "April 4 Honeywell International Inc  Chief Executive Dave Cote could retire as soon as next year  the Wall Street Journal reported on Monday.",
        "date": "04042016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell CEO Dave Cote could retire as soon as next year-WSJ "
    },
    {
        "content": "* Honeywell CEO Cote could retire as soon as next year - CNBC citing DJ  Further company coverage:",
        "date": "04042016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell CEO Cote could retire as soon as next year - CNBC citing DJ "
    },
    {
        "content": "* Honeywell names president and chief operating officer and new leader of performance materials and technologies",
        "date": "04042016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Honeywell names Darius Adamczyk COO "
    },
    {
        "content": "NEW YORK United Technologies Corp   maker of jet engines  aircraft components and building systems  said it is open to doing a large acquisition despite rejecting a merger proposed by Honeywell International Inc .",
        "date": "03112016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "United Tech looks for a big deal after rebuffing Honeywell "
    },
    {
        "content": "* Restrictions respond to alleged violations of Iran sanctions",
        "date": "03082016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 6-U.S. curbs China's ZTE exports over Iran business allegations "
    },
    {
        "content": "NEW YORK  March 10 United Technologies Corp   maker of jet engines  aircraft components and building systems  said it is open to doing a large acquisition despite rejecting a merger proposed by Honeywell International Inc .",
        "date": "03102016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "UPDATE 3-United Tech looks for a big deal after rebuffing Honeywell "
    },
    {
        "content": "NEW YORK  March 10 United Technologies Corp   maker of jet engines  elevators  air conditioners and other building control and airplane products  said a rebuffed merger proposal from Honeywell International Inc faced \"very real\" obstacles and was not necessary for growth.",
        "date": "03102016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "United Technologies says Honeywell merger faced real obstacles "
    },
    {
        "content": "Feb 26 Honeywell International Inc Chief Executive David Cote was sporting the casual jeans and sweater he often likes to wear in the office when he was visited by his then-counterpart at United Technologies Corp in 2012  Louis Chenevert.",
        "date": "02292016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "RPT-DEALTALK-How Honeywell turned the tables on United Tech "
    },
    {
        "content": "March 2 Aircraft parts maker Honeywell International Inc on Wednesday reaffirmed its 2016 outlook and forecast 2017 sales above analysts' estimates  a day after it scrapped its $90.7 billion offer to buy rival United Technologies Corp.",
        "date": "03022016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell backs 2016 outlook  sees 2017 sales above estimates "
    },
    {
        "content": "NEW YORK  Feb 28 Honeywell International Inc's  proposal to buy rival United Technologies Corp  would create an industrial giant bigger than aircraft makers Boeing Co or Airbus Group  potentially changing the balance of power between manufacturer and supplier.",
        "date": "02282016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "RPT-Proposed Honeywell-United Tech deal could result in greater pricing power "
    },
    {
        "content": "March 1 The following bids  mergers  acquisitions and disposals were reported by 2040 GMT on Tuesday:",
        "date": "03012016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  Feb 26 Honeywell International Inc's  proposal to buy rival United Technologies Corp  would create an industrial giant bigger than aircraft makers Boeing Co or Airbus Group  potentially changing the balance of power between manufacturer and supplier.",
        "date": "02272016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Proposed Honeywell-United Tech deal could result in greater pricing power "
    },
    {
        "content": "Honeywell International Inc  Chief Executive David Cote was sporting the casual jeans and sweater he often likes to wear in the office when he was visited by his then-counterpart at United Technologies Corp  in 2012  Louis Chenevert.",
        "date": "02262016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "How Honeywell turned the tables on United Tech "
    },
    {
        "content": "* Indexes up: Dow 1.79 pct  S&P 1.9 pct  Nasdaq 2.34 pct   (Updates to afternoon trading)",
        "date": "03012016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Banks and tech fuel robust gains on Wall Street "
    },
    {
        "content": "Aircraft parts maker Honeywell International Inc  said Tuesday it scrapped its $90.7 billion offer to buy rival United Technologies Corp   citing the company's unwillingness to engage in negotiations.",
        "date": "03012016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "United Tech keeps to solo path as Honeywell drops bid "
    },
    {
        "content": "Feb 26 Honeywell International Inc Chief Executive David Cote was sporting the casual jeans and sweater he often likes to wear in the office when he was visited by his then-counterpart at United Technologies Corp in 2012  Louis Chenevert.",
        "date": "02262016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "DEALTALK-How Honeywell turned the tables on United Tech "
    },
    {
        "content": "Feb 26 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "02262016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* United Tech shares down 2.8 pct  Honeywell up 3.2 pct   (Adds industry quotes  background  details  UTC statement  updates shares)",
        "date": "03012016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 3-United Tech keeps to solo path as Honeywell drops bid "
    },
    {
        "content": "Feb 26 U.S. industrial conglomerate United Technologies on Friday rejected a $90.7 billion offer by rival aerospace supplier Honeywell International Inc  saying that pursuing a merger would be \"irresponsible\" toward its shareholders.",
        "date": "02272016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "CORRECTED-UPDATE 4-United Tech rejects Honeywell's $90.7 bln offer "
    },
    {
        "content": "Feb 26 United Technologies Corp said Honeywell International Inc's offer grossly undervalued the company and overstated potential synergies.",
        "date": "02262016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "United Tech says Honeywell's offer undervalues company "
    },
    {
        "content": " ",
        "date": "03012016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell scraps offer to buy United Tech "
    },
    {
        "content": " ",
        "date": "02272016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 5-United Tech rejects Honeywell's $90.7 bln offer "
    },
    {
        "content": " ",
        "date": "02262016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell says had offered to buy United Tech for $108 per share "
    },
    {
        "content": "Feb 24 Airbus Group SE Chief Executive Tom Enders said in statement on Wednesday that he did not see how a combination of Honeywell International Inc and United Technologies Inc (UTC) would be in his company's interests.",
        "date": "02242016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Airbus CEO against Honeywell's merger with United Technologies "
    },
    {
        "content": "Feb 23 Honeywell International Inc  confirmed on Tuesday that it had engaged in deal talks with United Technologies Corp over the past year  and said it did not see regulatory process as a \"material obstacle\" to the deal.",
        "date": "02232016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell does not see regulatory hurdles for United Tech deal "
    },
    {
        "content": "Feb 22 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "02222016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Feb 23 Aerospace component supplier Honeywell International Inc confirmed on Tuesday that it had engaged in deal talks with United Technologies Corp over the past year  and said it did not see regulatory process as a \"material obstacle\" to the deal.",
        "date": "02232016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-Honeywell does not see regulatory hurdles for United Tech deal "
    },
    {
        "content": "* Indexes up: Dow 1.37 pct  S&P 1.28 pct  Nasdaq 1.36 pct   (Updates to afternoon)",
        "date": "02222016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Wall St lifted by muscular oil rally but some still wary "
    },
    {
        "content": "Feb 22 Honeywell International Inc and United Technologies Corp have held talks about a merger  CNBC reported  citing people familiar with the situation.",
        "date": "02222016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell  United Technologies held merger talks - CNBC "
    },
    {
        "content": "Honeywell International Inc  is seeking a buyer for its building solutions business  the Wall Street Journal reported  adding that the business could fetch $3 billion to $4 billion.",
        "date": "02242016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell seeking buyer for building solutions business: WSJ "
    },
    {
        "content": "Feb 24 Honeywell International Inc is seeking a buyer for its building solutions business  the Wall Street Journal reported  adding that the business could fetch $3 billion to $4 billion.",
        "date": "02242016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 2-Honeywell seeking buyer for building solutions business - WSJ "
    },
    {
        "content": "Wall Street stocks slid on Tuesday  hurt by pressure from a renewed drop in oil prices  undercutting momentum that had helped the market rebound from a sluggish start to the year.",
        "date": "02232016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Wall St. stumbles as oil slumps again "
    },
    {
        "content": "Feb 24 Honeywell International Inc is seeking a buyer for its building solutions business  CNBC reported  citing Dow Jones.",
        "date": "02242016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell seeking buyer for building solutions business - CNBC "
    },
    {
        "content": "* \"We do not see the regulatory process as a material obstacle to a transaction\"",
        "date": "02232016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "CORRECTED-BRIEF-Honeywell confirms that over past year in talks with United Technologies Corp over possible combination "
    },
    {
        "content": "PARIS France's Thales  ruled out its participation in a \"Big Bang\" merger as the aerospace industry digested news of inconclusive talks between two of its largest suppliers  United Technologies  and Honeywell .",
        "date": "02232016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Thales shuns big mergers after U.S. aero firms try to team up "
    },
    {
        "content": "Feb 23 Thales CEO Patrice Caine at annual results news conference:",
        "date": "02232016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Thales CEO says UTC-Honeywell would have posed anti-trust problems "
    },
    {
        "content": "Honeywell International Inc   a U.S. manufacturer of aerospace parts and climate control systems  reported a 24.9 percent rise in quarterly profit  helped by lower costs.",
        "date": "01292016",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell profit rises 24.9 percent as costs fall "
    },
    {
        "content": "Jan 29 Honeywell International Inc  a U.S. manufacturer of aerospace parts and climate control systems  reported a 24.9 percent rise in quarterly profit  helped by lower costs.",
        "date": "01292016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-Honeywell profit rises 24.9 pct as costs fall "
    },
    {
        "content": "Jan 29 Honeywell International Inc  a U.S. manufacturer of aerospace parts and climate control systems  reported a 24.9 percent rise in quarterly profit  helped by lower costs.",
        "date": "01292016",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell profit rises 24.9 pct as costs fall "
    },
    {
        "content": "BRUSSELS  Dec 22 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "12222015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "EU mergers and takeovers (Dec 22) "
    },
    {
        "content": "* European Commission has granted clearance for acquisition of Elster by Honeywell International Inc\u007f",
        "date": "12212015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-European Commission clears Honeywell deal to buy Melrose unit Elster "
    },
    {
        "content": "BRUSSELS  Dec 21 European Union antitrust regulators on Monday approved Honeywell International Inc's  $5.1 billion purchase of Elster Group  the utility consumption metering business of Britain's Melrose Industries Plc  subject to conditions.",
        "date": "12212015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "EU regulators approve Honeywell's buy of Elster subject to conditions "
    },
    {
        "content": "BRUSSELS  Dec 3 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "12032015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "UPDATE 1-EU mergers and takeovers (Dec 3) "
    },
    {
        "content": "* Has approved joint venture between Hollard Insurance and FirstRand (owner of WesBank)",
        "date": "10292015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Competition Tribunal approves WesBank-Hollard merger with conditions "
    },
    {
        "content": "* Daimler to phase in CO2 as car coolant from next year   (Adds more detail from statement and background)",
        "date": "10202015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "UPDATE 1-Daimler bends to EU pressure to use old-style car coolant "
    },
    {
        "content": "FRANKFURT  Oct 20 Merck has cleared a major anti-trust hurdle to its planned $17 billion acquisition of Sigma-Aldrich with the latter's agreed sale of assets to Honeywell  the German drugmaker said on Tuesday.",
        "date": "10202015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Merck clears major hurdle to Sigma-Aldrich takeover "
    },
    {
        "content": "* Says Sigma-Aldrich has agreed to sell parts of solvents business to Honeywell",
        "date": "10202015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Merck's Sigma-Aldrich sells some assets to Honeywell "
    },
    {
        "content": "The flagging oil sector and volatile emerging economies are keeping pressure on U.S. industrial manufacturers such as General Electric Co  and Honeywell International   which are cutting costs or squeezing supply chains to help churn out stronger profits.",
        "date": "10162015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Flagging oil sector keeps pressure on industrial manufacturers "
    },
    {
        "content": "Oct 16 The flagging oil sector and volatile emerging economies are keeping pressure on U.S. industrial manufacturers such as General Electric Co and Honeywell International  which are cutting costs or squeezing supply chains to help churn out stronger profits.",
        "date": "10162015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "WRAPUP 1-Flagging oil sector keeps pressure on industrial manufacturers "
    },
    {
        "content": "Honeywell International Inc   a maker of industrial  aerospace and auto components  reported lower-than-expected quarterly revenue  hurt by weak demand from oil and gas customers.",
        "date": "10162015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell revenue misses on weak demand from oil  gas customers "
    },
    {
        "content": "* Shares fall as much as 3.2 pct   (Adds CFO and analyst comments)",
        "date": "10162015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 3-Honeywell revenue misses on weak demand from oil  gas customers "
    },
    {
        "content": "* Futures: Dow down 14 pts  S&P down 1.3 pts  Nasdaq up 0.8 pts   (Adds details  comment  updates prices)",
        "date": "10162015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Futures little changed as investors digest results "
    },
    {
        "content": "By Barbara Grzincic  Testimony by a widow and her expert witness provide sufficient evidence to take an asbestos-injury case against Honeywell International Inc to trial  a federal judge ruled Friday.",
        "date": "10062015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Asbestos lawsuit clears Honeywell's challenge "
    },
    {
        "content": "Oct 16 U.S. stock index futures edged lower on Friday as investors digested results from industrial heavyweights General Electric and Honeywell.",
        "date": "10162015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "CORRECTED-US STOCKS-Futures edge lower after GE  Honeywell results "
    },
    {
        "content": "Oct 16 Honeywell International Inc  a U.S. manufacturer of aerospace parts and climate control systems  reported an 8.3 percent rise in quarterly profit  helped by lower costs.",
        "date": "10162015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell profit rises about 8 pct as costs fall "
    },
    {
        "content": "* Indexes down: Dow 1.1 pct  S&P 1.2 pct  Nasdaq 1.5 pct   (Updates to close)",
        "date": "09222015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Wall St slides with commodity-related stocks  auto suppliers "
    },
    {
        "content": "The U.S. Nuclear Regulatory Commission said it has begun a special inspection at Honeywell Metropolis Works in Illinois to assess a uranium hexafluoride leak that occurred during maintenance activity on Saturday evening.",
        "date": "08042015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell unit probed in toxic gas leak in Illinois "
    },
    {
        "content": "Aug 4 The U.S. Nuclear Regulatory Commission said it has begun a special inspection at Honeywell Metropolis Works in Illinois to assess a uranium hexafluoride leak that occurred during maintenance activity on Saturday evening.",
        "date": "08042015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-Honeywell unit probed in toxic gas leak in Illinois "
    },
    {
        "content": "Honeywell International Inc  has made its largest purchase in more than a decade  agreeing to buy the utility consumption metering business of Britain's Melrose Industries Plc  for about $5.1 billion.",
        "date": "07282015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell to buy Melrose's utility metering business for $5.1 billion "
    },
    {
        "content": "July 28 Honeywell International Inc has made its largest purchase in more than a decade  agreeing to buy the utility consumption metering business of Britain's Melrose Industries Plc for about $5.1 billion.",
        "date": "07282015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 3-Honeywell to buy Melrose's utility metering business for $5.1 bln "
    },
    {
        "content": "LAGOS  July 28 Nigeria's Honeywell Flourmills  said on Tuesday its 2015 pretax profit fell to 1.43 billion naira ($7.19 million)  down 66 percent from a year earlier.",
        "date": "07282015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Nigeria's Honeywell Flourmills says 2015 profit down 66 pct "
    },
    {
        "content": "July 28 Engineering turnaround specialist Melrose Industries Plc said it would sell its Elster business to Honeywell International Inc for 3.3 billion pounds ($5.14 billion) in cash.",
        "date": "07282015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Melrose to sell Elster business to Honeywell for $5.1 bln "
    },
    {
        "content": "* Consideration is payable in cash on completion  subject to customary adjustments  and implies a multiple of 3.1 times 2014 revenue and 14.3 times 2014 headline EBITDA",
        "date": "07282015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "BRIEF-Melrose Industries plans to sell Elster to Honeywell "
    },
    {
        "content": "July 17 General Electric Co and Honeywell International Inc beat expectations for their latest quarterly results on Friday as ongoing cost-cutting efforts paid off with profit margin increases that impressed Wall Street analysts.",
        "date": "07172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Cost controls buoy GE  Honeywell amid economic pressures "
    },
    {
        "content": "Honeywell International Inc  reported a better-than-expected increase in quarterly profit as the maker of aircraft parts and climate control systems reined in costs amid declining sales.",
        "date": "07172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell profit beats estimates as cost controls pay off "
    },
    {
        "content": "* Shares up as much as 3 pct   (Adds details  updates shares)",
        "date": "07172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 2-Honeywell profit beats estimates as cost controls pay off "
    },
    {
        "content": "July 17 Honeywell International Inc  a U.S. manufacturer of aerospace parts and climate control systems  reported a 9 percent rise in quarterly profit  helped by lower costs.",
        "date": "07172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell profit rises 9 pct as costs fall "
    },
    {
        "content": "* TAI selects LHTEC's CTS800 to power Turkish light utility helicopter",
        "date": "06162015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "BRIEF-Turkish Aerospace Industries selects LHTEC's engines for light utility helicopter "
    },
    {
        "content": "NEW YORK  May 10 Honeywell International Inc  shares could rise by about 20 percent in the next year and close to 50 percent in the longer-term if it continues to meet its forecasts and improve its margins  Barron's financial newspaper said in its latest issue.",
        "date": "05102015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell shares could rise 20 pct in the next year - Barron's "
    },
    {
        "content": "United Technologies Corp  posted a higher-than-expected  quarterly profit on Tuesday  helped by gains in its unit selling climate control and security systems for buildings  even as a stronger dollar weighed on sales.",
        "date": "04212015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Strong dollar weighs on United Tech sales  but profit rises "
    },
    {
        "content": "April 21 United Technologies Corp posted a higher-than-expected  quarterly profit on Tuesday  helped by gains in its unit selling climate control and security systems for buildings  even as a stronger dollar weighed on sales.",
        "date": "04212015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 2-Strong dollar weighs on United Tech sales  but profit rises "
    },
    {
        "content": "* Indexes down: Dow 1.5 pct  S&P 1.1 pct  Nasdaq 1.5 pct   (Updates to close)",
        "date": "04172015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "US STOCKS-Wall St falls steeply with China  Greece fears paramount "
    },
    {
        "content": "* Indexes down: Dow 1.8 pct  S&P 1.4 pct  Nasdaq 1.8 pct   (Updates to late afternoon)",
        "date": "04172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Wall St selloff accelerates amid China  earnings fears "
    },
    {
        "content": "NEW YORK  April 16 In what would be a significant and hard-fought victory for U.S. businesses  the Obama administration said on Thursday it will propose new rules for workplace wellness programs that would treat as voluntary even plans that penalize workers thousands of dollars for not participating.",
        "date": "04162015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "UPDATE 3-Obama administration to remove hurdle to 'wellness' penalties "
    },
    {
        "content": "April 17 General Electric Co and Honeywell International Inc said on Friday they will take steps to cushion the impact of a stronger dollar  which hurt first-quarter results at both companies.",
        "date": "04172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Strong dollar hit to GE  Honeywell may bode poorly for other industrials "
    },
    {
        "content": "* Indexes down: Dow 1.46 pct  S&P 1.11 pct  Nasdaq 1.45 pct   (Adds comment  updates prices)",
        "date": "04172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Wall St tumbles  hit by weak earnings  China "
    },
    {
        "content": "* Indexes down: Dow 1.37 pct  S&P 0.96 pct  Nasdaq 1.21 pct   (Updates to open)",
        "date": "04172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Wall St slumps  hit by weak earnings  China "
    },
    {
        "content": "* Futures down: Dow 156 pts  S&P 14.25 pts  Nasdaq 38 pts   (Adds details  comment  updates prices)",
        "date": "04172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Wall St set for lower open on China clampdown worry "
    },
    {
        "content": "Honeywell International Inc   a major manufacturer of aircraft electronics and climate control systems  reported a 5 percent fall in quarterly revenue on Friday  hurt by  the sale of its friction materials business and a strong dollar.",
        "date": "04172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell first-quarter revenue falls due to strong dollar "
    },
    {
        "content": "* Aerospace business sales falls 6 pct   (Adds details  shares)",
        "date": "04172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 2-Honeywell 1st-qtr revenue falls due to strong dollar "
    },
    {
        "content": "April 17 Honeywell International Inc  a diversified U.S. manufacturer of aerospace parts and climate control systems  reported a 10 percent rise in quarterly profit  helped by a fall in costs.",
        "date": "04172015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell first-quarter profit rises 10 pct as costs fall "
    },
    {
        "content": "A tentative agreement has been reached in a labor dispute at a Honeywell International Inc uranium conversion plant in Illinois  potentially ending a work stoppage that began last August  federal mediators and the company said on Saturday.",
        "date": "03212015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "U.S. mediators report tentative deal in Honeywell Illinois dispute "
    },
    {
        "content": "March 21 A tentative agreement has been reached in a labor dispute at a Honeywell International Inc  uranium conversion plant in Illinois  potentially ending a work stoppage that began last August  federal mediators and the company said on Saturday.",
        "date": "03212015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 1-U.S. mediators report tentative deal in Honeywell Illinois dispute "
    },
    {
        "content": "* Futures off: Dow 46 pts  S&P 5.75 pts  Nasdaq 10 pts   (Adds quote  data)",
        "date": "03042015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "US STOCKS-Wall St to open lower after ADP; services data on tap "
    },
    {
        "content": "NEW YORK  March 2 Honeywell International Inc  said on Monday it has teamed up with satellite internet startup OneWeb Ltd to expand the high-speed data services it offers to aircraft.",
        "date": "03022015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell  OneWeb partner to offer satellite internet to aircraft "
    },
    {
        "content": "NEW YORK  March 4 U.S. stock index futures declined on Wednesday  putting the S&P 500 on track for a second straight decline  ahead of data on the labor market and services sector.",
        "date": "03042015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "US STOCKS-Futures lower ahead of ADP employment  services data "
    },
    {
        "content": "Honeywell International Inc  reported a slightly better-than-expected quarterly profit  as an improving U.S. economy helped boost sales at the company's division that makes sensors  safety systems and air conditioning equipment.",
        "date": "01232015",
        "name": "Honeywell International Inc",
        "news_type": "topStory",
        "symbol": "HON",
        "title": "Honeywell draws strength from U.S. demand "
    },
    {
        "content": "* Shares rise as much as 4.6 pct   (Adds CFO comment  background; Updates share move)",
        "date": "01232015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 3-Honeywell draws strength from US demand "
    },
    {
        "content": "Jan 23 General Electric Co reported a 9 percent rise in quarterly industrial profit on Friday as its businesses that sell power-generating turbines and jet engines helped offset weak sales in its oil and gas unit.",
        "date": "01232015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "UPDATE 3-GE industrial profit rises despite flagging oil unit sales "
    },
    {
        "content": "Jan 23 Honeywell International Inc  a maker of cockpit electronics and climate control systems  reported a 1 percent rise in quarterly profit mainly due to a lower tax bill.",
        "date": "01232015",
        "name": "Honeywell International Inc",
        "news_type": "normal",
        "symbol": "HON",
        "title": "Honeywell's profit rises due to lower tax bill "
    }
]