[
    {
        "content": "* Greenlight Capital Inc dissolves share stake in Alcoa Corp - SEC filing",
        "date": "11142017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Greenlight Capital dissolves stake in Alcoa  raises in Hewlett Packard Enterprise "
    },
    {
        "content": "NEW YORK  Nov 13 An information technology services company formed this year from a merger involving Hewlett Packard Enterprise Co on Monday announced plans to establish a digital services center in New Orleans  bringing 2 000 new jobs to the city.",
        "date": "11132017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "IT services company says New Orleans project will create 2 000 direct jobs "
    },
    {
        "content": "* Hewlett Packard Enterprise introduces blockchain as-a-service solution for enterprises",
        "date": "11102017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise introduces blockchain as-a-service product "
    },
    {
        "content": "* Cuts sole share stake in Pandora Media by 19.2 percent to 16.3 million shares",
        "date": "11142017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Jana Partners dissolves sole share stake in Altice USA  Blue Apron  HPE "
    },
    {
        "content": "* Third Point LLC dissolves Class A share stake in Charter Communications Inc - SEC filing",
        "date": "11092017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Third Point takes share stake in Macerich  dissolves share stake in Humana "
    },
    {
        "content": "* Company will move corporate headquarters to Santa Clara  California from current Palo Alto location by end of 2018​",
        "date": "11022017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise to move corporate HQ to Santa Clara by 2018​-end "
    },
    {
        "content": "* Hewlett Packard Enterprise increases regular dividend by approximately 15 pct",
        "date": "11092017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise increases regular dividend by approximately 15 pct "
    },
    {
        "content": "WASHINGTON/MOSCOW Hewlett Packard Enterprise  allowed a Russian defense agency to review the inner workings of cyber defense software used by the Pentagon to guard its computer networks  according to Russian regulatory records and interviews with people with direct knowledge of the issue. | Video ",
        "date": "10022017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "Special Report: HP Enterprise let Russia scrutinize cyberdefense system used by Pentagon "
    },
    {
        "content": "WASHINGTON/MOSCOW  Oct 2 Hewlett Packard Enterprise allowed a Russian defense agency to review the inner workings of cyber defense software used by the Pentagon to guard its computer networks  according to Russian regulatory records and interviews with people with direct knowledge of the issue.",
        "date": "10022017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "SPECIAL REPORT-HP Enterprise let Russia scrutinize cyberdefense system used by Pentagon "
    },
    {
        "content": "Hewlett Packard Enterprise Co is planning to cut at least 5 000 workers as part of a broader effort to reduce costs amid mounting competition  Bloomberg reported on Thursday  citing people familiar with the matter.",
        "date": "09212017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "HPE plans 5 000 job cuts: Bloomberg "
    },
    {
        "content": "Sept 21 Hewlett Packard Enterprise Co is planning to cut at least 5 000 workers as part of a broader effort to reduce costs amid mounting competition  Bloomberg reported on Thursday  citing people familiar with the matter.",
        "date": "09212017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "HPE plans 5 000 job cuts -Bloomberg "
    },
    {
        "content": "* Hewlett Packard Enterprise plans about 5 000 job cuts - Bloomberg",
        "date": "09212017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise plans about 5 000 job cuts - Bloomberg "
    },
    {
        "content": "* Wipro and Hewlett Packard Enterprise to deliver enterprise hybrid cloud solution based on HPE proliant for Microsoft azure stack",
        "date": "09152017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Wipro & Hewlett Packard Enterprise to deliver enterprise hybrid cloud solution "
    },
    {
        "content": "* GE signs $25 million partner agreement with Hewlett Packard Enterprise for digital solutions across Middle East  Africa & Turkey​",
        "date": "09132017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-GE partners with HPE for digital solutions across Middle East  Africa and Turkey​ "
    },
    {
        "content": "* Hewlett Packard Enterprise company announces pricing of senior notes",
        "date": "09122017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise company announces pricing of senior notes "
    },
    {
        "content": "* Dropbox says adds Hewlett Packard Enterprise's President and Chief Executive Officer Meg Whitman to its board Source text (http://bit.ly/2eR70NJ) Further company coverage:",
        "date": "09112017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Dropbox adds Hewlett Packard Enterprise's CEO Whitman to its board - blog "
    },
    {
        "content": "* Hewlett Packard Enterprise CEO Meg Whitman on CNBC says \"I have no plans to leave HPE\"",
        "date": "09062017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard CEO Whitman on CNBC says \"I have no plans to leave HPE\" "
    },
    {
        "content": "* Hewlett Packard Enterprise company announces offering of senior notes",
        "date": "09112017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise Co announces offering of senior notes "
    },
    {
        "content": "Hewlett Packard Enterprise Co reported a surprise rise in quarterly revenue  largely helped by higher sales of its networking equipment  sending its shares up more than 4 percent in extended trading on Tuesday.",
        "date": "09052017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "HP Enterprise posts surprise revenue rise on networking demand "
    },
    {
        "content": "* Intel decision could affect cases against Qualcomm and Google",
        "date": "09042017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Landmark Intel judgment critical for other EU antitrust cases "
    },
    {
        "content": "Sept 5 Hewlett Packard Enterprise Co reported a surprise rise in quarterly revenue  largely helped by higher sales of its networking equipment  sending its shares up more than 4 percent in extended trading on Tuesday.",
        "date": "09052017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "UPDATE 2-HP Enterprise posts surprise revenue rise on networking demand "
    },
    {
        "content": "SAN FRANCISCO  Sept 1 Hewlett Packard Enterprise Co completed the spin-off of much of its software business early on Friday  closing the door on the disastrous 2011 acquisition of British firm Autonomy and narrowing the company's focus to data center hardware and software.",
        "date": "09012017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Hewlett Packard Enterprise to complete software spin-off "
    },
    {
        "content": "Sept 5 Hewlett Packard Enterprise Co reported a 2.5 percent rise in quarterly revenue on Tuesday  helped by strong growth in the company's enterprises and financial services businesses.",
        "date": "09052017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "HP Enterprise's quarterly revenue rises 2.5 pct "
    },
    {
        "content": "* Q3 non-GAAP earnings per share $0.31 from continuing operations",
        "date": "09052017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise reports Q3 non-GAAP earnings per share of $0.30 "
    },
    {
        "content": "* Hewlett Packard announces intent to acquire Cloud Technology Partners  a born-in-the-cloud services company with enterprise experience and DNA Source text: http://bit.ly/2vI06Ff",
        "date": "09052017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-HPE announces intent to acquire Cloud Technology Partners "
    },
    {
        "content": "* Dissolves share stake in Hewlett Packard Enterprise - SEC Filing",
        "date": "08142017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Hewlett Packard Enterprise "
    },
    {
        "content": "* Greenlight Capital Inc takes share stake of 4.5 million shares in Hewlett Packard Enterprise - SEC Filing",
        "date": "08142017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Greenlight Capital takes share stake of 4.5 mln shares in Hewlett Packard Enterprise "
    },
    {
        "content": "* HPE announces details for expected completion of spin-off and merger of its software business",
        "date": "08042017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-HPE announces details for expected completion of spin-off and merger of its software business "
    },
    {
        "content": "* Hewlett Packard Enterprise CEO says \"Uber's CEO will not be Meg Whitman\"  fully committed to HPE and plan to remain the company's ceo- tweet",
        "date": "07282017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "REFILE-BRIEF-Hewlett Packard Enterprise CEO Meg Whitman says she will not be Uber's CEO -tweet "
    },
    {
        "content": "* Says Wipro and Hewlett Packard Enterprise partner to offer consumption-based IT infrastructure solutions",
        "date": "07252017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Wipro  Hewlett Packard Enterprise partner to offer consumption-based IT infra solutions "
    },
    {
        "content": "* Sets regular cash dividend of $0.065per share Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise sets regular cash dividend of $0.065per share "
    },
    {
        "content": "HONG KONG Blackstone Group LP is seeking to raise up to $3 billion in its first Pan-Asia buyout fund for investments in sectors including high-end manufacturing and healthcare  people familiar with the plan told Reuters.",
        "date": "07202017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Blackstone raising at least $3 billion in first Asia PE fund: sources "
    },
    {
        "content": "* Fund size not finalised  could be bigger than $3 bln-source",
        "date": "07202017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "UPDATE 1-Blackstone raising at least $3 bln in first Asia PE fund-sources "
    },
    {
        "content": "* Fund size not finalised  could be bigger than $3 bln-source",
        "date": "07202017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Blackstone raising at least $3 bln in first Asia PE fund "
    },
    {
        "content": "* Hewlett packard enterprise- co wipro limited announced new global go-to-market agreement to provide joint customers with on-premises it infrastructure Source text for Eikon: Further company coverage:",
        "date": "06292017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise  Wipro to deliver consumption based IT for customers "
    },
    {
        "content": "* Hewlett Packard Enterprise announces promotion of Antonio Neri to president Source text for Eikon: Further company coverage:",
        "date": "06212017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise promotes Antonio Neri as president "
    },
    {
        "content": "* Says awarded research grant from U.S. Department of Energy to develop a reference design for an exascale supercomputer Source text for Eikon: Further company coverage:",
        "date": "06152017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-HPE says awarded research grant from U.S. Department of Energy "
    },
    {
        "content": "* CONCURRENT COMPUTER SAYS HEWLETT PACKARD ENTERPRISE AND CO HAVE SIGNED AN OEM AGREEMENT TO PROVIDE CUSTOMERS WITH A COMBINED STORAGE SOLUTION Source text for Eikon: Further company coverage:",
        "date": "06132017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-CONCURRENT SIGNS OEM AGREEMENT WITH HEWLETT PACKARD ENTERPRISE "
    },
    {
        "content": "* Tyson Foods names Hewlett Packard Enterprise executive as Chief Technology Officer‍",
        "date": "06122017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Tyson Foods names Hewlett Packard Enterprise executive as Chief Technology Officer "
    },
    {
        "content": "* Hewlett Packard Enterprise says as of april 30  co now expects up to about 12 200 employees to exit the company by the end of 2018 - sec filing‍​ ‍​",
        "date": "06082017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise says expects up to about 12 200 employees to exit co by end of 2018‍​ "
    },
    {
        "content": "Hewlett Packard Enterprise Co  on Wednesday reported a steep fall in revenue from its biggest business that sells servers  networking and data storage equipment to companies  hurt by tepid demand and a strong dollar.",
        "date": "05312017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "HPE posts steep revenue decline in key servers business "
    },
    {
        "content": "May 31 Hewlett Packard Enterprise Co on Wednesday reported a steep fall in revenue from its biggest business that sells servers  networking and data storage equipment to companies  hurt by tepid demand and a strong dollar.",
        "date": "05312017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "UPDATE 2-HPE posts steep revenue decline in key servers business "
    },
    {
        "content": "* Q2 non-GAAP earnings per share $0.25 from continuing operations",
        "date": "05312017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-HPE reports Q2 loss per share of $0.37 "
    },
    {
        "content": "* ‍All of resolutions proposed at meeting were duly passed on a poll vote​",
        "date": "05262017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Micro Focus investors back deal to buy HPE software business "
    },
    {
        "content": "May 31 Hewlett Packard Enterprise Co on Wednesday reported a quarterly loss  compared to a profit a year earlier  hurt by tax valuation allowances related to the recent sale of a business unit  as well as intense competition and a strong dollar.",
        "date": "05312017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Hewlett Packard Enterprise posts loss in 2nd qtr vs year-ago profit "
    },
    {
        "content": "* Paulson & Co Inc dissolves share stake in Activision Blizzard Inc - sec filing",
        "date": "05152017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Paulson & Co Inc dissolves share stake in Activision Blizzard  Hewlett Packard Enterprise "
    },
    {
        "content": "* Soros Fund Management takes share stake of 233 500 shares in Activision Blizzard Inc",
        "date": "05152017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Soros Fund Management ups share stake in Facebook  Hewlett Packard Enterprise "
    },
    {
        "content": "LONDON Shares in British tech firm Micro Focus plunged on Tuesday after revenues at Hewlett-Packard Enterprise's software business  which it is buying  fell in the last quarter.",
        "date": "05092017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "Micro Focus shares hit by weak update at software business it is buying "
    },
    {
        "content": "* Micro Focus down after buyout target's weak update (Adds quote and details  updates prices)",
        "date": "05092017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Earnings  resources stocks help European shares hold at 21-month highs "
    },
    {
        "content": "* Centrica  SSE dip as investors eye Conservative campaign vow",
        "date": "05092017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Britain's FTSE at one-month high  Tory energy pledge hits Centrica  SSE "
    },
    {
        "content": "LONDON  May 9 Shares in British tech firm Micro Focus plunged on Tuesday after revenues at Hewlett-Packard Enterprise's software business  which it is buying  fell in the last quarter.",
        "date": "05092017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "UPDATE 1-Micro Focus shares hit by weak update at software business it is buying "
    },
    {
        "content": "LONDON  May 9 A raft of well-received updates and a recovery in resources stocks helped European shares rebound early on Tuesday from the previous session's slight losses  although shares in Micro Focus dropped.",
        "date": "05092017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "European shares hold at 21-month highs  Micro Focus slides "
    },
    {
        "content": "May 9 Britain's FTSE 100 index is seen opening 1 point higher on Tuesday  according to financial bookmakers  with futures up 0.2 percent ahead of the cash market open.",
        "date": "05092017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "UPDATE 1-UK Stocks-Factors to watch on May 9 "
    },
    {
        "content": "LONDON  May 9 Micro Focus Intl said software revenue at Hewlett-Packard Enterprise  the U.S. company it is buying  fell around 10 percent in the last quarter  which it said was disappointing but not unusual given the degree of change in the business.",
        "date": "05092017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Micro Focus Intl says HPE's software revenue fell 10 pct in last quarter "
    },
    {
        "content": "Jan 17 Hewlett Packard Enterprise Co  said on Tuesday it would buy privately held cloud software company SimpliVity for $650 million in cash  as it looks to expand in the fast-growing market for hybrid cloud platforms.",
        "date": "01172017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "HP Enterprise to buy cloud software company SimpliVity "
    },
    {
        "content": "* HPE to acquire Simplivity and expand leadership in growing hybrid it industry",
        "date": "01172017",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard to acquire Simplivity for $650 mln "
    },
    {
        "content": "LONDON Micro Focus International   the British IT firm buying Hewlett Packard Enterprise Co's  software business  said it had made good progress in its first half-year  with better-than-expected revenue and earnings growth.",
        "date": "12142016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "Micro Focus shares lifted by surprise first-half revenue rise "
    },
    {
        "content": "* Quarterly enterprise group revenue was $6.7 billion  down 9% year over year",
        "date": "11222016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise reports Q4 earnings per share $0.18 "
    },
    {
        "content": "BRUSSELS  Nov 22 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "11222016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "EU mergers and takeovers (Nov 22) "
    },
    {
        "content": "* Offer to exchange outstanding unregistered notes that it issued in October 2015   as amended  for new registered notes",
        "date": "11232016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise initiates exchange offer "
    },
    {
        "content": "BRUSSELS  Nov 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "11232016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "EU mergers and takeovers (Nov 23) "
    },
    {
        "content": "The former chief financial officer of British software company Autonomy has been indicted on U.S. charges of engaging in a fraudulent scheme to deceive investors and Hewlett Packard  about his firm's performance before its sale in 2011.",
        "date": "11122016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Ex-Autonomy CFO indicted in U.S.  accused of deceiving HP "
    },
    {
        "content": "* Hewlett Packard Enterprise Co says new dividend is an increase of $0.01 per share from prior dividend  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise increases regular dividend "
    },
    {
        "content": "* Hewlett Packard Enterprise - Enterprise Services Business will help National Electric Vehicle Sweden (NEVS) accelerate setup of global electric vehicle production",
        "date": "10192016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-HPE partners with National Electric Vehicle Sweden to accelerate global electric car production "
    },
    {
        "content": "* New partnership merges Samsung's carrier network and HPE's IT telecommunications expertise  Source text for Eikon:  Further company coverage:",
        "date": "09282016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Samsung and Hewlett Packard announced a partnership "
    },
    {
        "content": "* Fitch affirms Hewlett Packard Enterprise Co. at 'A-/F2' on software spin-off; outlook stable  Source text for Eikon:  Further company coverage:",
        "date": "09132016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Fitch affirms Hewlett Packard Enterprise Co at 'A-/F2' with stable outlook "
    },
    {
        "content": "LONDON  Sept 13 Britain's shock vote to leave the European Union chilled dealmaking activity involving British companies to the lowest level in at least two decades as bosses grapple with what Brexit will cost  Thomson Reuters data shows.",
        "date": "09132016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "RPT-INSIGHT-Brexit chills M&A activity despite some big deals  data shows "
    },
    {
        "content": "LONDON  Sept 12 Britain's shock vote to leave the European Union chilled dealmaking activity involving British companies to the lowest level in at least two decades as bosses grapple with what Brexit will cost  Thomson Reuters data shows.",
        "date": "09122016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "INSIGHT-Brexit chills M&A activity despite some big deals  data shows "
    },
    {
        "content": "* Micro Focus surges after Hewlett Packard deal   (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon  see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "09082016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "European shares drop as ECB's Draghi cools stimulus talk "
    },
    {
        "content": "* Accelerates strategy with spin-off and merger of non-core software assets with Micro Focus",
        "date": "09072016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-HPE to spin-off  merge non-core software assets with Micro Focus "
    },
    {
        "content": "Sept 8 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Thursday:",
        "date": "09082016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Q3 earnings per share view $0.45 -- Thomson Reuters I/B/E/S",
        "date": "09072016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-HPE Q3 non-GAAP earnings per share $0.49 "
    },
    {
        "content": "LONDON  Sept 8 European stock markets gained ground on Thursday  leaving a leading index near eight-month highs  with software company Micro Focus surging after a deal with Hewlett Packard Enterprise.",
        "date": "09082016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "European shares near eight-month highs as Micro Focus surges "
    },
    {
        "content": "Sept 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "09072016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Sept 7 Hewlett Packard Enterprise Co (HPE)  is nearing a deal to sell its software division to British software group Micro Focus International Plc  according to a person familiar with the matter on Wednesday  as the company focuses on networking  storage and data centers.",
        "date": "09072016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "HP Enterprise nears deal to sell software division -source "
    },
    {
        "content": "Sept 8 Britain's FTSE 100 index is seen opening down 3 to 5 points on Thursday  according to financial bookmakers  with futures  trading up 0.2 percent ahead of the cash market open.",
        "date": "09082016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "UPDATE 3-UK Stocks-Factors to watch on Sept. 8 "
    },
    {
        "content": "Sept 8 Britain's FTSE 100 index is seen opening down 3 to 5 points on Thursday  according to financial bookmakers.          * The UK blue chip index closed 0.3 percent higher on Wednesday at 6 846.58   supported by stronger precious metals and oil company shares as well as by gains at equipment rentals company Ashtead.      * MICRO FOCUS: Hewlett Packard Enterprise Co will spin off and merge its non-core software assets with Britain's Micro Focus International Plc  in a deal worth $8",
        "date": "09082016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "UK Stocks-Factors to watch on Sept. 8 "
    },
    {
        "content": "Sept 8 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "09082016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "PRESS DIGEST- Financial Times - Sept 8 "
    },
    {
        "content": "Hewlett Packard Enterprise Co (HPE) is in talks with buyout firm Thoma Bravo LLC to sell its software division  hoping it can fetch between $8 billion and $10 billion  according to people familiar with the matter.",
        "date": "09012016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "HP Enterprise in talks to sell software unit to Thoma Bravo -sources "
    },
    {
        "content": "Hewlett Packard Enterprise Co (HPE)  is in talks with buyout firm Thoma Bravo LLC to sell its software division  hoping it can fetch between $8 billion and $10 billion  according to people familiar with the matter.",
        "date": "09012016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Exclusive: HP Enterprise in talks to sell software unit to Thoma Bravo - sources "
    },
    {
        "content": "Sept 1 Hewlett Packard Enterprise Co (HPE)  is in talks with buyout firm Thoma Bravo LLC to sell its software division  hoping it can fetch between $8 billion and $10 billion  according to people familiar with the matter.",
        "date": "09012016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "EXCLUSIVE-HP Enterprise in talks to sell software unit to Thoma Bravo -sources "
    },
    {
        "content": "* Hewlett Packard Enterprise completes sale of its equity stake in Mphasis Limited",
        "date": "09012016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise completes sale of its equity stake in Mphasis Limited "
    },
    {
        "content": "Sept 1 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "09012016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* fitch: Hewlett Packard Enterprise's ratings unaffected by acquisition of SGI  Source text for Eikon:",
        "date": "08122016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Fitch: Hewlett Packard Enterprise's ratings unaffected by acquisition of SGI "
    },
    {
        "content": "* Hewlett Packard Enterprise to acquire SGI to extend leadership in high growth big data analytics and high performance computing",
        "date": "08112016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise to acquire SGI for about $275 mln "
    },
    {
        "content": "* Hewlett Packard Enterprise board has declared a regular cash dividend of $0.055 per share on company's common stock.  Source text for Eikon:  Further company coverage:",
        "date": "07282016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard declares a regular dividend "
    },
    {
        "content": "Buyout firms are focused on acquiring some software assets that Hewlett Packard Enterprise Co (HPE)  has been considering divesting  worth between $6 billion and $8 billion  rather than the entire company  people familiar with the matter said on Friday.",
        "date": "07292016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "Private equity firms focused on Hewlett Packard asset sales: sources "
    },
    {
        "content": "July 29 Buyout firms are focused on acquiring some software assets that Hewlett Packard Enterprise Co (HPE)  has been considering divesting  worth between $6 billion and $8 billion  rather than the entire company  people familiar with the matter said on Friday.",
        "date": "07292016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Private equity firms focused on Hewlett Packard asset sales -sources "
    },
    {
        "content": "* Several private equity firms are \"sniffing around\" Hewlett Packard Enterprise Co  contemplating a buyout - CNBC  citing TheInformation   Further company coverage:",
        "date": "07292016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Several private equity firms contemplating buyout of Hewlett Packard Enterprise - CNBC "
    },
    {
        "content": "* Datagroup takes over SAP and application management services from Hewlett Packard Enterprise (HPE) in Germany",
        "date": "07142016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Datagroup takes over SAP and application management services from Hewlett Packard Enterprise in Germany "
    },
    {
        "content": "* Hewlett Packard Enterprise said to mull selling software assets- Bloomberg  citing sources",
        "date": "07082016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise said to mull selling software assets- Bloomberg "
    },
    {
        "content": "June 11 Hewlett Packard Enterprise Co  chief executive and Republican donor Meg Whitman reiterated her opposition to Donald Trump as the party's presidential nominee and compared him to fascist leaders Adolf Hitler and Benito Mussolini  according to media and two sources.",
        "date": "06112016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "HP CEO Whitman compares Trump to Hitler  Mussolini "
    },
    {
        "content": "* GE and Hewlett Packard Enterprise partner to deliver new industrial IoT solutions",
        "date": "06082016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-GE  HPE partner to deliver new industrial IoT solutions "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 26 (Fitch) Fitch Ratings has affirmed the ratings for Computer  Sciences Corporation (CSC)  including the 'BBB' Long-Term Issuer Default Ratings  (IDR)  on its plan to merge with Hewlett Packard Enterprise's (HPE) information  technology (IT) services segment  Enterprise Services (ES). Fitch's actions  affect $5.1 billion of total debt  including the undrawn $2.5 billion revolving  credit facility (RCF). The Rating Outlook ",
        "date": "05262016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "Fitch Affirms Computer Sciences' Rating on Merger with HPE's Enterprise Services; Outlook Stable "
    },
    {
        "content": "Hewlett Packard Enterprise Co said it would spin off and merge its struggling IT services business with Computer Sciences Corp  allowing the company to focus on its cloud services business and other fast-growing units.",
        "date": "05252016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "HP Enterprise to merge IT services unit with Computer Sciences "
    },
    {
        "content": "May 24 Hewlett Packard Enterprise Co  said it would spin off and merge its struggling IT services business with Computer Sciences Corp  allowing the company to focus on its cloud services business and other fast-growing units.",
        "date": "05242016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "UPDATE 3-HP Enterprise to merge IT services unit with Computer Sciences "
    },
    {
        "content": "May 25 HP Inc  which houses the former Hewlett-Packard Co's legacy hardware business  reported a better-than-expected quarterly profit as aggressive cost cutting helped counter weak demand for personal computers and printers.",
        "date": "05252016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "UPDATE 2-HP Inc profit beats Street amid weak market for PCs  printers "
    },
    {
        "content": "* Hewlett Packard Enterprise Co says \"Equity stake in the new company of $4.5 bln or a 50 pct stake\" - CEO MEG WHITMAN on CSC merger",
        "date": "05242016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-HPE says \"Deal is expected to be completed by March 2017\" - CEO Meg Whitman on CSC merger "
    },
    {
        "content": "May 25 HP Inc  which houses the former Hewlett-Packard Co's legacy hardware business  reported an about 11 percent drop in quarterly revenue as it struggles with weak demand for personal computers and printers.",
        "date": "05252016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "HP Inc's revenue falls about 11 pct on weak PC  printer sales "
    },
    {
        "content": "* Hewlett Packard Enterprise Co. 'BBB' rating affirmed on planned Enterprise Services business divestiture; outlook stable  Source text - http://bit.ly/247pJoy Further company coverage:",
        "date": "05252016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-S&P affirms Hewlett Packard Enterprise's 'BBB' rating "
    },
    {
        "content": "* Board authorized additional $3 billion for share repurchases",
        "date": "05242016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise posts Q2 non-gaap EPS of $0.42 "
    },
    {
        "content": "* Transaction will deliver HPE shareholders approximately $8.5 billion in expected after-tax value in stock-for-stock exchange",
        "date": "05242016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-HP Enterprise to merge enterprise unit with Computer Sciences "
    },
    {
        "content": "May 24 Hewlett Packard Enterprise Co  said on Tuesday it plans to spin off and merge its enterprise services business with Computer Sciences Corp.",
        "date": "05242016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "HP Enterprise to merge enterprise unit with Computer Sciences Corp "
    },
    {
        "content": "* CSC announces merger with enterprise services segment of Hewlett Packard Enterprise to create global IT services leader",
        "date": "05242016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Computer Sciences agrees to merger with Enterprise Services segment of Hewlett Packard Enterprise "
    },
    {
        "content": "WASHINGTON  April 21 The Pentagon has awarded HP Enterprise Services  a unit of Hewlett Packard Enterprise Co   a $443 million contract for technology services and infrastructure for the U.S. Strategic Command  the U.S. Defense Department said on Thursday.   (Reporting by Eric Beech; Editing by Eric Walsh)",
        "date": "04212016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Pentagon awards HP Enterprise $443 mln technology contract "
    },
    {
        "content": "* Sale of equity position in mphasis not expected to impact hpe enterprise services' ability to achieve fy16 operating margin outlook of 6-7%",
        "date": "04042016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise - Sale of equity position in Mphasis not expected to impact FY16 operating margin outlook of 6-7 pct "
    },
    {
        "content": "MUMBAI  April 4 Blackstone Group LP has agreed to buy a majority stake in Indian IT outsourcing services provider Mphasis Ltd from Hewlett Packard Enterprise Co  in a deal that will cost up to $1.1 billion.",
        "date": "04042016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Blackstone to buy majority of India's Mphasis in up to $1.1 bln deal "
    },
    {
        "content": "* Hewlett Packard Enterprise to divest its equity stake in Mphasis to Blackstone",
        "date": "04042016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-HPE to sell its stake in Mphasis to Blackstone for $825 mln "
    },
    {
        "content": "* Tsinghua's unit got approval from Chinese securities regulatory commission to move ahead with partnership with co in China",
        "date": "03232016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise says Tsinghua's unit got approval from Chinese securities regulatory commission "
    },
    {
        "content": "* Declared a regular cash dividend of $0.055 per share on company's common stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "03242016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-Hewlett Packard Enterprise declares regular cash dividend of $0.055/shr on common stock "
    },
    {
        "content": "* Closed $73.5 million in a series C funding round led by Hewlett Packard Enterprise  with Microsoft joining as a new strategic investor",
        "date": "03242016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "BRIEF-Mesosphere raises $73.5 million in series C funding "
    },
    {
        "content": "MUMBAI  March 17 Blackstone Group LP is nearing a deal to acquire Hewlett Packard Enterprise's (HPE)  controlling stake worth about $940 million in Indian IT outsourcing services provider MphasiS Ltd  according to three sources directly involved in the deal.",
        "date": "03172016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "CORRECTED-UPDATE 1-Blackstone nears deal to buy HP Enterprise stake in India's MphasiS - sources "
    },
    {
        "content": "Hewlett Packard Enterprise Co  which houses former Hewlett-Packard Co's corporate hardware and services division  reported better-than-expected quarterly revenue and profit  helped by strength in its hardware business.",
        "date": "03042016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "HP Enterprise's revenue  profit beat estimates "
    },
    {
        "content": "March 3 Hewlett Packard Enterprise Co  which houses former Hewlett-Packard Co's corporate hardware and services division  reported better-than-expected quarterly revenue and profit  helped by strength in its hardware business.",
        "date": "03032016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "UPDATE 1-HP Enterprise's revenue  profit beat estimates "
    },
    {
        "content": "NEW YORK Meg Whitman  the head of technology firm Hewlett Packard Enterprise Co   said on Sunday that Donald Trump was \"unfit\" for the U.S. presidency  and criticized New Jersey Governor Chris Christie  whose failed presidential bid she supported  for endorsing him.",
        "date": "02282016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Tech CEO Whitman calls Trump 'unfit' to be U.S. president "
    },
    {
        "content": "March 3 Hewlett Packard Enterprise Co  which houses former Hewlett-Packard Co's corporate hardware and services division  reported a 2.5 percent fall in quarterly revenue  largely due to weakness in its enterprise services business.",
        "date": "03032016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "HP Enterprise revenue falls 2.5 pct on weak services business "
    },
    {
        "content": "NEW YORK  Feb 28 Meg Whitman  the head of technology firm Hewlett Packard Enterprise Co said that Donald Trump was \"unfit\" for the U.S. presidency on Sunday  NBC reported  and criticized New Jersey Governor Chris Christie  whose failed presidential bid she supported  for endorsing Trump.",
        "date": "02282016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "CORRECTED-HP's CEO calls Trump \"unfit\" to be U.S. president "
    },
    {
        "content": "* \u007fCooperates with Hewlett Packard Enterprise in the field of Digital Banking",
        "date": "01252016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "topStory",
        "symbol": "HPE",
        "title": "BRIEF-CREALOGIX cooperates with Hewlett Packard Enterprise\u007f "
    },
    {
        "content": "Jan 7 Beauty products maker Avon Products Inc  said it would cut some global IT jobs after hiring Hewlett Packard Enterprise Co to run some of its technology operations.",
        "date": "01072016",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Avon to reduce global IT headcount "
    },
    {
        "content": "* HP Inc sees 1st-qtr adj EPS $0.33-$0.38/shr vs est $0.42/shr",
        "date": "11242015",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "UPDATE 3-HP Inc profit forecast misses Street on weak PC  printer sales "
    },
    {
        "content": "Nov 24 Hewlett-Packard Co  the tech pioneer that split into two separate companies this month  reported a fall in revenue for the fifth straight quarter  hurt by lower PC sales and a slump in demand from businesses.",
        "date": "11242015",
        "name": "Hewlett Packard Enterprise Company",
        "news_type": "normal",
        "symbol": "HPE",
        "title": "Hewlett-Packard revenue falls in last report before split "
    }
]