[
    {
        "content": "* Sets cash dividend of $0.1393per share Source text for Eikon: Further company coverage:",
        "date": "11142017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc board declares dividend "
    },
    {
        "content": "** Worldwide Q3 PC shipments fell 3.6 pct YoY  the 12th consecutive quarter of decline  according to preliminary estimates from research firm Gartner Inc",
        "date": "10112017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BUZZ-Global PC shipments slip for 12th straight quarter - Gartner "
    },
    {
        "content": "BEIJING China said on Thursday it has approved HP Inc's  $1.1 billion purchase of Samsung Electronics'  printer business with certain restrictions  citing concerns about the U.S. firm's dominance of the domestic laser printer market.",
        "date": "10062017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "China approves HP's $1.1 billion buy of Samsung's printer business with curbs "
    },
    {
        "content": "BEIJING  Oct 6 China said on Thursday it has approved HP Inc's $1.1 billion purchase of Samsung Electronics' printer business with certain restrictions  citing concerns about the U.S. firm's dominance of the domestic laser printer market.",
        "date": "10062017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "China approves HP's $1.1 bln buy of Samsung's printer business with curbs "
    },
    {
        "content": "* EXTENDS RELATIONSHIP WITH HP INDIGO INTO LABELS AND PACKAGING PRESSES‍​ Source text: http://bit.ly/2xFgc2g Further company coverage: (Gdynia Newsroom)",
        "date": "09252017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Global Graphics extends relationship with HP Indigo "
    },
    {
        "content": "* SIGNS ORDER WITH HP PPS SVERIGE WITH VALUE AT SEK 220 000 ‍​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "09202017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Papilly signs order with HP PPS Sverige ‍​ "
    },
    {
        "content": "* Pitney Bowes extends global strategic alliance with HP Source text for Eikon: Further company coverage:",
        "date": "09112017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Pitney Bowes extends global alliance with HP "
    },
    {
        "content": "LUXEMBOURG  Sept 6 Europe's top court on Wednesday told a lower court to re-examine U.S. chipmaker Intel's appeal against a 1.06-billion-euro ($1.3 billion) EU antitrust fine.",
        "date": "09062017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "EU's top court refers Intel antitrust case back to lower court "
    },
    {
        "content": "HP Inc   which houses the hardware business of former Hewlett-Packard Co  reported a slightly higher-than-expected quarterly profit as it sold more personal computers.",
        "date": "08232017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Inc's quarterly profit beats on higher PC sales "
    },
    {
        "content": "Aug 23 HP Inc  which houses the hardware business of former Hewlett-Packard Co  reported a slightly higher-than-expected quarterly profit as it sold more personal computers.",
        "date": "08232017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-HP Inc's quarterly profit beats on higher PC sales "
    },
    {
        "content": "* HP and Deloitte announce alliance to accelerate digital transformation of US$12 trillion global manufacturing industry Source text for Eikon: Further company coverage:",
        "date": "08242017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-HP and Deloitte to collaborate to digitally transform US$12 trillion global manufacturing industry "
    },
    {
        "content": "Aug 23 HP Inc  which houses the hardware business of former Hewlett-Packard Co  reported a fourth straight rise in quarterly revenue  helped by higher demand for its personal computers.",
        "date": "08232017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc posts fourth straight rise in quarterly revenue "
    },
    {
        "content": "* HP Inc - HP Indigo named a Shutterfly preferred digital press provider",
        "date": "08162017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-HP Indigo named a Shutterfly preferred digital press provider "
    },
    {
        "content": "* Meg Whitman steps off HP Inc. board of directors; company appoints Chip Bergh as new board chairman",
        "date": "07262017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Meg Whitman steps off HP board  Chip Bergh appointed new chair "
    },
    {
        "content": "* Board of directors has declared a cash dividend of $0.1327 per share on company's common stock Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-HP says board has declared a cash dividend of $0.1327 per share on company's common stock "
    },
    {
        "content": "* Says Cyberinc signs partnership with Hewlett Packard Enterprise Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-Aurionpro Solutions says Cyberinc signs partnership with Hewlett Packard Enterprise "
    },
    {
        "content": "SHANGHAI Lenovo Group Ltd's personal computer (PC) business will return to positive growth in its fiscal 2017/18 year  the firm's chief executive Yang Yuanqing told Reuters on Thursday  after a drop in shipments last year.",
        "date": "07202017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Lenovo's PC business to return to positive growth this year: CEO "
    },
    {
        "content": "BRUSSELS  June 30 Europe's top court will rule on Sept. 6 whether to uphold Intel's appeal against a 1.06-billion-euro ($1.2 billion) EU antitrust fine  a case with ramifications for Google's challenge against a record sanction handed out this week.",
        "date": "06302017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Top EU court to rule on Intel antitrust case on Sept. 6 "
    },
    {
        "content": "PARIS  June 26 Europe's top court is likely to rule on Intel's appeal against a record 1.06 billion euro ($1.19 billion) EU antitrust fine next year  an EU judge said on Monday  a case that may affect companies such as Google and Qualcomm in the EU's crosshairs.",
        "date": "06262017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "EU court seen ruling on Intel antitrust case next year - judge "
    },
    {
        "content": "* Qualcomm says AsusTek Computer Inc  Lenovo Group Ltd  HP Inc will be contract manufacturers for new mobile PCs",
        "date": "05312017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Qualcomm says new AsusTek  Lenovo  HP PCs will carry its processors "
    },
    {
        "content": "* Says infosys announces strategic alliance with HP Inc to accelerate digital transformation for enterprise Source text for Eikon: Further company coverage:",
        "date": "05252017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Infosys announces strategic alliance with HP Inc "
    },
    {
        "content": "HP Inc  reported better-than-expected results in what its chief executive termed a \"breakthrough\" quarter as both its PC and printer businesses grew for the first time since 2010.",
        "date": "05242017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Inc results beat in 'breakthrough' quarter for PC  printers "
    },
    {
        "content": "FRANKFURT  May 23 Chinese network and smartphone giant Huawei said on Tuesday it plans a global expansion into computers  posing a fresh challenge to established PC players in a market that has suffered from two years of steady sales volume declines.",
        "date": "05232017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Telecoms giant Huawei enters PC market  battling Lenovo  HP  Dell "
    },
    {
        "content": "* Shares up 3.6 pct in extended trading (Adds forecast  updates shares)",
        "date": "05242017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-HP Inc results beat in \"breakthrough\" quarter for PC  printers "
    },
    {
        "content": "May 24 HP Inc  which was created through the breakup of Hewlett-Packard Co  reported its third straight rise in quarterly revenue as it benefited from a stabilizing market for personal computers.",
        "date": "05242017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc reports third straight rise in quarterly revenue "
    },
    {
        "content": "* Q2 gaap earnings per share $0.33 from continuing operations",
        "date": "05242017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc Q2 adjusted earnings per share $0.40 "
    },
    {
        "content": "* Hp inc - board of directors has declared a cash dividend of $0.1327 per share on company's common stock Source text for Eikon: Further company coverage:",
        "date": "05182017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc declares cash dividend of $0.1327/shr "
    },
    {
        "content": "* Staples Inc names Brett Wahlin chief information security officer",
        "date": "05082017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Staples names Brett Wahlin as Chief Information Security Officer "
    },
    {
        "content": "* Approves acquisition of printer business of Samsung by HP Inc Further company coverage:",
        "date": "05092017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-India's competition regulator approves HP Inc's acquisition of Samsung's printer business "
    },
    {
        "content": "* Forms strategic partnership with HP Inc. to market its new A3 printing range Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "04262017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Also Holding forms strategic partnership with HP Inc. to market its new A3 printing range "
    },
    {
        "content": "* Hewlett packard enterprise co- on april 23 klaus kleinfeld resigned from board of hewlett packard enterprise co  effective immediately - sec filing Source text for Eikon: Further company coverage:",
        "date": "04242017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Hewlett Packard Enterprise says on April 23 Klaus Kleinfeld resigned from board   effective immediately "
    },
    {
        "content": "BRUSSELS  April 5 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04052017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "EU mergers and takeovers (April 5) "
    },
    {
        "content": "BRUSSELS  April 4 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04042017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "REFILE-EU mergers and takeovers (April 4) "
    },
    {
        "content": "BRUSSELS  March 31 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03312017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "EU mergers and takeovers (March 31) "
    },
    {
        "content": "* Syndication in relation to proposed merger with software business segment of Hewlett Packard Enterprise Source text for Eikon: Further company coverage: (London Newsroom)",
        "date": "03312017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-Micro Focus in $5.5 bln syndication of new facilities "
    },
    {
        "content": "BRUSSELS  March 29 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03292017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "EU mergers and takeovers (March 29) "
    },
    {
        "content": "* Terminated original hp agreements and entered into latest hp agreements with Hang Seng Bank",
        "date": "02282017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-AMS Public Transport terminates deals with Hang Seng Bank "
    },
    {
        "content": "Feb 23 Hewlett Packard Enterprise Co  the corporate hardware and enterprise software business of Hewlett-Packard Co  reported a 10.4 percent fall in revenue  largely due to sluggish demand for its servers and storage equipment.",
        "date": "02232017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Enterprise's revenue slips 10.4 pct "
    },
    {
        "content": "HP Inc   which houses the hardware business of former Hewlett-Packard Co  reported a 3.6 percent rise in quarterly revenue  largely helped by a stabilizing PC market.",
        "date": "02222017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Inc reports 3.6 percent rise in quarterly revenue "
    },
    {
        "content": "* Q1 GAAP earnings per share $0.36 from continuing operations",
        "date": "02222017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc Q1 non-GAAP earnings per share $0.38 "
    },
    {
        "content": "Feb 22 HP Inc  which houses the hardware business of former Hewlett-Packard Co  reported a 3.6 percent rise in quarterly revenue  largely helped by a stabilizing PC market.",
        "date": "02222017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc reports 3.6 pct rise in quarterly revenue "
    },
    {
        "content": "Buyout firm 3G Capital managed to build a consumer empire with a market value of over $140 billion in just seven years. Yet its ruthless approach to costs may end up hampering 3G-backed Kraft Heinz Co's  $143 billion bid for Unilever Plc .",
        "date": "02182017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "3G Capital's austere empire-building weighs on Kraft's Unilever bid "
    },
    {
        "content": "Feb 17 Buyout firm 3G Capital managed to build a consumer empire with a market value of over $140 billion in just seven years. Yet its ruthless approach to costs may end up hampering 3G-backed Kraft Heinz Co's $143 billion bid for Unilever Plc.",
        "date": "02182017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "RPT-3G Capital's austere empire-building weighs on Kraft's Unilever bid "
    },
    {
        "content": "* U.S. Consumer product safety commission - HP expands recall of batteries for HP and Compaq notebook computers due to fire and burn hazards",
        "date": "01242017",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-U.S. Consumer Product Safety Commission says HP expands recall of batteries for HP and Compaq notebook computers due to fire and burn hazards "
    },
    {
        "content": "* HP Inc  - Declared a cash dividend of $0.1327 per share on company's common stock.",
        "date": "01242017",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-HP declares a cash dividend of $0.1327 per share "
    },
    {
        "content": "Nov 22 HP Inc  the legacy printer and PC business of the former Hewlett-Packard Co  reported a 2 percent rise in quarterly revenue  helped by higher sales of its notebooks.",
        "date": "11222016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Inc revenue rises 2 pct "
    },
    {
        "content": "* Fiscal 2017 non-gaap diluted net earnings per share estimates exclude $0.08 per share  primarily related to items such as restructuring and other charges",
        "date": "11222016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc reports Q4 non-gaap earnings per share $0.36 "
    },
    {
        "content": "HP Inc   the legacy printer and PC business of the former Hewlett-Packard Co  forecast a current-quarter adjusted profit largely below analysts' estimates amid waning demand for its printers.",
        "date": "11232016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Inc forecasts adjusted profit largely below estimates "
    },
    {
        "content": "Nov 22 Hewlett Packard Enterprise Co  the corporate hardware and enterprise software business of Hewlett-Packard Co  forecast a current-quarter adjusted profit largely below analysts' estimates  sending its shares down 1.9 percent after the bell.",
        "date": "11232016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-HP Enterprise's profit forecast disappoints Street; shares slip "
    },
    {
        "content": "* Jana Partners LLC takes sole share stake in Yahoo Inc - sec filing",
        "date": "11142016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Jana Partners takes sole share stake in Yahoo  Twitter "
    },
    {
        "content": "The former chief financial officer of British software company Autonomy has been indicted on U.S. charges of engaging in a fraudulent scheme to deceive investors and Hewlett Packard  about his firm's performance before its sale in 2011.",
        "date": "11122016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Ex-Autonomy CFO indicted in U.S.  accused of deceiving HP "
    },
    {
        "content": "Nov 14 - The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11142016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "PRESS DIGEST- British Business - Nov 14 "
    },
    {
        "content": "Nov 11 The former chief financial officer of British software company Autonomy has been indicted on U.S. charges of engaging in a fraudulent scheme to deceive investors and Hewlett Packard about his firm's performance before its sale in 2011.",
        "date": "11122016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-Ex-Autonomy CFO indicted in U.S.  accused of deceiving HP "
    },
    {
        "content": "Nov 11 The former chief financial officer of Autonomy has been indicted on U.S. charges that he engaged in a fraudulent scheme to deceive investors and Hewlett Packard  about his software company's true performance ahead of its sale in 2011.",
        "date": "11112016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Ex-Autonomy CFO indicted in U.S.  accused of deceiving HP "
    },
    {
        "content": "* Sets cash dividend of $0.1327per share  Source text for Eikon:  Further company coverage:",
        "date": "11092016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc board declares dividend "
    },
    {
        "content": "* Strengthens collaboration with HP for production-ready 3D printing materials development  Source text - http://on.basf.com/2fcrWhj Further company coverage:    (Gdynia Newsroom)",
        "date": "11022016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-BASF strengthens collaboration with HP for production-ready 3D printing materials development "
    },
    {
        "content": "NEW YORK  Oct 26 Microsoft Corp on Wednesday unveiled its first-ever desktop computer and a free update to its Windows operating system that allows edits using 3D simulations  in hopes of reinvigorating its computing business.",
        "date": "10262016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 5-Microsoft launches first desktop  Windows update with 3D features "
    },
    {
        "content": "* Announcing update to registered exchange of its senior notes",
        "date": "10192016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Hewlett Packard delays exchange of senior notes "
    },
    {
        "content": "* Enters into license agreement with HP Inc to design  manufacture  and distribute Hewlett Packard branded action  still  dash cameras  accessories and media cloud storage  Source text for Eikon:  Further company coverage:",
        "date": "10182016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Life Clips enters into license agreement with HP Inc "
    },
    {
        "content": "HP Inc said it expects to cut about 3 000 to 4 000 jobs over the next three years  as the maker of printers and personal computers continues to struggle with a subdued market  sending its shares down 1.3 percent in extended trading.",
        "date": "10142016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Inc to cut up to 4 000 jobs over next three years "
    },
    {
        "content": "Oct 13 HP Inc said it expects to cut about 3 000 to 4 000 jobs over the next three years  as the maker of printers and personal computers continues to struggle with a subdued market  sending its shares down 1.3 percent in extended trading.",
        "date": "10142016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-HP Inc to cut up to 4 000 jobs over next three years "
    },
    {
        "content": "* Sees FY 2017 gaap earnings per share $1.47 to $1.57 from continuing operations",
        "date": "10132016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-HP announces fiscal 2017 financial outlook "
    },
    {
        "content": "Oct 13 HP Inc  the hardware business of former Hewlett-Packard Co  said it expects to cut about 3000 to 4000 jobs over the next three years.",
        "date": "10132016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "CORRECTED-HP Inc to cut 3000-4000 jobs over next three years "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 16 (Fitch) Fitch Ratings has affirmed the ratings for HP Inc.  (HP)  including the Long- and Short-Term Issuer Default Ratings (IDR) at  'BBB+/F2'  on HP's acquisition of Samsung's printer business. The Rating Outlook  is Stable. Fitch's action affects $10.8 billion of total debt  including the  undrawn $4 billion revolving credit facility (RCF). A full list of ratings  follows at the end of this release. Fitch expect",
        "date": "09162016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Fitch Affirms HP Inc.'s IDR at 'BBB+/F2' on Samsung Printer Business Acquisition "
    },
    {
        "content": "* Lee widely considered Samsung Group head after father's illness",
        "date": "09122016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "UPDATE 1-Samsung scion to take board seat at flagship unit in succession move "
    },
    {
        "content": "HP Inc said it would buy Samsung Electronics Co Ltd's printer business in a deal valued at $1.05 billion.",
        "date": "09122016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP to buy Samsung's printer business in $1.05 billion deal "
    },
    {
        "content": "Sept 12 HP Inc said it would buy Samsung Electronics Co Ltd's printer business in a deal valued at $1.05 billion.",
        "date": "09122016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP to buy Samsung's printer business in $1.05 bln deal "
    },
    {
        "content": "SEOUL  Sept 9 South Korean tech giant Samsung Electronics is considering selling its printer business to HP Inc  in a deal which could fetch about 2 trillion won ($1.82 billion)  Seoul Economic Daily reported on Friday.",
        "date": "09092016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Samsung Elec considers sale of printer business to HP -Seoul Economic Daily "
    },
    {
        "content": "* Says printing solutions company being spun off recorded 1.56 trillion won  ($1.40 billion) in revenue in 2015",
        "date": "09122016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-Samsung Elec says to spin of printer business "
    },
    {
        "content": "* HP Inc accelerates disruption of $55 billion copier segment with acquisition of Samsung Electronics Co  Ltd's printer business",
        "date": "09122016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc agrees to buy Samsung Electronics's printer business "
    },
    {
        "content": "* UK tech company Micro Focus will buy Hewlett Packard's software unit in a deal worth around £7 bln - Sky News  citing sources",
        "date": "09072016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Micro Focus will buy Hewlett Packard's software unit in deal worth around £7 bln - Sky News "
    },
    {
        "content": "* Proposed return of value to existing Micro Focus shareholders",
        "date": "09082016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Micro Focus to return $400 mln to shareholders before HP deal concludes "
    },
    {
        "content": "* Micro Focus surges after Hewlett Packard deal   (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon  see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "09082016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "European shares drop as ECB's Draghi cools stimulus talk "
    },
    {
        "content": "* Has been selected by HP to cool its new Omen X Desktop Gaming PC which marks HP's return to ultra-high end gaming systems  Source text for Eikon:",
        "date": "08262016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Asetek selected by HP to cool New Omen X Desktop Gaming PC "
    },
    {
        "content": "HP Inc   the hardware business of the former Hewlett-Packard Co  reported higher-than-expected quarterly revenue and profit as demand recovered for its notebooks.",
        "date": "08242016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Inc beats estimates  weak printer demand weighs on forecast "
    },
    {
        "content": "Aug 24 HP Inc  the hardware business of the former Hewlett-Packard Co  reported higher-than-expected quarterly revenue and profit as demand recovered for its notebooks.",
        "date": "08242016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-HP Inc beats estimates  weak printer demand weighs on forecast "
    },
    {
        "content": "* Q3 non-gaap earnings per share $0.48 from continuing operations",
        "date": "08242016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc Q3 non-gaap EPS $0.48 from cont ops "
    },
    {
        "content": "Aug 24 HP Inc's quarterly revenue fell 3.8 percent  the third straight quarter of decline since the company was split off from the former Hewlett-Packard Co  as demand slid further for its printers.",
        "date": "08242016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc's quarterly revenue falls 3.8 pct "
    },
    {
        "content": "* Has substantially completed closing of previously announced acquisition of customer communications management (CCM) assets from HP Inc  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "08012016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-OpenText says substantially completed acquisition of HP's customer communications management assets "
    },
    {
        "content": "A group of about 130 current and former Hewlett-Packard Co employees had jobs that were too varied to let them sue the company as a collective under federal wage-and-hour laws for unpaid overtime  a federal judge ruled on Wednesday.",
        "date": "07152016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Federal judge decertifies FLSA collective suing HP for unpaid overtime "
    },
    {
        "content": "SAN FRANCISCO A California jury ordered Oracle Corp to pay Hewlett-Packard Enterprise Co $3 billion in damages in a case over HP's Itanium servers  an Oracle spokeswoman said on Thursday.",
        "date": "07012016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Oracle ordered to pay HP $3 bln in Itanium case "
    },
    {
        "content": "SAN FRANCISCO A California jury ordered Oracle Corp  to pay Hewlett-Packard Enterprise Co  $3 billion in damages in a case over HP's Itanium servers  an Oracle spokeswoman said on Thursday.",
        "date": "07012016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Oracle ordered to pay HP $3 billion in Itanium case "
    },
    {
        "content": "* Says all hp brand paper and paper-based product packaging will be derived from certified and recycled sources by 2020  Source text for Eikon:  Further company coverage:",
        "date": "06292016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc commits to zero deforestation by 2020 "
    },
    {
        "content": "SAN FRANCISCO  June 30 A California jury ordered Oracle Corp to pay Hewlett-Packard Enterprise Co  $3 billion in damages in a case over HP's Itanium servers  an Oracle spokeswoman said on Thursday.",
        "date": "06302016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Oracle ordered to pay HP $3 bln in Itanium case "
    },
    {
        "content": "SAN FRANCISCO  June 30 A California jury ordered Oracle Corp to pay Hewlett-Packard Enterprise Co  $3 billion in damages in a case over HP's Itanium servers  an Oracle spokeswoman said on Thursday.",
        "date": "07012016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-Oracle ordered to pay HP $3 bln in Itanium case "
    },
    {
        "content": "* Says it reached settlement of lawsuit filed by Hewlett-Packard Company  a U.S.-based company  regarding the price cartel of optical disk drive",
        "date": "06292016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-Teac to pay $1.05 mln for settlement of lawsuit with Hewlett-Packard Company "
    },
    {
        "content": "* Announced on Wednesday that Greater Paris University Hospitals  AP-HP and IntegraGen agree to a research partnership to develop a common platform for high-throughput sequencing",
        "date": "06302016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-AP-HP and IntegraGen agree to research partnership "
    },
    {
        "content": "Canadian business software maker OpenText Corp  said it would buy HP Inc's  customer management software business for $315 million.",
        "date": "06202016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Canada's OpenText to buy some HP Inc assets for $315 million "
    },
    {
        "content": "* OpenText signs definitive agreement to acquire customer communications management and other assets of HP Inc",
        "date": "06202016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-OpenText signs agreement to buy HP's customer communications management "
    },
    {
        "content": "A magistrate judge in Texas refused to put RealTime Data's patent infringement suit against Dell  Hewlett Packard  Oracle and several other companies on hold while the defendants challenge the validity of RealTime's patents in a separate proceeding.",
        "date": "06162016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Lawsuits against Dell  HP and Oracle on data compression patents can proceed "
    },
    {
        "content": "* Announced on Friday that its claim against HP rejected in highest court of appeal",
        "date": "06132016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Softimat claim against HP rejected in highest court of appeal "
    },
    {
        "content": "* HP Inc joins Coca-Cola and Microsoft in declining to donate to the Republican National Convention -NYT  Source text: (http://nyti.ms/25zot3u)   (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "05312016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-HP joins Coca-Cola  Microsoft in declining to donate to Republican National Convention-NYT "
    },
    {
        "content": "* Declared a cash dividend of $0.124 per share on company's common stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05312016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc declared a cash dividend of $0.124 per share "
    },
    {
        "content": "* HP Inc says \"On track to reduce our cost structure by more than $1 billion in 2016\" - Dion Weisler  CEO",
        "date": "05252016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc says \"On track to reduce our cost structure by more than $1 billion in 2016\" - Dion Weisler  CEO "
    },
    {
        "content": "HP Inc   which houses the former Hewlett-Packard Co's legacy hardware business  reported a better-than-expected quarterly profit as aggressive cost cutting helped counter weak demand for personal computers and printers.",
        "date": "05252016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc profit beats Street amid weak market for PCs  printers "
    },
    {
        "content": "May 25 HP Inc  which houses the former Hewlett-Packard Co's legacy hardware business  reported a better-than-expected quarterly profit as aggressive cost cutting helped counter weak demand for personal computers and printers.",
        "date": "05252016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-HP Inc profit beats Street amid weak market for PCs  printers "
    },
    {
        "content": "* Says for fiscal 2016 Q3  HP estimates non-GAAP diluted net EPS from continuing operations to be in range of $0.37 to $0.40",
        "date": "05252016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-HP Inc's profit from cont ops falls to 38 cents per share "
    },
    {
        "content": "May 25 HP Inc  which houses the former Hewlett-Packard Co's legacy hardware business  reported an about 11 percent drop in quarterly revenue as it struggles with weak demand for personal computers and printers.",
        "date": "05252016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc's revenue falls about 11 pct on weak PC  printer sales "
    },
    {
        "content": "* Johnson & Johnson announces collaboration with HP Inc. subsidiary to create personalized health care solutions with 3D printing technologies",
        "date": "05172016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Johnson & Johnson says collaborating with HP Inc's unit "
    },
    {
        "content": "* Open Text Corp says transaction purchase price is approximately $170 million",
        "date": "04182016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Opentext to buy certain customer experience software assets of HP Inc "
    },
    {
        "content": "3D printer maker 3D Systems Corp said it appointed former HP Inc executive Vyomesh Joshi as its president and chief executive.",
        "date": "04042016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "3D Systems names former HP exec as CEO "
    },
    {
        "content": "April 4 3D printer maker 3D Systems Corp  said it appointed former HP Inc executive Vyomesh Joshi as its president and chief executive.",
        "date": "04042016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-3D Systems names former HP exec as CEO "
    },
    {
        "content": "March 3 Hewlett Packard Enterprise Co  which houses former Hewlett-Packard Co's corporate hardware and services division  reported a 2.5 percent fall in quarterly revenue  largely due to weakness in its enterprise services business.",
        "date": "03032016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Enterprise revenue falls 2.5 pct on weak services business "
    },
    {
        "content": "* Indexes up: Dow 0.42 pct  S&P 0.41 pct  Nasdaq 0.03 pct   (Updates to open)",
        "date": "02252016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St higher as manufacturing activity rebounds "
    },
    {
        "content": "Feb 25 U.S. stocks futures swung in and out of negative territory on Thursday as oil prices slid but data showed an uptick in U.S. manufacturing activity.",
        "date": "02252016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "REFILE-US STOCKS-Wall St set to open little changed as oil retreats "
    },
    {
        "content": "HP Inc  said it was accelerating its restructuring program and now expects about 3 000 people will exit by the end of fiscal 2016 instead of over three years as it announced in September.",
        "date": "02252016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc says to accelerate job cuts by 2016 "
    },
    {
        "content": "Feb 24 HP Inc said it was accelerating its restructuring program and now expects about 3 000 people will exit by the end of fiscal 2016 instead of over three years as it announced in September.",
        "date": "02242016",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "UPDATE 2-HP Inc says to accelerate job cuts by 2016 "
    },
    {
        "content": "Feb 24 HP Inc  which houses former Hewlett-Packard Co's legacy hardware business  reported an about 12 percent drop in quarterly revenue  as it struggles with weak demand for PCs and printers.",
        "date": "02242016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc's quarterly revenue falls 12 pct on weak PC  printer sales "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 19 (Fitch) Fitch Ratings has affirmed the ratings for Ingram  Micro  Inc. (Ingram) including its 'BBB-' Issuer Default Rating (IDR) and senior  unsecured debt rating. Approximately $1.2 billion of debt Ingram's debt  outstanding as of Oct. 3  2015 is affected by Fitch's action. The Rating Outlook  remains Stable. A full list of the current rating follows at the end of this  release. Today's affirmation follows Ingram'",
        "date": "02192016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Fitch Affirms Ingram Micro  Inc. at 'BBB-'; Outlook Stable "
    },
    {
        "content": "MUMBAI Japan's NEC Corp  is in initial talks to acquire Indian IT services firm Mphasis Ltd   majority owned by HP Inc   CNBC TV18 reported on Friday  citing unnamed sources.",
        "date": "01082016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Japan's NEC Corp in talks to buy India's Mphasis: CNBC TV18 "
    },
    {
        "content": "MUMBAI Japan's NEC Corp is in initial talks to acquire Indian IT services firm Mphasis Ltd  majority owned by HP Inc  CNBC TV18 reported on Friday  citing unnamed sources.",
        "date": "01082016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Japan's NEC Corp in talks to buy Mphasis - CNBC TV18 "
    },
    {
        "content": "MUMBAI  Jan 8 Japan's NEC Corp is in initial talks to acquire Indian IT services firm Mphasis Ltd   majority owned by HP Inc  CNBC TV18 reported on Friday  citing unnamed sources.",
        "date": "01082016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-Japan's NEC Corp in talks to buy India's Mphasis - CNBC TV18 "
    },
    {
        "content": "MUMBAI  Jan 8 Japan's NEC Corp is in initial talks to acquire Indian IT services firm Mphasis Ltd   majority owned by HP Inc  CNBC TV18 reported on Friday  citing unnamed sources.",
        "date": "01082016",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Japan's NEC Corp in talks to buy India's Mphasis - CNBC TV18 "
    },
    {
        "content": "A Hewlett Packard Co employee was wrongly denied disability benefits when he developed an addiction to pain medication after a water-skiing accident  a U.S. appeals court said on Wednesday  finding that the administrator of HP's benefits plan \"cherry picked\" information in order to block the payments.",
        "date": "12092015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Court grants HP worker disability pay over addiction to pain meds "
    },
    {
        "content": "Nov 25 Shares of HP Inc  which houses former Hewlett-Packard Co's legacy hardware business  plunged 16.3 percent on Wednesday after the company's lackluster results fueled concerns about its ability to weather a slowdown in the printer and PC markets.",
        "date": "11252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc plunges after printer business underwhelms "
    },
    {
        "content": "The major U.S. indexes were virtually unchanged at the close of a quiet trading day on Wednesday with gains in healthcare and consumer stocks after data showed U.S. modest economic growth.",
        "date": "11252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Wall Street indexes flat in pre-holiday lull; health  consumer up "
    },
    {
        "content": "HP Inc  which houses former Hewlett-Packard Co's legacy printer and PC business  forecast adjusted profit for the first quarter below market expectations as it struggles with weak sales of PCs and printers.",
        "date": "11242015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Inc profit forecast misses Street on weak PC  printer sales "
    },
    {
        "content": "* Dow up 0.01 pct  S&P down 0.01 pct  Nasdaq 0.26 pct   (Updates to market close  adds commentary)",
        "date": "11252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St indexes flat in pre-holiday lull; health  consumer up "
    },
    {
        "content": "* Indexes up: Dow 0.11 pct  S&P 0.06 pct  Nasdaq 0.32 pct   (Updates to late afternoon  adds commentary  changes byline)",
        "date": "11252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St up slightly  led by health  consumer sectors "
    },
    {
        "content": "* HP Inc sees 1st-qtr adj EPS $0.33-$0.38/shr vs est $0.42/shr",
        "date": "11242015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 3-HP Inc profit forecast misses Street on weak PC  printer sales "
    },
    {
        "content": "Nov 24 Hewlett-Packard Co  the tech pioneer that split into two separate companies this month  reported a fall in revenue for the fifth straight quarter  hurt by lower PC sales and a slump in demand from businesses.",
        "date": "11242015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Hewlett-Packard revenue falls in last report before split "
    },
    {
        "content": "* Indexes up: Dow 0.17 pct  S&P 0.13 pct  Nasdaq 0.37 pct   (Adds details  changes comment  updates prices)",
        "date": "11252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St clings to meager gains ahead of Thanksgiving "
    },
    {
        "content": "* Indexes up: Dow 0.12 pct  S&P 0.05 pct  Nasdaq 0.19 pct   (Adds details  updates prices)",
        "date": "11252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St inches higher as health  consumer stocks gain "
    },
    {
        "content": "* Indexes up: Dow 0.05 pct  S&P 0.02 pct  Nasdaq 0.15 pct   (Updates to open)",
        "date": "11252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Indexes little changed  data indicates moderate growth "
    },
    {
        "content": "NEW YORK HP Inc  shares could rise into the 'high teens' next year if the company can maintain profitability in its printer and computer business and return money to shareholders via dividends and buybacks  according to a report in Barron's on Sunday.",
        "date": "11092015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Inc shares could rise into 'high teens' next year: Barron's "
    },
    {
        "content": "NEW YORK  Nov 8 HP Inc shares could rise into the 'high teens' next year if the company can maintain profitability in its printer and computer business and return money to shareholders via dividends and buybacks  according to a report in Barron's on Sunday.",
        "date": "11092015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc shares could rise into 'high teens' next year -Barron's "
    },
    {
        "content": "* Anoto and HP Inc. sign technology license agreement for digital writing",
        "date": "11062015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Anoto and HP sign technology license agreement for digital writing "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 03 (Fitch) Fitch Ratings has downgraded the long-term ratings  of Hewlett-Packard Company (Hewlett-Packard) to 'BBB+' from 'A-'  removed the  ratings from Rating Watch Negative and assigned a Stable Outlook . The  short-term ratings are affirmed at 'F2'. At the same time  Fitch notes the  change in the company's name to HP Inc. (HPI) from Hewlett-Packard following the  completion of the company's separation from Hewlet",
        "date": "11032015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Fitch Resolves Watch Negative on Hewlett-Packard; Ratings for HP Inc. 'BBB+/F2'; Outlook Stable "
    },
    {
        "content": "Shares of HP Inc   which houses the legacy printer and PC business  soared as much as 14.4 percent on Monday  while those of Hewlett Packard Enterprise Co   considered the faster-growing of the two  fell as much as 5.8 percent.",
        "date": "11022015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP Inc shares soar  HPE's volatile in first day of trade since split "
    },
    {
        "content": "Nov 2 Shares of HP Inc  which houses the legacy printer and PC business  soared as much as 14.4 percent on Monday  while those of Hewlett Packard Enterprise Co  considered the faster-growing of the two  fell as much as 5.8 percent.",
        "date": "11022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-HP Inc shares soar  HPE's volatile in first day of trade since split "
    },
    {
        "content": "* HP Inc  Hewlett Packard Enterprise start trading after split",
        "date": "11022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St up after factory data; Nasdaq 100 hits 15-year high "
    },
    {
        "content": "Nov 2 Shares of HP Inc  the legacy printer and PC business of the former Hewlett-Packard Co  soared as much as 11 percent in early trading on Monday  outpacing those of Hewlett Packard Enterprise Co  the new company that holds the tech pioneer's corporate hardware and services division.",
        "date": "11022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP Inc shares outpace those of HPE in first trades since split "
    },
    {
        "content": "British tech entrepreneur Mike Lynch on Thursday said he would file a claim against Hewlett-Packard  for $150 million in damages over allegations the U.S company made about his role in the acquisition of his software company Autonomy in 2011.",
        "date": "10012015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Autonomy's Mike Lynch counter sues HP over $11 billion deal "
    },
    {
        "content": "LONDON  Oct 1 British entrepreneur Mike Lynch on Thursday said he would file a claim against Hewlett-Packard  for $150 million in damages over allegations the U.S company made about his role in the acquisition of his software company Autonomy in 2011.",
        "date": "10012015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Autonomy's Mike Lynch counter sues HP over $11 bln deal "
    },
    {
        "content": "LONDON  Oct 1 British tech entrepreneur Mike Lynch on Thursday said he would file a claim against Hewlett-Packard for $150 million in damages over allegations the U.S company made about his role in the acquisition of his software company Autonomy in 2011.",
        "date": "10012015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-Autonomy's Mike Lynch counter sues HP over $11 bln deal "
    },
    {
        "content": "Hewlett-Packard Co said its board had approved the previously announced split of the company into two separate listed entities - computers and printers  and corporate hardware and services.",
        "date": "10012015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Hewlett-Packard board approves split into two companies "
    },
    {
        "content": "* Companies to start trading separately from Nov. 2   (Adds details  background  shares)",
        "date": "10012015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-Hewlett-Packard board approves split into 2 companies "
    },
    {
        "content": "Oct 1 Hewlett-Packard Co said its board on Wednesday approved the previously announced split of the company into two separate entities - Hewlett Packard Enterprise Co and HP Inc.",
        "date": "10012015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Hewlett-Packard board approves split "
    },
    {
        "content": "LONDON  Sept 25 Hewlett-Packard Co was made aware of practices at Autonomy  including hardware sales and growth rates boosted by different accounting rules  before it bought the firm for $11 billion in an ill-fated deal  according to founder Mike Lynch.",
        "date": "09252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Autonomy's Lynch says report shows HP not hoodwinked on $11 bln deal "
    },
    {
        "content": "LONDON Hewlett-Packard Co was made aware of practices at Autonomy  including hardware sales and growth rates boosted by different accounting rules  before it bought the firm for $11 billion in an ill-fated deal  according to founder Mike Lynch.",
        "date": "09252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Autonomy's Lynch says report shows HP not hoodwinked on $11 billion deal "
    },
    {
        "content": "* Stock falls 1.4 pct in extended trading   (Adds analyst comment  additional background)",
        "date": "09152015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "UPDATE 3-HP to cut up to 30 000 more jobs in enterprise business "
    },
    {
        "content": "Hewlett-Packard Co   which is splitting into two listed companies later this year  said it expects to cut another 25 000 to 30 000 jobs in its enterprise business as part of its efforts to save $2.7 billion in costs.",
        "date": "09152015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP says it will cut up to 30 000 jobs "
    },
    {
        "content": "Hewlett-Packard Co  said it expects the market for its computer and printer business - HP Inc  to remain tough for the \"next several quarters \" due to weak demand for personal computers.",
        "date": "09162015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP says printing and PC business to 'remain tough' in coming quarters "
    },
    {
        "content": "Sept 15 Hewlett-Packard Co said it expects to cut 25 000 to 30 000 jobs as part of its restructuring and cost-saving efforts at it enterprise services business.",
        "date": "09152015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP says to cut 25 000 to 30 000 jobs in enterprise business "
    },
    {
        "content": "Sept 15 Hewlett-Packard Co said it expects the market for its computer and printer business - HP Inc  to remain tough for the \"next several quarters \" due to weak demand for personal computers.",
        "date": "09162015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP says printing and PC business to 'remain tough' in coming qtrs "
    },
    {
        "content": "* Bilateral reseller agreement opens up enterprise market opportunities beyond Ericsson's carrier-grade Wi-Fi and provides go-to-market opportunities for Ericsson's industry-leading small cells through HP's global enterprise channels",
        "date": "09172015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Ericsson partners with HP to reach enterprise customers "
    },
    {
        "content": "CERNOBBIO  Italy  Sept 6 U.S. computer company Hewlett-Packard is considering increasing investments and hiring new workers in Italy after years of downsizing  because  it says  it has faith  for the first time in a while  that the country is on the mend.",
        "date": "09072015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "RPT-Businesses hail Renzi's reforms  urge more to speed Italy's upturn "
    },
    {
        "content": "The following factors could affect Italian markets on Monday.",
        "date": "09072015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Italy - Factors to watch on September 7 "
    },
    {
        "content": "Sept 2 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "09022015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Hewlett-Packard Co  is exploring a sale of computer network security solutions unit TippingPoint ahead of a corporate split later this year  according to people familiar with the matter.",
        "date": "09022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP seeks to sell cyber security unit TippingPoint: sources "
    },
    {
        "content": "CERNOBBIO  Italy  Sept 6 U.S. computer company Hewlett-Packard is considering increasing investments and hiring new workers in Italy after years of downsizing  because  it says  it has faith  for the first time in a while  that the country is on the mend.",
        "date": "09062015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "RPT-Businesses hail Renzi's reforms  urge more to speed Italy's upturn "
    },
    {
        "content": "Sept 2 Hewlett-Packard Co is exploring a sale of computer network security solutions unit TippingPoint ahead of a corporate split later this year  according to people familiar with the matter.",
        "date": "09022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP seeks to sell cyber security unit TippingPoint -sources "
    },
    {
        "content": "CERNOBBIO  Italy  Sept 6 U.S. computer company Hewlett-Packard is considering increasing investments and hiring new workers in Italy after years of downsizing  because  it says  it has faith  for the first time in a while  that the country is on the mend.",
        "date": "09062015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Businesses hail Renzi's reforms  urge more to speed Italy's upturn "
    },
    {
        "content": "Aug 20 Hewlett-Packard Co reported an 8.1 percent drop in quarterly revenue  hurt by weak PC sales and lower demand from corporate customers for its services.",
        "date": "08202015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP revenue falls on weak PC sales  lower demand for services "
    },
    {
        "content": "* PC market to continue to remain under pressure - CEO Whitman",
        "date": "08202015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 3-HP revenue falls on weak PC sales  lower demand for services "
    },
    {
        "content": "A California appeals court has reinstated parts of a proposed nationwide class action  originally filed in 2003  that accuses Hewlett-Packard Co of selling notebook computers with a defect that caused their screens to go dark.",
        "date": "07232015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "CA appeals court revives long-running class suit over HP notebooks "
    },
    {
        "content": "* Has chosen to disclose that discussions with OEM customer are held with HP",
        "date": "07152015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Anoto confirms talks with HP "
    },
    {
        "content": "Carly Fiorina has raised $1.4 million since launching her U.S. presidential bid in May  a slow start for the former Hewlett-Packard Co chief executive compared with others in the crowded Republican field.",
        "date": "07072015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Republican Fiorina raises $1.4 million for U.S. presidential bid "
    },
    {
        "content": "* Says signs auto services platforms agreement with Brilliance Auto and HP (China)",
        "date": "06292015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Shanghai Shenhua signs auto services platforms deal with Brilliance Auto  HP China "
    },
    {
        "content": "June 18 Oracle Corp named David Donatelli as executive vice president of its converged infrastructure business  which includes engineered systems  servers  storage and networking products.",
        "date": "06182015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "David Donatelli joins Oracle from HP "
    },
    {
        "content": "AMSTERDAM Hewlett-Packard agreed on Tuesday to pay $100 million to settle a class-action lawsuit stemming from its ill-fated 2011 acquisition of British software company Autonomy.",
        "date": "06092015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP pays $100 million to settle Autonomy-related class-action suit "
    },
    {
        "content": "* HP does not admit any wrongdoing   (Updates with quotes from PGGM)",
        "date": "06092015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-HP pays $100 mln to settle Autonomy-related class-action suit "
    },
    {
        "content": "AMSTERDAM  June 9 Dutch pension fund manager PGGM said on Tuesday Hewlett-Packard had agreed to pay $100 million to settle a class-action lawsuit relating to the company's 2011 acquisition of Autonomy  a \"big data\" analysis company.",
        "date": "06092015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "REFILE-HP pays $100 mln to settle shareholder class-action suit "
    },
    {
        "content": "AMSTERDAM Dutch pension fund manager PGGM said on Tuesday Hewlett-Packard had agreed to pay $100 million to settle a class-auction lawsuit relating to the company's 2011 acquisition of Autonomy  a \"big data\" analysis company.",
        "date": "06092015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP pays $100 mln to settle shareholder class-action suit "
    },
    {
        "content": "* Says announces Hewlett Packard has joined its strategic partnership with CS Loxinfo PCL  Source text for Eikon:  Further company coverage:",
        "date": "06042015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Rapidcloud says Hewlett Packard joined its partnership with CS Loxinfo "
    },
    {
        "content": "Hewlett-Packard Co Chief Executive Meg Whitman said the separation of HP Inc and Hewlett-Packard Enterprise would be effective on Nov. 1.",
        "date": "06022015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP CEO says split effective from November 1 "
    },
    {
        "content": "June 2 Hewlett-Packard Co Chief Executive Meg Whitman said the separation of HP Inc and Hewlett-Packard Enterprise would be effective on Nov. 1.",
        "date": "06022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP CEO says split effective from Nov 1 "
    },
    {
        "content": "* Signed a partnership agreement with Hewlett-Packard BV Amsterdam  Meyrin Branch  based in Geneva  Switzerland",
        "date": "05272015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-NTT System to distribute HP brand consumer goods in Poland "
    },
    {
        "content": "* Indexes down: Dow 0.03 pct  S&P 0.01 pct  Nasdaq 0.1 pct   (Adds details  changes comment and updates prices)",
        "date": "05222015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St lower after CPI data; Yellen speech awaited "
    },
    {
        "content": "* Indexes: Dow down 0.13 pct  S&P off 0.05 pct  Nasdaq up 0.16 pct   (Updates to open  adds comment)",
        "date": "05222015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St mixed as CPI data sparks rate hike timing doubts "
    },
    {
        "content": "Hewlett-Packard Co   which is in the process of splitting itself  forecast separation-related costs below the expectation of several analysts and reported a better-than-expected quarterly profit.",
        "date": "05212015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP forecasts split-related costs below expectations "
    },
    {
        "content": "HONG KONG Hewlett-Packard Co  will sell a controlling 51 percent stake in its China-based data-networking business to China's Tsinghua Unigroup for at least $2.3 billion  forming a partnership designed to create a Chinese technology powerhouse.",
        "date": "05222015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP sells $2.3 billion China unit stake to forge partnership with Tsinghua Unigroup "
    },
    {
        "content": "May 21 Hewlett-Packard Co  which is in the process of splitting itself  forecast separation-related costs below the expectation of several analysts and reported a better-than-expected quarterly profit.",
        "date": "05212015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-HP forecasts split-related costs below expectations "
    },
    {
        "content": "HONG KONG  May 22 Hewlett-Packard Co  will sell a controlling 51 percent stake in its China-based data-networking business to China's Tsinghua Unigroup for at least $2.3 billion  forming a partnership designed to create a Chinese technology powerhouse.",
        "date": "05222015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP sells $2.3 bln China unit stake to forge partnership with Tsinghua Unigroup "
    },
    {
        "content": "May 19 The following bids  mergers  acquisitions and disposals were reported by 1040 GMT on Tuesday:",
        "date": "05192015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "May 21 Hewlett-Packard Co reported a quarterly profit above market estimates  pushing shares up 2 percent in after-market trading.",
        "date": "05212015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP profit beats Street on lower costs "
    },
    {
        "content": "* Thales signs agreement with HP to collaborate on next generation critical communication systems to support emergency services",
        "date": "05212015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-Thales to collaborate with HP on systems to support emergency services "
    },
    {
        "content": "Hewlett-Packard Co   which is in the process of splitting itself  forecast separation-related costs below the expectation of several analysts and reported a better-than-expected quarterly profit.",
        "date": "05222015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP forecasts split-related costs below expectations "
    },
    {
        "content": "May 21 Hewlett-Packard Co  which is in the process of splitting itself  forecast separation-related costs below the expectation of several analysts and reported a better-than-expected quarterly profit.",
        "date": "05222015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 3-HP forecasts split-related costs below expectations "
    },
    {
        "content": "BEIJING Hewlett-Packard Co  has agreed to sell a controlling 51 percent stake in its China-based data-networking business  estimated to be worth more than $2 billion (1 billion pounds)  to Tsinghua Unigroup  a spokesperson for the Chinese private equity fund's parent company said on Tuesday.",
        "date": "05192015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "China's Unigroup says wins bid to buy 51 percent stake in HP unit "
    },
    {
        "content": "* No deal value disclosed  unit estimated to be worth $2 bln;",
        "date": "05192015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-China's Unigroup says wins bid to buy 51 pct stake in HP unit "
    },
    {
        "content": "BEIJING  May 19 Hewlett-Packard Co has agreed to sell a controlling 51 percent stake in its China-based H3C computing unit to Tsinghua Unigroup  a spokesperson for the Chinese private equity fund's parent company said on Tuesday.",
        "date": "05192015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP to sell 51 percent stake of China computing unit to Tsinghua Unigroup "
    },
    {
        "content": "* Says has entered into strategic partnerships with HP  Microsoft and Telefonica to create IT infrastructure and workplace environment",
        "date": "05082015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "BRIEF-Nokia signs IT infrastructure deal with HP  Microsoft and Telefonica "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 06 (Fitch) Fitch Ratings has rated Hewlett-Packard Company's (HP)  $5 billion delayed draw senior unsecured term loan at 'A-'. HP will use  borrowings under the term loan for general corporate purposes  including funding  expenses related to the company's planned separation by the end of the current  fiscal year ending Oct. 31  2015. Commitments under the term loan will be available until the earlier of Nov. 1   2015  or th",
        "date": "05062015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Fitch Rates Hewlett-Packard's Delayed Draw Term Loan 'A-' "
    },
    {
        "content": "WASHINGTON  May 4 Former Hewlett-Packard Co  Chief Executive Carly Fiorina on Monday announced she is running for president  and took a shot at Democratic front-runner Hillary Clinton  who she said represents a political class that Americans are \"disgusted\" with.",
        "date": "05042015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "UPDATE 4-Republican former CEO Fiorina enters 2016 race  hits Clinton "
    },
    {
        "content": "WASHINGTON Republican presidential candidate Carly Fiorina is defending her record as a corporate executive after a critic took over a website with her name on it to highlight job losses at Hewlett-Packard Co while she served as CEO.",
        "date": "05052015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Presidential candidate Fiorina defends Hewlett-Packard tenure "
    },
    {
        "content": "LONDON British IT entrepreneur Mike Lynch said Hewlett-Packard Co had failed to produce a \"smoking gun\" to back its claim he masterminded a complex fraud that led it to overpay by more than $5 billion when HP bought Autonomy in 2011.",
        "date": "05052015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "'No smoking gun' says Autonomy's Lynch as HP lays out $5 bln claim "
    },
    {
        "content": "LONDON  May 5 British IT entrepreneur Mike Lynch said Hewlett-Packard Co had failed to produce a \"smoking gun\" to back its claim he masterminded a complex fraud that led it to overpay by more than $5 billion when HP bought Autonomy in 2011.",
        "date": "05052015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-'No smoking gun' says Autonomy's Lynch as HP lays out $5 bln claim "
    },
    {
        "content": "WASHINGTON  May 5 Republican U.S. presidential candidate Carly Fiorina is defending her record as a corporate executive after a critic took over a website with her name on it to highlight job losses at Hewlett-Packard Co while she served as CEO.",
        "date": "05052015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "U.S. presidential candidate Fiorina defends Hewlett-Packard tenure "
    },
    {
        "content": "LONDON  May 5 British IT entrepreneur Mike Lynch said Hewlett-Packard Co had failed to produce a \"smoking gun\" to back its claim that he masterminded a complex fraud to inflate the value of Autonomy by as much as $5 billion before HP bought it in 2011.",
        "date": "05052015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Autonomy's Lynch says no 'smoking gun' in HP's $5 bln claim "
    },
    {
        "content": "BEIJING  April 30 The bidding for a controlling stake in Hewlett-Packard Co's data-networking business in China  worth more than $2 billion  has thrown up a rare tussle between two Chinese state-backed firms who are wrangling over which has Beijing's backing.",
        "date": "04292015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "China rivals vie for state backing to buy HP unit "
    },
    {
        "content": "WASHINGTON Former Hewlett-Packard Co Chief Executive Officer Carly Fiorina will launch her campaign for the 2016 U.S. Republican presidential nomination on May 4  the Wall Street Journal reported on Wednesday. | Video ",
        "date": "04222015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Former Hewlett-Packard CEO Fiorina to launch presidential bid May 4: WSJ "
    },
    {
        "content": "April 21 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04212015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON Former Hewlett-Packard Co  Chief Executive Carly Fiorina said on Sunday the chances she would run for the U.S. presidency in 2016 were \"higher than 90 percent\" and that she would announce her plans in late April to early May.",
        "date": "03292015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Former HP CEO Fiorina puts chances of presidential bid over 90 percent "
    },
    {
        "content": "WASHINGTON  March 29 Former Hewlett-Packard Co  Chief Executive Carly Fiorina said on Sunday the chances she would run for the U.S. presidency in 2016 were \"higher than 90 percent\" and that she would announce her plans in late April to early May.",
        "date": "03292015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-Former HP CEO Fiorina puts chances of presidential bid over 90 pct "
    },
    {
        "content": "LONDON Hewlett-Packard Co  has lodged a claim in London against Michael Lynch and a former colleague for damages of about $5.1 billion over their management of Autonomy  the company it bought in 2011.",
        "date": "03312015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "HP and Autonomy co-founder Lynch sue each other in London "
    },
    {
        "content": "March 24 Hewlett-Packard Co said it had entered into a partnership to equip its PCs  tablets and other gadgets with audio technology from Danish television and sound system maker Bang & Olufsen.",
        "date": "03242015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP partners with Bang & Olufsen for sound technology "
    },
    {
        "content": "LONDON  March 31 Hewlett-Packard Co has lodged a claim in London against Michael Lynch and a former colleague for damages of about $5.1 billion over their management of Autonomy  the company it bought in 2011.",
        "date": "03312015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-HP and Autonomy co-founder Lynch sue each other in London "
    },
    {
        "content": "LONDON  March 31 British IT entrepreneur Mike Lynch will file a counter claim against HP  he said on Tuesday  a day after the U.S. company lodged a claim against him and his former colleague Sushovan Hussain for damages of $5.1 billion over his management of Autonomy  the British IT company it bought in 2011.",
        "date": "03312015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Autonomy former-CEO counter sues HP after it lodges $5.1 bln claim "
    },
    {
        "content": "Thomson Reuters March 16  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                ",
        "date": "03172015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "NEW YORK A federal judge in California on Tuesday invalidated four Hewlett-Packard Co patents for being too abstract  marking a setback in the company's patent infringement lawsuit against competitor ServiceNow Inc.",
        "date": "03102015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Four Hewlett-Packard patents invalidated in ServiceNow case "
    },
    {
        "content": "SAN FRANCISCO  March 13 A U.S. judge on Friday granted preliminary approval to Hewlett-Packard Co's  settlement of shareholder litigation involving the information technology company's botched acquisition of Autonomy Plc.",
        "date": "03132015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "U.S. judge approves HP shareholder deal over Autonomy acquisition "
    },
    {
        "content": "NEW YORK  March 10 A federal judge in California on Tuesday invalidated four Hewlett-Packard Co patents for being too abstract  marking a setback in the company's patent infringement lawsuit against competitor ServiceNow Inc .",
        "date": "03102015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-Four Hewlett-Packard patents invalidated in ServiceNow case "
    },
    {
        "content": "SAN FRANCISCO  March 13 Hewlett-Packard Co  won preliminary approval from a U.S. judge to settle shareholder litigation on Friday involving the information technology company's botched acquisition of Autonomy Plc.",
        "date": "03132015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-U.S. judge approves HP shareholder deal over Autonomy acquisition "
    },
    {
        "content": "NEW YORK  March 10 A California federal judge has invalidated four Hewlett-Packard Co patents for being too abstract  marking a setback in a major patent infringement lawsuit the company filed last year against competitor ServiceNow Inc.",
        "date": "03102015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Four Hewlett-Packard patents invalidated in case against ServiceNow "
    },
    {
        "content": "* Maersk Line announces that on 7 april 2015  Pierre Danet  current vice president and regional CFO of Hewlett Packard  printing and personal systems in EMEA  will join Maersk Line as chief financial officer (CFO) and be part of management board of Maersk Line",
        "date": "03132015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-A.P. Moller-Maersk says Maersk Line hires new CFO from Hewlett Packard "
    },
    {
        "content": "Thomson Reuters March 13  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                ",
        "date": "03132015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "SAN FRANCISCO Onetime highflying tech executive Ray Lane testified on Monday during a sex discrimination trial involving his former employer  Kleiner Perkins Caufield & Byers  that he made a mistake in judgment involving the harassment of a female venture capitalist at the firm  and that he feared for the woman's safety.",
        "date": "03032015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Former HP chairman admits 'mistake' in sexism trial "
    },
    {
        "content": "March 3 Novetta Solutions LLC  a provider of software and IT services to the U.S. intelligence community  is exploring a sale which could value it at more than $650 million  including debt  according to people familiar with the matter.",
        "date": "03032015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Cybersecurity company Novetta Solutions up for sale -sources "
    },
    {
        "content": "SAN FRANCISCO  March 2 Onetime highflying tech executive Ray Lane testified on Monday during a sex discrimination trial involving his former employer  Kleiner Perkins Caufield & Byers  that he made a mistake in judgment involving the harassment of a female venture capitalist at the firm  and that he feared for the woman's safety.",
        "date": "03032015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-Former HP chairman admits 'mistake' in sexism trial "
    },
    {
        "content": "SAN FRANCISCO Onetime highflying tech executive Ray Lane testified on Monday during a sex discrimination trial involving his former employer  Kleiner Perkins Caufield & Byers  that he made a mistake in judgment involving the harassment of a female venture capitalist at the firm.",
        "date": "03022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Former HP chairman admits 'mistake' in venture firm sexism trial "
    },
    {
        "content": "* Markit manufacturing hits 4-month high  ISM hits 13-month low",
        "date": "03022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St. rallies; Nasdaq hits highest level since 2000 "
    },
    {
        "content": "SAN FRANCISCO  March 2 Onetime highflying tech executive Ray Lane testified on Monday during a sex discrimination trial involving his former employer  Kleiner Perkins Caufield & Byers  that he made a mistake in judgment involving the harassment of a female venture capitalist at the firm.",
        "date": "03022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-Former HP chairman admits 'mistake' in venture firm sexism trial "
    },
    {
        "content": "* Markit manufacturing hits 4-month high  ISM hits 13-month low",
        "date": "03022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-U.S. stocks rally; Nasdaq hits highest level since 2000 "
    },
    {
        "content": "March 2 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "03022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Markit manufacturing hits 4-month high  ISM hits 13-month low",
        "date": "03022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St advances after data and deals; Nasdaq hits 5 000 "
    },
    {
        "content": "Hewlett-Packard Co  said it would buy Wi-Fi network gear maker Aruba Networks Inc  for about $2.7 billion  the biggest deal for the world's No. 2 PC maker since its botched acquisition of Britain's Autonomy Plc in 2011. | Video ",
        "date": "03022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP to buy Wi-Fi gear maker Aruba Networks for $2.7 billion "
    },
    {
        "content": "* Aruba shares fall 1.45 pct; HP marginally down   (Adds analysts' comments  details)",
        "date": "03022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 3-HP to buy Wi-Fi gear maker Aruba Networks for $2.7 bln "
    },
    {
        "content": "SAN FRANCISCO  March 2 Onetime highflying tech executive Ray Lane is expected to testify Monday in a discrimination and retaliation trial involving his former employer  Kleiner Perkins Caufield & Byers  the investment firm that has backed companies from Google Inc to Amazon.com Inc.",
        "date": "03022015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Former HP chairman to testify in venture firm sexism trial "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P down 0.1 pct  Nasdaq down 0.02 pct",
        "date": "02252015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "REFILE-US STOCKS-S&P  Nasdaq edge down with Apple; Dow ends at record high "
    },
    {
        "content": "Hewlett-Packard Co  is in talks to buy wifi network gear maker Aruba Networks Inc  and a deal may be announced as soon as next week  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "02252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP in talks to buy wifi gear maker Aruba Networks: Bloomberg "
    },
    {
        "content": "Hewlett-Packard Co  reported flat or lower quarterly revenue in all its operating units on Tuesday  and forecast full-year earnings well below analysts' expectations due to the strong U.S. dollar.",
        "date": "02242015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "Strong dollar hurts HP's earnings forecast  shares plummet "
    },
    {
        "content": "Feb 25 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "02252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Feb 25 Hewlett-Packard Co is in talks to buy wifi network gear maker Aruba Networks Inc and a deal may be announced as soon as next week  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "02252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-HP in talks to buy wifi gear maker Aruba Networks - Bloomberg "
    },
    {
        "content": "Feb 24 Hewlett-Packard Co reported flat or lower quarterly revenue in all its operating units on Tuesday  and forecast full-year earnings well below analysts' expectations due to the strong U.S. dollar.",
        "date": "02242015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 3-Strong dollar hurts HP's earnings forecast  shares plummet "
    },
    {
        "content": "Feb 24 Hewlett-Packard Co reported a 4.7 percent drop in quarterly revenue  hurt mainly by weak demand from corporate customers for its services.",
        "date": "02242015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP revenue falls on weak demand from corporates "
    },
    {
        "content": "Feb 25 Hewlett-Packard Co is in talks to buy wifi network gear maker Aruba Networks Inc and a deal may be announced as soon as next week  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "02252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP in talks to buy wifi gear maker Aruba Networks - Bloomberg "
    },
    {
        "content": "* Indexes: Dow up 0.04 pct  S&P down 0.1 pct  Nasdaq down 0.1 pct   (Updates to afternoon trading)",
        "date": "02252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-S&P  Nasdaq edge down with Apple; Dow flat "
    },
    {
        "content": "* Deutsche to keep IT security functions   (Adds details  background)",
        "date": "02242015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 1-Deutsche Bank signs multibillion-dollar IT deal with HP "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P up 0.1 pct  Nasdaq up 0.2 pct   (Updates to midday)",
        "date": "02252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St edges up with consumer discretionary shares "
    },
    {
        "content": "* Indexes: Dow off 0.02 pct  S&P 0.08 pct  Nasdaq up 0.04 pct   (Updates to market open)",
        "date": "02252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St little changed after Yellen comments "
    },
    {
        "content": "* Indexes off: Dow 0.06 pct  S&P 0.08 pct  Nasdaq 0.16 pct   (Updates to market open)",
        "date": "02252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St little changed with Yellen  data on deck "
    },
    {
        "content": "* Futures off: Dow 2 pts  S&P 2.5 pts  Nasdaq 8.75 pts   (Adds quote  Target earnings  updates prices)",
        "date": "02252015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "US STOCKS-Wall St set for flat open; Yellen  data on tap "
    },
    {
        "content": "BOSTON  Feb 12 Hewlett-Packard Co will become the largest company to hold an online-only annual shareholder meeting this March  joining a trend toward virtual conferences that some activists worry keeps CEOs off the hotseat.",
        "date": "02122015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP moves annual meeting online-only as CEO face time fades "
    },
    {
        "content": "Feb 11 The following corporate finance-related stories were reported by media:",
        "date": "02122015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "RPT-Market Chatter- Corporate finance press digest "
    },
    {
        "content": "Feb 11 The following corporate finance-related stories were reported by media:",
        "date": "02122015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "Market Chatter- Corporate finance press digest "
    },
    {
        "content": "LONDON Britain's Serious Fraud Office (SFO) has closed its investigation into the ill-fated sale of Autonomy to Hewlett-Packard Co in 2011  saying there was not enough evidence to secure a conviction of the software firm's former executives.",
        "date": "01192015",
        "name": "HP Inc",
        "news_type": "topStory",
        "symbol": "HPQ",
        "title": "UK's Serious Fraud Office ends investigation into HP-Autonomy deal "
    },
    {
        "content": "* SFO cedes jurisdiction of parts of case to U.S. authorities   (Adds HP  former Autonomy CEO Lynch reaction)",
        "date": "01192015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UPDATE 2-UK's Serious Fraud Office ends investigation into HP-Autonomy deal "
    },
    {
        "content": "LONDON  Jan 19 HP says \"remains committed\" to holding Autonomy's former management accountable  co-operating with U.S. Probe",
        "date": "01192015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "HP says \"committed\" to holding Autonomy's former management accountable "
    },
    {
        "content": "AUTONOMY FORMER CEO MIKE LYNCH WELCOMES SFO'S DECISION TO CLOSE INVESTIGATION ON HP-AUTONOMY ACQUISITION",
        "date": "01192015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "BRIEF-Autonomy's former CEO Lynch welcomes end to SFO probe "
    },
    {
        "content": "LONDON  Jan 19 Britain's Serious Fraud Office said it had closed its investigation into the ill-fated sale of British IT firm Autonomy to Hewlett-Packard in 2011  saying there was insufficient evidence for a realistic prospect of conviction.",
        "date": "01192015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "RPT-UK's Serious Fraud Office closes investigation into HP-Autonomy deal "
    },
    {
        "content": "LONDON  Jan 19 Britain's Serious Fraud Office said it had closed its investigation into the ill-fated sale of British IT firm Autonomy to Hewlett-Packard in 2011  saying there was insufficient evidence for a realistic prospect of conviction.",
        "date": "01192015",
        "name": "HP Inc",
        "news_type": "normal",
        "symbol": "HPQ",
        "title": "UK's Serious Fraud Office closes investigation into HP-Autonomy deal "
    }
]