[
    {
        "content": "Oct 31 The following bids  mergers  acquisitions and disposals were reported by 1300 GMT on Tuesday:",
        "date": "10312017",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Spam meat maker Hormel Foods Corp  said on Tuesday it would buy deli meat and salami maker Columbus Manufacturing Inc for about $850 million  pulling off its biggest acquisition that will expand its line of products in grocery stores.",
        "date": "10312017",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Hormel to buy premium deli meat  salami maker for $850 million "
    },
    {
        "content": "Oct 31 Spam meat maker Hormel Foods Corp said on Tuesday it would buy deli meat and salami maker Columbus Manufacturing Inc for about $850 million  pulling off its biggest acquisition that will expand its line of products in grocery stores.",
        "date": "10312017",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "UPDATE 1-Hormel to buy premium deli meat  salami maker for $850 mln "
    },
    {
        "content": "Oct 31 Spam meat maker Hormel Foods Corp said on Tuesday it will acquire deli meat and salami maker Columbus Manufacturing Inc for about $850 million.",
        "date": "10312017",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Hormel Foods to buy salami maker Columbus Manufacturing "
    },
    {
        "content": "* Hormel Foods announces the retirement of Jeffrey M. Ettinger as chairman of the board. Jim Snee  Hormel Foods president and CEO  elected as chairman",
        "date": "09272017",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods chairman Jeffrey Ettinger to retire "
    },
    {
        "content": "* Hormel Foods announces third quarter results and continued progress towards key strategic initiatives",
        "date": "08242017",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods reports Q3 EPS $0.34 "
    },
    {
        "content": "* Hormel Foods adds to its growing international portfolio with the acquisition of the Ceratti Brand",
        "date": "08242017",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods adds to its growing international portfolio with the acquisition of the Ceratti Brand "
    },
    {
        "content": "* Hormel Foods adds to its foodservice portfolio with the acquisition of Fontanini Italian Meats and Sausages",
        "date": "08172017",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods adds to its foodservice portfolio with the acquisition of Fontanini Italian Meats and Sausages "
    },
    {
        "content": "LONDON Anglo-Dutch conglomerate Unilever  is vying with U.S. canned meat producer Hormel Foods Corp  to buy the foods division of British consumer goods maker Reckitt Benckiser  the Sunday Times newspaper reported  citing sources.",
        "date": "07152017",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "Unilever vies with Hormel to buy Reckitt food unit: Sunday Times "
    },
    {
        "content": "LONDON  July 15 Anglo-Dutch conglomerate Unilever is vying with U.S. canned meat producer Hormel Foods Corp to buy the foods division of British consumer goods maker Reckitt Benckiser  the Sunday Times newspaper reported  citing sources.",
        "date": "07152017",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Unilever vies with Hormel to buy Reckitt food unit -Sunday Times "
    },
    {
        "content": "CHICAGO  June 21 Tyson Foods Inc will test a new way to render chickens unconscious before slaughter  the company said on Wednesday  in the latest sign that heightened concerns about animal welfare are affecting U.S. meat processors.",
        "date": "06212017",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "U.S. meat processor Tyson to test new method to stun chickens "
    },
    {
        "content": "WINNIPEG/CHICAGO/BEIJING  June 5 Canada has overtaken the United States as the top North American supplier of pork to China as farmers and meat packers in both nations battle for lucrative shares of the biggest global market.",
        "date": "06052017",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "INSIGHT-Canada beats US in pork sales to China - feet  elbows and all "
    },
    {
        "content": "WINNIPEG/CHICAGO/BEIJING  June 5 Canada has overtaken the United States as the top North American supplier of pork to China as farmers and meat packers in both nations battle for lucrative shares of the biggest global market.",
        "date": "06052017",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "RPT-INSIGHT-Canada beats US in pork sales to China - feet  elbows and all "
    },
    {
        "content": "* Hormel Foods announces second quarter results and continued margin expansion",
        "date": "05252017",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods' Q2 earnings per share $0.39 "
    },
    {
        "content": "* Q1 earnings per share view $0.45 -- Thomson Reuters I/B/E/S",
        "date": "02232017",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods Q1 earnings per share $0.44 "
    },
    {
        "content": " (Attention: An earlier version of this story published on Jan. 31 carried an incorrect photo of a brand not involved with the abuse detailed in the story. We are sorry for any inconvenience caused.)",
        "date": "02012017",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "Hormel stops operations at supplier farm after video shows animal abuse "
    },
    {
        "content": "Jan 31 Packaged foods maker Hormel Foods Corp  said on Tuesday that it had suspended operations at one its pork suppliers in Oklahoma until it investigates claims that pigs were being abused at the farm.",
        "date": "01312017",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "CORRECTED-Hormel stops operations at supplier farm after video shows animal abuse "
    },
    {
        "content": "* Hormel foods achieves record fourth quarter and full year results",
        "date": "11222016",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods reports Q4 earnings per share of  $0.45 "
    },
    {
        "content": "* Announced a 17 percent increase to annual dividend to shareholders",
        "date": "11212016",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods announced a 17 pct increase to annual dividend to shareholders "
    },
    {
        "content": "Nov 21 Smithfield Foods said it would buy Farmer John and Saag's Specialty Meats brands  and farm operations in three U.S. states from Hormel Foods Corp for $145 million in cash.",
        "date": "11212016",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Smithfield Foods to buy Farmer John from Hormel "
    },
    {
        "content": "Nov 21 Smithfield Foods said it would buy parent of the Farmer John and Saag's Specialty Meats brands  and farm operations in three U.S. states from Hormel Foods Corp  for $145 million in cash.",
        "date": "11212016",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "UPDATE 1-Smithfield Foods to buy Farmer John from Hormel "
    },
    {
        "content": "* Hormel Foods Corporation announces the sale of Farmer John  SAAG'S specialty meats  and three farm operations",
        "date": "11212016",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods announces sale of Farmer John  SAAG's specialty meats and three farm operations "
    },
    {
        "content": "* Says \"recommends that stockholders do not tender their shares because offer price is below company's current share price\"",
        "date": "09282016",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods recommends stockholders reject unsolicited below-market price mini-tender "
    },
    {
        "content": "* Says James P. Snee appointed CEO and president  Source text for Eikon:  Further company coverage:",
        "date": "09062016",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods says James Snee appointed CEO "
    },
    {
        "content": "* Hormel Foods achieves record third quarter results and raises full year guidance",
        "date": "08182016",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods Qtrly EPS $0.36 "
    },
    {
        "content": "* Jody h. Feragen to retire as executive vice president and cfo a",
        "date": "05252016",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel foods says CFO  JODY H Feragen to retire "
    },
    {
        "content": "* Raising fiscal 2016 earnings guidance range from $1.50 to $1.56 per share to $1.56 to $1.60 per share",
        "date": "05182016",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods Q2 earnings per share $0.40 "
    },
    {
        "content": "* Hormel Foods announces acquisition of Justin's specialty nut butter brand",
        "date": "05182016",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods to buy Justin's specialty nut butter brand "
    },
    {
        "content": "* Hormel foods corporation announces sale of diamond crystal brands",
        "date": "04262016",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "BRIEF-Hormel Foods announces sale of Diamond Crystal brands "
    },
    {
        "content": "CHICAGO  Nov 12 A U.S. hog slaughterhouse  where workers were videoed beating animals  took action on Thursday to meet demands from Hormel Foods Corp  its only customer  that it tighten controls and give extra training to staff.",
        "date": "11132015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "U.S. supplier to Hormel tightens controls after animal abuse video "
    },
    {
        "content": "CHICAGO  Nov 11 The U.S. Agriculture Department is reviewing the authenticity of a video that allegedly shows animals being beaten and feces-covered pigs at a hog slaughterhouse that supplies SPAM-maker Hormel Foods  and plans to investigate if the video proves to be real  the agency said on Wednesday.",
        "date": "11122015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "USDA probes animal abuse video at Hormel pork supplier QPP "
    },
    {
        "content": "NEW YORK  Oct 29 Hormel Foods Corp said on Thursday that it was voluntarily recalling a limited number of jars of its Skippy peanut butter in seven U.S. states because they might contain small pieces of metal shavings.",
        "date": "10292015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Hormel Foods issues limited U.S. recall of Skippy peanut butter "
    },
    {
        "content": "NEW YORK  Oct 29 Hormel Foods Corp said on Thursday that it was voluntarily recalling a limited number of jars of its Skippy peanut butter in seven U.S. states because they might contain small pieces of metal shavings.",
        "date": "10292015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "UPDATE 1-Hormel Foods issues limited U.S. recall of Skippy peanut butter "
    },
    {
        "content": "May 26 Hormel Foods Corp said it would buy natural and organic meat processor Applegate Farms LLC for about $775 million to cater to an increasing demand for food free of antibiotics  hormones and artificial additives.",
        "date": "05262015",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "UPDATE 1-Hormel Foods to buy organic meat company Applegate "
    },
    {
        "content": "Hormel Foods Corp   the maker of Spam lunch meat  said it would buy meat processor Applegate Farms LLC for about $775 million to expand its natural and organic meat products.",
        "date": "05262015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Hormel Foods to buy organic meat company Applegate for $775 million "
    },
    {
        "content": "May 26 Hormel Foods Corp  the maker of Spam lunch meat  said it would buy meat processor Applegate Farms LLC for about $775 million to expand its natural and organic meat products.",
        "date": "05262015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Hormel Foods to buy organic meat company Applegate for $775 mln "
    },
    {
        "content": "Hormel Foods Corp  the maker of Spam lunch meat  said it expected sales at its Jennie-O Turkey Store business to fall about 15 percent in the second half of the year  due to a supply shortfall caused by an avian flu outbreak in the United States.",
        "date": "05202015",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "Hormel Foods says avian flu likely to hurt turkey sales till 2016 "
    },
    {
        "content": "CHICAGO  May 20 Hormel Foods' chief executive cast doubt on federal forecasts for as much as 4 percent increase in turkey meat production on Wednesday  due to a devastating outbreak of avian flu that has \"significantly challenged\" its Jennie-O Turkey Store business.",
        "date": "05202015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Hormel Foods to USDA: Your turkey forecast is for the birds "
    },
    {
        "content": "* Says Jennie-O sales may fall 15 pct in 2nd half of 2015   (Adds details from conference call  updates shares)",
        "date": "05202015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "UPDATE 2-Hormel Foods says avian flu likely to hurt turkey sales till 2016 "
    },
    {
        "content": "Thomson Reuters May 20  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05202015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "May 20 Hormel Foods Corp  the maker of Spam lunch meat  reported a 28.2 percent rise in quarterly profit  helped by lower costs in its refrigerated foods business.",
        "date": "05202015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Hormel Foods 2nd-qtr profit rises 28 pct "
    },
    {
        "content": "CHICAGO The U.S. government approved the use of an additional $330 million in emergency funds to help contain the worst avian influenza outbreak in U.S. history  as infected bird cases soared and hundreds of Minnesota poultry workers learned they would lose their jobs.",
        "date": "05062015",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "Exclusive: U.S. boosts bird flu emergency funds as Hormel cuts jobs "
    },
    {
        "content": "CHICAGO The U.S. government approved the use of an additional $330 million in emergency funds to help contain the worst avian influenza outbreak in U.S. history  as infected bird cases soared and hundreds of Minnesota poultry workers learned they would lose their jobs.",
        "date": "05052015",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "Exclusive: U.S. boosts bird flu emergency funds as Hormel cuts jobs "
    },
    {
        "content": "CHICAGO  May 5 Hormel Foods Corp unit Jennie-O Turkey Store will temporarily lay off 233 workers at a Minnesota plant because an outbreak of bird flu has reduced the number of turkeys available for processing  the company said on Tuesday.",
        "date": "05052015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Hormel unit Jennie-O lays off employees due to bird flu in poultry "
    },
    {
        "content": "CHICAGO The spread of a deadly strain of bird flu into an Iowa egg farm accelerated market concerns over how big a bite the current outbreak could take from the United States' egg and poultry businesses  sending shares of several leading meat companies' down on Tuesday.",
        "date": "04212015",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "Hormel Foods  other meat company shares fall as bird flu concerns mount "
    },
    {
        "content": "CHICAGO  April 21 The spread of a deadly strain of bird flu into an Iowa egg farm accelerated market concerns over how big a bite the current outbreak could take from the United States' egg and poultry businesses  sending shares of several leading meat companies' down on Tuesday.",
        "date": "04212015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "UPDATE 2-Hormel Foods  other meat company shares fall as bird flu concerns mount "
    },
    {
        "content": "CHICAGO  April 8 A U.S. outbreak of a deadly strain of bird flu accelerated on Wednesday with the infection of a sixth turkey flock in Minnesota  the nation's top turkey-producing state  in less than a week.",
        "date": "04082015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "U.S. bird flu outbreak accelerates as wild ducks migrate north "
    },
    {
        "content": "Hormel Foods Corp  is in late-stage talks to acquire Applegate Farms LLC  a privately held producer of organic hot dogs  bacon and sausages  to enhance its branded protein offerings  according to people familiar with the matter.",
        "date": "02122015",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "Hormel Foods nears deal for Applegate Farms: sources "
    },
    {
        "content": "Feb 12 Hormel Foods Corp is in late-stage talks to acquire Applegate Farms LLC  a privately held producer of organic hot dogs  bacon and sausages  to enhance its branded protein offerings  according to people familiar with the matter.",
        "date": "02122015",
        "name": "Hormel Foods Corporation",
        "news_type": "normal",
        "symbol": "HRL",
        "title": "Hormel Foods nears deal for Applegate Farms-sources "
    },
    {
        "content": "Jan 30 Processing lines at some U.S. hog slaughterhouses are moving too fast for inspectors to adequately address contamination and food safety concerns  according to an advocacy group that says it has obtained affidavits from four government meat inspectors.",
        "date": "01302015",
        "name": "Hormel Foods Corporation",
        "news_type": "topStory",
        "symbol": "HRL",
        "title": "U.S. pork plant program draws criticism  Hormel petition "
    }
]