[
    {
        "content": "* Third Point LLC dissolves Class A share stake in Charter Communications Inc - SEC filing",
        "date": "11092017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Third Point takes share stake in Macerich  dissolves share stake in Humana "
    },
    {
        "content": "* Extendicare Inc - qtrly ‍revenue of $273.2 million up 1.9%​",
        "date": "11092017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Extendicare announces 2017 third quarter results "
    },
    {
        "content": "* Humana Inc - ‍Desalvo's election brings number of Humana directors to 12​ Source text for Eikon: Further company coverage:",
        "date": "11132017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana elects Karen Desalvo to board of directors "
    },
    {
        "content": "* Humana signs definitive agreement to sell closed block of commercial long-term care insurance business",
        "date": "11072017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana signs to sell closed block of commercial long-term care insurance business "
    },
    {
        "content": "NEW YORK  Nov 3 CVS Health Corp’s planned US$66bn buy of Aetna Inc is poised to boost the healthcare sector’s share of US investment-grade mergers and acquisitions lending beyond its current one-third share of the US$122bn total as the sector remains a bright spot in an otherwise lackluster market.",
        "date": "11032017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "LPC: US healthcare brightens tame US high-grade M&A lending "
    },
    {
        "content": "NEW YORK Health insurer Humana Inc  on Wednesday said its 2018 profit growth would be \"a bit below\" 11 percent as the specialist in Medicare healthcare for the elderly and disabled faces off against challenges such as the reinstatement of a 3 percent industry-wide health insurance tax.",
        "date": "11082017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana outlines 2018 growth challenges  shares fall "
    },
    {
        "content": "NEW YORK  Nov 8 Health insurer Humana Inc on Wednesday said its 2018 profit growth would be \"a bit below\" 11 percent as the specialist in Medicare healthcare for the elderly and disabled faces off against challenges such as the reinstatement of a 3 percent industry-wide health insurance tax.",
        "date": "11082017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 4-Humana outlines 2018 growth challenges  shares fall "
    },
    {
        "content": "* Humana Board declares payment of quarterly dividend to stockholders",
        "date": "11022017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana Board declares quarterly dividend payment "
    },
    {
        "content": "NEW YORK  Nov 8 Humana Inc Chief Financial Officer Brian Kane said on Wednesday that the company's 2018 earnings will be hurt by 30 cents per share because of the return of an industry-wide health insurance fee and costs related to exiting the Obamacare individual business.",
        "date": "11082017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana CFO: health insurance tax  Obamacare exit to weigh on 2018 "
    },
    {
        "content": "* Q3 earnings per share view $3.27 -- Thomson Reuters I/B/E/S",
        "date": "11082017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana Inc Q3 GAAP earnings per share $3.44 "
    },
    {
        "content": "Nov 8 U.S. health insurer Humana Inc's profit rose 11 percent in the third quarter  helped by strength in its Medicare Advantage business.",
        "date": "11082017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Humana's profit up 11 pct in third quarter "
    },
    {
        "content": "* Humana expands Medicare advantage offerings in New Hampshire",
        "date": "10172017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana expands Medicare advantage offerings in New Hampshire "
    },
    {
        "content": "* Expanding its existing relationship with Truhearing to include hearing care & hearing aid benefits within its medicare plan Source text for Eikon: Further company coverage:",
        "date": "10122017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana ‍expands relationship with Truhearing "
    },
    {
        "content": "* ‍Humana contracts with CleanSlate centers to provide opioid addiction services​",
        "date": "09272017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-‍Humana contracts with CleanSlate centers to provide opioid addiction services​ "
    },
    {
        "content": "* Announced filing of an insider report for purchase of 100 000 shares by president and CEO  Tim Lukenda Source text for Eikon: Further company coverage:",
        "date": "09182017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Extendicare announces purchase of co's shares by CEO "
    },
    {
        "content": "* Humana - expects to reaffirm guidance of about $17.83 in EPS  or approximately $11.50 in adjusted EPS  in each case for the year ending December 31‍​",
        "date": "09012017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana - expects to reaffirm guidance of about $17.83 in EPS  or approximately $11.50 in adjusted EPS "
    },
    {
        "content": "* Humana Inc - ‍Bisignano's election brings number of humana directors to 11​",
        "date": "08212017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana elects Frank Bisignano to board of directors "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.40per share Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana sets quarterly cash dividend of $0.40 per share "
    },
    {
        "content": "* Amgen and Humana partner for improved health outcomes and efficiency Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Amgen and Humana partner for improved health outcomes "
    },
    {
        "content": "* ‍Signed contract providing in-network access for Humana medicare members at Summit Health Facilities and providers in South-Central Pennsylvania​ Source text for Eikon: Further company coverage:",
        "date": "08152017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Summit Health signs medicare network agreement with Humana "
    },
    {
        "content": "NEW YORK Several big-name hedge fund investors trimmed their stakes in healthcare companies in the second quarter as the sector led the broad U.S. stock market higher  rallying amid a Republican effort to repeal and replace President Obama's signature healthcare law.",
        "date": "08142017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Big-name U.S. hedge funds shed healthcare stocks during the rally in second-quarter "
    },
    {
        "content": "* Extendicare Inc qtrly affo (continuing operations) per diluted share $0.158 Source text for Eikon: Further company coverage:",
        "date": "08092017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Extendicare reports Q2 AFFO per diluted share $0.158 "
    },
    {
        "content": "* Omega Advisors Inc dissolves share stake in Alcoa Corp- SEC Filing‍​",
        "date": "08142017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Omega Advisors Inc dissolves share stake in Alcoa  Humana "
    },
    {
        "content": "U.S. health insurer Humana Inc  on Wednesday said that  it now anticipated a higher percentage of customers will be in its most profitable Medicare Advantage plans for the elderly and people with disabilities in 2018  sending shares up more than 4 percent.",
        "date": "08022017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana shares gain as 2018 Medicare Advantage outlook improves "
    },
    {
        "content": "Aug 2 U.S. health insurer Humana Inc on Wednesday said that  it now anticipated a higher percentage of customers will be in its most profitable Medicare Advantage plans for the elderly and people with disabilities in 2018  sending shares up more than 4 percent.",
        "date": "08022017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 4-Humana shares gain as 2018 Medicare Advantage outlook improves "
    },
    {
        "content": "Aug 2 U.S. health insurer Humana Inc posted a 64 percent rise in quarterly pretax income on Wednesday  as it added members in its Medicare Advantage business  which sells plans to the elderly and to people with disabilities.",
        "date": "08022017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Humana's pretax quarterly profit rises 64 pct "
    },
    {
        "content": "    By Jan  Wolfe      A Jacksonville  Florida-based operator of wound care centers accused health insurance company Humana Inc of infringing its trademarks in violation of an agreement between the companies  in a lawsuit filed on Friday.     Healogics Inc sued Humana's health technology subsidiary Transcend Insights in U.S. District Court in Delaware for trademark infringement and breach of contract  alleging that Transcend Insights \"Healthlogix\" software will confuse the public into thinking i",
        "date": "07242017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Healogics picks trademark fight with Humana over 'HealthLogix' mark "
    },
    {
        "content": "* Humana and Oscar Health enter strategic partnership to offer consumer-focused  technology-driven commercial small business health insurance  beginning in Nashville area",
        "date": "07122017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana and Oscar Health enter partnership to offer small business health insurance "
    },
    {
        "content": "NEW YORK  June 29 Aetna Inc  the third-largest U.S. health insurer  will move its corporate headquarters to New York City next year  making it the latest company to leave Connecticut as the state raises taxes and deals with a budget deficit.",
        "date": "06302017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "CORRECTED-UPDATE 2-Aetna settles on New York for new headquarters in 2018 "
    },
    {
        "content": "NEW YORK Humana Inc will not return to the individual insurance market after it exits the Obamacare exchanges this year  a market that Republicans are trying to repeal and replace through new legislation  Humana's top executive said on Thursday.",
        "date": "06222017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana out of individual market  with or without Obamacare repeal "
    },
    {
        "content": "* Humana Inc - on June 15   co increased the size of its commercial paper program",
        "date": "06192017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana Inc says increased size of its commercial paper program "
    },
    {
        "content": "* Humana - expects to reaffirm guidance of at least $16.91 in diluted eps  or at least $11.10 in adjusted eps  in each case for year ending dec 31  2017",
        "date": "06052017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana expects to reaffirm guidance of at least $11.10 in adj EPS for year ending Dec 31 2017 "
    },
    {
        "content": "NEW YORK  June 1 Tenet Healthcare Corp said on Thursday that it had struck a deal to bring its hospitals  outpatient centers and clinics back into health insurer Humana Inc's network effective today.",
        "date": "06012017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Tenet Healthcare accelerates deal to rejoin Humana's network "
    },
    {
        "content": "* announced an amendment to the effective dates of its multi-year  national agreement with humana inc. Announced on may 1  2017.‍​",
        "date": "06012017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Tenet and Humana amend effective dates of previously disclosed agreement "
    },
    {
        "content": "* Ups share stake in Facebook Inc to 262 900 class A shares from 68 800 class A shares - SEC filing",
        "date": "05152017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Omega Advisors ups share stake in Alphabet  Facebook  Zynga  Time Inc "
    },
    {
        "content": "* Third Point LLC dissolves share stake in Apple Inc - sec filing",
        "date": "05122017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Third Point LLC dissolves share stake in Apple  Goldman Sachs "
    },
    {
        "content": "* Extendicare announces 2017 Q1 results reflecting a 19% increase in NOI",
        "date": "05092017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Extendicare announces Q1 results "
    },
    {
        "content": "U.S. health insurer Humana Inc  reported higher-than-expected quarterly profit on Wednesday due to strength in Medicare Advantage  a program in which it manages government health benefits for the elderly and people with disabilities.",
        "date": "05032017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana profit beats on Medicare Advantage unit strength "
    },
    {
        "content": "* Adjusted revenue $13.48 bln vs estimated $13.62 bln (Adds numbers for individual Obamacare market)",
        "date": "05032017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 3-Humana profit beats on Medicare Advantage unit strength "
    },
    {
        "content": "* Humana inc qtrly GAAP revenue $13 762 million versus $13 800 million",
        "date": "05032017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana inc qtrly GAAP revenue $13.76 billion versus $13.80 billion "
    },
    {
        "content": "* Humana reports detailed first quarter financial results; reaffirms recent full-year 2017 eps guidance increase",
        "date": "05032017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana Q1 adjusted earnings per share $2.75 "
    },
    {
        "content": "May 3 U.S. health insurer Humana Inc's quarterly profit more than quadrupled  helped by a net gain associated with the terminated merger agreement with Aetna Inc .",
        "date": "05032017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Humana's quarterly profit surges "
    },
    {
        "content": "May 2 U.S. health insurer Aetna Inc reported a first-quarter loss on Tuesday  compared with a year-ago profit  primarily due to costs associated with the termination of the Humana merger agreement.",
        "date": "05022017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Health insurer Aetna reports quarterly loss "
    },
    {
        "content": "Tenet Healthcare Corp  which reported a smaller-than-expected quarterly loss on Monday  said it would sell three of its Houston-based hospitals to larger rival HCA Holdings Inc.",
        "date": "05012017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Tenet posts smaller loss; to sell hospitals to HCA "
    },
    {
        "content": "* CEO Broussard says there is a great support for Medicare Advantage from Washington",
        "date": "04252017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana CEO Broussard says there is great support for Medicare Advantage from Washington "
    },
    {
        "content": "Aetna Inc  reported a quarterly net loss on Tuesday related to costs from its failed acquisition of Humana Inc  and said it will cut exposure to money-losing Obamacare coverage in 2018.",
        "date": "05022017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Insurer Aetna posts loss  evaluates Obamacare exposure "
    },
    {
        "content": "May 1 Tenet Healthcare Corp  which reported a smaller-than-expected quarterly loss on Monday  said it would sell three of its Houston-based hospitals to larger rival HCA Holdings Inc.",
        "date": "05012017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 1-Tenet posts smaller loss; to sell hospitals to HCA "
    },
    {
        "content": "* Humana-Realigned certain of its businesses for reporting segments; segments include retail group and specialty healthcare services individual commercial Source text for Eikon: Further company coverage:",
        "date": "04182017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana reports realignment of financial reporting segments "
    },
    {
        "content": "* Humana board declares payment of quarterly dividend to stockholders",
        "date": "04202017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana board declares payment of qtrly dividend to stockholders "
    },
    {
        "content": "NEW YORK U.S. drug distributor Cardinal Health Inc’s deal to buy Medtronic Plc’s medical supplies units days after Abbott Laboratories agreed to a long-awaited purchase of diagnostic testing company Alere Inc has raised the pulse of a sector suppressed by potential healthcare policy upheaval.",
        "date": "04202017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "LPC: U.S. healthcare lending rouses from policy-induced sedation "
    },
    {
        "content": "NEW YORK  April 20 US drug distributor Cardinal Health Inc’s deal to buy Medtronic Plc’s medical supplies units days after Abbott Laboratories agreed to a long-awaited purchase of diagnostic testing company Alere Inc has raised the pulse of a sector suppressed by potential healthcare policy upheaval.",
        "date": "04202017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "LPC: US healthcare lending rouses from policy-induced sedation "
    },
    {
        "content": "March 27 California Public Employees’ Retirement System:",
        "date": "03272017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-CalPERS requests Humana's shareowners vote \"for\" proposal requesting proxy access "
    },
    {
        "content": "* Vanderbilt Health Affiliated Network  Humana enter value-based agreement to benefit medicare advantage patients",
        "date": "03292017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Vanderbilt Health Affiliated Network  Humana enter value-based agreement "
    },
    {
        "content": "* Humana completes aggregate $1.0 billion of senior notes offering  Source text for Eikon:  Further company coverage:",
        "date": "03162017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana completes aggregate $1.0 bln of senior notes offering "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 13 (Fitch) Fitch Ratings has assigned a 'BBB(EXP)' rating to  Humana Inc.'s (HUM) planned offering of senior unsecured notes  likely in a mix  of 10- and 30-year maturities approximating $1 billion.  The ratings are  equivalent to Fitch's ratings on HUM's outstanding senior unsecured notes. The  Outlook on HUM's 'BBB+' Issuer Default Rating (IDR) is Stable.   Fitch anticipates HUM using the proceeds from the planned issue",
        "date": "03132017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Fitch Rates Humana's Planned Issuance 'BBB (EXP)' "
    },
    {
        "content": "March 6 Honda Motor Co Ltd said on Monday it had invested nearly $150 million in two U.S. plants for making 10-speed automatic transmission for front-wheel-drive vehicles.",
        "date": "03062017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Honda to begin U.S. production of new 10-speed transmission "
    },
    {
        "content": "* On Feb. 22  co entered into accelerated stock repurchase agreement with Goldman  Sachs & Co to repurchase $1.5 billion of its common stock",
        "date": "02272017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana enters into stock repurchase agreement with Goldman  Sachs & Co "
    },
    {
        "content": "* Extendicare announces strong results and platform for future growth in 2016 year end results",
        "date": "02282017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Extendicare qtrly AFFO $0.147 per share "
    },
    {
        "content": "* Says the co plans to set up Meldia Investment Realty of America  Inc. in the U.S.",
        "date": "02282017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Sanei Architecture Planning to set up Meldia Investment Realty of America  Inc． "
    },
    {
        "content": "NEW YORK The Blue Cross Blue Shield Association  which represents insurers in every state  Cigna Corp and Humana Inc said on Friday they would attend a meeting between the health insurance industry and President Donald Trump on Monday.",
        "date": "02242017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BCBS  Cigna among insurer groups to meet with Trump on Monday "
    },
    {
        "content": "NEW YORK  Feb 24 The Blue Cross Blue Shield Association  which represents insurers in every state  Cigna Corp and Humana Inc said on Friday they would attend a meeting between the health insurance industry and President Donald Trump on Monday.",
        "date": "02242017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 1-BCBS  Cigna among insurer groups to meet with Trump on Monday "
    },
    {
        "content": "NEW YORK  Feb 24 Banks losing fees from a string of mega-mergers scuttled by U.S. antitrust rulings are still eager to extend loans to investment-grade companies seeking big tie-ups  in the hope they will ultimately profit by winning business down the road.",
        "date": "02242017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "LPC: Bank lending undeterred by busted U.S. mergers "
    },
    {
        "content": "* Caravan Health - enters into agreement with Humana in Kansas  Missouri  arkansas and oklahoma  Source text for Eikon:",
        "date": "02162017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Caravan Health enters into agreement with Humana in Kansas  Missouri  Arkansas And Oklahoma "
    },
    {
        "content": "NEW YORK/WASHINGTON Health insurers Aetna Inc  and Humana Inc walked away from their $34 billion merger on Tuesday and Cigna Corp sought to end its deal with Anthem  shelving the industry consolidation they charted to address former President Barack Obama's Affordable Care Act.",
        "date": "02142017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna  Humana drop merger; Cigna wants to end Anthem deal "
    },
    {
        "content": "NEW YORK/WASHINGTON Feb 14 Health insurers Aetna Inc and Humana Inc walked away from their $34 billion merger on Tuesday and Cigna Corp sought to end its deal with Anthem  shelving the industry consolidation they charted to address former President Barack Obama's Affordable Care Act.",
        "date": "02142017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 6-Aetna  Humana drop merger; Cigna wants to end Anthem deal "
    },
    {
        "content": "* Molina Healthcare - as result of Aetna ending Humana merger and plan to sell medicare advantage assets to Molina  Molina will get $75 million as termination fee  Source text: (http://bit.ly/2knLvt2) Further company coverage:",
        "date": "02142017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Molina Healthcare to receive $75 mln termination fee following Aetna ending Humana merger "
    },
    {
        "content": "* Humana continues to build upon proven strategy following termination of merger with Aetna; provides 2017 financial guidance; announces capital deployment plans",
        "date": "02142017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana continues to build upon proven strategy following termination of merger with Aetna "
    },
    {
        "content": "Feb 9 Although judges shot down Anthem Inc's  $54 billion acquisition of Cigna Corp and Aetna Inc's $35 billion takeover of Humana Inc on anti-trust grounds  the rulings left scope for a possible combination of Cigna and Humana  industry insiders said.",
        "date": "02092017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "RPT-DEALTALK-Cigna  Humana could still combine despite anti-trust rulings -analysts "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 14 (Fitch) Fitch Ratings has removed Humana Inc.'s (HUM)  ratings from Rating Watch Positive and affirmed the 'BBB' ratings assigned to  the company's senior notes and the 'A' Insurer Financial Strength (IFS) ratings  assigned to certain HUM subsidiaries.   The Rating Outlooks are Stable.   The rating actions follow HUM's announcement that it and Aetna Inc. (AET) have  agreed to terminate a merger agreement under which",
        "date": "02142017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Fitch Removes Humana's Ratings from Rating Watch Positive; Affirms Ratings "
    },
    {
        "content": "* Aetna Inc - Aetna will pay Humana $1 billion as a result of termination of merger agreement",
        "date": "02142017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Aetna says it mutually ends merger agreement with Humana "
    },
    {
        "content": "Although judges shot down Anthem Inc's  $54 billion acquisition of Cigna Corp  and Aetna Inc's  $35 billion takeover of Humana Inc  on anti-trust grounds  the rulings left scope for a possible combination of Cigna and Humana  industry insiders said.",
        "date": "02092017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Cigna  Humana could still combine despite anti-trust rulings: analysts "
    },
    {
        "content": "Feb 9 Although judges shot down Anthem Inc's  $54 billion acquisition of Cigna Corp and Aetna Inc's $35 billion takeover of Humana Inc on anti-trust grounds  the rulings left scope for a possible combination of Cigna and Humana  industry insiders said.",
        "date": "02092017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "DEALTALK-Cigna  Humana could still combine despite anti-trust rulings -analysts "
    },
    {
        "content": "Feb 14 Health insurer Aetna Inc and rival Humana Inc said on Tuesday they had mutually ended their $34 billion merger agreement.",
        "date": "02142017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna  Humana end $34 bln merger agreement "
    },
    {
        "content": "* Humana announces termination of merger with Aetna; schedules conference call with investors",
        "date": "02142017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana announces termination of merger with Aetna "
    },
    {
        "content": "U.S. health insurer Humana Inc  on Wednesday put off providing a 2017 financial outlook as it reviews the court ruling against its planned $34 billion sale to Aetna Inc  and said it had cut its Obamacare rolls.",
        "date": "02082017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Insurer Humana  weighing Aetna deal  holds back 2017 outlook "
    },
    {
        "content": "Feb 8 U.S. health insurer Humana Inc on Wednesday put off providing a 2017 financial outlook as it reviews the court ruling against its planned $34 billion sale to Aetna Inc and said it had cut its Obamacare rolls.",
        "date": "02082017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 3-Insurer Humana  weighing Aetna deal  holds back 2017 outlook "
    },
    {
        "content": "* Q4 revenue $12.88 billion versus I/B/E/S view $13.55 billion",
        "date": "02082017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana Q4 adjusted earnings of $2.09/ diluted common share "
    },
    {
        "content": "Feb 8 U.S. health insurer Humana Inc  posted a 3.6 percent fall in quarterly revenue on Wednesday  hurt in part by a decline in premium revenue associated with fewer individual commercial members.",
        "date": "02082017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "U.S. health insurer Humana's quarterly revenue falls 3.6 pct "
    },
    {
        "content": "NEW YORK The U.S. government on Wednesday proposed an increase of 0.25 percent on average in payments to health insurers who offer Medicare Advantage insurance  which provides health benefits to more than 18 million elderly or disabled people.",
        "date": "02012017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "U.S. proposes 0.25 percent hike in Medicare Advantage payments "
    },
    {
        "content": "* NanoString Technologies Inc says Humana has issued a positive coverage decision for Prosigna breast cancer gene signature assay  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-NanoString Technologies says Humana has issued a positive coverage decision for Prosigna breast cancer gene signature assay "
    },
    {
        "content": "NEW YORK  Feb 1 The U.S. government on Wednesday proposed an increase of 0.25 percent on average in payments to health insurers who offer Medicare Advantage insurance  which provides health benefits to more than 18 million elderly or disabled people.",
        "date": "02012017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-U.S. proposes 0.25 pct hike in Medicare Advantage payments "
    },
    {
        "content": "Health insurer Aetna Inc said on Tuesday it lost more money than expected on the Obamacare individual insurance plans  one of the main pillars of the Affordable Care Act that President Donald Trump is working to \"repeal and replace.\"",
        "date": "01312017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Insurer Aetna sees Obamacare changes ahead; no word on Humana "
    },
    {
        "content": "NEW YORK  Feb 1 The U.S. government on Wednesday said it was proposing an increase of 0.25 percent on average in payments to health insurers who offer Medicare Advantage insurance  which provides health benefits to more than 18 million elderly or disabled people.",
        "date": "02012017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "U.S. govt proposes 0.25 pct hike in Medicare Advantage payments "
    },
    {
        "content": "Jan 31 Health insurer Aetna Inc said on Tuesday it lost more money than expected on the Obamacare individual insurance plans  one of the main pillars of the Affordable Care Act that President Donald Trump is working to \"repeal and replace.\"",
        "date": "01312017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 4-Insurer Aetna sees Obamacare changes ahead; no word on Humana "
    },
    {
        "content": "Feb 1 - Anthem Inc  which is fighting a U.S. government lawsuit to block its deal to buy Cigna Corp  said quarterly revenue rose 7.6 percent  helped by higher premiums and an increase in memberships.",
        "date": "02012017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "U.S. health insurer Anthem's quarterly revenue rises 7.6 pct "
    },
    {
        "content": "Jan 31 Health insurer Aetna Inc  whose $34 billion deal for Humana Inc was blocked last week  reported a rise of about 5 percent in quarterly revenue on Tuesday  helped by higher premiums.",
        "date": "01312017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Aetna's quarterly revenue rises about 5 pct "
    },
    {
        "content": "Aetna  and Humana  would consider all available options for their proposed $34 billion merger  the two U.S. health insurers said on Tuesday  a day after a court ruled against the deal due to fears it would lower competition.",
        "date": "01242017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna  Humana to consider all options after court blocks merger "
    },
    {
        "content": "A U.S. judge blocked on Monday health insurer Aetna Inc's proposed $34 billion acquisition of smaller peer Humana Inc  raising the stakes for rival Anthem Inc  as it battles to close a $54 billion deal to buy Cigna Corp.",
        "date": "01232017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "U.S. blocks health insurer Aetna's $34 bln Humana acquisition "
    },
    {
        "content": "Jan 24 Aetna and Humana would consider all available options for their proposed $34 billion merger  the two U.S. health insurers said on Tuesday  a day after a court ruled against the deal due to fears it would lower competition.",
        "date": "01242017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 1-Aetna  Humana to consider all options after court blocks merger "
    },
    {
        "content": "NEW YORK  Jan 24 The top executives of Aetna  and Humana on Tuesday issued a joint statement saying that they continue to believe in their $34 billion merger deal after a court ruled against it for antitrust reasons  and said that they would consider all available options.",
        "date": "01242017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna and Humana CEOs consider all available options after court loss "
    },
    {
        "content": "A U.S. judge blocked on Monday health insurer Aetna Inc's proposed $34 billion acquisition of smaller peer Humana Inc  raising the stakes for rival Anthem Inc as it battles to close a $54 billion deal to buy Cigna Corp. | Video ",
        "date": "01232017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "U.S. blocks health insurer Aetna's $34 billion Humana acquisition "
    },
    {
        "content": "Jan 23 A U.S. judge blocked on Monday health insurer Aetna Inc's proposed $34 billion acquisition of smaller peer Humana Inc  raising the stakes for rival Anthem Inc as it battles to close a $54 billion deal to buy Cigna Corp.",
        "date": "01232017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 3-U.S. blocks health insurer Aetna's $34 bln Humana acquisition "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 23 (Fitch) Fitch Ratings does not plan to take immediate rating  action on Aetna Inc. (AET) and Humana  Inc. (HUM) following today's U.S.  District Court ruling in a civil suit filed by the Department of Justice (DOJ).  The judge's ruling effectively prohibits AET from moving forward with its  previously announced acquisition of HUM.  Absent legal action by AET or HUM to appeal the ruling and assuming the merger  agreem",
        "date": "01232017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Fitch: Ruling on Aetna-Humana Deal Unlikely to Change Ratings Absent Appeal "
    },
    {
        "content": "WASHINGTON  Jan 23 A U.S. federal judge blocked on Monday health insurer Aetna Inc's proposed $34 billion merger with rival Humana  saying it was illegal under antitrust law.",
        "date": "01232017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Federal judge blocks Aetna Inc's plan to buy rival Humana "
    },
    {
        "content": "* Aetna's $34 billion takeover of Humana blocked by judge as anti-competitive - CNBC  citing DJ    Source text: http://bit.ly/2iWgSKB",
        "date": "01232017",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Aetna's $34 bln takeover of Humana blocked by judge as anti-competitive - CNBC "
    },
    {
        "content": "* Extendicare Inc - Received approval of Toronto Stock Exchange to make a normal course issuer bid for up to 8.8 million of its common shares  Source text for Eikon:  Further company coverage:",
        "date": "01102017",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Extendicare normal course issuer bid approved by TSX "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department sought on Monday to knock down arguments by Aetna Inc's  chief executive that Medicare Advantage competes with government insurance programs  making Aetna's proposed merger with Humana legal under antitrust law. Aetna CEO Mark Bertolini testified on Friday and returned to the witness stand Monday morning. The Justice Department sued to stop the merger in July.",
        "date": "12122016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "U.S. seeks to undercut Aetna CEO's defense in merger fight "
    },
    {
        "content": "WASHINGTON Aetna Inc's  chief executive denied on Friday that its withdrawal from some Obamacare exchanges was in retaliation for government efforts to halt its merger with Humana Inc   as he sought to convince a federal judge to approve the deal. The U.S. Justice Department sued to stop the $34 billion tie-up in July  saying that it and another insurance mega merger  Anthem Inc's  planned purchase of Cigna Corp   would mean higher ",
        "date": "12102016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Aetna CEO defends merger with Humana in antitrust trial "
    },
    {
        "content": "WASHINGTON A U.S. Justice Department attorney told a federal judge on Monday that health insurer Aetna Inc's planned acquisition of Humana Inc would break antitrust law by reducing competition in Medicare Advantage and Obamacare exchange businesses  kicking off a trial expected to last weeks.",
        "date": "12052016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "U.S. attorneys argue Aetna-Humana deal violates antitrust law "
    },
    {
        "content": "* Third Point LLC takes share stake of 2.1 million Class A shares in Visa Inc - SEC filing",
        "date": "11102016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Third Point cuts share stake in Allergan  takes share stake in Humana "
    },
    {
        "content": "* Extendicare Inc - qtrly AFFO earnings per share $0.223  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Extendicare Inc - qtrly AFFO earnings per share $0.223 "
    },
    {
        "content": "* Quarterly AFFO earnings per share from continuing operations $0.223",
        "date": "11102016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Extendicare announces solid 2016 third quarter results "
    },
    {
        "content": "Health insurer Humana Inc  reported a higher-than-expected quarterly profit on Friday due to strength in its Medicare Advantage business  which sells plans to the elderly and people with disabilities.",
        "date": "11042016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana profit beats on strength in Medicare Advantage unit "
    },
    {
        "content": "* Individual commercial unit performance in line with expectations",
        "date": "11042016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 3-Humana profit beats on strength in Medicare Advantage unit "
    },
    {
        "content": "* Consolidated revenues (including investment income) for 3q 2016 were $13.69 billion  an increase of $331 million  or 2 percent",
        "date": "11042016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana sees Q3 EPS $2.98 "
    },
    {
        "content": "Nov 4 Health insurer Humana Inc's  quarterly pretax profit jumped 39 percent as it added more members to its Medicare Advantage business  which sells plans to the elderly and people with disabilities.",
        "date": "11042016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Humana's quarterly pretax profit rises 39 pct "
    },
    {
        "content": "NEW YORK  Oct 27 Aetna Inc. is committed to defending its proposed acquisition of Humana Inc. in court  where the U.S. Department of Justice is seeking to block the acquisition  Chief Executive Officer Mark Bertolini said on a conference call on Thursday.",
        "date": "10272016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna CEO is committed to defending Humana acquisition "
    },
    {
        "content": "* Humana Inc - EliteHealth  co to add two primary care practices to Humana's medicare advantage plan networks in South Florida  Source text for Eikon:  Further company coverage:",
        "date": "10282016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana to add EliteHealth's primary care practices to its medicare advantage plan networks in South Florida "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.29 per share  Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana sets quarterly cash dividend of $0.29/share "
    },
    {
        "content": "Health insurer Humana Inc  on Wednesday said a U.S. government health department cut its quality rating on Humana Medicare plans that currently enroll more than 1 million people  which could affect how much the government pays the insurer in 2018.",
        "date": "10122016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana says government cut in Medicare ratings will impact 2018 "
    },
    {
        "content": "Oct 12 Health insurer Humana Inc on Wednesday said a U.S. government health department cut its quality rating on Humana Medicare plans that currently enroll more than 1 million people  which could affect how much the government pays the insurer in 2018.",
        "date": "10122016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "CORRECTED-UPDATE 2-Humana says government cut in Medicare ratings will impact 2018 "
    },
    {
        "content": "* Humana Inc - Annual medicare advantage and prescription drug plan open enrollment period runs Oct. 15 through Dec. 7  2016",
        "date": "10142016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana Offers 2017 Medicare Health Plans "
    },
    {
        "content": "Oct 12 Health insurer Humana Inc on Wednesday raised its full-year earnings forecast  primarily due to better-than-projected performance in its Medicare Advantage business.",
        "date": "10122016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana raises 2016 earnings forecast "
    },
    {
        "content": "* Marketing process for company's 2016 medicare offerings begins on October 1  2016  with enrollment beginning october 15  2016",
        "date": "09232016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana:2017 medicare advantage prescription drug plan offerings approved by CMS "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.29per share  Source text for Eikon:  Further company coverage:",
        "date": "08252016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana sets quarterly cash dividend of $0.29 per share "
    },
    {
        "content": "NEW YORK Aetna Inc  warned in July that it would exit much of the individual Obamacare health insurance market if the government challenged its deal to buy rival Humana Inc   according to a letter it sent to the U.S. Department of Justice. | Video ",
        "date": "08172016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna warned it would cut Obamacare if Humana deal was blocked "
    },
    {
        "content": "NEW YORK Aetna Inc  the No. 3 U.S. health insurer  on Monday said that due to persistent financial losses on Obamacare plans  it will sell individual insurance on the government-run online marketplaces in only four states next year  down from the current 15 states.",
        "date": "08162016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Aetna pulls back on Obamacare health insurance plans in 2017 "
    },
    {
        "content": "NEW YORK  Aug 17 Aetna Inc warned in July that it would exit much of the individual Obamacare health insurance market if the government challenged its deal to buy rival Humana Inc  according to a letter it sent to the U.S. Department of Justice.",
        "date": "08172016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-Aetna warned it would cut Obamacare if Humana deal was blocked "
    },
    {
        "content": "NEW YORK  Aug 17 Aetna Inc's CEO said in a letter to the U.S. Department of Justice during the review of its deal to buy rival Humana Inc that the insurer would exit much of the individual Obamacare insurance market if the agency challenged the merger.",
        "date": "08172016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna CEO warned it would cut Obamacare if Humana deal was blocked "
    },
    {
        "content": "* Q2 FFO per share view c$0.14 -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:",
        "date": "08112016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Extendicare Q2 AFFO per share $0.206 "
    },
    {
        "content": "The federal judge hearing the U.S. Justice Department's case to block Aetna Inc's $34 billion purchase of Humana Inc has set a trial date for Dec. 5  later than the companies had requested.",
        "date": "08102016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Judge sets Aetna-Humana antitrust trial date for Dec. 5 "
    },
    {
        "content": "Washington DC  Aug 10 The federal judge hearing the U.S. Justice Department's case to block Aetna Inc's  $34 billion purchase of Humana Inc has set a trial date for Dec. 5  later than the companies had requested.",
        "date": "08102016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 1-Judge sets Aetna-Humana antitrust trial date for Dec. 5 "
    },
    {
        "content": "Washington DC The U.S. District Court judge hearing the U.S. Justice Department's case to block Aetna Inc.'s  $34 billion purchase of Humana Inc.  has set a trial date for Dec. 5  2016  later than the companies had requested.",
        "date": "08102016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Judge sets Aetna-Humana antitrust trial date for December 5 "
    },
    {
        "content": "Humana Inc  reported a 28 percent drop in quarterly profit as it set aside more money to cover losses in its Obamacare business  and the company said it would discontinue next year most of these plans sold off public exchanges.",
        "date": "08032016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana profit plunges on higher provisions for Obamacare business "
    },
    {
        "content": "Aug 3 Humana Inc reported a 28 percent drop in quarterly profit as it set aside more money to cover losses in its Obamacare business  and the company said it would discontinue next year most of these plans sold off public exchanges.",
        "date": "08032016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-Humana profit plunges on higher provisions for Obamacare business "
    },
    {
        "content": "* Transactions expected to be immediately accretive to earnings following close",
        "date": "08022016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Molina Healthcare to acquire certain medicare assets from Aetna and Humana "
    },
    {
        "content": "* Moody's affirms aetna's ratings  humana's ratings remain on review following doj lawsuit",
        "date": "07272016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Moody's affirms Aetna's and Humana's ratings "
    },
    {
        "content": "Aug 3 Humana Inc's quarterly pretax income fell nearly 20 percent as the U.S. health insurer set aside more money to cover losses in its business that sells individual plans under the Affordable Care Act  known better as Obamacare.",
        "date": "08032016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "U.S. health insurer Humana's quarterly pretax income falls 20 pct "
    },
    {
        "content": "* Transactions contingent on successful closing of Aetna-Humana transaction",
        "date": "08022016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Aetna and Humana agree to sell certain assets to Molina Healthcare "
    },
    {
        "content": "* Humana reports second quarter 2016 financial results; reaffirms recent 2016 financial guidance increase",
        "date": "08032016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana qtrly GAAP earnings per share $2.06 "
    },
    {
        "content": "* Intend to resolve the creditwatch placements after we evaluate  additional details surrounding the suit and assess potential courses of  action",
        "date": "07212016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-S&P says Aetna and Humana placed on creditwatch following U.S. DOJ announcement "
    },
    {
        "content": "WASHINGTON Humana Government Business Inc  a unit of Humana Inc  and Health Net Federal Services LLC have been selected to provide managed care support to the U.S. Defense Department's TRICARE healthcare program  the Pentagon said on Thursday.",
        "date": "07212016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana  Health Net win U.S. defense contracts: Pentagon "
    },
    {
        "content": "WASHINGTON  July 21 Humana Government Business Inc  a unit of Humana Inc  and Health Net Federal Services LLC have been selected to provide managed care support to the U.S. Defense Department's TRICARE healthcare program  the Pentagon said on Thursday.",
        "date": "07212016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana  Health Net win U.S. defense contracts -Pentagon "
    },
    {
        "content": "* Under terms of award  Humana's service area would cover approximately 6 million beneficiaries in a 30-state region",
        "date": "07212016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana awarded Department of Defense TRICARE East Region contract "
    },
    {
        "content": "July 22 Wall Street securities analysts revised their ratings and price targets on several U.S.-listed companies  including Adeptus Health  Chipotle Mexican Grill and Yadkin Financial  on Friday.                HIGHLIGHTS      * Chicago Bridge & Iron Co        : Baird cuts to neutral      * D.R. Horton Inc        : BofA Merrill cuts to neutral from buy        * Humana Inc        : Wolfe Research raises to outperform        * Community Bank System Inc        : Sandler O'Neill cuts to ",
        "date": "07222016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "U.S. RESEARCH ROUNDUP-D.R. Horton  Humana  Chicago Bridge & Iron "
    },
    {
        "content": "July 21 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07212016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "July 22 The potential bust-up of two mega deals among America's largest health insurance companies may have an unintended result - more mergers.",
        "date": "07222016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "DEALTALK-U.S. government's bid to block insurance mergers could spawn new ones "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 21 (Fitch) Fitch Ratings said today that its ratings on Anthem  Inc. (ANTM)  Aetna Inc. (AET)  Cigna Corp. (CI) and Humana Inc. (HUM) remain on  Rating Watch following ANTM's and AET's separate announcements that they intend  to challenge today's decisions by the Department of Justice's (DOJ) to block  their respective acquisitions of CI and HUM.  Fitch anticipates the companies' ratings remaining on rating watch pending t",
        "date": "07212016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Fitch: Anthem & Aetna to Challenge DOJ Merger Block; Ratings Remain on Watch "
    },
    {
        "content": "* says  updated guidance for FY16 adjusted eps of at least $9.25 compares to its previous guidance for FY16 adjusted eps of at least $8.85",
        "date": "07212016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana increases FY 2016 earnings guidance "
    },
    {
        "content": "NEW YORK  July 21 U.S. antitrust regulators will announce on Thursday plans to file lawsuits to block two separate health insurance mergers  Anthem Inc.'s  purchase of Cigna Corp. and Aetna Inc.'s  acquisition of Humana Inc.  according to a source familiar with the matter.",
        "date": "07212016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "U.S. regulators to block Anthem-Cigna  Aetna-Humana deals Thursday-source "
    },
    {
        "content": "NEW YORK U.S. antitrust officials on Thursday moved to block an unprecedented consolidation of the national health insurance market  filing a lawsuit against Anthem Inc's  proposed purchase of Cigna Corp  and Aetna Inc's  planned acquisition of Humana Inc . | Video ",
        "date": "07222016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "U.S. moves to block massive health insurer deals led by Anthem  Aetna "
    },
    {
        "content": "NEW YORK Health insurer Aetna Inc   whose $33 billion purchase of Humana Inc  has been spurned by the U.S. government  faces a tough but not impossible legal battle to try to reinstate the deal.",
        "date": "07222016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna  Humana map legal strategy to salvage merger "
    },
    {
        "content": "NEW YORK  July 21 U.S. antitrust officials on Thursday moved to block an unprecedented consolidation of the national health insurance market  filing a lawsuit against Anthem Inc's proposed purchase of Cigna Corp and Aetna Inc's planned acquisition of Humana Inc.",
        "date": "07222016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 7-U.S. moves to block massive health insurer deals led by Anthem  Aetna "
    },
    {
        "content": "NEW YORK  July 18 While Wall Street is largely betting that antitrust regulators will stop Humana Inc's  takeover by larger rival Aetna Inc  shares of Humana could still fall as much as 18 percent if the deal unravels  investors and analysts say.",
        "date": "07182016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana shares still have room to fall if Aetna buyout blocked "
    },
    {
        "content": " ",
        "date": "07112016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Medicare Advantage grows  but provider choice is limited "
    },
    {
        "content": "July 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07072016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "July 7 Shares in health insurer Humana  fell nearly 10 percent following a report that antitrust regulators were due to discuss \"significant concerns\" over its proposed buyout by rival Aetna Inc",
        "date": "07072016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana shares drop on report of DOJ meeting over Aetna deal "
    },
    {
        "content": "July 1 Aetna Inc has launched an auction to sell a portfolio of Medicare Advantage assets as it seeks antitrust approval for its $37 billion acquisition of U.S. health insurance peer Humana Inc  according to people familiar with the matter.",
        "date": "07012016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna launches Medicare Advantage asset sale -sources "
    },
    {
        "content": "NEW YORK The Illinois Department of Insurance has approved Aetna Inc's  proposed $34 billion acquisition of Humana Inc  provided it is approved by the U.S. Department of Justice  according to an order dated June 23 posted on the department's website.",
        "date": "06272016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Illinois insurance regulator approves Aetna purchase of Humana "
    },
    {
        "content": "Aetna Inc has launched an auction to sell a portfolio of Medicare Advantage assets as it seeks antitrust approval for its $37 billion acquisition of U.S. health insurance peer Humana Inc  according to people familiar with the matter.",
        "date": "07012016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna launches Medicare Advantage asset sale: sources "
    },
    {
        "content": "NEW YORK  June 27 The Illinois Department of Insurance has approved Aetna Inc's proposed $34 billion acquisition of Humana Inc provided it is approved by the U.S. Department of Justice  according to an order dated June 23 posted on the department's website.",
        "date": "06272016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "CORRECTED-Illinois insurance regulator approves Aetna purchase of Humana "
    },
    {
        "content": "* Co  Humana delivered written notice to each other to extend \"end date\" with respect to merger from June 30  2016 to Dec 31  2016 - sec filing  Source text: http://1.usa.gov/28SE5YM  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06242016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Aetna  Humana delivered written notice to each other to extend \"end date\" with respect to merger from June 30-Dec 31 "
    },
    {
        "content": "* Fitch maintains Humana's ratings on positive watch  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06232016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Fitch maintains Humana's ratings on positive watch "
    },
    {
        "content": "NEW YORK California's insurance commissioner on Thursday urged national antitrust regulators to block health insurer Aetna Inc's proposed $34 billion acquisition of Humana Inc.",
        "date": "06232016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "California insurance chief urges U.S. to block Aetna-Humana deal "
    },
    {
        "content": "NEW YORK  June 20 The California Department of Managed Health Care approved Aetna Inc's acquisition of Humana Inc with conditions that it says will control health care costs in the state  such as minimum premium rate increases in the small group HMO business and about $50 million in community investments.",
        "date": "06202016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "California regulator approves Aetna-Humana deal with conditions "
    },
    {
        "content": "NEW YORK/WASHINGTON  June 20 The California Department of Managed Health Care approved Aetna Inc's  acquisition of Humana Inc with conditions including the insurer's commitment to keeping premium increases at a minimum in the small group HMO business and to making about $50 million in community investments.",
        "date": "06202016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 1-California regulator approves Aetna-Humana deal with conditions "
    },
    {
        "content": "* Reaffirm full-year 2016 operating earnings per share projection of $7.90 to $8.10",
        "date": "06072016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Aetna says continues to expect to complete Humana deal in 2nd half of 2016 "
    },
    {
        "content": "NEW YORK  May 25 A tie-up of Aetna Inc  and Humana Inc would be anti-competitive in Missouri for several types of insurance  including individual Medicare Advantage plans where the combined company would have more than a 50 percent market share  the Missouri Department of Insurance said.",
        "date": "05252016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Aetna-Humana tie-up is anti-competitive in Missouri - state regulator "
    },
    {
        "content": "A tie-up of Aetna Inc and Humana Inc would be anti-competitive in Missouri for several types of insurance  including individual Medicare Advantage plans where the combined company would have more than a 50 percent market share  the Missouri Department of Insurance said.",
        "date": "05252016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna-Humana tie-up is anti-competitive in Missouri-state regulator "
    },
    {
        "content": "May 25 A tie-up of Aetna Inc and Humana Inc would be anti-competitive in Missouri for several types of insurance  including individual Medicare Advantage plans where the combined company would have more than a 50 percent market share  the Missouri Department of Insurance said.",
        "date": "05252016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-Aetna-Humana tie-up is anti-competitive in Missouri-state regulator "
    },
    {
        "content": "* Qtrly  affo from continuing operations $0.139 per basic share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05122016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Extendicare qtrly revenue of $262.4 mln "
    },
    {
        "content": "* Humana's strategic investment completes livongo's $49.5 million series C financing round  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05102016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana invests in Livongo to transform diabetes management "
    },
    {
        "content": "U.S. health insurer Humana Inc   which plans to be bought by larger Aetna Inc   is considering ending the sale of Obamacare individual plans in some states in 2017 to stem losses there.",
        "date": "05042016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana may exit Obamacare individual plans in some states "
    },
    {
        "content": "* Humana reports first quarter 2016 financial results; reaffirms 2016 financial guidance",
        "date": "05042016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "BRIEF-Humana Q1 earnings per share $1.56 "
    },
    {
        "content": "* Says on track to close Humana deal by second-half of year   (Adds CEO comments from call)",
        "date": "04282016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "UPDATE 2-Aetna adds more individual Obamacare customers than projected "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.29per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04212016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Humana sets quarterly cash dividend of $0.29/share "
    },
    {
        "content": "NEW YORK  April 19 UnitedHealth Group Inc's  decision to exit most of its Obamacare health insurance exchanges next year means rivals will need to raise prices further to prop up an unprofitable business  healthcare analysts and policy experts said on Tuesday.",
        "date": "04192016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UnitedHealth's Obamacare exit adds pricing pressure on rivals "
    },
    {
        "content": "STOCKHOLM  March 22 Swedish care provider Humana  priced its initial public offering (IPO) at the top end of an indicative range  giving it a market value of 3.3 billion crowns ($401 million) ahead of its market debut on Tuesday  it said in a statement.",
        "date": "03222016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Swedish care provider Humana valued at $400 mln in IPO "
    },
    {
        "content": "STOCKHOLM  March 10 Swedish care provider Humana intends to float its shares in Stockholm  giving it a market capitalisation of up to 3.3 billion Swedish crowns ($391 million)  it said on Thursday.",
        "date": "03102016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Swedish care provider Humana plans IPO at market cap up to 3.3 bln SEK "
    },
    {
        "content": "Feb 15 Health insurer Aetna Inc said on Monday Florida's insurance regulator approved its acquisition of Humana Inc.",
        "date": "02162016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna gets Florida insurance regulator's approval for Humana deal "
    },
    {
        "content": "Health insurer Humana Inc   which is being bought by rival Aetna Inc   on Wednesday said that it had set aside 74 cents per share in the fourth quarter to cover anticipated shortfalls in its 2016 individual health plan business.",
        "date": "02102016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Health insurer Humana takes fourth-quarter charge for 2016 individual losses "
    },
    {
        "content": "Feb 10 Health insurer Humana Inc  which is being bought by rival Aetna Inc  on Wednesday said that it had set aside 74 cents per share in the fourth quarter to cover anticipated shortfalls in its 2016 individual health plan business.",
        "date": "02102016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-Health insurer Humana takes 4Q charge for 2016 individual losses "
    },
    {
        "content": "Feb 10 Health insurer Humana Inc  which is being bought by rival Aetna Inc  reported an 8.4 percent rise in quarterly total revenue  helped by strength in its Medicare Advantage business.",
        "date": "02102016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Humana's quarterly revenue rises "
    },
    {
        "content": "WASHINGTON  Jan 21 Aetna Inc's plan to buy smaller insurer Humana Inc for $31 billion will mean seniors will pay higher Medicare Advantage premiums  according to a new report by the think tank Center for American Progress (CAP).",
        "date": "01212016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna's deal for Humana will push up costs for seniors - think tank "
    },
    {
        "content": "WASHINGTON Aetna Inc's  plan to buy smaller insurer Humana Inc  for $31 billion will mean seniors will pay higher Medicare Advantage premiums  according to a new report by the think tank Center for American Progress (CAP).",
        "date": "01212016",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna's deal for Humana will push up costs for seniors: think tank "
    },
    {
        "content": "SAN FRANCISCO Aetna Inc  Chief Executive Mark Bertolini said on Tuesday that he still expects the company's $37 billion acquisition of rival Humana Inc  to close this year.",
        "date": "01122016",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Aetna CEO sees Humana deal on track to close this year "
    },
    {
        "content": "NEW YORKWhen health insurer Humana Inc reported worse-than-expected quarterly earnings in late 2014 – including a 21 percent drop in net income – it softened the blow by immediately telling investors it would make a $500 million share repurchase. | Video ",
        "date": "12112015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Special Report: Buybacks enrich the bosses even when business sags "
    },
    {
        "content": "NEW YORKWhen health insurer Humana Inc reported worse-than-expected quarterly earnings in late 2014 – including a 21 percent drop in net income – it softened the blow by immediately telling investors it would make a $500 million share repurchase. | Video ",
        "date": "12102015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Special Report: Buybacks enrich the bosses even when business sags "
    },
    {
        "content": "* Signs framework agreement with companies within Humana group\u007f",
        "date": "12142015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "BRIEF-Kontigo Care signs deal within Humana group "
    },
    {
        "content": "Health insurer Humana Inc   which agreed to be bought by Aetna Inc  for $37 billion in July  reported a better-than-expected quarterly profit as it added more members to its individual Medicare Advantage business.",
        "date": "11062015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana profit beats on individual Medicare Advantage strength "
    },
    {
        "content": "* Individual Medicare Advantage membership up 14 pct   (Adds details)",
        "date": "11062015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-Humana profit beats on individual Medicare Advantage strength "
    },
    {
        "content": "Nov 6 Health insurer Humana Inc  which agreed to be bought by Aetna Inc for $37 billion in July  reported a 9.2 percent rise in quarterly revenue as it added more members to its individual Medicare Advantage business.",
        "date": "11062015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Humana's revenue rises 9.2 pct "
    },
    {
        "content": "Oct 29 Pfizer Inc  the No. 1 U.S. drugmaker  and Botox maker Allergan Plc said they were in friendly talks to create a pharmaceutical colossus but the prospect that the company would seek to avoid U.S. taxes sounded political alarm bells.",
        "date": "10292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 5-Pfizer  Allergan drug merger talks raise tax hackles in U.S. "
    },
    {
        "content": "* 3rd-qtr M&A and other advisory fees rise 19 pct to $288 mln",
        "date": "10222015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-Lazard profit beats forecast after busy quarter for M&A "
    },
    {
        "content": "Oct 19 Health insurer Aetna's proposed acquisition of smaller rival Humana Inc was approved by the shareholders of both companies.",
        "date": "10192015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna  Humana shareholders approve proposed merger "
    },
    {
        "content": "Oct 19 Health insurer Aetna's proposed $37 billion acquisition of smaller rival Humana Inc was approved by the shareholders of both companies.",
        "date": "10192015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 1-Aetna  Humana shareholders approve proposed merger "
    },
    {
        "content": "Aetna Inc Chief Executive Mark Bertolini said on Tuesday the company is talking to federal and state officials on its $37 billion acquisition of Humana Inc  and that there is enough insurance competition for it to receive approval.",
        "date": "08042015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna CEO says antitrust process underway in Humana deal "
    },
    {
        "content": "NEW YORK  Aug 4 Aetna Inc Chief Executive Mark Bertolini said on Tuesday the company is talking to federal and state officials on its $37 billion acquisition of Humana Inc and that there is enough insurance competition for it to receive approval.",
        "date": "08042015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 1-Aetna CEO says antitrust process underway in Humana deal "
    },
    {
        "content": "NEW YORK  Aug 4 Aetna Inc chief executive Mark Bertolini said on Tuesday that the company had begun making regulatory filings with both federal and state authorities related to its acquisition of Humana Inc.",
        "date": "08042015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna CEO says has begun antitrust work on Humana deal "
    },
    {
        "content": "NEW YORK  Aug 4 Aetna Inc Chief Financial Officer Shawn Guertin said on Tuesday that the health insurer expects 2015 medical cost trend to increase at the low end of a range of 6 percent to 7 percent.",
        "date": "08042015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna CFO says expects 2015 medical cost trend at low end "
    },
    {
        "content": "Health insurer Humana Inc   which earlier this month agreed to be bought by Aetna Inc  for $37 billion  on Wednesday reported a rise in a key medical cost metric that missed analyst expectations.",
        "date": "07292015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana says medical costs cut into second-quarter profit "
    },
    {
        "content": "July 29 Health insurer Humana Inc  which earlier this month agreed to be bought by Aetna Inc for $37 billion  on Wednesday reported a rise in a key medical cost metric that missed analyst expectations.",
        "date": "07292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-Humana says medical costs cut into second-quarter profit "
    },
    {
        "content": "July 29 Health insurer Humana Inc  reported a 12.4 percent rise in quarterly revenue as it added more members to its Medicare Advantage business for individuals.",
        "date": "07292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Humana's revenue rises on higher memberships "
    },
    {
        "content": "The U.S. House of Representatives Judiciary Committee is planning two hearings for September to discuss concerns about reduced competition in the healthcare industry  lawmakers from both parties said.",
        "date": "07272015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "U.S. House panel to hold hearings on competition in healthcare "
    },
    {
        "content": "NEW YORK  July 27 Allergan plc CEO Brent Saunders is ready to put the $36 billion his company will net from the sale of its generics business to Teva Pharmaceutical Industries Ltd to work  possibly with another large  \"transformational\" merger.",
        "date": "07272015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 1-Allergan CEO  fresh off one deal  sets sights on others "
    },
    {
        "content": "* Combined company would be No. 1 insurer  cover 53 mln members",
        "date": "07242015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "UPDATE 5-Anthem to buy Cigna  creating biggest U.S. health insurer "
    },
    {
        "content": "NEW YORK/WASHINGTON U.S. insurance regulators and state attorneys general are lining up to scrutinize Aetna Inc's proposed $33 billion takeover of rival Humana Inc for potential harm to consumers  complicating what is already expected to be a tough and lengthy review by federal antitrust authorities.",
        "date": "07102015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "States line up to scrutinize Aetna's $33 bln Humana deal "
    },
    {
        "content": "NEW YORK/WASHINGTON U.S. insurance regulators and state attorneys general are lining up to scrutinize Aetna Inc's proposed $33 billion takeover of rival Humana Inc for potential harm to consumers  complicating what is already expected to be a tough and lengthy review by federal antitrust authorities.",
        "date": "07102015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "States line up to scrutinize Aetna's $33 billion Humana deal "
    },
    {
        "content": "NEW YORK U.S. health insurer Aetna Inc  is lining up a $16.2 billion bridge loan to fund its acquisition of smaller rival Humana Inc   which is the first multibillion M&A loan of the second half of 2015 and the second-largest acquisition bridge loan so far this year  according to Thomson Reuters LPC data.",
        "date": "07092015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Aetna's $16.2 billion bridge loan is second-biggest this year "
    },
    {
        "content": "July 7 Health insurer Humana Inc and buyer Aetna Inc set fees to be paid in the event of a failure of the largest deal in the health insurance industry.",
        "date": "07072015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana  Aetna set termination fees for deal "
    },
    {
        "content": "NEW YORK  July 9 U.S. health insurer Aetna Inc  is lining up a $16.2 billion bridge loan to fund its acquisition of smaller rival Humana Inc  which is the first multibillion M&A loan of the second half of 2015 and the second-largest acquisition bridge loan so far this year  according to Thomson Reuters LPC data.",
        "date": "07092015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "TRLPC: Aetna's $16.2B bridge loan is second-biggest this year "
    },
    {
        "content": "NEW YORK  July 3 Aetna Inc's $37 billion deal to buy smaller health insurer Humana Inc will face rigorous scrutiny from U.S. regulators  which antitrust experts said could also make other large-scale mergers in the sector more difficult.",
        "date": "07032015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "UPDATE 1-Aetna's Humana deal to bring scrutiny on other insurer tie-ups -experts "
    },
    {
        "content": "NEW YORK Aetna Inc's  $37 billion deal to buy smaller health insurer Humana Inc  will face rigorous scrutiny from U.S. regulators  which antitrust experts said could also make other large-scale mergers in the sector more difficult.",
        "date": "07032015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna’s Humana deal to bring scrutiny on other insurer tie-ups "
    },
    {
        "content": "NEW YORK  July 3 Aetna Inc's $37 billion deal to buy smaller health insurer Humana Inc will face rigorous scrutiny from U.S. regulators  which antitrust experts said could also make other large-scale mergers in the sector more difficult.",
        "date": "07032015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna's Humana deal to bring scrutiny on other insurer tie-ups -experts "
    },
    {
        "content": "July 2 U.S. health insurer Cigna Corp has had its first meetings with competitor Anthem Inc after it rebuffed Anthem's $47 billion merger proposal last month  a person familiar with the matter said on Thursday.",
        "date": "07022015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Anthem  Cigna in new round of talks -source "
    },
    {
        "content": "NEW YORK Aetna Inc's  chief executive said Monday he was confident any antitrust review of the health insurer's proposed purchase of smaller rival Humana Inc  would allow the deal to close in the second half of 2016. | Video ",
        "date": "07062015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna CEO addresses antitrust concerns over Humana deal "
    },
    {
        "content": "Health insurer Aetna Inc  on Friday said it would buy smaller rival Humana Inc  for about $37 billion in cash and stock  in the largest ever deal in the insurance industry.",
        "date": "07032015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna to buy Humana for $37 billion in largest insurance deal "
    },
    {
        "content": "July 2 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "07022015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "PRESS DIGEST - Wall Street Journal - July 2 "
    },
    {
        "content": "July 3 Health insurer Aetna Inc on Friday said it would buy smaller rival Humana Inc for about $37 billion in cash and stock  in the largest ever deal in the insurance industry.",
        "date": "07032015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 7-Aetna to buy Humana for $37 bln in largest insurance deal "
    },
    {
        "content": "NEW YORK  July 6 Aetna Inc's chief executive said Monday he was confident any antitrust review of the health insurer's proposed purchase of smaller rival Humana Inc would allow the deal to close in the second half of 2016.",
        "date": "07062015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 3-Aetna CEO addresses antitrust concerns over Humana deal "
    },
    {
        "content": "NEW YORK  July 6 Humana Inc  fresh from announcing an agreement to be purchased by larger rival Aetna Inc  prompted new investor concerns about the $33 billion deal on Monday by lowering its 2015 financial forecasts.",
        "date": "07062015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana cuts outlook  raising new concerns about Aetna deal "
    },
    {
        "content": "July 3 Health insurer Aetna Inc said it will buy Humana Inc for about $37 billion  or about $230 per share  in a cash-and-stock deal.",
        "date": "07032015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna to buy Humana for $37 bln in cash and stock "
    },
    {
        "content": "July 2 U.S health insurer Aetna Inc is nearing an agreement to buy rival Humana Inc for about $34 billion in a cash and stock deal  people familiar with the matter told Reuters on Thursday.",
        "date": "07032015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "CORRECTED-UPDATE 4-Aetna nears deal to buy Humana for about $34 bln -sources "
    },
    {
        "content": "* Indexes down: Dow 0.3 pct  S&P 0.4 pct  Nasdaq 0.3 pct   (Updates prices  changes comment  byline)",
        "date": "07062015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "US STOCKS-Energy leads Wall St lower with eyes on Greece  China "
    },
    {
        "content": "July 2 U.S health insurer Aetna Inc is nearing an agreement to buy rival Humana Inc in a cash and stock deal  two people familiar with the matter told Reuters on Thursday.",
        "date": "07032015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna nears deal to buy Humana at $230 a share -sources "
    },
    {
        "content": "July 6 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "07062015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.29 pct  Nasdaq 0.3 pct   (Updates to early afternoon)",
        "date": "07062015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "US STOCKS-Wall St off session lows as Greece aid deal optimism grows "
    },
    {
        "content": "July 6 U.S. stocks erased most of their earlier losses  even turning positive briefly  on Monday after the International Monetary Fund said it is ready to assist Greece if asked.",
        "date": "07062015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "REFILE-US STOCKS-Wall St pares losses after IMF says ready to help Greece "
    },
    {
        "content": "U.S. health insurer Aetna Inc  is close to buying rival Humana Inc  and a deal could be signed as early as this weekend  Bloomberg reported  citing people familiar with the matter.",
        "date": "06252015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Aetna close to buying Humana: Bloomberg "
    },
    {
        "content": "June 25 U.S. health insurer Aetna Inc is close to buying rival Humana Inc and a deal could be signed as early as this weekend  Bloomberg reported  citing people familiar with the matter.",
        "date": "06252015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-Aetna close to buying Humana - Bloomberg "
    },
    {
        "content": "WASHINGTON Health insurer Aetna Inc  has made a takeover proposal to rival Humana Inc   the Wall Street Journal reported on Saturday. It gave no details.",
        "date": "06202015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Aetna Inc makes takeover proposal to Humana Inc - WSJ "
    },
    {
        "content": "June 25 Health insurer Aetna Inc is close to buying rival Humana Inc  and a deal could be signed as early as this weekend  Bloomberg reported.",
        "date": "06252015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "REFILE-Aetna close to buying Humana - Bloomberg "
    },
    {
        "content": "WASHINGTON  June 20 Health insurer Aetna Inc  has made a takeover proposal to rival Humana Inc   the Wall Street Journal reported on Saturday. It gave no details.        (Reporting by Mohammad Zargham Editing by W Simon)",
        "date": "06202015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Aetna Inc makes takeover proposal to Humana Inc -WSJ "
    },
    {
        "content": "ZAGREB  June 11 The Croatian government said on Thursday it would invite banks to advise on the sale of a stake of up to 60 percent in indebted state-owned motorway management company HAC which it hoped would raise around 1.5 billion euros ($1.7 billion).",
        "date": "06112015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Croatia seeks adviser for IPO of state motorway company "
    },
    {
        "content": "Humana Inc  is considering selling itself after receiving multiple expressions of takeover interest  a person familiar with the matter said on Friday  highlighting the widening consolidation in the U.S. health insurance industry.",
        "date": "05292015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Health insurer Humana explores sale:  source "
    },
    {
        "content": "May 29 Humana Inc is considering selling itself after receiving multiple expressions of takeover interest  a person familiar with the matter said on Friday  highlighting the widening consolidation in the U.S. health insurance industry.",
        "date": "05292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 3-Health insurer Humana explores sale - source "
    },
    {
        "content": "* Indexes down: Dow 0.6 pct  S&P 0.6 pct  Nasdaq 0.6 pct   (Updates to close)",
        "date": "05292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "US STOCKS-Wall St ends down after weak economic data but gains in May "
    },
    {
        "content": "May 29 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "05292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Indexes down: Dow 0.36 pct  S&P 0.24 pct  Nasdaq 0.11 pct   (Updates prices)",
        "date": "05292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "US STOCKS-Wall St slips on weak economic data "
    },
    {
        "content": "May 29 Health insurer Humana Inc is considering selling itself and it has received indications of takeover interest  the Wall Street Journal reported  citing sources familiar with the matter.",
        "date": "05292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Humana considering selling itself - WSJ "
    },
    {
        "content": "April 30 Cigna Corp said on Thursday that medical services use did not change among customers in its Medicare Advantage health plans for elderly people and the disabled  a contrast to comments from competitor Humana Inc.",
        "date": "04302015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "UPDATE 2-Cigna sees no change in medical use in 1st qtr  unlike Humana "
    },
    {
        "content": "* Indexes down: Dow 0.7 pct  S&P 0.6 pct  Nasdaq 0.9 pct   (Updates to early afternoon  changes comment)",
        "date": "04292015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "US STOCKS-Wall St falls as health insurers weigh; Fed meeting eyed "
    },
    {
        "content": "U.S. health insurer Humana Inc  said on Wednesday there was an unexpected pick-up in the rate of hospital admissions late in March and in April  sparking a sell-off in its own and other insurers' shares.",
        "date": "04292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana says hospital admissions up as sector shares fall "
    },
    {
        "content": "April 29 U.S. health insurer Humana Inc  said on Wednesday there was an unexpected pick-up in the rate of hospital admissions late in March and in April  sparking a sell-off in its own and other insurers' shares.",
        "date": "04292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 3-Humana says hospital admissions up as sector shares fall "
    },
    {
        "content": "NEW YORK  April 29 Humana Inc Chief Financial Officer Brian Kane said on Wednesday that the insurer had seen a \"slight uptick\" in hospital admissions for Medicare Advantage members during the last few weeks of the first quarter and in April.",
        "date": "04292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana CFO says Medicare hospitalizations higher than foreseen "
    },
    {
        "content": "April 29 U.S. health insurer Humana Inc  reported a rise in quarterly profit as it added more members to its individual Medicare Advantage business.",
        "date": "04292015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Humana's profit rises "
    },
    {
        "content": "NEW YORK  April 7 Humana Inc  a health insurer that manages Medicare Advantage health plans for the elderly and disabled  said on Tuesday that it believes the government's final plan payment rates represent a 0.8 percent increase in funding to it.",
        "date": "04072015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana expects Medicare Advantage payments to create funding increase "
    },
    {
        "content": "NEW YORK  March 30 UnitedHealth Group Inc's  planned takeover of No. 4 U.S. pharmacy benefits provider Catamaran Corp will give the companies added heft in price talks with drug companies  serving as a catalyst for deals allowing other insurers to bulk up.",
        "date": "03302015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UnitedHealth-Catamaran deal sets up healthcare M&A chessboard "
    },
    {
        "content": "NEW YORK Humana Inc  one of the largest U.S. providers of Medicare Advantage healthcare plans for older people  said on Tuesday that it believes a previously disclosed government query for information is part of a wider review involving many healthcare companies.",
        "date": "03242015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana says previously disclosed DOJ query involves other companies "
    },
    {
        "content": "March 23 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "03232015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  March 24 Humana Inc  one of the largest U.S. providers of Medicare Advantage healthcare plans for older people  said on Tuesday that it believes a previously disclosed government query for information is part of a wider review involving many healthcare companies.",
        "date": "03242015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 1-Humana says previously disclosed DOJ query involves other companies "
    },
    {
        "content": "NEW YORK Health insurer Humana Inc  said on Monday that it would sell its Concentra urgent care and physical therapy services unit for about $1 billion to private equity firm Welsh  Carson  Anderson & Stowe and Select Medical Holdings Corp .",
        "date": "03232015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana to sell Concentra medical center unit for $1 billion "
    },
    {
        "content": "NEW YORK  March 23 Health insurer Humana Inc  said on Monday that it would sell its Concentra urgent care and physical therapy services unit for about $1 billion to private equity firm Welsh  Carson  Anderson & Stowe and Select Medical Holdings Corp.",
        "date": "03232015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-Humana to sell Concentra medical center unit for $1 billion "
    },
    {
        "content": "NEW YORK  March 23 Health insurer Humana Inc  said on Monday that it would sell its Concentra urgent care and physical therapy services unit for about $1 billion to private equity firm Welsh  Carson  Anderson & Stowe and Select Medical Holdings Corp.",
        "date": "03232015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Humana to sell Concentra for $1 billion "
    },
    {
        "content": "U.S. health insurer Humana Inc  reported a lower-than- expected fourth-quarter profit as it spent more on new hepatitis C treatments and flu season expenses increased  but it said those and other costs are behind it and predicted a better 2015.",
        "date": "02042015",
        "name": "Humana Inc",
        "news_type": "topStory",
        "symbol": "HUM",
        "title": "Humana profit misses but shares rise on 2015 outlook "
    },
    {
        "content": "Feb 4 U.S. health insurer Humana Inc  reported a lower-than- expected fourth-quarter profit as it spent more on new hepatitis C treatments and flu season expenses increased  but it said those and other costs are behind it and predicted a better 2015.",
        "date": "02042015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "UPDATE 2-Humana profit misses but shares rise on 2015 outlook "
    },
    {
        "content": "Feb  4U.S. health insurer Humana Inc  posted a pretax profit for the fourth quarter  compared with a loss a year earlier  reflecting a rise in individual Medicare Advantage memberships.",
        "date": "02042015",
        "name": "Humana Inc",
        "news_type": "normal",
        "symbol": "HUM",
        "title": "Health insurer Humana reports pretax profit "
    }
]