[
    {
        "content": "ZURICH Clariant   the Swiss speciality chemicals maker whose top investor derailed its $20 billion merger with Huntsman   posted better-than-expected third-quarter sales and operating profit on Tuesday as acquisitions added to results.",
        "date": "10312017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Clariant post third-quarter beat amid row with biggest investor "
    },
    {
        "content": "ZURICH  Oct 31 Clariant  the Swiss speciality chemicals maker whose top investor derailed its $20 billion merger with Huntsman  posted better-than-expected third-quarter sales and operating profit on Tuesday as acquisitions added to results.",
        "date": "10312017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "UPDATE 1-Clariant post Q3 beat amid row with biggest investor "
    },
    {
        "content": "ZURICH The fight over chemicals company Clariant's  future turned bitter on Monday as activists who thwarted a $20 billion merger with Huntsman  threatened to call a shareholder meeting if they do not get three board seats and a strategy review.",
        "date": "10302017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Activist White Tale turns up pressure on Clariant "
    },
    {
        "content": "* Clariant says open for talks  has duty to all shareholders (Adds comment from Clariant)",
        "date": "10302017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "UPDATE 3-Activist White Tale turns up pressure on Clariant "
    },
    {
        "content": "Oct 27 The following bids  mergers  acquisitions and disposals were reported by 2010 GMT on Friday:",
        "date": "10272017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON/MILAN European shares reached a five-month high overall on Friday  but Spanish stocks fell after Catalonia's parliament declared independence. | Video ",
        "date": "10272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "European shares hit five-month high; Spain hurt by Catalonia vote "
    },
    {
        "content": "ZURICH Swiss specialty chemicals maker Clariant and U.S. group Huntsman abandoned their $20 billion merger on Friday  notching a win for activist investors who fought the deal for months on the grounds it would destroy shareholder value. | Video ",
        "date": "10272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Activist investors scupper $20 billion Clariant-Huntsman merger "
    },
    {
        "content": "* Clariant shares down around 5 percent (Adds White Tale comment)",
        "date": "10272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "UPDATE 5-Activist investors scupper $20 bln Clariant-Huntsman merger "
    },
    {
        "content": "* Ceo says clariant is well prepared to tackle the future on our own",
        "date": "10272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "BRIEF-Clariant CEO says to stay on after failed Huntsman merger "
    },
    {
        "content": "ZURICH  Oct 27 Swiss specialty chemicals maker Clariant and Huntsman have agreed to abandon their proposed $20 billion merger  bowing to a growing number of shareholders who had joined activist investor White Tale to oppose the deal.",
        "date": "10272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Clariant  Huntsman abandon $20 bln merger as opposition intensifies "
    },
    {
        "content": "* Huntsman announces strong third quarter 2017 results; balance sheet transformed with significant debt reduction",
        "date": "10272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman reports Q3 revenue of $2.17 bln "
    },
    {
        "content": "* Huntsman and Clariant mutually agree to abandon planned merger of equals",
        "date": "10272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman  Clariant mutually agree to abandon planned merger of equals "
    },
    {
        "content": "ZURICH Activist investors who oppose Swiss specialty chemicals maker Clariant's proposed $20 billion merger with U.S.-based Huntsman have boosted their stake to 20 percent  the Swiss stock exchange said on Friday  after Reuters reported the increased holding on Thursday.",
        "date": "10272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Clariant merger foe boosts stake to 20 percent: stock exchange "
    },
    {
        "content": "ZURICH  Oct 27 Activist investors who oppose Swiss specialty chemicals maker Clariant's proposed $20 billion merger with U.S.-based Huntsman have boosted their stake to 20 percent  the Swiss stock exchange said on Friday  after Reuters reported the increased holding on Thursday.",
        "date": "10272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Clariant merger foe boosts stake to 20 pct - stock exchange "
    },
    {
        "content": "ZURICH Activist investors seeking to block specialty chemical maker Clariant's $20 billion merger with Huntsman Corp  own \"significantly more\" than 15 percent of Clariant shares and want to increase their stake  they told a Swiss newspaper.",
        "date": "10062017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "White Tale activists increase Clariant stake: Finanz und Wirtschaft "
    },
    {
        "content": "ZURICH  Oct 6 Activist investors seeking to block specialty chemical maker Clariant's $20 billion merger with Huntsman Corp own \"significantly more\" than 15 percent of Clariant shares and want to increase their stake  they told a Swiss newspaper.",
        "date": "10062017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "UPDATE 1-White Tale activists increase Clariant stake - Finanz und Wirtschaft "
    },
    {
        "content": "FRANKFURT/LONDON Doubts are growing among Clariant  investors whether the Swiss chemicals maker will be able to drive through a $20 billion merger with Huntsman Corp  in the face of opposition from an activist investor.",
        "date": "10052017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Doubts growing whether Clariant can seal Huntsman deal "
    },
    {
        "content": "* Caterpillar Inc - ‍on Sept 28  Jon M. Huntsman  Jr. Notified co of his decision  effective immediately  to resign as a member of company's board ​",
        "date": "10022017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Caterpillar Inc - Jon Huntsman Jr. to resign as boardmember ​ "
    },
    {
        "content": "ZURICH  Sept 28 Activist investors seeking to block specialty chemicals maker Clariant's merger with Huntsman of the U.S. have boosted their stake in the Swiss company.",
        "date": "09282017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Activists opposed to Huntsman merger raise Clariant stake "
    },
    {
        "content": "* Huntsman raises third quarter 2017 expectations and comments on the impact of Hurricane Harvey",
        "date": "09182017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman raises Q3 expectations  comments on Hurricane Harvey impact "
    },
    {
        "content": "ZURICH The activist investor fighting Clariant's  planned $20 billion merger with Huntsman Corp  has built a 15.1 percent stake that makes it the biggest shareholder in the Swiss chemicals maker.",
        "date": "09202017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Activist lifts Clariant stake  aiming to scuttle Huntsman deal "
    },
    {
        "content": "* Clariant reaffirms merger intent (Updates with comment from Huntsman)",
        "date": "09202017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "UPDATE 4-Activist lifts Clariant stake  aiming to scuttle Huntsman deal "
    },
    {
        "content": "* Clariant reconfirms its full commitment to the planned merger of equals between Huntsman and Clariant and reiterates its strong strategic rationale",
        "date": "09192017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Clariant reconfirms commitment to planned merger between Huntsman and Clariant "
    },
    {
        "content": "ZURICH  Sept 19The Swiss blue-chip SMI was seen opening 0.1 percent firmer at 9 057 points on Tuesday  according to premarket indications by bank Julius Baer .",
        "date": "09192017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Swiss stocks - Factors to watch on Sept. 19 "
    },
    {
        "content": "ZURICH  Sept 19 Activist investor Keith Meister's Corvex hedge fund and New York's 40 North now hold a joint 15.1 percent stake in Clariant  as they push on with their fight against the Swiss chemical maker's planned $20 billion merger with Huntsman Corp.",
        "date": "09192017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Activist has 15.1 pct Clariant stake  fights Huntsman deal "
    },
    {
        "content": "ZURICH  Sept 3 The vast majority of Clariant's shareholders support the Swiss chemical maker's planned $20 billion merger with American peer Huntsman  Huntsman's Chief Executive told Swiss newspaper NZZ am Sonntag.",
        "date": "09032017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Most Clariant shareholders support merger says Huntsman "
    },
    {
        "content": "ZURICH Huntsman  Chief Executive Peter Huntsman said shareholders in Clariant  and his own company \"almost without exception\" support their planned merger after learning the rationale for the $20 billion deal  according to an interview published in Swiss newspaper Finanz und Wirtschaft.",
        "date": "09012017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Huntsman CEO confident merger with Clariant will succeed: paper "
    },
    {
        "content": "Aug 15 Swiss chemicals maker Clariant AG and U.S.-based Huntsman Corp said on Tuesday U.S. regulators had asked for more information on their proposed merger  but they were confident of still closing the deal by the end of this year.",
        "date": "08152017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "FTC asks Clariant  Huntsman for more information on planned merger "
    },
    {
        "content": "* HuntsmanClariant deal continues to move forward: narrow \"second request\" for additional information received from federal trade commission",
        "date": "08152017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "BRIEF-Clariant says HuntsmanClariant deal continues to move forward "
    },
    {
        "content": "ZURICH Following a formula pioneered by their corporate raider father-in-law  two men are stirring up the chemicals sector with a push to halt Clariant's $20 billion merger with Huntsman.",
        "date": "08092017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "'Two Davids' tread in father-in-law's footsteps in bid to halt Clariant deal "
    },
    {
        "content": "ZURICH  Aug 8 Following a formula pioneered by their corporate raider father-in-law  two men are stirring up the chemicals sector with a push to halt Clariant's $20 billion merger with Huntsman.",
        "date": "08082017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "CORRECTED-DEALTALK-'Two Davids' tread in father-in-law's footsteps in bid to halt Clariant deal "
    },
    {
        "content": "ZURICH A big investor in Clariant  and Huntsman  backs the chemical companies' planned $20 billion merger  saying it would unlock synergies and lift profits more than any alternative from activists seeking to derail the deal.",
        "date": "08042017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Clariant  Huntsman investor backs merger  fears fight is a distraction "
    },
    {
        "content": "* Unit Venator Materials priced IPO of 22.7 million ordinary shares at initial offering price of $20.00 per share Source text for Eikon: Further company coverage:",
        "date": "08032017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman unit Venator materials prices IPO of 22.7 mln ordinary shares at offering price of $20 per share "
    },
    {
        "content": "FRANKFURT/ZURICH Specialty chemicals group Clariant  has hired Goldman Sachs  as an additional adviser to help stave off an activist investor's campaign to derail its planned merger with U.S. peer Huntsman .",
        "date": "07312017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Clariant hires Goldman to fend off activist opposed to Huntsman merger "
    },
    {
        "content": "* White Tale has not yet communicated its plans - sources (Adds details  background)",
        "date": "07312017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "UPDATE 2-Clariant hires Goldman to fend off activist opposed to Huntsman merger "
    },
    {
        "content": "FRANKFURT/ZURICH  July 31 Specialty chemicals group Clariant said it has hired Goldman Sachs as an additional advisor to help stave off an activist investor's campaign to derail its planned merger with U.S. peer Huntsman .",
        "date": "07312017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Clariant hires Goldman to fend off activist in Huntsman merger "
    },
    {
        "content": "ZURICH  July 27 Swiss chemicals maker Clariant said on Thursday its $20 billion merger with peer Huntsman  Corp remained on track with a preliminary filing for approval from the U.S. authorities filed.",
        "date": "07272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Clariant says Huntsman merger is on track "
    },
    {
        "content": "ZURICH  July 27 Swiss chemicals maker Clariant's 20 largest shareholders  with the exception of activist investor White Tale Holdings do not oppose a planned $20 billion merger with peer Huntsman Corp  Chief Executive Hariolf Kottmann said on Thursday.",
        "date": "07272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Clariant CEO: none of top 20 investors oppose Huntsman merger "
    },
    {
        "content": "* Venator Materials Plc sees IPO of 22.7 million shares of its ordinary stock priced between $20.00 and $22.00 per share - SEC filing",
        "date": "07242017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Venator Materials Plc sees IPO of 22.7 million shares "
    },
    {
        "content": "ZURICH  July 27 The Swiss blue-chip SMI was seen opening 0.2 percent lower at 8 976 points on Thursday  according to premarket indications by bank Julius Baer .",
        "date": "07272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Swiss stocks - Factors to watch on July 27 "
    },
    {
        "content": "ZURICH  July 27 Swiss chemicals group Clariant   which is carrying out a $20 billion merger with U.S. peer Huntsman reported first half operating profit in line with expectations on Thursday and confirmed its guidance for the year.",
        "date": "07272017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Clariant keeps full year guidance after meeting forecasts in H1 "
    },
    {
        "content": "* Huntsman awards carbon monoxide and hydrogen supply contract to Air Products",
        "date": "07172017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman awards carbon monoxide  hydrogen supply contract to Air Products "
    },
    {
        "content": "July 3 Hedge fund Corvex Management LP  run by activist investor Keith Meister  has built a stake in Clariant AG to undo the Swiss specialty chemical maker's $6.4 billion planned takeover of Huntsman Corp  Bloomberg reported on Monday  citing people with knowledge of the matter.",
        "date": "07032017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Meister's Corvex Management targets Clariant -Bloomberg "
    },
    {
        "content": "ZURICH Activist investor Keith Meister's Corvex hedge fund and New York's 40 North have taken a 7.2 percent stake in Clariant  to fight the Swiss chemical maker's planned merger with Huntsman Corp .",
        "date": "07042017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Corvex  NYC investment group seek to scuttle Clariant-Huntsman deal "
    },
    {
        "content": "* No date yet for shareholder vote on deal (Adds comment from investor  source and details about Standard Industries' acquisitions)",
        "date": "07042017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "UPDATE 5-Corvex  NYC investment group seek to scuttle Clariant-Huntsman deal "
    },
    {
        "content": "ZURICH  July 4 Activist investor Corvex and roofing maker Standard Industries's investment arm have joined forces to take a 7.2 percent stake in Clariant  urging the Swiss chemical maker's shareholders to reject a proposed merger with Huntsman Corp..",
        "date": "07042017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Corvex urges Clariant shareholders to reject Huntsman merger "
    },
    {
        "content": "* Venator Materials prices $375 million private offering of senior notes due 2025",
        "date": "06302017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Venator Materials prices $375 million private offering of senior notes due 2025 "
    },
    {
        "content": "* Huntsman Corp - ‍intention  subject to market and other conditions  to privately offer $350.0 million in aggregate principal amount of senior notes due 2025​",
        "date": "06262017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Venator Materials launches offer of senior notes due 2025 "
    },
    {
        "content": "* Huntsman Corp says on June 15  co's unit entered into seventeenth amendment to credit agreemen with Jpmorgan Chase Bank  N.A - sec filing",
        "date": "06192017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman enters into 17th amendment to credit agreemen with JPMorgan Chase Bank "
    },
    {
        "content": "ZURICH/FRANKFURT U.S.-based Huntsman Corp  and Switzerland's Clariant AG  are combining to create a chemical manufacturer with a market value of about $14 billion  the deal coming together after years of tentative mutual approaches. | Video ",
        "date": "05232017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Long seen as partners  Huntsman and Clariant seal $14 billion merger "
    },
    {
        "content": "May 22 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "05222017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Reuters flagged failed talks in March (Adds market cap chart  updates prices  adds analyst comment)",
        "date": "05222017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "UPDATE 3-Long seen as partners  Huntsman and Clariant seal $14 bln merger "
    },
    {
        "content": "* CEO on CNBC says \"never say never\" when asked about any future M&A transaction similar in size of the Clariant-Huntsman merger",
        "date": "05222017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman CEO does not rule out further large deals - CNBC "
    },
    {
        "content": "MILAN  May 22 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "05222017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "European shares seen up with Clariant eyed after merger deal - For more see the LiveMarkets blog "
    },
    {
        "content": "* CEO Hariolf Kottman said plastics and coatings unit to be integral part of merged company",
        "date": "05222017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "BRIEF-Clariant CEO says had no talks with others during talks with Huntsman "
    },
    {
        "content": "ZURICH  May 22 U.S.-based Huntsman Corp and Switzerland's Clariant AG said on Monday they are combining to create a chemical manufacturer with a market value of more than $14 billion.",
        "date": "05222017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Chemical groups Huntsman  Clariant announce merger deal "
    },
    {
        "content": "* Merger of equals to create a global specialty chemical company with approximately $20 billion enterprise value at announcement",
        "date": "05222017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman and Clariant to combine in merger of equals "
    },
    {
        "content": "May 22 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "05222017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "PRESS DIGEST- Financial Times - May 22 "
    },
    {
        "content": "Hunstman Corp  and Clariant AG  are set to announce their merger on Monday  creating a chemical manufacturer with a market value of more than $14 billion  people familiar with the matter said on Sunday.",
        "date": "05212017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Chemical groups Huntsman  Clariant set to announce merger: sources "
    },
    {
        "content": "May 21 Hunstman Corp and Clariant AG are set to announce their merger on Monday  creating a chemical manufacturer with a market value of more than $14 billion  people familiar with the matter said on Sunday.",
        "date": "05212017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "UPDATE 1-Chemical groups Huntsman  Clariant set to announce merger -sources "
    },
    {
        "content": "May 21 Hunstman Corp and Clariant AG are set to announce their merger on Monday  creating a chemical manufacturer with a market value of more than $14 billion  people familiar with the matter said on Sunday.",
        "date": "05212017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Chemicals groups Huntsman  Clariant set to announce merger -sources "
    },
    {
        "content": "* Huntsman acquires leading UK independent polyurethane formulations company  IFS",
        "date": "05012017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman acquires leading UK independent polyurethane formulations company  IFS "
    },
    {
        "content": "* Huntsman announces first quarter 2017 results; raises 2017 free cash flow target to over $450 million",
        "date": "04262017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman Corp Q1 adjusted EPS $0.57 "
    },
    {
        "content": "* Huntsman identifies improving business conditions in first quarter 2017; provides restart time-line for Pori  Finland pigment facility",
        "date": "03272017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman identifies improving business conditions in Q1 2017 provides restart time-line for Pori  Finland pigment facility "
    },
    {
        "content": "* Fluor's Stork secures new five-year maintenance contract with Huntsman at four sites in texas",
        "date": "03202017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Fluor's Stork secures new five-year maintenance contract with Huntsman "
    },
    {
        "content": "* Huntsman announces intention to close remaining operations at its titanium dioxide facility in calais  france",
        "date": "03172017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman announces intention to close remaining operations at its titanium dioxide facility in France "
    },
    {
        "content": "* Huntsman says expects earnings in pigments and additives division to improve \"meaningfully\" in 2017 due largely to price increases in Tio2",
        "date": "02152017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman Corp Q4 income per share $0.53 "
    },
    {
        "content": "* Huntsman Corp -received private letter ruling from irs allowing it to retain 40 pct economic interest in tax-free spin-off of Venator Materials Corp",
        "date": "02162017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman receives private letter ruling from IRS allowing it to retain 40 pct stake in spin-off of Venator Materials Corp "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.125 per share  Source text for Eikon:  Further company coverage:",
        "date": "02092017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman sets quarterly cash dividend of $0.125/shr "
    },
    {
        "content": "* Ongoing process to separate pigments and additives business from huntsman is proceeding",
        "date": "01312017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman's Pori  Finland facility experiences fire "
    },
    {
        "content": "* Huntsman Corp - has decided to retain textile effects business and exclude it from its planned pigments and additives spin-off",
        "date": "01172017",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman Corp to retain textile effects business from planned pigments and additives spin-off "
    },
    {
        "content": "* Some complain approval process too slow  holding up projects",
        "date": "01132017",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "Corporates look past India's cash crisis  praise Modi reforms "
    },
    {
        "content": "HOUSTON Contract workers will return next week to Huntsman Corp's Port Neches  Texas  petrochemical complex after a two-week furlough  according to the company.",
        "date": "12312016",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "Furloughed Huntsman contractors in Port Neches  Texas  to return "
    },
    {
        "content": "* Huntsman officer changes: J. Kimo Esplin appointed executive vice president  strategy & investment  Sean Douglas appointed executive vice president and chief financial officer  Source text for Eikon:  Further company coverage:",
        "date": "11112016",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman Corp appoints Sean Douglas as CFO "
    },
    {
        "content": "* Huntsman announces third quarter results and filing of initial form 10 registration statement for spin-off",
        "date": "10282016",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman announces third quarter results "
    },
    {
        "content": "* Huntsman announces second quarter results; reports attractive MDI margin growth  improving sequential tio2 prices and substantial improvement in cash generation",
        "date": "07272016",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman posts Q2 earnings of $0.36/share "
    },
    {
        "content": "* Huntsman announces plan to close its south african titanium dioxide (TIO2) manufacturing facility",
        "date": "07062016",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman to close its South African titanium dioxide manufacturing facility "
    },
    {
        "content": "* Huntsman names new president of textile effects division  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06022016",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman names president of textile effects division "
    },
    {
        "content": "* Huntsman reports first quarter results; reports strong adjusted ebitda improvement compared to prior quarter",
        "date": "04282016",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman Q1 loss per share $0.05 "
    },
    {
        "content": "LOS ANGELES (Variety.com) - Disney's \"The Jungle Book\" showed serious traction at the North American box office  dominating moviegoing for a second straight weekend with $60.8 million at 4 028 locations.",
        "date": "04242016",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "'Jungle Book' Rules Over 'The Huntsman: Winter's War' "
    },
    {
        "content": "* Huntsman completes refinancing of term loans; extends maturity of term loans and revolving credit facility",
        "date": "04042016",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman completes refinancing of term loans "
    },
    {
        "content": "* Ceo peter huntsman's fy 2015 total compensation $11.5 million versus $15.2 million in fy 2014",
        "date": "03252016",
        "name": "Huntsman Corporation",
        "news_type": "topStory",
        "symbol": "HUN",
        "title": "BRIEF-Huntsman Executive Chairman Jon Huntsman's 2015 total compensation was $6.2 mln "
    },
    {
        "content": "Thomson Reuters May 7  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For ",
        "date": "05072015",
        "name": "Huntsman Corporation",
        "news_type": "normal",
        "symbol": "HUN",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    }
]