[
    {
        "content": "* ‍Paytm  ICICI Bank tie-up to offer short term instant digital credit​",
        "date": "11162017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-‍Paytm  ICICI Bank tie-up to offer short term instant digital credit​ "
    },
    {
        "content": "Nov 9 Indian shares ended marginally higher on Thursday  led by gains in oil refiners such as Reliance Industries Ltd as oil prices stabilised and financial stocks such as ICICI Bank Ltd.",
        "date": "11092017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "Indian shares end slightly up; Reliance Ind  ICICI lead "
    },
    {
        "content": "* Approved proposal for domestic fund raising Source text - http://bit.ly/2iEZSFn Further company coverage:",
        "date": "11082017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank approves proposal for domestic fund raising "
    },
    {
        "content": "* Approves ‍sale of part of its shareholding in ICICI Securities Ltd in an IPO by co​",
        "date": "11072017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank approves part stake ‍sale in IPO of ICICI Securities "
    },
    {
        "content": "* Non-interest income falls on lower gains from unit stake sale",
        "date": "10272017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "UPDATE 2-ICICI Bank's Q2 profit falls  awaits central bank report "
    },
    {
        "content": "Oct 27 ICICI Bank Ltd managing director and CEO Chanda Kochhar speaking on conference call:",
        "date": "10272017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank exec says co awaits RBI final report on supervision exercise "
    },
    {
        "content": "* Sept quarter net profit 20.58 billion rupees versus net profit of 31.02 billion rupees year ago",
        "date": "10272017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank Sept qtr profit down about 34 pct "
    },
    {
        "content": "Oct 27 ICICI Bank Ltd  India's third-biggest lender by assets  reported a 34 percent fall in second-quarter profit  missing analysts' estimates.",
        "date": "10272017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank Q2 profit falls  lags estimates "
    },
    {
        "content": "* Says ‍approved proposal to renew financial assistance to tune of 75 million rupees from ICICI Bank Source text - http://bit.ly/2ymsGfH Further company coverage:",
        "date": "10162017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-DRA Consultants ‍approves proposal to renew financial assistance from ICICI Bank "
    },
    {
        "content": "* ICICI Bank CEO Chanda Kochhar says by ‍retaining focus on inflation targets  RBI policy ensures confidence of investors on Indian macro-economic indicators continue​s",
        "date": "10042017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank CEO Chanda Kochhar says ‍further policy action contingent on evolution of output gap  its impact on inflation trajectory "
    },
    {
        "content": "* ‍Approved allotment of basel III compliant unsecured subordinated perpetual additional tier 1 bonds aggregating INR 4.75 billion",
        "date": "10042017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank ‍approves allotment of basel III compliant unsecured subordinated perpetual additional tier 1 bonds "
    },
    {
        "content": "* Keeps MCLR-based lending rates unchanged in Oct Source text for Eikon: http://bit.ly/2gnnoap",
        "date": "09292017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank keeps MCLR-based lending rates unchanged in Oct "
    },
    {
        "content": "* Says co entered into term loan facility agreement with ICICI Bank ‍​",
        "date": "09292017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-Power Grid Corp enters into term loan facility agreement with ICICI Bank ‍​ "
    },
    {
        "content": "* ICICI Bank -offer for sale of 86.2 million ICICI Lombard shares by co and FAL Corp at 661/share worth 57 billion rupees Source text: (http://bit.ly/2hiXxTP) Further company coverage:",
        "date": "09212017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank says offer for sale of ICICI Lombard shares by co and FAL Corp worth 57 bln rupees "
    },
    {
        "content": "* Approved allotment of basel III compliant unsecured subordinated perpetual additional tier 1 bonds worth INR 10.80 billion on private placement basis Source text - http://bit.ly/2faA5Uo Further company coverage:",
        "date": "09202017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank approves allotment of basel III compliant additional tier 1 bonds worth 10.80 bln rupees "
    },
    {
        "content": "* Says to consider ‍fund raising via issue of basel iii compliant unsecured subordinated perpetual additional tier 1 bonds Source text for Eikon: Further company coverage:",
        "date": "09112017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank to consider ‍fund raising via issue of bonds "
    },
    {
        "content": "MUMBAI  Sept 4 Reserve Bank of India has added HDFC Bank to a list of \"domestic systemically important banks\"  or the equivalent of \"too big to fail\"  according to a statement on Monday.",
        "date": "09042017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "India cenbank gives HDFC Bank \"too big to fail\" status along with SBI and ICICI "
    },
    {
        "content": "* Says signs term loan of 30 billion rupees with ICICI bank ltd.",
        "date": "08302017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-NTPC Ltd signs term loan of 30 bln rupees with ICICI Bank "
    },
    {
        "content": "* CEO says Essar-Rosneft deal reduces ICICI Bank's exposure to the Essar Group by about 50 pct‍​ Source text: [Ms. Chanda Kochhar  MD & CEO  ICICI Bank said  \"We welcome the acquisition of Essar Oil by the Rosneft-led consortium. ICICI Bank has played a key role through the entire process of completion of the transaction since it was announced in October last year. I am delighted to note that the entire ecosystem including the government  regulators  banks and various authorities worked together",
        "date": "08212017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank says Essar-Rosneft deal lowers bank's exposure to Essar Group by 50 pct‍​ "
    },
    {
        "content": "* CEO says \"prudent approach of central bank in reacting to incoming data in a calibrated manner will reinforce confidence amongst global investors\" Source text - The RBI's action today to lower the policy rate is a welcome step which had been widely anticipated given the significant decline in inflation observed recently. The prudent approach of the central bank in reacting to incoming data in a calibrated manner will reinforce the confidence amongst global investors. Further company coverage:",
        "date": "08022017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank CEO says prudent approach of RBI in reacting to incoming data will reinforce confidence amongst global investors "
    },
    {
        "content": "* Set overnight MCLR at 7.85 percent with effect from AUG 1 Source text: (http://bit.ly/2gnnoap) Further company coverage:",
        "date": "08022017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank set overnight MCLR at 7.85 pct with effect from Aug 1 "
    },
    {
        "content": "July 28 India's NSE index took a breather on Friday after hitting record highs in each of the previous four sessions  as disappointing quarterly earnings weighed on bank and pharmaceutical shares.",
        "date": "07282017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "Indian shares decline; Dr. Reddy's  ICICI Bank fall on weak Q1 "
    },
    {
        "content": "* Q1 net profit 20.49 bln rupees vs 20.43 bln rupees estimates",
        "date": "07272017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "UPDATE 2-India's ICICI Bank seeing \"positive\" trend on bad loans "
    },
    {
        "content": "July 27 India's ICICI Bank Chief Executive Chanda Kochhar says:",
        "date": "07272017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank says Q1 bad loan additions lowest in 7 qtrs "
    },
    {
        "content": "July 27 ICICI Bank Ltd  India's third-biggest lender by assets  reported an eight percent fall in its first-quarter profit but was slightly ahead of analysts' estimates.",
        "date": "07272017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank Q1 profit falls  but beats estimates "
    },
    {
        "content": "* June quarter net profit 20.49 billion rupees versus net profit of 22.32 billion rupees year ago",
        "date": "07272017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank June-qtr profit down 8 pct "
    },
    {
        "content": "* Joint venture agreement entered inter alia among Fairfax Financial Holdings Limited and ICICI Bank Limited has been terminated",
        "date": "07042017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank says joint venture agreement entered with Fairfax Financial Holdings has been terminated "
    },
    {
        "content": "* Says approved proposal for fund raising by way of issuance of senior unsecured long term bonds in nature of debentures Source text for Eikon: Further company coverage:",
        "date": "06202017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank approves proposal for issuance of senior unsecured long term bonds "
    },
    {
        "content": "* To consider fund raising by issuance of senior unsecured long term bonds on private placement basis Source text: (http://bit.ly/2rv8VA2) Further company coverage:",
        "date": "06152017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank to consider fund raising by issuance of senior unsecured long term bonds "
    },
    {
        "content": "* ICICI Bank exec says \"RBI's acknowledgement of downward shift in inflation trajectory is welcome\"",
        "date": "06072017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank exec says SLR cut  reduction in risk weights for housing loans \"positive moves\" "
    },
    {
        "content": "June 5 India's ICICI Bank Ltd and Canada's Fairfax Financial Holdings Ltd will pare their stakes in joint venture insurer ICICI Lombard General Insurance Co Ltd's planned initial public offering (IPO) of shares  the insurer said on Monday.",
        "date": "06052017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "UPDATE 1-ICICI Bank  Fairfax to pare stakes in Indian insurer ICICI Lombard IPO "
    },
    {
        "content": "June 5 India's ICICI Bank Ltd said on Monday its board had approved the sale of a part of its stake in ICICI Lombard General Insurance Co Ltd in an initial public offering.",
        "date": "06052017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank to sell part stake in insurer ICICI Lombard via IPO "
    },
    {
        "content": "* Says approved sale of a part of its shareholding in ICICI Lombard General Insurance Company Limited",
        "date": "06052017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank approves sale of part of stake in ICICI Lombard General Insurance in an IPO "
    },
    {
        "content": "* Seeks members' nod for issue of NCDs   non-convertible securitites up to INR 250 billion Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank seeks members' nod for issue of NCDs non-convertible securitites "
    },
    {
        "content": "* Seeks members' nod for increase in authorised share capital to 25 billion rupees Source text: http://bit.ly/2qWfPdB Further company coverage:",
        "date": "05092017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank seeks members' nod for issue of bonus shares "
    },
    {
        "content": "* Says approved proposed offshore borrowing plan for financial year 2017-18 Source text for Eikon: Further company coverage:",
        "date": "05102017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank approves proposed offshore borrowing plan for FY 2017-18 "
    },
    {
        "content": "* Says icici bank slashes home loan rates by upto 30 basis points",
        "date": "05152017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank slashes home loan rates by up to 30 basis points "
    },
    {
        "content": "* Says to consider offshore fund raising in single/multiple tranches Source text for Eikon: Further company coverage:",
        "date": "05052017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI bank to consider offshore fund raising "
    },
    {
        "content": "May 4 Indian shares ended higher on Thursday as bank stocks climbed on a government move to tackle surging bad loans  while ICICI Bank rallied 9 percent after it said additions to non-performing loans would be lower this year.",
        "date": "05042017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "Indian shares rise  ICICI Bank leads gains "
    },
    {
        "content": "* CEO sees bad loan additions FY18 significantly lower (Adds further details  CEO quote  free shares issue)",
        "date": "05032017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "UPDATE 2-India's ICICI Bank sees bad loan additions falling significantly "
    },
    {
        "content": "* CEO says \"drilled down\" list of potential troubled loans currently at 190.39 billion rupees",
        "date": "05032017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank: sees 2017/18 bad loan additions to be \"significantly lower\" "
    },
    {
        "content": "MUMBAI  May 3 ICICI Bank Ltd  India's third-biggest lender by assets  reported a smaller-than-expected growth in fourth-quarter net profit as bad loans rose.",
        "date": "05032017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank Q4 net profit jumps but lags estimates "
    },
    {
        "content": "* March quarter net profit 20.25 billion rupees versus net profit of 7.02 billion rupees year ago",
        "date": "05032017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank March-qtr profit rises about three-fold "
    },
    {
        "content": "* \"Some erroneous media reports have appeared that ICICI Bank has acquired 1.09% stake in Karnataka Bank\"",
        "date": "04122017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank says media reports on co buying 1.09 pct stake in Karnataka Bank \"erroneous\" "
    },
    {
        "content": "* Sets 1-year MCLR at 8.20 percent from April 1 Source text: http://bit.ly/2mIPBZk Further company coverage:",
        "date": "04032017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank sets 1-year MCLR at 8.20 pct from April 1 "
    },
    {
        "content": "* ICICI Bank partners with Truecaller to launch a UPI based mobile payment service  Source text:",
        "date": "03282017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank partners with Truecaller to launch UPI based mobile payment service "
    },
    {
        "content": "* India's ICICI Bank raises 34.25 bln rupees via private placement of additional Tier 1 bonds at 9.20 pct- stock exchange  Source text: http://bit.ly/2n3i4MN Further company coverage:",
        "date": "03162017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank raises 34.25 bln rupees via additional Tier 1 bonds "
    },
    {
        "content": "* Exec says gross bad loan additions in December quarter at 70.37 billion rupees",
        "date": "01312017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank exec says has watchlist loans of 275.36 billion rupees "
    },
    {
        "content": "* Gross non-performing loan ratio widens to 7.91 pct   (Adds net interest income  shares)",
        "date": "01312017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "UPDATE 1-India's ICICI Bank Q3 net profit falls 19 pct  bad loans rise "
    },
    {
        "content": "MUMBAI  Jan 31 ICICI Bank Ltd  India's No.2 lender by assets  said its third-quarter net profit fell 19 percent as bad loans rose  although the profit decline was smaller than expected.",
        "date": "01312017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank Q3 net falls 19 percent  bad loans rise "
    },
    {
        "content": "* Dec quarter gross NPA 7.91 percent versus 6.82 percent previous quarter",
        "date": "01312017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank Dec-qtr profit down about 19 pct "
    },
    {
        "content": "* ICICI Bank says PhonePe following restrictive practice of allowing only users of its own UPI handle to make payments on its app",
        "date": "01192017",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank says PhonePe following restrictive practice on payments "
    },
    {
        "content": "* NPCI's statement pertaining to ICICI Bank blocking PhonePe's UPI transactions",
        "date": "01192017",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-NPCI advises ICICI Bank to open UPI transactions immediately "
    },
    {
        "content": "* Sees significant reduction to loans to stressed cos in 6-9 mths   (Adds CEO comment  further details)",
        "date": "11072016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "UPDATE 2-India's ICICI Bank sees stressed corporate lending falling "
    },
    {
        "content": "* Exec says expects significant reduction in exposure to below invest-grade cos",
        "date": "11072016",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank exec says watch list loans now at 324.9 bln rupees "
    },
    {
        "content": "MUMBAI  Nov 7 ICICI Bank Ltd  India's biggest private-sector lender by assets  said on Monday its second-quarter profit rose 2.4 percent  beating analyst estimates  helped by lower tax expenses.",
        "date": "11072016",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank Q2 net profit up 2.4 pct; bad loans rise "
    },
    {
        "content": "* Sept quarter interest earned 136.39 billion rupees versus 130.99 billion rupees year ago",
        "date": "11072016",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank Sept-qtr profit up about 2 pct "
    },
    {
        "content": "* ICICI Bank UK Plc launches 'Money2India Europe' in Sweden  Norway and Denmark  Further company coverage:",
        "date": "10272016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank UK launches 'Money2India Europe' in Sweden  Norway  Denmark "
    },
    {
        "content": "* Says Infosys Finacle partners with Emirates NBD and ICICI Bank to launch first blockchain pilot network  Source text: http://bit.ly/2dkaE4m Further company coverage:    (Bengaluru newsroom)",
        "date": "10182016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-Infosys Ltd says Infosys Finacle partners with Emirates NBD  ICICI Bank "
    },
    {
        "content": "* Approved the appointment of Anup Bagchi as executive director of the bank  Source text: http://bit.ly/2dbLqFf Further company coverage:    (Bengaluru newsroom)",
        "date": "10142016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank appoints Anup Bagchi as executive director "
    },
    {
        "content": "DUBAI  Oct 12 Dubai's largest bank  Emirates NBD   is working with India's ICICI on a pilot project to use blockchain technology for global remittances and trade finance  in what they say is a first for banks from the Middle East and India.",
        "date": "10122016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "Dubai's Emirates NBD joins India's ICICI on blockchain project "
    },
    {
        "content": "Oct 4 ICICI Bank      * Reduces MCLR by 5 bps     * Says MCLR-based lending rate reduced effective Oct 1      SOURCE TEXT: ICICI Bank announced a reduction of 0.05 percent in ICICI Bank MCLR benchmarks effective from October 1  2016. I-MCLR benchmarks effective from Oct. 1  2016 are provided below:     Benchmark     Benchmark     Benchmark     tenure         name       rate p.a.  Overnight     I-MCLR-ON        8.85%  One month     I-MCLR-1M        8.85%  Three months  I-MCLR-3M      ",
        "date": "10042016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank cuts MCLR-based lending rate by 5 bps "
    },
    {
        "content": "MUMBAI  Aug 25 India's central bank on Thursday retained State Bank of India and ICICI Bank  the nation's top two lenders by assets  as \"domestic systemically important banks\"  or the equivalent as \"too big to fail\" for a second consecutive year.",
        "date": "08252016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "India cenbank retains 'too big to fail' status for SBI  ICICI Bank "
    },
    {
        "content": "Aug 2 Indian shares ended slightly lower on Tuesday as investors saw recent strong gains as overdone  though sentiment was broadly supported by hopes parliament will soon pass a revamped goods and services tax.",
        "date": "08022016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "Indian shares end slightly lower; ICICI Bank falls "
    },
    {
        "content": "* Bad loans surge on central bank clean-up order   (Adds details  CEO comment)",
        "date": "07292016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "UPDATE 1-India's ICICI Bank profit falls as bad loan provisions surge "
    },
    {
        "content": "MUMBAI  July 29 ICICI Bank Ltd  India's top private sector lender by assets  said quarterly profit fell 25 percent as its bad loans ticked up  although the decline was smaller than expected.",
        "date": "07292016",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank Q1 profit falls 25 pct  bad loans tick up "
    },
    {
        "content": "May 12 Indian shares closed higher on Thursday  led by lenders such as ICICI Bank  after the country's upper house of parliament passed a new bankruptcy code to address corporate debts and improve the ease of doing business.",
        "date": "05122016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "Indian shares end higher led by financials "
    },
    {
        "content": "* Sees  potential trouble in five sectors   (Adds management comment)",
        "date": "04292016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "UPDATE 2-India ICICI Bank's dim view of bad loans drives quarterly profit to decade low "
    },
    {
        "content": "* About 60 percent of about 70 billion rupees adds to bad loans in Q4 was due to RBI directed review",
        "date": "04292016",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank exec: completed RBI directed asset quality review "
    },
    {
        "content": "MUMBAI  April 29 ICICI Bank Ltd  India's biggest private sector lender by assets  reported a 76 percent fall in fourth-quarter net profit  lagging estimates  as it was weighed down by a surge in bad loans.",
        "date": "04292016",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank Q4 net profit plunges as bad loans surge "
    },
    {
        "content": "MUMBAI ICICI Bank Ltd   India's biggest private sector lender by assets  saw its bad loans surge in the December quarter on a central bank order to reclassify some troubled loan accounts  and predicted sour assets will rise further this quarter.",
        "date": "01282016",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "ICICI Bank sees more pain ahead after Q3 bad loan surge "
    },
    {
        "content": "* Bad loans surge in Q3 on cenbank's asset classification order",
        "date": "01282016",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "UPDATE 1-India's ICICI Bank sees more pain ahead after Q3 bad loan surge "
    },
    {
        "content": "MUMBAI  Jan 28 ICICI Bank Ltd  India's biggest private sector lender by assets  reported a surge in bad loans for the December quarter partly due to a central bank direction to reclassify some troubled loan accounts as bad loans.",
        "date": "01282016",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank bad loans jump in Q3; net profit in line with estimates "
    },
    {
        "content": "MUMBAI  Nov 17 Standard Chartered Plc  on Tuesday named Zarin Daruwala  a senior banker at India's top private sector lender ICICI Bank  as the new chief executive for its India operations.",
        "date": "11172015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "Standard Chartered names Daruwala as new India CEO "
    },
    {
        "content": "* Indian insurers seen raising PE money ahead of IPOs   (Adds details  context)",
        "date": "11162015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "UPDATE 1-India's ICICI to sell $296 mln stake in life unit to Temasek  Premji "
    },
    {
        "content": "* Says names Zarin Daruwala India CEO  Source text for Eikon: Standard Chartered announced the appointment of Zarin Daruwala as CEO of Standard Chartered Bank  India  following the appointment of Sunil Kaushal as Regional CEO for Africa and the Middle East. Zarin is currently President of the Wholesale Banking Group at ICICI Bank  and brings outstanding experience from her 25 years in the industry  having led teams in corporate banking  project finance  structured finance  financial institutions",
        "date": "11172015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "BRIEF-StanChart names ICICI's Zarin Daruwala as India CEO "
    },
    {
        "content": "MUMBAI  Nov 16 ICICI Bank  India's biggest private sector lender by assets  said on Monday it agreed to sell a 6 percent stake in its life insurance joint venture in two separate deals to billionaire Azim Premji and Singapore state investor Temasek.",
        "date": "11162015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "RPT-India's ICICI to sell stake in life insurance unit to Temasek  Premji "
    },
    {
        "content": "MUMBAI  Nov 16 ICICI Bank  India's biggest private sector lender by assets  said on Monday it agreed to sell a 6 percent stake in its life insurance joint venture in two separate deals to billionaire Azim Premji and Singapore state investor Temasek.",
        "date": "11162015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI to sell stake in life insurance unit to Temasek  Premji "
    },
    {
        "content": "* Sees corporate credit growth becoming a little better from here",
        "date": "10302015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-ICICI Bank CEO: sees domestic credit growth of 18-20 pct in FY16 "
    },
    {
        "content": "MUMBAI ICICI Bank Ltd  India's top private sector lender by assets  reported a 12 percent increase in quarterly profit due to faster retail loans growth.",
        "date": "10302015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "ICICI Bank Q2 net rises 12 pct on retail loans growth "
    },
    {
        "content": "* Agrees to sell 9 pct in gen insurance JV to partner Fairfax",
        "date": "10302015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "UPDATE 1-ICICI Bank Q2 net rises 12 pct on retail loans growth "
    },
    {
        "content": "MUMBAI  Oct 30 ICICI Bank Ltd  India's top private sector lender by assets  reported a 12 percent increase in quarterly profit due to faster retail loans growth.",
        "date": "10302015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank Q2 net up 12 pct  in line with estimates "
    },
    {
        "content": "* To cut base rate by 35 bps to 9.35 percent effective October 5.  Further company coverage:",
        "date": "10012015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "BRIEF-India's ICICI Bank to cut base rate by 35 bps "
    },
    {
        "content": "MUMBAI  Aug 31 India's central bank listed State Bank of India and ICICI Bank as the country's two \"systemically important banks\"  lining them up for tougher supervision to avoid collapses that would rattle the financial system and economy.",
        "date": "08312015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "India cenbank names SBI  ICICI as 'systemically important' lenders "
    },
    {
        "content": "MUMBAI  July 24 Indian shares ended nearly 1 percent lower on Friday  dragged down by ICICI Bank on concerns over its exposure to debt-laden Jaiprakash Group  while Reliance Industries fell ahead of its quarterly results later in the day.",
        "date": "07242015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "Indian shares fall nearly 1 pct; ICICI Bank slumps "
    },
    {
        "content": "MUMBAI ICICI Bank Ltd  said on Friday it saw the rate of new troubled loans slowing as the nation's biggest private sector lender by assets reported a better-than-expected quarterly profit.",
        "date": "07312015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "ICICI Bank sees slower rate of new troubled loans "
    },
    {
        "content": "SHANGHAI Officials from the world's largest emerging nations launched the New Development Bank (NDB) on Tuesday  the second of two new policy banks heavily backed by Beijing that are being pitched as alternatives to existing institutions such as the World Bank. | Video ",
        "date": "07212015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "'BRICS' bank launches in Shanghai  to work with AIIB "
    },
    {
        "content": "* Q1 net profit 29.76 bln rupees vs 29.2 bln analysts' estimate",
        "date": "07312015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "UPDATE 2-India's ICICI Bank sees slower rate of new troubled loans "
    },
    {
        "content": "MUMBAI  July 31 ICICI Bank Ltd  India's biggest private sector lender by assets  reported a 12 percent rise in quarterly profit  beating estimates  and its bad loan ratio fell sequentially  sending its shares higher by more than 5 percent.",
        "date": "07312015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank Q1 net beats estimates  bad loans ease "
    },
    {
        "content": "MUMBAI ICICI Bank Ltd   India's biggest private sector lender by assets  said on Friday it keeps receiving enquiries from potential suitors for its home finance unit but has yet to decide on whether to sell its stake.",
        "date": "07102015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "ICICI Bank says getting enquiries for home finance unit stake "
    },
    {
        "content": "MUMBAI  July 10 ICICI Bank Ltd  India's biggest private sector lender by assets  said on Friday it keeps receiving enquiries from potential suitors for its home finance unit but has yet to decide on whether to sell its stake.",
        "date": "07102015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank says getting enquiries for home finance unit stake "
    },
    {
        "content": "MUMBAI ICICI Bank Ltd   India's biggest private sector lender by assets  on Saturday opened its first branch in China as trade between Asia's two key economies flourishes.",
        "date": "05162015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "ICICI bank opens first branch in China "
    },
    {
        "content": "MUMBAI  May 16 ICICI Bank Ltd  India's biggest private sector lender by assets  on Saturday opened its first branch in China as trade between Asia's two key economies flourishes.",
        "date": "05162015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI bank opens first branch in China "
    },
    {
        "content": "NEW DELHI India has named private banker K.V. Kamath as the first head of a new development bank being set up by the BRICS group of emerging market economies  Finance Secretary Rajiv Mehrishi told reporters on Monday.",
        "date": "05112015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "India picks private banker KV Kamath as first BRICS bank head "
    },
    {
        "content": "* Sees corporate credit demand improving  retail faster   (Adds CEO comments)",
        "date": "04272015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "UPDATE 2-India's ICICI Bank sees bad loans situation improving "
    },
    {
        "content": "MUMBAI  April 27 ICICI Bank Ltd  India's biggest private sector lender by assets  reported a 10 percent rise in quarterly net profit on Monday  beating analyst estimates  on growing demand for credit in Asia's third-largest economy.",
        "date": "04272015",
        "name": "ICICI Bank Limited",
        "news_type": "normal",
        "symbol": "IBN",
        "title": "India's ICICI Bank Q4 net profit up 10 pct  beats estimates "
    },
    {
        "content": "MUMBAI  April 7 ICICI Bank Ltd  India's biggest private sector lender by assets  will cut its base lending rate by 25 basis points to 9.75 percent  effective Friday  it said on Tuesday.",
        "date": "04072015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "India's ICICI Bank says to cut base lending rate by 25 bps "
    },
    {
        "content": "MUMBAI  March 11 ICICI Bank Ltd  India's largest private-sector lender  is in talks to sell part of its stake in a life insurance joint venture to Temasek Holdings Pte and Carmignac Gestion for about $300 million  according to a Bloomberg report.",
        "date": "03112015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "Temasek  Carmignac in talks over ICICI insurance unit stake -report "
    },
    {
        "content": "MUMBAI  Jan 30 ICICI Bank Ltd  India's biggest private-sector lender  booked a 14 percent rise in quarterly profit on Friday  roughly matching analyst estimates and setting a record  as growth in income from interest and fees outpaced growth in bad loans.",
        "date": "01302015",
        "name": "ICICI Bank Limited",
        "news_type": "topStory",
        "symbol": "IBN",
        "title": "India's ICICI Bank sets quarterly record profit as Q3 net rises 14 pct "
    }
]