[
    {
        "content": "NEW YORK  Nov 8 A U.S. Attorney's office has opened an investigation into activities by Carl Icahn and his businesses related to the country's biofuels program while the billionaire investor was serving as an advisor to President Donald Trump.",
        "date": "11082017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "CORRECTED-UPDATE 1-U.S. Attorney's office probes billionaire Icahn on biofuels activity -filing "
    },
    {
        "content": "NEW YORK  Nov 8 The U.S. Attorney's office for the Southern District of New York is seeking information from billionaire investor Carl Icahn and his firm Icahn Enterprises L.P. related to activities around the country's biofuels program.",
        "date": "11082017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "CORRECTED-U.S. attorney's office probes billionaire Icahn on biofuels activity -filing "
    },
    {
        "content": "NEW YORK Billionaire investor Carl Icahn has been subpoenaed by the U.S. Justice Department over his efforts to overhaul the U.S. biofuels program during his time as an unpaid adviser to President Donald Trump  his company said in a securities filing.",
        "date": "11092017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn subpoenaed by U.S. on biofuels dealing: filing "
    },
    {
        "content": "NEW YORK  Nov 8 Billionaire investor Carl Icahn has been subpoenaed by the U.S. Justice Department over his efforts to overhaul the U.S. biofuels program during his time as an unpaid adviser to President Donald Trump  his company said in a securities filing.",
        "date": "11092017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 3-Icahn subpoenaed by U.S. on biofuels dealing -filing "
    },
    {
        "content": "NEW YORK Carl Icahn's oil refining company CVR Energy has significantly unwound a large short position in the U.S. biofuel credit market  more than halving its outstanding blending obligation  the company said on Wednesday.",
        "date": "11012017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn refinery cuts biofuels short amid reform standstill "
    },
    {
        "content": "* Icahn Enterprises L.P. Reports third quarter 2017 financial results",
        "date": "11032017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises reports Q3 revenue $5.7 bln "
    },
    {
        "content": "NEW YORK  Nov 1 Carl Icahn's oil refining company CVR Energy has significantly unwound a large short position in the U.S. biofuel credit market  more than halving its outstanding blending obligation  the company said on Wednesday.",
        "date": "11012017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-Icahn refinery cuts biofuels short amid reform standstill "
    },
    {
        "content": "* Icahn Enterprises Lp Acquires American Driveline Systems  franchisor of AAMCO and Cottman Service Centers",
        "date": "10022017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn enterprises acquires American Driveline Systems "
    },
    {
        "content": "WASHINGTON (Reuters Breakingviews) - Neither Carl Icahn nor Donald Trump is looking good in a fight over biofuels regulations. The billionaire investor wanted rules changed to help CVR Energy  a refiner he controls. Icahn resigned on Friday as the president’s adviser on deregulation just ahead of a New Yorker story detailing these alleged conflicts of interest. The picture gets even murkier because the White House now seems to be saying there was no job for Icahn to quit.",
        "date": "08212017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Breakingviews-Icahn and Trump both look bad in biofuels fight "
    },
    {
        "content": "Aug 18 Billionaire investor Carl Icahn ended his role as a special adviser to U.S. President Donald Trump on Friday after facing criticism that policy recommendations he offered could help his own investments.",
        "date": "08182017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "UPDATE 3-Investor Carl Icahn steps down as adviser to U.S. President Trump "
    },
    {
        "content": "* Says qtrly ‍net income attributable to Icahn enterprises $9.51 per depositary unit​ Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "08082017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises LP posts Q2 revenue of $6.7 billion "
    },
    {
        "content": "WASHINGTON/NEW YORK  Aug 3 The Environmental Protection Agency will reject a proposal backed by billionaire Carl Icahn and a handful of refining companies to overhaul the U.S. biofuels program  in a victory for big ethanol producers that had fought to defend the existing policy  three sources familiar matter told Reuters on Thursday.",
        "date": "08032017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "UPDATE 3-U.S. to reject biofuel program tweak in snub to Icahn -sources "
    },
    {
        "content": "* Tropicana Entertainment and Icahn Enterprises L.P. announce extension of modified Dutch auction tender offer for up to 5 580 000 shares of common stock of tropicana entertainment",
        "date": "08032017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "BRIEF-Tropicana Entertainment and Icahn Enterprises L.P. announce extension of modified Dutch auction tender offer "
    },
    {
        "content": "NEW YORK  Aug 9 Investors have built up a large short position in investor Carl Icahn’s oil refining company  CVR Energy  in the past three months  according to Reuters data  as evidence mounts that the company’s gamble on the biofuels market is going sour.",
        "date": "08092017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Shorting the short: Investors bet against Icahn's oil refiner after biofuel trade "
    },
    {
        "content": "June 26 Billionaire Carl Icahn's investment firm  Icahn Enterprises LP  said on Monday it had entered an agreement with the former co-manager of its Sargon Portfolio  David Schechter  to fund his new private investment management business.",
        "date": "06262017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Carl Icahn to fund former Sargon co-manager Schechter's new venture "
    },
    {
        "content": "* Tropicana Entertainment and Icahn Enterprises L.P. announce commencement of modified Dutch auction tender offer for up to 5 580 000 shares of common stock of Tropicana Entertainment",
        "date": "06232017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Tropicana Entertainment and Icahn Enterprises L.P. announce commencement of modified Dutch auction tender offer for up to 5 580 000 shares of common stock of Tropicana Entertainment "
    },
    {
        "content": "* Icahn Enterprises L.P. provides update on arrangements with Brett Icahn and David Schechter",
        "date": "06262017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises provides update on arrangements with Brett Icahn  David Schechter "
    },
    {
        "content": "Billionaire investor Carl Icahn is backing off his demand to break up insurance giant American International Group Inc   following the company's sale of assets and hiring of a new chief executive officer  a person familiar with the matter said.",
        "date": "06292017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Billionaire investor Icahn backs off demand for AIG breakup: source "
    },
    {
        "content": "June 29 Billionaire investor Carl Icahn is backing off his demand to break up insurance giant American International Group Inc  following the company's sale of assets and hiring of a new chief executive officer  a person familiar with the matter said.",
        "date": "06292017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Billionaire investor Icahn backs off demand for AIG breakup -source "
    },
    {
        "content": "* Icahn said to ease off demand for AIG breakup after CEO switch - Bloomberg  citing sources",
        "date": "06292017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "BRIEF-Icahn said to ease off demand for AIG breakup after CEO switch - Bloomberg "
    },
    {
        "content": "* RAISES EUR 1.6 MILLION IN CAPITAL INCREASE SUBSCIBED TO FOR MOST PART BY NEXTAGE ASSET MANAGEMENT AND 123 INVESTMENT MANAGERS Source text: http://bit.ly/2s4E1Lc Further company coverage: (Gdynia Newsroom:)",
        "date": "06292017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "BRIEF-Les Toques Blanches du Monde raises 1.6 million euros in capital increase "
    },
    {
        "content": "WASHINGTON  June 6 Five Democratic senators asked the Environmental Protection Agency in a letter on Tuesday to hand over documents relating to the role of Carl Icahn  a refining company owner  in shaping biofuels policy at the agency.",
        "date": "06062017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "U.S. senators press EPA for documents on Icahn's biofuel dealings "
    },
    {
        "content": "WASHINGTON The U.S. Commodity Futures Trading Commission informed eight Democratic U.S. senators last month that it is not investigating biofuels credits after the lawmakers had urged it to probe billionaire Carl Icahn's activity in that market  according to a copy of a letter seen by Reuters on Monday.",
        "date": "06052017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "U.S. CFTC says it is not probing Icahn's activity in biofuels credits "
    },
    {
        "content": "* Icahn Automotive enters into definitive agreement to acquire precision Auto Care  Inc",
        "date": "06022017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises says Icahn Automotive to acquire precision Auto Care "
    },
    {
        "content": "WASHINGTON The U.S. Commodity Futures Trading Commission informed eight Democratic U.S. senators last month that it is not investigating biofuels credits after the lawmakers had urged it to probe billionaire Carl Icahn's activity in that market  according to a copy of a letter seen by Reuters on Monday.",
        "date": "06052017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "CFTC says it is not probing Icahn's activity in biofuels credits "
    },
    {
        "content": "WASHINGTON  June 5 The U.S. Commodity Futures Trading Commission informed eight Democratic U.S. senators last month that it is not investigating biofuels credits after the lawmakers had urged it to probe billionaire Carl Icahn's activity in that market  according to a copy of a letter seen by Reuters on Monday.",
        "date": "06052017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-U.S. CFTC says it is not probing Icahn's activity in biofuels credits "
    },
    {
        "content": "NEW YORK Billionaire investor Carl Icahn acquired a new 19.8 million share stake in business services provider Conduent Inc  in the first quarter and sold out of pharmaceutical firm Allergan Plc  and speech technology group Nuance Communications Inc   according to regulatory filings on Monday.",
        "date": "05162017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn takes new 19.8 million share stake in Conduent in first quarter "
    },
    {
        "content": "NEW YORK  May 15 Billionaire investor Carl Icahn acquired a new 19.8 million share stake in business services provider Conduent Inc in the first quarter and sold out of pharmaceutical firm Allergan Plc and speech technology group Nuance Communications Inc  according to regulatory filings on Monday.",
        "date": "05152017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn takes new 19.8 mln share stake in Conduent in 1st quarter "
    },
    {
        "content": "WASHINGTON Eight Democratic senators asked U.S. regulators on Tuesday to launch an investigation into billionaire Carl Icahn’s activities in the U.S. biofuels blending credit market  saying the activist investor may have violated trading laws since becoming an adviser to President Donald Trump.",
        "date": "05092017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "U.S. Democratic senators seek probe into Icahn’s biofuel credit dealings "
    },
    {
        "content": "WASHINGTON  May 9 Eight Democratic senators asked U.S. regulators on Tuesday to launch an investigation into billionaire Carl Icahn’s activities in the U.S. biofuels blending credit market  saying the activist investor may have violated trading laws since becoming an adviser to President Donald Trump.",
        "date": "05092017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 4-U.S. Democratic senators seek probe into Icahn’s biofuel credit dealings "
    },
    {
        "content": "* Icahn enterprises l.p. Reports first quarter 2017 financial results",
        "date": "05092017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises qtrly loss of $0.12 per depositary unit "
    },
    {
        "content": "* Icahn Enterprises Lp says board of directors of its general partner has declared a quarterly distribution in amount of $1.50 per depositary unit",
        "date": "05042017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises declares a quarterly distribution "
    },
    {
        "content": "NEW YORK  May 1 Carl Icahn's big bet on falling prices for biofuels credits generated a rare profit in that area last quarter for the billionaire investor's refining company CVR Energy  according to public filings.",
        "date": "05012017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Big short position on biofuels generated profit for Icahn's refiner "
    },
    {
        "content": "Billionaire investor Carl Icahn's oil refining company  CVR Energy   made a massive bet in 2016 that prices for U.S. government biofuels credits would fall - just before Icahn started advising President Donald Trump on regulations driving that market.",
        "date": "04122017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Exclusive: Inside edge - Trump advisor Icahn's big bet against biofuels credits "
    },
    {
        "content": "Exclusive: Icahn bet against biofuel credits  then advised Trump on their regulations",
        "date": "04122017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Reuters Select: Inside edge - Trump adviser Icahn's big bet against biofuels credits "
    },
    {
        "content": "WASHINGTON  March 27 Several Democratic senators pressed billionaire investor Carl Icahn on Monday to clarify his role as an adviser to President Donald Trump  saying his position in the administration raised \"alarming\" questions about potential conflicts of interest with his stakes in the biofuels and pharmaceutical industries.",
        "date": "03272017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Senators press Icahn on White House influence  business conflicts "
    },
    {
        "content": "NEW YORK  March 3 The head of the Renewable Fuels Association says billionaire investor Carl Icahn told him last week President Donald Trump was about to issue an order overhauling the U.S. biofuels program - something both Icahn and the White House have denied.",
        "date": "03032017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "U.S. ethanol group clashes with Icahn over details of biofuels negotiation "
    },
    {
        "content": "* Icahn Enterprises L.P. announces definitive agreement to sell Trump Taj Mahal casino resort",
        "date": "03012017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises to sell Trump Taj Mahal Casino Resort "
    },
    {
        "content": "* Icahn Enterprises LP announces hiring of Dr. Richard C. Mulligan",
        "date": "03012017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises announces hiring of Dr. Richard C. Mulligan "
    },
    {
        "content": "Feb 27 Samuel Merksamer has left Icahn's hedge fund firm  according to an internal memo. He represents billionaire investor Carl Icahn on several corporate boards.",
        "date": "02272017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn representative to several corporate boards has left hedge fund "
    },
    {
        "content": "Billionaire investor Carl Icahn has taken a stake in Bristol-Myers Squibb Co  and sees the drugmaker as a possible takeover target  according to a report published on Tuesday that sent the company's shares from a loss to more than 2 percent higher.",
        "date": "02212017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn buys Bristol-Myers shares  adding to activist pressure "
    },
    {
        "content": "The Securities and Exchange Commission issued an unusual order this week to wrap up its investigation of CVR Energy  the fuel refiner Carl Icahn acquired in a hostile tender offer in 2012. The SEC concluded that CVR failed to give investors enough information about its fee agreement with the two investment banks it hired to help the company fend off Icahn’s takeover. CVR  according to the SEC  should have said in its SEC filings that the banks  Goldman Sachs and Deutsche Bank  would ",
        "date": "02172017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "SEC gives fuel to Icahn in malpractice battle with Wachtell "
    },
    {
        "content": "NEW YORK  Feb 14 CVR Energy Inc will not pay a penalty over allegations that it made inadequate disclosures to investors during its unsuccessful defense against billionaire Carl Icahn's 2012 hostile takeover  the U.S. Securities and Exchange Commission said on Tuesday.",
        "date": "02142017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "CVR settles SEC probe into disclosures tied to Icahn takeover "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn increased his holdings in Herbalife Ltd  and Hertz Global Holdings Inc  in the fourth quarter  and exited Voltari Corp .",
        "date": "02152017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn raises stakes in Herbalife  Hertz  cuts Freeport-McMoran in fourth quarter "
    },
    {
        "content": "NEW YORK  Feb 14 Billionaire activist investor Carl Icahn increased his holdings in Herbalife Ltd and Hertz Global Holdings Inc in the fourth quarter  and exited Voltari Corp.",
        "date": "02152017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Icahn raises stakes in Herbalife  Hertz  cuts Freeport-McMoran in 4Q "
    },
    {
        "content": "NEW YORK  Feb 6 Billionaire activist investor Carl Icahn said on Monday he planned to sell his shuttered Trump Taj Mahal casino in Atlantic City  New Jersey  likely bringing an end to his troubled relationship with the city.",
        "date": "02062017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Icahn to sell closed Trump Taj Mahal casino in Atlantic City "
    },
    {
        "content": "* Icahn Enterprises completes acquisition of Federal-Mogul  Source text for Eikon:  Further company coverage:",
        "date": "01232017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises completes acquisition of Federal-Mogul "
    },
    {
        "content": "The U.S. government is investigating dietary supplement maker Herbalife  over whether it violated foreign bribery laws while conducting business in China  the company revealed in a regulatory filing on Friday.",
        "date": "01202017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "U.S. investigating Herbalife over foreign bribery in China "
    },
    {
        "content": "Jan 20 The U.S. government is investigating dietary supplement maker Herbalife over whether it violated foreign bribery laws while conducting business in China  the company revealed in a regulatory filing on Friday.",
        "date": "01202017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 2-U.S. investigating Herbalife over foreign bribery in China "
    },
    {
        "content": "* Icahn Enterprises L.P. announces results of federal-mogul tender offer",
        "date": "01192017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises L.P. announces results of Federal-Mogul tender offer "
    },
    {
        "content": "* Icahn Enterprises L.P. announces extension of tender offer for all outstanding shares of common stock of Federal-Mogul Holdings Corporation  Source text for Eikon:  Further company coverage:",
        "date": "01182017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises announces extension of tender offer for all outstanding shares of common stock of Federal-Mogul Holdings "
    },
    {
        "content": "* Icahn Enterprises L.P. announces upsizing and pricing of senior notes",
        "date": "01122017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises announces upsizing and pricing of senior notes "
    },
    {
        "content": "* Icahn Enterprises L.P. - board of directors of its general partner approved a rights offering to raise proceeds of approximately $600 million",
        "date": "01102017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn enterprises l.p. Announces rights offering "
    },
    {
        "content": "* Icahn Enterprises L.P. - intends to commence an offering of $900 million in aggregate principal amount of senior notes due 2022 and senior notes due 2024",
        "date": "01102017",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises L.P. intends to offer new senior notes "
    },
    {
        "content": "Billionaire Carl Icahn's investment firm  Icahn Enterprises LP   sweetened its offer for a third time to buy shares of Federal-Mogul Holdings Corp  it does not already own.",
        "date": "01032017",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn sweetens offer for Federal-Mogul for third time "
    },
    {
        "content": "NEW YORK/WASHINGTON/BOSTON U.S. chief executives  already wrestling with a steady flow of activist investors in their board rooms  face a newly challenging landscape now that the loudest voice of the bunch will have the ear of the next president and his securities' rule makers.",
        "date": "12232016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn regulatory role gives activist investors strong Washington voice "
    },
    {
        "content": "Billionaire Carl Icahn will advise Donald Trump on rescinding what the activist investor called \"excessive regulation\" on U.S. businesses  the president-elect's transition team announced on Wednesday.",
        "date": "12222016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn tapped as Trump's special adviser on regulatory issues "
    },
    {
        "content": "Icahn Enterprises LP  said on Monday it would sell wholly owned subsidiary American Railcar Leasing LLC to SMBC Rail Services LLC in a deal based on an enterprise value of $2.78 billion and a fleet of about 29 000 railcars.",
        "date": "12192016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn to sell American Railcar for up to $3.36 billion "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn said the strong rally in U.S. stocks since Donald Trump captured the White House last week might be overdone  but that investors can expect the president-elect to be a consensus builder who can help fix Washington and improve the economy.",
        "date": "11172016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn lauds 'consensus builder' Trump  says rally may be overdone "
    },
    {
        "content": "NEW YORK  Nov 16 Billionaire activist investor Carl Icahn said the strong rally in U.S. stocks since Donald Trump captured the White House last week might be overdone  but that investors can expect the president-elect to be a consensus builder who can help fix Washington and improve the economy.",
        "date": "11162016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "REUTERS SUMMIT-Icahn lauds 'consensus builder' Trump  says rally may be overdone "
    },
    {
        "content": "NEW YORK/WASHINGTON  Nov 15 Longtime Donald Trump supporter and activist investor Carl Icahn confirmed on Tuesday that the president-elect is looking at Wall Street veteran Steven Mnuchin as his choice for treasury secretary and billionaire Wilbur Ross for commerce secretary.",
        "date": "11152016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "UPDATE 2-Trump eyeing Mnuchin and Ross for economy jobs - Icahn "
    },
    {
        "content": "NEW YORK  Nov 16 Shares of auto parts maker Federal-Mogul Holdings Corp slid 5 percent on Wednesday  after Carl Icahn told Reuters that Icahn Enterprise LP is considering pulling its $9.25 per share offer for the company.",
        "date": "11162016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "REUTERS SUMMIT-Federal-Mogul shares drop after Icahn says may pull offer "
    },
    {
        "content": "* Icahn Enterprises L.P. announces extension of tender offer for all outstanding shares of common stock of Federal-Mogul Holdings Corporation at $9.25 per share in cash",
        "date": "11152016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises announces extension of tender offer "
    },
    {
        "content": "* Icahn Enterprises L.P. announces extension of tender offer for all outstanding shares of common stock of federal-mogul holdings corporation at $9.25 per share in cash",
        "date": "10312016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises extends tender offer for all outstanding shares of common stock of Federal-Mogul Holdings Corp at $9.25 per share in cash "
    },
    {
        "content": "* Icahn Enterprises L.P. reports third quarter 2016 financial results",
        "date": "11032016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises reports Q3 net loss $0.12/depositary unit "
    },
    {
        "content": "* Says announces extension of tender offer for all outstanding shares of common stock of federal-mogul holdings corporation",
        "date": "10122016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises- extension of tender offer for Federal-Mogul Holdings oustanding shares "
    },
    {
        "content": "* Carl Icahn issues statement regarding closing of the Taj mahal",
        "date": "10102016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Carl Icahn issues statement regarding closing of The Taj Mahal "
    },
    {
        "content": "* Announces commencement of tender offer for all outstanding shares of common stock of Federal-Mogul Holdings Corporation at $9.25 per share in cash  Source text for Eikon:  Further company coverage:",
        "date": "09262016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises commences tender offer for Federal-Mogul shares "
    },
    {
        "content": "* Files for mixed shelf of up to $1.0 billion - SEC filing  Source: (http://bit.ly/2cAk8Er) Further company coverage:",
        "date": "09092016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises files for mixed shelf of up to $1.0 bln "
    },
    {
        "content": "Billionaire Carl Icahn's investment firm  Icahn Enterprises LP   said it would buy the remaining 18 percent of auto parts maker Federal-Mogul Holdings Corp  for $9.25 per share  at a time when a slide in crude prices weighs on its energy business.",
        "date": "09062016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn Enterprises to buy rest of Federal-Mogul for $9.25/share "
    },
    {
        "content": "Sept 6 Billionaire Carl Icahn's investment firm  Icahn Enterprises LP  said it would buy the remaining 18 percent of auto parts maker Federal-Mogul Holdings Corp  for $9.25 per share  at a time when a slide in crude prices weighs on its energy business.",
        "date": "09062016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-Icahn Enterprises to buy rest of Federal-Mogul for $9.25/share "
    },
    {
        "content": "Carl Icahn said he did not attempt to sell his Herbalife Ltd  stake  and had instead bought more shares in the health supplements maker  rejecting hedge fund manager Bill Ackman's claim that he had been offered some of Icahn's shares.",
        "date": "08262016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn denies attempt to sell Herbalife stock  buys more shares "
    },
    {
        "content": "* Icahn says bought another 2.3 mln Herbalife shares on Friday",
        "date": "08262016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 3-Icahn denies attempt to sell Herbalife stock  buys more shares "
    },
    {
        "content": "* Reports second quarter 2016 financial results  Source text for Eikon:  Further company coverage:",
        "date": "08042016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises reports Q2 2016 financial results "
    },
    {
        "content": "Aug 3 Atlantic City's Trump Taj Mahal casino  owned by Carl Icahn  will close at the end of the summer  the billionaire investor's company said on Wednesday.",
        "date": "08032016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "UPDATE 2-Icahn to close Trump Taj Mahal casino in Atlantic City "
    },
    {
        "content": "* Co-Manager agreements with Brett Icahn and David Schechter expired on July 31  2016 in accordance and in full compliance with their terms and conditions.",
        "date": "08012016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises confirms arrangements with Brett Icahn and David Schechter "
    },
    {
        "content": "Carl Icahn's Icahn Enterprises LP  said on Monday that the billionaire investor's son  Brett Icahn  and David Schechter were no longer co-managers of the Sargon Portfolio  and would instead stay on as consultants for now.",
        "date": "08012016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Icahn Enterprises: Brett Icahn  Schechter no longer run Sargon portfolio "
    },
    {
        "content": "* On june 17  delivered letter to federal-mogul holdings' board increasing its offer to acquire remaining shares of co's common stock",
        "date": "06202016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises increases offer to buy remaining shares of Federal-Mogul "
    },
    {
        "content": "Workers at four casinos in Atlantic City  New Jersey's gambling hub  voted overwhelmingly on Thursday to authorize a strike if they are not offered what they consider to be a fair contract by the start of the busy July 4 holiday weekend.",
        "date": "06172016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Workers at four Atlantic City casinos vote to strike "
    },
    {
        "content": "June 16 Workers at four casinos in Atlantic City  New Jersey's gambling hub  voted overwhelmingly on Thursday to authorize a strike if they are not offered what they consider to be a fair contract by the start of the busy July 4 holiday weekend.",
        "date": "06172016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 4-Workers at four Atlantic City casinos vote to strike "
    },
    {
        "content": "WASHINGTON  May 31 The U.S. Supreme Court on Tuesday rejected a union's appeal of a lower court's ruling that allowed Atlantic City's Trump Taj Mahal casino  founded by Donald Trump but now owned by billionaire investor Carl Icahn  to break its contract with union workers to secure a bankruptcy rescue deal.",
        "date": "05312016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "U.S. top court rejects union appeal over Trump casino bankruptcy "
    },
    {
        "content": "NEW YORK  May 17 U.S. ratings agency Standard & Poor's on Tuesday cut the credit rating of billionaire investor Carl Icahn's Icahn Enterprises to junk status after the portfolio absorbed declining investment values and higher leverage in the last few months.",
        "date": "05172016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "S&P cuts Icahn Enterprises rating to junk  outlook stable "
    },
    {
        "content": "NEW YORK  May 17 U.S. ratings agency Standard & Poor's on Tuesday cut the credit rating of billionaire investor Carl Icahn's Icahn Enterprises to junk status after the portfolio absorbed declining investment values and higher leverage in the last few months.",
        "date": "05172016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-S&P cuts Icahn Enterprises rating to junk  outlook stable "
    },
    {
        "content": "* Icahn Enterprises L.P. reports first quarter 2016 financial results",
        "date": "05052016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises reports Q1 loss of $6.21/depositary unit "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn said Thursday he had sold his entire stake in Apple Inc   citing the risk of China's influence on the stock.",
        "date": "04292016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Carl Icahn says he sold entire Apple stake on China woes: CNBC "
    },
    {
        "content": "* On april 1  2016  in connection with closing of merger  partnership entered into a new $320 million senior term loan facility",
        "date": "04072016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-Icahn Enterprises on April 1  2016  in connection with closing of merger  partnership entered into a new $320 mln senior term loan facility "
    },
    {
        "content": "Billionaire Carl Icahn's investment company offered to buy the 18 percent of auto parts maker Federal-Mogul Holdings Corp  that it did not own for about $213 million  as it focuses on growing its auto business.",
        "date": "02292016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn offers to buy rest of Federal-Mogul to boost auto business "
    },
    {
        "content": "Feb 29 Billionaire Carl Icahn's investment company offered to buy the 18 percent of auto parts maker Federal-Mogul Holdings Corp that it did not own for about $213 million  as it focuses on growing its auto business.",
        "date": "02292016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "CORRECTED-UPDATE 2-Icahn offers to buy rest of Federal-Mogul to boost auto business "
    },
    {
        "content": "Feb 29 Auto parts maker Federal-Mogul Holdings Corp said it received a proposal from billionaire Carl Icahn's Icahn Enterprises L.P. to buy shares of the company it does not already own.",
        "date": "02292016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Icahn offers to buy remaining stake in Federal-Mogul "
    },
    {
        "content": "BOSTON U.S. ratings agency Standard & Poor's warned on Friday it may cut the credit rating of billionaire investor Carl Icahn's Icahn Enterprises to junk status after the portfolio absorbed heavy commodity sector losses in the last few months.",
        "date": "02192016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "S&P warns it may cut Icahn Enterprises to junk status  stock falls "
    },
    {
        "content": "BOSTON  Feb 19 U.S. ratings agency Standard & Poor's warned on Friday it may cut the credit rating of billionaire investor Carl Icahn's Icahn Enterprises to junk status after the portfolio absorbed heavy commodity sector losses in the last few months.",
        "date": "02192016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-S&P warns it may cut Icahn Enterprises to junk status  stock falls "
    },
    {
        "content": "NEW YORK/HOUSTON  Feb 19 Activist investors brave enough to have ventured into the volatile energy sector are paying a heavy price for their courage  stuck with hefty paper losses and no near-term recovery in sight.",
        "date": "02192016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-Activist investors take a beating in energy price rout "
    },
    {
        "content": "Lions Gate Entertainment Corp  the studio behind the \"Hunger Games\" movies and TV shows including \"Mad Men \" on Friday won the dismissal of a shareholder lawsuit claiming it fraudulently concealed a U.S. regulatory probe into how it thwarted a hostile takeover by billionaire Carl Icahn.",
        "date": "01222016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Lions Gate wins dismissal of lawsuit over SEC probe  Icahn bid "
    },
    {
        "content": "Billionaire activist investor Carl Icahn is building an equity stake in Time Warner Inc   people familiar with the matter said on Monday.",
        "date": "01122016",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn buying up Time Warner shares: sources "
    },
    {
        "content": "Jan 11 Billionaire activist investor Carl Icahn is building an equity stake in Time Warner Inc  people familiar with the matter said on Monday.",
        "date": "01122016",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "CORRECTED-UPDATE 2-Icahn buying up Time Warner shares - sources "
    },
    {
        "content": "* Indexes up: Dow 1.18 pct  S&P 1.11 pct  Nasdaq 1.38 pct   (Updates to afternoon)",
        "date": "12292015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "US STOCKS-Apple and Amazon push S&P 500 over 1 percent higher "
    },
    {
        "content": "* Indexes up: Dow 0.96 pct  S&P 0.88 pct  Nasdaq 1.05 pct   (Updates to early afternoon)",
        "date": "12292015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "US STOCKS-Tech rally drives indexes; S&P 500 positive for year "
    },
    {
        "content": "Carl Icahn's Icahn Enterprises LP has agreed to buy Pep Boys-Manny Moe & Jack for about $1 billion  the companies said on Wednesday  hours after Bridgestone Corp quit the race for the U.S. auto parts retailer.",
        "date": "12302015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn to buy Pep Boys for $1 billion after Bridgestone bows out "
    },
    {
        "content": "Activist investor Carl Icahn trumped Japanese tire maker Bridgestone Corp's  latest offer for Pep Boys-Manny Moe & Jack  by $1.50 per share  as the bidding war for the U.S. auto parts retailer continues.",
        "date": "12282015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Carl Icahn trumps Bridgestone's offer for Pep Boys again "
    },
    {
        "content": "* Indexes up: Dow 0.99 pct  S&P 0.91 pct  Nasdaq 1.11 pct   (Adds details  changes comment  updates prices)",
        "date": "12292015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "US STOCKS-S&P 500 turns positive for year; tech stocks rally "
    },
    {
        "content": "Dec 30 Carl Icahn's Icahn Enterprises LP  has agreed to buy Pep Boys-Manny Moe & Jack for about $1 billion  the companies said on Wednesday  hours after Bridgestone Corp quit the race for the U.S. auto parts retailer.",
        "date": "12302015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-Icahn to buy Pep Boys for $1 bln after Bridgestone bows out "
    },
    {
        "content": "Dec 30 Billionaire investor Carl Icahn's Icahn Enterprises LP has agreed to buy Pep Boys-Manny Moe & Jack for about $1 billion  hours after Bridgestone Corp  quit the race for the U.S. auto parts retailer.",
        "date": "12302015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "REFILE-Icahn to buy Pep Boys for $1 bln after Bridgestone bows out "
    },
    {
        "content": "Dec 28 Activist investor Carl Icahn trumped Japanese tire maker Bridgestone Corp's latest offer for Pep Boys-Manny Moe & Jack by $1.50 per share  as the bidding war for the U.S. auto parts retailer continues.",
        "date": "12282015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-Carl Icahn trumps Bridgestone's offer for Pep Boys again "
    },
    {
        "content": "* Indexes up: Dow 0.90 pct  S&P 0.80 pct  Nasdaq 0.69 pct   (Updates to open)",
        "date": "12292015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "US STOCKS-Indexes higher as crude prices recover slightly "
    },
    {
        "content": "Japanese tire maker Bridgestone Corp  raised its offer for Pep Boys-Manny  Moe & Jack  to about $947 million  trumping activist investor Carl Icahn's current $900 million bid.",
        "date": "12242015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Bridgestone raises offer for Pep Boys  trumps Icahn "
    },
    {
        "content": "* Futures up: Dow 129 pts  S&P 13.75 pts  Nasdaq 31 pts   (Adds details  comment  updates prices)",
        "date": "12292015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "US STOCKS-Indexes set for higher open as crude prices steady "
    },
    {
        "content": "Dec 24 Japanese tire maker Bridgestone Corp  raised its offer to buy U.S. auto parts maker Pep Boys-Manny Moe & Jack to $947 million  still below a possible sweetened offer by activist investor Carl Icahn.",
        "date": "12242015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 2-Bridgestone raises offer for Pep Boys to $947 mln "
    },
    {
        "content": "Carl Icahn offered to buy Pep Boys–Manny  Moe & Jack  in a deal valuing the U.S. auto parts retailer at about $837 million  trumping Japanese tire maker Bridgestone Corp's  offer of $810 million.",
        "date": "12072015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn trumps Bridgestone with $837 million offer for Pep Boys "
    },
    {
        "content": "Dec 7 Carl Icahn offered to buy Pep Boys-Manny  Moe & Jack in a deal valuing the U.S. auto parts retailer at about $837 million  trumping Japanese tire maker Bridgestone Corp's offer of $810 million.",
        "date": "12072015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-Icahn trumps Bridgestone with $837 mln offer for Pep Boys "
    },
    {
        "content": "Dec 7 Carl Icahn's Icahn Enterprises LP  offered to buy auto parts company Pep Boys - Manny  Moe & Jack  in a deal valued at about $837 million.",
        "date": "12072015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "CORRECTED-Icahn Enterprises offers to buy Pep Boys in $837 mln deal "
    },
    {
        "content": "Billionaire activist investor Carl Icahn said he is betting against high-yield bonds  as he sees a bubble among companies that have overborrowed recently  and expects the dollar to keep rallying into next year.",
        "date": "11182015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn betting against high yield  sees dollar rising "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn said that knowledge is power in the field of investing  and cited his short bet against the euro  while Bonnie Baha of DoubleLine Capital said U.S. economic conditions were worse than three years ago.",
        "date": "11192015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Highlights Day 3: Shorting the euro  weak conditions in U.S "
    },
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit  click on http://www.reuters.com/summit/Investment16   (Adds comments and background on AIG; comments on Apple and Valeant shares  Federal Reserve)",
        "date": "11182015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "REUTERS SUMMIT-Icahn betting against high yield  sees dollar rising "
    },
    {
        "content": "U.S. miner Freeport-McMoRan Inc said on Wednesday it will add two new directors to its board under an agreement with billionaire Carl Icahn  bowing to pressure from the activist investor  who is the company's largest shareholder.",
        "date": "10072015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Freeport shares soar as Icahn execs gain seats on miner's board "
    },
    {
        "content": "Oct 7 U.S. miner Freeport-McMoRan Inc  said on Wednesday it will add two new directors to its board under an agreement with billionaire Carl Icahn  bowing to pressure from the activist investor  who is the company's largest shareholder.",
        "date": "10072015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 2-Freeport shares soar as Icahn execs gain seats on miner's board "
    },
    {
        "content": "* eQ Finnish Real Estate (AIF) acquires K-citymarket and K-rauta properties in Hämeenlinna from a Nordic Real Estate Partners managed fund for 48 million euros ($52.48 million)   Source text for Eikon:",
        "date": "05282015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "BRIEF-eQ Finnish Real Estate buys properties in Hämeenlinna for EUR 48 mln "
    },
    {
        "content": "In an uncharacteristic move  activist investor Carl Icahn's Icahn Enterprises LP  made a $100 million investment in Lyft Inc.  adding momentum to the ride-sharing company's rapid expansion but leaving its cash pile far behind rival Uber.",
        "date": "05152015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Carl Icahn invests $100 million in ride-sharing service Lyft "
    },
    {
        "content": "May 15 In an uncharacteristic move  activist investor Carl Icahn's Icahn Enterprises LP made a $100 million investment in Lyft Inc.  adding momentum to the ride-sharing company's rapid expansion but leaving its cash pile far behind rival Uber.",
        "date": "05152015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "REFILE-UPDATE 2-Carl Icahn invests $100 mln in ride-sharing service Lyft "
    },
    {
        "content": "May 15 Ride-sharing company Lyft Inc said it raised $150 million  led by a $100 million investment from activist investor Carl Icahn's Icahn Enterprises LP.",
        "date": "05152015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "Carl Icahn invests $100 mln in ride-sharing service Lyft "
    },
    {
        "content": "March 23 Activist investor Carl Icahn raised his stake in Chesapeake Energy Corp to almost 11 percent even as the company continues to cope with low oil and gas prices.",
        "date": "03232015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn raises stake in Chesapeake Energy to 11 pct "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn's publicly traded investment fund posted its first annual loss since 2008 last year  undone by plummeting oil prices  the company said in a regulatory filing on Friday. | Video ",
        "date": "02272015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Icahn's investment fund posts first loss since 2008 on oil plunge "
    },
    {
        "content": "NEW YORK  Feb 27 Billionaire activist investor Carl Icahn's publicly traded investment fund posted its first annual loss since 2008 last year  undone by plummeting oil prices  the company said in a regulatory filing on Friday.",
        "date": "02272015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-Icahn's investment fund posts first loss since 2008 on oil plunge "
    },
    {
        "content": "Feb 27 Billionaire Carl Icahn's publicly traded investment fund posted a loss in 2014  undone by plummeting oil prices  the company said in a regulatory filing on Friday.",
        "date": "02272015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "CORRECTED-Icahn posts loss as fund hit in 2014 by oil plunge "
    },
    {
        "content": "NEW YORK The Securities and Exchange Commission is investigating whether CVR Energy Inc  might have made misleading disclosures to investors during its unsuccessful defense against billionaire Carl Icahn's 2012 hostile takeover  court documents show.",
        "date": "02112015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "SEC probes disclosures tied to Icahn takeover of CVR: U.S. filing "
    },
    {
        "content": "NEW YORK  Feb 11 The U.S. Securities and Exchange Commission is investigating whether CVR Energy Inc  might have made misleading disclosures to investors during its unsuccessful defense against billionaire Carl Icahn's 2012 hostile takeover  court documents show.",
        "date": "02112015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "SEC probes disclosures tied to Icahn takeover of CVR - US filing "
    },
    {
        "content": "Feb 10 Canadian stocks were set to open higher on Tuesday as March futures on the S&P TSX index were up 0.65 percent at 7:15 a.m. ET.",
        "date": "02102015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "CANADA STOCKS-TSX set to open higher "
    },
    {
        "content": "Canada's Uni-Select Inc  said it would sell its U.S. auto parts distribution business to activist investor Carl Icahn's investment company Icahn Enterprises LP  for about $340 million.",
        "date": "02092015",
        "name": "Icahn Enterprises LP",
        "news_type": "topStory",
        "symbol": "IEP",
        "title": "Uni-Select to sell U.S. auto parts business to Icahn Enterprises "
    },
    {
        "content": "Feb 9 Canada's Uni-Select Inc said it would sell its U.S. auto parts distribution business to activist investor Carl Icahn's investment company Icahn Enterprises LP  for about $340 million.",
        "date": "02092015",
        "name": "Icahn Enterprises LP",
        "news_type": "normal",
        "symbol": "IEP",
        "title": "UPDATE 1-Uni-Select to sell U.S. auto parts business to Icahn Enterprises "
    }
]