[
    {
        "content": "* Grubhub-Collaboration with ihg to offer ihg rewards club members point-earning benefits for ordering food on grubhub via ihg's online mobile channels​ Source text for Eikon: Further company coverage:",
        "date": "11152017",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "BRIEF-Grubhub announces collaboration with InterContinental Hotels "
    },
    {
        "content": "* INTERCONTINENTAL HOTELS GROUP PLC - ‍GLOBAL Q3 COMPARABLE REVPAR 1 UP 2.3 PCT  AND UP 2.2 PCT Q3 YTD​",
        "date": "10202017",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "BRIEF-Hotelier IHG's global comparable rooms revenue up 2.3 pct "
    },
    {
        "content": "* Intercontinental Hotels Group - ‍signed 3 management contracts to introduce its Kimpton Hotels & Restaurants brand to Asia​ Source text for Eikon: Further company coverage:",
        "date": "10182017",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "BRIEF-Intercontinental Hotels - ‍signed 3 management contracts "
    },
    {
        "content": "* R&F involved in two property deals with Wang's Dalian Wanda",
        "date": "08262017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "China's R&F Properties roars back into the spotlight on Wanda deals "
    },
    {
        "content": "LONDON  Aug 9 Goldman Sachs has sold its remaining stake in British pensions insurance business Rothesay Life to a trio of existing investors including Singapore's sovereign wealth fund a decade after setting up the company.",
        "date": "08092017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "CORRECTED-Blackstone  GIC lead buy out of Goldman Sachs stake in Rothesay Life "
    },
    {
        "content": "InterContinental Hotels Group reported slower growth in revenue per room in the second quarter  sending its shares down 4 percent  as a later Easter weighed on its U.S. performance.",
        "date": "08082017",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "Hotelier IHG reports slower second quarter revenue per room growth "
    },
    {
        "content": "* Shares fall 4 pct (Adds CFO  investor comments  share movement)",
        "date": "08082017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "UPDATE 2-Hotelier IHG reports slower Q2 revenue per room growth "
    },
    {
        "content": "Aug 8 InterContinental Hotels Group (IHG) on Tuesday reported slower global rooms revenue growth for the second quarter  hurt by a decline in U.S. growth due to a later Easter this year.",
        "date": "08082017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Hotelier IHG reports slower rooms revenue growth "
    },
    {
        "content": "* H1 REPORTED REVENUE $857 MILLION VERSUS $838 MILLION YEAR AGO",
        "date": "08082017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-InterContinental Hotels reports higher first-half profit "
    },
    {
        "content": "May 5 InterContinental Hotels Group Plc said Chief Commercial Officer Keith Barr would succeed CEO Richard Solomons at the end of next month  Solomons stepping down after running the business for six years.",
        "date": "05052017",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "UPDATE 1-Hotelier IHG's CEO to be succeeded by company insider "
    },
    {
        "content": "May 5 InterContinental Hotels Group Plc on Friday reported faster growth in room revenue for the first quarter and said Chief Executive Richard Solomons would retire this year.",
        "date": "05052017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "InterContinental Hotels says Q1 rooms revenue growth up  CEO to retire "
    },
    {
        "content": "* 7K rooms opened  increasing net system size 3.4 pct yoy to 767k rooms",
        "date": "05052017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-IHG Q1 global comparable rooms revenue rises "
    },
    {
        "content": "* Richard Solomons  group chief executive officer to retire and to be succeeded by Keith Barr  chief commercial officer",
        "date": "05052017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-IHG CEO Solomons to retire  chief commercial officer named successor "
    },
    {
        "content": "* Says Tripadvisor announces new partnership with Intercontinental Hotels Group Source text for Eikon: Further company coverage:",
        "date": "04272017",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "BRIEF-Tripadvisor announces new partnership with Intercontinental Hotels Group "
    },
    {
        "content": "TORONTO Global hotel chain InterContinental Hotels Group Plc  said 1 200 of its franchised hotels in the United States  including Holiday Inn and Crowne Plaza  were victims of a three-month cyber attack that sought to steal customer payment card data.",
        "date": "04202017",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "Cyber attack hits 1 200 InterContinental hotels in United States "
    },
    {
        "content": "TORONTO  April 19 Global hotel chain InterContinental Hotels Group Plc said 1 200 of its franchised hotels in the United States  including Holiday Inn and Crowne Plaza  were victims of a three-month cyber attack that sought to steal customer payment card data.",
        "date": "04192017",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "UPDATE 1-Cyber attack hits 1 200 InterContinental hotels in United States "
    },
    {
        "content": "TORONTO  April 19 Global hotel chain InterContinental Hotels Group Plc said a third of its franchised properties in the United States were hit late last year by malware that can steal guests' credit card information.",
        "date": "04192017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "REFILE-InterContinental Hotels says 1 200 hotels hit by malware "
    },
    {
        "content": "Feb 21 InterContinental Hotels Group (IHG)  beat 2016 profit forecasts  helped by demand in the Americas  and announced a $400 million special dividend for shareholders that sent its stock to a record high.",
        "date": "02212017",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "UPDATE 1-Profit rise  special dividend lift IHG to record high "
    },
    {
        "content": "InterContinental Hotels Group Plc   one of the world's largest hoteliers  reported a slightly better-than-expected yearly profit rise and said it would return $400 million to investors via a special dividend and share consolidation.",
        "date": "02212017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Hotelier IHG posts higher profit  to return $400 million to investors "
    },
    {
        "content": "* Malina Ngai is to be appointed as an independent non-executive director of ihg  Source text for Eikon:  Further company coverage:   (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "02212017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-IHG appoints Malina Ngai as non-exec director "
    },
    {
        "content": "Feb 21 InterContinental Hotels Group Plc   one of the world's largest hoteliers  reported a slightly better-than-expected yearly profit rise and said it would return $400 million to investors via a special dividend and share consolidation.",
        "date": "02212017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Hotelier IHG posts higher profit  to return $400 mln to investors "
    },
    {
        "content": "* Strong underlying revenue growth driven by both revpar and rooms",
        "date": "02212017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-Hotelier IHG reports higher full-year profit "
    },
    {
        "content": "InterContinental Hotels Group Plc on Friday confirmed a data breach from payment cards used at 12 of its hotels in the United States  a little over a month after it said it was investigating claims of a possible breach.",
        "date": "02032017",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "InterContinental confirms payment card breach at 12 U.S. hotels "
    },
    {
        "content": "Feb 3 InterContinental Hotels Group Plc   on Friday confirmed a data breach from payment cards used at 12 of its hotels in the United States  a little over a month after it said it was investigating claims of a possible breach.",
        "date": "02032017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "UPDATE 1-InterContinental confirms payment card breach at 12 U.S. hotels "
    },
    {
        "content": "Feb 3 InterContinental Hotels Group Plc   said on Friday that a malware in the servers at 12 of its hotels in the United States tracked payment card data if the card was used at the hotels' restaurants and bars between August and December last year.",
        "date": "02032017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "InterContinental reports payment card breach at 12 U.S. hotels "
    },
    {
        "content": "* IHG notifies guests of payment card incident at 12 properties in the Americas",
        "date": "02032017",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-Intercontinental Hotels notifies guests of payment card incident at 12 properties in the Americas "
    },
    {
        "content": "InterContinental Hotels Group Plc said on Wednesday it is investigating claims of a possible payment card breach at some of its hotels in the United States.",
        "date": "12282016",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "InterContinental investigates possible payment card breach "
    },
    {
        "content": "* Says to introduce EVEN Hotels brand to Australia and New Zealand to drive growth in lifestyle segment",
        "date": "10202016",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "BRIEF-IHG introduces hotel brand to Australia and New Zealand to drive growth "
    },
    {
        "content": "InterContinental Hotels (IHG)  saw slower growth in room rates in the third quarter as the slump in the oil industry continued to affect bookings in some U.S. states and security concerns hurt demand in France  Belgium and Turkey.",
        "date": "10212016",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "InterContinental says oil industry slump  security concerns cap revenue growth "
    },
    {
        "content": "* Shares fall as much as 2.3 pct   (Adds CFO  analyst comments  share movement)",
        "date": "10212016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "UPDATE 2-InterContinental says oil industry slump  security concerns cap revenue growth "
    },
    {
        "content": "Oct 21 Intercontinental Hotels Group Plc  posted a slower rate of room revenue growth as performance in its hotels in oil-producing American states deteriorated  while demand across France  Turkey and Belgium was hit by security fears.",
        "date": "10212016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "IHG's Q3 room revenue growth slows "
    },
    {
        "content": "* Kimpton Hotels & Restaurants notifies customers of payment card incident",
        "date": "08312016",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "BRIEF-Kimpton Hotels & Restaurants notifies customers of payment card incident "
    },
    {
        "content": "Anbang Insurance Group Co is not considering an offer for InterContinental Hotels Group Plc   Chris Winans  a representative for the Chinese company said on Sunday  rejecting a media report that a takeover bid was in the works.",
        "date": "08072016",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "Anbang is not considering an offer for InterContinental: spokesman "
    },
    {
        "content": "Aug 8 Anbang Insurance Group Co is not considering an offer for InterContinental Hotels Group Plc  Chris Winans  a representative for the Chinese company said on Sunday  rejecting a media report that a takeover bid was in the works.",
        "date": "08072016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Anbang is not considering an offer for InterContinental -spokesman "
    },
    {
        "content": "* Has only limited exposure to France   (Adds CFO  analysts comments  details  share movement)",
        "date": "08022016",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "UPDATE 1-IHG confident for the year  lifts dividend "
    },
    {
        "content": "* H1 underlying operating profit rose 2.1 percent to 344 million usd",
        "date": "08022016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-IHG H1 operating profit $344 mln "
    },
    {
        "content": "Aug 2 Intercontinental Hotels Group Plc  expressed confidence in its outlook for the rest of the year  after growth across its regions led to a higher rise in global room revenue for the second quarter.",
        "date": "08022016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Growth across regions drives up hotelier IHG's Q2 room revenue "
    },
    {
        "content": "* IHG to invest $200 million in Crowne Plaza brand in americas",
        "date": "06032016",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "BRIEF-IHG to invest $200 million in Crowne Plaza brand in Americas "
    },
    {
        "content": "May 6 InterContinental Hotels Group Plc  on Friday posted a 1.5 percent rise in first-quarter global room revenue  missing analysts' estimates but said it was confident for the rest of the year  citing current trading trends and brand momentum.",
        "date": "05062016",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "UPDATE 1-InterContinental Hotels Q1 global room revenue lags estimates "
    },
    {
        "content": "May 6 InterContinental Hotels Group Plc  on Friday posted a 1.5 percent rise in first-quarter global room revenue and said it was confident for the rest of the year  citing current trading trends and brand momentum.",
        "date": "05062016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "InterContinental Hotels confident on full-year outlook "
    },
    {
        "content": "* Enhanced global scale: 5k rooms opened  increasing net system 2.7% yoy to 742k rooms",
        "date": "05062016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-IHG Q1 revpar up 1.5 pct  confident outlook "
    },
    {
        "content": "BERLIN Intercontinental Hotels Group  is interested in smaller deals to expand its portfolio  but won't be growing for the sake of it  its chief executive told Reuters on Monday.",
        "date": "03072016",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "IHG likely to look at more boutique-style hotel deals: CEO "
    },
    {
        "content": "* Shares hit by Citi downgrade   (Adds further comments on demand  markets; share price)",
        "date": "03072016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "UPDATE 1-IHG likely to look at more boutique-style hotel deals - CEO "
    },
    {
        "content": "BERLIN  March 7 Intercontinental Hotels Group  is interested in smaller deals to expand its portfolio  but won't be growing for the sake of it  its chief executive told Reuters on Monday.",
        "date": "03072016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "IHG likely to look at smaller  Kimpton-Style deals - CEO "
    },
    {
        "content": "LONDON  March 7 UK shares edged lower on Monday as miners fell for the first time in six sessions  weighed down by falling commodities prices which offset a jump in Old Mutual  shares.",
        "date": "03072016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Britain's FTSE falls on commodities weakness  Old Mutual surges "
    },
    {
        "content": "* Plans $1.5 billion special dividend   (Adds CFO comments  details  background)",
        "date": "02232016",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "UPDATE 2-InterContinental to return cash  sees no need for big hotel deal "
    },
    {
        "content": "LONDON InterContinental Hotels Group Plc   one of the world's largest hoteliers  promised a special payout of $1.5 billion  even as strong demand across all its regions helped it post a rise in yearly profit  sending its shares up 4 percent.",
        "date": "02232016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Hotelier IHG to return $1.5 billion as full-year profit rises "
    },
    {
        "content": "LONDON  Feb 23 InterContinental Hotels Group Plc   one of the world's largest hoteliers  reported a 4 percent rise in yearly profit on Tuesday  boosted by strong demand across all its regions.",
        "date": "02232016",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Hotelier IHG posts higher full-year profit  to return $1.5 bln "
    },
    {
        "content": "LONDON Nov 9 Britain's top share index hit a three-week low on Monday  with Intercontinental Hotels Group  falling after saying it was not considering a potential sale or merger move and miners tracking weaker metals prices.",
        "date": "11092015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "Weaker miners and utilities push FTSE to 3-week low "
    },
    {
        "content": "InterContinental Hotels Group Plc   one of the world's largest hoteliers  said it was not exploring a sale or merger  following a media report that the company was looking at its strategic options.",
        "date": "11062015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "InterContinental Hotels denies exploring sale or merger "
    },
    {
        "content": "LONDON Nov 9 Britain's top share index hit a three-week low on Monday  with Intercontinental Hotels Group  falling after saying it was not considering a potential sale or merger move and miners tracking weaker metals prices.",
        "date": "11092015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "FTSE hits three-week low as miners and utilities fall "
    },
    {
        "content": "Nov 6 InterContinental Hotels Group Plc  one of the world's largest hoteliers  said it was not exploring a sale or merger  following a media report that the company was looking at its strategic options.",
        "date": "11062015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "UPDATE 2-InterContinental Hotels denies exploring sale or merger "
    },
    {
        "content": "* Board of directors of ihg states that it is not considering a potential sale or merger of company  Source text for Eikon:  Further company coverage:",
        "date": "11092015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-InterContinental Hotels says not considering potential sale or merger of co "
    },
    {
        "content": "Nov 6 InterContinental Hotels Group Plc  one of the world's largest hoteliers  is exploring strategic options including a potential sale or merger  Bloomberg reported on Friday.",
        "date": "11062015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "InterContinental Hotels exploring options including sale - Bbg "
    },
    {
        "content": "* Said to mull deal after drawing interest - Bloomberg  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "11062015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-Intercontinental Hotels exploring strategic options - Bloomberg "
    },
    {
        "content": "* Starwood shares up 5.7 pct   (Changes sourcing  adds analysts' comments  details)",
        "date": "10282015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "UPDATE 2-Hyatt in talks to buy Starwood Hotels - source "
    },
    {
        "content": "LONDON  Oct 20 InterContinental Hotels Group   one of the world's largest hoteliers  said it was confident in its outlook after reporting higher than expected growth in its third quarter  lifting its shares.",
        "date": "10202015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "UPDATE 1-InterContinental Hotels boosted by confident outlook "
    },
    {
        "content": "LONDON  Oct 20 Britain's top share index dipped on Tuesday but outperformed European peers  supported by well-received results from InterContinental Hotels Group  and Whitbread.",
        "date": "10202015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "FTSE outperforms European indexes  hoteliers help "
    },
    {
        "content": "LONDON  Oct 20 Britain's top share index dipped on Tuesday  but outperformed European peers  supported by well-received results from InterContinental Hotels Group  and Whitbread.",
        "date": "10202015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Britain's FTSE outperforms Europe  hoteliers help "
    },
    {
        "content": "LONDON  Oct 20 InterContinental Hotels Group   one of the world's largest hoteliers  said it was confident in its outlook for the year due to encouraging trading trends and after posting growth in its third quarter.",
        "date": "10202015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "InterContinental confident in outlook for the year "
    },
    {
        "content": "LONDON  July 31 Britain's top equity index forged ahead on Friday  lifted by a rise in the shares of media group ITV and cruise ship company Carnival  which set the market up for a fourth straight day of gains.",
        "date": "07312015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "Britain's FTSE fortified by gains at ITV and Carnival "
    },
    {
        "content": "LONDON  July 31 Britain's top equity index edge down on Friday as a pullback in mining stocks weighed on the market  which had risen for the last three sessions in a row.",
        "date": "07312015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Britain's FTSE slips as mining stocks weaken "
    },
    {
        "content": "Starwood Hotels & Resorts Worldwide Inc  has reached out to potential bidders  including InterContinental Hotels Group Plc  and Wyndham Worldwide Corp   after deciding to explore a sale  according to people familiar with the matter.",
        "date": "07302015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "Starwood Hotels reaches out to potential bidders: sources "
    },
    {
        "content": "LONDON  July 31 Britain's top equity index moved forward on Friday as a rise in the shares of media group ITV  and energy company BG set the market up for a fourth straight day of gains.",
        "date": "07312015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Britain's FTSE forges ahead as BG and ITV rise "
    },
    {
        "content": "July 30 Starwood Hotels & Resorts Worldwide Inc  has reached out to potential bidders  including InterContinental Hotels Group Plc and Wyndham Worldwide Corp  after deciding to explore a sale  according to people familiar with the matter.",
        "date": "07302015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "UPDATE 3-Starwood Hotels reaches out to potential bidders - sources "
    },
    {
        "content": "LONDON  July 31 Britain's FTSE 100 index is seen opening up by 2 to 4 points  or 0.06 percent higher on Friday  according to financial bookmakers. For more on the factors affecting European stocks  please click on",
        "date": "07312015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "UK Stocks-Factors to watch on July 31 "
    },
    {
        "content": "July 30 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07302015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Board of directors of IHG states that it is not in talks with Starwood with a view to a combination of businesses.",
        "date": "07302015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-Intercontinental Hotels says not in talks with Starwood "
    },
    {
        "content": "LONDON  July 30 Britain's top share index rose for a third straight day on Thursday  with energy shares leading the way as oil prices gained and Royal Dutch Shell  rallied after it announced jobs and spending cuts.",
        "date": "07302015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Britain's FTSE reaches one-week high as energy shares rally "
    },
    {
        "content": "LONDON  July 30 Britain's top share index rose for a third straight day on Thursday  with energy shares leading the way following stronger oil prices and a rally in Shell  after it announced jobs and spending cuts.",
        "date": "07302015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Britain's FTSE hits one-week high as energy shares rally "
    },
    {
        "content": "* Underlying fee revenue growth of 9 percent  and underlying profit growth of 10 percent ",
        "date": "07302015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-InterContinental hikes dividend  confident on outlook "
    },
    {
        "content": "LONDON  July 10 Britain's top share index rose on Friday but lagged behind euro zone shares after Athens submitted fresh reform proposals to its creditors  offering a glimmer of hope for some kind of progress over Greece's debt crisis.",
        "date": "07102015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "Britain's FTSE boosted by Greece  IHG and IAG deal talk "
    },
    {
        "content": "LONDON InterContinental Hotels Group said on Friday it had agreed to sell InterContinental Hong Kong to a consortium of investors for $938 million and may return some of the proceeds to shareholders.",
        "date": "07102015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "IHG agrees $938 million sale of InterContinental Hong Kong "
    },
    {
        "content": "LONDON  July 10 InterContinental Hotels Group  said on Friday it had agreed to sell InterContinental Hong Kong to a consortium of investors for $938 million and may return some of the proceeds to shareholders.",
        "date": "07102015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "CORRECTED-UPDATE 1-IHG agrees $938 million sale of InterContinental Hong Kong "
    },
    {
        "content": "LONDON  July 10 InterContinental Hotels Group  said on Friday it had agreed to sell InterContinental Hong Kong to a consortium of investors for $938 million but will retain a management contract.",
        "date": "07102015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "IHG agrees $938 sale of InterContinental Hong Kong "
    },
    {
        "content": "LONDON  May 8 InterContinental Hotels Group   one of the world's largest hoteliers  posted a 5.9 percent rise in first quarter global room revenue  delivering growth across all of its regions.",
        "date": "05082015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "Hotelier IHG makes strong start to the year "
    },
    {
        "content": "* Strong q1 performance with revpar growth in all regions  Further company coverage:    (Editing by Neil Maidment)",
        "date": "05082015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "BRIEF-Intercontinental Hotels Group posts Q1 room revenue rise "
    },
    {
        "content": "BRUSSELS  April 27 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04272015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "EU mergers and takeovers (April 27) "
    },
    {
        "content": "LONDON  April 20 Mining stocks helped Britain's top share index rebound on Monday  benefiting from stimulus measures in China to support stuttering growth in the world's biggest consumer of metals.",
        "date": "04202015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "FTSE gains as China stimulus boosts basic resources stocks "
    },
    {
        "content": "LONDON  April 20 Mining stocks helped Britain's top share index rebound on Monday  benefiting from stimulus measures in China to support stuttering growth in the world's biggest consumer of metals.",
        "date": "04202015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Britain's FTSE gains as China stimulus boosts miners "
    },
    {
        "content": "LONDON  April 20 Mining stocks helped Britain's top share index rebound on Monday  benefiting from stimulus measures in China to support stuttering growth in the world's biggest consumer of metals.",
        "date": "04202015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Miners help Britain's FTSE to rebound after China stimulus boost "
    },
    {
        "content": "* Appointment of Richard Solomons to its board as a non-executive director",
        "date": "04102015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "BRIEF-M&S appoints IHG's Richard Solomons as non-executive director "
    },
    {
        "content": "* RevPAR up 5.1 percent in European division   (Adds details)",
        "date": "02172015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "UPDATE 1-Profits rise at hotelier IHG on strong U.S. demand "
    },
    {
        "content": "LONDON  Feb 17 InterContinental Hotels Group   one of the world's largest hoteliers  posted a 10 percent rise in 2014 profit  led by strong growth in its core North American market.",
        "date": "02172015",
        "name": "Intercontinental Hotels Group",
        "news_type": "normal",
        "symbol": "IHG",
        "title": "Profits rise at hotelier IHG on strong U.S. demand "
    },
    {
        "content": "* Acquisition of kimpton hotels & restaurants group llc for cash consideration of $430 million has now completed  Source text for Eikon:  Further company coverage:",
        "date": "01162015",
        "name": "Intercontinental Hotels Group",
        "news_type": "topStory",
        "symbol": "IHG",
        "title": "BRIEF-IHG completes $430 mln acquisition of Kimpton Hotels group "
    }
]