[
    {
        "content": "* Illumina Inc - ‍introduction of its NextSeq 550Dx instrument  co's second FDA-regulated and CE-IVD marked next-generation sequencing (NGS) system​",
        "date": "11152017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina announces ‍introduction of its NextSeq 550Dx instrument "
    },
    {
        "content": "* Illumina reports financial results for third quarter of fiscal year 2017",
        "date": "10242017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina reports Q3 GAAP earnings per share $1.11 "
    },
    {
        "content": "* Illumina Inc - ‍filed new patent infringement suit against Premaitha Health Plc in High Court of Justice  Chancery Division  Patents Court in UK Source text for Eikon: Further company coverage:",
        "date": "09072017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina files new patent infringement suit against Premaitha Health Plc "
    },
    {
        "content": "CHICAGO  Aug 16 A test that scans blood for tumor-specific DNA identified early-stage cancer in more than half of 138 patients with the disease  U.S. researchers reported on Wednesday  marking a new milestone in the rush for so-called \"liquid biopsies.\"",
        "date": "08162017",
        "name": "Illumina Inc",
        "news_type": "normal",
        "symbol": "ILMN",
        "title": "'Liquid biopsy' spots early-stage cancers in blood -U.S. study "
    },
    {
        "content": "* Illumina reports strong financial results for second quarter of fiscal year 2017",
        "date": "08012017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina Q2 earnings per share $0.87 "
    },
    {
        "content": "Shares of Illumina Inc  surged nearly 14 percent on Wednesday  a day after the company raised its 2017 revenue forecast on strong demand for its new gene-sequencing technology.",
        "date": "08022017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Illumina shares sparkle on strong demand for new gene tech "
    },
    {
        "content": "Aug 2 Shares of Illumina Inc surged nearly 14 percent on Wednesday  a day after the company raised its 2017 revenue forecast on strong demand for its new gene-sequencing technology.",
        "date": "08022017",
        "name": "Illumina Inc",
        "news_type": "normal",
        "symbol": "ILMN",
        "title": "CORRECTED-UPDATE 1-Illumina shares sparkle on strong demand for new gene tech "
    },
    {
        "content": "Aug 2 Shares of Illumina Inc surged nearly 12 percent on Wednesday  a day after the company raised its full-year revenue forecast on higher-than-expected demand for its new gene-sequencing technology.",
        "date": "08022017",
        "name": "Illumina Inc",
        "news_type": "normal",
        "symbol": "ILMN",
        "title": "Illumina shares sparkle on demand for new gene tech "
    },
    {
        "content": "A federal appeals court on Tuesday revived a patent on fetal diagnostic testing that Illumina Inc has accused rival Sequenom Inc of infringing.",
        "date": "06272017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Illumina notches win in prenatal testing patent fight "
    },
    {
        "content": "* SAID ON FRIDAY THAT ITS UNITS  CENTRUM BADAN DNA SP. Z O.O AND MEDGENETIX SP. Z O.O.  REACHED SETTLEMENT WITH THE COMPANY ILLUMINA INC. CONCERNING VIOLATION OF INTELLECTUAL PROPERTY OF ITS PATENT",
        "date": "06262017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Inno-Gene says units reach agreement with Illumina over patent dispute "
    },
    {
        "content": "* Amended and restated its IVD test development and component supply agreement with Illumina",
        "date": "06052017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-HTG Molecular amends  restates IVD test development  component supply agreement with Illumina "
    },
    {
        "content": "* Illumina reports financial results for first quarter of fiscal year 2017",
        "date": "04252017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina reports Q1 GAAP earnings per share $2.52 "
    },
    {
        "content": "Cornell University and biotechnology company Illumina Inc have dropped a lengthy patent dispute over gene-sequencing technology  citing a \"settlement process.\"",
        "date": "04182017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Illumina  Cornell drop gene sequencing patent dispute "
    },
    {
        "content": "* Illumina inc says ceo francis a. Desouza's total 2016 compensation was $8.4 million versus $5.4 million in 2015 - sec filing Source text - http://bit.ly/2ozO37O Further company coverage:",
        "date": "04142017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina Inc says CEO Francis A. Desouza's total 2016 compensation was $8.4 mln "
    },
    {
        "content": "* CEO Francis A. Desouza's FY 2016 total compensation was $8.4 million versus $5.4 million in FY 2015 - SEC Filing",
        "date": "03302017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina CEO Francis Desouza's FY 2016 total compensation was $8.4 mln - SEC Filing "
    },
    {
        "content": "* Illumina will market and promote Kailos Targetrich line of research solutions for pharmacogenetics targets through commercial channels  Source text for Eikon: Further company coverage:",
        "date": "03212017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Kailos genetics enters into a co-marketing agreement with Illumina "
    },
    {
        "content": "Trade groups representing the biotechnology and pharmaceutical industries have asked a federal appeals court to clarify the rules for determining whether arguments not put forth in U.S. Patent and Trademark Office proceedings can be raised later in district court.",
        "date": "03032017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Pharma groups file amicus brief in Illumina patent case "
    },
    {
        "content": "* On February 18  2017  board increased size of board from ten to 11 members and elected John Thompson to board - SEC filing  Source text (http://bit.ly/2m4NjYm) Further company coverage:",
        "date": "02212017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina says board increased size of board from 10 to 11 members "
    },
    {
        "content": "* Illumina Inc- Novaseq's S1 and S4 flow cells have been prioritized and are expected to be available for shipment in Q3 of 2017 - SEC filing",
        "date": "02132017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina says Novaseq's S1  S4 flow cells expected to be available for shipment in Q3 2017 "
    },
    {
        "content": "* Illumina Inc - effective as of Jan 26  2017 increased size of board from nine to ten members and elected Caroline Dorsa to serve on board - SEC filing  Source text: (http://bit.ly/2k1ulOq) Further company coverage:",
        "date": "01272017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina elects Caroline Dorsa to serve on board "
    },
    {
        "content": "* Illumina names Caroline Dorsa to its board of directors  adding over 30 years of leadership experience in the healthcare  telecommunications and energy industries  Source text for Eikon:  Further company coverage:",
        "date": "01272017",
        "name": "Illumina Inc",
        "news_type": "normal",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina names Caroline Dorsa to its board of directors "
    },
    {
        "content": "* Illumina reports full financial results for fourth quarter and fiscal year 2016",
        "date": "01312017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina Q4 non-gaap earnings per share $0.85 "
    },
    {
        "content": "* Caredx to acquire SBT Resolver HLA typing products from Illumina  Source text for Eikon:  Further company coverage:",
        "date": "01242017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Caredx to acquire SBT Resolver HLA typing products from Illumina "
    },
    {
        "content": "* Illumina  NRGene collaborate to accelerate development of new molecular breeding tools for cattle to support global food production  Source text for Eikon:  Further company coverage:",
        "date": "01122017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina  NRGene collaborate to accelerate development of new molecular breeding tools for cattle to support global food production "
    },
    {
        "content": "A federal judge in Delaware has blocked biotechnology company Illumina from filing claims that Cornell University employees deceived the U.S. Patent and Trademark Office in order to obtain a gene-sequencing patent that the university accuses Illumina of infringing.",
        "date": "01122017",
        "name": "Illumina Inc",
        "news_type": "normal",
        "symbol": "ILMN",
        "title": "Judge in gene-sequencing lawsuit blocks Illumina's claim against Cornell "
    },
    {
        "content": "Diagnostic technology company Qiagen NV will try to persuade the U.S. Court of Appeals for the Federal Circuit on Thursday to throw out an injunction barring the sale of its year-old GeneReader  the company's entry into the rapidly growing gene-sequencing market.",
        "date": "01112017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Illumina  Qiagen to square off over GeneReader ban "
    },
    {
        "content": "Shares of Illumina Inc  rose 16 percent on Tuesday  after the company unveiled new technology  which is expected to eventually reduce the cost of sequencing to $100 per human genome  prompting a slew of price target increases.",
        "date": "01102017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "New Illumina tech could usher in $100 gene-sequencing era "
    },
    {
        "content": "* and Philips join forces to offer integrated genomics solutions for oncology  Source text for Eikon:  Further company coverage:     (Gdynia Newsroom)",
        "date": "01092017",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Philips and Illumina join forces to offer integrated genomics solutions for oncology "
    },
    {
        "content": "Jan 10 Shares of Illumina Inc rose 16 percent on Tuesday  after the company unveiled new technology  which is expected to eventually reduce the cost of sequencing to $100 per human genome  prompting a slew of price target increases.",
        "date": "01102017",
        "name": "Illumina Inc",
        "news_type": "normal",
        "symbol": "ILMN",
        "title": "UPDATE 1-New Illumina tech could usher in $100 gene-sequencing era "
    },
    {
        "content": "A federal judge in San Diego has dismissed a lawsuit by the non-profit Scripps Research Institute accusing Illumina Inc of infringing a patent related to a type of genetic analysis tool.",
        "date": "11232016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Illumina wins dismissal of Scripps Institute patent lawsuit "
    },
    {
        "content": "* Says continues to project Q4 revenue to be flat to slightly up compared to Q3",
        "date": "11012016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina Q3 GAAP earnings per share $0.87 "
    },
    {
        "content": "* German court issues preliminary injunction against Amedes Fetalis test for infringement of non-invasive prenatal screening patent",
        "date": "10242016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-German court issues preliminary injunction against Amedes Fetalis test "
    },
    {
        "content": "* Illumina announces preliminary revenue for third quarter of fiscal year 2016",
        "date": "10102016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina announces preliminary revenue for Q3 "
    },
    {
        "content": "* Illumina reports financial results for second quarter of fiscal year 2016",
        "date": "07262016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina reports Q2 adj. earnings $0.86/shr "
    },
    {
        "content": "* Effective as of july 27  2016  board of directors increased size of board from eight to nine members - sec filing   Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07282016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina increases size of board from eight to nine members "
    },
    {
        "content": "* Says Schiller is currently Apple's senior vice president of worldwide marketing",
        "date": "07282016",
        "name": "Illumina Inc",
        "news_type": "normal",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina names Philip Schiller to its board "
    },
    {
        "content": "* Co's unit  Enzo Life Sciences  has reached and finalized a settlement with Illumina that included a payment of $21 million to enzo",
        "date": "07072016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Enzo Biochem says Enzo Life Sciences reached settlement with Illumina that included payment of $21 mln to Enzo "
    },
    {
        "content": "* Natera and Illumina extend supply agreement  broaden existing partnership to include oncology field  Source text for Eikon:  Further company coverage:    )",
        "date": "06292016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Natera and Illumina extend supply agreement  broaden existing partnership to include oncology field "
    },
    {
        "content": "* On June 8  2016  co and Illumina Inc entered into third amendment to a supply agreement dated August 16  2013",
        "date": "06132016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Natera  Illumina Inc enter 3rd amendment to supply agreement dated August 16  2013 "
    },
    {
        "content": "A federal magistrate judge has recommended that biotechnology company Illumina Inc be allowed to file claims accusing Cornell University employees of deceiving the U.S. Patent and Trademark Office in order to obtain a gene-sequencing patent it now accuses Illumina of infringing.",
        "date": "05312016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Illumina claims Cornell obtained gene-sequencing patent unfairly "
    },
    {
        "content": "A federal appeals court has upheld gene-sequencing company Illumina Inc's patent on a method of labeling nucleotides  the individual building blocks of DNA  rejecting a challenge by a unit of rival Quiagen NV.",
        "date": "05102016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Federal Circuit upholds Illumina gene-sequencing patent "
    },
    {
        "content": "* Received a product approval certificate for Miseqdx Instrument and Miseqdx universal kit with MFDS in South Korea  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05092016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina received a product approval certificate for MiSeqDx instrument "
    },
    {
        "content": "* Illumina reports financial results for first quarter of fiscal year 2016",
        "date": "05032016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina Q1 non-GAAP earnings per share $0.71 "
    },
    {
        "content": "* Illumina and its subsidiary Verinata Health  have filed a patent infringement suit against subsidiary Genoma in federal patent court in Switzerland",
        "date": "04222016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina have filed a patent infringement suit against Esperite subsidiary Genoma "
    },
    {
        "content": "* Illumina files patent infringement suit in Switzerland against Genoma SA for infringement of NIPT patents",
        "date": "04212016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina files patent infringement suit against Genoma SA "
    },
    {
        "content": "* Committed to invest $100 million in a new venture capital firm",
        "date": "04142016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "CORRECTED-BRIEF-Illumina committed to invest $100 million in new venture capital firm "
    },
    {
        "content": "* CEO Jay T. Flatley 2015 total compensation of $9.2 million versus $14.9 million in 2014 - SEC filing    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04082016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Illumina says CEO Jay Flatley's 2015 compensation was $9.2 mln vs $14.9 mln in 2014 "
    },
    {
        "content": "CHICAGO Gene sequencing company Illumina Inc is going after the next big advance in cancer detection  working to develop a universal blood test to identify early-stage cancers in people with no symptoms of the disease.",
        "date": "01112016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Illumina  partners make $100 million bet to detect cancer via blood test "
    },
    {
        "content": "CHICAGO Gene sequencing company Illumina Inc is going after the next big advance in cancer detection  working to develop a universal blood test to identify early-stage cancers in people with no symptoms of the disease.",
        "date": "01102016",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Illumina  partners make $100 million bet to detect cancer via blood test "
    },
    {
        "content": "CHICAGO  Jan 10 Gene sequencing company Illumina Inc is going after the next big advance in cancer detection  working to develop a universal blood test to identify early-stage cancers in people with no symptoms of the disease.",
        "date": "01112016",
        "name": "Illumina Inc",
        "news_type": "normal",
        "symbol": "ILMN",
        "title": "UPDATE 1-Illumina  partners make $100 mln bet to detect cancer via blood test "
    },
    {
        "content": "CHICAGO  Jan 10 Gene sequencing company Illumina Inc is going after the next big advance in cancer detection  working to develop a universal blood test to identify early-stage cancers in people with no symptoms of the disease.",
        "date": "01102016",
        "name": "Illumina Inc",
        "news_type": "normal",
        "symbol": "ILMN",
        "title": "Illumina  partners make $100 mln bet to detect cancer via blood test "
    },
    {
        "content": "* Announced on Monday the launch of Biomerieux EpiSeq  an next-generation sequencing (NGS) service for epidemiological monitoring and control of healthcare-associated infections   Source text for Eikon:  Further company coverage:",
        "date": "12152015",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Biomerieux and Illumina launch Biomerieux EpiSeq "
    },
    {
        "content": "A federal appeals court has revived a petition by Roche AG unit Ariosa Diagnostics seeking to invalidate a rival's patent on a noninvasive prenatal test for Down Syndrome.",
        "date": "11162015",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Circuit revives challenge to Illumina Down Syndrome test patent "
    },
    {
        "content": "NEW YORK U.S. biotech shares extended their recent downward spiral on Tuesday as concerns about drug pricing continued to plague the sector while disappointing news from Illumina and other companies added to selling pressure.",
        "date": "10062015",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Biotechs extend selloff as pricing concerns intensify "
    },
    {
        "content": "Gene-sequencing giant Illumina Inc  private equity firm Warburg Pincus LLC and venture capital firm Sutter Hill Ventures have agreed to invest $100 million to seed a new consumer-facing human genome platform called Helix  according to people familiar with the deal.",
        "date": "08182015",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "Illumina partners with private equity firm on gene JV: sources "
    },
    {
        "content": "* Merck Serono and Illumina enter strategic collaboration for diagnostics in oncology",
        "date": "03102015",
        "name": "Illumina Inc",
        "news_type": "topStory",
        "symbol": "ILMN",
        "title": "BRIEF-Merck Serono  Illumina to collaborate on cancer diagnostics "
    }
]