[
    {
        "content": "* Unifor says the Local's membership will vote on tentative agreement on Thursday  May 18 Source text for Eikon: Further company coverage:",
        "date": "05162017",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "BRIEF-Unifor reaches tentative agreement with Imperial Oil "
    },
    {
        "content": "CALGARY  Alberta  March 16 The fire at Syncrude Canada's oil sands plant in northern Alberta was extinguished on Thursday morning  the company said in a statement  as parts of the mining and upgrading facility ran at reduced rates.",
        "date": "03162017",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Fire at Syncrude oil sands site extinguished after two days "
    },
    {
        "content": "CALGARY  Alberta  March 15 Several crude bitumen processing upgrader units at Syncrude Canada's oil sands plant in Alberta were shut or running at minimized rates on Wednesday as a fire continued to burn for a second day  the company said.",
        "date": "03162017",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "UPDATE 6-Syncrude Canada site output down as fire continues burning "
    },
    {
        "content": "NEW YORK Western Canadian Select crude for February delivery rallied some $2 a barrel over the last week as traders pointed to unspecified operational issues at Imperial Oil's Kearl oil sands projects.",
        "date": "01122017",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "Canadian crude rallies on talks over Kearl oil sands issues - traders "
    },
    {
        "content": "* Couche-Tard receives approval to acquire certain Imperial Oil retail assets in Ontario and Québec",
        "date": "09072016",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "BRIEF-Couche-Tard receives approval to buy certain Imperial Oil retail assets "
    },
    {
        "content": "* Q2 gross production dips 4 pct to average 329 000 boepd   (Adds analysts' estimate  details on bitumen production)",
        "date": "07292016",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 2-Imperial Oil posts surprise loss on impact of Alberta wildfires "
    },
    {
        "content": "July 29Imperial Oil Ltd  Canada's No.2 integrated oil producer and refiner  reported a quarterly loss due to the impact of  wildfires in Fort McMurray  Alberta.",
        "date": "07292016",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "CORRECTED-UPDATE 1-Imperial Oil posts loss due to impact of Alberta wildfires "
    },
    {
        "content": "* Imperial reports $181 million loss in second quarter of 2016",
        "date": "07292016",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "BRIEF-Imperial reports $181 million loss in Q2 2016 "
    },
    {
        "content": "July 29Imperial Oil Ltd  Canada's No.2 integrated oil producer and refiner  reported a quarterly loss due to the impact of  wildfires in Fort McMurray  Alberta.",
        "date": "07292016",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil posts loss  hurt by wildfires in Alberta "
    },
    {
        "content": "NEW YORK  July 18 Michael Derchin  a longtime airlines industry analyst  has joined investment bank Imperial Capital LLC as managing director and senior equity research analyst  Imperial's head of institutional research Edward Mally said in an email on Monday.",
        "date": "07182016",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "MOVES-Veteran airline analyst joins Imperial Capital "
    },
    {
        "content": "* Says will continue to closely monitor developments with fires in regional municipality of Wood Buffalo",
        "date": "06032016",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "BRIEF-Imperial's Kearl operations return to normal  monitoring remains in place "
    },
    {
        "content": "CALGARY  Alberta  May 19 Firefighters made progress against a wildfire in the Fort McMurray region of northern Alberta on Thursday as a shift in winds pushed it away from communities and oil sands facilities.",
        "date": "05192016",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 4-Canadian firefighters make progress against fire in oil sands region "
    },
    {
        "content": "* Says confirmed it has restarted limited operations at its Kearl oil sands site",
        "date": "05192016",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "BRIEF-Imperial Oil provides Kearl operations update "
    },
    {
        "content": "CALGARY  Alberta  April 29 Canadian integrated oil producer and refiner Imperial Oil Ltd reported a slightly bigger-than-expected quarterly loss on Friday  hurt by continued weakness in global crude prices.",
        "date": "04292016",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 2-Oil price weakness drives Canada's Imperial Oil to bigger-than-expected loss "
    },
    {
        "content": "CALGARY  Alberta  April 28 Suncor Energy   Canada's largest oil and gas producer  said on Thursday it will focus on improving efficiency but not seek operatorship at Syncrude oil sands project in northern Alberta  in which it is acquiring a majority stake.",
        "date": "04282016",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Suncor says will not seek operatorship of Syncrude oil sands plant "
    },
    {
        "content": "* Imperial reports $101 million loss in first quarter of 2016",
        "date": "04292016",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "BRIEF-Imperial Q1 loss per share c$0.12 "
    },
    {
        "content": "April 29 Imperial Oil Ltd  Canada's integrated oil producer and refiner  reported a quarterly loss  compared with a year ago profit as lower global crude prices continue to hurt its results.",
        "date": "04292016",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Canada's Imperial Oil reports quarterly loss "
    },
    {
        "content": "March 8 Imperial Oil Ltd  Canada's No. 2 integrated oil producer and refiner  said it agreed to sell 497 remaining company-owned Esso retail stations to five fuel distributors for about C$2.8 billion ($2.09 billion).",
        "date": "03082016",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 1-Imperial Oil to sell 497 retail stations for C$2.8 bln "
    },
    {
        "content": "March 8 Imperial Oil Ltd  Canada's No. 2 integrated oil producer and refiner  said it agreed to sell 497 remaining company-owned Esso retail stations for about C$2.8 billion ($2.09 billion).",
        "date": "03082016",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil to sell 497 retail stations for C$2.8 bln "
    },
    {
        "content": "Imperial Oil Ltd   Canada's No.2 integrated oil producer and refiner  reported a lower-than-expected quarterly profit  hurt by a prolonged slump in crude oil prices.",
        "date": "02022016",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "Imperial Oil profit misses estimate as plunging crude weighs "
    },
    {
        "content": "Feb 2 Imperial Oil Ltd  Canada's No.2 integrated oil producer and refiner  reported a lower-than-expected quarterly profit  hurt by a prolonged slump in crude oil prices.",
        "date": "02022016",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "UPDATE 1-Imperial Oil profit misses estimate as plunging crude weighs "
    },
    {
        "content": "Feb 2 Imperial Oil Ltd  Canada's No.2 integrated oil producer and refiner  reported a 85 percent fall in quarterly profit  hurt by the prolonged slump in crude oil prices.",
        "date": "02022016",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil's quarterly profit slumps 85 pct "
    },
    {
        "content": "Integrated Canadian oil producer Imperial Oil Ltd   reported a higher-than-expected quarterly profit as the company weathered the slump in crude oil prices by lowering expenses.",
        "date": "10302015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "Imperial Oil profit beats estimates due to lower expenses "
    },
    {
        "content": "Oct 30 Integrated Canadian oil producer Imperial Oil Ltd  reported a higher-than-expected quarterly profit as the company weathered the slump in crude oil prices by lowering expenses.",
        "date": "10302015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "UPDATE 1-Imperial Oil profit beats estimates due to lower expenses "
    },
    {
        "content": "Oct 30 Integrated Canadian oil producer Imperial Oil Ltd  reported a 49 percent drop in quarterly profit  hurt by weak crude oil prices.",
        "date": "10302015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil profit nearly halves due to oil price crash "
    },
    {
        "content": "CALGARY  Alberta  Oct 5 Suncor Energy  chief executive Steve Williams said on Monday he expected Imperial Oil would continue to run the Syncrude joint venture oil sands project even if Suncor's hostile bid for Canadian Oil Sands Ltd is successful.",
        "date": "10052015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "Suncor expects Imperial Oil to continue to run Syncrude project "
    },
    {
        "content": "CALGARY  Alberta  Sept 23 Canadian oil producer and refiner Imperial Oil has added 120 000 barrels per day of heavy crude supply from two new projects this year even as prices languish near 6-1/2 year lows.",
        "date": "09232015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 1-Imperial's new projects add 120 000 bpd of crude so far this year "
    },
    {
        "content": "CALGARY  Alberta  Sept 23 Imperial Oil's  Kearl oil sands mining project is currently producing 200 000 barrels per day  while its Nabiye thermal project is producing 30 000 bpd  the company said during an investor day on Wednesday.",
        "date": "09232015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil says Kearl project expansion adds 90 000 bpd so far "
    },
    {
        "content": "Aug 11 Alberta's energy regulator on Tuesday ordered Syncrude Canada to develop a wildlife mitigation plan and publish more information following the death of 30 blue herons at an oil sands site in the Canadian province.",
        "date": "08112015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Alberta issues environmental order after Syncrude Canada heron deaths "
    },
    {
        "content": "Aug 8 Alberta's energy regulator is investigating the deaths of 30 blue herons at a Syncrude Canada oil sands site in the northern part of the Canadian province  the agency and company said on Saturday.",
        "date": "08092015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "UPDATE 1-Alberta probing heron deaths at Syncrude oil sands site "
    },
    {
        "content": "July 31 Imperial Oil Ltd   Canada's No.2 integrated oil producer and refiner  reported a lower-than-expected quarterly profit  hurt by the slump in crude prices.",
        "date": "07312015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 1-Imperial Oil's profit misses as crude prices plunge "
    },
    {
        "content": "July 31 Imperial Oil Ltd   Canada's No.2 integrated oil producer and refiner  reported a 90 percent fall in quarterly profit  hurt by the slump in crude prices and a tax-related charge.",
        "date": "07312015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil's profit plunges 90 pct "
    },
    {
        "content": "CALGARY  Alberta  June 26 Imperial Oil Ltd  said on Friday it and partners Exxon Mobil Corp  and BP Plc need more time before they can drill an exploratory well in Canadian Arctic waters and are seeking an extension to their exploration license in the region.",
        "date": "06262015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 2-Imperial Oil/Exxon/BP group defer drilling in Canada's Arctic "
    },
    {
        "content": "CALGARY  Alberta  June 26 Imperial Oil Ltd  said on Friday it is deferring plans to drill an exploratory well in the Beaufort Sea in Canada's Arctic as it seeks an extension to the length of its exploration license in the region.",
        "date": "06262015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "CORRECTED-UPDATE 1-Imperial Oil defers drilling in Canada's Beaufort Sea "
    },
    {
        "content": "CALGARY  Alberta  June 26 Imperial Oil Ltd  said on Friday it is deferring plans to drill an exploratory well in the Beaufort Sea in Canada's Arctic as it seeks an extension to the length of its exploration license in the region.",
        "date": "06262015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil defers drilling in Canada's Beaufort Sea "
    },
    {
        "content": "CALGARY  Alberta  June 17 Imperial Oil Ltd  said on Wednesday it will delay plans to boost the output of its Kearl oil sands project  backing off its 2020 fixed date for the next expansion phase.",
        "date": "06172015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "Imperial delays target for next Kearl oil sands expansion "
    },
    {
        "content": "CALGARY  Alberta  June 16 Imperial Oil Ltd   Canada's No. 2 integrated oil producer and refiner  said on Tuesday that production has begun at the second  C$9 billion ($7.3 billion)  phase of its Kearl oil sands mine in northern Alberta  doubling the capacity of the site to 220 000 barrels per day.",
        "date": "06162015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 1-Imperial Oil's Kearl oil sands expansion begins production "
    },
    {
        "content": "June 16 Imperial Oil Ltd said it has begun production at its Kearl oil sands expansion project in Alberta  Canada ahead of schedule.",
        "date": "06162015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil's Kearl oil sands expansion project begins production "
    },
    {
        "content": "CALGARY  Alberta  May 25 A wildfire raging in northeastern Alberta has shut down around 233 000 barrels per day (bpd) of production at three oil sands projects and is expected to remain out of control for \"some while yet \" a provincial government spokesman said on Monday.",
        "date": "05252015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 2-Wildfire shuts down about 9 pct of Alberta crude output "
    },
    {
        "content": "TORONTO/CALGARY  May 15 Imperial Oil Ltd   Canada's No. 2 integrated oil producer and refiner  is accepting proposals from interested bidders for 500 of its remaining company-owned Esso retail sites  according to four sources familiar with the process.",
        "date": "05152015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 1-Imperial Oil begins to accept proposals for Esso stations -sources "
    },
    {
        "content": "TORONTO/CALGARY  May 15 Imperial Oil  Canada's No. 2 integrated oil producer and refiner  is moving forward on plans to sell some 500 of its remaining company-owned Esso retail sites and has begun to accept proposals from interested bidders  according to four sources familiar with the process.",
        "date": "05152015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil begins to accept proposals for Esso stations-sources "
    },
    {
        "content": "April 30 Imperial Oil Ltd  Canada's No.2 integrated oil producer and refiner  on Thursday reported a 55 percent fall in quarterly profit as global crude prices halved.",
        "date": "04302015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 2-Weak global crude prices hurt Imperial Oil profit "
    },
    {
        "content": "CALGARY  Alberta  April 30 Canadian Oil Sands Ltd  the largest shareholder in the Syncrude Canada Ltd joint venture  said on Thursday it swung to a loss in the first quarter as oil prices dropped by more than half.",
        "date": "04302015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Canadian Oil Sands posts loss  says cost cut paying off "
    },
    {
        "content": "CALGARY  Alberta  April 30 Canada's Imperial Oil  has loaded and dispatched the first train from its 210 000 barrel-per-day Edmonton crude oil rail terminal  the company said during its annual general meeting in Calgary on Thursday.",
        "date": "04302015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil says first train has left Edmonton crude oil terminal "
    },
    {
        "content": "April 30 Imperial Oil Ltd   Canada's No.2 integrated oil producer and refiner  reported a 55 percent fall in quarterly profit in a period in which crude prices halved.",
        "date": "04302015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "CORRECTED-Imperial Oil profit falls 55 percent "
    },
    {
        "content": "Feb 2 Imperial Oil Ltd's Kearl oil sands project expansion will start ahead of schedule  the company said on Monday  in the latest sign that weak crude prices are failing to dent oil sands growth.",
        "date": "02022015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "UPDATE 2-Imperial Oil 4th-qtr profit falls  Kearl expansion to start early "
    },
    {
        "content": "Feb 2 Imperial Oil Ltd   Canada's second-largest integrated oil producer and refiner  posted a 36.5 percent fall in quarterly profit  hurt by lower crude prices and weaker refining margins.",
        "date": "02022015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Imperial Oil profit slumps as oil prices plunge "
    },
    {
        "content": "CALGARY  Alberta  Jan 28 Canada's No. 2 integrated oil producer and refiner Imperial Oil Ltd  said on Wednesday it is considering selling 475 company-owned Esso gas stations.",
        "date": "01282015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "Imperial mulls sale of nearly 500 Esso-branded gas stations "
    },
    {
        "content": "CALGARY  Alberta  Jan 19 Imperial Oil Ltd   Canada's No.2 integrated oil producer and refiner  said on Monday it has begun injecting steam at the 40 000 barrel per day Nabiye expansion of its Cold Lake oil sands project in northern Alberta and expects first oil from the project by the end of March.",
        "date": "01192015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "Imperial readies production from 40 000 bpd oil sands expansion "
    },
    {
        "content": "CALGARY  Alberta  Jan 20 Canada's oil sands companies are perilously close to operating at a loss after six months of plunging crude prices  yet many say they have no plans to cut production at their vast projects in northern Alberta.",
        "date": "01202015",
        "name": "Imperial Oil Limited",
        "news_type": "normal",
        "symbol": "IMO",
        "title": "Canadian oil sands producers stay defiant in face of price slump "
    },
    {
        "content": "CALGARY  Alberta  Jan 12 Exxon Mobil Corp  and its Canadian affiliate Imperial Oil Ltd  plan to spend up to C$25 billion ($21 billion) on a liquefied natural gas facility on British Columbia's northern Pacific coast  the two companies said in documents filed with the province's environmental regulator.",
        "date": "01122015",
        "name": "Imperial Oil Limited",
        "news_type": "topStory",
        "symbol": "IMO",
        "title": "Exxon says Canada LNG plans to cost up to C$25 billion "
    }
]