[
    {
        "content": "* Inc Research Holdings - Net service revenue for the three months ended September 30  2017 increased by $332.7 million  or 128.2%  to $592.2 million‍​",
        "date": "11092017",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-Inc Research Holdings qtrly GAAP diluted loss per share of $1.70‍​ "
    },
    {
        "content": "* INC Research Holdings Inc says  on August 1  2017  Inc Research Holdings  Inc entered into credit agreement - SEC filing",
        "date": "08012017",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-INC Research Holdings Inc says on August 1  2017  co entered into credit agreement "
    },
    {
        "content": "July 11 Private equity firm EQT said on Tuesday it has agreed to acquire U.S. drug development consultancy Certara for $850 million  including debt  from Arsenal Capital Partners  another buyout firm.",
        "date": "07112017",
        "name": "INC Research Holdings Inc",
        "news_type": "normal",
        "symbol": "INCR",
        "title": "UPDATE 1-EQT to acquire pharmaceutical services firm Certara "
    },
    {
        "content": "* INC research - in event of termination by Inventiv following change of recommendation by board  co would be required to pay Inventiv termination fee of $82.1 million",
        "date": "05102017",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-INC Research would be required to pay Inventiv $82.1 mln  in event of termination by Inventiv "
    },
    {
        "content": "INC Research Holdings Inc  said on Wednesday it would merge with private equity-owned inVentiv Health Inc  a fellow contract research services provider  in a $4.6 billion all-stock deal to help it win contracts with large pharma companies.",
        "date": "05102017",
        "name": "INC Research Holdings Inc",
        "news_type": "normal",
        "symbol": "INCR",
        "title": "INC Research to merge with inVentiv in latest contract medical research deal "
    },
    {
        "content": "* INC shares rise 19 pct  biggest one-day pct jump ever (Adds comments from inVentiv CEO  analyst; updates shares)",
        "date": "05102017",
        "name": "INC Research Holdings Inc",
        "news_type": "normal",
        "symbol": "INCR",
        "title": "UPDATE 3-INC Research to merge with inVentiv in latest contract medical research deal "
    },
    {
        "content": "* Inc research holdings inc - transaction estimated to realize approximately $100 million in annual run-rate cost synergies and projected to be accretive to adjusted eps",
        "date": "05102017",
        "name": "INC Research Holdings Inc",
        "news_type": "normal",
        "symbol": "INCR",
        "title": "BRIEF-INC Research and inVentiv Health to merge "
    },
    {
        "content": "May 10 INC Research Holdings Inc  which provides medical firms with clinical research services  said on Wednesday it would buy privately held inVentiv Health Inc in a deal valued at about $4.6 billion.",
        "date": "05102017",
        "name": "INC Research Holdings Inc",
        "news_type": "normal",
        "symbol": "INCR",
        "title": "Contract medical research firm INC to buy inVentiv in $4.6 bln deal "
    },
    {
        "content": "* Inc Research appoints William E. Klitgaard and Linda S. Harty to board of directors  Source text for Eikon: Further company coverage:",
        "date": "03032017",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-Inc Research appoints William E. Klitgaard and Linda S. Harty to board "
    },
    {
        "content": "* INC Research reports fourth quarter and full year 2016 results",
        "date": "02282017",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-INC Research Holdings Q4 revenue $406.1 million "
    },
    {
        "content": "* INC Research further strengthens board of directors through appointment of pharmaceutical executive Eric P. Pâques  Source text for Eikon:  Further company coverage:",
        "date": "02082017",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-INC Research further strengthens board of directors "
    },
    {
        "content": "* INC Research announces updates to board of directors  Source text for Eikon:  Further company coverage:",
        "date": "10312016",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-INC Research reports updates to board of directors "
    },
    {
        "content": "* INC Research announces secondary offering and repurchase of common stock",
        "date": "08162016",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-INC Research announces secondary offering  repurchase of common stock "
    },
    {
        "content": "* Avista capital partners affiliates of ontario teachers' pension plan  to offer secondary offering 5 million of co's class a shares  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08012016",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-INC Research announces secondary offering of 5 milion shares "
    },
    {
        "content": "* Inc research announces transition of ceo role from jamie macdonald  to coo alistair macdonald effective oct. 1  2016  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "07282016",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-INC Research says Alistair Macdonald to succeed Jamie Macdonald as CEO "
    },
    {
        "content": "* Increased full year net service revenue guidance to $1 030 million to $1 040 million and adjusted diluted EPS guidance to $2.39 to $2.50",
        "date": "07282016",
        "name": "INC Research Holdings Inc",
        "news_type": "normal",
        "symbol": "INCR",
        "title": "BRIEF-Inc Research qtrly GAAP diluted EPS of $0.54 "
    },
    {
        "content": "* Says intend to offer for sale in an underwritten secondary offering 8 million shares of company's class A common stock  Source text for Eikon:  Further company coverage:    (Bengaluru newsroom)",
        "date": "05022016",
        "name": "INC Research Holdings Inc",
        "news_type": "topStory",
        "symbol": "INCR",
        "title": "BRIEF-Inc Research Holdings to offer 8 mln shares of its Class A stock "
    },
    {
        "content": "* Q1 earnings per share view $0.52 -- Thomson Reuters I/B/E/S",
        "date": "05022016",
        "name": "INC Research Holdings Inc",
        "news_type": "normal",
        "symbol": "INCR",
        "title": "BRIEF-INC Research reports Q1 adj. earnings per share $0.58 "
    }
]