[
    {
        "content": "* ‍IHS Markit reaffirms 2017 guidance  provides 2018 guidance​",
        "date": "11132017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-‍IHS Markit reaffirms 2017 guidance  provides 2018 guidance​ "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd ups share stake in Mastercard to 923 068 class a shares from 267 006 class a shares",
        "date": "11142017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-Temasek Holdings (Private) Ltd ups share stake in Mastercard  Visa and Monsanto "
    },
    {
        "content": "LONDON Britain's economy appears to be picking up speed  according to a survey on Friday that will reassure the Bank of England a day after it raised interest rates for the first time a decade.",
        "date": "11032017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "UK economy peps up  bolstering BoE rate hike call: PMI "
    },
    {
        "content": " (Corrects name of firm to IHS Markit)     By David Milliken     LONDON  Nov 1 British manufacturers reported robust growth last month and rising inflation pressure  an industry survey showed  adding to the chances that the Bank of England will raise interest rates on Thursday for the first time in a decade.     The IHS Markit/CIPS manufacturing purchasing managers' index (PMI) rose to 56.3 in October from an upwardly revised 56.0 in September. That exceeded its long-run average and ",
        "date": "11012017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "CORRECTED-UPDATE 1-UK factories report stronger activity in October - IHS Markit "
    },
    {
        "content": "* PMI points to Q3 GDP growth of 0.6-0.7 pct -IHS Markit (Adds comment  detail)",
        "date": "10242017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "UPDATE 1-Euro zone business remained strong as prices rise sharply -PMI "
    },
    {
        "content": "LONDON British households' financial worries have eased to their lowest since June  despite the prospect of higher Bank of England interest rates and a reliance on borrowing to make up for falling employment income  a survey showed on Monday.",
        "date": "10232017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "UK households' morale and rate hike expectations rise - IHS Markit "
    },
    {
        "content": "LONDON  Oct 24 The Bank of England is widely expected to raise interest rates for the first time in more than 10 years on Nov. 2  after the next meeting of its Monetary Policy Committee.",
        "date": "10242017",
        "name": "IHS Markit Ltd",
        "news_type": "normal",
        "symbol": "INFO",
        "title": "Q&A-How will higher Bank of England rates affect Britain's economy? "
    },
    {
        "content": "* As of Friday  volume of crude production still shut-in had declined to about 153 000 b/d down from 324 000 b/d just two days ago",
        "date": "09012017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit provides latest update of impact of tropical storm Harvey "
    },
    {
        "content": "* IHS Markit Ltd. announces closing of senior notes offering Source text for Eikon: Further company coverage:",
        "date": "07132017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit announces closing of senior notes offering "
    },
    {
        "content": "* IHS Markit Ltd - Pricing of its offering of an additional $300 million in aggregate principal amount of its 4.75 percent senior notes due 2025",
        "date": "07102017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit announces pricing of senior notes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  July 10 (Fitch) IHS Markit Ltd. (IHS Markit; Nasdaq: INFO) announced today it is offering $250 million of additional notes under the indenture governing its existing $500 million 4.75% senior notes due 2025 (Fitch's 'BBB' rating is unaffected by this issuance).  IHS Markit stated it intends to use the net proceeds from the offering for general corporate purposes which may include repayment of indebtedness or share repurchases.",
        "date": "07102017",
        "name": "IHS Markit Ltd",
        "news_type": "normal",
        "symbol": "INFO",
        "title": "Fitch's Ratings for IHS Markit Unaffected by Add-On Offering "
    },
    {
        "content": "* IHS Markit Ltd - ‍it intends to offer an additional $250 million in aggregate principal amount of its 4.75 percent senior notes due 2025​ Source text for Eikon: Further company coverage:",
        "date": "07102017",
        "name": "IHS Markit Ltd",
        "news_type": "normal",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit announces offering of senior notes "
    },
    {
        "content": "* IHS Markit Ltd - for year ending November 30  2017  IHS Markit expects revenue in a range of $3.490 billion to $3.560 billion",
        "date": "06272017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit reports qtrly adjusted earnings of $ 0.52/shr "
    },
    {
        "content": "LONDON Proposals by a G20-backed task force for companies to disclose how they manage climate risks would mislead investors and distort markets  according to research by analytics and data provider IHS Markit on Thursday.",
        "date": "05112017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "Company climate risk disclosure would distort markets: IHS Markit "
    },
    {
        "content": "LONDON  May 11 Proposals by a G20-backed task force for companies to disclose how they manage climate risks would mislead investors and distort markets  according to research by analytics and data provider IHS Markit on Thursday.",
        "date": "05112017",
        "name": "IHS Markit Ltd",
        "news_type": "normal",
        "symbol": "INFO",
        "title": "Company climate risk disclosure would distort markets -IHS Markit "
    },
    {
        "content": "* FY2017 EARNINGS PER SHARE VIEW $2.06  REVENUE VIEW $3.53 BILLION -- THOMSON REUTERS I/B/E/S Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS MARKIT LTD REAFFIRMS 2017 GUIDANCE "
    },
    {
        "content": "* Total 2017 global light vehicle sales will reach 93.5 million units  up 1.5 percent over 2016 -- IHS Markit forecast",
        "date": "02212017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-Total 2017 global light vehicle sales will reach 93.5 mln units  up 1.5 pct -- IHS Markit forecast "
    },
    {
        "content": "* Reaffirms and expects FY17 revenue in a range of $3.490 billion to $3.560 billion",
        "date": "02162017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit reaffirms guidance "
    },
    {
        "content": "* PRICING OF ITS OFFERING OF $500 MILLION IN AGGREGATE PRINCIPAL AMOUNT OF SENIOR NOTES DUE 2025",
        "date": "02062017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS MARKIT ANNOUNCES PRICING OF SENIOR NOTES "
    },
    {
        "content": "* IHS Markit Ltd says intends to offer $500 million in aggregate principal amount of senior notes",
        "date": "02062017",
        "name": "IHS Markit Ltd",
        "news_type": "normal",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit Ltd announces offering of senior notes "
    },
    {
        "content": "* IHS Markit Ltd - increases size of authorization; extends through may 2018",
        "date": "01302017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit modifies share repurchase authorization "
    },
    {
        "content": "* On January 26  2017 company and unit entered into a new credit agreement - SEC filing",
        "date": "01262017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit enters new credit agreement "
    },
    {
        "content": "* IHS markit reports fourth quarter and fiscal year 2016 results",
        "date": "01172017",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit reports fourth quarter results "
    },
    {
        "content": "* Sees FY 2016 revenue trending slightly below range of $2.735 billion to $2.765 billion",
        "date": "11142016",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit Ltd reaffirms 2016 Guidance  Provides 2017 Guidance "
    },
    {
        "content": "* On Sept 27   co said  in August  board modified previously authorized $500 million share repurchase program to terminate on September 29",
        "date": "09282016",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "BRIEF-IHS Markit to terminate previously authorized $500 million share repurchase program "
    },
    {
        "content": "Apple Inc  is spending more to manufacture its iPhone 7 smartphone than predecessor iPhone 6S due to features such as a bigger battery and larger storage capacity  according to a teardown by IHS Markit Ltd .",
        "date": "09202016",
        "name": "IHS Markit Ltd",
        "news_type": "topStory",
        "symbol": "INFO",
        "title": "Apple's iPhone 7 more expensive to make: IHS Markit "
    },
    {
        "content": "Sept 20 Apple Inc is spending more to manufacture its iPhone 7 smartphone than predecessor iPhone 6S due to features such as a bigger battery and larger storage capacity  according to a teardown by IHS Markit Ltd.",
        "date": "09202016",
        "name": "IHS Markit Ltd",
        "news_type": "normal",
        "symbol": "INFO",
        "title": "Apple's iPhone 7 more expensive to make - IHS Markit "
    }
]