[
    {
        "content": "Oct 31 Indian shares fell on Tuesday  retreating from record highs hit in the previous session  as recent outperformers such as State Bank of India fell  while Infosys Ltd dropped after going ex-dividend.",
        "date": "10312017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares fall on profit-booking; Infosys drags "
    },
    {
        "content": "* Infosys founder N. Murthy: stand by every question on poor governance raised in my speech to Infosys investors",
        "date": "10242017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys founder Murthy says questions on \"poor governance\" remain unanswered "
    },
    {
        "content": "* Says Sept quarter annualized standalone employee attrition at 17.2 percent ‍​",
        "date": "10242017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys reaffirms previous findings of external probe into Panaya acquisition "
    },
    {
        "content": "Oct 24 Infosys Ltd  India's second-biggest software services exporter  reported a surprise 3.3 percent rise in second-quarter profit  beating analysts' estimates.",
        "date": "10242017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys posts surprise 3.3 pct rise in Q2 profit "
    },
    {
        "content": "* Sept quarter consol profit 37.26 billion rupees versus profit of 36.06 billion rupees last year",
        "date": "10242017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys Sept-qtr consol profit up about 3 pct "
    },
    {
        "content": "Oct 10 Indian shares climbed on Tuesday  with Infosys Ltd gaining after its shareholders approved a buyback plan while Lupin Ltd rose after winning U.S. approval for its hypertension drug.",
        "date": "10102017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares edge higher; Infosys  Lupin lead "
    },
    {
        "content": "* Says Infosys Finacle partners with ToneTag to offer sound-based contactless payments solutions ‍​ Source text: http://bit.ly/2hnhLrK Further company coverage:",
        "date": "09222017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys Finacle partners with ToneTag to offer sound-based contactless payments solutions "
    },
    {
        "content": "* Says Sanjay Rajagopalan's (senior vice president  head - design & research) last date of employment with Infosys was Sept 13  2017​ Source text: http://bit.ly/2hcN644 Further company coverage:",
        "date": "09192017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys Senior VP Sanjay Rajagopalan resigned on Sept. 13 "
    },
    {
        "content": "* CMA CGM GROUP SIGNS STRATEGIC PARTNERSHIP WITH INFOSYS TO ACCELERATE TRANSFORMATION OF ITS INFORMATION SYSTEMS‍​",
        "date": "09182017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys and CMA CGM Group sign strategic partnership "
    },
    {
        "content": "* Says ‍will open North Carolina Technology and Innovation Hub in Raleigh; hub is expected to hire 2 000 American workers by 2021​ Source text for Eikon: Further company coverage:",
        "date": "09122017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys Ltd says ‍will open North Carolina Technology and Innovation Hub in Raleigh "
    },
    {
        "content": "* Says Infosys completes acquisition of Brilliant Basics - digital innovation and customer experience studio Source text - http://bit.ly/2xeDD1Y Further company coverage:",
        "date": "09112017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys completes acquisition of Brilliant Basics "
    },
    {
        "content": "* Says co inducted into Dow Jones Sustainability indices Source text - [Infosys Inducted into the Index Component of Dow Jones Sustainability Indices (DJSI) Bangalore - September 8  2017: Infosys has been inducted into the prestigious Dow Jones Sustainability Indices (DJSI) announced on September 7  2017 and is now part of the DJSI World and DJSI Emerging Markets Indices.] Further company coverage:",
        "date": "09082017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys inducted into Dow Jones Sustainability indices "
    },
    {
        "content": "* Says establishes new office in Netherlands Source text: [Infosys (NYSE: INFY)  a global leader in consulting  technology and next-generation services  today announced the opening of a new state-of-the-art office space in Amsterdam. The office was inaugurated by the Deputy Mayor of Amsterdam  Ms. Kajsa Ollongren  together with the Indian Ambassador to The Netherlands  Mr. Venu Rajamony  in the presence of Mr. Mohit Joshi  President and Head of Banking  Financial Services and Insurance  Healthca",
        "date": "09072017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys establishes new office in Netherlands "
    },
    {
        "content": "* Says started engaging in shareholder consultations to determine further actions",
        "date": "09012017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys starts shareholder talks on governance standards actions "
    },
    {
        "content": "MUMBAI  Aug 29 Infosys Ltd founder Narayana Murthy on Tuesday defended his role in a months-long war of words with the company's board that led to changes at the top  saying his actions were in the interest of shareholders.",
        "date": "08292017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "UPDATE 1-Infosys founder Murthy defends role in boardroom feud "
    },
    {
        "content": "* Infosys says some founders to participate in stock buyback (Adds founders to participate in share buyback)",
        "date": "08282017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "UPDATE 2-Infosys shares rise as co-founder Nilekani returns as chairman "
    },
    {
        "content": "MUMBAI  Aug 29 Infosys Ltd founder Narayana Murthy on Tuesday defended his role in a months-long war of words with the company's board that led to changes at the top  saying his actions were in the interest of shareholders.",
        "date": "08292017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys founder Murthy defends role in boardroom feud "
    },
    {
        "content": "Aug 28 Indian shares ended higher for a fourth consecutive session on Monday  as Infosys rallied to become top performer on both indexes on hopes that appointment of co-founder Nandan Nilekani as chairman could end a feud between the founders and board.",
        "date": "08282017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares end higher for 4th straight session; Infosys rallies "
    },
    {
        "content": "* Founder Narayana Murthy says believes corrective actions on corporate governance have already begun with Nilekani as co's chair Further company coverage:",
        "date": "08292017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys founder Murthy believes corrective actions on corporate governance already begun with Nilekani as chair "
    },
    {
        "content": "* Founder Narayana Murthy says \"contrary to the views of many  my action only in interest for all investors\" - CNBC TV 18",
        "date": "08292017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys founder Narayana Murthy says \"my action only in interest for all investors\" - CNBC TV 18 "
    },
    {
        "content": "Aug 28 Indian shares rose on Monday  heading for a fourth consecutive session of gains  as Infosys Ltd surged on the first day of trading since the appointment of co-founder Nandan Nilekani as chairman on hopes that the move would help defuse a months-long row between the founders and the board.",
        "date": "08282017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares head for 4th session of gains; Infosys leads "
    },
    {
        "content": " (This Aug 25 story corrects paragraph 21 to show U.S.-listed shares trade on NYSE  not Nasdaq)",
        "date": "08282017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys' new chairman to focus on CEO search  strategy "
    },
    {
        "content": "* Sees tremendous opportunity in software  data  machine learning",
        "date": "08282017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "CORRECTED-UPDATE 3-Infosys' new chairman to focus on CEO search  strategy "
    },
    {
        "content": "MUMBAI  Aug 28 Shares of Infosys Ltd rose as much as 4.6 percent on Monday  after co-founder Nandan Nilekani returned as chairman raising hopes that a months-long row between the board and the founders of the country's second-biggest software services exporter will be resolved.",
        "date": "08282017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys shares jump after Nilekani named non-exec chairman "
    },
    {
        "content": "MUMBAI/BENGALURU The return of former boss Nandan Nilekani to Infosys is intended as a return to normality for investors and the tech company's 200 000 employees  drawing a line under the bitter public battle between board members and founders.",
        "date": "08252017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Challenges ahead as Nilekani takes on second innings at Infosys "
    },
    {
        "content": "MUMBAI  Aug 23 A group of 12 major institutional investors in Infosys Ltd has asked the Indian IT services company to bring former CEO Nandan Nilekani back on to its board to try to resolve a feud with the company's founders.",
        "date": "08232017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Investors want former CEO Nilekani to return to Infosys board "
    },
    {
        "content": "MUMBAI A planned $2 billion share buyback by Infosys failed to lift shares in India's No. 2 IT services company  which dropped on Monday for a second straight trading day on concerns over a dispute between its board and founders.",
        "date": "08212017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys shares extend losses as leadership issues outweigh share buyback "
    },
    {
        "content": "MUMBAI  Aug 24 The board of Indian IT services company Infosys Ltd appointed one of its founders and former CEO Nandan Nilekani as chairman on Thursday  seeking to end a feud between management and founders that prompted its CEO to step down last week.",
        "date": "08242017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "CORRECTED-UPDATE 1-Nilekani returns to Infosys as chairman as board tries to end feud with founders "
    },
    {
        "content": "MUMBAI  Aug 25 Infosys Ltd's new chairman said he would focus on finding a chief executive  reconstituting the board and future strategy  seeking to calm investors rattled by the recent shock exit of the firm's CEO over a prolonged row with the founders.",
        "date": "08252017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys chairman says to focus on CEO search  new board and strategy "
    },
    {
        "content": "MUMBAI  Aug 21 A planned $2 billion share buyback by Infosys failed to lift shares in India's No. 2 IT services company  which dropped on Monday for a second straight trading day on concerns over a dispute between its board and founders.",
        "date": "08212017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 1-Infosys shares extend losses as leadership issues outweigh share buyback "
    },
    {
        "content": "MUMBAI  Aug 24 The board of Indian IT services company Infosys Ltd appointed former chief Nandan Nilekani as chairman on Thursday  as it sought to end a row with founder executives that prompted its CEO to step down last week.",
        "date": "08242017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "CORRECTED-Infosys appoints former chief Nilekani as chairman in bid to settle feud "
    },
    {
        "content": "* India's Infosys Ltd says appoints Nandan Nilekani as non-exec non-independent chairman of board",
        "date": "08242017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys appoints former CEO Nilekani as chairman "
    },
    {
        "content": "MUMBAI Indian IT services firm Infosys named Nandan Nilekani  one of its founders and former heads  as chairman on Thursday in a bid to end a lengthy feud between the board and the company's founders.",
        "date": "08252017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys names former chief Nilekani as chairman  defusing feud with founders "
    },
    {
        "content": "* Nandan Nilekani takes over as chairman with immediate effect",
        "date": "08252017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "REFILE-UPDATE 2-Infosys names former chief Nilekani as chairman  defusing feud with founders "
    },
    {
        "content": "* Institutional investors call for Nilekani's return to quell feud",
        "date": "08242017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 1-Reports of Infosys co-founder Nilekani's board return trigger stock rebound "
    },
    {
        "content": "MUMBAI (Reuters Breakingviews) - Infosys' founders are getting a second chance to leave behind a company that won't crash. Nandan Nilekani will return as non-executive chairman of the $32 billion Indian information technology firm he helped found. That is less than ideal given it was supposed to have shifted to professional management. Still  his appointment in place of two co-chairman streamlines the top ranks and is a fast way to calm investors after its first outside chief executive quit.",
        "date": "08252017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Breakingviews - Infosys founders get second chance on succession "
    },
    {
        "content": "BENGALURU/MUMBAI Vishal Sikka  the chief executive brought in to turn around India's Infosys  three years ago  resigned on Friday  blaming a \"continuous drumbeat of distractions\" and a long-running row with the founders over company strategy. | Video ",
        "date": "08182017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys CEO resigns after long-running feud with founders "
    },
    {
        "content": "Aug 16 India's Infosys Ltd said on Wednesday its board will consider a proposal  to buy back equity shares  at its meeting later this month.",
        "date": "08162017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "India's Infosys to consider share buyback proposal "
    },
    {
        "content": "Aug 17 Indian shares ended nearly flat on Thursday paring early gains due to a decline in banking shares  while a surge in market heavyweight Infosys Ltd after the announcement of a probable share buyback propped up the indexes.",
        "date": "08172017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares little changed; Infosys gains "
    },
    {
        "content": "* Resignation comes after protracted row with founders (Writes through  adds detail  background  Murthy and Infosys comments)",
        "date": "08182017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 4-Infosys CEO resigns after long-running feud with founders "
    },
    {
        "content": "* India's Infosys' chairman says there will be no change to our buyback plan",
        "date": "08182017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys' chairman says co has no interest in engaging in legal battle against Murthy "
    },
    {
        "content": "Aug 18 Major events at Infosys Ltd since the appointment of Vishal Sikka as chief executive officer three years ago. Sikka resigned on Friday.",
        "date": "08182017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "RPT-TIMELINE-Infosys CEO Sikka resigns  bruised by disputes with founders "
    },
    {
        "content": "Major events at Infosys Ltd since the appointment of Vishal Sikka as chief executive officer three years ago. Sikka resigned on Friday.",
        "date": "08182017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "TIMELINE: Infosys CEO Sikka resigns  bruised by disputes with founders "
    },
    {
        "content": "* Founder Narayana Murthy says \"extremely anguished by the allegations  tone and tenor of the statements\"",
        "date": "08182017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys Founder Murthy says \"extremely anguished by allegations  tone and tenor of the statements\" "
    },
    {
        "content": "MUMBAI (Reuters Breakingviews) - For Infosys  a new chief executive is not the answer. Vishal Sikka delivered outsize returns in three years at the helm of India's second largest outsourcer by market value. No wonder that the resignation of the company's first professional CEO amid an ugly spat with founder shareholders prompted a roughly 9 percent plunge in the share price.",
        "date": "08182017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Founders’ coup leaves a void at Infosys "
    },
    {
        "content": "Aug 18 Indian shares fell on Friday  snapping a three-day winning streak  as Infosys Ltd Chief Executive Vishal Sikka's resignation sent the stock tumbling  although rivals such as Tata Consultancy Services Ltd gained.",
        "date": "08182017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares fall as Infosys CEO resignation hurts "
    },
    {
        "content": "MUMBAI India's second-biggest IT firm Infosys  said on Saturday it will buy back shares worth up to 130 billion rupees ($2 billion)  a day after Vishal Sikka resigned as chief executive after a long-running feud with the company's founders.",
        "date": "08192017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "India's Infosys approves up to $2 billion buyback of shares "
    },
    {
        "content": "* Exec says board is incredibly committed to strategic direction articulated by Vishal Sikka",
        "date": "08182017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys' Sikka says absolutely focussed on Q2  rest of the year "
    },
    {
        "content": "Aug 18 Infosys Ltd said on Friday Vishal Sikka has resigned as managing director and chief executive of the company with immediate effect.",
        "date": "08182017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys CEO and MD Sikka resigns "
    },
    {
        "content": "MUMBAI  Aug 19 India's second-biggest IT firm Infosys said on Saturday it will buy back shares worth up to 130 billion rupees ($2 billion)  a day after Vishal Sikka resigned as chief executive after a long-running feud with the company's founders.",
        "date": "08192017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 2-India's Infosys approves up to $2 bln buyback of shares "
    },
    {
        "content": "* Ongoing spat between founders  board complicates CEO search",
        "date": "08192017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "After CEO's dramatic exit  Infosys faces recruitment headache "
    },
    {
        "content": "MUMBAI  Aug 19 India's second-biggest IT firm Infosys said on Saturday it will buy back shares worth up to 130 billion rupees ($2 billion)  a day after Vishal Sikka resigned as chief executive after a long-running feud with the company's founders.",
        "date": "08192017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "CORRECTED-UPDATE 1-India's Infosys approves up to $2 bln buyback of shares "
    },
    {
        "content": "MUMBAI  Aug 19 The board of India's second biggest IT firm  Infosys Ltd  on Saturday approved a share buyback programme of up to 130 billion rupees ($2.03 billion)  a day after Vishal Sikka resigned as chief executive after a long-running feud with the company's founders.",
        "date": "08192017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys approves up to $2 bln buyback of shares "
    },
    {
        "content": "* Infosys to acquire digital innovation and customer experience studio  Brilliant Basics",
        "date": "08032017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys to buy digital studio Brilliant Basics "
    },
    {
        "content": "July 20 Indian shares fell on Thursday  dragged down by IT stocks such as Infosys Ltd  while investors await quarterly results from Wipro Ltd and Reliance Industries Ltd due later in the day.",
        "date": "07202017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares end lower; Infosys biggest drag "
    },
    {
        "content": "BENGALURU/MUMBAI  July 20 Wipro Ltd  India's third-largest software services exporter  announced an up to 110 billion rupee ($1.71 billion) share buyback on Thursday  overshadowing a tepid revenue forecast that fell short of market expectations.",
        "date": "07202017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 2-India's Wipro announces up to $1.7 bln share buyback as Q2 forecast disappoints "
    },
    {
        "content": "BENGALURU/MUMBAI Infosys Ltd  India's No. 2 software services exporter  eked out a slight rise in first-quarter profit  although the outlook for more earnings gains remains cloudy due to higher labor costs and unfavorable currency rates.",
        "date": "07142017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys manages slight first-quarter profit increase  labor costs cloud outlook "
    },
    {
        "content": "* Keeps constant currency revenue growth guidance at 6.5-8.5 pct",
        "date": "07142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 2-Infosys manages slight Q1 profit increase  labour costs cloud outlook "
    },
    {
        "content": "* Exec says no slowdown in hiring in India  hiring in U.S. Not going to impact hiring in India Further company coverage: (Reporting By Arnab Paul and Laharee Chatterjee in BANGALORE)",
        "date": "07142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys exec: no slowdown in hiring in India  hiring in U.S. not going to impact India hiring "
    },
    {
        "content": "* Q1 net profit 34.83 bln rupees vs 34.39 bln rupees analysts f'casts",
        "date": "07142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "CORRECTED-UPDATE 1-India's Infosys reports Q1 profit growth on client wins "
    },
    {
        "content": "July 14 Infosys Ltd  India's second-biggest software services exporter  reported a 1.4 percent increase in first-quarter profit on Friday  slightly beating street estimates  helped by key client wins.",
        "date": "07142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "CORRECTED-India's Infosys reports Q1 profit growth on client wins "
    },
    {
        "content": "July 14 Infosys CEO Vishal Sikka  CFO M.D. Ranganath and COO Pravin Rao at a TV conference. Infosys exec says:",
        "date": "07142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys exec says will need to watch rupee as it continues to be uncertain "
    },
    {
        "content": "* Says FY 18 revenue guidance retained at 6.5%-8.5% in constant currency; FY 18 operating margin guidance retained at 23%-25%",
        "date": "07142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys maintains FY 18 revenue forecast at 6.5 pct-8.5 pct in constant currency "
    },
    {
        "content": "* Says approved revised compensation structure of CFO M D Ranganath",
        "date": "07142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys approves revised compensation structure of CFO M D Ranganath "
    },
    {
        "content": "* Consensus forecast for June quarter consol profit was 34.39 billion rupees",
        "date": "07142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys June-qtr consol profit up about 1.4 pct "
    },
    {
        "content": "* India's Infosys to hire 2 000 US workers in North Carolina by 2021 - statement",
        "date": "07062017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys to hire 2000 staff in North Carolina by 2021 - statement "
    },
    {
        "content": "* Says financial results would be finally approved by board of directors on July 14  2017 Source text for Eikon: Further company coverage:",
        "date": "07062017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys says financial results to be approved by board of directors on July 14 "
    },
    {
        "content": "* Says Active AI joins Infosys Finacle's growing fintech ecosystem.",
        "date": "07042017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys Finacle announces partnership with Singapore's Active.AI "
    },
    {
        "content": "* Signed on June 29  2017  agreement for divestment of entire investment in Cloudyn for total consideration of about $4.4 million",
        "date": "06302017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys announces divestment in Cloudyn Software Ltd "
    },
    {
        "content": "Bengaluru Infosys Ltd  India's second-biggest software services exporter  is re-evaluating its long-term targets because tougher market conditions have made them appear \"daunting\"  the company's chairman said on Saturday.",
        "date": "06242017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "India's Infosys says reassessing long-term goals due to tougher market "
    },
    {
        "content": "Bengaluru  June 24 Infosys Ltd  India's second-biggest software services exporter  is re-evaluating its long-term targets because tougher market conditions have made them appear \"daunting\"  the company's chairman said on Saturday.",
        "date": "06242017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "REFILE-India's Infosys says reassessing long-term goals due to tougher market "
    },
    {
        "content": "* CEO Sikka says the 10 000 Infosys plans to hire in the United States will not come at the cost of Indian jobs",
        "date": "06242017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-No job layoffs happening at India's Infosys - CEO Sikka "
    },
    {
        "content": "MUMBAI An internal investigation by India's Infosys  into alleged improprieties related to two acquisitions by the IT services company found no evidence of wrongdoing  it said on Friday.",
        "date": "06232017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "India's Infosys says internal investigation found no evidence of wrongdoing "
    },
    {
        "content": "* Chairman says there would be net additions in hiring in future  although at a slower pace",
        "date": "06242017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys chairman says re-evaluating long-term goals "
    },
    {
        "content": "MUMBAI  June 23 An internal investigation by India's Infosys into alleged improprieties related to two acquisitions by the IT services company found no evidence of wrongdoing  it said on Friday.",
        "date": "06232017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 2-India's Infosys says internal investigation found no evidence of wrongdoing "
    },
    {
        "content": "MUMBAI  June 23 India's Infosys said on Friday an investigation it  commissioned had found no evidence of wrongdoing in accusations  by an anonymous whistleblower  releasing the findings a day before it holds its annual shareholders meeting.",
        "date": "06232017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys says investigation finds no evidence of wrongdoing "
    },
    {
        "content": "* Says co partners with Infosys for GST solutions Source text for Eikon: Further company coverage:",
        "date": "06082017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Bodhtree Consulting partners with Infosys for GST solutions "
    },
    {
        "content": "June 9 Indian shares fell on Friday  with Infosys dragging benchmark indexes lower following a report its founders were preparing to exit the IT bellwether  while the prospects of a hung parliament in the UK also hurt sentiment.",
        "date": "06092017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares fall; Infosys  UK election results weigh "
    },
    {
        "content": "MUMBAI  June 9 Infosys Ltd on Friday denied a media report that the founders of India's second-biggest software services exporter were looking to sell their entire 12.75 percent stake in the company.",
        "date": "06092017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys denies promoters selling stake in company "
    },
    {
        "content": "MUMBAI  June 9 Infosys Ltd denied a media report on Friday that the founders of India's second-biggest software services exporter were looking to sell their entire 12.75 percent stake in the company.",
        "date": "06092017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 1-India's Infosys denies promoters selling stake in company "
    },
    {
        "content": "Shares in India's Infosys Ltd fell as much as 3.5 percent to their lowest in over a month on Friday after a newspaper reported the company's founders were planning to sell their stakes  citing people familiar with the development.",
        "date": "06092017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys shares fall on media report of stake sale by founders "
    },
    {
        "content": "* Infosys clarifies that news reports on pricing cuts seen by IT industry being attributed to Infosys COO are incorrect",
        "date": "06072017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys says news reports on pricing cuts seen by IT industry attributed to COO are incorrect "
    },
    {
        "content": "* Says launches Boundaryless Data Lake offering powered by its information grid solution on Amazon Web Services",
        "date": "05242017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys launches Boundaryless Data Lake offering on Amazon Web Services "
    },
    {
        "content": "* Says infosys announces strategic alliance with HP Inc to accelerate digital transformation for enterprise Source text for Eikon: Further company coverage:",
        "date": "05252017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys announces strategic alliance with HP Inc "
    },
    {
        "content": "May 25 Indian shares rose on Thursday tracking Asian markets that hit two-year highs after the U.S. Federal Reserve signalled a more cautious approach to future rate hikes  but sentiment was subdued ahead of the expiry of monthly derivative contracts.",
        "date": "05252017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares track Asian peers higher; Infosys leads "
    },
    {
        "content": "SAN FRANCISCO  May 24 Infosys Ltd  the India-based computer services giant  on Wednesday touted its new strategy to hire and train 10 000 American workers over the next two years at the company's annual leadership meeting in San Francisco.",
        "date": "05252017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys touts plan to hire Americans in face of visa pressures "
    },
    {
        "content": "MUMBAI Infosys said its plans to hire thousands of workers in the United States would enable faster deployment of staff in areas such as big data and cloud  dismissing concerns about additional labor costs.",
        "date": "05042017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys plays down cost concerns from U.S. hiring plan "
    },
    {
        "content": "SAN FRANCISCO/MUMBAI India-based IT services firm Infosys Ltd plans to hire 10 000 U.S. workers in the next two years and open four technology centers in the United States  starting with a center this August in Indiana  the home state of U.S. Vice President Mike Pence. | Video ",
        "date": "05022017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys plans to hire 10 000 U.S. workers after Trump targets outsourcing firms "
    },
    {
        "content": "* Analysts say chasing U.S. workers may push up costs (Adds CEO  executive comments  link to Breakingviews column)",
        "date": "05022017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 4-Infosys plans to hire 10 000 U.S. workers after Trump targets outsourcing firms "
    },
    {
        "content": "SAN FRANCISCO  May 1 India-based IT services firm Infosys Ltd said late on Monday that it plans to hire 10 000 American workers in the next two years and open four technology centers in the United States  starting with a center this August in Indiana  the home state of Vice President Mike Pence.",
        "date": "05022017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "RPT-Infosys plans to hire 10 000 American workers  open 4 U.S. tech centers "
    },
    {
        "content": "SAN FRANCISCO  May 1 India-based IT services firm Infosys Ltd said late on Monday that it plans to hire 10 000 American workers in the next two years and open four technology centers in the United States  starting with a center this August in Indiana  the home state of Vice President Mike Pence.",
        "date": "05022017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys plans to hire 10 000 American workers  open 4 U.S. tech centers "
    },
    {
        "content": "April 24 Infosys Ltd  India's second biggest software services exporter  is in the process of expanding its board of directors by inducting two more members  CNBC TV18 reported on Monday.",
        "date": "04242017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys in process of adding two new members to board - report "
    },
    {
        "content": "* Says statement on U.S. president's latest executive order on H-1B visas",
        "date": "04192017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys says continues to invest in local communities in which co operates "
    },
    {
        "content": "* CEO: $20 bln revenue target by 2020 \"incredibly difficult thing\" (Adds CEO comment on revenue target)",
        "date": "04132017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "UPDATE 3-Infosys to return $2 bln to shareholders  appoints co-chairman "
    },
    {
        "content": "April 12 Indian shares ended lower on Wednesday as investors kept to the sidelines ahead of Infosys results on Thursday  while geopolitical concerns continued to weigh on the sentiment.",
        "date": "04122017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares end lower; all eyes on Infosys results "
    },
    {
        "content": "April 13 Indian shares ended lower on Thursday  with the BSE index posting its biggest weekly loss of the year  after Infosys Ltd gave lower-than-expected annual revenue guidance and disappointed with the size of its planned share buyback.",
        "date": "04132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares hit by Infosys; BSE posts worst weekly loss of year "
    },
    {
        "content": "April 12 Indian shares fell on Wednesday  heading for a fourth session of fall in five  as investors exercised caution ahead of the start of the earnings season  while sentiment was also hit by geopolitical concerns.",
        "date": "04122017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares fall; all eyes on Infosys results "
    },
    {
        "content": "* Exec says  incredibly difficult to achieve $20 billion revenue target by 2020",
        "date": "04132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys' exec says incredibly difficult to achieve $20 bln revenue target by 2020 "
    },
    {
        "content": "    * NSE index down 0.18 pct  BSE down 0.17 pct     * Infosys shares fall to over 2-month low     * Wariness about earnings continues - analyst      By Tanvi Mehta     April 13 Indian shares fell on Thursday  dragged by technology stocks  after Infosys Ltd's           revenue outlook and plan to return cash to shareholders fell short of expectations  raising concerns at the start of the earnings reporting season.     Infosys  the country's second-biggest software services exporter  ",
        "date": "04132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares fall as Infosys outlook disappoints "
    },
    {
        "content": "* Exec says strong need to make automation and productivity improvements",
        "date": "04132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys' exec says strong need to make automation and productivity improvements "
    },
    {
        "content": "April 13 Infosys Ltd  India's second-biggest software services exporter  reported a slightly higher-than-expected fourth-quarter profit as the company added more clients in the $100 million-plus category.",
        "date": "04132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys Q4 profit beats estimates on key client wins "
    },
    {
        "content": "MUMBAI/BENGALURU A dispute between the founders and the board of software services company Infosys Ltd over governance spilled into public again on Monday  as founder N.R. Narayana Murthy criticized a pay hike for Chief Operating Officer Pravin Rao.",
        "date": "04032017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys founder criticizes pay hike for operations chief "
    },
    {
        "content": "* March quarter annualized standalone employee attrition at 13.5 percent versus 12.6 percent year ago",
        "date": "04132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys Ltd gross client additions 71 in March-qtr "
    },
    {
        "content": "* Infosys defends COO's pay increase (Updates with Infosys statement)",
        "date": "04032017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 2-Infosys founder criticises pay hike for operations chief "
    },
    {
        "content": "* Recommended a final dividend of INR 14.75 per equity share for the financial year ended March 31  2017",
        "date": "04132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys March-qtr consol profit up 0.2 pct "
    },
    {
        "content": "* Pravin Rao’s compensation revision reflects philosophy of aligning interests of leadership team to long term shareholder interests",
        "date": "04032017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys defends COO's salary hike "
    },
    {
        "content": "MUMBAI  April 3 Text of Narayan Murthy's letter to the media about COO Pravin Rao's compensation. Dear Folks  If you use the contents of this mail  please quote me verbatim and in full. Please do not paraphrase. I have lots of affection for Pravin. Let me state you the facts. I recruited Pravin in 1985 and had nurtured him throughout my stay at Infosys since then. He had been sidelined. He was not even a member of the Executive Council at Infosys in 2013 when I came back. Kris  Shibu",
        "date": "04032017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Full text of Infosys founder Narayana Murthy's letter to the media "
    },
    {
        "content": "April 3 The dispute between founders and board of India's second largest software services company Infosys Ltd over governance issues spilled into the public again as founder Narayana Murthy criticised a salary hike given to Chief Operating Officer Pravin Rao.",
        "date": "04032017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys founder Murthy criticises COO pay hike - reports "
    },
    {
        "content": "SAN FRANCISCO  March 6 Technology services company shares dipped on Monday after the Trump administration announced it would temporarily suspend expedited applications for H-1B visas widely used by foreign tech workers.",
        "date": "03062017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "IT services firm stocks dip after govt suspends fast tech visas "
    },
    {
        "content": "* Says Housing Bank Algeria selects Infosys Finacle to power its operations  Source text - (http://bit.ly/2mRt7JV) Further company coverage:",
        "date": "03072017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys says Housing Bank Algeria selects Infosys Finacle to power operations "
    },
    {
        "content": "* Says approves recommendation in remuneration to COO UB Pravin Rao",
        "date": "02232017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys Ltd approves revision of remuneration to COO Pravin Rao "
    },
    {
        "content": "* Buyback priced at substantial premium to Friday's closing price",
        "date": "02202017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "UPDATE 2-India's TCS announces up to $2.4 bln share buyback "
    },
    {
        "content": "* Says Infosys joins Salesforce partner ecosystem to deliver analytics cloud applications",
        "date": "02072017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys Ltd joins Salesforce partner ecosystem to deliver analytics cloud applications "
    },
    {
        "content": "MUMBAI  Feb 14 Indian IT services group Infosys  on Tuesday continued its efforts to reassure investors and analysts that the software services company was not being distracted by a dispute with its founders over how it was being managed.",
        "date": "02142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys seeks to reassure investors over governance "
    },
    {
        "content": "MUMBAI  Feb 10 The Infosys Ltd board does not want a war of words with the Indian software services company's former leadership to descend into the kind of damaging row seen at Tata  an Infosys boardroom source said on Friday.",
        "date": "02102017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "UPDATE 3-Infosys board keen to avoid Tata-style row - source "
    },
    {
        "content": "Feb 9 Infosys Ltd  India's second-biggest software services exporter  on Thursday denied lapses in governance after reports that its founders had complained about some of the company's decisions  including a pay hike for Chief Executive Vishal Sikka.",
        "date": "02092017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys denies lapses in governance "
    },
    {
        "content": "MUMBAI Infosys Ltd  India's second-biggest software services exporter  on Wednesday said it had already addressed concerns about executive pay after media reported that its founders had complained about decisions including a pay hike for Chief Executive Vishal Sikka.",
        "date": "02082017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys defends decisions after media report of governance concerns "
    },
    {
        "content": "MUMBAI  Feb 14 Indian IT services group Infosys  on Tuesday reassured investors and analysts it was not being distracted by a dispute with its founders over how it was being managed.",
        "date": "02142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 1-Infosys seeks to reassure investors over governance "
    },
    {
        "content": "MUMBAI  Feb 8 Infosys Ltd  India's second-biggest software services exporter  on Wednesday said it had already addressed concerns about executive pay after media reported that its founders had complained about decisions including a pay hike for Chief Executive Vishal Sikka.",
        "date": "02082017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 1-Infosys defends decisions after media report of governance concerns "
    },
    {
        "content": "* On media report of governance concerns says all decisions in overall interest of company  full disclosures already made  Further company coverage:   (Reporting By Sankalp Phartiyal)",
        "date": "02082017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys on governance concerns: all decisions in co interest "
    },
    {
        "content": "MUMBAI Management at Infosys Ltd attempted on Monday to allay concerns that the software services firm was facing a worsening  dispute with its founders over how the company was being run  saying that the board was engaging with the founders  including N.R. Narayana Murthy.",
        "date": "02132017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys management seeks to ease tensions with founders "
    },
    {
        "content": "* CEO says  continue to look for acquisition candidates that fit our profile",
        "date": "02142017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys CEO says continue to look for acquisitions "
    },
    {
        "content": "* Infosys chair says engaging with founders  defends decisions",
        "date": "02132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "REFILE-UPDATE 3-Infosys management seeks to ease tensions with founders "
    },
    {
        "content": "MUMBAI  Feb 13 The board of India's second-biggest software exporter Infosys is engaging with its founders over their allegations of corporate governance lapses  non-executive chairman R. Seshasayee said at a news conference on Monday.",
        "date": "02132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Chairman of India's Infosys says not in \"battle\" with founders "
    },
    {
        "content": "MUMBAI  Feb 13 Infosys Ltd's Chief Executive Vishal Sikka said talk in media on corporate governance issues at the software services firm was \"distracting\" and that he had good relations with the firm's founders  including N.R. Narayana Murthy.",
        "date": "02132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Media talk on Infosys' corporate governance issues \"distracting\" -CEO Sikka "
    },
    {
        "content": "* One area of disappointment has been consulting business and an area the company is squarely focused on",
        "date": "02132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys CEO Sikka: relationship with founders is \"wonderful\" "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_02132017.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     9:30 am: Power Minister Piyush Goyal at NTPC event in New Delhi.          5:30 pm: Government to release January consumer price inflation data in New Delhi.          LIVECHAT- FOREX WEEK AHEAD     FX",
        "date": "02132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Morning News Call - India  February 13 "
    },
    {
        "content": "* Announced its internal carbon price at $10.5 per ton of co2e",
        "date": "01162017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys announces internal carbon price at $10.5 per ton of CO2E "
    },
    {
        "content": "Jan 16 Indian shares ended marginally higher on Monday as gains in financials on positive corporate results offset losses in IT stocks that were down on weak sentiment after software services exporter Infosys Ltd cut its revenue outlook.",
        "date": "01162017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares end slightly higher; IT stocks fall "
    },
    {
        "content": "Jan 16 Indian shares rose a wee bit on Monday as gains in financials on positive corporate results offset losses in IT stocks  which were down on weak sentiment and after software services exporter Infosys Ltd cut its revenue outlook.",
        "date": "01162017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares nudge up; IT stocks down "
    },
    {
        "content": "MUMBAI/BENGALURU Infosys Ltd   India's second-biggest software services exporter  pared its full-year revenue growth outlook as it fights uncertainties in its biggest markets that could curb client spending on technology.",
        "date": "01132017",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys trims revenue outlook as outsourcers brace for tighter U.S. regime "
    },
    {
        "content": "* Sees full-year revenue growing 8.4-8.8 pct in constant currency   (Adds CEO and analyst comment)",
        "date": "01132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 2-Infosys trims revenue outlook as outsourcers brace for tighter US regime "
    },
    {
        "content": "Jan 13 Indian shares edged down on Friday as market heavyweight Tata Consultancy Services Ltd  slumped on worries about its future following key management changes.",
        "date": "01132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares edge down  led by IT stocks "
    },
    {
        "content": "* Exec says Europe business outlook very good for next 12 months  Further company coverage:    (Reporting By Sankalp Phartiyal)",
        "date": "01132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys exec says Europe business outlook very good for next 12 mnths "
    },
    {
        "content": "* Exec says overall expect Trump policies to be business friendly",
        "date": "01132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys exec says downward steady pricing pressure is here to stay "
    },
    {
        "content": "MUMBAI  Jan 13 India's second-biggest software services exporter Infosys Ltd reported on Friday a 7 percent rise in third-quarter net profit on new client wins  beating street estimates.",
        "date": "01132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys Q3 net profit rises 7 pct  beats estimates "
    },
    {
        "content": "* Dec quarter employee attrition (annualized standalone) at 14.9 percent  versus 13.4 percent year ago",
        "date": "01132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys says gross client additions of 77 in Dec qtr "
    },
    {
        "content": "* Revises FY17 sales growth upwards to at 8.4-8.8 pct in constant currency",
        "date": "01132017",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys Dec-qtr consol profit up about 7 pct "
    },
    {
        "content": "* Signed a definitive agreement to a limited partner investment of INR 31.6 crores from its innovation fund",
        "date": "11232016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys invests in Stellaris Venture Partners "
    },
    {
        "content": "* Made an investment of DKK 14 920 000 from its innovation fund in UNSILO",
        "date": "11182016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys invests in artificial intelligence startup UNSILO "
    },
    {
        "content": "BERLIN  Nov 17 Indian software service group Infosys is bracing for pressure on its U.S. business from anti-immigrant policies by U.S. President-elect Donald Trump  who has identified clamping down on immigration as one of his three top priorities.",
        "date": "11172016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys CEO says Trump election may weigh on margins "
    },
    {
        "content": "Nov 17 Indian shares closed lower on Thursday after a choppy session as blue chips such as Infosys Ltd  and Tata Consultancy Services Ltd weighed on the market.",
        "date": "11172016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares end lower; IT firms lead losses "
    },
    {
        "content": "* Infosys Ltd says Infosys revamps council of Europe human resource system  Source text - Infosys (NYSE: INFY)  a leader in consulting  technology  and next-generation services  today announced the deployment of an upgraded human resource management and payroll system for the Council of Europe. The rollout is part of a 10 year on-going partnership  with Infosys managing and customizing the complex HR system for the Strasbourg based leading international human rights organisation. Infosys will al",
        "date": "11142016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys revamps council of Europe human resource system "
    },
    {
        "content": "* Investment will be completed on or before November 24  2016  Source text: http://bit.ly/2eORJNS Further company coverage:",
        "date": "11112016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys invests in software-defined servers provider TidalScale "
    },
    {
        "content": "* Infosys Ltd - company statement: addressing all queries concerning payment to former cfo",
        "date": "10212016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys says certain payments to Rajiv Bansal under agreement have been suspended "
    },
    {
        "content": "MUMBAI/BENGALURU Infosys Ltd  cut its annual revenue growth target for the second time in three months as India's software service exporters feel the pinch of major Western clients holding back on spending as they wait to see how November's U.S. presidential election and Europe's Brexit drama play out.",
        "date": "10142016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys cuts revenue outlook again as clients slow spending ahead of U.S. election  Brexit "
    },
    {
        "content": "Oct 14 Indian shares closed marginally higher on Friday  led by software firm Tata Consultancy Services  after upbeat quarterly profit  but a revenue forecast cut by smaller rival Infosys weighed on the technology index.",
        "date": "10142016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares recover; Infosys falls on forecast cut "
    },
    {
        "content": "Oct 14 Indian shares recovered from the previous session's multi-month lows to trade marginally higher on Friday  with financials leading the gains on prospects of further rate cuts after inflation cooled to a 13-month low in September.",
        "date": "10142016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares edge up; Infosys tumbles on revenue target cut "
    },
    {
        "content": "* Financial services despite challenges have seen good growth",
        "date": "10142016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys exec: continue to see core IT services doing extremely well "
    },
    {
        "content": "* Infosys Ltd - net employee addition was 2 779 in Sept-quarter",
        "date": "10142016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys Sept-qtr net employee addition was 2 779 "
    },
    {
        "content": "* Sept quarter consol revenue from operations 173.10 billion rupees",
        "date": "10142016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys Sept-qtr consol profit up about 6 pct "
    },
    {
        "content": "MUMBAI  Oct 14 Infosys Ltd  India's second-biggest software services exporter  said on Friday its second-quarter net profit rose 6.1 percent  beating market expectations as it racked up new business client wins.",
        "date": "10142016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys Q2 net profit up 6 pct on new client wins  beats estimates "
    },
    {
        "content": "Aug 16 Indian shares ended lower on Tuesday  as software services exporters retreated after Royal Bank of Scotland cancelled a contract with Infosys and as world stocks moved away from one-year peaks amid global concerns.",
        "date": "08162016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares fall in line with global stocks "
    },
    {
        "content": "Aug 16 Indian shares fell on Tuesday as software services exporters declined after Infosys said Royal Bank of Scotland had cancelled a contract  sparking renewed concerns about the outlook for the sector.",
        "date": "08162016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares fall as Infosys drags IT firms lower "
    },
    {
        "content": "* Exec says cloud based services will have a positive impact  Further company coverage:    (Reporting By Anya George Tharakan and Tanvi Mehta)",
        "date": "07152016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys's exec says cloud based services will have a positive impact "
    },
    {
        "content": "NEW DELHI Indian IT services giant Infosys Ltd   warned it won't make its previous revenue target for this fiscal year  cutting its outlook after first-quarter earnings came in below estimates and Britain's vote to exit the European Union left the company with little visibility on future business prospects.",
        "date": "07152016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys cuts annual revenue growth target in Brexit precaution "
    },
    {
        "content": "* No Brexit impact so far  but shares slide 10 pct   (Recasts with target downgrade  adds company comment)",
        "date": "07152016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 1-Infosys cuts annual revenue growth target in Brexit precaution "
    },
    {
        "content": "* Exec says so far brexit has had no impact on us  creates an opportunity for us in the medium to long-term",
        "date": "07152016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys says lowering guidance for the full year "
    },
    {
        "content": "NEW DELHI  July 15 India's second-largest IT services company Infosys Ltd  said on Friday its first-quarter net profit grew 13 percent on new client wins but came in marginally below analysts' estimates  sending Bombay-listed shares sharply lower.",
        "date": "07152016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys Q1 net profit up 13 pct but misses estimates; shares slide "
    },
    {
        "content": "June 9 India's benchmark BSE index fell 0.7 percent on Thursday  retreating from a seven-month high hit a day earlier  as caution set in ahead of the U.S. Federal Reserve meeting  while Infosys slumped on worries about its outlook.",
        "date": "06102016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "CORRECTED-Indian shares retreat after recent gains; Infosys slumps (June 9) "
    },
    {
        "content": "June 9 India's benchmark BSE index fell nearly 1 percent on Thursday  its biggest single-day fall in three weeks  as caution set in ahead of the U.S. Federal Reserve meeting  while Infosys slumped on worries about its outlook.",
        "date": "06092016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "India's BSE index falls most in three weeks "
    },
    {
        "content": "* Infosys and Amazon Web Services collaborate to accelerate cloud migration  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom)",
        "date": "04292016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-Infosys and Amazon Web Services collaborate to accelerate cloud migration "
    },
    {
        "content": "* Has committed to scale its team of dedicated azure consultants to 5 000",
        "date": "04282016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "BRIEF-\u007f\tInfosys deepens relationship with Microsoft "
    },
    {
        "content": "April 18 Indian shares headed for a fourth consecutive session of gains on Monday as investors cheered software services firm Infosys' upbeat revenue forecast and its third successive estimate-beating earnings on new client wins.",
        "date": "04182016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian stocks head for 4th straight gain on Infosys boost "
    },
    {
        "content": "* Sees 11.5-13.5 pct revenue growth this yr at constant currency",
        "date": "04152016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "UPDATE 2-Infosys forecasts stronger growth as it chases $20 bln sales target "
    },
    {
        "content": "* Exec says continuing to invest in employees  announces stock option plan for employees",
        "date": "04152016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys concerned abt industry headwinds  volatility in financial services sector: exec "
    },
    {
        "content": "* Exec says deal pipeline is healthy  Further company coverage:    (Reporting By Himank Sharma in MUMBAI)",
        "date": "04152016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys exec says deal pipeline is healthy "
    },
    {
        "content": "MUMBAI  April 15 India's second-largest IT services company Infosys Ltd reported on Friday a better-than-expected 16 percent rise in fourth-quarter net profit  helped by new client wins.",
        "date": "04152016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys posts better-than-expected 16 pct jump in 4th-qtr profit "
    },
    {
        "content": "March 18 Indian shares rose about 0.7 percent on Friday  heading for their third successive weekly gain  as overseas investors continued pumping money into the emerging markets following the dovish stances by global central banks.",
        "date": "03182016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian stocks set for third straight weekly gain "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_01152016.pdf           FACTORS TO WATCH     10:00 am: Food Minister Ram Vilas Paswan and CBEC chairman Najib Shah at FICCI event on illicit trade.     3:15 pm: State Bank of India Chairman Arundhati Bhattacharya to brief media on likely tie-up with Snapdeal.     3:30 pm: CBEC chairman Najib Shah and DIPP Joint Secretary Atul Chaturvedi at CII retail summit.     5:00 pm: RBI to r",
        "date": "01152016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Morning News Call - India  January 15 "
    },
    {
        "content": "BENGALURU Infosys Ltd cheered investors with a forecast-beating quarterly profit and a stronger sales growth outlook  as India's second-largest software services exporter regains market share from rivals by sharpening its focus on high-margin services.",
        "date": "01142016",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys bridges gap with rivals after lucrative deal wins "
    },
    {
        "content": "MUMBAI India's stock markets fell on Thursday in a highly volatile day  where the Sensex swung about 545 points  as stocks mirrored falls in Asia and Europe while better-than-expected earnings from Infosys  helped cushion losses.",
        "date": "01142016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Sensex ends lower in highly volatile trade "
    },
    {
        "content": "MUMBAI  Jan 14 Indian shares staged a turnaround on Thursday to trade with modest gains  led by better-than-expected results from IT heavyweight Infosys  propping the indexes towards a second consecutive day of gains.",
        "date": "01142016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares recover as Infosys revenue guidance lifts street "
    },
    {
        "content": "MUMBAI  Jan 14 Infosys Ltd  India's second-largest software services exporter by revenue  reported a bigger-than-expected 6.6 percent increase in quarterly net profit as it won more clients and as a weaker rupee helped.",
        "date": "01142016",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys Q3 net profit up 6.6 pct  beats estimates "
    },
    {
        "content": "MUMBAI  Nov 17 Indian shares rose for a second consecutive session on Tuesday  heading for their first back-to-back gains so far this month  as investors continued to buy into beaten-down stocks such as ITC Ltd even though sentiment remained broadly cautious.",
        "date": "11172015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares rise but FII selling overhang continues "
    },
    {
        "content": "MUMBAI India's stock markets edged lower on Tuesday  posting a second consecutive losing session as software stocks remained under pressure a day after Infosys Ltd trimmed its U.S. dollar revenue growth guidance.",
        "date": "10132015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Sensex edges lower; IT firms extend losses "
    },
    {
        "content": "MUMBAI  Oct 13 Indian shares fell on Tuesday  retreating further from near two-month highs hit in the previous session as software stocks remained under pressure after Infosys Ltd trimmed its U.S. dollar revenue growth guidance  clouding the outlook for the sector.",
        "date": "10132015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian stocks retreat further from near 2-month high "
    },
    {
        "content": "MUMBAI India's stock markets fell around 0.6 percent on Monday  retreating from nearly two-month highs after Infosys Ltd reduced its full-year U.S. dollar revenue growth guidance  raising concerns about the outlook for the software services sector.",
        "date": "10122015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Sensex drops; Infosys falls most in 5 weeks after earnings "
    },
    {
        "content": "MUMBAI Infosys  India's second-largest software services exporter  trimmed its full-year dollar revenue forecast to account for a stronger U.S. dollar against the rupee  sending its shares down sharply lower from a record high.",
        "date": "10122015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys trims dollar revenue forecast  hits shares "
    },
    {
        "content": "MUMBAI Infosys   India's second-largest software services exporter  trimmed its full-year dollar revenue forecast to account for a stronger U.S. dollar against the rupee  sending its shares down sharply lower from a record high.",
        "date": "10122015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India software firm Infosys trims dollar revenue forecast  hits shares "
    },
    {
        "content": "* Cuts FY16 US$ revenue rise fcast to 6.4-8.4 pct from 7.2-9.2 pct",
        "date": "10122015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 2-India software firm Infosys trims dollar revenue forecast  hits shares "
    },
    {
        "content": "* India's infosys exec says continue to see pricing challenges on large deals  Source text for Eikon:  Further company coverage:",
        "date": "10122015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's infosys exec says continue to see pricing challenges on large deals "
    },
    {
        "content": "MUMBAI  Oct 12 Infosys Ltd  India's second-largest software services exporter by revenue  reported a better-than-expected 9.8 percent increase in quarterly net profit  helped by a focus on high-end projects and as clients in the United States spent more.",
        "date": "10122015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys Q2 net profit up 9.8 pct  beats estimates "
    },
    {
        "content": "MUMBAI The Nifty fell about 1.5 percent on Thursday  its biggest single-day percentage drop in nearly four weeks  amid global risk aversion while Infosys  declined on speculation that it may announce acquisitions which may weigh on its earnings.",
        "date": "08202015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Nifty posts biggest single-day fall in nearly four weeks "
    },
    {
        "content": "MUMBAI/ BENGALURU Wipro Ltd   India's third-biggest software services exporter  expects less volatile global oil prices to revive spending on IT outsourcing by its energy and utility clients.",
        "date": "07232015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Wipro sees stronger quarters ahead on calmer oil prices "
    },
    {
        "content": "MUMBAI IT services provider Infosys Ltd on Tuesday said a business revamp initiated by its first non-founder boss helped it win more large deals in the first quarter  fuelling a 5 percent rise in net profit.",
        "date": "07212015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys revamp brings in more large deals; shares surge "
    },
    {
        "content": "MUMBAI India's stock markets fell nearly 1 percent on Tuesday after Sun Pharmaceutical Industries slumped more than 15 percent  its steepest daily decline  after the company warned that its sales in 2016 would be flat at best.",
        "date": "07212015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Sensex drops nearly 1 pct; Sun Pharma marks biggest fall ever "
    },
    {
        "content": "* Exec says energy sector to continue to be under pressure for next few quarters",
        "date": "07212015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys: energy sector to continue to be under pressure for next few qtrs "
    },
    {
        "content": "* CEO says $1.5 billion of $20 billion for 2020 revenue targets to come from mergers and acquisitions  Further company coverage:    (Reporting By Aditya Kondalamahanty and Lehar Maan in BANGALORE)",
        "date": "07212015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-Infosys CEO says $1.5 bln of $20 bln for 2020 revenue targets to come from M&A "
    },
    {
        "content": "* Raises dollar revenue forecast range to 7.2-9.2 percent   (Adds CEO comment  deal wins  staff attrition  context)",
        "date": "07212015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 2-Infosys revamp brings in more large deals; shares surge "
    },
    {
        "content": "MUMBAI  July 21 Infosys Ltd  India's second-largest software services exporter  reported a 5 percent increase in quarterly net profit  bolstered by a surge in demand for IT outsourcing services from clients in the United States  its biggest market.",
        "date": "07212015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys Q1 net profit rises 5 pct; meets forecasts "
    },
    {
        "content": "MUMBAI  May 22 India's capital markets regulator has named Infosys founder N.R. Narayana Murthy to head a panel that will devise rules for a new funding platform for homegrown start-ups  the regulator said on its website.",
        "date": "05222015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "India picks Infosys founder to head panel on startup funding platform "
    },
    {
        "content": "MUMBAI Infosys Ltd  India's second-largest software services exporter  on Friday posted quarterly net profit that lagged most analyst expectations  dampening hopes of a quick turnaround after top management changes.",
        "date": "04242015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys bets on new services to push sales to $20 billion by 2020 "
    },
    {
        "content": "* Sees sales growing to $20 bln by 2020  up from $8.7 bln now",
        "date": "04242015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "UPDATE 2-Infosys bets on new services to push sales to $20 bln by 2020 "
    },
    {
        "content": "* Exec says  confident about deal pipeline  seeing stress in telecoms and energy - TV",
        "date": "04242015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys exec says confident about deal pipeline - TV "
    },
    {
        "content": "MUMBAI  April 24 Indian shares fell more than 1 percent on Friday to their lowest close in nearly three-and-a-half months  dragged down by a 6 percent slump in Infosys after the software services exporter's January-March earnings fell short of expectations.",
        "date": "04242015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares close at 3-1/2 month low; Infosys slumps "
    },
    {
        "content": "* Shares extend falls  down 5 percent  Further company coverage:    (Reporting By Indulal PM)",
        "date": "04242015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "BRIEF-India's Infosys shares extend falls  down 5 pct "
    },
    {
        "content": "MUMBAI  April 24 Infosys Ltd  India's second-largest software services exporter  on Thursday posted a 3.5 percent rise in quarterly net profit  lagging analyst estimates.",
        "date": "04242015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "India's Infosys Q4 profit up 3.5 pct; lags estimates "
    },
    {
        "content": "MUMBAI  April 20 Indian shares were down on Monday  heading towards their fourth straight session of losses and the lowest close in three weeks  dragged down by technology stocks such as Infosys Ltd  on earnings growth concerns  while weak cues across the region also dampened sentiment.",
        "date": "04202015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares heading towards 3-wk closing low; tech stocks drag "
    },
    {
        "content": "MUMBAI  April 15 India's BSE index  edged lower on Wednesday  after touching its highest in more than a month  as exporters such as Infosys fell on worries strength in the rupee after inflation data may persist and hurt revenues.",
        "date": "04152015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares edge lower; exporters decline on rupee's strength "
    },
    {
        "content": "MUMBAI  Feb 26 Indian shares fell over 1 percent on Thursday  led by profit-taking in software stocks such as Infosys Ltd  while caution also prevailed ahead of the expiry of derivative contracts due later in the day and federal budget on Saturday.",
        "date": "02262015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Indian shares fall over 1 pct ahead of expiry; software stocks slide "
    },
    {
        "content": "Infosys Ltd said on Monday it would buy Panaya Inc  a New Jersey-based provider of automation technology  for an enterprise value of $200 million as India's second-biggest IT outsourcing company bets on new technology to boost growth.",
        "date": "02162015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys buys U.S. automation tech firm for enterprise value of $200 million "
    },
    {
        "content": "Feb 16 Infosys Ltd said on Monday it would buy Panaya Inc  a New Jersey-based provider of automation technology  for an enterprise value of $200 million as India's second-biggest IT outsourcing company bets on new technology to boost growth.",
        "date": "02162015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys buys US automation tech firm for enterprise value of $200 mln "
    },
    {
        "content": "BENGALURU Shares in software services exporter Infosys Ltd rose almost 7 percent on Friday after it surprised investors by sticking to its full-year sales target  thanks to healthy demand that helped offset the impact of a stronger dollar.",
        "date": "01092015",
        "name": "Infosys Limited",
        "news_type": "topStory",
        "symbol": "INFY",
        "title": "Infosys sticks to growth targets  sends shares up 7 percent "
    },
    {
        "content": "* Q3 profit up 13 pct to 32.50 billion rupees; beats forecasts",
        "date": "01092015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "REFILE-UPDATE 2-Infosys sticks to growth targets  sends shares up 7 pct "
    },
    {
        "content": "MUMBAI  Jan 9 Indian shares edged higher for a second consecutive session on Friday on the back of a 5 percent gain in Infosys Ltd after its December-quarter earnings beat estimates.",
        "date": "01092015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares gain for second day; Infosys surges 5 pct "
    },
    {
        "content": "MUMBAI  Jan 9 Indian shares edged higher on Friday  heading for a second consecutive session of gains  led by software services exporter  Infosys Ltd  which surged 6 percent after its December-quarter earnings beat estimates.",
        "date": "01092015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Indian shares edge higher; Infosys surges 6 pct "
    },
    {
        "content": "MUMBAI  Jan 9 Infosys Ltd  India's second-largest software services exporter  posted a 13 percent rise in quarterly net profit on Friday  beating estimates  as it won more outsourcing contracts from Western clients.",
        "date": "01092015",
        "name": "Infosys Limited",
        "news_type": "normal",
        "symbol": "INFY",
        "title": "Infosys Q3 profit up 13 percent  beats estimates "
    }
]