[
    {
        "content": "* Cost trimming in the Netherlands bears fruit (Updates with details on reasons for beat)",
        "date": "11022017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "UPDATE 1-ING beats Q3 expectations on lending growth and improving margins; fewer bad loans "
    },
    {
        "content": "* ‍NET CORE LENDING IN 3Q17 INCREASED BY EUR 8.0 BILLION; NET CUSTOMER DEPOSIT INFLOW AMOUNTED TO EUR 4.2 BILLION​",
        "date": "11022017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-ING reports Q3 net result at 1.38 billion euros "
    },
    {
        "content": "AMSTERDAM  Nov 2 ING Groep NV  the largest Dutch financial services firm  on Thursday reported a better-than-expected net profit for the third quarter of 1.38 billion euros ($1.61 billion).",
        "date": "11022017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "ING reports Q3 net result of 1.38 billion  beating analyst expectations "
    },
    {
        "content": "* Has ‍launched ING ventures  a EUR 300 million fund aimed at investing in fintech companies​ Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "BRIEF-ING launches ING Ventures  a fund aimed at investing in fintech companies​ "
    },
    {
        "content": "* REG-ING EXPANDS INSTANT LENDING TO SMES IN FRANCE AND ITALY Source text for Eikon: Further company coverage: (Gdynia Newsroom:)",
        "date": "10242017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "BRIEF-ING expands instant lending to SMEs in France and Italy "
    },
    {
        "content": "* ING Groep NV reports 7.79 pct passive stake in the Finish Line Inc ‍​ ‍as of October 5 - SEC Filing Source text: (http://bit.ly/2yh6QKU) Further company coverage:",
        "date": "10132017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "BRIEF-ING Groep NV reports 7.79 pct passive stake in the Finish Line ‍as of Oct 5 "
    },
    {
        "content": "LONDON Anglian Water's issuance of the first water utility green bond in Europe should pave the way for more such instruments which should help the market grow  Dutch bank ING's head of sustainable capital markets said.",
        "date": "10022017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "UK water utility's green bond is start of a \"new wave\": ING "
    },
    {
        "content": "* ‍ING AND SCALABLE WILL OFFER A FULLY DIGITAL INVESTMENT SOLUTION TO ING'S RETAIL CUSTOMERS IN GERMANY​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "09142017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "BRIEF-ING starts partnership with Scalable ‍​ "
    },
    {
        "content": "LONDON Dutch bank ING  which last year dubbed buying the Czech crown 'the trade of 2017'  said on Tuesday it was closing its recommendation on the currency  which has risen less than expected since the ending of an exchange rate cap.",
        "date": "09052017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "ING closes 'trade of 2017' Czech crown bet "
    },
    {
        "content": "Aug 18 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "08182017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "MOVES- ING  Standard Chartered  Stifel "
    },
    {
        "content": "LONDON  Aug 18 ING has appointed Clarence Plummer to a newly-created role of Europe head of syndicated finance  based in London.",
        "date": "08182017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "MOVES-ING appoints Plummer as Europe head of syndicated finance "
    },
    {
        "content": "* ING CEO Hamers: internet banking is cheaper  easier  better",
        "date": "08112017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "Dutch bank ING thrives in Germany with zero-fee  online-only accounts "
    },
    {
        "content": "* Net profit dips but beats expectations (Adds more detail on customer growth  CEO quotes and share price)",
        "date": "08022017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "UPDATE 2-Mobile banking growth helps to support ING profit "
    },
    {
        "content": "* ING Group - will redeem all outstanding $522 million of 8.439% non-cumulative guaranteed trust preferred securities Source text for Eikon: Further company coverage:",
        "date": "08012017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "BRIEF-ING Group to redeem $552 mln additional Tier 1 instrument "
    },
    {
        "content": "* ‍ING GREW RETAIL CUSTOMER BASE IN 1H17 BY 700 000 TO 36.5 MILLION  AND PRIMARY RELATIONSHIPS INCREASED BY 400 000 TO 10.1 MILLION​",
        "date": "08022017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-ING Group Q2 fully loaded common equity tier 1 ratio stable at 14.5% "
    },
    {
        "content": "AMSTERDAM  Aug 2 ING  the largest Dutch financial services company  reported on Wednesday a better-than-expected second-quarter underlying net profit of 1.40 billion euros ($1.66 billion)  down 1 percent from a year ago.",
        "date": "08022017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "Dutch bank ING's Q2 profit beats expectations "
    },
    {
        "content": "LONDON  July 12 (IFR) - BNP Paribas has struck an agreement with ING to acquire risk relating to a €5bn portfolio of structured notes issued by the Dutch bank.",
        "date": "07122017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "DERIVATIVES-BNPP to acquire ING structured products risk "
    },
    {
        "content": "CALGARY  Alberta  June 28 Dutch lender ING Groep NV has said it would not finance any of Canada's major pipeline projects  including TransCanada Corp's Keystone XL and Energy East and Enbridge Inc's Line 3  after pressure from activists.",
        "date": "06282017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "ING bank says it will not finance major Canadian pipeline projects "
    },
    {
        "content": "* Bank Of China  HSBC and ING secure finance for C C Land's 1.15 billion stg acquisition of the Leadenhall Building from British Land and Oxford Properties Further company coverage: (Bengaluru Newsroom)",
        "date": "06082017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "BRIEF-Banks secure financing for 1.15 bln stg 'Cheesegrater' building deal "
    },
    {
        "content": "AMSTERDAM  May 31 Dutch bank ING Groep said it plans to cut dozens of jobs at its dealing room in Amsterdam  including corporate bond and commodities traders  and will move 22 positions to London.",
        "date": "05312017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "UPDATE 1-Dutch bank ING to cut Amsterdam trading jobs  move some to London "
    },
    {
        "content": "AMSTERDAM  May 31 Dutch bank ING Groep plans to move dozens of jobs  including corporate bond and commodities traders  from Amsterdam to London  the leading Dutch business newspaper reported on Wednesday.",
        "date": "05312017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "Dutch bank ING to move dozens more traders to London -report "
    },
    {
        "content": "AMSTERDAM  May 10 ING Groep  the largest Dutch financial services company  reported on Wednesday a better than expected first-quarter underlying pretax profit of 1.65 billion euros  up 39 percent from a year ago.",
        "date": "05102017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "RPT-UPDATE 1-ING Q1 underlying pretax profit up 39 pct  beats expectations "
    },
    {
        "content": "AMSTERDAM  May 10 ING Groep  the largest Dutch financial services company  reported on Wednesday a better than expected first-quarter underlying pretax profit of 1.65 billion euros  up 39 percent from a year ago.",
        "date": "05102017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "UPDATE 1-ING Q1 underlying pretax profit up 39 pct  beats expectations "
    },
    {
        "content": "* Q1 UNDERLYING NET RESULT EUR 1.18 BILLION VERSUS EUR 1.04 BILLION IN REUTERS POLL",
        "date": "05102017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-ING Groep Q1 underlying net result at 1.18 billion euros "
    },
    {
        "content": "AMSTERDAM  May 10 ING Groep  the largest Dutch financial services company  on Wednesday reported better than expected first-quarter net profit of 1.14 billion euros ($1.24 billion) on strong loan growth  stable costs and fewer bad loans.",
        "date": "05102017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "ING Q1 earns ahead of expectations: loans and deposits up  fewer bad loans "
    },
    {
        "content": "* After offering  ING expects to maintain its position as largest shareholder in bank of beijing with a stake of approximately 13.0 pct  down from current 13.6 pct",
        "date": "04252017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "BRIEF-ING to participate in Bank of Beijing share offering "
    },
    {
        "content": "* Edenred a top gainer on higher revenue growth (ADVISORY - Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon - see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "04192017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "Results  banking sector bounce help European shares recover "
    },
    {
        "content": "* ING Groep N.V. reports 5.52 percent passive stake in Qiwi PLC as on  March 21  2017 - SEC Filing Source text (http://bit.ly/2nAtbg8) Further company coverage:",
        "date": "03292017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "BRIEF-ING Groep N.V. reports 5.52 pct passive stake in Qiwi PLC "
    },
    {
        "content": "* ING closes $115 million in financing to Argentinian-based Vicentin S.A.I.C. to meet Japanese food demand Source text for Eikon: Further company coverage:",
        "date": "03292017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-ING closes $115 mln in financing to Argentinian-based Vicentin S.A.I.C. "
    },
    {
        "content": "WASHINGTON Dutch bank ING Groep on Tuesday said it has agreed to sell its $120 million share of the loan for the Dakota Access Pipeline  the first bank to offload its debt from the project  which faced fierce opposition from Native Americans and environmental groups.",
        "date": "03222017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "Dutch bank ING sells Dakota pipeline loan share to 'send message' "
    },
    {
        "content": "WASHINGTON  March 21 Dutch bank ING Groep on Tuesday said it has agreed to sell its $120 million share of the loan for the Dakota Access Pipeline  the first bank to offload its debt from the project  which faced fierce opposition from Native Americans and environmental groups.",
        "date": "03212017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "Dutch bank ING sells Dakota pipeline loan share to 'send message' "
    },
    {
        "content": "AMSTERDAM  March 22 A corruption investigation into Dutch financial services company ING Groep includes past \"irregular transactions\" between telecoms company VimpelCom and Uzbek officials  Dutch prosecutors said on Wednesday.",
        "date": "03222017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "ING investigation includes Uzbek transactions by VimpelCom -prosecutors "
    },
    {
        "content": "* ING has sold its stake in Dakota Access pipeline loan  Source text for Eikon:  Further company coverage:   (Gdynia Newsroom)",
        "date": "03212017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-ING Groep sells stake in Dakota Access pipeline loan "
    },
    {
        "content": "SYDNEY  March 17 ING Groep NV's Australian arm expects to increase lending to housing investors this year  allowing it to gain market share as rivals pull back for fear of breaching regulatory caps  Chief Executive Uday Sareen said.",
        "date": "03162017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "ING steps up investor housing loans in hot Australian market "
    },
    {
        "content": "LONDON  March 16 Dutch bank ING said on Thursday that it is no longer a primary dealer for Slovenia  the latest in a string of banks to have stopped making markets for certain European government bonds.",
        "date": "03162017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "ING exits primary dealer role in Slovenian government bonds "
    },
    {
        "content": "SEOUL  March 10 South Korea's ING Life Insurance Korea Ltd  controlled by Asia-based private equity firm MBK Partners  received stock exchange approval for an initial public offering (IPO)  the Korea Exchange said in a statement on Monday.",
        "date": "03102017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "South Korea's ING Life gets Korea Exchange's nod for planned IPO "
    },
    {
        "content": "AMSTERDAM  Feb 2 ING Groep  the Netherlands' largest financial services company  reported a better than expected 63 percent jump in fourth-quarter pretax income on Thursday  helped by one-off gains  stable lending margins and a growing customer base.",
        "date": "02022017",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "UPDATE 1-ING beats forecasts  aided by customer growth  stable lending margins "
    },
    {
        "content": "* Board proposes full-year 2016 dividend of 0.66 euros per share",
        "date": "02022017",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-ING Groep Q4 net result ING Group at 750 million euros "
    },
    {
        "content": "* CEO says company had a record quarter in \"challenger\" markets",
        "date": "11032016",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "UPDATE 2-ING's profits beat forecasts for second quarter in a row "
    },
    {
        "content": "* Expects results to grow much faster in 'disruptive' countries than in benelux - conf call",
        "date": "11032016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-ING Groep expects margins to maintain stable for about 12 mths - conf call "
    },
    {
        "content": "AMSTERDAM ING Groep NV   the largest Dutch bank  on Thursday reported a better-than-expected 22 percent rise in underlying net result for the third quarter  which the company attributed to continued loan growth and higher commission and fee incomes.",
        "date": "11032016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "ING third-quarter beats with underlying result up 22 percent  improving margins "
    },
    {
        "content": "* Q3 total underlying income 4.36 billion euros (+9pct)  gross result 2.14 billion euros (+22 pct)",
        "date": "11032016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-Ing Groep Q3 total underlying income up 9 pct to 4.36 billion euros "
    },
    {
        "content": "AMSTERDAM  Nov 3 ING Groep NV  the largest Dutch bank  on Thursday reported a better than expected underlying net result for the third quarter of 1.34 billion euros ($1.49 billion)  which the company said was due to continued loan growth and higher commission and fee incomes.",
        "date": "11032016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "ING 3Q ahead of expectations; higher commission and fee incomes "
    },
    {
        "content": "DUBAI  Oct 27 Dutch bank ING Group is aiming to expand its business in the Middle East where it sees greater demand for bank finance and advisory work after the slump in oil prices  its regional chief executive said.",
        "date": "10272016",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "ING says oil price drop offers chance to expand Middle East business "
    },
    {
        "content": "* Announced sale of 46.7 million ordinary shares of Kotak Mahindra Bank (Kotak)",
        "date": "09292016",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "BRIEF-ING Groep sells 46.7 million shares of Kotak Mahindra Bank "
    },
    {
        "content": "AMSTERDAM ING Groep's plans to shed 7 000 jobs and invest in its digital platforms to make annual savings of 900 million euros ($1 billion) by 2021  drew swift criticism from unions of the Netherlands' largest financial services company on Monday.",
        "date": "10032016",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "ING plan to cut 7 000 jobs  spend on digital draws union ire "
    },
    {
        "content": "AMSTERDAM ING   the largest Dutch-based financial services company  is planning to announce a restructuring that will lead to thousands of job losses  Dutch newspaper Het Financieele Dagblad said on Friday.",
        "date": "09302016",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "ING plans reorganization: Financieele Dagblad "
    },
    {
        "content": "AMSTERDAM  Oct 3 ING Groep's plans to shed 7 000 jobs and invest in its digital platforms to make annual savings of 900 million euros ($1 billion) by 2021  drew swift criticism from unions of the Netherlands' largest financial services company on Monday.",
        "date": "10032016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "UPDATE 3-ING plan to cut 7 000 jobs  spend on digital draws union ire "
    },
    {
        "content": "AMSTERDAM  Sept 30 ING  the largest Dutch-based financial services company  is planning to announce a restructuring that will lead to thousands of job losses  Dutch newspaper Het Financieele Dagblad said on Friday.",
        "date": "09302016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "ING plans reorganization - Financieele Dagblad "
    },
    {
        "content": "AMSTERDAM  Oct 3 ING Groep  the largest Dutch-based financial services company  said on Monday it plans to shed 7 000 jobs and invest heavily in its digital platforms in order to save 900 million euros ($1 billion) annually by 2021.",
        "date": "10032016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "ING plans to shed 7 000 jobs  invest in digital platforms "
    },
    {
        "content": "* Investment of 800 million euros  ($898.48 million) in continued digital transformation in order to further improve customer experience  accelerate growth in primary customers and lending",
        "date": "10032016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-ING Groep announces cost-cutting plan "
    },
    {
        "content": "MUMBAI Dutch financial services company ING Group  is selling a $300 million stake in Indian lender Kotak Mahindra Bank Ltd  in a block trade on Thursday  according to a deal term sheet seen by Reuters.",
        "date": "09282016",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "ING selling $300 million Kotak Mahindra stake: term sheet "
    },
    {
        "content": "MUMBAI  Sept 28 Dutch financial services company ING Group is selling a $300 million stake in Indian lender Kotak Mahindra Bank Ltd in a block trade on Thursday  according to a deal term sheet seen by Reuters.",
        "date": "09282016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "UPDATE 1-ING selling $300 mln Kotak Mahindra stake - term sheet "
    },
    {
        "content": "MUMBAI  Sept 28 Dutch financial services company ING Group is selling a $300 million stake in Indian lender Kotak Mahindra Bank Ltd in a block trade on Thursday  according to a term sheet seen by Reuters.",
        "date": "09282016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "ING selling Kotak Mahindra stake worth $300 mln - term sheet "
    },
    {
        "content": "AMSTERDAM  Aug 3 Dutch financial services company ING Group easily beat market forecasts on Wednesday with a 27 percent jump in quarterly earnings  helped by strong loan growth as it added hundreds of thousands of customers.",
        "date": "08032016",
        "name": "ING Group NV",
        "news_type": "topStory",
        "symbol": "ING",
        "title": "REFILE-UPDATE 2-Dutch lender ING outshines European peers with strong loan growth "
    },
    {
        "content": "* Q2 underlying net result was 1 417 million euros ($1.59 billion)  up 26.7 pct from the second quarter of 2015  Source text for Eikon:  Further company coverage:   ($1 = 0.8922 euros)   (Gdynia Newsroom)",
        "date": "08032016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-ING Groep Q2 underlying net result up 26.7 pct at 1 417 million euros "
    },
    {
        "content": "* Q2 total underlying income 4.55 billion euros ($5.10 billion) versus 4.22 billion euros in Reuters poll",
        "date": "08032016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "BRIEF-ING Q2 results beat estimates "
    },
    {
        "content": "AMSTERDAM  Aug 3 ING Group  the largest Dutch financial services company  on Wednesday reported nearly 27 percent higher net earnings for the second quarter due to strong lending growth  beating market expectations.",
        "date": "08032016",
        "name": "ING Group NV",
        "news_type": "normal",
        "symbol": "ING",
        "title": "Dutch lender ING beats expectations with near 27 pct rise in Q2 net earnings "
    }
]