[
    {
        "content": "* Intel to redeem 2.95% junior subordinated convertible debentures due 2035 Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "11162017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel to redeem 2.95% junior subordinated convertible debentures due 2035 "
    },
    {
        "content": "NEW YORK  Nov 10 Wall Street ended nearly unchanged on Friday  with losses in Intel and Apple as investors worried about the future of promised corporate tax cuts following dueling plans unveiled by Republican U.S. lawmakers.",
        "date": "11102017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "US STOCKS SNAPSHOT-Wall St ends little changed; Apple  Intel drag "
    },
    {
        "content": "* Indexes end: Dow -0.17 pct  S&P 500 -0.09 pct  Nasdaq +.01 pct (Updates to close)",
        "date": "11102017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Doubts about Trump tax cuts weigh on Wall Street "
    },
    {
        "content": "* Intel Corp - ‍appointment of Raja Koduri as Intel Chief Architect  Senior Vice President of newly formed core and Visual Computing Group​ Source text for Eikon: Further company coverage:",
        "date": "11082017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel Corp ‍appoints Raja Koduri as Intel Chief Architect "
    },
    {
        "content": "* Indexes: Dow -0.15 pct  S&P 500 -0.09 pct  Nasdaq +0.03 pct (Updates to mid-afternoon)",
        "date": "11102017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Doubts about tax cuts weigh on Wall Street "
    },
    {
        "content": "Nov 8 If Broadcom Ltd's unsolicited $103 billion bid for Qualcomm Inc succeeds  it could set up a battle with Intel Corp for dominance in the production of the next generation of communications chips  which will play a vital role in so-called connected cars.",
        "date": "11082017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Qualcomm buy may pit Broadcom against Intel in 'connected car' fight "
    },
    {
        "content": "HONG KONG  Nov 10 Razer Inc  backed by Intel Corp and Hong Kong billionaire Li Ka-shing  on Friday set its initial public offering price at HK$3.88 per share  confirming a report by a Reuters's publication that the gaming hardware maker had priced its shares near the top of a range.",
        "date": "11102017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "HK's Razer IPO raises $528 mln amid heavy retail demand "
    },
    {
        "content": "* Says ‍co  Turner Sports​ announced multiyear partnership to make live NBA game action available in virtual reality using intel true VR technology",
        "date": "11072017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Turner Sports and Intel announce multiyear partnership "
    },
    {
        "content": "* AMD delivers semi-custom graphics chip for new Intel processor",
        "date": "11062017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-AMD delivers semi-custom graphics chip for new Intel processor "
    },
    {
        "content": "Nov 7 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11072017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "PRESS DIGEST- Wall Street Journal - Nov 7 "
    },
    {
        "content": "Nov 6 Bitter rivals Advanced Micro Devices Inc and Intel Corp on Monday unveiled a partnership that will help the chipmakers take on Nvidia Corp.",
        "date": "11062017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Rivals AMD  Intel partner to take on Nvidia "
    },
    {
        "content": "* Intel and AMD team up on PC chips to battle Nvidia- WSJ  citing sources‍​",
        "date": "11062017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel and AMD team up on PC chips to battle Nvidia- WSJ "
    },
    {
        "content": "* Intel says on Oct 30  ambassador Charlene Barshefsky informed co she will not stand for re-election to co's board at end of her term - SEC filing Source text: (http://bit.ly/2lCqz2i) Further company coverage:",
        "date": "11012017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel says ambassador Charlene Barshefsky informed co she will not stand for re-election to board - SEC filing "
    },
    {
        "content": "Qualcomm Inc  has sued Apple Inc   alleging that it violated a software license contract to benefit rival chipmaker Intel Corp  for making broadband modems  the latest salvo in the longstanding dispute between Qualcomm and Apple.",
        "date": "11022017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Qualcomm sues Apple for breach of software license contract "
    },
    {
        "content": "Oct 31 Shares in Qualcomm Inc fell as much as 8 percent on Tuesday after reports that Apple Inc would not use its modem chips in iPhones and iPads from next year.",
        "date": "10312017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Qualcomm dips on risk of losing Apple  Intel gains "
    },
    {
        "content": "Nov 2 Qualcomm Inc has sued Apple Inc   alleging that it violated a software license contract to benefit rival chipmaker Intel Corp for making broadband modems  the latest salvo in the longstanding dispute between Qualcomm and Apple.",
        "date": "11022017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 5-Qualcomm sues Apple for breach of software license contract "
    },
    {
        "content": "Oct 31 Shares in Qualcomm Inc fell as much as 8 percent on Tuesday on reports that Apple Inc would not use its modem chips in iPhones and iPads from next year.",
        "date": "10312017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Qualcomm dips on risk of losing Apple  Intel gains "
    },
    {
        "content": "Nov 2 Qualcomm Inc has sued Apple Inc   alleging that it violated a software license contract to benefit rival chipmaker Intel for making broadband modems  the latest salvo in a longstanding dispute between the two companies.",
        "date": "11022017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "REFILE-Qualcomm sues Apple for contract breach "
    },
    {
        "content": "Intel Corp   the world's largest computer chipmaker  raised its full-year revenue and profit forecasts  helped by strong growth in its data center business.",
        "date": "10262017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel lifts full-year forecasts on data center strength "
    },
    {
        "content": "* Client computing revenue flat at $8.9 bln (Adds details from conf call  analyst comment)",
        "date": "10262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Intel lifts full-year forecasts on data center strength "
    },
    {
        "content": "* Q3 earnings per share view $0.80  revenue view $15.73 billion -- Thomson Reuters I/B/E/S",
        "date": "10262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel Corp reports quarterly GAAP earnings per share $0.94‍​ "
    },
    {
        "content": "Oct 26 Intel Corp  the world's largest computer chipmaker  reported a 33.7 percent rise in quarterly profit on Thursday  helped by strong growth in its data center and cloud computing business.",
        "date": "10262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel reports 34 pct rise in quarterly profit "
    },
    {
        "content": "HONG KONG Razer Inc  a gaming hardware maker backed by Intel Corp   and Hong Kong billionaire Li Ka-shing  plans to launch on Monday an up to $550 million Hong Kong initial public offering  IFR reported on Friday  citing people close to the deal.",
        "date": "10272017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Gaming firm Razer to launch up to $550 million HK IPO on Monday: IFR "
    },
    {
        "content": "HONG KONG  Oct 27 Razer Inc  a gaming hardware maker backed by Intel Corp  and Hong Kong billionaire Li Ka-shing  plans to launch on Monday an up to $550 million Hong Kong initial public offering  IFR reported on Friday  citing people close to the deal.",
        "date": "10272017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Gaming firm Razer to launch up to $550 mln HK IPO on Monday-IFR "
    },
    {
        "content": "* To begin implementing Intel Online Connect technology into online banking platform  to provide added security for online‍​ banking",
        "date": "10232017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Bank of America to expand use of biometrics for online banking "
    },
    {
        "content": "SAN FRANCISCO  Oct 26 Amazon.com Inc  Microsoft Corp  Alphabet Corp’s Google and Intel Corp are all putting their chips on the cloud computing business  and it is booming.",
        "date": "10272017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Cloud computing drives massive growth for big U.S. tech firms "
    },
    {
        "content": "* Intel says it will ship silicon for Neural Network Processing  the Intel Nervana Neural Network Processor  before the end of 2017- statement",
        "date": "10172017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel says to ship Intel Nervana Neural Network Processor before 2017-end "
    },
    {
        "content": "Oct 10 Canadian auto parts producer Magna International Inc said on Tuesday it has joined a consortium including BMW and Intel Corp to develop a self-driving vehicle platform for the use of auto makers by 2020.",
        "date": "10102017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Canada's Magna joins BMW  Intel self-driving car project "
    },
    {
        "content": "* Magna joins The BMW Group  Intel and Mobileye platform as an integrator to bring autonomous driving technology to the market Source text - () Further company coverage:",
        "date": "10102017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Magna joins The BMW Group  Intel  Mobileye for autonomous driving technology "
    },
    {
        "content": "* Intel Corp says former CEO Paul Otellini passed away in his sleep Monday  oct. 2  2017  at the age of 66 Source http://intel.ly/2fNP8az Further company coverage:",
        "date": "10032017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel says former CEO Paul Otellini passed away on Oct. 2  2017 "
    },
    {
        "content": "* Intel commences compulsory acquisition for remaining Mobileye shares",
        "date": "09282017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel commences compulsory acquisition for remaining Mobileye shares "
    },
    {
        "content": "The giant information and entertainment screens in Tesla Inc's cars will now be powered by chipmaker Intel Corp after the electric carmaker replaced Nvidia Corp for that function  Bloomberg reported.",
        "date": "09262017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Tesla shifts to Intel from Nvidia for infotainment: Bloomberg "
    },
    {
        "content": "Sept 26 The giant information and entertainment screens in Tesla Inc's cars will now be powered by chipmaker Intel Corp after the electric carmaker replaced Nvidia Corp for that function  Bloomberg reported.",
        "date": "09262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Tesla shifts to Intel from Nvidia for infotainment - Bloomberg "
    },
    {
        "content": "FRANKFURT A Chinese-led group has withdrawn its offer to buy a stake in German carmaker-backed mapping company HERE after it failed to win approval from a U.S. national security oversight board.",
        "date": "09262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Chinese drop investment in maps firm HERE after U.S. resistance "
    },
    {
        "content": "* Scraps plan after resistance from US foreign investment board (Adds comment on foot-dragging by CFIUS on Chinese investments)",
        "date": "09262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Chinese drop investment in maps firm HERE after U.S resistance "
    },
    {
        "content": "Sept 20 Auto suppliers Delphi Automotive Plc and BlackBerry Ltd  will partner on a software operating system for self-driving cars  the companies said on Wednesday.",
        "date": "09202017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Delphi  BlackBerry partner on self-driving software system "
    },
    {
        "content": "FRANKFURT  Sept 19 Pioneer and digital mapping group HERE said on Tuesday they had agreed to invest in one another so the companies can develop maps for autonomous driving services.",
        "date": "09192017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Japan's Pioneer teams up with digital mapping company HERE "
    },
    {
        "content": "SAN FRANCISCO Intel Corp  on Monday announced a collaboration with Alphabet's  Waymo self-driving unit  saying it had worked with the company during the design of its computer platform to allow autonomous cars to process information in real time.",
        "date": "09182017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel collaborates with Waymo on self-driving computer design "
    },
    {
        "content": "SAN FRANCISCO  Sept 18 Intel Corp on Monday announced a collaboration with Alphabet's Waymo self-driving unit  saying it had worked with the company during the design of its computer platform to allow autonomous cars to process information in real time.",
        "date": "09182017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Intel collaborates with Waymo on self-driving computer design "
    },
    {
        "content": "* Waymo's self-driving Chrysler Pacifica hybrid minivans feature Intel-based technologies for sensor processing  general compute  connectivity​ Source text for Eikon: Further company coverage:",
        "date": "09182017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel  Waymo collaborate on self-driving car technology "
    },
    {
        "content": "SAN FRANCISCO  Sept 18 Intel Corp on Monday announced a collaboration with Alphabet's Waymo self-driving unit  saying it had worked with the company during the design of its compute platform to allow autonomous cars to process information in real time.",
        "date": "09182017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel collaborates with Waymo on self-driving compute design "
    },
    {
        "content": "* Intel Corp - ‍andrew Wilson  chief executive officer of Electronic Arts Inc.  has been elected to Intel corporation's board of directors​ Source text for Eikon: Further company coverage:",
        "date": "09182017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel elects Andrew Wilson to its board "
    },
    {
        "content": "* Intel Corp - ‍Intel Corporation's Board Of Directors has declared a quarterly dividend of $0.2725/shr Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel declares quarterly cash dividend of $0.2725/shr "
    },
    {
        "content": "FRANKFURT  Sept 14 South Korea's Samsung Electronics Co Ltd plans to become a major player in autonomous driving  building on its recent $8 billion acquisition of audio and auto parts supplier Harman and its pole position in mobile communications markets.",
        "date": "09142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Samsung enters autonomous driving race with new business  funding "
    },
    {
        "content": "FRANKFURT  Sept 14 HERE  the digital mapping company controlled by Germany's premium carmakers  aims to expand its business not only to offer navigation for self-driving cars but also drones and advanced robotics  Chief Executive Edzard Overbeek told Reuters.",
        "date": "09142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Mapping firm HERE looks beyond driverless cars "
    },
    {
        "content": "* One firm to focus on products such as airbags and seatbelts",
        "date": "09142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Autoliv lifts shares with plans to split into two listed companies "
    },
    {
        "content": "FRANKFURT  Sept 14 South Korea's Samsung Electronics Co Ltd plans to become a major player in autonomous driving  building on its recent $8 billion acquisition of audio and auto parts supplier Harman and its pole position in mobile communications markets.",
        "date": "09142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Samsung enters autonomous driving race with new business  funding "
    },
    {
        "content": "BRUSSELS Google appealed on Monday against a record 2.4-billion-euro ($2.9 billion) EU antitrust fine  with its chances of success boosted by Intel's partial victory last week against another EU sanction.",
        "date": "09112017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Google challenges record EU antitrust fine in court "
    },
    {
        "content": "BRUSSELS  Sept 11 Google appealed on Monday against a record 2.4-billion-euro ($2.9 billion) EU antitrust fine  with its chances of success boosted by Intel's partial victory last week against another EU sanction.",
        "date": "09112017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Google challenges record EU antitrust fine in court "
    },
    {
        "content": "NEW YORK  Sept 7 Chipmaker Intel Corp said on Thursday that it was updating 5G equipment that will allow telecom companies like AT&T Inc and Verizon Communications Inc to run trials based on standards to be released later this year.",
        "date": "09072017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel to update 5G testing device to meet standards "
    },
    {
        "content": "LUXEMBOURG/BRUSSELS Europe's top judges dealt a rare blow to European Union antitrust regulators on Wednesday by sending their case against U.S. chipmaker Intel Corp  back to court for an appeal. | Video ",
        "date": "09062017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Court orders Intel case review in EU antitrust blow "
    },
    {
        "content": "* Firms may be more ready to challenge EU antitrust moves (Adds Intel comment)",
        "date": "09062017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Court orders Intel case review in EU antitrust blow "
    },
    {
        "content": "LUXEMBOURG  Sept 6 Europe's top court on Wednesday told a lower court to re-examine U.S. chipmaker Intel's appeal against a 1.06-billion-euro ($1.3 billion) EU antitrust fine.",
        "date": "09062017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "EU's top court refers Intel antitrust case back to lower court "
    },
    {
        "content": "* Intel decision could affect cases against Qualcomm and Google",
        "date": "09042017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Landmark Intel judgment critical for other EU antitrust cases "
    },
    {
        "content": "* Intel Corp reports a 12.9 pct passive stake in Borqs Technologies Inc as of August 18 - SEC filing ​ Source text: (http://bit.ly/2wN2pqx) Further company coverage:",
        "date": "08282017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-‍Intel reports 12.9 pct passive stake in Borqs Technologies as of August 18 "
    },
    {
        "content": "* Intel Corp - ‍ on Aug 23  co announced Michelle Johnston Holthaus will become head of its sales and marketing group effective Sept 6  2017 - SEC filing​ Source text for Eikon: (http://bit.ly/2woQtKY) Further company coverage:",
        "date": "08232017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel Corp says Michelle Johnston Holthaus to become head of its sales and marketing group effective Sept 6  2017 "
    },
    {
        "content": "* Intel completes subsequent offering period of tender offer for mobileye",
        "date": "08222017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel completes subsequent offering period of tender offer for Mobileye "
    },
    {
        "content": "* CO UNVEILS 8TH GEN INTEL CORE PROCESSOR FAMILY AND LAUNCHES FIRST OF FAMILY ON MONDAY  AUG. 21  2017 Source text for Eikon: Further company coverage:",
        "date": "08212017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel unveils 8th gen Intel core processors "
    },
    {
        "content": "* Intel Corporation reports 18.3 percent stake in Vuzix Corp as of August 14  2017 - SEC filing‍​",
        "date": "08182017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel reports 18.3 pct stake in Vuzix as of August 14  2017 "
    },
    {
        "content": "TORONTO  Aug 18 BlackBerry Ltd shares have been plunging from their more than two-year high hit in June after lackluster earnings and competitive threats have raised doubts about prospects for a turnaround at the business software maker.",
        "date": "08182017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BlackBerry rally derailed as investors lose patience on turnaround "
    },
    {
        "content": "* signed MoU with BMW  Intel and Mobileye to develop tech platform for self-driving cars Source text for Eikon: Further company coverage: (Reporting by Milan newsroom)",
        "date": "08162017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Fiat signs MoU with BMW  Intel and Mobileye for self-driving car technology "
    },
    {
        "content": "* Intel CEO leaves Trump's Manufacturing Council Source text - http://intel.ly/2fFOjAd Further company coverage: (Bengaluru Newsroom)",
        "date": "08152017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel CEO leaves Trump's Manufacturing Council "
    },
    {
        "content": "* Says issued $640 million aggregate principal amount of 4.10% senior notes due 2047 - SEC filing‍​ Source text - (http://bit.ly/2wIXsMi) Further company coverage:",
        "date": "08142017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel issues $640 mln of 4.10% senior notes due 2047‍​ "
    },
    {
        "content": "FRANKFURT  Aug 8 Computer chip maker Intel Corp has further extended its offer to buy out remaining shareholders of Mobileye NV after securing 84 percent of the acquisition target's shares  the two companies said on Tuesday.",
        "date": "08082017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel further extends Mobileye offer to mop up outstanding stock "
    },
    {
        "content": "Aug 4 Apple Inc plans to release a version of its smartwatch later this year that can connect directly to cellular networks  Bloomberg reported on Friday  citing people familiar with the matter.",
        "date": "08042017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "UPDATE 1-Apple to launch watches that can make calls - Bloomberg "
    },
    {
        "content": "* Files term sheet for pricing of $640.0 million senior notes due 2047 ‍​- sec filing Source text : http://bit.ly/2u872us Further company coverage:",
        "date": "08032017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel files term sheet for pricing of $640.0 mln senior notes "
    },
    {
        "content": "* Mobileye co-founder  CEO Ziv Aviram  to retire immediately in wake of acquisition by Intel  says a statement from both companies. Source text for Eikon: Further company coverage: (Reporting by Steven Scheer  editing by David Evans)",
        "date": "08082017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Mobileye co-founder  CEO Ziv Aviram retires "
    },
    {
        "content": "SYDNEY  Aug 4 (IFR) - Verizon Communications (Baa1/BBB+/A–) has reopened Australia's Kangaroo bond market for global corporate issuers with a stunning four-tranche print that can only encourage further issuance from offshore blue chips.",
        "date": "08042017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Verizon stuns Kangaroo market with debut bond print Down Under "
    },
    {
        "content": "* Intel completes tender offer for Mobileye Source text for Eikon: Further company coverage:",
        "date": "08082017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel completes tender offer for Mobileye "
    },
    {
        "content": "* Entered into a partnership and signed a reseller agreement with C4D intel Source text for Eikon: Further company coverage:",
        "date": "08042017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Pointerra says C4D Intel to resell co's 3D data technology "
    },
    {
        "content": "* Mobileye announces satisfaction of antitrust clearance condition for tender offer by Intel",
        "date": "08012017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Mobileye announces satisfaction of antitrust clearance condition "
    },
    {
        "content": "* Intel announces satisfaction of antitrust clearance condition for proposed acquisition of Mobileye",
        "date": "08012017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel Corp says KFTC approved offer to purchase Mobileye N.V. "
    },
    {
        "content": "Aug 1 Private equity firm TPG said on Tuesday it would lead a $15 million funding round for Tel Aviv-based cyber security firm GuardiCore through its growth investment arm.",
        "date": "08012017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "TPG to invest in cyber security firm GuardiCore "
    },
    {
        "content": "* Intel extends cash tender offer for all outstanding shares of Mobileye",
        "date": "07312017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel extends cash tender offer for all outstanding shares of Mobileye "
    },
    {
        "content": "Chipmaker Intel Corp raised its full-year revenue and profit forecasts on higher expectations for its mainstay personal computer business and growth in newer areas such as artificial intelligence and autonomous driving.",
        "date": "07272017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel lifts forecasts as driverless tech  AI add to PC gains "
    },
    {
        "content": "July 27 Chipmaker Intel Corp raised its full-year revenue and profit forecasts on higher expectations for its mainstay personal computer business and growth in newer areas such as artificial intelligence and autonomous driving.",
        "date": "07272017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Intel lifts forecasts as driverless tech  AI add to PC gains "
    },
    {
        "content": "* Quarterly GAAP earnings per share (EPS) was $0.58 and non-GAAP EPS was $0.72‍​",
        "date": "07272017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel reports quarterly GAAP EPS of $0.58 "
    },
    {
        "content": "July 27 Intel Corp  the world's largest chipmaker  reported a 9.1 percent rise in quarterly revenue  helped by strength in its data center and personal computer businesses.",
        "date": "07272017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel Q2 revenue rises 9.1 pct "
    },
    {
        "content": "July 24 Qualcomm Inc fired back in its case against Apple Inc on Monday  accusing its critics of waging a \"coordinated effort aimed at misdirecting\" trade regulators.",
        "date": "07242017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Qualcomm accuses tech group of 'misdirecting' trade regulators "
    },
    {
        "content": "YONGIN  SOUTH KOREA Samsung Electronics  plans to triple the market share of its contract chip manufacturing business within the next five years by aggressively adding clients  a senior company executive said  as it targets new growth drivers for the chips business.",
        "date": "07242017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Samsung takes aim at TSMC with plans to triple chip foundry market share "
    },
    {
        "content": "An Israeli professor has agreed to pay more than $850 000 to settle U.S. claims he engaged in insider trading in Jerusalem-based Mobileye NV   a maker of sensors and cameras for self-driving vehicles  ahead of its $15.3 billion takeover by Intel Corp .",
        "date": "07252017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Israeli professor settles Mobileye insider trading case in U.S. "
    },
    {
        "content": "July 25 An Israeli professor has agreed to pay more than $850 000 to settle U.S. claims he engaged in insider trading in Jerusalem-based Mobileye NV  a maker of sensors and cameras for self-driving vehicles  ahead of its $15.3 billion takeover by Intel Corp.",
        "date": "07252017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Israeli professor settles Mobileye insider trading case in U.S. "
    },
    {
        "content": "July 25 An Israeli professor has agreed to pay more than $850 000 to settle U.S. claims he engaged in insider trading in Jerusalem-based Mobileye NV  a maker of sensors and cameras for self-driving vehicles  ahead of its $15.3 billion takeover by Intel Corp.",
        "date": "07252017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "CORRECTED-UPDATE 1-Israeli settles Mobileye insider trading case with U.S. regulators "
    },
    {
        "content": "July 25 An Israeli has agreed to pay more than $850 000 settle U.S.  claims he engaged in insider trading in Jerusalem-based Mobileye NV  a maker of sensors and cameras for self-driving vehicles  ahead of its $15.3 billion takeover by Intel Corp.",
        "date": "07252017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Israeli settles Mobileye insider trading case with U.S. regulators "
    },
    {
        "content": "* Says Intel Corporation's board of directors has declared a quarterly dividend of $0.2725 per share​ Source text for Eikon: Further company coverage:",
        "date": "07212017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel says board has declared qtrly dividend of $0.2725/shr "
    },
    {
        "content": "A group representing major technology companies has aligned itself against Qualcomm Inc in its legal dispute with Apple Inc by calling on regulators to reject Qualcomm's bid to ban the import of iPhones.",
        "date": "07212017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Tech group sides with Apple in Qualcomm's iPhone ban dispute "
    },
    {
        "content": "* Intel has axed the group working on fitness trackers and health wearables - CNBC  citing source Source : http://cnb.cx/2uEkN3b",
        "date": "07202017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel has axed group working on fitness trackers and health wearables - CNBC  citing source "
    },
    {
        "content": "July 20 A group representing major technology companies has aligned itself against Qualcomm Inc in its legal dispute with Apple Inc by calling on regulators to reject Qualcomm's bid to ban the import of iPhones.",
        "date": "07202017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Tech group sides with Apple in Qualcomm's iPhone ban dispute "
    },
    {
        "content": "* Mobileye announces receipt of Israel Tax Authority ruling and further extension of cash tender offer",
        "date": "07142017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Mobileye announces receipt of Israel Tax Authority ruling "
    },
    {
        "content": "* Intel announces receipt of Israel Tax Authority ruling for Mobileye asset sale and further extension of cash tender offer for all outstanding shares of Mobileye",
        "date": "07142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel announces receipt of Israel Tax Authority ruling "
    },
    {
        "content": "HONG KONG  July 12 Razer Inc  a gaming hardware maker backed by Intel Corp  and Hong Kong billionaire Li Ka-shing  plans to go public toward the end of October in an IPO that will value the company at up to $5 billion  a person familiar with the deal said on Wednesday.",
        "date": "07122017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Gaming hardware maker Razer seeks Oct HK IPO at up to $5 bln valuation-source "
    },
    {
        "content": "* Intel announces approval under German and Austrian competition laws for proposed acquisition of Mobileye",
        "date": "07102017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel announces approval under German and Austrian competition laws for proposed acquisition of Mobileye "
    },
    {
        "content": "NEW YORK  July 11 Intel Corp. on Tuesday announced a new line of microprocessors for data centers  setting up a battle with Advanced Micro Devices and others for the lucrative business of supplying the chips that power cloud computing.",
        "date": "07112017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel rolls out new chips in battle for data center business "
    },
    {
        "content": "WASHINGTON Chipmaker Qualcomm Inc  will ask the U.S. International Trade Commission to bar Apple Inc  from selling some iPhones and iPads in the United States that use chips made by competitor Intel Corp  on the grounds that the devices infringe on six Qualcomm patents.",
        "date": "07062017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Qualcomm accuses Apple of infringing six patents in iPhone  iPad "
    },
    {
        "content": "WASHINGTON  July 6 Chipmaker Qualcomm Inc will ask the U.S. International Trade Commission to bar Apple Inc from selling some iPhones and iPads in the United States that use chips made by competitor Intel Corp on the grounds that the devices infringe on six Qualcomm patents.",
        "date": "07062017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Qualcomm accuses Apple of infringing six patents in iPhone  iPad "
    },
    {
        "content": "NEW YORK  July 5 John McAfee  the creator of eponymous antivirus computer software  has settled a lawsuit against Intel Corp over his right to use his name on other projects after the chipmaker bought his former company.",
        "date": "07052017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel  John McAfee settle lawsuits over antivirus pioneer's name "
    },
    {
        "content": "SEOUL  July 5 Samsung Electronics Co Ltd is expected to report its best-ever quarterly profit in the second quarter  with soaring memory chip sales pushing it past Intel Corp as the biggest semiconductor maker by revenue for the first time.",
        "date": "07042017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Samsung on track to take Intel's chip crown with record Q2 earnings "
    },
    {
        "content": "DETROIT  July 5 Baidu Inc  the top Chinese internet search firm  has formed a broad alliance to promote self-driving cars  pitting its Apollo platform against Alphabet Inc's system  it said on Wednesday  in hopes of getting the vehicles on the road in China by 2019.",
        "date": "07052017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "China's Baidu taps 50 partners to help advance self-driving "
    },
    {
        "content": "SEOUL Samsung Electronics Co Ltd  is expected to report its best-ever quarterly profit in the second quarter  with soaring memory chip sales pushing it past Intel Corp  as the biggest semiconductor maker by revenue for the first time.",
        "date": "07052017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Samsung on track to take Intel's chip crown with record second-quarter earnings "
    },
    {
        "content": "BRUSSELS Europe's top court will rule on Sept. 6 whether to uphold Intel's appeal against a 1.06-billion-euro ($1.2 billion) EU antitrust fine  a case with ramifications for Google's challenge against a record sanction handed out this week.",
        "date": "06302017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Top EU court to rule on Intel antitrust case on Sept 6 "
    },
    {
        "content": "BRUSSELS  June 30 Europe's top court will rule on Sept. 6 whether to uphold Intel's appeal against a 1.06-billion-euro ($1.2 billion) EU antitrust fine  a case with ramifications for Google's challenge against a record sanction handed out this week.",
        "date": "06302017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Top EU court to rule on Intel antitrust case on Sept. 6 "
    },
    {
        "content": "* Meet Group Inc - on June 27  2017  Meet Group  Inc.  a Delaware corporation entered into a cooperation agreement - sec filing",
        "date": "06292017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Meet Group  on June 27  2017  Co  a Delaware corporation entered into cooperation agreement "
    },
    {
        "content": "PARIS  June 26 Europe's top court is likely to rule on Intel's appeal against a record 1.06 billion euro ($1.19 billion) EU antitrust fine next year  an EU judge said on Monday  a case that may affect companies such as Google and Qualcomm in the EU's crosshairs.",
        "date": "06262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "EU court seen ruling on Intel antitrust case next year - judge "
    },
    {
        "content": "PARIS Europe's top court is likely to rule on Intel's  appeal against a record 1.06 billion euro ($1.19 billion) EU antitrust fine next year  an EU judge said on Monday  a case that may affect companies such as Google  and Qualcomm  in the EU's crosshairs.",
        "date": "06262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "EU court seen ruling on Intel antitrust case next year: judge "
    },
    {
        "content": "* Intel extends cash tender offer for all outstanding shares of Mobileye",
        "date": "06222017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel extends cash tender offer for outstanding shares of Mobileye "
    },
    {
        "content": "* Shares slumped 70 percent when Apple ditched firm (Adds reaction  background)",
        "date": "06222017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Imagination Tech up for sale after bruising Apple fight "
    },
    {
        "content": "BERLIN  June 20 Continental said on Tuesday it would join a self-driving platform developed by BMW   Intel and Mobileye with the German auto parts and tyre maker handling integration of components and software.",
        "date": "06202017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Continental joins BMW  Intel  Mobileye platform for self-driving cars "
    },
    {
        "content": "SAN FRANCISCO Intel Corp  said on Wednesday it would become a major sponsor of the International Olympic Committee  making the chipmaker the latest technology company to put marketing dollars behind the global sporting event.",
        "date": "06212017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel signs Olympics sponsorship deal through 2024 "
    },
    {
        "content": "SAN FRANCISCO  June 21 Intel Corp said on Wednesday it would become a major sponsor of the International Olympic Committee  making the chipmaker the latest technology company to put marketing dollars behind the global sporting event.",
        "date": "06212017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-OLYMPICS-Intel signs Olympics sponsorship deal through 2024 "
    },
    {
        "content": "JERUSALEM  June 21 Intel Corp. has joined Team8  an Israeli creator of cybersecurity start-ups  as a strategic partner and will help with the formation of companies that address the largest cybersecurity problems  Team8 said on Wednesday.",
        "date": "06212017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel to collaborate with Israel's Team8  Illusive on cybersecurity "
    },
    {
        "content": "ZURICH  June 21 The International Olympic Committee will partner with Intel through 2024  the IOC said on Wednesday  bringing in the U.S. technology group after McDonald's last week ended a tie-up three years early.",
        "date": "06212017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "After McDonald's exit  IOC and Intel forge Olympic tie-up to 2024 "
    },
    {
        "content": "SAN FRANCISCO  June 21 Intel Corp said on Wednesday that it would become a major sponsor of the International Olympic Committee  making the chipmaker the latest technology company to put marketing dollars behind the global sporting event.",
        "date": "06212017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "OLYMPICS-Intel signs Olympics sponsorship deal "
    },
    {
        "content": "* Intel announces approval under Israel restrictive trade practices law for proposed acquisition of Mobileye",
        "date": "06142017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel says Israel restrictive trade practices law approves proposed Mobileye deal "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 14 (Fitch) Fitch Ratings has assigned an 'A+' rating to Intel Corporation's (Intel) $600 million seven-year senior notes offering. Intel will use net proceeds for general corporate purposes  ahead of the company's pending acquisition of Mobileye N.V. (Mobileye). Intel just received U.S. regulatory approval for the acquisition and Fitch believes the transaction should close before the end of calendar year 2017. Pro forma fo",
        "date": "06142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Fitch Rates Intel's $600MM 7-Year Senior Notes Offering 'A+' "
    },
    {
        "content": "* Files for pricing of 2.700pct senior notes due 2024 of upto $600.0 million Source text: (http://bit.ly/2syguG3) Further company coverage:",
        "date": "06132017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel files for pricing of 2.700pct senior notes due 2024 "
    },
    {
        "content": "* Intel to invest US$178 million to advance its research and development innovation in India Source text - http://intel.ly/2rZf4Dp Further company coverage:",
        "date": "06142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel to invest $178 mln to advance its R&D innovation in India "
    },
    {
        "content": "* Intel announces expiration of Hart-Scott-Rodino waiting period for proposed acquisition of Mobileye",
        "date": "06122017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel announces expiration of HSR waiting period for proposed acquisition of Mobileye "
    },
    {
        "content": "* Mobileye announces expiration of Hart-Scott-Rodino waiting period",
        "date": "06122017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Mobileye says HSR waiting period expires "
    },
    {
        "content": "* Says collaborates with Intel to drive digital transformations",
        "date": "06122017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-India's TCS collaborates with Intel to drive digital transformations "
    },
    {
        "content": "DETROIT  June 7 Delphi Automotive PLC will partner with Paris-based Transdev Group  a public transport service controlled by the French government  to develop an automated on-demand shuttle service in Europe  the companies said on Wednesday.",
        "date": "06072017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Delphi  Transdev to develop self-driving transport service in Europe "
    },
    {
        "content": "DETROIT  June 7 Delphi Automotive PLC will partner with Paris-based Transdev Group  a public transport service controlled by the French government  to develop an automated on-demand shuttle service in Europe  the companies said on Wednesday.",
        "date": "06072017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Delphi  Transdev to develop self-driving shuttle service in Europe "
    },
    {
        "content": "* Announced a 3-year partnership with MLB to deliver live and on-demand virtual reality experiences starting with 2017 MLB regular season Source text for Eikon: Further company coverage:",
        "date": "06012017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel announces a 3-year partnership with Major League Baseball "
    },
    {
        "content": "* Q1 revenue $124.7 million versus I/B/E/S view $118.1 million",
        "date": "06012017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Mobileye Q1 non-GAAP earnings per share $0.25 "
    },
    {
        "content": "* Navin Shenoy was promoted from senior vice president to executive vice president.",
        "date": "05302017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel promotes three corporate officers "
    },
    {
        "content": "PARIS  May 24 Renault:  * Planning to buy some French R&D businesses of Intel * Expects deal to completed during Q2 ",
        "date": "05242017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Renault planning to buy some French R&D activities of Intel "
    },
    {
        "content": "* BMW Group  Intel and Mobileye announce Delphi as a development partner and system integrator for their autonomous driving platform",
        "date": "05162017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-BMW Group  Intel and Mobileye announce Delphi as development partner for autonomous driving platform "
    },
    {
        "content": "JERUSALEM  May 16 Israel sought to prevent the shekel rising further on Tuesday by agreeing to allow Intel Corp to pay the tax due on its planned purchase of Israeli autonomous vehicle technology firm Mobileye in dollars.",
        "date": "05162017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Israel to let Intel pay Mobileye tax in dollars to avoid shekel rise "
    },
    {
        "content": "* Intel Corp says  on May 11  2017   issued $700 million aggregate principal amount of floating rate senior notes due 2020",
        "date": "05112017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel says issued $700 mln aggregate principal amount of floating rate senior notes due 2020 "
    },
    {
        "content": "* Intel corp says  navin shenoy to take the position of general manager of data center group (dcg)",
        "date": "05032017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel says Navin Shenoy to take the position of general manager of DCG "
    },
    {
        "content": "Intel Corp reported lower-than-expected quarterly revenue due to an unexpected slowdown in growth at its data center business  on which the world's largest chipmaker is banking to reduce its reliance on the personal computer market.",
        "date": "04272017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel's revenue misses estimates as data center growth slows "
    },
    {
        "content": "* Shares fall nearly 4 pct after the bell (Adds details from conference call)",
        "date": "04272017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 4-Intel's revenue misses estimates as data center growth slows "
    },
    {
        "content": "* First-quarter revenue of $14.8 billion  up 8 percent year-over-year on a GAAP basis",
        "date": "04272017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel posts Q1 non-GAAP profit of 66 cents/share "
    },
    {
        "content": "* Qtrly client computing group revenue of $8.0 billion  up 6 percent",
        "date": "04272017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel sees FY 2017 non-GAAP earnings $2.85/share  +/- 5 pct "
    },
    {
        "content": "April 27 Intel Corp  the world's largest chipmaker  reported a near 45 percent rise in first-quarter profit  helped by strength in its data center business and a stabilizing personal computer market.",
        "date": "04272017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel's quarterly profit rises 45 pct "
    },
    {
        "content": "LONDON  April 24 Britain's Atom has hired pop star will.i.am as a strategic adviser to its board as the app-based bank seeks to grow.",
        "date": "04242017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "will.i.am to mix tech know-how with banking at Britain's Atom "
    },
    {
        "content": "SHANGHAI  April 17 Global automakers face fresh threats to their profits in China from domestic automakers SAIC and Geely  which are launching new models and marketing strategies to challenge better-known foreign brands in the world's largest car market.",
        "date": "04172017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Chinese automakers SAIC  Geely turn up heat on global rivals "
    },
    {
        "content": "* Diane Bryant  Murthy Renduchintala and Stacy Smith have been promoted to group presidents and Renduchintala has been appointed chief engineering officer Source text (http://intel.ly/2osYOIV) Further company coverage:",
        "date": "04122017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel promotes three executives "
    },
    {
        "content": "NEW YORK  April 6 Two Virginia men have been charged by the U.S. Securities and Exchange Commission with insider trading in Mobileye NV before the maker of sensors and cameras for driverless vehicles agreed to a $15.3 billion takeover by Intel Corp.",
        "date": "04062017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "SEC charges Virginia men with Intel-Mobileye insider trading "
    },
    {
        "content": "NEW YORK Two Virginia men have been charged by the U.S. Securities and Exchange Commission with insider trading in Mobileye NV before the maker of sensors and cameras for driverless vehicles agreed to a $15.3 billion takeover by Intel Corp.",
        "date": "04072017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "SEC charges Virginia men with Intel-Mobileye insider trading "
    },
    {
        "content": "* Intel Corp - CEO Brian M. Krzanich's 2016 total compensation was $19.1 million versus $14.6 million in 2015 - SEC filing",
        "date": "04062017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel Corp says CEO Brian M. Krzanich's 2016 total compensation was $19.1 mln "
    },
    {
        "content": "* Intel commences cash tender offer for all outstanding shares of Mobileye",
        "date": "04052017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel commences cash tender offer for outstanding shares of Mobileye "
    },
    {
        "content": "JERUSALEM  March 30 With the ink barely dry on the $15 billion sale of his autonomous driving technology firm Mobileye to Intel  inventive Israeli entrepreneur Amnon Shashua now has his sights set on taking another start-up public by the end of next year.",
        "date": "03302017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "After sale to Intel  Mobileye's founder raises sights on IPO for OrCam "
    },
    {
        "content": "* Appointment of Aicha S. Evans as chief strategy officer  effective immediately",
        "date": "03292017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel appoints Aicha Evans as chief strategy officer "
    },
    {
        "content": "NEW YORK  March 23 Two Israeli residents have been charged by the U.S. Securities and Exchange Commission with insider trading in Mobileye NV before the maker of sensors and cameras for driverless vehicles agreed to be acquired by Intel Corp for $15.3 billion.",
        "date": "03232017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "UPDATE 2-SEC charges two Israeli residents with Mobileye insider trading "
    },
    {
        "content": "NEW YORK Chinese telecom equipment maker ZTE Corp  on Wednesday pleaded guilty in U.S. federal court in Texas for conspiring to violate U.S. sanctions by illegally shipping U.S. goods and technology to Iran.",
        "date": "03232017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "China's ZTE Corp pleads guilty in U.S. court in sanctions case "
    },
    {
        "content": "NEW YORK  March 22 Chinese telecom equipment maker ZTE Corp  on Wednesday pleaded guilty in U.S. federal court in Texas for conspiring to violate U.S. sanctions by illegally shipping U.S. goods and technology to Iran.",
        "date": "03222017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-China's ZTE Corp pleads guilty in U.S. court in sanctions case "
    },
    {
        "content": "NEW YORK  March 23 Two Israeli residents have been charged by the U.S. Securities and Exchange Commission with insider trading in Mobileye NV before the maker of sensors and cameras for driverless vehicles agreed to be acquired by Intel Corp for $15.3 billion.",
        "date": "03232017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "SEC charges two Israeli residents with Mobileye insider trading "
    },
    {
        "content": "* Israeli start-ups raised nearly $5 billion in 2016  up 11 pct",
        "date": "03222017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Mobileye deal to fuel investment in late-stage Israeli start-ups "
    },
    {
        "content": "March 23 SEC Files Lawsuit Accusing Two Israeli Residents Of Insider Trading Ahead Of Intel's",
        "date": "03232017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-SEC accuses two Israeli residents of insider trading ahead of Intel-Mobileye merger "
    },
    {
        "content": "* Tepco to link up with intel to manage power grids in Asia and Africa -Nikkei",
        "date": "03212017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Tepco to link up with Intel to manage power grids in Asia and Africa -Nikkei "
    },
    {
        "content": "* Intel corp - board of directors has declared a quarterly dividend of $0.2725 cents per share  Source text for Eikon:  Further company coverage:",
        "date": "03232017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel raises quarterly dividend by 5 pct "
    },
    {
        "content": "* Announced that Omar Ishrak and Greg Smith have been elected to Intel's board of directors.  Source text for Eikon: Further company coverage:",
        "date": "03232017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel elects two new members to the board "
    },
    {
        "content": "* Israeli start-ups raised nearly $5 billion in 2016  up 11 pct",
        "date": "03232017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "RPT-Mobileye deal to fuel investment in late-stage Israeli start-ups "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - The chipmaker is shelling out $15 bln for autonomous-driving parts firm Mobileye  a cool 30 times estimated revenue. Intel missed the mobile-phone revolution. Is it finally on the right road? Plus: Washington bounces bitcoin’s bid for mainstream acceptance.",
        "date": "03162017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Viewsroom: Intel’s pricey bet on driverless cars "
    },
    {
        "content": "Intel is paying more than $15 billion to get into direct competition with Nvidia and Qualcomm to develop driverless systems for automakers. And  as Reuters' Tova Cohen  Ari Rabinovitch and Paul Lienert report  they're paying big to do it: 21 times Mobileye's expected 2017 revenue and 60 times earnings -- high valuations in just about any field  but certainly in this one. Find out why Intel thinks the cost is worth it.",
        "date": "03142017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Reuters Select: The optics of Intel's Mobileye acquisition "
    },
    {
        "content": "BRUNNEN  Switzerland  March 14 Swiss watchmaker TAG Heuer  owned by LVMH  sought to appeal to tech geeks and traditionalists alike on Tuesday by launching a connected watch that lets wearers switch between a smart watch head and a traditional mechanical movement.",
        "date": "03142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Connected or mechanical? TAG Heuer tries to bridge gap with module watch "
    },
    {
        "content": "JERUSALEM Israel's government will receive about 4 billion shekels ($1.1 billion) after Intel's  planned $15.3 billion purchase of self-driving car tech firm Mobileye   helping the government cut more taxes  Finance Minister Moshe Kahlon said on Tuesday.",
        "date": "03142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Israel eyes tax cuts as Intel-Mobileye deal to boost coffers by $1 billion "
    },
    {
        "content": "JERUSALEM  March 14 Israel's government will receive about 4 billion shekels ($1.1 billion) after Intel's  planned $15.3 billion purchase of self-driving car tech firm Mobileye  helping the government cut more taxes  Finance Minister Moshe Kahlon said on Tuesday.",
        "date": "03142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Israel eyes tax cuts as Intel-Mobileye deal to boost coffers by $1 bln "
    },
    {
        "content": "BRUNNEN  Switzerland  March 14 Demand for Swiss watches has improved  driven by a rebound in Chinese purchases  the head of luxury group LVMH's watch business said on Tuesday.",
        "date": "03142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Swiss watch demand improving thanks to China - LVMH watch head Biver "
    },
    {
        "content": "March 14 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "03142017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "PRESS DIGEST - Wall Street Journal - March 14 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 15 (Fitch) This release corrects the rating in the title of the  release that went out earlier today. Fitch Ratings has affirmed the ratings for Intel Corporation (Intel)  including  the Long- and Short-Term Issuer Default Ratings (IDR) at 'A+/F1'  on news that  the company will acquire computer vision for advanced driver-assistance systems  (ADAS) provider  Mobileye NV (Mobileye)  for $14.7 billion in cash. The Rating  O",
        "date": "03152017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Correction: Fitch Affirms Intel at 'A+/F1' on Mobileye Acquisition; Outlook Stable "
    },
    {
        "content": "BERLIN  March 15 Bosch  the world's biggest maker of automotive components  will continue to develop its own visual technology regardless of Intel's $15 billion deal to buy Mobileye  an executive said on Wednesday.",
        "date": "03152017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Bosch sticks to own technology in face of Intel-Mobileye merger "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 15 (Fitch) Fitch Ratings has affirmed the ratings for Intel  Corporation (Intel)  including the Long- and Short-Term Issuer Default Ratings  (IDR) at 'A+/F1'  on news that the company will acquire computer vision for  advanced driver-assistance systems (ADAS) provider  Mobileye NV (Mobileye)  for  $14.7 billion in cash. The Rating Outlook is Stable. Fitch's actions affect  $25.3 billion of total debt. A full list of ratin",
        "date": "03152017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Fitch Affirms Intel at 'A-/F1' on Mobileye Acquisition; Outlook Stable "
    },
    {
        "content": "SAN FRANCISCO  March 14 To understand Intel's $15.3 billion proposed acquisition of Israel's Mobileye  imagine the data created and compiled by a self-driving car scanning the road and objects around it as a potential source of revenue.",
        "date": "03152017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel bets on selling Mobileye data  with maps a first test "
    },
    {
        "content": "JERUSALEM/DETROIT Intel Corp  agreed to buy Israeli autonomous vehicle technology firm Mobileye  for $15.3 billion on Monday in a deal that could thrust the U.S. chipmaker into direct competition with rivals Nvidia Corp  and Qualcomm Inc  to develop driverless systems for global automakers. | Video ",
        "date": "03132017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel's $15 billion purchase of Mobileye shakes up driverless car sector "
    },
    {
        "content": "March 13 Intel Corp has had a tough time squeezing value out of recent mega-deals  putting some pressure on the success of its proposed $15 billion acquisition of Israeli car-technology firm Mobileye NV.",
        "date": "03132017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel banking on Mobileye deal for a drive in the right direction "
    },
    {
        "content": "* Mobileye shares up 28.2 percent to $60.62   (Adds analysts' comments  skepticism about self-driving cars)",
        "date": "03132017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 8-Intel's $15 bln purchase of Mobileye shakes up driverless car sector "
    },
    {
        "content": "* Dow down 0.1 pct  S&P 500 up 0.04 pct  Nasdaq up 0.24 pct   (Updates to market close  changes dateline  byline)",
        "date": "03132017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St drifts along with eyes on Fed; Intel drops "
    },
    {
        "content": "March 13 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "03132017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - China has been giving fair warning. Telecoms equipment maker ZTE has agreed to plead guilty for violating U.S. export controls. The charges could have been more severe and the $892 million fine is manageable for the $9 billion company. More powerful is the message: the new U.S. administration is prepared to take action against corporate giants to rein in troublesome nations.",
        "date": "03082017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "U.S. tech sanctions will rattle China's firewall "
    },
    {
        "content": "Intel Corp   which on Monday announced the proposed $15.3 billion acquisition of Mobileye NV   had invested in at least five startup companies working on self-driving vehicle technologies.",
        "date": "03132017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Factbox: Intel invested in five self-driving startups "
    },
    {
        "content": "* ZTE to plead guilty to evading U.S. sanctions on Iran  N.Korea",
        "date": "03082017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 5-China's ZTE pleads guilty  settles U.S. sanctions case for nearly $900 mln "
    },
    {
        "content": "March 13 Intel Corp  which on Monday announced the proposed $15.3 billion acquisition of Mobileye NV   had invested in at least five startup companies working on self-driving vehicle technologies.",
        "date": "03132017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "FACTBOX-Intel invested in five self-driving startups "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Intel has put the self-driving pedal to the financial metal. Buying Mobileye for $15.3 billion values the autonomous-car parts supplier at 30 times this year's estimated revenue  according to Thomson Reuters data. Justifying such a racy price tag will take some doing.",
        "date": "03132017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel puts self-driving pedal to financial metal "
    },
    {
        "content": "JERUSALEM  March 13 Chipmaker Intel has agreed to buy Israeli technology firm Mobileye for $14-$15 billion dollars  according to TheMarker  one of Israel's leading financial newspapers.",
        "date": "03132017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel to buy Mobileye for $14-$15 bln -Israeli media report "
    },
    {
        "content": "* Intel-On March 2  John J. Donahoe informed co that he will not stand for re-election to Intel's board - SEC filing",
        "date": "03062017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel says John Donahoe informs he will not stand for re-election to board "
    },
    {
        "content": "* Nokia and Intel launch 5G acceleration labs in U.S. and Finland to help operators bring 5G innovations to market",
        "date": "02212017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Nokia and Intel launch 5G acceleration labs "
    },
    {
        "content": "* announces technology development collaboration with Intel  Source text for Eikon:  Further company coverage:",
        "date": "02152017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Oneview Healthcare announces technology development collaboration with Intel "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Coca Cola Co - SEC filing",
        "date": "02142017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Soros Fund Management takes share stake in Tata Motors  dissolves share stake in Coca Cola  Dunkin' Brands "
    },
    {
        "content": "* Intel Corp reports 4.9 percent passive stake in Impinj Inc as of February 2 - SEC filing  Source text for Eikon: (http://bit.ly/2kcNnVj) Further company coverage:",
        "date": "02102017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel Corp reports 4.9 percent passive stake in Impinj Inc as of February 2 - SEC filing "
    },
    {
        "content": "WASHINGTON Intel Corp  chose the White House Oval Office as its backdrop to announce a $7 billion investment in a previously shelved Arizona factory  which it said would create 3 000 jobs when it is up and running. | Video ",
        "date": "02082017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel uses White House Oval Office for splash on Arizona factory "
    },
    {
        "content": "WASHINGTON  Feb 8 Intel Corp chose the White House Oval Office as its backdrop to announce a $7 billion investment in a previously shelved Arizona factory  which it said would create 3 000 jobs when it is up and running.",
        "date": "02082017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Intel uses White House Oval Office for splash on Arizona factory "
    },
    {
        "content": "WASHINGTON President Donald Trump will meet with Intel Corp  chief executive Brian Krzanich on Wednesday afternoon  the White House said  offering no further details.",
        "date": "02082017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Trump to meet with Intel CEO on Wednesday: White House "
    },
    {
        "content": "WHITE HOUSE OFFICIAL SAYS THERE WILL BE NO INCENTIVES FROM THE FEDERAL GOVERNMENT FOR INTEL PROJECT",
        "date": "02082017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "WHITE HOUSE OFFICIAL SAYS THERE WILL BE NO INCENTIVES FROM THE FEDERAL GOVERNMENT FOR INTEL PROJECT "
    },
    {
        "content": "WASHINGTON  Feb 8 President Donald Trump will meet with Intel Corp chief executive Brian Krzanich on Wednesday afternoon  the White House said  offering no further details.",
        "date": "02082017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Trump to meet with Intel CEO on Wednesday -White House "
    },
    {
        "content": "Advanced Micro Devices Inc (AMD) shares could double in a year as the chip maker recoups ground lost to Intel Corp and increases its market share in the graphic chips area dominated by Nvidia Corp  Barron's said on Sunday.",
        "date": "02062017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "AMD stock could double in a year: Barron's "
    },
    {
        "content": "* Aicha Evans promoted to Senior Vice President; Steven Rodgers promoted to EVP; Leslie Culbertson promoted to SVP  Director of Human Resources  Source text for Eikon:  Further company coverage:",
        "date": "01302017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel promotes three corporate officers "
    },
    {
        "content": "BRUSSELS  Jan 27 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01272017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "EU mergers and takeovers (Jan 27) "
    },
    {
        "content": "* Intel -impact of equity investments and interest and other  net for 2017 is estimated to be about $900 million on gaap basis  and about $500 million on non-GAAP basis",
        "date": "01272017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel says impact of equity investments and interest for 2017 is estimated to be about $900 mln "
    },
    {
        "content": "Intel Corp reported better-than-expected quarterly revenue and profit driven by a stabilizing PC market and growth in its data center business  which offers cloud-based software services.",
        "date": "01262017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Data center growth drives Intel's fourth-quarter revenue  profit beat "
    },
    {
        "content": "* Q4 adj EPS 79 cents vs est 74 cents   (Adds analyst comments  conference call details  updates shares)",
        "date": "01262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Data center growth drives Intel's 4th-qtr revenue  profit beat "
    },
    {
        "content": "* Q4 client computing group revenue of $9.1 billion  up 4 percent year-over-year",
        "date": "01262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel reports Q4 EPS of $0.73 "
    },
    {
        "content": "Jan 26 Intel Corp reported a 9.8 percent rise in quarterly revenue on Thursday  boosted by a stabilizing PC market and a rise in demand for its data center services.",
        "date": "01262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel reports 9.8 pct rise in quarterly revenue "
    },
    {
        "content": "Please click on the link below for Intel Corp's quarterly earnings press release:  Source text: http://bit.ly/2juu4ES",
        "date": "01262017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel Corp quarterly results press release "
    },
    {
        "content": "* Declared a quarterly dividend of 26 cents per share  Source text for Eikon:  Further company coverage:",
        "date": "01232017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel declares a quarterly dividend "
    },
    {
        "content": "DUESSELDORF  Germany  Jan 24 Germany's Federal Cartel Office said on Tuesday it had approved stake purchases in German digital mapping firm HERE by U.S. chip maker Intel  and China's NavInfo.",
        "date": "01242017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "German regulator clears HERE stake purchases by Intel  NavInfo "
    },
    {
        "content": "Apple Inc filed a $1 billion lawsuit against supplier Qualcomm Inc on Friday  days after the U.S. government accused the chip maker of resorting to anticompetitive tactics to maintain a monopoly over key semiconductors in mobile phones.",
        "date": "01212017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Apple files $1 billion lawsuit against chip supplier Qualcomm "
    },
    {
        "content": "Jan 20 Apple Inc filed a $1 billion lawsuit against supplier Qualcomm Inc on Friday  days after the U.S. government accused the chip maker of resorting to anticompetitive tactics to maintain a monopoly over key semiconductors in mobile phones.",
        "date": "01212017",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 4-Apple files $1 billion lawsuit against chip supplier Qualcomm "
    },
    {
        "content": "BERLIN BMW's alliance with Intel and Mobileye aims to put a fleet of around 40 self-driving test vehicles on the road in the second half of this year  the companies said.",
        "date": "01042017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BMW  Intel  Mobileye to test 40 driverless cars in second half of 2017 "
    },
    {
        "content": "FRANKFURT U.S. chip maker Intel  will take a 15 percent stake in German digital mapping firm HERE  it said on Tuesday  as it seeks to build its presence in automated driving technology.",
        "date": "01032017",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel to take stake in German mapping firm HERE in automated driving push "
    },
    {
        "content": "The overseers of the U.S. intelligence community have not embraced a CIA assessment that Russian cyber attacks were aimed at helping Republican President-elect Donald Trump win the 2016 election.Three American officials told Reuters that the Office of the Director of National Intelligence (ODNI) did not endorse the CIA analysis because of a lack of conclusive evidence that Moscow was trying to assist Trump at the expense of Democratic rival Hillary Clinton. Trump has called the CIA finding “ridi",
        "date": "12132016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel agencies at odds over Russian hacking "
    },
    {
        "content": "Nov 29 Auto parts maker Delphi Automotive Plc  and Israeli technology firm Mobileye NV will put an Intel Corp chip at the heart of their joint effort to produce self-driving vehicles by 2019  the companies said on Tuesday.",
        "date": "11292016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Delphi  Mobileye to use Intel chip for self-driving car system "
    },
    {
        "content": "* Strategic partnerships with Microsoft & Intel to benefit startups in its technology focused real estate accelerator program  Source text: http://bit.ly/2fjcaTC Further company coverage:",
        "date": "11212016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Brigade Enterprises partners with Microsoft  Intel for real estate accelerator program "
    },
    {
        "content": "Nov 16 Wearable display maker Vuzix Corp  said on Wednesday that Intel Corp had decided to halt its collaboration with the company related to the development of Internet-connected headsets.",
        "date": "11162016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Vuzix shares slump after Intel halts headset partnership "
    },
    {
        "content": "* Vuzix Corp - over last two years  Vuzix's collaboration work with Intel has not generated material revenue to company - SEC filing",
        "date": "11162016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Vuzix gets letter from Intel "
    },
    {
        "content": "* Intel announces $250 million investment for autonomous driving",
        "date": "11152016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel announces $250 mln investment for autonomous driving "
    },
    {
        "content": "* Acquiring VR startup VOKE for immersive sports; financial terms are not being disclosed  Source text - http://intel.ly/2ek4L65 Further company coverage:",
        "date": "11032016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel says acquiring VR startup Voke; financial terms not disclosed "
    },
    {
        "content": "* Firm plans $11.6 billion in semiconductor capex this year   (Updates with comments from Samsung  background)",
        "date": "11012016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Samsung Elec to invest more than $1 bln in U.S. chip production "
    },
    {
        "content": "* Visa and Intel collaborate to drive better payment security for connected devices",
        "date": "10242016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Visa  Intel to work on payment security for connected devices "
    },
    {
        "content": "LUXEMBOURG/BRUSSELS Intel's  fight against a record 1.06 billion euro  ($1.16 billion) EU antitrust fine received a boost on Thursday when a top Europe court adviser questioned whether the U.S. chipmaker's actions had really harmed competition.",
        "date": "10202016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "EU court adviser backs Intel fight against record EU fine "
    },
    {
        "content": "LUXEMBOURG/BRUSSELS  Oct 20 Intel's  fight against a record 1.06 billion euro  ($1.16 billion) EU antitrust fine received a boost on Thursday when a top Europe court adviser questioned whether the U.S. chipmaker's actions had really harmed competition.",
        "date": "10202016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-EU court adviser backs Intel fight against record EU fine "
    },
    {
        "content": "* Saudi Arabia sets record with mammoth $17.5 billion bond issue   (Updates to U.S. market close)",
        "date": "10192016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "GLOBAL MARKETS-U.S. oil rises after surprise inventory drop; stocks up "
    },
    {
        "content": "LUXEMBOURG  Oct 20 A lower court should review U.S. chipmaker Intel's challenge against a record 1.06-billion-euro ($1.16 billion) fine levied by EU antitrust regulators seven years ago  an adviser to Europe's top court said on Thursday.",
        "date": "10202016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "EU court adviser backs Intel appeal against EU fine "
    },
    {
        "content": "* U.S. crude touches 15-month highs on surprise stockpile drop",
        "date": "10192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Oil  earnings lift Wall St but Intel drags "
    },
    {
        "content": "* Bank  energy stocks lead Wall St higher; Intel slumps   (Updates prices  adds comment)",
        "date": "10192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "GLOBAL MARKETS-Oil rises after surprise drop in U.S. inventories; stocks tick up "
    },
    {
        "content": "* Indexes up: Dow 0.39 pct  S&P 0.33 pct  Nasdaq 0.11 pct   (Adds Beige Book  changes byline)",
        "date": "10192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St climbs on oil  earnings; Intel curbs advance "
    },
    {
        "content": "* Indexes up: Dow 0.41 pct  S&P 0.29 pct  Nasdaq 0.04 pct   (Updates to early afternoon)",
        "date": "10192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St up on oil  upbeat earnings; Intel limits gains "
    },
    {
        "content": "* Energy stocks lead Wall St higher  Intel slumps   (Updates with U.S. market trading  changes throughout)",
        "date": "10192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "GLOBAL MARKETS-Oil jumps after U.S. data; stocks edge up "
    },
    {
        "content": "* Dow up 0.15 pct  S&P up 0.01 pct  Nasdaq down 0.15 pct   (Updates to open)",
        "date": "10192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St flat as oil gains offset Intel's drag "
    },
    {
        "content": "Oct 19 U.S. stocks opened little changed on Wednesday  a day after the S&P 500 index posted its best advance in the month  but Intel had the Nasdaq slightly in the red.",
        "date": "10192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS SNAPSHOT-Wall St opens little changed; Intel weighs "
    },
    {
        "content": "* Sees Q4 revenue at 1.7-1.8 bln euros   (Adds details from earnings  CEO comment)",
        "date": "10192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-ASML Q3 results miss on profit  but sales up on orders of newest machines "
    },
    {
        "content": "PARIS  Oct 19 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "10192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "French and Benelux stocks-Factors to watch on Oct 19 "
    },
    {
        "content": "Intel Corp  reported better-than-expected quarterly earnings and revenue  boosted by improving PC demand and growth in its data center and cloud businesses  but its revenue forecast for the current quarter disappointed Wall Street.",
        "date": "10182016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel's results beat estimates; forecast disappoints "
    },
    {
        "content": "* Q3 adj. EPS 80 cents vs est. 73 cents   (Adds details from call  analyst comment; Updates shares)",
        "date": "10182016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Intel's results beat estimates; forecast disappoints "
    },
    {
        "content": "* Intel reports Q3 rev of $15.8 bln  up 9 pct year-over-year; operating profit of $4.5 billion",
        "date": "10182016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel Q3 NON-GAAP EPS of $0.80 "
    },
    {
        "content": "Oct 18 Intel Corp reported a 9.1 percent rise in quarterly revenue  helped by improving PC demand and growth in its data center and cloud businesses.",
        "date": "10182016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "CORRECTED-Intel's quarterly revenue rises 9.1 percent "
    },
    {
        "content": "* Revenue is expected to be $15.7 billion  plus or minus $500 million in the fourth quarter",
        "date": "10182016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel sees Q4 revenue of $15.7 bln  plus or minus $500 mln "
    },
    {
        "content": "NEW YORK  Sept 26 U.S.-based financial innovation start-up R3 announced on Monday that it and eight banks  including HSBC and State Street  have successfully tested a blockchain platform powered by Intel Corp technology for bond transactions.",
        "date": "09262016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "R3  8 banks successfully test Intel blockchain platform for bond trading "
    },
    {
        "content": "Intel Corp named Robert Swan chief financial officer  replacing company veteran Stacy Smith who is moving to a new role leading sales  manufacturing and operations.",
        "date": "09192016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel hires Robert Swan from General Atlantic as CFO "
    },
    {
        "content": "Sept 19 Intel Corp named Robert Swan chief financial officer  replacing company veteran Stacy Smith who is moving to a new role leading sales  manufacturing and operations.",
        "date": "09192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Intel hires Robert Swan from General Atlantic as CFO "
    },
    {
        "content": "* Intel Corp says in connection with his appointment  Robert Swan will receive a hiring bonus of $5.5 million",
        "date": "09192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel Corp says Robert Swan will receive a hiring bonus "
    },
    {
        "content": "Sept 19 Intel Corp named Robert Swan chief financial officer  replacing Stacy Smith who will move to a new role leading sales  manufacturing and operations.",
        "date": "09192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel names Robert Swan CFO "
    },
    {
        "content": "* Intel appoints Bob Swan executive vice president and chief financial officer",
        "date": "09192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel appoints Bob Swan executive vice president and chief financial officer "
    },
    {
        "content": "* On September 14  2016  board appointed Tsu-Jae King Liu to audit committee of board  effective immediately  Source text - http://bit.ly/2cMnybx Further company coverage:",
        "date": "09152016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel appoints Tsu-Jae King Liu to audit committee of board "
    },
    {
        "content": "Sept 15 Teva Pharmaceutical Industries Ltd  said on Thursday it was collaborating with Intel Corp  to develop a wearable technology platform to track the progression of disease in patients with Huntington's  a fatal degenerative disorder.",
        "date": "09152016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Teva  Intel to develop wearable tech for Huntington's disease "
    },
    {
        "content": "* Intel Corp says  board of directors has declared a quarterly dividend of 26 cents per share  Source text for Eikon:  Further company coverage:",
        "date": "09152016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel says  board has declared a quarterly dividend of 26 cents per share "
    },
    {
        "content": "JERUSALEM  Sept 15 Teva Pharmaceutical Industries is collaborating with Intel Corp  to develop a wearable device and machine learning platform for Huntington disease patients  Teva said on Thursday.",
        "date": "09152016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Teva Pharm  Intel to study Huntington disease progression "
    },
    {
        "content": "Sept 15 Teva Pharmaceutical Ltd Says It Will Deploy The Technology Platform In A Sub",
        "date": "09152016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Teva collaborates with Intel to develop a device for use in huntington disease "
    },
    {
        "content": "* Says expects third-quarter revenue to be $15.6 billion  plus or minus $300 million",
        "date": "09162016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel raises third-quarter revenue expectations "
    },
    {
        "content": "Intel Corp  said it would spin out its cyber security division  formerly known as McAfee  and sell a majority stake in it to investment firm TPG for $3.1 billion in cash.",
        "date": "09082016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel to spin out security unit  sell stake in business to TPG "
    },
    {
        "content": "Sept 7 Intel Corp said it would spin out its cyber security division  formerly known as McAfee  and sell a majority stake in it to investment firm TPG for $3.1 billion in cash.",
        "date": "09082016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Intel to spin out security unit  sell stake in business to TPG "
    },
    {
        "content": "Sept 7 Intel Corp said it would spin out its cybersecurity division and sell a majority stake in it to investment firm TPG for $3.1 billion in cash.",
        "date": "09072016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel to spin out cybersecurity unit  sell stake in business to TPG "
    },
    {
        "content": "* Intel and TPG to collaborate to establish McAfee as leading independent cybersecurity company valued at $4.2 billion",
        "date": "09072016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel and TPG to collaborate to establish McAfee as a cybersecurity company valued at $4.2 bln "
    },
    {
        "content": "* Intel nearing deal to sell McAfee security unit to TPG  which could value unit at $4.2b including debt - CNBC  citing DJ    Source text: http://bit.ly/2caV7Ba",
        "date": "09072016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel nearing deal to sell McAfee security unit to TPG  which could value unit at $4.2 bln - CNBC "
    },
    {
        "content": "* TPG held preliminary discussions with Intel to buy Mcafee in deal that could value Mcafee at as much as $3 billion- Bloomberg  citing sources  Source text : http://bloom.bg/2bFBAFL Further company coverage:",
        "date": "09012016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-TPG held preliminary discussions with Intel to buy Mcafee - Bloomberg "
    },
    {
        "content": "AMSTERDAM  Aug 17 Shares in Dutch semiconductor equipment supplier ASML Holding fell after remarks by an Intel official suggested the company may hold off on using ASML's newest tools in commercial production.",
        "date": "08172016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "ASML shares fall on fears Intel could delay use of its newest tool "
    },
    {
        "content": "Aug 9 Intel Corp said on Tuesday it would acquire startup Nervana Systems as the world's largest chipmaker bolsters its artificial intelligence capabilities.",
        "date": "08092016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel to buy artificial intelligence firm Nervana Systems "
    },
    {
        "content": "* Signed definitive agreement to acquire Nervana Systems to add to Intel's artificial intelligence portfolio  Source text : http://intel.ly/2bhcVZR Further company coverage:",
        "date": "08092016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel says to buy Nervana Systems "
    },
    {
        "content": "* U.S. Treasury yields track Wall Street weakness     * Arrests in Brazil raise risk aversion   (Recasts lead  adds comments  updates prices)     By Gertrude Chavez-Dreyfuss     NEW YORK  July 21 U.S. Treasury long-dated debt yields fell from multi-week highs on Thursday  tracking declines in U.S. equities  as risk aversion crept back into the market with earnings disappointment at U.S. tech company Intel and news of arrests over an alleged terror plot in Brazil.     U.S. 10-year not",
        "date": "07212016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "TREASURIES-Yields slide from multi-week highs as U.S. stocks decline "
    },
    {
        "content": "* Indexes fall: Dow 0.42 pct  S&P 0.36 Pct  Nasdaq 0.31 pct   (Updates with close of U.S. market)",
        "date": "07212016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Intel  transports sap Wall Street's strength "
    },
    {
        "content": "Intel Corp  on Wednesday reported slower revenue growth at its data center business  which makes semiconductors used in high-end servers  overshadowing a better-than-expected quarterly profit.",
        "date": "07202016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel's slowing data center growth overshadows strong profit "
    },
    {
        "content": "NEW YORK  July 21 Wall Street cooled off on Thursday as disappointing quarterly reports from tech stalwart Intel and from transportation companies stalled momentum in a U.S. corporate earnings season that has been better than feared.",
        "date": "07212016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS SNAPSHOT-Wall St falls as Intel  transport earnings weigh "
    },
    {
        "content": "July 20 Intel Corp on Wednesday reported slower revenue growth at its data center business  which makes semiconductors used in high-end servers  overshadowing a better-than-expected quarterly profit.",
        "date": "07202016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Intel's slowing data center growth overshadows strong profit "
    },
    {
        "content": "* Indexes off: Dow 0.57 pct  S&P 0.46 Pct  Nasdaq 0.39 pct   (Updates to late afternoon)",
        "date": "07212016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St cools as Intel  transport results disappoint "
    },
    {
        "content": "* Quarterly reported non-GAAP operating income of $3.2 billion  net income of $2.9 billion and EPS of 59 cents",
        "date": "07202016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel reports Q2 revenue of $13.5 billion "
    },
    {
        "content": "* Indexes off: Dow 0.43 pct  S&P 0.30 Pct  Nasdaq 0.20 pct   (Updates to early afternoon)",
        "date": "07212016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St falls on disappointing reports from Intel  others "
    },
    {
        "content": "July 20 Intel Corp reported a 2.6 percent rise in quarterly revenue  boosted by strong sales of its microchips that power data centers and Internet-connected devices.",
        "date": "07202016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel's quarterly revenue rises 2.6 percent "
    },
    {
        "content": "* Dr. Tsu-Jae King Liu elected to Intel board of directors  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07122016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Tsu-Jae King Liu elected to Intel board of directors "
    },
    {
        "content": "* Declared a quarterly dividend of 26 cents per share ($1.04 per share on an annual basis) on company's common stock  Source text for Eikon:  Further company coverage:",
        "date": "07122016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel Corp declares quarterly div of 26 cents per share "
    },
    {
        "content": "* Autonomous vehicle platform open to others   (Adds comments from Mobileye chairman and Intel CEO)",
        "date": "07012016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "UPDATE 2-BMW to develop driverless car technology with Intel  Mobileye "
    },
    {
        "content": "* BMW Group  Intel and Mobileye team up to bring fully autonomous driving to streets by 2021  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07012016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Mobileye NV  BMW Group  Intel team up to bring fully autonomous driving by 2021 "
    },
    {
        "content": "FRANKFURT  June 30 BMW is close to unveiling a development partnership for autonomous cars with Israeli collision detection software maker Mobileye and U.S. chip maker Intel  a source familiar with the matter said on Thursday.",
        "date": "06302016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BMW  Intel  Mobileye team up to develop autonomous cars -source "
    },
    {
        "content": "FRANKFURT  July 1 BMW is teaming up with Intel and Mobileye to develop new technology for the auto industry that could put self-driving cars on the road by around 2021.",
        "date": "07012016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BMW to develop driverless car technology with Intel  Mobileye "
    },
    {
        "content": "* Intel Corp is working with Mobileye NV to develop self-driving car technology for BMW AG- Bloomberg  citing sources    Source text: (http://bloom.bg/293UpGe)   (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "06292016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel is working with Mobileye to develop self-driving car technology for BMW AG- Bloomberg "
    },
    {
        "content": "NEW YORK Chipmaker Intel Corp  is considering the sale of its cyber security business  the Financial Times reported on Sunday.",
        "date": "06262016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel considers sale of cyber security business: FT "
    },
    {
        "content": "NEW YORK  June 26 Chipmaker Intel Corp  is considering the sale of its cyber security business  the Financial Times reported on Sunday.",
        "date": "06262016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel considers sale of cyber security business -FT "
    },
    {
        "content": "Apple Inc's next iPhone will use modems chips from Intel Corp  replacing those made by Qualcomm Inc in some versions of the new smartphone  Bloomberg reported  citing people familiar with the matter.",
        "date": "06102016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel gets mobile chip contract from Apple - Bbg "
    },
    {
        "content": "* Indexes down: Dow 0.9 pct  S&P 1.2 pct  Nasdaq 1.6 pct   (Updates to late afternoon)",
        "date": "06102016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St falls with oil  worries about global economy "
    },
    {
        "content": "* Indexes down: Dow 0.56 pct  S&P 0.79 pct  Nasdaq 1.02 pct   (Updates to early afternoon)",
        "date": "06102016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St down sharply on oil drop  global growth worries "
    },
    {
        "content": "June 10 Apple Inc's next iPhone will use modems chips from Intel Corp  replacing those made by Qualcomm Inc in some versions of the new smartphone  Bloomberg reported  citing people familiar with the matter.",
        "date": "06102016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Intel gets mobile chip contract from Apple - Bbg "
    },
    {
        "content": "June 10 Apple Inc's next iPhone will use modems chips from Intel Corp  replacing those made by Qualcomm Inc in some versions of the new smartphone  Bloomberg reported  citing people familiar with the matter.",
        "date": "06102016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel gets mobile chip contract from Apple - Bloomberg "
    },
    {
        "content": "* Intel said to get chip order from Apple - StreetInsider  citing Bloomberg  Source text - (http://bit.ly/1U50vrh) Further company coverage:    (Bengaluru Newsroom)",
        "date": "06102016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel said to get chip order from Apple - StreetInsider  citing Bloomberg "
    },
    {
        "content": "* Taiwan Semiconductor Manufacturing Co will be first to produce 7-nanometer chips  according to co's senior executive - Nikkei",
        "date": "05262016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-TSMC expects to beat Intel in server chip technology in 2017 - Nikkei "
    },
    {
        "content": "* Intel acquires Computer Vision for IoT  automotive; signs agreement to acquire Itseez Inc  an expert in Computer Vision algorithms",
        "date": "05262016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel to acquire Itseez Inc "
    },
    {
        "content": "NEW YORK  May 26 Biotechnology company Regeneron Pharmaceuticals Inc on Thursday became the title sponsor of the most prestigious U.S. science competition for high school students  taking the baton from chipmaker Intel Corp .",
        "date": "05262016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Biotech Regeneron replaces Intel as sponsor of Science Talent Search "
    },
    {
        "content": "NEW YORK  May 25 Biotechnology company Regeneron Pharmaceuticals Inc on Thursday became the title sponsor of the most prestigious U.S. science competition for high school students  taking the baton from chipmaker Intel Corp .",
        "date": "05262016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "RPT-Biotech Regeneron replaces Intel as sponsor of Science Talent Search "
    },
    {
        "content": "May 16 Warren Buffett's Berkshire Hathaway Inc  revealed a more than $1 billion stake in Apple Inc  in a rare foray into the technology sector  which Buffett has largely shunned apart from a poorly performing investment in IBM.",
        "date": "05172016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 6-Warren Buffett's Berkshire takes $1 bln bite of Apple "
    },
    {
        "content": "* Issued $500 million aggregate principal amount of 1.700% senior notes due 2021   $1.00 billion aggregate principal amount of 2.600% senior notes due 2026",
        "date": "05192016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel issues $2.75 billion aggregate amount of senior notes "
    },
    {
        "content": "* Taiwan Semiconductor Manufacturing Co  Arm holding team up to fight Intel in data center chips- Nikkei",
        "date": "05182016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Taiwan Semiconductor Manufacturing Co  ARM Holding team up to fight Intel in data center chips- Nikkei "
    },
    {
        "content": "* Diane Bryant has been promoted to executive vice president  Source text for Eikon:  Further company coverage:",
        "date": "04282016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel says Diane Bryant promoted to executive vice president "
    },
    {
        "content": "SAN FRANCISCO  April 21 Microsoft Corp  and Intel Corp's financial results this week brought into sharp relief the onetime PC partners' attempts to gear up for cloud computing  where Microsoft is soaring and Intel has not quite taken off.",
        "date": "04212016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "As Microsoft soars on cloud  PC partner Intel seeks lift off "
    },
    {
        "content": "SAN FRANCISCO Financial results from Microsoft Corp and Intel Corp this week brought into sharp relief the challenges the onetime PC partners face as they shift more of their emphasis to cloud computing.",
        "date": "04222016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel and Microsoft face different challenges in shifts to cloud "
    },
    {
        "content": "SAN FRANCISCO  April 21 Financial results from Microsoft Corp and Intel Corp this week brought into sharp relief the challenges the onetime PC partners face as they shift more of their emphasis to cloud computing.",
        "date": "04222016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Intel and Microsoft face different challenges in shifts to cloud "
    },
    {
        "content": "* Intel CEO Brian Krzanich on CNBC - Will look for acquisition in data centre business    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "04202016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel CEO Krzanich on CNBC - Will look for acquisition in data centre business "
    },
    {
        "content": "* Will look for acquisition in data centre business    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "04202016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel CEO Brian Krzanich on CNBC - Will look for acquisition in data centre business "
    },
    {
        "content": "Intel Corp  said on Tuesday it would cut up to 12 000 jobs globally  or 11 percent of its workforce  as it refocuses its business towards making microchips that power data centers and Internet connected devices and away from the declining personal computer industry it helped found.",
        "date": "04202016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel to cut up to 12 000 jobs as PC industry swoons "
    },
    {
        "content": "* Sees FY non-gaap gross margin 62 percent  +/- a couple percent points",
        "date": "04192016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel Corp reports Q1 gaap EPS of $0.42 "
    },
    {
        "content": "April 19 Intel Corp said on Tuesday it would cut up to 12 000 jobs globally  or 11 percent of its workforce  as it refocuses its business towards making microchips that power data centers and Internet connected devices and away from the declining personal computer industry it helped found.",
        "date": "04202016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 4-Intel to cut up to 12 000 jobs as PC industry swoons "
    },
    {
        "content": "* Intel reports GAAP revenue of $13.7 billion; Non-GAAP revenue of $13.8 billion",
        "date": "04192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel Q1 GAAP revenue of $13.7 bln  Non-GAAP revenue of $13.8 bln "
    },
    {
        "content": "NEW YORK Intel Corp's \t shift to higher-growth businesses such as server chips and embedded chips for cars could drive a 25 increase in its shares in a year  according to a report on Sunday in the financial publication Barron's.",
        "date": "04172016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel shares could rise 25 percent in next year: Barron's "
    },
    {
        "content": "* Intel announces restructuring initiative to accelerate transformation",
        "date": "04192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel announces reduction of up to 12 000 positions globally "
    },
    {
        "content": "NEW YORK  April 17 Intel Corp's      shift to higher-growth businesses such as server chips and embedded chips for cars could drive a 25 increase in its shares in a year  according to a report on Sunday in the financial publication Barron's.",
        "date": "04172016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel shares could rise 25 pct in next year - Barron's "
    },
    {
        "content": "April 19 Intel Corp said it would cut 12 000 jobs globally  or 11 percent of its workforce.",
        "date": "04192016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel says to cut 12 000 jobs globally "
    },
    {
        "content": "Intel Corp  is planning to cut thousands of jobs this spring  including reducing headcount in some business units by double-digit percentages  news website Oregonlive said  citing sources inside the company familiar with the plan.",
        "date": "04152016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel plans to cut thousands of jobs: report "
    },
    {
        "content": "April 15 Intel Corp is planning to cut thousands of jobs this spring  including reducing headcount in some business units by double-digit percentages  news website Oregonlive said  citing sources inside the company familiar with the plan.",
        "date": "04152016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel plans to cut thousands of jobs - report "
    },
    {
        "content": "NEW YORK  April 13 Verizon Communications Inc  is the clear favorite in the upcoming bidding for Yahoo Inc's core Internet business  according to Wall Street analysts  in large part because the telecommunications company's efforts to become a force in Internet content have gone relatively well under the leadership of AOL Inc Chief Executive Tim Armstrong.",
        "date": "04132016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Verizon bets on Armstrong  M&A savvy in Yahoo bid "
    },
    {
        "content": "* Says Doug Davis  SVP and general manager of Internet of Things unit  will retire from Intel at the end of 2016",
        "date": "04042016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Intel's IoT unit  Client Computing Group SVPs to leave co "
    },
    {
        "content": "* Chief executive officer brian m. Krzanich total 2015 compensation $14.6 million versus $11.2 million in 2014",
        "date": "04042016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Intel CEO Brian Krzanich's 2015 compensation was $14.6 mln vs $11.2 mln in 2014 "
    },
    {
        "content": "SAN FRANCISCO Andy Grove  the Silicon Valley elder statesman who made Intel into the world's top chipmaker and helped usher in the personal computer age  died on Tuesday at age 79  Intel said.",
        "date": "03222016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel mastermind  Silicon Valley statesman Andy Grove dead at 79 "
    },
    {
        "content": "SAN FRANCISCO  March 21 Andy Grove  the Silicon Valley elder statesman who made Intel into the world's top chipmaker and helped usher in the personal computer age  died on Tuesday at age 79  Intel said.",
        "date": "03222016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Intel mastermind  Silicon Valley statesman Andy Grove dead at 79 "
    },
    {
        "content": "March 21 Former Intel Chief Executive Officer and Chairman Andrew Grove died on Monday at age 79  the technology company said in a statement.     (Reporting by Sandra Maler in Washington; Editing by Peter Cooney)",
        "date": "03222016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Former Intel CEO Chairman Andrew Grove dies at 79 -Intel "
    },
    {
        "content": "WASHINGTON Three of the United States' brightest high school scientists  one boy and two girls  emerged as winners on Tuesday in the $1 million Intel Talent Search  among the top U.S. competitions for young innovators.",
        "date": "03162016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "One boy  two girls win Intel U.S. Talent Search "
    },
    {
        "content": "WASHINGTON  March 15 Three of the United States' brightest high school scientists will emerge winners on Tuesday in the $1 million Intel Talent Search  among the top U.S. competitions for young innovators.",
        "date": "03152016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "U.S. high school winners in Intel Talent Search to be announced "
    },
    {
        "content": "Intel Corp is looking to sell part of its venture capital portfolio  assets that could be worth as much as $1 billion  Bloomberg reported.",
        "date": "03112016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel plans to sell part of venture capital unit: Bloomberg "
    },
    {
        "content": "March 11 Intel Corp is looking to sell part of its venture capital portfolio  assets that could be worth as much as $1 billion  Bloomberg reported.",
        "date": "03112016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel plans to sell part of venture capital unit - Bloomberg "
    },
    {
        "content": "* Restrictions respond to alleged violations of Iran sanctions",
        "date": "03082016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 6-U.S. curbs China's ZTE exports over Iran business allegations "
    },
    {
        "content": "Source link: http://www.wsj.com/articles/googles-parent-could-be-big-winner-in-intel-tax-dispute-1456698129",
        "date": "02282016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "MEDIA-Google's parent could be big winner in Intel tax dispute-WSJ "
    },
    {
        "content": "NEW YORK  Feb 22 Wireless provider AT&T Inc said on Monday it will partner with chipmaker Intel Corp to test the functionality of drones on its high-speed LTE wireless network.",
        "date": "02222016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "AT&T and Intel team up to test drone technology "
    },
    {
        "content": "SYDNEY  Feb 16 (IFR) - The Coca-Cola Company  (Aa3/AA/A+) looks set to provide the first real test of the year for the corporate Kangaroo market  having mandated Deutsche Bank to arrange investor meetings from March 7 for a potential debut trade.",
        "date": "02162016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Coca-Cola hopes to refresh corporate Kangaroo market "
    },
    {
        "content": "Intel Corp's  strong quarterly profit beat was overshadowed by concerns about slowing revenue growth in its highly profitable data center business  sending its shares down about 5.6 percent in after-market trading.",
        "date": "01142016",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Slowing data center revenue growth dims Intel's profit beat "
    },
    {
        "content": "* Shares fall 5.6 pct after market   (Adds Q1 forecast  executive comment)",
        "date": "01142016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Slowing data center revenue growth dims Intel's profit beat "
    },
    {
        "content": "Jan 14 Intel Corp reported a marginal rise in quarterly revenue  reversing two quarters of declines  as growth in its data center business more than offset weak sales to PC makers.",
        "date": "01142016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel revenue rises marginally "
    },
    {
        "content": "* Indexes down: Dow 2.39 pct  S&P 2.16 pct  Nasdaq 2.74 pct   (Updates with market close  adds comment)",
        "date": "01152016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St hemorrhages as oil falls and China fears deepen "
    },
    {
        "content": "* Indexes down: Dow 2.74 pct  S&P 2.72 pct  Nasdaq 3.45 pct   (Adds details  comments; updates prices)",
        "date": "01152016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St hammered; S&P 500 hits lowest since Oct 2014 "
    },
    {
        "content": "* Indexes down: Dow 2.55 pct  S&P 2.57 pct  Nasdaq 3.34 pct   (Adds details  updates prices)",
        "date": "01152016",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall Street slumps; S&P hits lowest since Aug. 24 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 23 (Fitch) Fitch Ratings has assigned an 'A+' rating to Intel  Corp.'s (Intel) 4-year and 7-year senior notes issuance in Australia. Fitch  currently rates Intel's long- and short-term Issuer Default Ratings 'A+/F1'. The  Rating Outlook is Stable. Fitch rates $22.2 billion of debt  prior to the  issuance. A full list of current ratings follows at the end of this release.  With the AUD senior notes sale  Intel will comp",
        "date": "11232015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Fitch Rates Intel's AUD4B Kangaroo Bonds Offering 'A+' "
    },
    {
        "content": "SYDNEY  Nov 23 (IFR) - Intel Corporation  rated A1/A+ (Moody's/S&P)  has announced its debut offering of debut Kangaroo bonds through joint lead managers Deutsche Bank and Westpac. The bonds are expected to price tomorrow.",
        "date": "11232015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel markets debut Kangaroo bond offering "
    },
    {
        "content": "WASHINGTON  Nov 19 Intel Corp could relocate its drone research and development operations overseas if the federal government adopts an \"overly prescriptive\" approach to unmanned aerial systems technology  an Intel executive told U.S. lawmakers on Thursday.",
        "date": "11192015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel warns that U.S. regulation could drive drone R&D overseas "
    },
    {
        "content": "SYDNEY  Nov 17 (IFR) - Intel Corporation  rated A1/A+ (Moody's/S&P)  has sparked plenty of excitement in Australia ahead of tomorrow's fixed-income investor call for a potential debut offering of Kangaroo bonds.",
        "date": "11172015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel to follow Apple in crucial test of Kangaroo market "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)  Cisco Systems Inc's first-quarter revenue and profit are set to beat the average analyst estimates  according to Thomson Reuters StarMine. The network equipment maker is expected to benefit from a recovery in sales of its switches and routers. Inve",
        "date": "11112015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "What to Watch in the Day Ahead - Thursday  Nov 12 "
    },
    {
        "content": "Raytheon Co's  Websense unit is buying Intel Corp's  Finnish cybersecurity arm  Stonesoft  according to news media reports.",
        "date": "10292015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Raytheon to buy Intel’s Stonesoft: report "
    },
    {
        "content": "Oct 29 Raytheon Co's Websense unit is buying Intel Corp's Finnish cybersecurity arm  Stonesoft  according to news media reports.",
        "date": "10292015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Raytheon to buy Intel's Stonesoft: report "
    },
    {
        "content": "* Announced that it was advancing collaboration with Intel Corp in creating for retailers a secure connectivity path from the cash register to the payment terminal  end-to-end",
        "date": "10272015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Ingenico Group announced collaboration with Intel "
    },
    {
        "content": "Intel Corp said it may invest up to $5.5 billion in manufacturing semiconductors in China  stepping up efforts to improve ties with Beijing as it seeks new revenue streams while demand for its core computer processing chips falters.",
        "date": "10212015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel says may invest up to $5.5 billion in China memory chip plant "
    },
    {
        "content": "* SK Hynix shares end 5.7 pct lower on earnings worries   (Adds industry background  analyst comment)",
        "date": "10212015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Intel says may invest up to $5.5 bln in China memory chip plant "
    },
    {
        "content": "Oct 21 Intel Corp said it may invest up to $5.5 billion in the coming years to expand its manufacturing capacity for non-volatile memory at its Dalian facility in China.",
        "date": "10212015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel may invest up to $5.5 bln in China facility "
    },
    {
        "content": "BRUSSELS  Oct 15 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10152015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "EU mergers and takeovers (Oct 15) "
    },
    {
        "content": "* Says continuing inventory adjustments to weigh on Q4 revenue",
        "date": "10152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Chipmaker TSMC cuts 2015 capex by over 20 pct on weak global demand "
    },
    {
        "content": "Oct 14 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "10142015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Oct 14 Intel Corp's move to cut growth forecast for its highly profitable business that makes chips used in data centers may have disappointed investors  but analysts see the unit rebounding next year as more users take to cloud services.",
        "date": "10142015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel's data center business seen rebounding in 2016 "
    },
    {
        "content": "Intel Corp  cut revenue growth forecast for its highly profitable business of making chips for data centers as businesses reduce spending due to weak macroeconomic growth. | Video ",
        "date": "10132015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel says data center business to grow less than expected "
    },
    {
        "content": "* Sees Q4 revenue of $14.8 bln  plus or minus $500 mln   (Adds details  analyst comment)",
        "date": "10132015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Intel says data center business to grow less than expected "
    },
    {
        "content": "BRUSSELS  Oct 14 World No. 1 chipmaker Intel Corp gained unconditional EU antitrust approval on Wednesday for its $16.7 billion bid for Altera Corp  its largest ever acquisition.",
        "date": "10142015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "European Commission clears Intel's $16.7 billion bid for Altera "
    },
    {
        "content": "Oct 13 Intel Corp reported a 6.3 percent fall in quarterly profit on Tuesday  weighed down by continued weak demand for chips used in personal computers.",
        "date": "10132015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel profit falls 6.3 pct "
    },
    {
        "content": "World No. 1 chipmaker Intel Corp  will be given the go-ahead from the EU for its $16.7 billion bid for Altera Corp   its largest ever deal  two people familiar with the matter said on Friday.",
        "date": "10092015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel to secure EU's okay for $16.7 billion Altera deal: sources "
    },
    {
        "content": "BRUSSELS  Oct 8 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10082015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "EU mergers and takeovers (Oct 8) "
    },
    {
        "content": "World No. 1 chipmaker Intel Corp will be given the go-ahead from the EU for its $16.7 billion bid for Altera Corp  its largest ever deal  two people familiar with the matter said on Friday.",
        "date": "10092015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel to secure EU's okay for $16.7 bln Altera deal - sources "
    },
    {
        "content": "BRUSSELS  Oct 9 World No. 1 chipmaker Intel Corp  will be given the go-ahead from the EU for its $16.7 billion bid for Altera Corp  its largest ever deal  two people familiar with the matter said on Friday.",
        "date": "10092015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Intel to secure EU's okay for $16.7 bln Altera deal - sources "
    },
    {
        "content": "BRUSSELS  Oct 9 European Union antitrust regulators are set to approve U.S. chipmaker Intel Corp's  $16.7 billion offer for Altera Corp without requiring concessions  two people familiar with the matter said on Friday.",
        "date": "10092015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "EU to clear unconditionally $16.7 bln Intel  Altera deal - sources "
    },
    {
        "content": "Sept 23 U.S. stocks were little changed in light trading on Wednesday morning as a rebound in commodity prices helped soften the impact of weak factory data out of China and the United States.",
        "date": "09232015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "CORRECTED-US STOCKS-Wall St flat as commodities' rise offsets weak factory data "
    },
    {
        "content": "BRUSSELS European Union antitrust regulators will decide by Oct. 14 whether to clear U.S. chipmaker Intel's $16.7 billion bid for Altera Corp  its largest ever deal.",
        "date": "09102015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "EU regulators to rule on $16.7 billion Intel  Altera deal by October 14 "
    },
    {
        "content": "BRUSSELS  Sept 10 European Union antitrust regulators will decide by Oct. 14 whether to clear U.S. chipmaker Intel's $16.7 billion bid for Altera Corp   its largest ever deal.",
        "date": "09102015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "EU regulators to rule on $16.7 bln Intel  Altera deal by Oct. 14 "
    },
    {
        "content": "Aug 12 Royal Bank of Canada has hired a new semiconductor investment banker  John McClure  who joins from Intel Corp  according to an internal memo and the banker's LinkedIn page.",
        "date": "08132015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "MOVES-RBC hires new U.S. semiconductor banker from industry "
    },
    {
        "content": "* Shares rise more than 9 pct after-market   (Adds analyst comment  details from conference call  updates shares)",
        "date": "08062015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Nvidia's gaming chips drive surprise rise in revenue "
    },
    {
        "content": "NEW YORK A federal jury has cleared Intel's McAfee Inc in a $13 million suit accusing the company of infringing a patent with its antivirus software programs  finding that the patent owned by TVIIM LLC was invalid.",
        "date": "07242015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel invalidates patent  tells Congress to get reforms done "
    },
    {
        "content": "Wall Street says Intel Corp  is the best suitor for Qualcomm Inc's  chip unit  if the maker of Snapdragon mobile processors decides to break itself up.",
        "date": "07242015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Qualcomm's potential break-up could lead to courtship with Intel "
    },
    {
        "content": "(Rewrites throughout  adds more details)     By Paul Kilby and Natalie Harrison     NEW YORK  July 22 (IFR) - Intel is on track to price a US$7bn bond on Wednesday to help finance its acquisition of chipmaker Altera after attracting more than US$20bn in investor demand.     The deal  split across four tranches ranging in maturities from five to 30 years  had been long-expected by market participants. Initially marketed in June to European investors  the company held off announcing the deal un",
        "date": "07222015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "UPDATE 2-Intel's US$7bn four-parter gets US$20bn in demand "
    },
    {
        "content": "LONDON Top European technology stocks shed nearly $6 billion of market value on Wednesday  with suppliers for Apple the top fallers after the tech giant's revenue forecasts fell short of expectations.",
        "date": "07222015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "$5.7 billion wiped off European tech shares after Apple outlook disappoints "
    },
    {
        "content": "Wall Street says Intel Corp is the best suitor for Qualcomm Inc's chip unit  if the maker of Snapdragon mobile processors decides to break itself up.",
        "date": "07232015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Qualcomm's potential break-up could lead to courtship with Intel "
    },
    {
        "content": "LONDON  July 22 Top European technology stocks shed nearly $6 billion of market value on Wednesday  with suppliers for Apple the top fallers after the tech giant's revenue forecasts fell short of expectations.",
        "date": "07222015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "$5.7 bln wiped off European tech shares after Apple outlook disappoints "
    },
    {
        "content": "Wall Street ended stronger on Thursday  with the Nasdaq up more than 1 percent at a record high after earnings reports from eBay  and Netflix  boosted optimism. | Video ",
        "date": "07162015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Wall St. rises; eBay  Netflix push Nasdaq to record high "
    },
    {
        "content": "Intel Corp's move to delay the launch of its next generation chip technology to 2017 may see the company lose ground to rivals Taiwan Semiconductor Manufacturing Co  and Samsung Electronics Co Ltd.",
        "date": "07162015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel's cost cuts could give rivals higher ground: analysts "
    },
    {
        "content": "Intel Corp  reported better-than-expected quarterly results on Wednesday as growth in its data centers and Internet-of-Things businesses helped offset weak demand for personal computers that use the company's chips.",
        "date": "07152015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel serves up revenue  profit beat as data center business grows "
    },
    {
        "content": "* Futures up: Dow 44 pts  S&P 8 pts  Nasdaq 18 pts   (Adds details  comment  updates prices)",
        "date": "07162015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St set to open up on strong quarterly reports "
    },
    {
        "content": "* Shares rise as much as 9.2 pct after market   (Adds analysts comments  details; updates shares)",
        "date": "07152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Intel serves up revenue  profit beat as data center business grows "
    },
    {
        "content": "July 16 U.S. stock index futures rose on Thursday as investors welcomed Greek parliamentary approval of a bailout plan and on strong results from Netflix and Intel overnight.",
        "date": "07162015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Futures rise after Greek vote; Intel  Netflix results "
    },
    {
        "content": "* Indexes off: Dow 0.02 pct  S&P 0.07 pct  Nasdaq 0.12 pct   (Adds Intel  Netflix earnings)",
        "date": "07152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall Street edges lower as energy weighs "
    },
    {
        "content": "SAN FRANCISCO Wall Street expects bad news when Intel Corp  reports its second-quarter results on Wednesday although a few short sellers appear to believe the worst is over for the chipmaker's recently sinking stock.",
        "date": "07142015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Short sellers curb Intel bets ahead of second quarter results; tone cautious "
    },
    {
        "content": "China's Tsinghua Unigroup Ltd would need to pay as much as $38 billion to buy Micron Technology Inc   analysts said - assuming that the U.S. government approved the purchase of last U.S. maker of dynamic random access memory (DRAM) chips.",
        "date": "07142015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Mooted Chinese offer for Micron undervalues chipmaker: analysts "
    },
    {
        "content": "July 14 China's Tsinghua Unigroup Ltd would need to pay as much as $38 billion to buy Micron Technology Inc   analysts said - assuming that the U.S. government approved the purchase of last U.S. maker of dynamic random access memory (DRAM) chips.",
        "date": "07142015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Mooted Chinese offer for Micron undervalues chipmaker - analysts "
    },
    {
        "content": "BEIJING  July 14 When Intel CEO Brian Krzanich flew into Beijing last October to tie down an investment in Tsinghua Unigroup  a Chinese chip maker  Unigroup CEO Zhao Weiguo whisked him into a meeting at China's Ministry of Industry and Information Technology (MIIT)  where a vice minister blessed the deal.",
        "date": "07142015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Political ties could prove double-edged sword for Chinese chipmaker "
    },
    {
        "content": "July 2 Intel Corp President Renée James will step down in January to pursue an external chief executive role  Intel Chief Executive Brian Krzanich said in a statement.",
        "date": "07022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel President Renée James to step down in January "
    },
    {
        "content": "NEW YORK  July 2 With analysts' expectations for second-quarter U.S. earnings at rock-bottom levels  many companies may well beat forecasts  possibly setting up the stock market for gains in the coming weeks.",
        "date": "07022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Wall St Week Ahead-Low earnings forecasts may mean profit beats  market boost "
    },
    {
        "content": "June 26 The Nasdaq Composite fell 1 percent in afternoon trading on Friday after weak forecast from Micron Technology dragged down chipmakers including Intel.",
        "date": "06262015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "US STOCKS-Nasdaq falls 1 pct as Micron  Intel weigh "
    },
    {
        "content": "Chipmaker Advanced Micro Devices is at the initial stage of reviewing whether to split itself in two or spin off a business  seeking to reverse its fortunes and take on rival Intel Corp  according to three people familiar with the matter.",
        "date": "06192015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Exclusive: Advanced Micro Devices mulling breakup  spinoff - sources "
    },
    {
        "content": "LONDON  June 12 (IFR) - US technology company Intel Corporation was planning to issue a multi-currency bond for up to USD10bn this week  before torrid European market conditions soured the prospects for a sale.",
        "date": "06122015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Difficult markets put Intel jumbo financing on hold "
    },
    {
        "content": "SAN FRANCISCO Following up on its earlier pledge to spend $300 million over the next five years to improve diversity  Intel Corp promised more on Tuesday  this time to back companies with women and minorities in leadership roles.",
        "date": "06092015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel pledges $125 million for start-ups that back women  minorities "
    },
    {
        "content": "SAN FRANCISCO  June 9 Following up on its earlier pledge to spend $300 million over the next five years to improve diversity  Intel Corp promised more on Tuesday  this time to back companies with women and minorities in leadership roles.",
        "date": "06092015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel pledges $125 mln for start-ups that back women  minorities "
    },
    {
        "content": "June 5 Intel Corp's $16.7 billion acquisition of programmable-chip maker Altera Corp is not the bad news for Altera's rivals that it may seem to be at first blush.",
        "date": "06052015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Lattice and Xilinx seen gaining on Altera after Intel deal "
    },
    {
        "content": "Lattice Semiconductor Corp - one of just a handful of programmable-chip makers left after Intel Corp's deal to buy Altera Corp - is open to a sale  but only for a bigger premium than that offered by Intel  CEO Darin Billerbeck said.",
        "date": "06042015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Lattice Semiconductor open to sale for 'high premium': CEO "
    },
    {
        "content": "* Economic slowdown may be more than temporary-Fed's Brainard",
        "date": "06022015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "REFILE-US STOCKS-U.S. stocks turn positive amid Greece optimism  fading rate hike fears "
    },
    {
        "content": "BANGALORE/SEATTLE  June 1 Intel Corp's  $17 billion purchase of programmable chip maker Altera Corp  is a costly defensive move to ward off rivals in the prized datacenter business it dominates  analysts said on Monday.",
        "date": "06022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "RPT-Intel's purchase of Altera defends its datacenter dominance "
    },
    {
        "content": "BANGALORE/SEATTLE  June 1 Intel Corp's  $17 billion purchase of programmable chip maker Altera Corp  is a costly defensive move to ward off rivals in the prized datacenter business it dominates  analysts said on Monday.",
        "date": "06022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel's purchase of Altera defends its datacenter dominance "
    },
    {
        "content": "Intel Corp  agreed to buy Altera Corp  for $16.7 billion as the world's biggest chipmaker seeks to make up for slowing demand from the PC industry by expanding its line-up of higher-margin chips used in data centers. | Video ",
        "date": "06012015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel to buy Altera for $16.7 billion in its biggest deal ever "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.2 pct  Nasdaq 0.3 pct   (Updates to close)",
        "date": "06012015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St edges up after recent losses  mixed data "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 01 (Fitch) Fitch Ratings has affirmed the ratings for Intel  Corporation (Intel)  including the long-term Issuer Default Rating (IDR) of 'A+'  and short-term IDR of 'F1'  following Intel's announcement it will acquire  Altera Corporation (Altera) for $16.7 billion in cash. Fitch's actions affect $13.2 billion of debt  excluding incremental debt  issuance to fund the vast majority of the Altera acquisition. The Rating Outlo",
        "date": "06012015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Fitch Affirms Intel at 'A+/F1' on Altera Acquisition; Outlook Stable "
    },
    {
        "content": "June 1 The following bids  mergers  acquisitions and disposals were reported by 2020 GMT on Monday:",
        "date": "06012015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Indexes up: Dow 0.5 pct  S&P 0.5 pct  Nasdaq 0.5 pct   (Updates to late afternoon)",
        "date": "06012015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St edges up as data supports Fed rate view "
    },
    {
        "content": "Intel Corp  agreed to buy Altera Corp  for $16.7 billion as the world's biggest chipmaker seeks to make up for slowing demand from the PC industry by expanding its line-up of higher-margin chips used in data centers.",
        "date": "06012015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Notable U.S. semiconductor M&A deals since Dec 2013 "
    },
    {
        "content": "* Deal is third big one in chip industry this year   (Adds link to Breakingviews column; updates shares)",
        "date": "06012015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 4-Intel to buy Altera for $16.7 bln in its biggest deal ever "
    },
    {
        "content": "* Indexes up: Dow 0.4 pct  S&P 0.4 pct  Nasdaq 0.5 pct   (Updates to early afternoon)",
        "date": "06012015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-U.S. stocks recover gains after mixed economic data "
    },
    {
        "content": "June 1 U.S. stocks were choppy in early trading  giving up their gains from a strong opening  as investors digested a slew of data that sent a mixed picture on the pace of the economy's recovery.",
        "date": "06012015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "REFILE-US STOCKS-U.S. stocks choppy in early trade on mixed economic data "
    },
    {
        "content": "* Indexes up: Dow 0.03 pct  S&P 0.02 pct  Nasdaq 0.04 pct   (Adds details  comment  updates prices)",
        "date": "06012015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-U.S. stocks flat in choppy trading after mixed economic data "
    },
    {
        "content": "* Indexes down: Dow 0.6 pct  S&P 0.6 pct  Nasdaq 0.6 pct   (Updates to close)",
        "date": "05292015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St ends down after weak economic data but gains in May "
    },
    {
        "content": "May 29 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "05292015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Intel Corp  has resumed negotiations to buy smaller chip maker Altera Corp  and is close to a $16 billion acquisition agreement  people familiar with the matter said on Friday. | Video ",
        "date": "05292015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel close to deal to buy Altera for $16 billion: sources "
    },
    {
        "content": "* Altera shares up 4.6 pct   (Adds analyst comment and background  updates share movement)",
        "date": "05292015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Intel nears deal to buy Altera for $16 bln - sources "
    },
    {
        "content": "* Indexes down: Dow 0.36 pct  S&P 0.24 pct  Nasdaq 0.11 pct   (Updates prices)",
        "date": "05292015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St slips on weak economic data "
    },
    {
        "content": "* To pay Broadcom shareholders $17 bln in cash  $20 bln in shares",
        "date": "05292015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "CORRECTED-UPDATE 5-Avago to buy Broadcom for $37 bln in biggest-ever chip deal "
    },
    {
        "content": "* Indexes down: Dow 0.58 pct  S&P 0.47 pct  Nasdaq 0.43 pct   (Adds quote  updates prices)",
        "date": "05292015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St lower after first-quarter GDP contraction "
    },
    {
        "content": "* Indexes down: Dow 0.28 pct  S&P 0.19 pct  Nasdaq 0.12 pct   (Updates prices)",
        "date": "05292015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St lower after GDP data shows contraction "
    },
    {
        "content": "* Futures down: Dow 47 pts  S&P 5.5 pts  Nasdaq 14.25 pts   (Adds quote  updates prices)",
        "date": "05292015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St futures unchanged  set for lower open after GDP data "
    },
    {
        "content": "May 29 Intel Corp is close to a deal to buy smaller chip maker Altera Corp for about $15 billion  the New York Post reported.",
        "date": "05292015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel nears $15 bln deal to buy Altera - NY Post "
    },
    {
        "content": "BEIJING  May 20 China's Huawei Technologies Co Ltd  the world's biggest telecommunications equipment maker  on Wednesday became the latest tech giant to present its own take on the 'Internet of Things' (IoT)  centred on an operating system designed to allow household and business appliances to communicate with each other online.",
        "date": "05202015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Huawei stakes claim in 'Internet of Things' market with new operating system "
    },
    {
        "content": "* Indexes end higher: Dow 0.1 pct  S&P 0.3 pct  Nasdaq 0.6 pct   (Updates to close  adds detail on index returns  valuations)",
        "date": "05182015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "US STOCKS-Dow  S&P close at record highs as rate-hike angst abates "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.3 pct  Nasdaq 0.6 pct   (Updates to mid-afternoon)",
        "date": "05182015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Dow  S&P hit record highs as rate-hike worries fade "
    },
    {
        "content": "* Indexes down: Dow 0.1 pct  S&P 0.02 pct  Nasdaq 0.02 pct   (Adds details  changes comment  updates prices)",
        "date": "05182015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St down as homebuilder confidence slips "
    },
    {
        "content": "* Indexes: Dow up 0.05 pct  S&P down 0.02 pct  Nasdaq down 0.08 pct   (Updates to open)",
        "date": "05182015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St opens mixed ahead of homebuilder sentiment data "
    },
    {
        "content": "Chipmakers Intel Corp  and Altera Corp  have resumed talks on a possible deal that could top $13 billion  the New York Post reported.",
        "date": "05182015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel  Altera resume deal talks: NY Post "
    },
    {
        "content": "May 18 Chipmakers Intel Corp and Altera Corp have resumed talks on a possible deal that could top $13 billion  the New York Post reported.",
        "date": "05182015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel  Altera resume deal talks - NY Post "
    },
    {
        "content": "DETROIT  May 14 It took Silicon Valley chipmaker Nvidia Corp the better part of a decade to gain acceptance as a global automotive supplier  a lesson for other technology firms hoping to make a similar transition from consumer electronics to car components.",
        "date": "05142015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Nvidia wants to leap from video games to self-driving cars "
    },
    {
        "content": "Intel Corp  signed a standstill agreement earlier this year with Altera Corp  that expires on June 1  giving the world's largest chipmaker the option to launch a hostile bid after that  according to sources familiar with the matter.",
        "date": "04302015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Exclusive: Intel's standstill with Altera expires in June - sources "
    },
    {
        "content": "April 27 TIG Advisors LLC  an investment firm that holds shares in Altera Corp  challenged the company's board director nomination on Monday over its refusal to engage with Intel Corp about a potential merger.",
        "date": "04272015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Altera shareholder challenges company over Intel "
    },
    {
        "content": "April 27 TIG Advisors LLC  an investment firm that holds shares in Altera Corp  challenged a nomination to the company's board of  directors on Monday over Altera's refusal to engage with Intel Corp about a potential merger.",
        "date": "04272015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Altera shareholder challenges company over Intel "
    },
    {
        "content": "MILAN  April 24 Italian eyewear group Luxottica  expects the first pair of glasses born out of its partnership with U.S. chipmaker Intel Corp to be ready in February or March  co-Chief Executive Massimo Vian told shareholders on Friday.",
        "date": "04242015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Luxottica sees first pair of glasses with Intel chips in Feb/March "
    },
    {
        "content": "* Says Intel security collaborates with Ericsson to bring managed security to telecom operators",
        "date": "04202015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Ericsson says starts collaboration with Intel Security "
    },
    {
        "content": "NEW YORK  April 15 U.S. stocks rallied following several strong earnings reports on Wednesday  while European shares hit a 14-year high after the European Central Bank affirmed its loose policy stance.",
        "date": "04152015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "GLOBAL MARKETS-Wall St gains on earnings  oil surges "
    },
    {
        "content": "April 15 U.S. stocks closed higher on Wednesday  fueled by gains in oil companies and speculation that upcoming first-quarter earnings reports might not be quite as weak as previously thought.",
        "date": "04152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St ends higher as jitters about earnings and oil recede "
    },
    {
        "content": "April 15 U.S. stocks rose on Wednesday  fueled by gains in the energy sector and speculation that upcoming first-quarter earnings reports might not be quite as bad as previously thought.",
        "date": "04152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St rallies as earnings jitters recede and oil rebounds "
    },
    {
        "content": "NEW YORK  April 15  U.S. stocks rallied following several strong earnings reports on Wednesday  while European shares hit a 14-year high after the European Central Bank affirmed its loose policy stance.",
        "date": "04152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "GLOBAL MARKETS-Wall St up on earnings  oil surges "
    },
    {
        "content": "NEW YORK  April 15  European shares hit a 14-year high and the euro fell on Wednesday after the European Central Bank affirmed its loose policy stance  while U.S. stocks rallied after several strong earnings reports.",
        "date": "04152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "CORRECTED-GLOBAL MARKETS-Europe rallies on ECB; Wall St up on earnings "
    },
    {
        "content": "NEW YORK  April 15 U.S. stocks opened higher on Wednesday  with Intel Corp leading the advance a day after the chipmaker gave a reassuring revenue outlook.",
        "date": "04152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS SNAPSHOT-Wall St opens up; Intel rallies on outlook "
    },
    {
        "content": "Several shareholders of chipmaker Altera Corp  including Cadian Capital Management and TIG Advisors  have urged the company to resume takeover talks with Intel Corp  Bloomberg reported  citing people familiar with the matter.",
        "date": "04132015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Shareholders nudge Altera to reopen talks with Intel: Bloomberg "
    },
    {
        "content": "* Dow ends up 0.33 percent  S&P up 0.16 percent  Nasdaq down 0.22 percent   (Updates with Intel and CSX shares rising after the bell)",
        "date": "04142015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "US STOCKS-Wall Street ends higher after bounce in oil prices "
    },
    {
        "content": "April 13 Several shareholders of chipmaker Altera Corp  including Cadian Capital Management and TIG Advisors  have urged the company to resume takeover talks with Intel Corp  Bloomberg reported  citing people familiar with the matter.",
        "date": "04132015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Shareholders nudge Altera to reopen talks with Intel - Bloomberg "
    },
    {
        "content": "Chipmaker Intel Corp forecast revenue broadly in line with Wall Street's expectations and signaled a hefty cut in capital expenditures this year  lifting its shares in after-hours trading.",
        "date": "04142015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel sees revenue holding  cuts capital spending  shares up "
    },
    {
        "content": "April 14 Chipmaker Intel Corp forecast revenue broadly in line with Wall Street's expectations and signaled a hefty cut in capital expenditures this year  lifting its shares in after-hours trading.",
        "date": "04142015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Intel sees revenue holding  cuts capital spending  shares up "
    },
    {
        "content": "April 14 Intel Corp's first-quarter revenue was flat from a year ago and in line with its own recently lowered expectations  due to weak demand for PCs that use the company's chips.",
        "date": "04142015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel's revenue flat from year ago "
    },
    {
        "content": "Discussions on a takeover by Intel Corp of smaller chip maker Altera Corp have ended as the companies were unable to agree on price  a person familiar with the matter said  but Altera shares rose  suggesting it is still a potential target.",
        "date": "04092015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel  Altera end takeover talks due to price disagreement: source "
    },
    {
        "content": "April 9 Discussions on a takeover by Intel Corp  of smaller chip maker Altera Corp have ended as the companies were unable to agree on price  a person familiar with the matter said  but Altera shares rose  suggesting it is still a potential target.",
        "date": "04092015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 4-Intel  Altera end takeover talks due to price disagreement -source "
    },
    {
        "content": "April 9 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "04092015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Dow flat  S&P up 0.1 pct  Nasdaq up 0.1 pct   (Updates to early afternoon)",
        "date": "04092015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St little changed with data  earnings eyed "
    },
    {
        "content": "* Indexes down: Dow 0.3 pct; S&P 0.2 pct  Nasdaq 0.2 pct   (Adds comment  updates prices)",
        "date": "04092015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St searches for direction with data  earnings eyed "
    },
    {
        "content": "NEW YORK  April 6 A March 27 tweet sent the same minute as news broke that chipmaker Intel Corp was in talks to buy Altera Corp appeared to come after very timely trades in Altera's options by several seconds  according to Thomson Reuters data.",
        "date": "04062015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Tweet on Altera-Intel talks came after options trades "
    },
    {
        "content": "April 9 Takeover talks between chipmakers Intel Corp and Altera Corp have broken off  CNBC reported Thursday  citing unnamed sources.",
        "date": "04092015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Takeover talks between Altera  Intel end - CNBC "
    },
    {
        "content": "LONDON (This story corrects name in paragraph 18 to Network for Social Change  from Network for Social Change Charitable Trust to March 4 story)",
        "date": "04012015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Charities that funded Cage  one time supporter of IS's Emwazi  under pressure "
    },
    {
        "content": "March 30 The following bids  mergers  acquisitions and disposals were reported by 1400 GMT on Monday:",
        "date": "03302015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* M&A deal lifts sentiment; biotech coming off big weekly decline",
        "date": "03302015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St bounces back from recent losses; deals help "
    },
    {
        "content": "* M&A deal lifts sentiment; biotech coming off big weekly decline",
        "date": "03302015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St higher as biotechs rally on M&A deals "
    },
    {
        "content": "* M&A deal lifts sentiment; UnitedHealth unit to buy Catamaran",
        "date": "03302015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Futures point to higher open on M&A activity "
    },
    {
        "content": "* M&A deal lifts sentiment; UnitedHealth unit to buy Catamaran",
        "date": "03302015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Futures higher  but crude oil weakens "
    },
    {
        "content": "* Lafarge drops as two Holcim shareholders reject revised deal",
        "date": "03302015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Rallying techs help European stocks bounce back "
    },
    {
        "content": "PARIS  March 30 European stocks rose early on Monday  bouncing back from last week's losses with tech shares rallying after news of merger talks in the sector spurred a late-session rally on Wall Street on Friday.",
        "date": "03302015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "European stocks bounce back  helped by techs "
    },
    {
        "content": "PARIS  March 30 European stocks were set to rise on Monday  bouncing back from last week's losses with tech shares in focus after news of merger talks in the sector spurred a late-session rally on Wall Street on Friday.     Intel Corp is in talks to buy fellow chipmaker Altera Corp  in a deal likely to top $10 billion  according to a source familiar with the matter  which would make it Intel's biggest acquisition ever and the latest merger in the quickly consolidating semiconductor s",
        "date": "03302015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Europe Factors to Watch-Shares set to rise; techs in focus "
    },
    {
        "content": "* Ingenico Group and Intel Corp to bring payments to the Internet of Things",
        "date": "04022015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "BRIEF-Ingenico Group and Intel to bring payments to the Internet of Things "
    },
    {
        "content": "TEL AVIV Internet and network security provider Check Point Software Technologies will buy Israel-based Lacoon Mobile Security for tens of millions of dollars  it said on Thursday.",
        "date": "04022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Check Point to buy Israel's Lacoon Mobile Security "
    },
    {
        "content": "Intel Corp  is in talks to buy fellow chipmaker Altera Corp  in a deal likely to top $10 billion  according to a source familiar with the matter  making it Intel's biggest purchase ever and the latest merger in the quickly consolidating semiconductor sector.",
        "date": "03272015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel in talks to buy Altera  shares of firms surge "
    },
    {
        "content": "March 27 Intel Corp is in talks to buy fellow chipmaker Altera Corp in a deal likely to top $10 billion  according to a source familiar with the matter  making it Intel's biggest purchase ever and the latest merger in the quickly consolidating semiconductor sector.",
        "date": "03272015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Intel in talks to buy Altera  shares of firms surge "
    },
    {
        "content": "NEW YORK News that chipmaker Intel Corp  is in talks to buy Altera Corp  sparked a flurry of trades in its short-term calls and could spell huge gains for some timely buyers of the options.",
        "date": "03272015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Big win for Altera call buyers on talk of Intel deal "
    },
    {
        "content": "Intel has announced its support for the government's \"digital economy\" strategy through its technologies and knowledge  the Nation reported  citing Intel Southeast Asia's director of public policy  Worapat Patram.",
        "date": "03252015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "THAILAND PRESS-Intel to support govt's digital economy plan - The Nation "
    },
    {
        "content": "* Indexes up: Dow 0.19 pct  S&P 0.24 pct  Nasdaq 0.57 pct   (Updates to market close)",
        "date": "03272015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St ends 4-day skid on late tech rally "
    },
    {
        "content": "March 27 Chipmaker Intel Corp is in talks to buy Altera Corp  the Wall Street Journal said  citing people familiar with the matter.",
        "date": "03272015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel in talks to buy Altera - WSJ "
    },
    {
        "content": "BASEL  Switzerland Tag Heuer  French luxury group LVMH's  biggest watch maker  said it will launch a smartwatch later this year using Google Inc's  Android operating system in a venture with Intel Corp  to compete head-on with the Apple Watch.",
        "date": "03192015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Tag Heuer  Intel challenge Apple with Android smartwatch "
    },
    {
        "content": "BASEL  Switzerland  March 19 Tag Heuer  French luxury group LVMH's biggest watch maker  said it will launch a smartwatch later this year using Google Inc's  Android operating system in a venture with Intel Corp  to compete head-on with the Apple Watch.",
        "date": "03192015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Tag Heuer  Intel challenge Apple with Android smartwatch "
    },
    {
        "content": "BASEL  Switzerland  March 19 Tag Heuer  French luxury group LVMH's biggest watch maker  announced a partnership with Google Inc and Intel Corp to create a luxury smartwatch to compete head-on with Apple Inc .",
        "date": "03192015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "CORRECTED-Tag Heuer unveils smartwatch venture with Intel  Google "
    },
    {
        "content": "* Chips would be priced less than leader Intel's   (Adds details  quotes)",
        "date": "03192015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Chip designer ARM sees 20 pct market share in servers by 2020 "
    },
    {
        "content": "* Industry starting to think Apple Watch may boost luxury sales",
        "date": "03112015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Swiss makers quietly gear up with smartwatches of their own "
    },
    {
        "content": "NEW YORK U.S. stocks rose in a broad rally on Thursday  bouncing back from two days of losses  helped by weaker retail sales that paused the dollar's recent rally and tempered the outlook for interest rates. | Video ",
        "date": "03122015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Wall St. bounces back in broad rally; bank shares gain "
    },
    {
        "content": "March 12 Intel Corp slashed nearly $1 billion from its first-quarter revenue forecast as small businesses put off upgrading their personal computers  sending the chipmaker's shares down more than 5 percent.",
        "date": "03122015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "CORRECTED-UPDATE 4-Intel cuts revenue forecast as desktop demand weakens "
    },
    {
        "content": "* Indexes up: Dow 1.2 pct  S&P 1 pct  Nasdaq 0.7 pct   (Updates to late afternoon)",
        "date": "03122015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St bounces back in broad rally; bank shares gain "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 12 (Fitch) Intel's negative pre-announcement this morning  suggests the end of support for Windows XP was a more significant factor than  previously estimated in last year's perceived stabilizing personal computer (PC)  demand  according to Fitch Ratings. Consequently  extended PC refresh cycles may  result in a resumption of negative PC sales growth. Intel Thursday changed its first-quarter revenue outlook as a function ",
        "date": "03122015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Fitch: Intel Outlook Could Signal PC Market Hasn't Stabilized "
    },
    {
        "content": "* Indexes up: Dow 1 pct  S&P 0.9 pct  Nasdaq 0.5 pct   (Updates to afternoon trading)",
        "date": "03122015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St up 1 pct in broad rally; Intel weighs on Nasdaq "
    },
    {
        "content": "* Indexes up: Dow 0.9 pct  S&P 0.8 pct  Nasdaq 0.4 pct   (Updates to mid-morning trading)",
        "date": "03122015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St up in broad rally  but Intel weighs on Nasdaq "
    },
    {
        "content": "* Indexes up: Dow 0.9 pct  S&P 0.7 pct  Nasdaq 0.3 pct   (Updates to market open  adds Intel outlook)",
        "date": "03122015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St up after recent declines; Intel weighs "
    },
    {
        "content": "March 12 U.S. stocks opened higher on Thursday  rebounding after two days of declines  though shares of Intel Corp weighed on Nasdaq after the company warned that first-quarter revenue would be weaker than expected.",
        "date": "03122015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS SNAPSHOT-Wall St opens higher  Intel weighs on Nasdaq "
    },
    {
        "content": "BEIJING  March 5 China's Huawei Technologies Co Ltd and Intel Corp are expanding an existing alliance to provide cloud computing to global telecoms carriers  as U.S. tech firms vie for Chinese tie-ups to retain access to a tough mainland market.",
        "date": "03052015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Huawei  Intel expand tie-up amid China's rising scrutiny of U.S. tech firms "
    },
    {
        "content": "TEL AVIV  March 3 TowerJazz has won a contract from Intel Corp to produce infrared sensors for Intel's 3D cameras  the Israeli chip manufacturer said on Tuesday.",
        "date": "03032015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Israel's TowerJazz to produce sensors for Intel's 3D cameras "
    },
    {
        "content": "SAN FRANCISCO  March 2 Intel Corp is shipping new mobile chips that represent the semiconductor company's biggest hope for making progress in smartphones this year.",
        "date": "03022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel launches chip for new push into low-price smartphones "
    },
    {
        "content": "BARCELONA  March 2 Telecom equipment maker Ericsson and chipmaker Intel have agreed a partnership deal to help network operator customers build datacentres  putting them on a more competitive footing against big  cloud-based Internet firms such as Google  Facebook and Amazon.",
        "date": "03022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Ericsson joins with Intel to help telecoms firms get in the cloud "
    },
    {
        "content": "LONDON British television broadcast the first picture of Mohammed Emwazi as a student on Friday  showing the man identified as the Islamic State \"Jihadi John\" killer with a mustache and goatee beard wearing a large baseball cap. | Video ",
        "date": "02272015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "British TV shows student picture of 'Jihadi John' in baseball cap "
    },
    {
        "content": "LONDON/WASHINGTON The masked \"Jihadi John\" killer who fronted Islamic State beheading videos has been identified as Mohammed Emwazi  a British computer programming graduate from a well-to-do London family who was known to the security services.",
        "date": "02262015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "'Jihadi John' killer from Islamic State beheading videos unmasked as Londoner "
    },
    {
        "content": "LONDON British Prime Minister David Cameron vowed on Friday to use all means at his disposal to hunt down militants such as \"Jihadi John\" after the killer was identified as a Kuwaiti-born computer programming graduate from London. | Video ",
        "date": "02272015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "British PM Cameron vows to hunt down 'Jihadi John' "
    },
    {
        "content": "* Ericsson  Intel CEOs say in partnership to develop cloud based software and hardware products  Further company coverage:",
        "date": "03022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "BRIEF-Ericsson  Intel CEOs say in partnership to develop cloud based software and hardware products "
    },
    {
        "content": "Feb 27 China's Lenovo Group Ltd on Friday said it will offer free subscriptions to Intel Corp  security software to customers who bought laptops that were shipped with a program known as \"Superfish \" which made PCs vulnerable to cyberattacks.",
        "date": "02272015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Lenovo to allay security concerns with free McAfee LiveSafe "
    },
    {
        "content": "LONDON/WASHINGTON The masked \"Jihadi John\" killer who fronted Islamic State beheading videos has been identified as Mohammed Emwazi  a British computer programming graduate from a well-to-do London family who was known to the security services.",
        "date": "02272015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "'Jihadi John' killer from Islamic State beheading videos unmasked as Londoner "
    },
    {
        "content": "LONDON Islamist militant Mohammed Emwazi  identified as 'Jihadi John ' was a  member of a network in contact with one of the men convicted of trying to bomb the British capital's underground railway in 2005  according to the government.",
        "date": "03022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "'Jihadi John' part of network linked to failed London bombers: court papers "
    },
    {
        "content": "Feb 24 Mike DeCesare  a senior executive with Intel Corp's security group  has left the company and taken a job running privately held cybersecurity firm ForeScout.",
        "date": "02242015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Former McAfee president leaves Intel to run ForeScout "
    },
    {
        "content": "NEW YORK  Feb 17 Soros Fund Management LLC took new positions in the energy sector in the fourth quarter  including stakes in Devon Energy Corp and Transocean Ltd   a regulatory filing showed Tuesday.",
        "date": "02182015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Soros bet on Devon Energy  Transocean ahead of oil price rise "
    },
    {
        "content": "SAN FRANCISCO  Feb 6 Chipmaker Intel Corp  said on Friday it promoted five top executives to senior vice president and that their duties would remain largely the same.",
        "date": "02062015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Chipmaker Intel promotes senior executives  duties unchanged "
    },
    {
        "content": "FRANKFURT  Feb 2 Intel has agreed to buy German network chipmaker Lantiq for an undisclosed amount to expand its range of chips used in Internet-connected gadgets  the companies said on Monday.",
        "date": "02022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel buys former Infineon \"Internet of Things\" chip unit Lantiq "
    },
    {
        "content": "FRANKFURT Intel has agreed to buy German network chipmaker Lantiq for an undisclosed amount to expand its range of chips used in Internet-connected gadgets  the companies said on Monday.",
        "date": "02022015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel buys former Infineon 'Internet of Things' chip unit Lantiq "
    },
    {
        "content": "* Shares hit record high before easing  up 0.6 percent   (Updates shares  writes through)",
        "date": "01212015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 5-ASML shares hit record after fourth quarter tops forecasts "
    },
    {
        "content": "U.S. chipmaker Advanced Micro Devices Inc  forecast weaker-than-expected first-quarter revenue and said it taking steps to return its computing and graphics businesses to a \"healthy trajectory\" from the second quarter.",
        "date": "01212015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "AMD first-quarter revenue forecast disappoints "
    },
    {
        "content": "Jan 20 U.S. chipmaker Advanced Micro Devices Inc  forecast weaker-than-expected first-quarter revenue and said it taking steps to return its computing and graphics businesses to a \"healthy trajectory\" from the second quarter.",
        "date": "01202015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-AMD first-quarter revenue forecast disappoints "
    },
    {
        "content": "* Indexes up: Dow 0.14 pct  S&P 0.31 pct  Nasdaq 0.43 pct   (Adds quote  data)",
        "date": "01162015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St steadies on heels of Swiss move  data "
    },
    {
        "content": "* Futures off: Dow 58 pts  S&P 5 pts  Nasdaq 16 pts   (Adds quote  data)",
        "date": "01162015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St to dip at open on heels of Swiss move  data "
    },
    {
        "content": "NEW YORK Jim Chanos  founder of hedge fund firm Kynikos Associates  said on Friday he is betting against the shares of chipmaker Intel Corp.",
        "date": "01162015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Hedge fund founder Chanos says shorting Intel shares: CNBC "
    },
    {
        "content": "NEW YORK  Jan 16 Jim Chanos  founder of hedge fund firm Kynikos Associates  said on Friday he is betting against the shares of chipmaker Intel Corp.",
        "date": "01162015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 1-Hedge fund founder Chanos says shorting Intel shares - CNBC "
    },
    {
        "content": "NEW YORK  Jan 16 Jim Chanos  founder of hedge fund firm Kynikos Associates  said Friday that he is betting against the shares of Intel Corp.",
        "date": "01162015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Kynikos' Chanos says he is short Intel Corp - CNBC "
    },
    {
        "content": "* Futures off: Dow 68 pts  S&P 7.5 pts  Nasdaq 29 pts   (Adds FXCM  Interactive Brokers)",
        "date": "01162015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Futures fall in wake of Swiss move; Wall St to drop for week "
    },
    {
        "content": "NEW YORK  Jan 16 U.S. stock index futures edged lower on Friday  following five straight days of losses for major indexes  setting Wall Street up for its fourth negative week out of the past six.",
        "date": "01162015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Futures fall  Wall Street set to post weekly decline "
    },
    {
        "content": "Jan 15 Chipmaker Intel Corp forecast revenue and gross margins for this quarter that disappointed investors  sending its shares down 2.7 percent in extended trading.",
        "date": "01162015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 3-Intel forecasts disappointing revenue; shares fall "
    },
    {
        "content": "Chipmaker Intel Corp  forecast current-quarter revenue and gross margins that disappointed investors  sending its shares down more than 2 percent in extended trading.",
        "date": "01152015",
        "name": "Intel Corporation",
        "news_type": "topStory",
        "symbol": "INTC",
        "title": "Intel forecasts disappointing revenue; shares fall "
    },
    {
        "content": "Jan 15 Chipmaker Intel Corp forecast current-quarter revenue and gross margins that disappointed investors  sending its shares down more than 2 percent in extended trading.",
        "date": "01152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "UPDATE 2-Intel forecasts disappointing revenue; shares fall "
    },
    {
        "content": "Jan 12 Walt Disney Co  Sony Corp  and DreamWorks Animation SKG Inc urged a federal judge to throw out a antitrust lawsuit accusing them of conspiring not to poach each other's animators in order to keep wages down.",
        "date": "01122015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Disney  Sony  DreamWorks seek to throw out anti-poaching lawsuit "
    },
    {
        "content": "* Swiss National Bank scraps three-year-old euro cap on franc",
        "date": "01152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "US STOCKS-Wall St drops for 5th day on global weakness worry; Intel down late "
    },
    {
        "content": "Jan 15 Intel Corp reported a 6.4 percent rise in quarterly revenue as sales of personal computers stabilized.",
        "date": "01152015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel revenue rises 6.4 pct "
    },
    {
        "content": "SAN FRANCISCO  Jan 6 Intel Corp Chief Executive Brian Krzanich showed off a computer built into a jacket button and a wristband that transforms into a selfie-snapping flying camera  as the chipmaker extends its push into smart wearable gadgets.",
        "date": "01072015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Intel Corp chief shows wrist-worn drone; promises to employ more women "
    },
    {
        "content": "SAN FRANCISCO  Jan 2 Vuzix Corporation said on Friday that Intel Corp invested $24.8 million in the company to speed up the launch of Internet-connected eyewear.",
        "date": "01032015",
        "name": "Intel Corporation",
        "news_type": "normal",
        "symbol": "INTC",
        "title": "Vuzix says received Intel investment for smart glasses "
    }
]