[
    {
        "content": "* Capital One-deal allowing Capital One customers who use Intuit's suite of services to securely import financial data without sharing login credentials​ Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Capital One and Intuit announce data sharing agreement "
    },
    {
        "content": "* Intuit Inc - ‍once transaction closes  Exactor employees will join Intuit in its pursuit to power prosperity around world​ Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit to acquire Exactor expands the QuickBooks platform "
    },
    {
        "content": "* Diane Greene to step down from Intuit board of directors; former amazon.com CFO Thomas Szkutak nominated",
        "date": "10192017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Diane Greene to step down from Intuit board of directors "
    },
    {
        "content": "NEW YORK  Oct 10 JPMorgan Chase & Co and Temasek Holdings have led a $100 million investment in Bill.com  a Palo Alto  California-based company that helps business digitize their payments.",
        "date": "10102017",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "CORRECTED-OFFICIAL-JPMorgan  Temasek lead $100 mln investment in payments company Bill.com "
    },
    {
        "content": "* Intuit hosts investor day: reaffirms first-quarter and fiscal 2018 guidance",
        "date": "10032017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit hosts investor day and reaffirms first-quarter and fiscal 2018 guidance "
    },
    {
        "content": "* Sees QuickBooks online subscribers of 3.275 million to 3.375 million for fy 2018 (adds period \"fy 2018\")",
        "date": "08222017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit reports Q4 earnings per share of $0.09 "
    },
    {
        "content": "* Intuit Inc - ‍Liu currently leads Facebook's developer and commerce businesses​ Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit appoints Deborah Liu to board of directors "
    },
    {
        "content": "SAN FRANCISCO Twitter Inc  on Tuesday hired Ned Segal  senior vice president of finance at Intuit Inc  and a former managing director at Goldman Sachs Group Inc   as its chief financial officer beginning in late August.",
        "date": "07112017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "Twitter hires ex-Goldman managing director as CFO "
    },
    {
        "content": "SAN FRANCISCO  July 11 Twitter Inc on Tuesday hired Ned Segal  senior vice president of finance at Intuit Inc and a former managing director at Goldman Sachs Group Inc  as its chief financial officer beginning in late August.",
        "date": "07112017",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "UPDATE 2-Twitter hires ex-Goldman managing director as CFO "
    },
    {
        "content": "SAN FRANCISCO  July 11 Twitter Inc said on Tuesday it had hired Ned Segal  senior vice president of finance at Intuit Inc  as its chief financial officer beginning in late August.",
        "date": "07112017",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "Twitter hires Intuit's Ned Segal as chief financial officer "
    },
    {
        "content": "* Intuit reports third-quarter revenue up 10 percent; quickbooks online subscribers increase 59 percent",
        "date": "05232017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit Q3 adjusted earnings per share $3.90 "
    },
    {
        "content": "* SurveyMonkey - announced today addition of serena williams and Intuit chairman and CEO Brad Smith to its board of directors Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-SurveyMonkey announced today addition of Serena Williams and Intuit CEO Brad Smith to its board "
    },
    {
        "content": "* Intuit reports consumer tax season results: reiterates third quarter and full-year guidance",
        "date": "04262017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit reports consumer tax season results "
    },
    {
        "content": "* Intuit adjusts second quarter outlook reflecting slow start for overall tax market: reiterates full-year guidance",
        "date": "02082017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit forecasts Q2 non-GAAP earnings $0.24/shr-$0.25/shr "
    },
    {
        "content": "Feb 3 Wells Fargo & Co reached an agreement with Intuit Inc to allow the bank's customers who use financial management applications such as Mint  TurboTax and QuickBooks to choose the information they share while importing bank account details.",
        "date": "02032017",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "Wells Fargo customers to get easier access to online finance tools "
    },
    {
        "content": "* Intuit signs new data-exchange agreement with Wells Fargo  Source text for Eikon:  Further company coverage:",
        "date": "02032017",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "BRIEF-Intuit signs new data-exchange agreement with Wells Fargo "
    },
    {
        "content": "NEW YORK JPMorgan Chase & Co  and Intuit Inc  said on Wednesday they had reached an agreement to allow the bank's customers to quickly put account information into Mint  TurboTax Online and QuickBooks Online financial management applications without turning over user names and bank passwords.",
        "date": "01252017",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "JPMorgan clients to get easier access to online finance tools "
    },
    {
        "content": "NEW YORK  Jan 25 JPMorgan Chase & Co and Intuit Inc said on Wednesday they had reached an agreement to allow the bank's customers to quickly put account information into Mint  TurboTax Online and QuickBooks Online financial management applications without turning over user names and bank passwords.",
        "date": "01252017",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "UPDATE 1-JPMorgan clients to get easier access to online finance tools "
    },
    {
        "content": "NEW YORK  Jan 25 JPMorgan Chase & Co and Intuit Inc said on Wednesday that they had agreed on tools for Chase customers to quickly put account information into Mint  TurboTax Online and QuickBooks Online financial management applications without turning over their user names and bank passwords.",
        "date": "01252017",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "JPMorgan and Intuit to ease way for Chase customers to use Mint "
    },
    {
        "content": "* Intuit - Co american express enter partnership to give quickbooks online small business customers access to short-term financing from american express  Source text for Eikon:  Further company coverage:",
        "date": "10132016",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit - Co American express enter partnership "
    },
    {
        "content": "* Intuit reiterates first quarter and fiscal 2017 guidance; hosts investor day",
        "date": "09212016",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit reiterates first-quarter and fiscal 2017 guidance "
    },
    {
        "content": "* Q4 GAAP loss per share $0.16; Q4 non-GAAP earnings per share $0.08",
        "date": "08232016",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit Inc reports Q4 GAAP loss per share of $0.16 "
    },
    {
        "content": "* Intuit  Etsy partner to simplify accounting and tax prep for sellers",
        "date": "08112016",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit  Etsy partner to simplify accounting and tax prep for sellers "
    },
    {
        "content": "* Intuit names Google VP Lucas Watson as chief marketing and sales officer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07122016",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit names Lucas Watson as chief marketing and sales officer "
    },
    {
        "content": "* Posts Strong Third-quarter results; raises full-year guidance",
        "date": "05242016",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "BRIEF-Intuit Inc Q3 GAAP earnings per share $3.94 "
    },
    {
        "content": "Feb 25 Intuit Inc  a maker of software that helps with tax-preparation  swung to a profit in the second quarter  helped by higher demand in the lead up to the U.S. tax season.",
        "date": "02252016",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "UPDATE 1-Intuit swings to profit as tax preparation software demand rises "
    },
    {
        "content": "Feb 25 Tax-preparation software maker Intuit Inc  swung to a second-quarter profit  helped by demand for its online tax preparation software  TurboTax  in the lead up to the U.S. tax season.",
        "date": "02252016",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "Intuit swings to profit on strong demand for tax preparation software "
    },
    {
        "content": "Intuit Inc  a maker of software that helps with tax-preparation  said it has laid off 399 people.",
        "date": "06262015",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "Intuit lays off 399 employees "
    },
    {
        "content": "June 26 Intuit Inc  a maker of software that helps with tax-preparation  said it has laid off 399 people.",
        "date": "06262015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "UPDATE 1-Intuit lays off 399 employees "
    },
    {
        "content": "June 26 Intuit Inc  which makes software that helps with tax-preparation  has laid off 399 people  or about 5 percent of its workforce  technology news website TechCrunch reported.",
        "date": "06262015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "Intuit lays off 399 workers  five percent of its workforce - TechCrunch "
    },
    {
        "content": "June 3 GI Partners is buying the real estate software company MRI Software LLC for an undisclosed sum from the technology focused private equity firm Vista Equity Partners  the firms said on Wednesday.",
        "date": "06032015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "GI Partners buys software firm from Vista Equity "
    },
    {
        "content": "* Indexes up: Dow 0.9 pct  S&P 0.6 pct  Nasdaq 0.6 pct   (Adds latest volume  Nordstrom shares up)",
        "date": "02202015",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "US STOCKS-Dow  S&P 500 close at record highs on Greece debt deal "
    },
    {
        "content": "* Indexes up: Dow 0.9 pct  S&P 0.6 pct  Nasdaq 0.6 pct   (Updates to close)",
        "date": "02202015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "US STOCKS-Dow  S&P 500 end at record highs on Greece debt deal "
    },
    {
        "content": "* Indexes up: Dow 0.7 pct  S&P 0.4 pct  Nasdaq 0.4 pct   (Updates to late afternoon)",
        "date": "02202015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "US STOCKS-Dow  S&P 500 at intraday highs on Greece debt deal news "
    },
    {
        "content": "Intuit Inc  reported a smaller-than-expected quarterly loss due to a strong demand for its online tax-preparation software  TurboTax  at the start of the U.S. tax-filing season.",
        "date": "02192015",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "TurboTax maker Intuit posts smaller-than-expected loss "
    },
    {
        "content": "* Indexes up: Dow 0.4 pct  S&P 0.2 pct  Nasdaq 0.3 pct   (Updates to afternoon trading)",
        "date": "02202015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "US STOCKS-Wall St climbs after news of draft debt deal for Greece "
    },
    {
        "content": "Feb 19 Intuit Inc reported a smaller-than-expected quarterly loss due to a strong demand for its online tax-preparation software  TurboTax  at the start of the U.S. tax-filing season.",
        "date": "02192015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "UPDATE 2-TurboTax maker Intuit posts smaller-than-expected loss "
    },
    {
        "content": "* Dow down 0.1 pct  S&P down 0.2 pct  Nasdaq flat   (Updates to midday trading)",
        "date": "02202015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "US STOCKS-Wall St little changed as investors seek Greek clarity "
    },
    {
        "content": "* Dow down 0.24 pct  S&P down 0.11 pct  Nasdaq up 0.37 pct   (Updates close with Intuit shares up after the bell  American Express  details)",
        "date": "02192015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "US STOCKS-Nasdaq gains 7th day; Dow  S&P 500 slip with Wal-Mart "
    },
    {
        "content": "* Indexes down: Dow 0.6 pct  S&P 0.5 pct  Nasdaq 0.3 pct   (Updates to open of U.S. trading)",
        "date": "02202015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "US STOCKS-Wall St dips  investors seek clarity on Greece deal "
    },
    {
        "content": "Feb 19 Intuit Inc  maker of tax-preparation software TurboTax   reported a quarterly loss that widened from a year earlier as expenses rose.",
        "date": "02192015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "Intuit Q2 loss widens on higher expenses "
    },
    {
        "content": "Feb 10 The U.S. Federal Bureau of Investigation is examining how fraudulent tax returns were filed in 19 states through tax-preparation software TurboTax  the Wall Street Journal reported  citing a person with knowledge of the matter.",
        "date": "02112015",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "UPDATE 1-FBI to probe fake tax filings through TurboTax - WSJ "
    },
    {
        "content": "Intuit Inc said its tax-preparation software TurboTax had resumed electronic filing of state tax returns late Friday following a temporary halt after noticing attempts to use stolen identity information to file fraudulent returns and claim refunds.",
        "date": "02072015",
        "name": "Intuit Inc",
        "news_type": "topStory",
        "symbol": "INTU",
        "title": "TurboTax maker Intuit resumes state tax filings after earlier halt "
    },
    {
        "content": "Feb 6 Intuit Inc said its tax-preparation software TurboTax had resumed electronic filing of state tax returns late Friday following a temporary halt after noticing attempts to use stolen identity information to file fraudulent returns and claim refunds.",
        "date": "02072015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "UPDATE 2-TurboTax maker Intuit resumes state tax filings after earlier halt "
    },
    {
        "content": "Feb 6 Health insurer Anthem Inc on Friday warned U.S. customers about an email scam targeting former and current members whose personal information was suspected to have been breached in a massive cyber attack.",
        "date": "02072015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "UPDATE 3-Anthem warns U.S. customers of email scam after data breach "
    },
    {
        "content": "Feb 6 Intuit Inc  the developer of tax-preparation software TurboTax  halted e-filing of state tax returns after it noticed attempts to use stolen identity information to file fraudulent state tax returns and claim refunds.",
        "date": "02062015",
        "name": "Intuit Inc",
        "news_type": "normal",
        "symbol": "INTU",
        "title": "TurboTax maker Intuit halts state tax filings over fraud concerns "
    }
]