[
    {
        "content": "* Iron Mountain enters into agreement to expand presence in china with acquisition",
        "date": "11162017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain to expand presence in China with acquisition "
    },
    {
        "content": "* IRON MOUNTAIN-‍UNIT PRICED OFFERING BY WAY OF A PRIVATE PLACEMENT OF £400.0 MILLION IN AGGREGATE PRINCIPAL AMOUNT OF ITS 3.875% GBP SENIOR NOTES DUE 2025​ Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-IRON MOUNTAIN INCORPORATED PRICES U.K. DEBT OFFERING "
    },
    {
        "content": "* Iron mountain announces conditional redemption of 6.125% GBP senior notes due 2022",
        "date": "11012017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain announces conditional redemption of 6.125 pct GBP Senior Notes due 2022 "
    },
    {
        "content": "* IRON MOUNTAIN - PROPOSED OFFERING OF A TOTAL OF £400.0 MILLION PRINCIPAL AMOUNT OF GBP SENIOR NOTES DUE 2025 BY CO'S UNIT Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-IRON MOUNTAIN INCORPORATED ANNOUNCES U.K. DEBT OFFERING "
    },
    {
        "content": "* Says company is maintaining 2017 full-year guidance Source text for Eikon: Further company coverage:",
        "date": "10242017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain reports Q3 adjusted FFO of $210 million "
    },
    {
        "content": "* Iron Mountain increases quarterly dividend per share by 7 pct",
        "date": "10242017",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain increases quarterly dividend per share by 7 pct "
    },
    {
        "content": "* As part of $100 million transaction  Credit Suisse will enter into a long-term lease with iron mountain",
        "date": "10052017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain ‍to buy two Credit Suisse data centers in London and Singapore "
    },
    {
        "content": "* Iron Mountain acquires Bonded Services Group  expanding capabilities for art  film and sound asset management",
        "date": "10032017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain acquires Bonded Services Group "
    },
    {
        "content": "* Iron Mountain - Virtustream  a Dell technologies business  has chosen to expand its cloud footprint by locating in co's northern Virginia data center Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain expands partnership with Virtustream "
    },
    {
        "content": "* Iron Mountain announces conditional redemption of all of its 6.000 pct senior notes due 2020",
        "date": "09062017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain announces conditional redemption of all of its 6.000 pct senior notes due 2020 "
    },
    {
        "content": "* Iron Mountain Inc - ‍priced an offering by way of a private placement of a total of $1 billion in aggregate principal amount of senior notes​",
        "date": "09062017",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain Incorporated prices debt offering "
    },
    {
        "content": "* Iron Mountain Inc - proposed offering by way of a private placement of a total of $750 million in aggregate principal amount of its senior notes due 2027​",
        "date": "09062017",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain announces proposed offering by way of private placement of $750 mln in aggregate principal amount of senior notes due 2027​ "
    },
    {
        "content": "* Iron Mountain Inc - declared a qtrly cash dividend of USD $0.55 per share on common stock Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain Inc says declared a qtrly cash dividend of USD $0.55 per share on common stock "
    },
    {
        "content": "* Iron Mountain Inc -  maintained its 2017 full-year guidance except for minor updates to address acquisition of Fortrust Source text for Eikon: Further company coverage:",
        "date": "07282017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain reports second quarter 2017 results "
    },
    {
        "content": "* Iron Mountain Inc says offering by way of private placement of EUR 300 million in aggregate principal amount of euro senior notes due 2025",
        "date": "05162017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain announces debt offering "
    },
    {
        "content": "* Renewable Power Direct - Renewable Power Direct has structured a third renewable electricity agreement for Iron Mountain Incorporated",
        "date": "05092017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Renewable Power Direct structures power deal for Iron Mountain "
    },
    {
        "content": "* Co's outlook for full-year 2017 remains consistent with constant dollar guidance ranges provided on February 23  2017",
        "date": "04202017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain's outlook for full-year 2017 remains consistent with constant dollar guidance ranges provided on Feb 23 "
    },
    {
        "content": "* Iron mountain reports fourth quarter and full year 2016 results",
        "date": "02232017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain Q4 adjusted FFO per share $0.50 "
    },
    {
        "content": "* Iron mountain appoints Fidelma Russo as chief technology officer",
        "date": "02082017",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain appoints Fidelma Russo as chief technology officer "
    },
    {
        "content": "* Declared a cash dividend of $0.55 USD per share on common stock and chess depository interests (CDIS) of company",
        "date": "10312016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain declares cash dividend of $0.55 per share "
    },
    {
        "content": "* Iron mountain inc - adjusted EPS for Q3 was $0.27 per diluted share",
        "date": "11012016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain posts Q3 adjusted EPS of $0.27/share "
    },
    {
        "content": "* Says to sell legacy Iron Mountain Australian business to Housatonic Partners consortium",
        "date": "10242016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain to sell its Australian business to Housatonic Partners consortium "
    },
    {
        "content": "* Iron Mountain appoints Theresa Pattara as vice president of North America government affairs  Source text for Eikon:  Further company coverage:",
        "date": "10112016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain appoints Theresa Pattara as VP of North America government affairs "
    },
    {
        "content": "* Unit priced an offering by way of private placement of C$250 million in aggregate principal amount of its 5.375% CAD senior notes due 2023  Source text for Eikon:  Further company coverage:",
        "date": "09122016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain incorporated prices Canadian debt offering "
    },
    {
        "content": "* Iron Mountain Incorporated announces canadian debt offering",
        "date": "09122016",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain Incorporated announces canadian debt offering "
    },
    {
        "content": "Aug 10 UK's Competition and Markets Authority (CMA):",
        "date": "08102016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-UK's CMA says consulting on undertakings offered by Iron Mountain over Recall merger "
    },
    {
        "content": "* Reached an agreement with Iron Mountain Inc. whereby the Group's Records Management activities in 10 markets will be acquired by Iron Mountain against a cash consideration of 27.1 million euros ($30.34 million)",
        "date": "08022016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Santa Fe Group sells Records Management activities in 10 markets to Iron Mountain "
    },
    {
        "content": "* On June 24  co's unit entered into commitment increase supplement with lenders - sec filing",
        "date": "06282016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain's unit entered into commitment increase supplement with lenders "
    },
    {
        "content": "* CMA completes phase 2 review and approves recall acquisition",
        "date": "06162016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain says CMA completes phase 2 review "
    },
    {
        "content": "* Day will remain with company through mid-October for transition purposes",
        "date": "06152016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain announces resignation of CFO Rod Day "
    },
    {
        "content": "* Iron mountain appoints greg parkin director of digital solutions for entertainment services  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06142016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain appoints Greg Parkin director of digital solutions for entertainment services "
    },
    {
        "content": "* Estimates it will receive proceeds of approximately $220.0 million from divestments in Australia  U.S.  Canada  and divestitures in Scotland affected areas - SEC filing",
        "date": "05252016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "CORRECTED-BRIEF-Iron Mountain expects about $220 mln from divestments (May 24) "
    },
    {
        "content": "* Priced a private offering of a total of $750 million in aggregate principal amount of senior unsecured notes",
        "date": "05242016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain prices debt offering "
    },
    {
        "content": "* Announced a proposed private offering of a total of $750 million of senior unsecured notes",
        "date": "05242016",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain announces proposed private offering of $750 mln senior unsecured notes "
    },
    {
        "content": "* Access announces acquisition of Recall Operations in 13 metropolitan areas",
        "date": "05052016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Access to acquire Recall operations in 13 metropolitan areas "
    },
    {
        "content": "* Agreed with DoJ to divest certain of recall's records and information management facilities in Atlanta  Georgia",
        "date": "05052016",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain in talks with potential buyers for Seattle/Atlanta divestments - SEC filing "
    },
    {
        "content": "* On May 2  2016  co completed its acquisition of Recall Holdings Limited  Source text for Eikon: [(http://1.usa.gov/1X48lkf )] Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05022016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain completes acquisition of Recall Holdings Ltd "
    },
    {
        "content": "* Maintaining full year 2016 preliminary guidance with recall provided on april 1  2016 - sec filing",
        "date": "04282016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain qtrly adjusted earnings per share $0.33 "
    },
    {
        "content": "* Iron mountain announces Australian court approval of Recall acquisition",
        "date": "04212016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain: Australian court approves Recall acquisition "
    },
    {
        "content": "* Iron Mountain enters African market with purchase of controlling interest in Docufile South Africa",
        "date": "04212016",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "BRIEF-Iron Mountain purchases 75 pct of Docufile South Africa "
    },
    {
        "content": "* Says Recall shareholders approve proposed acquisition of Recall by Iron Mountain",
        "date": "04192016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "BRIEF-Recall shareholders approve proposed acquisition by Iron Mountain "
    },
    {
        "content": "The U.S. Department of Justice said records management company Iron Mountain Inc  would have to divest some of its assets to get U.S. antitrust approval for its acquisition of Australian rival Recall Holdings Ltd .",
        "date": "03312016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "DoJ says Iron Mountain must divest assets to buy Recall Holdings "
    },
    {
        "content": "March 31 The U.S. Department of Justice said records management company Iron Mountain Inc would have to divest some of its assets to get U.S. antitrust approval for its acquisition of Australian rival Recall Holdings Ltd .",
        "date": "03312016",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "UPDATE 2-DoJ says Iron Mountain must divest assets to buy Recall Holdings "
    },
    {
        "content": "* Iron mountain to sell records management assets in six major cities to resolve competition concerns following its acquisition of recall",
        "date": "03312016",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "BRIEF-Competition Bureau reaches consent agreement with Iron Mountain Inc "
    },
    {
        "content": "WASHINGTON  March 31 The U.S. Department of Justice on Thursday said it will require data management firm Iron Mountain Inc to divest its records management assets as a condition for acquiring its Australian rival Recall Holdings Ltd.",
        "date": "03312016",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "U.S. says Iron Mountain must divest assets to acquire Recall Holdings "
    },
    {
        "content": "SYDNEY U.S. data management company Iron Mountain Inc  will sell its Australian unit to ease regulatory concerns hampering its A$2.7 billion ($2 billion) buyout of Sydney-listed rival Recall Holdings Ltd   a regulator said.",
        "date": "03102016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "U.S.-based Iron Mountain to sell Australian assets for acquisition: regulator "
    },
    {
        "content": "March 9 March 9 Iron Mountain Inc  :  * Announces proposed undertaking with ACCC in connection with Recall transaction  * Says ACCC begin limited market testing of proposed divestment  * Says company continues to expect transaction to close in second quarter of",
        "date": "03092016",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "CORRECTED-BRIEF-Iron Mountain announces proposed undertaking with ACCC about Recall deal "
    },
    {
        "content": "SYDNEY  March 10 U.S. data management company Iron Mountain Inc will sell its Australian unit to ease regulatory concerns hampering its A$2.7 billion ($2 billion) buyout of Sydney-listed rival Recall Holdings Ltd  a regulator said.",
        "date": "03102016",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "U.S.-based Iron Mountain to sell Australian assets for acquisition - regulator "
    },
    {
        "content": "SYDNEY  Nov 5 Australia's competition regulator said an agreed A$2.7 billion ($1.9 billion) buyout of data management firm Recall Holdings Ltd by U.S. rival Iron Mountain Inc may hurt competition  drive up prices and lower customer service.",
        "date": "11042015",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "Australian watchdog casts doubt over Recall takeover "
    },
    {
        "content": "Australia-listed data protection services provider Recall Holdings Ltd  is seeking to renegotiate a $2.2 billion deal to be acquired by document and data storage services company Iron Mountain Inc   according to people familiar with the matter.",
        "date": "06042015",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "Exclusive: Recall Holdings seeks to renegotiate Iron Mountain deal - sources "
    },
    {
        "content": "April 28 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04282015",
        "name": "Iron Mountain Incorporated",
        "news_type": "topStory",
        "symbol": "IRM",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Document and data storage services company Iron Mountain Inc  said it will buy Australia-listed data protection services provider Recall Holdings Ltd  for about $2.2 billion in cash and stock.",
        "date": "04282015",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "Iron Mountain to buy Recall Holdings for about $2.2 billion "
    },
    {
        "content": "April 28 Document and data storage services company Iron Mountain Inc said it will buy Australia-listed data protection services provider Recall Holdings Ltd for about $2.2 billion in cash and stock.",
        "date": "04282015",
        "name": "Iron Mountain Incorporated",
        "news_type": "normal",
        "symbol": "IRM",
        "title": "Iron Mountain to buy Recall Holdings for about $2.2 bln "
    }
]