[
    {
        "content": "* Gartner to explore strategic alternatives for CEB talent assessment business",
        "date": "10042017",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "BRIEF-Gartner to explore strategic alternatives for CEB talent assessment business "
    },
    {
        "content": "* Q2 revenue $843.7 million versus I/B/E/S view $903.2 million",
        "date": "08082017",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "BRIEF-Gartner reports Q2 adjusted earnings per share $0.88 "
    },
    {
        "content": "* Gartner Inc says co and its subsidiaries entered into an agreement to amended existing credit facility dated as of June 17  2016  - SEC filing",
        "date": "04062017",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "BRIEF-Gartner Inc says Co and its subsidiaries entered into an agreement to amended existing credit facility "
    },
    {
        "content": "* Merger transaction with Gartner was approved with approximately 87.94 percent of shares outstanding cast in favor of proposal",
        "date": "04042017",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "BRIEF-CEB shareholders approve merger with Gartner "
    },
    {
        "content": "* Has entered into an agreement to acquire L2 Inc - SEC filing",
        "date": "03062017",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "BRIEF-Gartner enters into an agreement to acquire L2 Inc "
    },
    {
        "content": "* GARTNER - CO AND ITS UNITS ENTERED INTO AGREEMENT AMONG GARTNER  OTHER LOAN PARTIES PARTY THERETO  LENDERS PARTY THERETO AND JPMORGAN CHASE BANK  N.A.",
        "date": "01242017",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "BRIEF-GARTNER ENTERS INTO AGREEMENT TO AMEND ITS EXISTING CREDIT FACILITY  DATED AS OF JUNE 17  2016 "
    },
    {
        "content": "IT research and advisory company Gartner Inc  said on Thursday it would buy CEB Inc   a provider of business research and analysis  in a cash-and-stock deal valued at $2.6 billion to expand its business services.",
        "date": "01052017",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "IT research firm Gartner to buy CEB to expand business analysis "
    },
    {
        "content": "* Worldwide pc shipments totaled 68.9 million units in q3 of 2016  a 5.7 percent decline from q3 of 2015",
        "date": "10112016",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "BRIEF-Gartner- Worldwide PC shipments declined 5.7 pct decline in Q3 "
    },
    {
        "content": "* Q1 earnings per share view $0.44 -- Thomson Reuters I/B/E/S",
        "date": "05052016",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "BRIEF-Gartner posts Q1 earnings per share $0.48 "
    },
    {
        "content": "April 20 U.S. chipmaker Qualcomm Inc  forecast third-quarter profit below analysts estimates as it expects to ship fewer chips  including those for smartphones  its biggest business.",
        "date": "04202016",
        "name": "Gartner Inc",
        "news_type": "normal",
        "symbol": "IT",
        "title": "UPDATE 2-Qualcomm profit forecast misses estimates as chip shipments drop "
    },
    {
        "content": "* Specialist firms like Melexis  AMS could be targets-analysts",
        "date": "12042015",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "Chipmakers look to autos for demand  deals and disruption "
    },
    {
        "content": "Research firm Gartner Inc said worldwide shipments of personal computers fell 7.7 percent to 73.7 million units in the third quarter as a stronger dollar made them costlier.",
        "date": "10082015",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "PC shipments fall 7.7 percent in third quarter: Gartner "
    },
    {
        "content": "Oct 8 Research firm Gartner Inc said worldwide shipments of personal computers fell 7.7 percent to 73.7 million units in the third quarter as a stronger dollar made them costlier.",
        "date": "10082015",
        "name": "Gartner Inc",
        "news_type": "normal",
        "symbol": "IT",
        "title": "UPDATE 1-PC shipments fall 7.7 pct in third quarter - Gartner "
    },
    {
        "content": "July 7 Research firm Gartner Inc said worldwide shipment of devices such as PCs  tablets and smartphones is expected to grow by 1.5 percent to 2.5 billion units this year  slower than the 2.8 percent it forecast earlier.",
        "date": "07072015",
        "name": "Gartner Inc",
        "news_type": "normal",
        "symbol": "IT",
        "title": "Gartner cuts worldwide device shipment growth forecast for 2015 "
    },
    {
        "content": "May 21 Market research firm Gartner Inc  estimated 7.3 million Chromebooks would be sold this year  helped mainly by demand from the education industry.",
        "date": "05212015",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "Worldwide Chromebook sales set to reach 7.3 mln units in 2015- Gartner "
    },
    {
        "content": "LONDON  April 9 Worldwide IT spending will shrink 1.3 percent this year to $3.66 trillion as the strength of the U.S. dollar more than wipes out a rise in underlying demand  Gartner said on Thursday.",
        "date": "04092015",
        "name": "Gartner Inc",
        "news_type": "topStory",
        "symbol": "IT",
        "title": "Worldwide IT spending squeezed by strength of dollar-Gartner "
    }
]