[
    {
        "content": "SAO PAULO  Oct 31 Itaú Unibanco Holding SA   Brazil's largest private lender  may further cut loan-loss provisions as the economy recovers and revives credit growth  the bank's chief executive officer said on Tuesday.",
        "date": "10312017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Brazil's Itaú may cut provisions  boost loan book as economy recovers "
    },
    {
        "content": "SAO PAULO  Oct 31 Brazilian lender Itaú Unibanco Holding SA may further cut loan-loss provisions as the economy recovers  potentially offseting the effect of lower interest rates on its loan book  the bank's chief executive officer said on Tuesday.",
        "date": "10312017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú may further cut provisions as economy picks up -CEO "
    },
    {
        "content": "SAO PAULO  Oct 30 Brazil's largest bank  Itau Unibanco Holding SA  posted a 6.25 billion reais ($1.9 billion) profit on the third quarter as it managed to improve loan book quality  offsetting the reduction of net interest income.",
        "date": "10312017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "UPDATE 1-Brazil's Itaú reduces loan provisions  posts higher profit "
    },
    {
        "content": "SAO PAULO  Oct 30 Itau Unibanco Holding SA   Brazil's largest private bank  posted a 6.25 billion reais ($1.9 billion) profit in the third quarter  slightly beating analyst expectations as Brazil's economic recovery allowed the reduction of provisions for credit losses.",
        "date": "10302017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú reduces loss provisions  slightly beats estimates "
    },
    {
        "content": "BRASILIA  Oct 26 Itaú Unibanco Holding SA said on Thursday it has received final central bank approval to buy Citigroup's retail banking unit in Brazil and the deal will be competed by Oct. 31.",
        "date": "10262017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itau Unibanco secures final approval to buy Citigroup retail banking in Brazil "
    },
    {
        "content": "BRASILIA/SAO PAULO  Oct 20 BK Brasil Operação e Assessoria a Restaurantes SA  operator of the Burger King fast-food chain in Brazil  will list an undisclosed amount of new shares on the country's stock exchange  the latest in a year-long wave of initial public offerings.",
        "date": "10202017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "UPDATE 1-Burger King operator BK Brasil files for IPO in wave of listings "
    },
    {
        "content": "SAO PAULO  Oct 16 A unit of Brazil's antitrust watchdog Cade said Itaú Unibanco Holding SA's purchase of a 49 percent stake in independent financial services firm XP Investimentos SA involves a series of complex aspects relating to competition that demand further analysis of the transaction.",
        "date": "10162017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Unit of Brazil antitrust watchdog sees Itaú-XP deal as 'complex' "
    },
    {
        "content": "SAO PAULO  Oct 16 Brazilian bank Itaú Unibanco Holding SA's purchase of a minority stake in independent financial services firm XP Investimentos SA is complex due to competition concerns and needs further analysis  a unit of antitrust watchdog Cade said.",
        "date": "10162017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "UPDATE 1-Unit of Brazil antitrust watchdog sees Itaú-XP deal as 'complex' "
    },
    {
        "content": "SAO PAULO  Oct 6 Itaú Unibanco Holding SA   Brazil's No. 1 bank  has named Alexsandro Broedel Lopes as its new head of investors relations.",
        "date": "10062017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú taps Lopes as head of investor relations "
    },
    {
        "content": "* Itau Unibanco Holding SA says Board approved at meeting on Sept 28 increasing number of seats at Board of Executive Officers to 25 - SEC filing Source text for Eikon: [ID:http://bit.ly/2fwjudL] Further company coverage:",
        "date": "09292017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "BRIEF-Itau Unibanco says Board approved increasing number of seats at Board of Executive Officers to 25 "
    },
    {
        "content": "SAO PAULO  Sept 26 Itaú Unibanco Holding SA's lending segment will soon turn profitable again as loan-loss provisions decline  Chief Executive Officer Cândido Bracher said on Tuesday  a sign Brazil's No. 1 lender has detached itself from the nation's harshest credit market downturn in decades.",
        "date": "09262017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Itaú sees lending soon returning to profit  provisions falling "
    },
    {
        "content": "SAO PAULO  Sept 26 Itaú Unibanco Holding SA's lending segment will soon turn profitable again  Chief Executive Officer Cândido Bracher said on Tuesday  a sign Brazil's No. 1 lender has detached itself from the nation's harshest credit market downturn in two decades.",
        "date": "09262017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú sees lending soon returning to profit  provisions falling "
    },
    {
        "content": "SAO PAULO  Aug 31 The board of Itaú Unibanco Holding SA  Brazil's largest private bank  approved a new share buyback program  the company said in a securities filing on Thursday.",
        "date": "09012017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú Unibanco board approves new share buyback plan - filing "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  August 29 (Fitch) Fitch Ratings has affirmed the ratings for Itau Unibanco Holding S.A. (IUH) and its subsidiary  Itau Unibanco S.A.  including the Long-Term Foreign and Local Currency Issuer Default Ratings (IDRs) at 'BB+'. The Rating Outlook is Negative. See the full list of rating actions at the end of this release. KEY RATING DRIVERS VR  IDRS  AND SENIOR DEBT The bank's IDRs and senior debt ratings are driven by the bank's",
        "date": "08292017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Fitch Affirms Itau Unibanco Holding S.A.'s Ratings; Outlook Negative "
    },
    {
        "content": "BRASILIA  Aug 16 Brazil's antitrust authority Cade said on Wednesday that it approved Itaú Unibanco Holding's acquisition of Citigroup's retail banking and insurance assets in the country.",
        "date": "08162017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Brazil approves Itaú Unibanco's acquisition of Citigroup retail banking assets "
    },
    {
        "content": "BRASILIA  Aug 16 Brazil's antitrust authority Cade approved on Wednesday Itaú Unibanco Holding's acquisition of Citigroup's retail banking and insurance assets in the country  conditioned on a merger concentration agreement to be signed between the parties.",
        "date": "08162017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil approves Itaú Unibanco acquisition of Citigroup retail assets "
    },
    {
        "content": "SAO PAULO  Aug 1 Itaú Unibanco Holding SA's lending segment could turn profitable again in coming months  Chief Executive Officer Cândido Bracher said on Tuesday  a sign Brazil's No. 1 lender has detached itself from the nation's harshest credit market downturn in two decades.",
        "date": "08012017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 3-Lending at Itaú seen returning to profitability soon "
    },
    {
        "content": "SAO PAULO  Aug 1 The profitability of Itaú Unibanco Holding SA's lending segment could top fundraising costs in coming quarters  Chief Executive Officer Cândido Bracher said on Tuesday  a sign Brazil's No. 1 lender is gradually detaching itself from the nation's longest credit market downturn in two decades.",
        "date": "08012017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú's credit ROE may surpass cost of capital  CEO says "
    },
    {
        "content": "SAO PAULO Itaú Unibanco Holding SA could book slightly higher loan-loss provisions this year despite declining corporate and consumer defaults  in the wake of a decision by Brazil's biggest bank to broaden the way it classifies credit impairments.",
        "date": "07312017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú could book higher provisions despite lower defaults "
    },
    {
        "content": "SAO PAULO  July 31 Itaú Unibanco Holding SA could book slightly higher loan-loss provisions this year despite declining corporate and consumer defaults  in the wake of a decision by Brazil's biggest bank to broaden the way it classifies credit impairments.",
        "date": "07312017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "UPDATE 1-Itaú could book higher provisions despite lower defaults "
    },
    {
        "content": "SAO PAULO  July 31 Second-quarter profit at Itaú Unibanco Holding SA beat expectations  as Brazil's largest bank by assets cut provisions amid declining corporate defaults and smaller bad loan writedowns.",
        "date": "07312017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "RPT-Brazil's Itaú beats profit estimates as provisions drop "
    },
    {
        "content": "SAO PAULO  July 31 Itaú Unibanco Holding SA   Brazil's largest non-government bank  announced on Monday the following operating estimates for this year: * Itaú maintained a projection for consolidated loan book growth this year between zero and 4 percent  first issued in February. The number compares with a contraction of 11 percent in 2016. * Itaú revised guidance for interest income growth to minus 4.2 percent to minus 0.8 percent from February's target between minus 4 percent and ",
        "date": "07312017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú revises loan-loss provision guidance  methodology "
    },
    {
        "content": "SAO PAULO  July 31 Second-quarter profit at Itaú Unibanco Holding SA beat expectations  as Brazil's largest bank by assets cut provisions amid declining corporate defaults and smaller bad loan writedowns.",
        "date": "07312017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú beats profit estimates as provisions drop "
    },
    {
        "content": "SAO PAULO  July 12 A unit of Brazil's antitrust watchdog Cade backs Itaú Unibanco Holding SA's planned purchase of Citigroup Inc's retail banking assets in the country  tied to a series of self-imposed limits aimed at preserving competition.",
        "date": "07122017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil watchdog unit backs Itaú's Citibank Brasil deal under conditions "
    },
    {
        "content": "SAO PAULO/PARIS  June 28 French retailer Carrefour SA's Brazilian unit has filed for an initial public offering that could raise 4.5 billion to 5.6 billion reais ($1.4 billion to $1.7 billion) next month  making it Brazil's biggest listing in over four years.",
        "date": "06282017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "UPDATE 1-Carrefour's Brazil unit seeks up to $1.7 bln in IPO "
    },
    {
        "content": "SAO PAULO  June 24 Brazilian lawmakers need to urgently pass a revamping of the country's outdated labor code in order to mitigate extra costs for companies and consumers  the co-chairman of Brazil's largest bank said on Saturday.",
        "date": "06242017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Itaú's Setubal urges passage of Brazil labor reform "
    },
    {
        "content": "SAO PAULO  June 21 Itaú Unibanco Holding SA  Latin America's largest bank by assets  has decided not to make a binding offer to acquire control of Argentine lender Banco Patagonia SA.",
        "date": "06212017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú drops out of bidding for Argentina's Patagonia "
    },
    {
        "content": "SAO PAULO  June 24 The price that Itaú Unibanco Holding SA paid for a minority stake in Brazilian independent securities firm XP Investimentos SA embeds \"very high growth rates\" ahead  co-Chairman Roberto Setubal said on Saturday.",
        "date": "06242017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú's Setubal sees high growth at Brazil's XP "
    },
    {
        "content": "SAO PAULO  June 14 Itaú Unibanco Holding SA   Brazil's largest lender by market value  said on Wednesday it had formed a credit intelligence venture with Banco Bradesco SA  Banco Santander  Banco do Brasil and Caixa Economica Federal.",
        "date": "06142017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itau forms credit intelligence venture with four other banks "
    },
    {
        "content": "SAO PAULO  June 12 Itaú Unibanco Holding SA has canceled a depositary receipts program in Argentina  focusing trading of the bank's shares in Brazil and the United States.",
        "date": "06122017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú cancels depositary receipts program in Argentina "
    },
    {
        "content": "* Itau Corpbanca files for potential mixed shelf  size not disclosed - sec filing Source text for Eikon: Further company coverage:",
        "date": "06012017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "BRIEF-Itau Corpbanca files for potential mixed shelf "
    },
    {
        "content": "SAO PAULO  May 12 Itaú Unibanco Holding SA  Brazil's largest bank  will boost its market share in asset management and fee income over the next years through the acquisition of a stake in online broker XP Investimentos  Chief Executive Officer Candido Bracher said on Friday.",
        "date": "05122017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú to raise market share in asset management with XP deal -CEO "
    },
    {
        "content": "SAO PAULO  May 11 Itaú Unibanco Holding SA   Brazil's largest bank  has agreed to acquire a 49.9 percent stake in brokerage firm XP Investimentos SA for 6.3 billion reais ($2 billion) and gradually increase its stake with an option to buy full control.",
        "date": "05122017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "UPDATE 1-Brazil's Itaú buys 49.9 pct in XP for $2 bln "
    },
    {
        "content": "SAO PAULO  May 11 Itaú Unibanco Holding SA said it is still in talks to acquire a stake in Brazilian broker XP Investimentos SA  adding that no definitive agreement has been signed.",
        "date": "05112017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú says did not sign agreement yet to buy stake in XP "
    },
    {
        "content": "SAO PAULO  May 10 Brokerage firm XP Investimentos SA  which is discussing a minority stake sale to Brazil's largest bank  is filing for an initial public offering that could be the first listing of an independent broker in Latin America's largest economy.",
        "date": "05102017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Brazil's XP files for IPO amid talks to sell stake to Itaú "
    },
    {
        "content": "SAO PAULO  May 10 Itaú Unibanco Holding SA   Brazil's largest private lender  said on Wednesday it was in talks to acquire a minority stake in online securities brokerage XP Holding Investimentos SA  which is preparing an initial public offering.",
        "date": "05102017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "UPDATE 1-Brazil's Itaú says in talks for stake in online broker XP Holding "
    },
    {
        "content": "SAO PAULO  May 10 Itaú Unibanco Holding SA  Brazil's largest private lender  confirmed on Wednesday it is discussing acquiring a minority stake in securities firm XP Holding Investimentos SA.",
        "date": "05102017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú confirms talks for minority stake in broker XP "
    },
    {
        "content": "SAO PAULO Itaú Unibanco Holding SA  Brazil's largest private lender  has offered 6 billion reais ($1.9 billion) for a minority stake in securities firm XP Holding Investimentos SA  Brazilian magazine Exame reported on its website on Tuesday.",
        "date": "05102017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú bids six billion reais for stake in broker XP: magazine "
    },
    {
        "content": "SAO PAULO  May 4 Itaú Unibanco Holding SA will probably meet operational targets for this year even if uncertainty over an economic and credit market recovery in Brazil persists  Chief Executive Officer Candido Bracher said on Thursday.",
        "date": "05042017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Itaú's Bracher sees guidance feasible as Brazil risks linger "
    },
    {
        "content": "SAO PAULO  May 9 Itaú Unibanco Holding SA  Brazil's largest private lender  has offered 6 billion reais ($1.9 billion) for a minority stake in securities firm XP Holding Investimentos SA  Brazilian magazine Exame reported on its website on Tuesday.",
        "date": "05102017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú bids 6 billion reais for stake in broker XP -magazine "
    },
    {
        "content": "SAO PAULO  May 4 Itaú Unibanco Holding SA will be able to meet operational targets for this year  as a gradual pickup in demand for certain types of credit and an economic recovery are expected to offset potential loan-loss cases  Chief Executive Officer Candido Bracher said on Thursday.",
        "date": "05042017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Meeting Itaú's annual guidance looks feasible  CEO says "
    },
    {
        "content": "SAO PAULO  May 3 Brazil's No. 1 bank Itaú Unibanco Holding SA will monitor problematic loans among large corporate borrowers  a sign of caution as an unprecedented credit downturn magnifies a deep  recession and the impact of a broad corruption scandal.",
        "date": "05032017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 3-Itaú to monitor complex Brazil loan cases as risk lingers "
    },
    {
        "content": "SAO PAULO  May 3 Itaú Unibanco Holding SA will continue to monitor the behavior of loans to large infrastructure companies in Brazil that have been severely affected by a three-year recession  a senior executive said on Wednesday.",
        "date": "05032017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú watching trends in riskier Brazil infrastructure loans "
    },
    {
        "content": "SAO PAULO  May 3 Itaú Unibanco Holding SA beat first-quarter profit estimates on Wednesday  benefiting from stricter cost and credit risk controls which allowed Brazil's biggest bank by market value to trim operational expenses and loan-loss provisions.",
        "date": "05032017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú beats profit forecasts as expenses fall "
    },
    {
        "content": "SAO PAULO  April 18 The Brazilian central bank should intervene less in the foreign exchange currency market than it has done in recent years  the outgoing chief executive of the country's largest bank said on Tuesday.",
        "date": "04182017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú's Setubal says Brazil should intervene less in currency "
    },
    {
        "content": "SAO PAULO  March 13 Grupo Schahin said on Monday it can execute a reorganization plan after an appeals court favored the ailing Brazilian engineering and rig-leasing conglomerate over disgruntled creditors  according to a statement.",
        "date": "03132017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Grupo Schahin defeats Itaú challenge to debt plan "
    },
    {
        "content": "RIO DE JANEIRO  March 18 Itau Unibanco Holding SA",
        "date": "03182017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "BRIEF-Brazil's Itau Unibanco announces changes to board "
    },
    {
        "content": "SAO PAULO  March 8 Itaú Unibanco Holding SA  will cut the interest rate it charges on rollover credit card loans as Brazil's No. 1 lender seeks to comply with new rules to reduce the cost of borrowing for cash-strapped consumers and companies in Latin America's largest economy.",
        "date": "03082017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 2-Itaú cuts rollover card rates amid Brazil pressure "
    },
    {
        "content": "SAO PAULO  March 8 Itaú Unibanco Holding SA  will rework the interest rate it charges in rollover credit card loans as Brazil's No. 1 lender seeks to comply with new rules to reduce the cost of credit card borrowing for cash-strapped consumers and companies in Latin America's largest economy.",
        "date": "03082017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú cuts rollover card rates amid Brazil pressure "
    },
    {
        "content": "SAO PAULO  Feb 8 Itaú Unibanco Holding SA expects to maintain a new policy of distributing between 35 percent and 45 percent of annual profit \"for a few years \" Chief Executive Officer Roberto Setubal said on Wednesday  a sign Brazil's No. 1 bank by market value has enough capital buffer to keep rewarding shareholders.",
        "date": "02082017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú's Setubal sees new payout policy 'maintained for years' "
    },
    {
        "content": "SAO PAULO  Feb 7 Itaú Unibanco Holding SA  expects to cut loan-loss provisions by at least one-quarter this year  underscoring the ability of Brazil's No. 1 bank by market value to keep defaults and costs in check despite a challenging economic outlook.",
        "date": "02072017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 3-Brazil's Itaú sees lower provisions after robust profit beat "
    },
    {
        "content": "SAO PAULO  Feb 7 Loan-loss provisions at Itaú Unibanco Holding SA related to corporate borrowers ensnared in Brazil's worst corruption scandal are at adequate levels  Chief Executive Officer Roberto Egydio Setubal said on Tuesday.",
        "date": "02072017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú sees Car Wash probe-related provisions at 'adequate' levels "
    },
    {
        "content": "SAO PAULO  Feb 7 Itaú Unibanco Holding SA   Brazil's largest non-government bank  announced on Tuesday the following operating estimates for this year:",
        "date": "02072017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú sees sharp provision drop  scant loan book growth "
    },
    {
        "content": "SAO PAULO  Feb 7 Itaú Unibanco Holding SA  beat fourth-quarter profit estimates on Tuesday as declining loan defaults and stronger interest and fee income allowed Brazil's No. 1 bank by market value to trim loan-loss provisions.",
        "date": "02072017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú beats profit estimates as provisions fall "
    },
    {
        "content": "SAO PAULO  Jan 20 Itaú Unibanco Holdings SA   Brazil's largest private sector lender  said on Friday it has reached an agreement to postpone to January 2022 the acquisition of shares of Colombia's CorpBanca.",
        "date": "01202017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú Unibanco postpones acquisition of Colombia's CorpBanca "
    },
    {
        "content": "SAO PAULO  Jan 6 Companies in Brazil announced $54.308 billion worth of mergers and acquisitions in 2016  up 23 percent from a year earlier  a Thomson Reuters report showed on Friday  but the number of deals fell to 578 from 676 in 2015  the biggest drop in three years.     The following tables show the ranking of the top 10 M&A advisers in Brazil last year  by the value and number of deals. For a story on dealmaking trends for 2017  click.             RANKING VALUE  INCLUDING NET DE",
        "date": "01062017",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "TABLE-Santander Brasil  Itaú top Brazil's M&A rankings last year "
    },
    {
        "content": "SAO PAULO Brazil's largest private bank  Itaú Unibanco Holding SA has completed the acquisition of 40 percent of Banco Itaú BMG Consignado SA  specialized in payroll loans  for 1.46 billion reais ($445 million)  the bank said in a securities filing on Wednesday.",
        "date": "12282016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú Unibanco buys 40 percent of Banco Itaú BMG for 1.46 billion reais "
    },
    {
        "content": "SAO PAULO Brazil's federal police on Thursday launched a raid targeting Itaú Unibanco Holding SA as part of a probe into alleged bribery of tax officials  a source briefed on the matter said.",
        "date": "12012016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil targets Itaú in new tax probe phase  source says "
    },
    {
        "content": "SAO PAULO  Nov 28 Unidas SA and shareholders have filed for an initial public offering  just a month after Enterprise Holdings Inc agreed to buy a 20 percent stake in the Brazilian car rental firm.",
        "date": "11282016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil car rental firm Unidas files for IPO  hires banks "
    },
    {
        "content": "* Brazil's Itau Unibanco says Corpbanca likely to have relevant impact in Itaú's earnings from 2018 - Chief Executive Officer Roberto Setubal",
        "date": "11172016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "BRIEF-Itau Unibanco says provisions for defaults to drop in 2017 "
    },
    {
        "content": "SAO PAULO  Nov 11 Itaú Unibanco Holding SA  on Friday appointed Christian Egan  currently deputy head of corporate and investment banking  to run a new  bigger global markets and Treasury desk unit as part of a broad management reshuffle  sources said.",
        "date": "11112016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 2-Brazil's Itaú taps banker Egan to run Treasury desk - sources "
    },
    {
        "content": "SAO PAULO The Brazilian government could pay as much as $16 billion to state-controlled oil company Petróleo Brasileiro SA in renegotiating a $43 billion deal in 2010 to develop vast offshore crude deposits  Itaú BBA said on Monday.",
        "date": "11072016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil could pay Petrobras up to $16 billion over rights  Itaú BBA says "
    },
    {
        "content": "SAO PAULO Itaú Unibanco Holding SA appointed Cândido Botelho Bracher to replace Chief Executive Officer Roberto Egydio Setubal when his term expires in April  wrapping up a four-year succession plan at Brazil's largest bank by market value.",
        "date": "11092016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú names Bracher CEO as Setubal's 23-year stint nears end "
    },
    {
        "content": "SAO PAULO  Nov 11 Itaú Unibanco Holding SA has appointed Christian Egan  currently deputy head of corporate and investment banking  to run a new  bigger global markets and Treasury desk unit as part of a broad management reshuffle.",
        "date": "11112016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú taps banker Egan to run Treasury desk - sources "
    },
    {
        "content": "SAO PAULO  Nov 9 Itaú Unibanco Holding SA appointed Cândido Botelho Bracher to replace Chief Executive Officer Roberto Egydio Setubal when his term expires in April  wrapping up a four-year succession plan at Brazil's largest bank by market value.",
        "date": "11092016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "UPDATE 3-Brazil's Itaú names Bracher CEO as Setubal's 23-year stint nears end "
    },
    {
        "content": "* Itau Unibanco  Brazil's largest private lender  announces new CEO and executive committee in securities filing",
        "date": "11092016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "BRIEF-Brazil's Itau Unibanco announces new CEO and executive committee "
    },
    {
        "content": "SAO PAULO  Nov 9 Itaú Unibanco Holding SA plans to appoint Cândido Bracher as the successor for Chief Executive Officer Roberto Egydio Setubal  whose term ends in coming months  an O Estado de S. Paulo newspaper columnist said on Wednesday.",
        "date": "11092016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Bracher to succeed Setubal as Brazil's Itaú CEO -newspaper columnist "
    },
    {
        "content": "SAO PAULO  Nov 1 Itaú Unibanco Holding SA plans to focus on less-risky loan segments even if an economic recovery in Brazil soon gains steam  Chief Financial Officer Eduardo Vassimon said on Tuesday  signaling prudence as banks struggle with the worst credit downturn in two decades.",
        "date": "11012016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 2-Itaú to focus on less-risky loans even if Brazil recovery firms "
    },
    {
        "content": "SAO PAULO  Oct 31 Shares in Itaú Unibanco Holding SA hit an all-time high on Monday  after stronger-than-expected third-quarter results at Brazil's No. 1 bank by market value suggested a two-year credit market downturn might be finally easing.",
        "date": "10312016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 4-Itaú soars as profit beat signals Brazil credit rout easing "
    },
    {
        "content": "SAO PAULO  Nov 1 Itaú Unibanco Holding SA will maintain focus on the least risky credit segments even if a recovery in the Brazilian economy firms in coming months  Chief Financial Officer Eduardo Vassimon said  signaling prudence as banks wrestle with the nation's harshest credit downturn in two decades.",
        "date": "11012016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú to focus on less risky credit even if Brazil recovery firms "
    },
    {
        "content": "SAO PAULO  Oct 31 Lower lending rates in Brazil will depend more on whether delinquency risks among borrowers decrease than any other reason  a senior executive at Itaú Unibanco Holding SA said on Monday  underscoring reluctance to grow disbursements until Latin America's No. 1 economy sheds stronger recovery signs.",
        "date": "10312016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú sees lower Brazil spreads hinging on improving risk perception "
    },
    {
        "content": "By Bruno Federowski     SAO PAULO  Oct 31 Brazilian stocks rose on Monday after third-quarter profit at Itaú Unibanco Holding SA  Latin America's largest bank by market value  came in well above analysts' expectations.     Preferred shares of Itaú Unibanco jumped as much as 4.6 percent to a record high at 38.84 reais in early trading after interest and fee income increased and provisions fell.       Shares of planemaker Embraer SA were up for the fifth straight day and near their hig",
        "date": "10312016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "EMERGING MARKETS-Brazil stocks rise on Itaú profit beat; real stronger "
    },
    {
        "content": "SAO PAULO  Oct 31 Itaú Unibanco Holding SA  Latin America's largest bank by market value  beat third-quarter profit estimates on Monday after interest and fee income rose above expectations and loan-loss provisions declined slightly.",
        "date": "10312016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú beats estimates as interest  fee income jump; provisions slip "
    },
    {
        "content": "SAO PAULO  Oct 8 Itaú Unibanco Holding SA agreed on Saturday to pay 710 million reais ($220 million) for the retail banking assets of Citigroup Inc in Brazil  further cementing the leadership of Latin America's No. 1 bank by market value among wealthy clients in the country.",
        "date": "10082016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú to pay $220 mln for Citigroup's Brazil retail banking assets "
    },
    {
        "content": "SAO PAULO  Sept 29 Itaú Unibanco Holding SA agreed on Thursday to buy Banco BMG SA's 40 percent stake in a payroll credit joint venture for 1.28 billion reais ($393 million)  confirming the dominance of Brazil's most profitable lender in secured consumer lending.",
        "date": "09302016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú to buy partner BMG's stake in payroll credit venture "
    },
    {
        "content": "SAO PAULO Brazilian lender Itau Unibanco Holding SA  has secured exclusive rights to negotiate an acquisition of Citigroup Inc's  retail banking operation in Brazil  according to a newspaper report on Wednesday.",
        "date": "09212016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itau in exclusive talks for Citi's Brazil unit: report "
    },
    {
        "content": "SAO PAULO  Sept 21 Brazilian lender Itau Unibanco Holding SA has secured exclusive rights to negotiate an acquisition of Citigroup Inc's retail banking operation in Brazil  according to a newspaper report on Wednesday.",
        "date": "09212016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itau in exclusive talks for Citi's Brazil unit -report "
    },
    {
        "content": "SAO PAULO  Sept 19 Brazilian lender Itaú Unibanco SA agreed to sell its group life insurance operations to Prudential do Brasil Seguros de Vida SA  the bank said in a securities filing on Monday  without disclosing a price for the transaction.",
        "date": "09192016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú agrees to sell group life insurance unit to Prudential "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 01 (Fitch) Fitch Ratings has affirmed the ratings for Itau  Unibanco Holding S.A. (IUH) and its subsidiary  Itau Unibanco S.A.  including  the  Long-Term Foreign and Local Currency IDRs at 'BB+'. The Rating Outlook is  Negative. A full list of rating actions follows at the end of this release. Click here to enter text. KEY RATING DRIVERS  VR  IDRs  NATIONAL RATINGS AND SENIOR DEBT The bank's IDRs  National and senior",
        "date": "09012016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Fitch Affirms Itau Unibanco Holding S.A's Ratings; Outlook Negative "
    },
    {
        "content": "* Former Itau banker joins buyside firm Noctua     * Mexico's Nafinsa to issue first local Green bond     * Colombia to prefund some of 2017 needs with local debt      By Paul Kilby and Anthony Rodriguez     NEW YORK  Aug 23 (IFR) - No deals priced in the LatAm primary market on Tuesday.           Here is a snapshot of LatAm sovereign spreads:       SOVEREIGN       8/22   8/19  8/18  1D   10D   YTD    2015/16 HIGH  ARGENTINA            448   432   428   16    -4    -          -  BARBADOS        ",
        "date": "08232016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "LATAM CLOSE-No deals price in LatAm primary market "
    },
    {
        "content": "SAO PAULO  Aug 12 Brazil's state-controlled banks  which have seen defaults and loan-loss provisions outpace those of rivals this year  are more confident than their private-sector competitors that Latin America's largest economy will soon emerge from a severe recession.",
        "date": "08122016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "WRAPUP 1-Brazil state banks assume bullish tone as recovery hopes take hold "
    },
    {
        "content": "SAO PAULO  Aug 11 Carlyle Group LP and Brazilian investor Guilherme Paulus raised a combined 1.230 billion reais ($394 million) from the partial sale of their stakes in Brazilian travel agency CVC Brasil Operadora SA  a sign investors are slowly returning to Latin America's largest equity market.",
        "date": "08112016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "UPDATE 1-Carlyle  founder raise $394 mln in partial exit from Brazil's CVC "
    },
    {
        "content": "* Said on Tuesday that its board of directors had approved complementary own capital interest of 0.399 Brazilian real  ($0.1226) per share (0.3392 real net)  to be paid on Aug. 25",
        "date": "08032016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "BRIEF-Itau announces own capital interest payment "
    },
    {
        "content": "SAO PAULO  Aug 1 Brazilian utility Companhia Energética de Minas Gerais SA the hired investment bank unit of Itau Unibanco Holding SA  Itau BBA  as adviser for its gas unit Gasmig  the company said in a securities filing on Monday.",
        "date": "08012016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Cemig hires Itau BBA for capitalization of Gasmig -filing "
    },
    {
        "content": "Aug 2 Itaú Unibanco Holding SA handily beat second-quarter profit estimates in a sign that efforts to curb expenses and reclassify problem loans will buffer profitability  sending shares higher on Tuesday.",
        "date": "08022016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 3-Itaú profit tops view  sees small rise in provisions; shares jump "
    },
    {
        "content": "Aug 2 Itaú Unibanco Holding SA has enough spare capital to deploy in new lending and expansion once an expected economic recovery in Brazil  the bank's main market  begins to take hold  a senior executive said on Tuesday.   (Reporting by Guillermo Parra-Bernal Editing by W Simon)",
        "date": "08022016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú's capital ratio ready when Brazil recovery takes off "
    },
    {
        "content": "Aug 2 Itaú Unibanco Holding SA  Brazil's largest non-government bank  announced on Tuesday revisions to several operating estimates for this year  including a substantial contraction in loans.",
        "date": "08022016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "UPDATE 1-Brazil's Itaú sees loan book shrinking  provisions up "
    },
    {
        "content": "Aug 2 Itaú Unibanco Holding SA  Brazil's largest non-government bank  announced on Tuesday revisions to several operating estimates for this year.",
        "date": "08022016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú sees loan book contracting  provisions up this year "
    },
    {
        "content": "Aug 2 Itaú Unibanco Holding SA  Latin America's largest bank by market value  beat second-quarter profit estimates by a large margin on Tuesday  after management reversed loan-loss provisions and fee income rose sharply.",
        "date": "08022016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú beats estimates as provisions fall  fee income jumps "
    },
    {
        "content": "SAO PAULO/BRASILIA Estácio Participações SA  said on Friday its board accepted an improved takeover bid from larger rival Kroton Educacional SA  worth 5.5 billion reais ($1.7 billion)  in a step toward ending a month-long battle for Brazil's No. 2 for-profit college operator.",
        "date": "07012016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Kroton close to clinching $1.7 billion deal for Estácio "
    },
    {
        "content": "SAO PAULO Itaú Unibanco Holding SA tapped Charles Ferraz to oversee asset management activities in the United States  a source familiar with the matter said on Tuesday  as Latin America's largest bank by market value looks to expand in the segment outside Brazil.",
        "date": "05242016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Exclusive: Itaú to appoint Ferraz as head of U.S.-based asset manager - source "
    },
    {
        "content": "* Announced on Monday that it would pay dividend of 0.015 Brazilian real ($0.0042) per share on July 1",
        "date": "05242016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "BRIEF-Itau Unibanco to pay monthly dividend for June "
    },
    {
        "content": "BRASILIA  May 17 Ilan Goldfajn  chief economist of Itau Unibanco Holding SA  will replace Alexandre Tombini as Brazil's central bank president  Globo TV reported on Tuesday minutes before an official announcement was expected to be made.",
        "date": "05172016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itau's Goldfajn to head Brazil's central bank - Globo "
    },
    {
        "content": "BRASILIA  May 16 Brazilian Finance Minister Henrique Meirelles will likely pick Itau Unibanco's chief economist  Ilan Goldfajn  to head the central bank in a bid to recover investors' confidence  an official familiar with the discussions told Reuters on Monday.",
        "date": "05162016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 3-Itau's Goldfajn likely pick for Brazil central bank head -source "
    },
    {
        "content": "* Itau Corpbanca announces first quarter 2016 financial report  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05132016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "BRIEF-Itau Corpbanca announces 2016 Q1 financial report "
    },
    {
        "content": "SAO PAULO The premium in the shares of Brazilian lender Itaú Unibanco Holding SA over smaller rival Banco Bradesco SA narrowed on Wednesday as investors fretted that Itaú faces a tougher time coping with a painful recession.",
        "date": "05042016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú loses ground to Bradesco as outlooks for Brazil banks diverge "
    },
    {
        "content": "SAO PAULO  May 4 Itaú Unibanco Holding SA sees early signs that consumer and corporate defaults in Brazil might have stopped worsening  even as the economy continues to face serious headwinds  executives at the lender said on Wednesday.",
        "date": "05042016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú sees signs that Brazil defaults have stopped worsening "
    },
    {
        "content": "SAO PAULO  May 3 Shares in Itaú Unibanco Holding SA tumbled the most in six weeks on Tuesday as Brazil's largest bank by market value missed first-quarter profit estimates  reflecting the burden of eroding loan book quality and surging loan-loss provisions.",
        "date": "05032016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 2-Itaú shares slump as soaring provisions spark profit miss "
    },
    {
        "content": "SAO PAULO  May 3 Itaú Unibanco Holding SA cut exposure to large corporate borrowers in the first quarter  as Brazil's largest bank by market value sought to mitigate the impact of the country's harsh recession and a sweeping corruption scandal on loan book quality.",
        "date": "05032016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú's exposure to 10 largest Brazil corporate borrowers falls "
    },
    {
        "content": "SAO PAULO  May 3 Itaú Unibanco Holding SA missed first-quarter profit estimates on Tuesday after rising defaults forced Brazil's most profitable bank to raise loan-loss provisions more than initially expected.",
        "date": "05032016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú misses profit estimates as provisions soar "
    },
    {
        "content": "SAO PAULO  April 7 Itaú Unibanco Holding SA  is interested in assets that Citigroup Inc has put up for sale in Latin America  as Brazil's largest bank by market value seeks opportunities to expand beyond its home turf  a senior executive said on Thursday.",
        "date": "04072016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Brazil's Itaú eyeing Citigroup's Latin America assets "
    },
    {
        "content": "SAO PAULO  April 7 Brazil's Itaú Unibanco   the country's largest private-sector bank  is interested in the assets Citigroup Inc. will sell in Latin America  said Itaú's vice-president for the region on Thursday.",
        "date": "04072016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú Unibanco says interested in Citi assets "
    },
    {
        "content": "SAO PAULO  March 16 Brazil's escalating political turmoil is dragging the economy through the mire  as the government looks unable to implement much-needed reforms to resuscitate activity  the head of the nation's biggest private-sector bank said late on Tuesday.",
        "date": "03162016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil turmoil dragging down economy  Itaú's Setubal says "
    },
    {
        "content": "SAO PAULO  March 3 Brazil's card payments market will likely grow in the low single digits this year  said the chief executive of Rede  the payment processing division of Brazilian lender Itau Unibanco Holding SA on Thursday.   (Reporting by Aluisio Alves)",
        "date": "03032016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil card payments likely to post meager growth in 2016 -Itau "
    },
    {
        "content": "SAO PAULO  Feb 5 Itaú Unibanco Holding SA   Brazil's largest private-sector bank  has for years traded at a premium to rival Banco Bradesco SA but many investors are betting the gap will narrow amid sharply diverging outlooks from the lenders.",
        "date": "02052016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Bradesco closes in on Itaú amid diverging Brazil outlook "
    },
    {
        "content": "SAO PAULO  Feb 3 Returns at Itaú Unibanco Holding SA will end the year slightly above the cost of capital  meaning that Brazil's No. 1 bank by market value will create value for shareholders even as the country grapples with a deep recession  Chief Executive Officer Roberto Setubal said on Wednesday.",
        "date": "02032016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Itaú sees ROE above cost of risk despite sharp profit drop "
    },
    {
        "content": "SAO PAULO  Feb 3 Itaú Unibanco Holding SA will generate return on equity slightly above the cost of capital this year  meaning that Brazil's largest bank by market value will keep creating value for shareholders even as the country grapples with a steep recession  Chief Executive Officer Roberto Setubal said.",
        "date": "02032016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú sees profitability slightly above cost of capital "
    },
    {
        "content": "SAO PAULO  Feb 2 Plans by Itaú Unibanco Holding SA  to boost loan-loss provisions faster than rivals this year drove its shares down sharply on Tuesday  as Brazil's deepest recession in more than a century and sluggish activity across Latin America bite hard.",
        "date": "02022016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 4-Itaú slumps as outlook for provisions points to hard year "
    },
    {
        "content": "SAO PAULO  Feb 2 Loan defaults at Itaú Unibanco Holding SA will continue to rise this year  though perhaps at a slower pace than in 2015  as a recession hampers consumers' and companies' ability to stay current on their debt  Chief Executive Officer Roberto Setubal said on Tuesday.",
        "date": "02022016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú sees defaults rising further this year "
    },
    {
        "content": "SAO PAULO  Feb 2 Itaú Unibanco Holding SA   Brazil's largest non-government bank  announced on Tuesday the following operating estimates for this year:  1) Itaú's consolidated loan book  which includes guarantees and corporate debt holdings  is expected to grow between a negative 0.5 percent and a positive 4.5 percent this year  compared with an expansion of 4.6 percent in 2015.  2) Itaú targets interest income  or revenue from lending-related transactions  to grow between 2 percent ",
        "date": "02022016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú sees provisions soaring  weak credit growth this year "
    },
    {
        "content": "SAO PAULO  Feb 2 Itaú Unibanco Holding SA  Brazil's largest bank by market value  beats fourth-quarter profit estimates on Tuesday even as weak demand for credit drove interest income down.",
        "date": "02022016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú Unibanco beats profit estimate even as interest income falls "
    },
    {
        "content": "SAO PAULO  Jan 15 Brazil's state-run oil company Petroleo Brasileiro SA is pressing ahead with the sale of $15 billion in assets but may need to make further cuts to its investment plan depending on oil prices  the company told analysts on Friday according to a client note from Itaú BBA.",
        "date": "01152016",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Petrobras tells analysts it may need further capex cuts - Itau BBA "
    },
    {
        "content": "SAO PAULO  Dec 31 Itaú Unibanco Holding SA  Brazil's No. 1 bank by market value  has agreed to pay Grupo BTG Pactual SA about 1.21 billion reais ($305 million) for a stake in a debt collection company and a pool of non-performing loans  in a last-minute bid that trumped a rival bid.",
        "date": "12312015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 2-Brazil's Itaú buys BTG Pactual's debt collector stake  trumps rival bid "
    },
    {
        "content": "Dec 31 The following bids  mergers  acquisitions and disposals were reported by 1430 GMT on Thursday:",
        "date": "12312015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "BRASILIA  Dec 31 Itaú Unibanco Holding SA  agreed to buy a controlling stake in Latin America's largest debt collection agency  Recovery do Brasil  from investment bank Grupo BTG Pactual SA for 640 million reais ($161.64 million)  Itau said on Wednesday.",
        "date": "12312015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itau to buy BTG's stake in Recovery for 640 mln reais "
    },
    {
        "content": "SAO PAULO Grupo BTG Pactual SA  is negotiating the sale of around 4 billion reais ($1.03 billion) in loans to rivals Itaú Unibanco Holding SA  and Banco Bradesco SA   two sources with direct knowledge of the situation said on Monday.",
        "date": "11302015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "BTG Pactual in talks over $1 billion loan sale to Itaú  Bradesco  sources say "
    },
    {
        "content": "SAO PAULO  Nov 23 One of the shareholders seeking to offload a stake in Brazilian reinsurer IRB Brasil RE SA has asked the country's securities industry watchdog for a 60-day delay in analyzing an initial public offering (IPO) plan  with market turmoil in Latin America's largest economy intensifying in recent weeks.",
        "date": "11232015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú asks Brazil watchdog for 60-day delay in IRB Brasil IPO "
    },
    {
        "content": "SAO PAULO  Nov 10 Itaú Unibanco Holding SA   Latin America's largest bank by market value  named Milton Maluhy Filho as chief executive officer of Itaú CorpBanca  the venture that will expand the lender's presence across South America.",
        "date": "11102015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú taps Maluhy as CEO for Itaú CorpBanca venture "
    },
    {
        "content": "SAO PAULO  Nov 4 Itaú Unibanco Holding SA   Brazil's largest bank by market value  expects consumer and corporate loan defaults to peak late next year  an indication that efforts to grow secured lending in recent years are bearing fruit.",
        "date": "11042015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Brazil's Itaú sees defaults peaking late next year "
    },
    {
        "content": "SAO PAULO  Nov 4 The pace of increases in consumer loan defaults at Brazilian lender Itaú Unibanco Holding SA will lose steam in coming quarters  indicating that years of efforts towards growing secured lending will begin to bear fruit  Chief Financial Officer Eduardo Vassimon said on Wednesday.    (Reporting by Guillermo Parra-Bernal)",
        "date": "11042015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú sees consumer loan book improving gradually "
    },
    {
        "content": "SAO PAULO  Nov 3 Itaú Unibanco Holding SA took advantage of stronger-than-expected third-quarter profit to boost loan-loss provisions  as Brazil's No. 1 bank by market value wrestles with the impact of the country's deepest recession in a quarter century.",
        "date": "11032015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 3-Itaú boosts provisions to stem rising Brazil defaults "
    },
    {
        "content": "SAO PAULO  Nov 3 Itaú Unibanco Holding SA   Brazil's largest private-sector bank  posted on Tuesday stronger-than-expected third-quarter profit  as growth in interest income helped offset faster growth in expenses and loan-loss provisions.",
        "date": "11032015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú beats third-quarter profit estimates on revenue "
    },
    {
        "content": "SAO PAULO  Oct 21 Itau Unibanco Holding SA   Brazil's biggest bank by market value  agreed on Wednesday to buy 50 percent of automatic toll company ConectCar for 170 million reais ($43 million) in cash.",
        "date": "10222015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itau buys ConectCar from Odebrecht for 170 mln reais "
    },
    {
        "content": "SAO PAULO  Oct 23 Itaú Unibanco Holding SA  Brazil's largest bank by market value  plans to present a new way of calculating interest income in its upcoming release of financial statements slated for next month.",
        "date": "10232015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú to simplify revenue accounting in upcoming results "
    },
    {
        "content": "(Click on for a recent story on M&A advisory activity in Brazil based on Thomson Reuters' league tables data)     SAO PAULO  Oct 1 In the year through Sept. 30  companies announced $24.507 billion worth of M&A transactions in Brazil  the lowest in a decade  a Thomson Reuters deal intelligence report showed on Thursday. The value of deals sank 44 percent from the same period a year earlier.      The number of deals announced rose 4 percent in the first nine months from a year earli",
        "date": "10012015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "TABLE-Rothschild  Itaú lead Brazil M&A advisory rankings this year "
    },
    {
        "content": "BRASILIA  Sept 5 Chile's bank watchdog authorized Corpbanca's merger with the Chilean operations of Brazil's Itau Unibanco Holding SA  in one of the final hurdles for the conclusion of the deal by early 2016  Itau said on Saturday.",
        "date": "09052015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Chile's banking regulator approves Itau-Corpbanca deal "
    },
    {
        "content": "SAO PAULO  Aug 27 The board of Itaú Unibanco Holding SA  Brazil's largest lender by market value  has approved the buy-back of up to 11 million common shares and 55 million preferred shares  the bank said on Thursday in a securities filing.",
        "date": "08272015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Board of Brazil's Itau Unibanco approves share buy-back program "
    },
    {
        "content": "SAO PAULO  Aug 20 Itaú Unibanco Holding SA   Brazil's No. 1 bank by market value  is having a difficult time predicting trends in corporate loan delinquencies amid an uncertain outlook for some industries and policies to shore up the economy  Chief Executive Officer Roberto Setubal said on Thursday.",
        "date": "08212015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Uncertainty clouds Itaú's view on corporate defaults  CEO says "
    },
    {
        "content": "SAO PAULO  Aug 20 Itaú Unibanco Holding SA  Brazil's No. 1 bank by market value  is having a difficult time predicting prospects for corporate loan delinquencies amid an uncertainty outlook for some industries and policies to shore up the economy  the bank's CEO said on Thursday.",
        "date": "08212015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Uncertainty clouds Itaú's view on corporate defaults  CEO says "
    },
    {
        "content": "SAO PAULO  Aug 5 Itaú Unibanco Holding SA    Brazil's largest bank by market value  will remain attentive to potential opportunities to repurchase outstanding shares in the market  Chief Financial Officer Eduardo Vassimon said on Wednesday.   (Reporting by Guillermo Parra-Bernal; Editing by Meredith Mazzilli)",
        "date": "08052015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú eyeing opportunities to resume buybacks  CFO says "
    },
    {
        "content": "SAO PAULO  Aug 4 A bigger-than-expected jump in loan defaults cast a shadow over strong second-quarter profit at Brazil's Itaú Unibanco Holding SA  another signal of the rapidly deteriorating outlook for banks in the nation's slumping economy.",
        "date": "08042015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 3-Defaults cast shadow over record profit at Brazil's Itaú "
    },
    {
        "content": "SAO PAULO  Aug 4 Consumer and corporate loan defaults at Brazilian lender Itaú Unibanco Holding SA will keep rising through the end of the year  Investor Relations Director Marcelo Kopel said on a conference call on Tuesday   (Reporting by Guillermo Parra-Bernal; Editing by Meredith Mazzilli)",
        "date": "08042015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Loan defaults at Brazil's Itaú seen rising this year "
    },
    {
        "content": "SAO PAULO  Aug 4 Itaú Unibanco Holding SA   Brazil's largest non-government bank  announced on Tuesday the following operating estimates for this year:",
        "date": "08042015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú sticks to year operational forecasts "
    },
    {
        "content": "SAO PAULO  Aug 4 Itaú Unibanco Holding SA  Brazil's largest bank by market value  beat profit estimates in the second quarter on Tuesday as interest and fee income rose surprisingly jumped in spite of a slumping economy.",
        "date": "08042015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú beats profit estimate as revenue surges "
    },
    {
        "content": "SAO PAULO State-controlled Petróleo Brasileiro SA  hired a group of five banks to handle the initial public offering of its fuel distribution business  two sources with knowledge of the plans said on Friday.",
        "date": "07172015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Petrobras hires Citigroup  others for unit IPO  sources say "
    },
    {
        "content": "BRASILIA  July 15 Brazil's recession will extend into next year  hurting President Dilma Rousseff's efforts to shore up public finances and arrest a sharp increase in unemployment  Itau Unibanco's chief economist said in a report on Wednesday.",
        "date": "07152015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itau Unibanco sees Brazil's economy shrinking in 2016 "
    },
    {
        "content": "SAO PAULO  July 17 State-controlled Petróleo Brasileiro SA hired a group of five banks to handle the initial public offering of its fuel distribution business  which could sell up from 25 percent of the unit to investors  the newswire service of O Estado de S. Paulo newspaper said on Friday.",
        "date": "07172015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Petrobras hires Citigroup  Itaú for unit IPO -Estado newswire "
    },
    {
        "content": "SAO PAULO  1 Jul No ano até 30 de junho  as companhias anunciaram 14 47 bilhões de dólares em fusões no Brasil  menor cifra em uma década  mostrou um levantamento da Thomson Reuters. O número de transações caiu 39 por cento ante o ano anterior  e 65 por cento na comparação com os últimos seis meses de 2014.     Veja a seguir o ranking dos principais assessores financeiros de operações de fusões e aquisições envolvendo empresas brasileiras em 2015 até junho.          RANKING POR VALOR",
        "date": "07012015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "TABELA-BTG Pactual e Itaú BBA lideram raking de fusões no 1º semestre "
    },
    {
        "content": "(Click on for a story on Thomson Reuters' first-half M&A rankings for Brazil in terms of deal value and number of deals)     SAO PAULO  July 1 Bankers dismayed by the small number of merger-and-acquisition closings in Brazil this year expect a turnaround in the second half  citing a weak local currency  cheaper assets and cash-flush buyout firms.     Dozens of deals stalled in the first six months of the year because of mounting economic and political turmoil. Still  advisory work",
        "date": "07012015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "TABLE-BTG Pactual  Itaú top Brazil's first-half M&A rankings "
    },
    {
        "content": "SAO PAULO  June 24 Grupo BTG Pactual SA  and Bank of America Merrill Lynch are vying for the last slot in a group of investment banks handling the initial public offering of IRB Brasil RE SA  Brazil's top reinsurer  three sources with direct knowledge of the deal said on Wednesday.",
        "date": "06242015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "BTG Pactual  BofA vie for role in IBR Brasil IPO -sources "
    },
    {
        "content": "SANTIAGO  June 26 Shareholders of Chile's Corpbanca approved on Friday a merger with the Chilean operations of Brazil's Itau Unibanco  a step forward for the often troubled deal to create a new Latin American banking venture worth some $8 billion.",
        "date": "06262015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Corpbanca-Itau Chile deal gets boost as shareholders OK merger "
    },
    {
        "content": "SAO PAULO  June 3 Itaú Unibanco Holding SA and Chile's CorpBanca SA agreed to modify terms of an agreement to merge some of their Chilean operations  seeking to win shareholder approval ahead of a June 26 meeting.",
        "date": "06032015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú  CorpBanca change merger terms  see deal ready next year "
    },
    {
        "content": "NEW YORK  May 18 (IFR) - Latin American bond markets ended Monday's session well bid  after Brazilian lender Itau-Unibanco broke a six-month lull in US dollar bond issuance from the country.",
        "date": "05182015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itau bond sale adds momentum to positive session in LatAm "
    },
    {
        "content": "NEW YORK  May 18 (IFR) - Brazil's largest private bank Itau is set to break a six-month drought in dollar bond issuance from the country with a three-year bond offering which will price on Monday.",
        "date": "05182015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itau set to reopen US dollar market for Brazil "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 18 (Fitch) Fitch Ratings expects to assign a long-term foreign  currency rating of 'BBB+(exp)' to Itau Unibanco Holding S.A.'s (IUH) upcoming  USD senior unsecured fixed-rate notes.  The notes will be issued by IUH's Grand Cayman branch  for an amount to be  determined at the issuance. The principal will mature in three years in May 2018  and interest payments will be made semi-annually. The settlement amount paid to  the ",
        "date": "05182015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Fitch Expects to Rate Itau Unibanco Holding's Senior Notes 'BBB+(exp) "
    },
    {
        "content": "NEW YORK  May 18 (IFR) - Brazil was leading LatAm credit markets higher Monday following a rally in state-controlled Petrobras and a new issue from Itau-Unibanco - the country's first dollar bond of the year.",
        "date": "05182015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil hogs limelight as Itau brings dollar trade "
    },
    {
        "content": "SANTIAGO  May 13 Chilean bank CorpBanca said a deal with Brazil's Itau Unibanco last year now considerably undervalues it  casting fresh doubt on the troubled merger between the two Latin American lenders.",
        "date": "05142015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Chile's CorpBanca says Itau merger deal undervalues it "
    },
    {
        "content": "SAO PAULO  May 6 Itaú Unibanco Holding SA is prepared to navigate through an expected worsening of Brazil's economic conditions in the second quarter following steps to bulk up provisions for mostly corporate loans gone sour  Chief Financial Officer Eduardo Vassimon said on Wednesday.",
        "date": "05062015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Itaú ready to face worst of Brazil's economic downturn -CFO "
    },
    {
        "content": "SAO PAULO  May 6 Itaú Unibanco Holding SA's step to raise loan-loss provisions in recent months prepared Brazil's most profitable lender so it could navigate through an expected worsening of economic conditions during the second quarter  Chief Financial Officer Eduardo Vassimon said on Wednesday.",
        "date": "05062015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú prepared to face worst of Brazil downturn  CFO says "
    },
    {
        "content": "SAO PAULO  May 7 Itaú Unibanco Holding SA sweetened a dividend payout proposal for minority shareholders of Chile's CorpBanca SA in a bid to speed up completion of a tie-up between both lenders before the end of June.",
        "date": "05072015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú sweetens proposal to win support for CorpBanca merger plan "
    },
    {
        "content": "SAO PAULO  May 5 Itaú Unibanco Holding SA is provisioning more for loan losses and curbing loan book growth in a bet that careful risk management will help the bank navigate Brazil's steepest recession in over two decades.",
        "date": "05052015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 3-Itaú bets on prudence as Brazil heads for steep recession "
    },
    {
        "content": "SAO PAULO  May 5 Itaú Unibanco Holding SA  remains attentive to potential acquisition opportunities across Latin America  a sneior executive said on Tuesday.",
        "date": "05052015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú remains 'attentive' to M&A opportunities  executive says "
    },
    {
        "content": "SAO PAULO  May 5 Itaú Unibanco Holding SA   Brazil's largest non-government bank  revised on Tuesday the following operating estimates for this year:",
        "date": "05052015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú Unibanco expects higher provision growth this year "
    },
    {
        "content": "SAO PAULO  May 5 Itaú Unibanco Holding SA  Brazil's largest bank by market value  reported first-quarter profit that beat expectations after interest income jumped and expenses dropped.",
        "date": "05052015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú beats profit estimate despite jump in provisions "
    },
    {
        "content": "(Click on for a story on Thomson Reuters' first-quarter M&A rankings for Brazil in terms of deal value and number of deals)     SAO PAULO  April 2 The value of mergers and acquisitions in Brazil in the first quarter slipped to its lowest in two years  as slumping confidence and an economic downturn prevented buyers and sellers from finalizing deals in Latin America's largest economy.     In the year through March 31  companies showed $8.51 billion worth of corporate takeovers in B",
        "date": "04022015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "TABLE-Rothschild  Itaú BBA top Brazil 1st-quarter M&A rankings "
    },
    {
        "content": "SAO PAULO  March 27 The board of Itau Unibanco Holding SA  Brazil's largest bank by market value  approved a capital increase to boost liquidity of its shares and generate value for investors  according to a securities filing on Friday.",
        "date": "03272015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itau Unibanco increases capital to boost liquidity "
    },
    {
        "content": "SAO PAULO  March 16 Itaú Unibanco  Brazil's largest lender by market value  has agreed with Mastercard Brasil to set up a new electronic payments network  the bank said in a securities filing on Monday.",
        "date": "03162015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itau Unibanco  Mastercard to create payments network "
    },
    {
        "content": "SAO PAULO  March 17 State-controlled Petróleo Brasileiro SA  hired several investment banks to help sell $13.7 billion worth of assets including gasoline stations  stakes in oil fields and electricity investments  Folha de S. Paulo reported on Monday.",
        "date": "03172015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Petrobras hires banks to handle asset sales  Folha says "
    },
    {
        "content": "MOGI MIRIM  Brazil  March 13 Itaú Unibanco Holding SA  Brazil's largest bank by market value  said on Friday it expected a new $1 billion data center to help curb its expenses and process transactions more rapidly by June of 2016.",
        "date": "03132015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 1-Itaú says $1 billion data center to help earnings in 2016 "
    },
    {
        "content": "MOGI MIRIM  Brazil  March 13 Itaú Unibanco Holding SA's new data center will begin to affect expenses and earnings only by the middle of next year  when the new facility takes over all processing of financial transactions  a senior executive esaid on Friday.",
        "date": "03132015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itaú data center's impact on earnings seen in mid-2016 "
    },
    {
        "content": "MOGI MIRIM  Brazil  March 13 Itaú Unibanco Holding SA inaugurated on Friday a data center that will boost its capacity to handle transactions 25-fold and control costs as Brazil's largest bank by market value bets on efficiency to protect profits.",
        "date": "03132015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú opens $1.05 bln data center in efficiency push "
    },
    {
        "content": "SAO PAULO  Feb 23 Itaú Unibanco Holding SA  on Monday appointed executives to lead retail- and wholesale-banking units of Brazil's No. 1 lender by market value  in preparation for the succession of Chief Executive Officer Roberto Egydio Setubal.",
        "date": "02242015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 2-Itaú names top executives  boost to Setubal's succession "
    },
    {
        "content": "SAO PAULO  Feb 23 Itaú Unibanco Holding SA  took a key step toward the succession of Chief Executive Officer Roberto Setubal on Monday  by appointing two executives to head the retail and wholesale banking units of Brazil's No. 1 bank by market value.",
        "date": "02232015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Brazil's Itaú Unibanco takes first steps in CEO succession plan "
    },
    {
        "content": "SAO PAULO  Feb 4 Itaú Unibanco Holding SA  plans to begin the implementation of a plan to succeed Chief Executive Officer Roberto Setubal in April  when the new top executives of the retail and wholesale banking units will be announced  he said on Wednesday.",
        "date": "02042015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú Unibanco's succession plan to start in April  CEO says "
    },
    {
        "content": "SAO PAULO  Feb 3 Itaú Unibanco Holding SA   Brazil's largest bank by market value  plans to increase interest income at a faster pace than rivals and keep loan-loss provisions stable this year  evidence Itaú could boost profit even if the economy contracts.",
        "date": "02032015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "UPDATE 3-Itaú sets ambitious provision  income goals despite Brazil slump "
    },
    {
        "content": "SAO PAULO  Feb 3 Itau Unibanco Holding SA has no plans to set aside extraordinary loan-loss provisions in the short term  Chief Executive Officer Roberto Setubal said on Tuesday  suggesting he is comfortable with provisions despite a deteriorating climate for the economy.",
        "date": "02032015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Itau has no plans for additional provisions  CEO says "
    },
    {
        "content": "SAO PAULO  Feb 3 Itaú Unibanco Holding SA   Brazil's largest non-government bank  announced on Tuesday the following operating estimates for this year:",
        "date": "02032015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú expects loan book growth between 6 pct and 9 pct "
    },
    {
        "content": "SAO PAULO  Feb 3 Itaú Unibanco Holding SA  posted on Tuesday fourth-quarter profit that beat expectations as a steeper-than-expected decline in defaults allowed Brazil's largest bank by market value to cut loan-loss provisions.",
        "date": "02032015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "normal",
        "symbol": "ITUB",
        "title": "Brazil's Itaú posts record profit on unexpected cut in provisions "
    },
    {
        "content": "SAO PAULO  Jan 27 Itaú Unibanco SA  Brazil's largest private-sector bank  borrowed a combined $400 million from the World Bank's International Finance Corp  and a group of commercial lenders to help fund renewable energy projects in drought-stricken Brazil.",
        "date": "01272015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "Itaú raises $400 mln from IFC  other banks for renewable energy "
    },
    {
        "content": "SAO PAULO  Jan 5 Companies announced $77.07 billion worth of corporate takeovers in Brazil last year  the largest amount since 2011  a Thomson Reuters report on M&A activity showed on Monday. Some 553 deals were announced last year  down from 633 in 2013  according to the report.     M&A activity should gain steam in coming months as a slumping currency and lower asset prices prompted foreign companies and investment funds to spend $33.1 billion on takeovers in Latin America's larges",
        "date": "01052015",
        "name": "Itau Unibanco Banco Holding SA",
        "news_type": "topStory",
        "symbol": "ITUB",
        "title": "TABLE-Credit Suisse  Itaú BBA top Brazil M&A rankings in 2014 "
    }
]