[
    {
        "content": "* Says it transfers mortgage bank business to unit ORIX Credit on Nov. 1",
        "date": "11012017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix transfers mortgage bank business to ORIX Credit "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  August 09 (Fitch) Fitch Ratings has affirmed Japan-based ORIX Corporation's Long-Term Foreign-Currency Issuer Default Rating (IDR) at 'A-'. The Outlook is Stable. The agency has also affirmed the company's Short-Term Foreign-Currency IDR at 'F2'. ORIX's senior unsecured debt has also been affirmed at 'A-'. ORIX is engaged in a wide range of businesses including leasing  banking  life insurance  asset management  principal investm",
        "date": "08092017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Fitch Affirms ORIX's Ratings at 'A-'; Outlook Stable "
    },
    {
        "content": "* Says it will transfer mortgage bank business to ORIX Credit Corporation  effective Nov. 1",
        "date": "07242017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix to transfer mortgage bank business to ORIX Credit "
    },
    {
        "content": "LONDON Dutch shipowner Vroon is finding talks with banks tough going as it tries to navigate a way out of a long slump in the shipping industry. But it is not an easy time for the lenders either.",
        "date": "07242017",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "European banks struggle to solve toxic shipping debt problem "
    },
    {
        "content": "LONDON  July 24 Dutch shipowner Vroon is finding talks with banks tough going as it tries to navigate a way out of a long slump in the shipping industry. But it is not an easy time for the lenders either.",
        "date": "07242017",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "INSIGHT-European banks struggle to solve toxic shipping debt problem "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  July 10 (Fitch) Fitch Ratings has assigned Japan-based ORIX Corporation's (ORIX  A-/Stable) USD1 250 million fixed-rate senior unsecured notes a final rating of 'A-'.  The proceeds will be used for general corporate purposes. ORIX  established in 1964  is engaged in a wide range of businesses including leasing  banking  life insurance  asset management  principal investments  real estate  and environment and energy-related busine",
        "date": "07112017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Fitch Assigns ORIX's USD Senior Notes 'A-' Final Rating "
    },
    {
        "content": "* Orix Corp files for potential shelf of senior debt securities; size not disclosed - sec filing Source text for Eikon: Further company coverage:",
        "date": "07072017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix Corp files for potential shelf of senior debt securities "
    },
    {
        "content": "May 4 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "05042017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "TEL AVIV Japan's ORIX Corp  will buy a 22.1 percent stake in Israeli geothermal energy producer Ormat Technologies Inc  for $627 million from a group led by the FIMI private equity fund  the companies said on Thursday.",
        "date": "05042017",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Japan's ORIX to buy 22 percent of Israel geothermal energy firm Ormat "
    },
    {
        "content": "TEL AVIV  May 4 Japan's ORIX Corp will buy a 22.1 percent stake in Israeli geothermal energy producer Ormat Technologies Inc for $627 million from a group led by the FIMI private equity fund  the companies said on Thursday.",
        "date": "05042017",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Japan's ORIX to buy 22 pct of Israel geothermal energy firm Ormat "
    },
    {
        "content": "* Orix to acquire 22 percent ownership stake in Ormat from FIMI and Bronicki Investments and simultaneously enter into strategic partnership with Ormat",
        "date": "05042017",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "BRIEF-Ormat Technologies says Orix Corp to acquire 22% stake in Ormat for about $627 mln "
    },
    {
        "content": "* Says it completed repurchase of 30 million shares of its common stock  for 50 billion yen on April 21",
        "date": "04212017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix completes share repurchase "
    },
    {
        "content": "* Says it repurchased 4.9 million shares for 8.28 billion yen in total from March 1 to March 31",
        "date": "04062017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix updates share repurchase status "
    },
    {
        "content": "SAO PAULO Increasing caution among state lenders should create room for capital markets instruments to help finance infrastructure projects in Brazil  providing Japanese financial services firm Orix Corp  a platform to grow more rapidly in the country after a recent acquisition  a senior executive said in an interview.",
        "date": "02242017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Orix sees Brazil relying more on capital markets for infrastructure "
    },
    {
        "content": "* Says it extended the end date of share repurchase plan to May 15 from March 31",
        "date": "02162017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix extends share repurchase period to May 15 from March 31 "
    },
    {
        "content": "* Sumitomo mitsui trust holdings inc reports a 5.4 percent passive stake in orix corp as of dec 31  2016 - sec filing  Source text for Eikon: (http://bit.ly/2kaBYW4) Further company coverage:",
        "date": "02102017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Sumitomo Mitsui Trust Holdings Inc reports a 5.4 pct passive stake in Orix Corp "
    },
    {
        "content": "TOKYO  Jan 25 Orix Corp would consider deals to the scale of $1 billion each to buy shipping loans from European banks  an executive said  as the Japanese financial conglomerate plans to increase exposure to a slowly recovering shipping sector.",
        "date": "01252017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Japan's Orix says ready to spend up to $1 bln for shipping loan deals "
    },
    {
        "content": "LONDON  Jan 23 Japanese financial services firm Orix Corp said it was looking to buy more shipping loans in Europe after confirming on Monday that it would purchase $289 million worth of such debt from Royal Bank of Scotland in a landmark deal.",
        "date": "01232017",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Japan's Orix looking for more European shipping debt after buying RBS loans "
    },
    {
        "content": "LONDON/TOKYO Royal Bank of Scotland  has concluded agreements to sell at least $600 million worth of shipping loans from its portfolio as part of efforts to exit the sector  sources with direct knowledge of the deal told Reuters on Friday.",
        "date": "01202017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "RBS sells $600 million of shipping loans  Orix among buyers: sources "
    },
    {
        "content": "LONDON/TOKYO  Jan 20 Royal Bank of Scotland  has concluded agreements to sell at least $600 million worth of shipping loans from its portfolio as part of efforts to exit the sector  sources with direct knowledge of the deal told Reuters on Friday.",
        "date": "01202017",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "UPDATE 1-RBS sells $600 million of shipping loans  Orix among buyers - sources "
    },
    {
        "content": "TOKYO  Jan 20 Japanese financial services firm Orix Corp has agreed to buy $290 million worth of shipping loans from Royal Bank of Scotland  sources with direct knowledge of the deal told Reuters on Friday.",
        "date": "01202017",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Orix agrees to buy $290 mln of RBS shipping loans -sources "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  January 16 (Fitch) Fitch Ratings has assigned Japan-based ORIX  Corporation's (ORIX  A-/Stable) USD750 million fixed-rate senior unsecured notes  a final rating of 'A-'. The proceeds will be used for general corporate  purposes.  ORIX  established in 1964  is engaged in a wide range of businesses including  leasing  banking  life insurance  asset management  principal investments  real  estate  and environment and energy-related ",
        "date": "01162017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Fitch Assigns ORIX's USD Senior Notes 'A-' Final Rating "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  January 11 (Fitch) Fitch Ratings has assigned Japan-based ORIX  Corporation's (ORIX  A-/Stable) US dollar-denominated fixed-rate senior  unsecured notes an expected rating of 'A-(EXP)'. The proceeds will be used for general corporate purposes. The final rating is  contingent upon receipt of final documents conforming to information already  received. ORIX  established in 1964  is engaged in a wide range of businesses including  l",
        "date": "01122017",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Fitch Assigns ORIX's USD Senior Notes 'A-(EXP)' Rating "
    },
    {
        "content": "* Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"A+\" -R&I",
        "date": "11022016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-R&I affirms ORIX Corp's rating at \"A+\" and announces stable outlook -R&I "
    },
    {
        "content": "* Says it to repurchase up to 39 million shares of its common stock  representing a 2.97 pct stake",
        "date": "10262016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix to repurchase 39 mln shares at up to 50 bln yen "
    },
    {
        "content": "* Japan's orix says to buy back up to 2.97 percent of own shares worth 50 billion yen  Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "BRIEF-Japan's orix says to buy back up to 2.97 percent of own shares worth 50 billion yen "
    },
    {
        "content": "* European banks looking to offload billions of dollars in loans",
        "date": "09202016",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "UPDATE 2-RBS starts winding down shipping business as sale efforts fade "
    },
    {
        "content": "* City of Kobe plans to hold auctions in 2017 to sell the airport concession - Nikkei",
        "date": "09082016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix  Itochu may bid on right to run Kobe Airport - Nikkei "
    },
    {
        "content": "* Orix Corp plans to send directors to Bitexco Power  and will offer advice on business operations as well - Nikkei",
        "date": "08312016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix Corp will take an over 10 pct joint stake in Bitexco Power - Nikkei "
    },
    {
        "content": "* Smartzip Analytics Inc secured $12 million in debt financing round led by Orix Growth Capital  Source text for Eikon:  Further company coverage:",
        "date": "08312016",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "BRIEF-Smartzip Analytics secured $12 mln in debt financing round led by Orix Growth "
    },
    {
        "content": "* Blockchain set to revolutionise finance industry  save billions",
        "date": "08172016",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Expert shortage hampers Japanese financials in blockchain race "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  August 10 (Fitch) Fitch Ratings has affirmed Japan-based ORIX  Corporation's Long-Term Foreign-Currency Issuer Default Rating (IDR) of 'A-'.  The Outlook is Stable. The agency has also affirmed the company's Short-Term  Foreign-Currency IDR of 'F2'. ORIX's senior unsecured debt has also been  affirmed at 'A-'. Established in 1964  ORIX is engaged in a wide range of businesses including  leasing  banking  life insurance  asset man",
        "date": "08102016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Fitch Affirms ORIX's Rating at 'A-'; Outlook Stable "
    },
    {
        "content": "TOKYO Japanese financial services company Orix Corp  has bought Boston Financial Investment Management  a U.S. money manager specialized in tax credit investments for low-income housing suppliers  two sources said on Saturday.",
        "date": "07092016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Japan's Orix buys U.S. housing tax credit syndicator: sources "
    },
    {
        "content": "TOKYO  July 9 Japanese financial services company Orix Corp has bought Boston Financial Investment Management  a U.S. money manager specialised in tax credit investments for low-income housing suppliers  two sources said on Saturday.",
        "date": "07092016",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Japan's Orix buys U.S. housing tax credit syndicator-sources "
    },
    {
        "content": "* Says it forms a business alliance with Orix Corp  on services provision of expense calculation systems for customers",
        "date": "06022016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Rakus forms business alliance with Orix "
    },
    {
        "content": "* Orix will raise 94 bln Yen ($855 Million) at the end of May through 60-year hybrid loans - Nikkei",
        "date": "05242016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix will raise 94 bln yen at the end of May through 60-year hybrid loans - Nikkei "
    },
    {
        "content": "TOKYO Financial services provider Orix Corp  and French partner Vinci SA  have been shortlisted in an auction of the rights to manage five toll roads in central Japan  sources with knowledge of the process said.",
        "date": "04062016",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Orix  Vinci shortlisted for Japan's $1.1 billion toll road sale - sources "
    },
    {
        "content": "TOKYO  April 6 Financial services provider Orix Corp and French partner Vinci SA have been shortlisted in an auction of the rights to manage five toll roads in central Japan  sources with knowledge of the process said.",
        "date": "04062016",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Orix  Vinci shortlisted for Japan's $1.1 bln toll road sale -sources "
    },
    {
        "content": "TOKYO Japanese financial services company Orix Corp  plans to spend $1 billion over three-to-five years on acquisitions via a private equity firm it has set up in the United States  a person with direct knowledge of the matter said.",
        "date": "03182016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Japan's Orix plans $1 billion U.S. private equity deals: source "
    },
    {
        "content": "TOKYO  March 18 Japanese financial services company Orix Corp plans to spend $1 billion over three-to-five years on acquisitions via a private equity firm it has set up in the United States  a person with direct knowledge of the matter said.",
        "date": "03182016",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Japan's Orix plans $1 bln U.S. private equity deals -source "
    },
    {
        "content": "* Orix to invest in Indian wind power project  to start JV with Infrastructure Leasing & Financial Services - Nikkei",
        "date": "03162016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "BRIEF-Orix to invest in Indian wind power project - Nikkei "
    },
    {
        "content": "SEOUL  Feb 1 South Korea's Hyundai Merchant Marine Co Ltd (HMM) plans to seek another buyer for its majority stake in stock brokerage Hyundai Securities Co Ltd   an HMM spokesman said on Monday.",
        "date": "02012016",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Hyundai Merchant Marine says to seek new buyer for stock broker stake "
    },
    {
        "content": "* Abe govt keen to see more public-private partnerships   (Adds details of the deal)",
        "date": "11102015",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "UPDATE 1-Orix  Vinci win $18 bln rights to run Japan's Kansai Int'l Airport "
    },
    {
        "content": "TOKYO  Nov 10 Japan has granted Orix Corp  and partner Vinci SA the right to operate the Kansai International Airport  a document obtained by Reuters showed on Tuesday.",
        "date": "11102015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Japan grants Orix  Vinci right to run Kansai Intl Airport "
    },
    {
        "content": "RESULTS             RESULT          FORECAST   Revenues         606.12              425.34",
        "date": "07302015",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "REFILE-TABLE-Orix -Q1 group results (SEC) "
    },
    {
        "content": "TOKYO  June 12 Japan's financial group Orix Corp  and partner France's Vinci SA have been picked for final bid for the sale of the right to operate Japan's Kansai International Airport  the government entity said.",
        "date": "06122015",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Orix  Vinci chosen for final bid for sale of Kansai Airport privatisation "
    },
    {
        "content": "SEOUL  June 12 South Korea's Hyundai Merchant Marine Co Ltd (HMM) will sell a major stake in stock brokerage Hyundai Securities Co Ltd for 647 billion won ($579.84 million) to a special purpose company set up by Japan's Orix Corp  an HMM spokesman said on Friday.",
        "date": "06122015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Hyundai Merchant Marine to sell $580 mln stake in stock brokerage to Orix "
    },
    {
        "content": "* Orix has partnered with France's Vinci to bid   (Adds other bidders  details throughout)",
        "date": "05222015",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "UPDATE 1-Orix only confirmed bidder for Kansai airport rights after more drop out "
    },
    {
        "content": "April 13 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "04132015",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TOKYO Japan's Orix Corp  is scouting for acquisitions to achieve a goal of doubling its $260 billion asset management business and is looking overseas for targets after missing the boat at home  its chief executive said.",
        "date": "04132015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Japan's Orix scouting for asset management buys overseas "
    },
    {
        "content": "TOKYO  March 13 A real estate arm of a Japanese media group Fuji Media Holdings edged out a fund run by Morgan Stanley and others to buy a hotel holding company from a Japanese government-controlled fund  people involved in the sale said.",
        "date": "03132015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Fuji Media wins bid for Japan hotels over Orix  Morgan Stanley "
    },
    {
        "content": "* Monday's deadline for airlines to submit Skymark reform interest   (Adds report of AirAsia applying to be Skymark sponsor)",
        "date": "02232015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "UPDATE 2-Japan's ANA says considering investment in bankrupt Skymark Airlines "
    },
    {
        "content": "TOKYO  Feb 19 Japan's biggest airline ANA Holdings Inc and financial services provider Orix Corp  have expressed interest in participating in the reconstruction of budget airline Skymark Airlines Inc  people familiar with the situation said.",
        "date": "02192015",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "UPDATE 1-Japan's ANA Holdings  Orix offer to join Skymark rehabilitation effort -sources "
    },
    {
        "content": "TOKYO  Feb 23 Japan's biggest airline  ANA Holdings Inc  confirmed on Monday that it offered to help bail out bankrupt airline Skymark Airlines Inc.",
        "date": "02232015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "ANA confirms offer to help Skymark rehabilitation "
    },
    {
        "content": "TOKYO  Feb 19 Japanese financial services provider Orix Corp has expressed interest in participating in the reconstruction of budget airline Skymark Airlines Inc  two people familiar with the situation said.",
        "date": "02192015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Orix offers to join Skymark Airlines rehabilitation effort -sources "
    },
    {
        "content": "Feb 20 The following corporate finance-related stories were reported by media:",
        "date": "02202015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "UPDATE 1-Market Chatter-Corporate finance press digest "
    },
    {
        "content": "Feb 20 The following corporate finance-related stories were reported by media:",
        "date": "02202015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Market Chatter-Corporate finance press digest "
    },
    {
        "content": "* Acquisition would give Anbang investment base in South Korea",
        "date": "02162015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "UPDATE 3-China's Anbang near $1 bln deal for S.Korea's Tong Yang Life-source "
    },
    {
        "content": "Feb 17 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Tuesday:",
        "date": "02172015",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TOKYO  Feb 17 Orix Corp is considering offering support for Skymark Airlines Inc  which in late January filed for bankruptcy protection  Kyodo News reported on Tuesday.",
        "date": "02172015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Orix considering support for Skymark Airlines - Kyodo "
    },
    {
        "content": "SEOUL  Jan 30 The private equity arm of Japan's Orix Corp was chosen as preferred bidder for a controlling stake in South Korea's Hyundai Securities Co Ltd   a bank representing the seller said.",
        "date": "01302015",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Japan's Orix preferred bidder for stake in Hyundai Securities "
    },
    {
        "content": "(Adds all EPS diluted figures and Q4 Dividend forecast figure) Jan 29 (Reuters)-            Orix Corp            CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                   9 months ended      9 months ended       Year to                  Dec 31  2014        Dec 31  2013     Mar 31  2015                     LATEST             YEAR-AGO          COMPANY                       RESULTS             RESULT          FORECAST      Revenues        1.57 trln            9",
        "date": "01292015",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "REFILE-TABLE-Orix -9-MTH group results (SEC) "
    },
    {
        "content": "SEOUL  Jan 27 Japan's Orix Corp and South Korean private equity firm Pinestreet have submitted bids for a controlling stake in securities brokerage Hyundai Securities Co Ltd  a source with direct knowledge of the matter said on Tuesday.",
        "date": "01272015",
        "name": "Orix Corp Ads",
        "news_type": "topStory",
        "symbol": "IX",
        "title": "Japan's Orix  PE firm bid for S.Korea's Hyundai Securities-source "
    },
    {
        "content": "SINGAPORE/NEW YORK  Jan 9 Australian bank Macquarie Group Ltd's aircraft leasing subsidiary is in exclusive talks to buy a portfolio of new planes from Dublin-based lessor AWAS for more than $4 billion  according to people familiar with the matter.",
        "date": "01092015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "UPDATE 1-Macquarie in exclusive talks to buy planes from lessor AWAS for more than $4 bln -sources "
    },
    {
        "content": "SINGAPORE/NEW YORK  Jan 9 Australian bank Macquarie Group Ltd's aircraft leasing subsidiary is in exclusive talks to buy a portfolio of new planes from Dublin-based lessor AWAS for more than $4 billion  according to people familiar with the matter.",
        "date": "01092015",
        "name": "Orix Corp Ads",
        "news_type": "normal",
        "symbol": "IX",
        "title": "Macquarie in exclusive talks to buy jets from lessor AWAS for more than $4 bln -sources "
    }
]