[
    {
        "content": "* Jazz pharmaceuticals announces third quarter 2017 financial results",
        "date": "11072017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals posts Q3 EPS of $1.03 "
    },
    {
        "content": "* Jazz Pharmaceuticals submits Vyxeos™ Marketing Authorization Application to European Medicines Agency for treatment of certain types of high-risk acute myeloid leukemia Source text for Eikon: Further company coverage:",
        "date": "11032017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharma submits Vyxeo Marketing Authorization Application to European Medicines Agency "
    },
    {
        "content": "* Jazz Pharmaceuticals Plc - ‍offering of $500 million aggregate principal amount of 1.50% exchangeable senior notes due 2024​",
        "date": "08182017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharma announces $500 mln offering of 1.50 pct exchangeable senior notes due 2024 "
    },
    {
        "content": "* Jazz Pharmaceuticals announces offering of $500 million of exchangeable senior notes due 2024",
        "date": "08172017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmac announces offering of $500 mln of exchangeable senior notes "
    },
    {
        "content": "* Jazz Pharmaceuticals announces second quarter 2017 financial results",
        "date": "08082017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals Q2 adjusted earnings per share $2.56 "
    },
    {
        "content": "* Jazz Pharmaceuticals announces FDA approval of Vyxeos™ (Daunorubicin and Cytarabine) liposome for injection for the treatment of adults with newly-diagnosed therapy-related acute myeloid leukemia (t-AML) or AML with myelodysplasia-related changes (AML-MRC)",
        "date": "08032017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals announces FDA approval of Vyxeos "
    },
    {
        "content": "* Jazz Pharmaceuticals and XL-protein GmbH enter into a license agreement on PASylation technology to develop long-acting asparaginase product candidates",
        "date": "07262017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals and XL-protein GmbH enter into license agreement "
    },
    {
        "content": "* Jazz Pharmaceuticals  says on June 28  its unit entered into a pharmacy master services agreement with express scripts specialty distribution services",
        "date": "07032017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals says on June 28  its unit entered into pharmacy master services agreement with Express Scripts specialty distribution services "
    },
    {
        "content": "* Jazz Pharmaceuticals presents data for the phase 3 tones 2 study of JZP-110 in patients with excessive sleepiness associated with narcolepsy",
        "date": "06062017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals presents data for study of JZP-110 in patients "
    },
    {
        "content": "* Jazz pharmaceuticals to present phase 3 data on jzp-110  an investigational treatment for excessive sleepiness in patients with narcolepsy and with obstructive sleep apnea  during 31st annual sleep meeting Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharma to present key data on sleeping disorder drug at meeting "
    },
    {
        "content": "* Jazz pharmaceuticals announces first quarter 2017 financial results",
        "date": "05092017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz pharmaceuticals announces Q1 2017 financial results "
    },
    {
        "content": "* Jazz Pharmaceuticals announces positive results from the phase 3 tones 2 study of jzp-110 in narcolepsy patients with excessive sleepiness",
        "date": "04262017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals announces positive results of JZP-110 study "
    },
    {
        "content": "* Jazz Pharmaceuticals announces positive results from the phase 2/3 express study of xyrem in pediatric patients with narcolepsy with cataplexy",
        "date": "04242017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals reports psoitive data from phase 2/3 study of Xyrem "
    },
    {
        "content": "* Jazz Pharmaceuticals reaches settlement with Hikma Pharmaceuticals related to Xyrem patent litigation",
        "date": "04052017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharma settles Xyrem patent litigation with Hikma Pharma "
    },
    {
        "content": "* Jazz pharmaceuticals completes rolling submission of new drug application for vyxeos™ (cpx-351)  an investigational treatment for acute myeloid leukemia",
        "date": "04032017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharma says completes rolling submission of NDA for Vyxeos (CPX-351) "
    },
    {
        "content": "* Enters into settlement agreement with Jazz for sodium oxybate",
        "date": "04062017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "RPT-BRIEF-Hikma enters into settlement agreement with Jazz "
    },
    {
        "content": "* Enters into settlement agreement with Jazz for sodium oxybate",
        "date": "04062017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "normal",
        "symbol": "JAZZ",
        "title": "BRIEF-Hikma enters into settlement agreement with Jazz "
    },
    {
        "content": "* Jazz Pharmaceuticals Plc - co and Nippon Shinyaku enter into license agreements for development and commercialization of Defitelio and Vyxeos in Japan",
        "date": "03302017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz pharmaceuticals and Nippon Shinyaku enter into license agreements for development and commercialization of Defitelio and Vyxeos in Japan "
    },
    {
        "content": "* Jazz pharmaceuticals announces positive results from the phase 3 tones 3 and tones 4 studies of jzp-110 in patients with obstructive sleep apnea  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals announces positive results from phase 3 tones 3 and tones 4 studies of JZP-110 "
    },
    {
        "content": "* Jazz Pharmaceuticals Plc sees 2017 revenues $1 625-$1 700 million",
        "date": "02282017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals Q4 adj earnings per share $2.71 "
    },
    {
        "content": "* Jazz Pharmaceuticals announces first patient enrolled in Phase 2 clinical study evaluating JZP-110 for excessive sleepiness in Parkinson's disease",
        "date": "02082017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals announces first patient enrolled in phase 2 clinical study evaluating JZP-110 for excessive sleepiness in Parkinson's disease "
    },
    {
        "content": "* Jazz Pharmaceuticals says it will evaluate FDA's waiver of requirement for a single  shared system rems in connection with approval of a generic version of Xyrem",
        "date": "01182017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals comments on FDA nod for generic version of Xyrem "
    },
    {
        "content": "Jan 17 The U.S. Food and Drug Administration said on Tuesday it had approved the first generic version of Xyrem  Jazz Pharmaceuticals Plc's drug to treat patients with a medical condition that causes excessive daytime sleepiness. (http://bit.ly/2jHzIS9)",
        "date": "01172017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "normal",
        "symbol": "JAZZ",
        "title": "FDA approves generic version of Jazz Pharma's sleep disorder drug "
    },
    {
        "content": "Jan 17 The U.S. Food and Drug Administration said it had approved the first generic version of Xyrem  Jazz Pharmaceuticals Plc's drug to treat patients with narcolepsy  a kind of sleeping disorder.",
        "date": "01172017",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "normal",
        "symbol": "JAZZ",
        "title": "UPDATE 1-FDA approves generic version of Jazz Pharma's sleep disorder drug "
    },
    {
        "content": "* Jazz Pharmaceuticals announces third quarter 2016 financial results",
        "date": "11082016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals posts Q3 adj. earnings $2.57/shr "
    },
    {
        "content": "* Expects to complete submission of NDA by early 2017  and will request a priority review.",
        "date": "10032016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz pharmaceuticals plc - initiates rolling nda submission "
    },
    {
        "content": "* Jazz pharmaceuticals announces second quarter 2016 financial results",
        "date": "08092016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharma Q2 adjusted earnings per share $2.63 "
    },
    {
        "content": "* Tender offer is being effected by Jazz Pharmaceuticals' indirect wholly-owned subsidiary  Plex Merger Sub",
        "date": "07122016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals says majority of Celator's outstanding shares has been validly tendered "
    },
    {
        "content": "* Presents new data from a human abuse liability study for JZP-110  an investigational treatment for excessive sleepiness in patients with narcolepsy or with OBSTR",
        "date": "06142016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharma presents data from study for treatment for excessive sleepiness "
    },
    {
        "content": "* Stable rating outlook reflects expectation that leverage will remain comfortably below 3x",
        "date": "05312016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-S&P-Jazz Pharmaceuticals Plc ratings affirmed on Celator acquisition plan outlook stable "
    },
    {
        "content": "* If merger is terminated with respect to an unsolicited superior proposal  Celator to pay termination fee of $45.8 million - SEC filing  Source text (http://1.usa.gov/1RIjjF1) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05312016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "normal",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharma says termination fee for Celator deal is $45.8 mln "
    },
    {
        "content": "Ireland-based Jazz Pharmaceuticals Plc will buy U.S.-based Celator Pharmaceuticals Inc in a cash deal valued at about $1.5 billion  to gain access to an investigational product in development for treating acute myeloid leukemia.",
        "date": "05312016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "normal",
        "symbol": "JAZZ",
        "title": "Jazz Pharma to buy Celator in $1.5 billion deal "
    },
    {
        "content": "May 31 Ireland-based Jazz Pharmaceuticals Plc  will buy Celator Pharmaceuticals Inc in a deal valued at about $1.5 billion  to gain access to Celator's investigational product in development for treating acute myeloid leukemia.",
        "date": "05312016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "normal",
        "symbol": "JAZZ",
        "title": "Jazz Pharma to buy Celator in $1.5 bln deal "
    },
    {
        "content": "Ireland-based Jazz Pharmaceuticals Plc is nearing a deal to buy Celator Pharmaceuticals Inc for about $1.5 billion  the Wall Street Journal reported.",
        "date": "05312016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "normal",
        "symbol": "JAZZ",
        "title": "Jazz Pharma nears deal to buy Celator for about $1.5 billion - WSJ "
    },
    {
        "content": "May 30 Ireland-based Jazz Pharmaceuticals Plc  is nearing a deal to buy Celator Pharmaceuticals Inc  for about $1.5 billion  the Wall Street Journal reported.",
        "date": "05312016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "normal",
        "symbol": "JAZZ",
        "title": "Jazz Pharma nears deal to buy Celator for about $1.5 bln -WSJ "
    },
    {
        "content": "* Sees 2016 non-gaap adjusted net income per diluted share $11.10-$11.50",
        "date": "05102016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "BRIEF-Jazz Pharmaceuticals Q1 gaap earnings per share $1.19 "
    },
    {
        "content": "March 30 The U.S. Food and Drug Administration has cleared Jazz Pharmaceuticals Plc's drug to treat a rare kind of liver disease  making it the first treatment to win U.S. approval for the condition.",
        "date": "03302016",
        "name": "Jazz Pharmaceuticals plc",
        "news_type": "topStory",
        "symbol": "JAZZ",
        "title": "Jazz Pharmaceuticals' rare liver disorder drug wins U.S. approval "
    }
]