[
    {
        "content": "* Private home building reverses downtrend in Aussie construction",
        "date": "11152017",
        "name": "James Hardie Industries plc",
        "news_type": "normal",
        "symbol": "JHX",
        "title": "REFILE-Fringe benefits: Home demand in outer Australian cities prolongs building boom "
    },
    {
        "content": "* HY ‍net profit attributable to shareholders $123.8​ million  down 14 percent",
        "date": "11082017",
        "name": "James Hardie Industries plc",
        "news_type": "topStory",
        "symbol": "JHX",
        "title": "BRIEF-James Hardie Industries HY net profit $123.8​ mln "
    },
    {
        "content": "Nov 8 James Hardie Industries Plc said on Wednesday that it would buy the German holding company of fiber gypsum board maker Fermacell GmbH from Xella International SA in a transaction valued at 473 million euros ($548 million) in cash.",
        "date": "11072017",
        "name": "James Hardie Industries plc",
        "news_type": "normal",
        "symbol": "JHX",
        "title": "James Hardie Industries to buy Germany's Fermacell "
    },
    {
        "content": "Nov 8 Australia-listed James Hardie Industries Plc said on Wednesday it would buy the German holding company of fiber gypsum board maker Fermacell GmbH from Xella International SA in a deal worth 473 million euros ($548 million).",
        "date": "11072017",
        "name": "James Hardie Industries plc",
        "news_type": "normal",
        "symbol": "JHX",
        "title": "UPDATE 1-James Hardie Industries to buy Germany's Fermacell "
    },
    {
        "content": "* To buy XI (DL) Holdings GmbH from Xella International S.A. for all-cash deal valued at EUR 473 million​",
        "date": "11072017",
        "name": "James Hardie Industries plc",
        "news_type": "normal",
        "symbol": "JHX",
        "title": "BRIEF-James Hardie Industries ‍to buy XI (DL) Holdings GmbH from Xella International S.A. "
    },
    {
        "content": "* Qtrly net profit attributable to shareholders US$‍57.4​ million versus US$87.1 million",
        "date": "08072017",
        "name": "James Hardie Industries plc",
        "news_type": "topStory",
        "symbol": "JHX",
        "title": "BRIEF-James Hardie Industries says qtrly net profit attributable US$57.4​ million versus US$87.1 million "
    },
    {
        "content": "May 18 James Hardie Industries Plc  the world's top fiber cement building materials maker  reported a 13 percent rise in full-year net profit on Thursday as a reduction in compensation payouts for asbestos diseases boosted the bottom line.",
        "date": "05172017",
        "name": "James Hardie Industries plc",
        "news_type": "topStory",
        "symbol": "JHX",
        "title": "UPDATE 1-Australia's James Hardie full-year profit rises 13 pct "
    },
    {
        "content": "* Appointed Steven E. Simms as an independent non-executive director of James Hardie effective 14 May 2017 Source text for Eikon: Further company coverage:",
        "date": "05152017",
        "name": "James Hardie Industries plc",
        "news_type": "topStory",
        "symbol": "JHX",
        "title": "BRIEF-James Hardie Industries appoints Steven E. Simms as an independent non-executive director "
    },
    {
        "content": "May 18 James Hardie Industries Plc  the world’s top fiber cement building materials maker  said its full-year net profit rose 13 percent on robust performance in North America in the fourth quarter.",
        "date": "05172017",
        "name": "James Hardie Industries plc",
        "news_type": "normal",
        "symbol": "JHX",
        "title": "Australia’s James Hardie full-year profit up 13 percent "
    },
    {
        "content": "SYDNEY  Feb 3 Australia's James Hardie Industries Plc  the world's biggest maker of fibre cement home panelling  cut its guidance and said third-quarter net profit fell 6 percent  as the company missed manufacturing targets and forecast an uncertain future for the U.S. housing market.",
        "date": "02022017",
        "name": "James Hardie Industries plc",
        "news_type": "topStory",
        "symbol": "JHX",
        "title": "Australia's James Hardie says Q3 net profit falls 6 pct "
    },
    {
        "content": "SYDNEY  Feb 3 Australia's James Hardie Industries Plc  the world No. 1 maker of fibre cement home panelling  cut its guidance as unexpectedly high production costs hit third-quarter profit  sending its shares down by the most in eight months.",
        "date": "02032017",
        "name": "James Hardie Industries plc",
        "news_type": "topStory",
        "symbol": "JHX",
        "title": "UPDATE 1-Australia's James Hardie cuts full-year guidance again "
    },
    {
        "content": "* 9-mnth net profit US$ 232.0 million versus US$ 215.6 million",
        "date": "02022017",
        "name": "James Hardie Industries plc",
        "news_type": "normal",
        "symbol": "JHX",
        "title": "BRIEF-James Hardie Industries 9-mnth net profit up 8 pct "
    },
    {
        "content": "* Recovering after 2-month tumble   (Adds analysis  quotes  stocks on the move)",
        "date": "05212015",
        "name": "James Hardie Industries plc",
        "news_type": "topStory",
        "symbol": "JHX",
        "title": "Australia shares bounce as investors swoop on discounts after 2-month rout "
    }
]