[
    {
        "content": "* Network-1 announces settlement of patent litigation with Juniper Networks  Inc.",
        "date": "11032017",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Network-1 posts settlement of patent litigation with Juniper Networks "
    },
    {
        "content": "* Finjan files a complaint against Juniper Networks for patent infringement in the northern district of California",
        "date": "10022017",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Finjan files patent infringement lawsuit against Juniper Networks "
    },
    {
        "content": "* Capital Research Global Investors Reports 1.9 percent passive stake in Juniper Networks Inc as of June 30  2017 - ‍​SEC filing",
        "date": "07102017",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Capital Research Global Investors reports 1.9 pct passive stake in Juniper Networks - ‍​SEC filing "
    },
    {
        "content": "* Juniper Networks Inc - CEO Rami Rahim's 2016 total compensation was $7.5 million versus $9.4 million in 2015 Source text: (http://bit.ly/2okf1jz) Further company coverage:",
        "date": "04102017",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Juniper Networks Inc CEO's 2016 total compensation was $7.5 mln "
    },
    {
        "content": "* Ceo rami rahim's fy 2016 total compensation $7.5 million versus $9.4 million in fy 2015 - sec filing",
        "date": "03232017",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Juniper Networks CEO Rami Rahim's FY 2016 compensation $7.5 mln vs $9.4 mln in FY 2015 "
    },
    {
        "content": "March 7 Gary Clark  a former IT chief technology officer at Juniper Networks Inc  joined Tesla Inc  in February as its chief information officer  according to Clark's LinkedIn profile.",
        "date": "03082017",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "Juniper's Gary Clark joins Tesla as chief information officer "
    },
    {
        "content": "* Juniper Networks announces organizational changes to accelerate innovation",
        "date": "03072017",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Juniper Networks announces organizational changes to accelerate innovation "
    },
    {
        "content": "* Juniper Networks Inc - on February 16  2017  Audit Committee Of Board approved an increase to company's existing stock repurchase authorization by $500 million  Source text for Eikon: Further company coverage:    ;))",
        "date": "02222017",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Board approves increase to Juniper Networks' existing stock repurchase authorization "
    },
    {
        "content": "* Juniper Networks reports preliminary third quarter 2016 financial results",
        "date": "10252016",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Juniper Networks reports preliminary Q3 2016 financial results "
    },
    {
        "content": "* Q3 earnings per share view $0.54  revenue view $1.24 billion -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07262016",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Juniper Networks Q3 earnings per share view $0.54 "
    },
    {
        "content": "* Announces appointment of Mitchell Gaynor as chief legal officer",
        "date": "05192016",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Marvell Technology Group appoints Mitchell Gaynor as chief legal officer "
    },
    {
        "content": "* \"although we expect results to be lower than our initial guidance for Q1  we remain constructive on fiscal 2016\"",
        "date": "04112016",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "BRIEF-Juniper networks expect Q1 results to be lower than initial guidance "
    },
    {
        "content": "April 11 Network gear maker Juniper Networks Inc  estimated lower-than-expected quarterly profit and revenue  hurt by weak demand from enterprise as well as U.S. and European telecom customers.",
        "date": "04112016",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "Juniper estimates disappoint as enterprise demand falls "
    },
    {
        "content": "SAN FRANCISCO  Jan 28 A U.S. congressional probe into the impact of a hack of Juniper Networks Inc  software will examine the possibility that it was initially altered at the behest of the National Security Agency  a lawmaker said in an interview on Thursday.",
        "date": "01292016",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "RPT-Congress to probe Juniper 'back door' exposure  possible U.S. involvement "
    },
    {
        "content": "SAN FRANCISCO  Jan 28 A U.S. congressional probe into the impact of a hack of Juniper Networks Inc  software will examine the possibility that it was initially altered at the behest of the National Security Agency  a lawmaker said in an interview on Thursday.",
        "date": "01292016",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "Congress to probe Juniper 'back door' exposure  possible U.S. involvement "
    },
    {
        "content": "SAN FRANCISCO  Jan 8 Juniper Networks Inc said late on Friday it would stop using a piece of security code that analysts believe was developed by the National Security Agency in order to eavesdrop through technology products.",
        "date": "01092016",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "Juniper Networks will drop code tied to National Security Agency "
    },
    {
        "content": "BOSTON Networking equipment maker Cisco Systems Inc said on Monday it has launched a product review to look for tampering after rival Juniper Networks Inc's disclosure found code in firewall software that made it vulnerable to cyber attacks.",
        "date": "12222015",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "Cisco reviews code after Juniper breach; more scrutiny expected "
    },
    {
        "content": "WASHINGTON A Juniper Networks Inc software coding vulnerability disclosed last week shows the dangers of any weaknesses built into encryption technology  according to computer security experts.",
        "date": "12232015",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "Juniper breach reflects risk of 'back doors': researchers "
    },
    {
        "content": "BOSTON Networking equipment maker Cisco Systems Inc said on Monday it has launched a product review to look for tampering after rival Juniper Networks Inc's disclosure it found code in firewall software that made in vulnerable to cyber attacks.",
        "date": "12212015",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "Cisco reviews code after Juniper breach; more scrutiny expected "
    },
    {
        "content": "WASHINGTON  Dec 23 A Juniper Networks Inc  software coding vulnerability disclosed last week shows the dangers of any weaknesses built into encryption technology  according to computer security experts.",
        "date": "12232015",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "Juniper breach reflects risk of 'back doors' - researchers "
    },
    {
        "content": "BOSTON  Dec 21 Networking equipment maker Cisco Systems Inc said on Monday it has launched a product review to look for tampering after rival Juniper Networks Inc's  disclosure it found code in firewall software that made in vulnerable to cyber attacks.",
        "date": "12212015",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "UPDATE 1-Cisco reviews code after Juniper breach; more scrutiny expected "
    },
    {
        "content": "BOSTON  Dec 21 Cisco Systems Inc said on Monday that it is reviewing its product code for \"malicious modification\" in the wake of rival Juniper Networks Inc's  disclosure last week that it had found unauthorized code in its firewall software.",
        "date": "12212015",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "Cisco reviewing product code after Juniper software was altered "
    },
    {
        "content": "The U.S. Federal Bureau of Investigation is probing a breach at network gear maker Juniper Networks Inc on suspicion that a foreign government might be responsible for inserting rogue code that could enable spying  CNN reported on Friday   citing unnamed U.S. officials.   ",
        "date": "12182015",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "FBI probes breach at Juniper Networks: CNN "
    },
    {
        "content": "The U.S. government is investigating unauthorized code inserted in software from Juniper Networks Inc  which experts warned could be a \"back door\" used to spy on the networking equipment maker's customers  an official told Reuters on Friday.",
        "date": "12192015",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "U.S. reviews possible 'back door' in Juniper Networks code "
    },
    {
        "content": "Dec 18 The U.S. government is investigating unauthorized code inserted in software from Juniper Networks Inc   which experts warned could be a \"back door\" used to spy on the networking equipment maker's customers  an official told Reuters on Friday.",
        "date": "12192015",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "UPDATE 1-U.S. reviews possible 'back door' in Juniper Networks code "
    },
    {
        "content": "July 23 Juniper Networks Inc's shares rose nearly 10 percent after the network gear maker said second-quarter adjusted profit was above analysts' expectations because of growth in its services business.",
        "date": "07232015",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "Juniper shares jump after profit estimates beat Wall Street "
    },
    {
        "content": "Thomson Reuters May 15  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05152015",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "Feb 24 Juniper Networks Inc appointed two independent directors to its board and said activist investor Elliott Management Corp would support the network gear maker's nominations.",
        "date": "02242015",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "Juniper Networks adds two directors in agreement with Elliott "
    },
    {
        "content": "Network gear maker Juniper Networks Inc  reported a better-than-expected adjusted quarterly profit as cost-cutting paid off  sending its shares up 4.4 pct in after-hours trading.",
        "date": "01272015",
        "name": "Juniper Networks Inc",
        "news_type": "topStory",
        "symbol": "JNPR",
        "title": "Juniper Networks profit beats as cost cuts bear fruit "
    },
    {
        "content": "Jan 27 Network gear maker Juniper Networks Inc  reported a better-than-expected adjusted quarterly profit as cost-cutting paid off  sending its shares up 4.4 pct in after-hours trading.",
        "date": "01272015",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "UPDATE 1-Juniper Networks profit beats as cost cuts bear fruit "
    },
    {
        "content": "Jan 27 Network gear maker Juniper Networks Inc  reported a 13.5 percent fall in quarterly revenue  hurt by delayed spending by telecom service providers.",
        "date": "01272015",
        "name": "Juniper Networks Inc",
        "news_type": "normal",
        "symbol": "JNPR",
        "title": "Juniper revenue falls on weak demand from telecom companies "
    }
]