[
    {
        "content": "* Juno Therapeutics reports third quarter 2017 financial results",
        "date": "11012017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics reports Q3 adjusted loss per share ‍$0.73​ "
    },
    {
        "content": "* Trianni and Juno Therapeutics sign licensing agreement for use of Trianni Transgenic Mouse platform",
        "date": "10182017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics and Trianni sign licensing agreement for use of Trianni Transgenic Mouse platform "
    },
    {
        "content": "* Juno Therapeutics- Announced pricing of its follow-on public offering of 6.1 million shares of its common stock at a price to public of $41.00 per share Source text for Eikon: Further company coverage:",
        "date": "09222017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics prices $250 million follow-on offering "
    },
    {
        "content": "* Juno Therapeutics Inc - Files for offering of common stock; aggregate offering price of $225 million - SEC Filing‍​ Source text for Eikon: Further company coverage:",
        "date": "09202017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics files for offering of common stock aggregate offering price of $225 mln - SEC Filing‍​ "
    },
    {
        "content": "* Juno Therapeutics reports second quarter 2017 financial results",
        "date": "08032017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics qtrly ‍loss per share $0.96 "
    },
    {
        "content": "CHICAGO  June 5 Kite Pharma Inc and Juno Therapeutics Inc on Monday presented new data for their experimental T-cell therapies  but investors were not overly impressed and shares of Juno fell nearly 11 percent.",
        "date": "06052017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "UPDATE 1-Kite to launch mid-stage leukemia trial in fourth quarter 2017 "
    },
    {
        "content": "May 26 Kite Pharma Inc on Friday said the U.S. Food and Drug Administration will review its experimental drug axicabtagene ciloleucel on a priority basis as a treatment for advanced non-Hodgkin lymphoma  a cancer that starts in white blood cells.",
        "date": "05262017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "Kite CAR-T gets FDA priority review  Juno shares fall "
    },
    {
        "content": "* Juno Therapeutics reports first quarter 2017 financial results",
        "date": "05042017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics reports Q1 loss per share $0.79 "
    },
    {
        "content": "SAN FRANCISCO European ride service Gett has bought U.S. rival Juno for $200 million in a deal that further consolidated the ride-hailing industry and that some said short-changed Juno drivers.",
        "date": "04262017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "European ride service Gett buys U.S. rival Juno for $200 million "
    },
    {
        "content": "SAN FRANCISCO  April 26 European ride service Gett has bought U.S. rival Juno for $200 million in a deal that further consolidated the ride-hailing industry and that some said short-changed Juno drivers.",
        "date": "04262017",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "European ride service Gett buys U.S. rival Juno for $200 mln "
    },
    {
        "content": "BERLIN On-demand ride service company Gett  a partner of Volkswagen   has agreed to buy U.S. rival Juno for $250 million  German magazine Capital reported  without citing the source of the information.",
        "date": "04262017",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "VW's ride service partner Gett buys Juno for $250 million: Capital "
    },
    {
        "content": "BERLIN  April 26 On-demand ride service company Gett  a partner of Volkswagen  has agreed to buy U.S. rival Juno for $250 million  German magazine Capital reported  without citing the source of the information.",
        "date": "04262017",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "VW's ride service partner Gett buys Juno for $250 mln -Capital "
    },
    {
        "content": "March 1 Juno Therapeutics Inc on Wednesday said it decided to shut down development of an experimental leukemia treatment from a highly promising new class of immunotherapy following an investigation into toxicity that led to a handful of patient deaths.",
        "date": "03012017",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "Juno ends development of high-profile leukemia drug after deaths "
    },
    {
        "content": "* Juno Therapeutics reports fourth quarter and 2016 financial results",
        "date": "03012017",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics reports qtrly  net loss per share $0.51 "
    },
    {
        "content": "* Vanguard Group Inc reports 5.52 percent passive stake in Juno Therapeutics Inc as of Dec. 31  2016 - sec filing  Source text (http://bit.ly/2kua0R2) Further company coverage:",
        "date": "02102017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Vanguard Group reports 5.52 pct passive stake in Juno Therapeutics as of Dec. 31  2016 "
    },
    {
        "content": "* Juno Therapeutics appoints Corsee D. Sanders as executive vice president and head of development operations  Source text for Eikon:  Further company coverage:",
        "date": "01272017",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics appoints Corsee Sanders as head of development operations "
    },
    {
        "content": "Juno Therapeutics Inc said two more patients had died after suffering brain swelling during a trial of its experimental genetically engineered leukemia drug  bringing the total up to five.",
        "date": "11232016",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "Juno says two more patients die in leukemia drug trial "
    },
    {
        "content": "* Shares fall as much as 35 pct   (Adds conference call details  background; updates shares)",
        "date": "11232016",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "UPDATE 3-Juno says two more patients die in leukemia drug trial "
    },
    {
        "content": "* Revenue for three months ended September 30 was $20.8 million compared to $1.6 million",
        "date": "11092016",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics reports qtrly net loss of $0.56 per share "
    },
    {
        "content": "* Juno Therapeutics reports second quarter 2016 financial results",
        "date": "08042016",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics reports Q2 loss per share $0.64 "
    },
    {
        "content": "* Collaboration includes BCMA CAR constructs with fully-human binding domains",
        "date": "08042016",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics Inc - collaboration includes BCMA CAR constructs with fully-human binding domains "
    },
    {
        "content": "* Juno Therapeutics adds adenosine receptor antagonist through acquisition of redoxtherapies",
        "date": "07142016",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics adds adenosine receptor antagonist through acquisition of redoxtherapies "
    },
    {
        "content": "Juno Therapeutics Inc  said U.S. health regulators have removed a clinical hold on its cancer drug trial that was put in place last week following the death of three patients  sending its shares up about 28 percent in extended trading.",
        "date": "07122016",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "Shares of Juno Therapeutics jump after FDA removes clinical hold on cancer drug trial "
    },
    {
        "content": "July 12 Juno Therapeutics Inc said U.S. health regulators have removed a clinical hold on its cancer drug trial that was put in place last week following the death of three patients  sending its shares up about 28 percent in extended trading.",
        "date": "07122016",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "FDA removes clinical hold on Juno's cancer drug trial; shares rise "
    },
    {
        "content": "* Rocket trial will continue enrollment using JCAR015 with cyclophosphamide pre-conditioning only",
        "date": "07122016",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics to resume JCAR015 phase II rocket trial "
    },
    {
        "content": "July 7 A trial of Juno Therapeutics Inc's  genetically engineered cancer therapy  known as JCAR015  was put on hold by U.S. regulators after three leukemia patients died from side effects  the company said on Thursday.",
        "date": "07072016",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "UPDATE 2-Juno cancer study halted after patient deaths  shares slide 30 pct "
    },
    {
        "content": "A Juno Therapeutics Inc trial of its experimental cancer therapy  known as JCAR015  was put on hold by U.S. regulators after the deaths last week of two leukemia patients  the company said on Thursday.",
        "date": "07072016",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "Juno cancer study halted after patient deaths  shares slide 30 pct "
    },
    {
        "content": "July 7 A Juno Therapeutics Inc trial of its experimental CAR-T therapy  known as JCAR015  was put on hold by U.S. regulators after the deaths last week of two leukemia patients enrolled in the study  the company said on Thursday.",
        "date": "07072016",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "Juno cancer study halted after patient deaths  shares fall 30 pct "
    },
    {
        "content": "* Says trials and plans for its other CD19-directed CAR-T cell product candidates  including JCAR017  are not affected",
        "date": "07072016",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "BRIEF-Juno Therapeutics reports clinical hold on the JCAR015 Phase II rocket trial "
    },
    {
        "content": "CHICAGO A new wave of experimental cancer drugs that directly recruit the immune system's powerful T cells could begin reaching patients next year  according to companies presenting new data at the annual meeting of the American Society of Clinical Oncology.",
        "date": "06042016",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "Cancer cell therapies could be approved next year: Juno  Kite Pharma "
    },
    {
        "content": "CHICAGO  June 4 A new wave of experimental cancer drugs that directly recruit the immune system's powerful T cells could begin reaching patients next year  according to companies presenting new data at the annual meeting of the American Society of Clinical Oncology.",
        "date": "06042016",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "Juno  Kite Pharma: cancer cell therapies could be approved next year "
    },
    {
        "content": "* Baillie Gifford & Co reports 10.49 pct passive stake in Juno Therapeutics as of March 31 - SEC FILING  Source text - http://1.usa.gov/1UL1Ums Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04072016",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "BRIEF-Baillie Gifford & Co reports 10.49 pct passive stake in Juno Therapeutics as of March 31 - SEC FILING "
    },
    {
        "content": "Celgene Corp on Monday launched a 10-year partnership with Juno Therapeutics  announcing a $1 billion investment aimed at bringing to market Juno technologies that harness the immune system to treat cancer and autoimmune diseases.",
        "date": "06292015",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "Celgene to invest $1 billion in Juno to partner in cancer therapies "
    },
    {
        "content": "June 29 Celgene Corp on Monday launched a 10-year partnership with Juno Therapeutics  announcing a $1 billion investment aimed at bringing to market Juno technologies that harness the immune system to treat cancer and autoimmune diseases.",
        "date": "06292015",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "UPDATE 2-Celgene to invest $1 bln in Juno to partner in cancer therapies "
    },
    {
        "content": "June 29 Celgene Corp and Juno Therapeutics Inc said they signed a deal to develop and commercialize immunotherapies for the treatment of cancer and autoimmune diseases.",
        "date": "06292015",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "REFILE-Celgene  Juno collaborate to develop cancer therapies "
    },
    {
        "content": "AstraZeneca Plc   would consider acquiring a developer of a new type of cancer therapy aimed at supercharging the body's immune response  Bloomberg quoted Chief Executive Pascal Soriot as saying on Tuesday.",
        "date": "06022015",
        "name": "Juno Therapeutics Inc",
        "news_type": "topStory",
        "symbol": "JUNO",
        "title": "AstraZeneca would consider buying immune-therapy company: Bloomberg "
    },
    {
        "content": "* Economic slowdown may be more than temporary-Fed's Brainard",
        "date": "06022015",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "US STOCKS-Wall St pares losses as data  Fed comments allay rate hike fears "
    },
    {
        "content": "June 2 AstraZeneca Plc  would consider buying a company such as Juno Therapeutics Inc   Bloomberg reported  AstraZeneca's CEO as saying  according to StreetInsider.",
        "date": "06022015",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "AstraZeneca may consider buying company such as Juno - Bloomberg "
    },
    {
        "content": "April 23 A unit of AstraZeneca Plc   has teamed up with Juno Therapeutics Inc to develop combination treatments that use the body's immune system to kill cancer cells.",
        "date": "04232015",
        "name": "Juno Therapeutics Inc",
        "news_type": "normal",
        "symbol": "JUNO",
        "title": "AstraZeneca  Juno latest to collaborate on immuno-oncology drugs "
    }
]