[
    {
        "content": "* Nordstrom Inc - ‍board of directors approved a quarterly dividend of 37 cents per share payable on December 12  2017​ Source text for Eikon: Further company coverage:",
        "date": "11152017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom board of directors approves quarterly dividend "
    },
    {
        "content": "CHICAGO  Nov 9 Nordstrom Inc reported worse-than-expected quarterly same-store sales on Thursday  hurt partly by hurricanes that affected sales in Puerto Rico  Florida  and Texas.",
        "date": "11092017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom posts lower-than-expected quarterly same-store sales "
    },
    {
        "content": "CHICAGO  Nov 9 Nordstrom Inc on Thursday reported its quarterly same-store sales fell 0.9 percent from the year-ago period  worse-than-expected  as hurricanes affected traffic in Puerto Rico  Florida and Texas.",
        "date": "11092017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 2-Nordstrom posts lower-than-expected quarterly same-store sales "
    },
    {
        "content": "* Q3 earnings per share view $0.63 -- Thomson Reuters I/B/E/S",
        "date": "11092017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom posts Q3 earnings per share $0.67 "
    },
    {
        "content": "* Planning to hire approximately 13 650 employees before holidays​ Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom ‍planns to hire about 13 650 employees before holidays​ "
    },
    {
        "content": "TORONTO/BENGALURU  Oct 16 Shares in Hudson's Bay Co  which is reviewing strategic options including privatization  fell as much as 5.5 percent on Monday  after rival Nordstrom Inc's failed attempt to go private spooked sentiment for other U.S. retailers  analysts said.",
        "date": "10162017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "UPDATE 2-HBC falls after shelved Nordstrom privatization plan drags down retailers "
    },
    {
        "content": "Nordstrom Inc said on Monday that a founding family group had suspended attempts to take the U.S. department store operator private because of difficulties in arranging debt financing for its bid ahead of the key holiday shopping season.",
        "date": "10162017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom family suspends attempt to take U.S. retailer private "
    },
    {
        "content": "Oct 16 Nordstrom Inc said on Monday that a founding family group had suspended attempts to take the U.S. department store operator private because of difficulties in arranging debt financing for its bid ahead of the key holiday shopping season.",
        "date": "10162017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 2-Nordstrom family suspends attempt to take U.S. retailer private "
    },
    {
        "content": "DALLAS (Reuters Breakingviews) - Retailers hoping to put themselves up for sale are in for a long winter. Take Nordstrom. With large insider stakes and growing revenue  the $6.7 billion department-store chain was a prime candidate for a buyout. Now it is shelving its sale until after the holidays. It may be hoping for a higher price. But the delay suggests even risk-tolerant buyers are cool on the sector.",
        "date": "10162017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Breakingviews - Nordstrom sale season may be long time coming "
    },
    {
        "content": "Oct 16 Nordstrom Inc said on Monday its founding family had suspended attempts to take the upscale retailer private for the rest of the year due to difficulties in arranging funds for the deal ahead of the holiday season.",
        "date": "10162017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom family suspends attempt to take retailer private "
    },
    {
        "content": "* In light of difficulty obtaining debt financing in current retail environment  suspended exploration of going private deal for rest of year‍​",
        "date": "10162017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom family to temporarily suspend exploring going private deal for Nordstrom "
    },
    {
        "content": "* Company plans to open six Nordstrom Rack stores in Canada next year Source text for Eikon: Further company coverage:",
        "date": "09152017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom opens at CF Sherway Gardens in Toronto "
    },
    {
        "content": "* Dow flat  S&P off 0.03 pct  Nasdaq down 0.06 pct (Adds details  comment  updates prices)",
        "date": "09132017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Apple halts Wall St rally  but S&P ekes out record high "
    },
    {
        "content": "* Futures lower: Dow 14 pts  S&P 3.75 pts  Nasdaq 12 pts (Adds details  comment  updates prices)",
        "date": "09132017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St set to open lower on Apple  N. Korea worries "
    },
    {
        "content": "Nordstrom Inc's  founding family has selected private equity firm Leonard Green & Partners to help take the high-end retailer private  according to a source familiar with the matter.",
        "date": "09122017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Nordstrom family chooses Leonard Green as buyout partner: source "
    },
    {
        "content": "Sept 12 Nordstrom Inc's founding family has selected private equity firm Leonard Green & Partners to help take the high-end retailer private  according to a source familiar with the matter.",
        "date": "09122017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 1-Nordstrom family chooses Leonard Green as buyout partner - source "
    },
    {
        "content": "* Indexes up: Dow 0.28 pct  S&P 0.34 pct  Nasdaq 0.34 pct (Updates with all major indexes at record high; adds Nordstrom)",
        "date": "09122017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St ends at record high  led by banks; Apple weighs "
    },
    {
        "content": "* Nordstrom family nears deal with Leonard Green in bid to take department store private - CNBC  citing sources",
        "date": "09122017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom family nears deal with Leonard Green in bid to take department store private "
    },
    {
        "content": "Sept 12 The founding family of high-end retailer Nordstrom Inc has chosen private equity firm Leonard Green & Partners to help take the company private  according to a source familiar with the matter.",
        "date": "09122017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom family chooses Leonard Green as buyout partner - source "
    },
    {
        "content": "* Hall most recently serving as vice president and CFO for Nike Inc's Enterprise Operations​ Source text for Eikon: Further company coverage:",
        "date": "08212017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom names Kelley Hall Chief Accounting Officer "
    },
    {
        "content": "* Sets quarterly dividend of $0.37per share Source text for Eikon: Further company coverage:",
        "date": "08162017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom sets quarterly dividend of $0.37per share "
    },
    {
        "content": "Aug 11 J.C. Penney Co Inc's stock hit a life-low as sweeping store closures and a challenging retail environment drove the embattled department store chain to report a bigger-than-expected quarterly loss and took a toll on comparable sales.",
        "date": "08112017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 3-J.C. Penney hits record low on wider loss  retail gloom "
    },
    {
        "content": "Nordstrom Inc  reported better-than-expected quarterly same-store sales on Thursday as more people shopped at the apparel retailer's online stores  sending shares up 2.5 percent after the bell.",
        "date": "08102017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Nordstrom websites boost same-store sales  shares jump "
    },
    {
        "content": "Aug 10 Nordstrom Inc reported better-than-expected quarterly same-store sales on Thursday as more people shopped at the apparel retailer's online stores  sending shares up 2.5 percent after the bell.",
        "date": "08102017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 1-Nordstrom websites boost same-store sales  shares jump "
    },
    {
        "content": "* Nordstrom second quarter 2017 earnings achieved expectations",
        "date": "08102017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom Q2 earnings per share $0.65 "
    },
    {
        "content": "Aug 10 Nordstrom Inc reported better-than-expected quarterly same-store sales on Thursday as more people shopped at the apparel retailer's online stores  sending shares up 2.5 percent after the bell.",
        "date": "08102017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom reports better-than-expected comparable sales "
    },
    {
        "content": "The group of Nordstrom Inc family members seeking to take the eponymous U.S. department store operator private is offering preferential terms to potential equity partners willing to fund the buyout  people familiar with the matter said.",
        "date": "07272017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Exclusive: Nordstrom family offers preferential terms to clinch buyout partner - sources "
    },
    {
        "content": "* Nordstrom to close store at dulles town center mall in Dulles  Virginia",
        "date": "06302017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom to close store at dulles town center mall in Dulles  Virginia "
    },
    {
        "content": "HONG KONG Best Inc  a Chinese logistics company backed by Alibaba Group   said it aims to raise up to $750 million from an initial public offering in the United States  betting an e-commerce boom in China will spur demand for its package delivery services and supply chain technology.",
        "date": "06262017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Alibaba-backed Best Inc bets on China logistics boom with U.S. listing "
    },
    {
        "content": "* Best Inc revenue more than doubled in three months to March (Adds China logistics market  Best Inc's financials  main shareholders)",
        "date": "06262017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 2-Alibaba-backed Best Inc bets on China logistics boom with U.S. listing "
    },
    {
        "content": "June 26 Best Inc  a Chinese logistics company backed by Alibaba Group Holding Ltd  on Monday filed for an initial public offering of American depositary shares to raise up to $750 million.",
        "date": "06262017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Alibaba-backed Best Inc files for IPO "
    },
    {
        "content": "* Best Inc says alibaba investment limited owns 23.4 percent of ordinary shares prior to the offering",
        "date": "06262017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Best Inc files for U.S. IPO of $750 mln of ADSs "
    },
    {
        "content": "A group of Nordstrom Inc family members is talking to buyout firms about raising $1 billion to $2 billion in equity to fund a potential bid to take the U.S. department store operator private  according to people familiar with the matter.",
        "date": "06092017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Exclusive: Nordstrom family launches search for buyout partner - sources "
    },
    {
        "content": "Department store operator Nordstrom Inc  said on Thursday that some members of the Nordstrom family were considering taking the company private as it struggles with an industry-wide sales slowdown. | Video ",
        "date": "06092017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom family explores taking retailer private  shares surge "
    },
    {
        "content": "June 8 Department store operator Nordstrom Inc said on Thursday that some members of the Nordstrom family were considering taking the company private as it struggles with an industry-wide sales slowdown.",
        "date": "06092017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 7-Nordstrom family explores taking retailer private  shares surge "
    },
    {
        "content": "CHICAGO/NEW YORK  June 8 Nordstrom Inc's founding family could face a drawn-out search for backers to help it take the retailer private as investors shy away from brick-and-mortar department stores under assault from Amazon.com Inc and other online competitors.",
        "date": "06082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom might struggle for private backing as mall stores lose value "
    },
    {
        "content": "DALLAS (Reuters Breakingviews) - Nordstrom insiders have chosen a good time to consider taking the business out of the public eye. A modestly leveraged buyout of the $7.6 billion U.S. clothing seller – recently most famous for dropping first daughter Ivanka Trump's clothing line – looks doable with members of the eponymous family rolling over their stakes. The growing list of retailers struggling with debt should sound a note of caution  though.",
        "date": "06082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom could be well suited for a buyout "
    },
    {
        "content": "June 8 Department store operator Nordstrom Inc said on Thursday that some members of the Nordstrom family are considering taking the company private as it struggles with an industry-wide sales slowdown.",
        "date": "06082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "CORRECTED-UPDATE 4-Nordstrom family explores taking retailer private  shares surge "
    },
    {
        "content": "* Indexes up: Dow 0.32 pct  S&P 0.16 pct  Nasdaq 0.23 pct (Adds details  changes comment  updates prices)",
        "date": "06082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St rises as Comey testimony springs no surprise "
    },
    {
        "content": "* Indexes up: Dow 0.10 pct  S&P 0.01 pct  Nasdaq 0.15 pct (Adds details  updates prices)",
        "date": "06082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St edges up as investors digest Comey's testimony "
    },
    {
        "content": "* Dow up 0.03 pct  S&P off 0.06 pct  Nasdaq down 0.16 pct (Adds details  comment  updates prices)",
        "date": "06082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St flat as Comey's testimony underway "
    },
    {
        "content": "* Dow down 0.01 pct  S&P off 0.02 pct  Nasdaq up 0.07 pct (Updates to open)",
        "date": "06082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St opens little changed; Comey awaited "
    },
    {
        "content": "* Nordstrom family files to say  as of June 7  on a combined basis  they own 51.8 million shares of Nordstrom Inc's common stock  representing about 31.2% stake in co",
        "date": "06082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom family group says collectively owns about 31.2 pct stake in co "
    },
    {
        "content": "June 8 Department store operator Nordstrom Inc said on Thursday that some members of the controlling Nordstrom family have formed a group to consider taking the company private.",
        "date": "06082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom family exploring deal to take retailer private "
    },
    {
        "content": "* Nordstrom Inc reelects 11 directors  adds Taskrabbit CEO Stacy Brown-Philpot to board",
        "date": "05222017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom adds Stacy Brown-Philpot to board "
    },
    {
        "content": "* Sets quarterly dividend of $0.37per share Source text for Eikon: Further company coverage:",
        "date": "05162017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom sets quarterly dividend of $0.37 per share "
    },
    {
        "content": "* Nordstrom inc - goop partnering with co  to bring goop's retail curation to pop-in@nordstrom in select stores across country and online Source text for Eikon: Further company coverage:",
        "date": "05122017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom says lifestyle brand goop partnering with co "
    },
    {
        "content": "NEW YORK  May 5 A glance at the U.S. stock market's main measure for the health of retailers suggests all is well among those companies in the business of peddling stuff directly to consumers.",
        "date": "05072017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "RPT-Wall St Weekahead-Old-guard retail back in the cross hairs "
    },
    {
        "content": "* Macy's shares hit 6-yr low in regular trade  weigh on rivals (Adds Nordstrom's earnings; updates shares)",
        "date": "05112017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "UPDATE 4-Nordstrom's comparable sales miss deepens department-store gloom "
    },
    {
        "content": "Nordstrom Inc  reported weaker-than-expected quarterly same-store sales as fewer people visited the apparel retailer's stores in the United States  sending its shares down 3.7 percent after the bell.",
        "date": "05112017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Retailer Nordstrom's quarterly same-store sales fall 0.8 percent "
    },
    {
        "content": "May 11 Nordstrom Inc reported weaker-than-expected quarterly same-store sales as fewer people visited the apparel retailer's stores in the United States  sending its shares down 3.7 percent after the bell.",
        "date": "05112017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Retailer Nordstrom's quarterly same-store sales fall 0.8 pct "
    },
    {
        "content": "* Indexes end down: Dow 0.11 pct  S&P 0.22 pct  Nasdaq 0.22 pct (Updates to close)",
        "date": "05112017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall Street slides as investors fret about retail "
    },
    {
        "content": "* Q1 earnings per share view $0.27 -- Thomson Reuters I/B/E/S",
        "date": "05112017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom Q1 earnings per share $0.37 "
    },
    {
        "content": "* Mike Koppel retired as company's CFO May 1  2017 Source text for Eikon: Further company coverage:",
        "date": "05042017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom names Anne Bramman CFO "
    },
    {
        "content": "* Indexes down: Dow 0.12 pct  S&P 0.24 pct  Nasdaq 0.22 pct (Updates to afternoon)",
        "date": "05112017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall Street drops as investors worry about retail "
    },
    {
        "content": "CHICAGO Target Corp   Wal-Mart Stores Inc  and other retailers are shelving considerations to move supply bases closer to the United States in the face of a possible border tax  banking instead on killing support for the tax idea in Congress.",
        "date": "04212017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "U.S. retailers bet on Congress over Bolivia to thwart Trump  border tax issue "
    },
    {
        "content": "CHICAGO  April 21 Target Corp  Wal-Mart Stores Inc and other retailers are shelving considerations to move supply bases closer to the United States in the face of a possible border tax  banking instead on killing support for the tax idea in Congress.",
        "date": "04212017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 1-U.S. retailers bet on Congress over Bolivia to thwart Trump  border tax issue "
    },
    {
        "content": "CHICAGO  April 21 Target Corp  Wal-Mart Stores Inc and other retailers are shelving considerations to move supply bases closer to the United States in the face of a possible border tax  banking instead on killing support for the tax idea in Congress. President Donald Trump's administration plans to impose a 20 percent tax on imports  a levy that  industry officials said  could raise U.S. consumer prices by as much as 25 percent. Last week  the President said he favored an 'import tax",
        "date": "04212017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "U.S. retailers bet on Congress over Bolivia to thwart Trump border tax issue "
    },
    {
        "content": "* The Black Tux announces an exclusive retail partnership with Nordstrom  Source text for Eikon:  Further company coverage:",
        "date": "03272017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-The Black Tux announces exclusive retail partnership with Nordstrom "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 07 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to  Nordstrom  Inc.'s new 4.00% $350 million senior unsecured notes due March 2027.  The proceeds from these notes  as well as proceeds from an add-on of $300  million to the existing 5.00% senior unsecured notes outstanding due 2044  will  be used to repay or retire all $650 million aggregate principal amount of  outstanding 6.25% senior unsecured notes due January 2",
        "date": "03072017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Fitch Rates Nordstrom's Senior Unsecured Notes 'BBB+' "
    },
    {
        "content": "* ANNOUNCES RETIREMENT OF ENRIQUE HERNANDEZ  JR.  FROM BOARD OF DIRECTORS  Source text for Eikon:  Further company coverage:",
        "date": "02172017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-NORDSTROM ANNOUNCES RETIREMENT OF ENRIQUE HERNANDEZ  JR.  FROM BOARD OF DIRECTORS "
    },
    {
        "content": "Department store operators Kohl's Corp  and Nordstrom Inc  followed larger rival Macy's Inc  in reporting a better-than-expected profit for the holiday quarter as lower inventories helped the retailers avoid deep discounting.",
        "date": "02232017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Lower inventories help Kohl's  Nordstrom top profit estimates "
    },
    {
        "content": "* Nordstrom board of directors authorizes $500 million share repurchase program and approves quarterly dividend",
        "date": "02172017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom board authorizes $500 mln share repurchase program "
    },
    {
        "content": "* Nordstrom fourth quarter and fiscal 2016 earnings exceeded expectations",
        "date": "02232017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom reports Q4 EPS $1.15 "
    },
    {
        "content": "* Kohl's sees FY comp sales flat to down 2 pct   (Adds Nordstrom's results  updates shares)",
        "date": "02232017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 4-Lower inventories help Kohl's  Nordstrom top profit estimates "
    },
    {
        "content": "* On conf call- \"early in the year our team took aggressive steps to realign inventory in response to changes in customer demand\"",
        "date": "02232017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom on conf call- FY forecast assumes continuation of negative trends in full-line stores offset by upsize online growth "
    },
    {
        "content": "Feb 23 Nordstrom Inc reported a 2.4 percent rise in quarterly sales as the apparel retailer's off-price stores attracted more customers  sending its shares up 3.6 percent in extended trading on Thursday.",
        "date": "02232017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom's quarterly sales rise 2.4 pct "
    },
    {
        "content": "WASHINGTON The White House defended President Donald Trump's criticism of the Nordstrom retail chain on Wednesday  saying the firm's decision to drop his daughter Ivanka's clothing line for the coming season was politically motivated attack.",
        "date": "02102017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "White House defends Trump criticism of Nordstrom for dropping Ivanka clothing line "
    },
    {
        "content": "Trump-branded consumer products have suffered new blows  with U.S. retailers Sears Holdings Corp and Kmart Corp  discontinuing online sales of 31 Trump Home items  while new details emerged showing sales of Ivanka Trump's brand fell in the weeks before Nordstrom Inc stopped carrying her products. | Video ",
        "date": "02122017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Defections by Sears  Kmart cap week of controversy for Trump brands "
    },
    {
        "content": "WASHINGTON Nordstrom's sales of Ivanka Trump's line of clothing and shoes fell by nearly one-third in the past fiscal year  with sharp drops in sales in the weeks before her father Donald Trump was elected president  the Wall Street Journal reported on Saturday.",
        "date": "02112017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Sales of Ivanka Trump apparel slumped at Nordstrom: WSJ report "
    },
    {
        "content": "Feb 11 Trump-branded consumer products have suffered new blows  with U.S. retailers Sears Holdings Corp  and Kmart Corp  discontinuing online sales of 31 Trump Home items  while new details emerged showing sales of Ivanka Trump's brand fell in the weeks before Nordstrom Inc  stopped carrying her products.",
        "date": "02122017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 2-Defections by Sears  Kmart cap week of controversy for Trump brands "
    },
    {
        "content": "WASHINGTON  Feb 11 Nordstrom's sales of Ivanka Trump's line of clothing and shoes fell by nearly one-third in the past fiscal year  with sharp drops in sales in the weeks before her father Donald Trump was elected president  the Wall Street Journal reported on Saturday.",
        "date": "02112017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 2-Sales of Ivanka Trump apparel slumped at Nordstrom -WSJ report "
    },
    {
        "content": "WASHINGTON  Feb 11 Nordstrom's sales of first daughter Ivanka Trump's line of clothing and shoes fell by nearly one-third in the past fiscal year  with sharp drops in sales weeks before the election  the Wall Street Journal reported on Saturday.",
        "date": "02112017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Sales of Ivanka Trump apparel slumped at Nordstrom -report "
    },
    {
        "content": "WASHINGTON  Feb 8 The White House defended President Donald Trump's criticism of the Nordstrom retail chain on Wednesday  saying the firm's decision to drop his daughter Ivanka's clothing line for the coming season was politically motivated attack.",
        "date": "02082017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "W.House defends Trump criticism of Nordstrom for dropping Ivanka clothing line "
    },
    {
        "content": "Feb 2 Nordstrom Inc is winding down its relationship with the Ivanka Trump brand  Bloomberg reported  citing a person with knowledge of the matter.",
        "date": "02032017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "UPDATE 1-Nordstrom winds down relationship with Ivanka Trump brand-Bloomberg report "
    },
    {
        "content": "Nordstrom Inc  is winding down its relationship with the Ivanka Trump brand  Bloomberg reported  citing a person with knowledge of the matter.",
        "date": "02042017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Nordstrom winds down relationship with Ivanka Trump brand: Bloomberg report "
    },
    {
        "content": "WASHINGTON  Feb 8 U.S. President Donald Trump on Wednesday criticized Nordstrom Inc for what he said was its unfair treatment of his daughter Ivanka after its decision to not purchase her clothing line for this upcoming season.",
        "date": "02082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "CORRECTED-UPDATE 1-Trump criticizes Nordstrom after retailer drops Ivanka brand "
    },
    {
        "content": "Feb 2 Nordstrom Inc is winding down its relationship with the Ivanka Trump brand  Bloomberg reported  citing a person with knowledge of the matter.",
        "date": "02032017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom winds down relationship with Ivanka Trump brand -Bloomberg report "
    },
    {
        "content": "WASHINGTON  Feb 8 U.S. President Donald Trump on Wednesday criticized Nordstrom Inc for what he said was its unfair treatment of his daughter Ivanka.",
        "date": "02082017",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Trump criticizes Nordstrom after store reportedly curbs deal with Ivanka Trump "
    },
    {
        "content": "* Nordstrom to close store at Mainplace Mall in Santa Ana  California",
        "date": "01122017",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom to close store at Mainplace Mall  California "
    },
    {
        "content": "* Q3 results included a non-cash goodwill impairment of $197 million related to Trunk Club",
        "date": "11102016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom Q3 sales $3.5 bln "
    },
    {
        "content": "* Sets quarterly dividend of $0.37 per share  Source text for Eikon:  Further company coverage:",
        "date": "11162016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom sets quarterly dividend of $0.37 per share "
    },
    {
        "content": "CHICAGO  Nov 10 Department store operator Nordstrom Inc reported a 2.4 percent rise in quarterly comparable store sales on Thursday after a drop in the previous two quarters  helped by higher revenue during its anniversary sale and its off-price Rack business.",
        "date": "11102016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom comparable sales rise after two quarters of drops "
    },
    {
        "content": "* Mike Koppel to retire as Nordstrom Chief Financial Officer in spring 2017",
        "date": "10242016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Mike Koppel to retire as Nordstrom Chief Financial Officer in spring 2017 "
    },
    {
        "content": "Oct 24 Department store operator Nordstrom Inc  said it would hire about 11 400 temporary employees for the holiday shopping season  about 3 percent fewer than last year.",
        "date": "10242016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom to hire fewer temporary employees for holiday season "
    },
    {
        "content": "* Nordstrom announces president of nordstrom.com and strategic shifts in leadership responsibilities",
        "date": "09212016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom announces president of nordstrom.com "
    },
    {
        "content": "* Sets quarterly dividend of $0.37per share  Source text for Eikon:  Further company coverage:",
        "date": "08172016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom says board approves quarterly dividend "
    },
    {
        "content": "* Nordstrom partners with Aimia to expand Nordstrom rewards program",
        "date": "08112016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom partners with Aimia to expand Nordstrom rewards program "
    },
    {
        "content": "* S&P - Nordstrom Inc. outlook revised to negative on weaker operating performance  credit metric expectations; ratings affirmed  Source - http://bit.ly/2bm5fW2 Further company coverage:",
        "date": "08112016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-S&P - Nordstrom Inc. outlook revised to negative on weaker operating performance  credit metric expectations; ratings affirmed "
    },
    {
        "content": "Aug 11 Department store operator Nordstrom Inc  reported better-than-expected quarterly comparable store sales  helped by higher sales during its anniversary sale and at its off-price Rack business.",
        "date": "08112016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom comparable sales falls less than expected "
    },
    {
        "content": "* Q2 earnings per share view $0.56 -- Thomson Reuters I/B/E/S",
        "date": "08112016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom sees 2016 EPS excluding items $2.60-$2.75 "
    },
    {
        "content": "* Trunk Club to close Goose Island facility  integrate operations into Nordstrom Fulfillment Network",
        "date": "06282016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Trunk Club to close Goose Island facility  integrate operations into Nordstrom Fulfillment Network "
    },
    {
        "content": "June 14 U.S. luxury fashion retailer Neiman Marcus Group Ltd LLC reported its third straight quarterly drop in sales at established stores and a nearly 81 percent fall in profit amid a slowdown in apparel spending.",
        "date": "06142016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 1-Neiman Marcus' same-store sales fall amid apparel slowdown "
    },
    {
        "content": "* Jason Goldberger will assume newly created role of chief digital officer and president  Target.com",
        "date": "05172016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Target names Jason Goldberger as chief digital officer and president "
    },
    {
        "content": "Department store operator Nordstrom Inc  reported a drop in first-quarter sales at established stores and slashed profit expectations for the year  adding to the gloom in the department store sector.",
        "date": "05132016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Nordstrom's comparable store sales fall; shares tumble "
    },
    {
        "content": "May 17 Big-box retailer Target Corp  appointed Nordstrom Inc executive Mark Tritton its chief merchandising officer.",
        "date": "05172016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Target hires Nordstrom's Mark Tritton as chief merchandising officer "
    },
    {
        "content": "Kohl's Corp  and Nordstrom Inc  reported a surprise fall in quarterly comparable sales on Thursday  highlighting the malaise in the department store sector as consumers pull back spending on apparel. | Video ",
        "date": "05122016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Kohl's  Nordstrom results deepen retail jitters "
    },
    {
        "content": "* Nordstrom down 17 pct after-market   (Adds Nordstrom results; updates shares)",
        "date": "05122016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 4-Kohl's  Nordstrom results deepen retail jitters "
    },
    {
        "content": "May 12 Department store operator Nordstrom Inc  reported a drop in first-quarter sales at established stores and slashed profit expectations for the year  adding to the gloom in the department store sector.",
        "date": "05122016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 1-Nordstrom's comparable store sales fall; shares tumble "
    },
    {
        "content": "* Q1 earnings per share view $0.45 -- Thomson Reuters I/B/E/S",
        "date": "05122016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom reports Q1 earnings per share $0.26 "
    },
    {
        "content": "* Nordstrom announces operating model improvements to better support customers' changing expectations",
        "date": "04182016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Nordstrom says is expecting about 350 to 400 positions to be reduced "
    },
    {
        "content": "* Its unit  Best I NS FIZ  signs a deal to acquire a debt portfolio of the nominal value of 92.4 million zlotys  ($24.6 million) for 24.0 million zlotys from ING Bank Slaski   Source text for Eikon:   Further company coverage:   ($1 = 3.7520 zlotys)   (Gdynia Newsroom)",
        "date": "03302016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Best unit signs deal to buy debt portfolio for 24.0 mln zlotys "
    },
    {
        "content": "March 15 U.S. luxury fashion retailer Neiman Marcus Group Ltd LLC reported a second straight quarterly drop in sales at its established stores amid a slowdown in spending on high-end goods.",
        "date": "03152016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Neiman Marcus same-store sales fall for 2nd straight quarter "
    },
    {
        "content": "* Shares rise as much as 4 pct   (Adds details from conference call  analyst comment; updates shares)",
        "date": "03182016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 3-Luxury jeweler Tiffany's profit beats estimates as costs fall "
    },
    {
        "content": "* \u007f\u007fIts fund  Best I NS FIZ  acquires a debt portfolio from mBank of the nominal value of 229.3 million zlotys  ($57.45 million) for 20.8 million zlotys  Source text for Eikon:  Further company coverage:   ($1 = 3.9915 zlotys)   (Gdynia Newsroom)",
        "date": "03012016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Best fund buys debt portfolio from mBank "
    },
    {
        "content": "Feb 18 Department store operator Nordstrom Inc  reported better-than-expected quarterly comparable sales  helped by strong demand for beauty products and shoes.",
        "date": "02182016",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Nordstrom quarterly comparable sales beat estimates "
    },
    {
        "content": "* Indexes down: Dow 0.44 pct  S&P 0.47 pct  Nasdaq 0.33 pct   (Updates to open)",
        "date": "02192016",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St slips with oil; CPI data shows inflation firming "
    },
    {
        "content": "NEW YORK/CHICAGO  Nov 24 Target Corp's  10 percent discount on a $30.49 pair of embroidered curtains was not nearly enough to entice Valerie Jenkins  shopping in Chicago the weekend before Thanksgiving.",
        "date": "11242015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "CORRECTED-UPDATE 1-U.S. consumers and stores face off over depth of holiday discounts "
    },
    {
        "content": "NEW YORK/CHICAGO  Nov 24 Target Corp's  10 percent discount on a $30.49 pair of embroidered curtains was not nearly enough to entice Valerie Jenkins  shopping in Chicago the weekend before Thanksgiving.",
        "date": "11242015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "U.S. consumers and stores face off over depth of holiday discounts "
    },
    {
        "content": "* TJX shares up 4.5 pct  other off-price chains also up   (Adds Q4 sales forecast  Euromonitor data; updates shares)",
        "date": "11172015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 3-TJX raises same-store sales forecast as shoppers hunt for deals "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 16 (Fitch) Subpar performance of late has driven credit  default swap (CDS) spreads on Nordstrom  Inc. out to their widest levels since  2012  according to Fitch Solutions in its latest CDS case study snapshot. Five-year CDS on Nordstrom widened out 75% over the past week  underperforming  the broader North America Retail sector  the CDS of which widened by 10%.  CDS  credit protection on Nordstrom has also increased ",
        "date": "11162015",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Fitch Solutions: Nordstrom CDS Widen 75% Over Last Week "
    },
    {
        "content": "Department store operator Nordstrom Inc  on Thursday followed Macy's Inc  in cutting its full-year forecast  bringing back into sharp focus concerns of a slowdown in the retail sector.",
        "date": "11122015",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Nordstrom's forecast cut renews concerns about retail slowdown "
    },
    {
        "content": "* Shares fall 20.5 pct to $50.46 after market   (Adds analyst comment; updates shares)",
        "date": "11122015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 2-Nordstrom's forecast cut renews concerns about retail slowdown "
    },
    {
        "content": "Nov 12 Upscale department store operator Nordstrom Inc reported smaller-than-expected comparable sales growth  sending its shares down 15 percent in after-market trading.",
        "date": "11122015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom's same-store sales growth misses estimates "
    },
    {
        "content": "* Dow up 0.03 pct  S&P down 0.13 pct  Nasdaq down 0.21 pct   (Updates close with latest volume  Nordstrom shares up after the bell  Shake Shack sinks in regular session)",
        "date": "08132015",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St ends flat as energy shares drop with oil "
    },
    {
        "content": "* Indexes: Dow up 0.4 pct  S&P up 0.4 pct  Nasdaq up 0.3 pct   (Updates to close)",
        "date": "08142015",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St edges up after upbeat data  Greek bailout agreement "
    },
    {
        "content": "* Indexes: Dow up 0.3 pct  S&P up 0.3 pct  Nasdaq up 0.2 pct   (Updates to late afternoon)",
        "date": "08142015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St edges higher after upbeat data  retailer gains "
    },
    {
        "content": "* Indexes: Dow up 0.14 pct  S&P up 0.07 pct  Nasdaq down 0.18 pct   (Updates to early afternoon)",
        "date": "08142015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St lackluster as oil prices weigh on positive data "
    },
    {
        "content": "* Indexes: Dow up 0.2 pct  S&P up 0.09 pct  Nasdaq down 0.1 pct   (Adds details  changes comment  updates prices)",
        "date": "08142015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St inches up as investors focus on economic growth "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.1 pct  Nasdaq 0.03 pct   (Updates to open)",
        "date": "08142015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "US STOCKS-Wall St higher after positive economic data "
    },
    {
        "content": "* Its unit  Best II NS FIZ  acquires a liability portfolio of a nominal value of 61.3 million zlotys ($16.7 million) for 14.3 million zlotys from BPH SA   Source text for Eikon:",
        "date": "06102015",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "BRIEF-Best fund buys liability portfolio of 61.3 million zlotys "
    },
    {
        "content": "TORONTO  May 26 Toronto Dominion Bank  said on Tuesday it will acquire Nordstrom's U.S. consumer credit card portfolio as the Canadian bank looks to use its strong balance sheet to expand its lending business in the United States.",
        "date": "05262015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "TD Bank to buy Nordstrom's U.S. consumer credit card portfolio "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 04 (Fitch) Fitch Ratings has downgraded its long-term ratings on  Nordstrom  Inc. (Nordstrom)  including the company's Issuer Default Rating (IDR)  to 'BBB+' from 'A-'. The Rating Outlook is Stable. A full list of ratings is  provided at the end of this release.  Nordstrom expects to conclude the review process of its credit card receivables  ($2.3 billion as of Jan. 31  2015) in the first half of 2015 and use the  poten",
        "date": "03042015",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Fitch Downgrades Nordstrom's IDR to 'BBB+'; Outlook Stable "
    },
    {
        "content": "Feb 26 Macy's Inc's planned push into the off-price retailing sector  dominated by chains such as TJX Cos Inc's TJ Maxx  shows the venerable department store chain has faced up to new realities of retailing in the United States.",
        "date": "02262015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "For Macy's  going downmarket looks like the way ahead "
    },
    {
        "content": "* Indexes up: Dow 0.9 pct  S&P 0.6 pct  Nasdaq 0.6 pct   (Adds latest volume  Nordstrom shares up)",
        "date": "02202015",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "US STOCKS-Dow  S&P 500 close at record highs on Greece debt deal "
    },
    {
        "content": "Upscale department store operator Nordstrom Inc  reported a lower-than-expected quarterly profit as it spent more on technology upgrades and store expansion  and increased discounts at its Rack brand stores in the holiday shopping season.",
        "date": "02192015",
        "name": "Nordstrom Inc",
        "news_type": "topStory",
        "symbol": "JWN",
        "title": "Nordstrom profit falls due to higher investments  discounts "
    },
    {
        "content": "Feb 19 Upscale department store operator Nordstrom Inc reported a lower-than-expected quarterly profit as it spent more on technology upgrades and store expansion  and increased discounts at its Rack brand stores in the holiday shopping season.",
        "date": "02192015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "UPDATE 1-Nordstrom profit falls due to higher investments  discounts "
    },
    {
        "content": "Feb 19 Upscale department store operator Nordstrom Inc reported a 5 percent fall in quarterly profit as selling  general and administrative expenses increased 14 percent.",
        "date": "02192015",
        "name": "Nordstrom Inc",
        "news_type": "normal",
        "symbol": "JWN",
        "title": "Nordstrom profit falls 5 pct as expenses increase "
    }
]