[
    {
        "content": "* Kellogg Co ‍​says chairman John Bryant reports open market sale of 190 000 shares of co's common stock at average price of $63.01 per share on Nov 9 - SEC filing Source text: (http://bit.ly/2yWZUU8) Further company coverage:",
        "date": "11132017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg chairman John Bryant reports sale of 190 000 shares of common stock "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 07 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Kellogg Company's (Kellogg) $600 million senior unsecured notes due November 2027. Proceeds from the notes will be used to repay most of the commercial paper borrowings that were used to finance Kellogg's $600 million acquisition of Chicago Bar Co LLC and to pay related fees and expenses. Chicago Bar Co LLC is the maker of RXBAR  a line of clean-label protein bar",
        "date": "11072017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Fitch Rates Kellogg Co's $600MM Sr. Unsecured Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "* Kellogg Co files for potential senior notes due 2027  size not disclosed - SEC filing‍​ Source text: (http://bit.ly/2zkvfzs) Further company coverage:",
        "date": "11072017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Kellogg files for potential senior notes due 2027  size undisclosed "
    },
    {
        "content": "* On conf call- Eggo had Q3 share gains on  removal of artificial colors and flavors and success of disney shaped waffles‍​",
        "date": "10312017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg on conf call- Q3 benefited from some DSD-related shipments that were expected to come in Q2 "
    },
    {
        "content": "* Indexes up: Dow 0.12 pct  S&P 0.09 pct  Nasdaq 0.43 pct (Updates to close of U.S. markets)",
        "date": "10312017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "US STOCKS-Wall St ends strong October higher as tech  staples lead "
    },
    {
        "content": "* Indexes up: Dow 0.12 pct  S&P 0.18 pct  Nasdaq 0.56 pct (Updates to late afternoon)",
        "date": "10312017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "US STOCKS-Wall St set to end month on up note as tech  staples lead "
    },
    {
        "content": "* Indexes up: Dow 0.12 pct  S&P 0.13 pct  Nasdaq 0.30 pct (Updates to early afternoon)",
        "date": "10312017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "US STOCKS-Wall St inches higher on gains in techs  consumer staples "
    },
    {
        "content": "* Indexes up: Dow 0.07 pct  S&P 0.11 pct  Nasdaq 0.37 pct (Changes comment  adds details  updates prices)",
        "date": "10312017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "US STOCKS-Consumer staples lead gains on Wall Street "
    },
    {
        "content": "Kellogg Co  surprised investors on Tuesday with its first quarterly sales increase in more than two years  showing it was turning a corner after massive cost cuts and a shift to healthier products  sending its shares up 7 percent.",
        "date": "10312017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg's surprise sales increase cheers investors "
    },
    {
        "content": "Oct 31 Kellogg Co surprised investors on Tuesday with its first quarterly sales increase in more than two years  showing it was turning a corner after massive cost cuts and a shift to healthier products  sending its shares up 7 percent.",
        "date": "10312017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 2-Kellogg's surprise sales increase cheers investors "
    },
    {
        "content": "Oct 31 Wall Street opened higher on Tuesday  the last trading of October  helped by a string of upbeat earnings reports from companies such as Kellogg and Mastercard.",
        "date": "10312017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "US STOCKS SNAPSHOT-Wall St opens higher on strong earnings "
    },
    {
        "content": "Oct 31 Kellogg Co reported Tuesday higher quarterly sales on increased demand for frozen foods and Kashi snacks  even as sales of cereals and snacks in the United States declined.",
        "date": "10312017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg posts higher quarterly sales "
    },
    {
        "content": "* Kellogg Company declares regular dividend of $0.54 per share Source text for Eikon: Further company coverage:",
        "date": "10202017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg declares regular dividend of $0.54 per share "
    },
    {
        "content": "* Northern Trust Corp repo​rts a 20.8 percent passive stake in Kellogg Co as of September 30  2017 - SEC filing Source text: (http://bit.ly/2xwRXzz) Further company coverage:",
        "date": "10102017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Northern Trust repo​rts 20.8 pct passive stake in Kellogg "
    },
    {
        "content": "Kellogg Co  said on Friday it would buy the owner of RXBAR protein bars for $600 million as new CEO Steve Cahillane expands the world's largest cereal maker's portfolio of healthy snacks.",
        "date": "10062017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Kellogg to buy RXBAR protein bar maker for $600 million "
    },
    {
        "content": "Oct 6 Kellogg Co said on Friday it would buy the owner of RXBAR protein bars for $600 million as new CEO Steve Cahillane expands the world's largest cereal maker's portfolio of healthy snacks.",
        "date": "10062017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 1-Kellogg to buy RXBAR protein bar maker for $600 mln "
    },
    {
        "content": "* Kellogg Co - ‍that it has entered into an agreement to acquire Chicago Bar Company LLC  maker of RXBAR​",
        "date": "10062017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Kellogg to acquire Chicago Bar Company  maker of RXBAR "
    },
    {
        "content": "Oct 6 Kellogg Co said on Friday it would buy the owner of RXBAR protein bars for $600 million as the world's largest cereal maker looks to expand its portfolio of healthier foods and tap millennial customers.",
        "date": "10062017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg to buy RXBAR protein bar maker for $600 mln "
    },
    {
        "content": "Kellogg Co  replaced chief executive John Bryant with food industry veteran Steven Cahillane on Thursday as the world's largest cereal maker continues efforts to halt two-and-a-half years of declining sales.",
        "date": "09282017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Kellogg's CEO Bryant steps down  Nature's Bounty exec to take over "
    },
    {
        "content": "Sept 28 Kellogg Co replaced chief executive John Bryant with food industry veteran Steven Cahillane on Thursday as the world's largest cereal maker continues efforts to halt two-and-a-half years of declining sales.",
        "date": "09282017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 3-Kellogg's CEO Bryant steps down  Nature's Bounty exec to take over "
    },
    {
        "content": "* Kellogg Co - size of the board will be increased from 13 to 14 members",
        "date": "09282017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Kellogg Co - size of the board will be increased from 13 to 14 members "
    },
    {
        "content": "Sept 28 Cereal maker Kellogg Co said Steven Cahillane  the chief executive of nutritional supplements maker Nature's Bounty  will replace John Bryant as its CEO  effective Oct. 2.",
        "date": "09282017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg names Nature's Bounty exec Steven Cahillane as CEO "
    },
    {
        "content": "* Steven A. Cahillane named Kellogg Company CEO as John A. Bryant retires",
        "date": "09282017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Steven Cahillane named Kellogg Company CEO as John Bryant retires "
    },
    {
        "content": "A federal appeals court on Thursday upheld the dismissal of a patent infringement case Mondelez International Inc brought against rival food company Kellogg Co.",
        "date": "09082017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Kellogg defeats Mondelez in cookie-packaging patent fight "
    },
    {
        "content": "* On conf call - already shipping through warehouse to all of our customers",
        "date": "08032017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg on conf call- In-store promotion activity was reduced in Q2 "
    },
    {
        "content": "Kellogg Co's  quarterly profit topped estimates as the Corn Flakes maker's cost-cutting efforts paid off and the company said it had completed the overhaul of the distribution model for its U.S. snack business earlier than expected.",
        "date": "08032017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg tops estimates  completes shift to new distribution model "
    },
    {
        "content": "* Shares rise 4.8 pct in morning trade (Adds details from conf call  analyst comment  share move)",
        "date": "08032017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 2-Kellogg tops estimates  completes shift to new distribution model "
    },
    {
        "content": "* Qtrly reported earnings per share $0.80; Qtrly comparable earnings per share $0.97",
        "date": "08032017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Kellogg Q2 comparable earnings per share $0.97 "
    },
    {
        "content": "Aug 3 Cornflakes maker Kellogg Co reported a smaller-than-expected drop in quarterly sales  helped by higher sales in Latin America and Asia Pacific even as demand remained weak in the United States.",
        "date": "08032017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg's quarterly sales beat estimates "
    },
    {
        "content": "* Kellogg says on July 10 Kellogg Funding Co Llc entered into amendment to its previously disclosed receivables purchase agreement  dated July 13  2016",
        "date": "07122017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg says kellogg Funding entered into amendment to its previously disclosed receivables purchase agreement dated July 13  2016 "
    },
    {
        "content": "* Bright Greens says has raised a $2 million seed round led by Eighteen94 Capital  venture capital fund of Kellogg Company Source text for Eikon: Further company coverage:",
        "date": "06152017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Bright Greens raises $2 mln seed round led by venture capital fund Eighteen94 Capital "
    },
    {
        "content": "* Kellogg Company elects Carter Cast to board of directors Source text for Eikon: Further company coverage:",
        "date": "06082017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg Company elects Carter Cast to board of directors "
    },
    {
        "content": "May 30 Jana Partners nominated former Kellogg Co executive  and health policy consultant Celeste Clark to Whole Foods Market Inc's board  as the activist shareholder pushes the company to boost profits and its sagging stock.",
        "date": "05302017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Jana Partners nominates ex-Kellogg exec to Whole Foods board "
    },
    {
        "content": "* Kellogg CEO - experienced reduction in trade inventory in Q1 due to early shipments in Q4 in categories in U.S. - conf call",
        "date": "05042017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg executive says expects to see sequential improvement in Q2 - conf call "
    },
    {
        "content": "Cornflakes maker Kellogg Co  reported a better-than-expected quarterly profit as continuing cost cuts and a planned tax benefit boosted earnings.",
        "date": "05042017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg's quarterly profit beats on tax benefit  lower costs "
    },
    {
        "content": "May 4 Cornflakes maker Kellogg Co reported a better-than-expected quarterly profit as continuing cost cuts and a planned tax benefit boosted earnings.",
        "date": "05042017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 1-Kellogg's quarterly profit beats on tax benefit  lower costs "
    },
    {
        "content": "May 4 Cornflakes maker Kellogg Co reported a nearly 50 percent rise in quarterly profit as the company continued to reap the benefits of its cost cutting program.",
        "date": "05042017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg's quarterly profit jumps nearly 50 pct "
    },
    {
        "content": "* Kellogg Company declares regular dividend of $0.52 per share and announces plans for 4% dividend increase",
        "date": "04282017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg declares regular dividend of $0.52 per share  plans to raise dividend to $0.54 per share beginning Q3 2017 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 07 (Fitch) Fitch Ratings has affirmed Kellogg Company's (Kellogg) Long-Term Issuer Default Rating (IDR) at 'BBB' and Short-Term IDR at 'F2'. The Rating Outlook is Stable. The ratings apply to approximately $7.8 billion of total outstanding debt. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS Revenue Pressure Amidst Changing Consumer Preferences Kellogg's ratings reflect Fitch's expect",
        "date": "04072017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Fitch Affirms Kellogg Company IDR at 'BBB'; Outlook Stable "
    },
    {
        "content": "* Kellogg Co says three-year extension of its collegiate multimedia rights partnership with IMG Source text for Eikon: Further company coverage:",
        "date": "04032017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg Co says three-year extension of its collegiate multimedia rights partnership with IMG "
    },
    {
        "content": "* Says Cheez-It and Pringles officially announced a multi-year partnership with Major League Soccer  Source text for Eikon:  Further company coverage:",
        "date": "03022017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg's Cheez-It and Pringles announce multi-year partnership with Major League Soccer "
    },
    {
        "content": "Feb 20 Acquire  slash costs  repeat. Billionaire investor Warren Buffet and buyout firm 3G Capital's failed $143 billion bid to combine their food conglomerate Kraft Heinz Co  with Unilever Plc shows their winning formula now needs a growth boost.",
        "date": "02202017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "DEALTALK-Kraft's failed Unilever bid shows it needs growth over cost cuts "
    },
    {
        "content": "* Kellogg Company declares regular dividend of $0.52 per share  Source text for Eikon:  Further company coverage:",
        "date": "02172017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg Company declares regular dividend of $0.52 per share "
    },
    {
        "content": "* Vanguard group reports 5.42 percent passive stake in Kellogg co as of December 31  2016 - sec filing  Source text (http://bit.ly/2lwztJT) Further company coverage:",
        "date": "02102017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Vanguard Group reports 5.42 percent passive stake in Kellogg co as of Dec. 31  2016 "
    },
    {
        "content": "Feb 8 Corn Flakes maker Kellogg Co said on Wednesday it would stop distributing its U.S. Snacks business's products directly to stores and instead switch to its more widely used warehouse distribution model in order to cut costs.",
        "date": "02082017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Kellogg to stop direct store delivery in U.S. Snacks business "
    },
    {
        "content": "Feb 9 Kellogg Co  the world's largest maker of breakfast cereals  reported a higher-than-expected adjusted quarterly profit and extended its \"Project K\" restructuring program by another year.",
        "date": "02092017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "UPDATE 2-Kellogg beats profit estimate; extends \"Project K\" restructuring "
    },
    {
        "content": "* Kellogg Co - will begin to exit its direct store delivery (dsd) network in Q2",
        "date": "02082017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Kellogg Co will begin to exit its direct store delivery network in Q2 "
    },
    {
        "content": "Corn Flakes maker Kellogg Co's  adjusted quarterly profit topped Wall Street estimates  helped by cost cuts and improving demand for its snack products in the United States  its largest market.",
        "date": "02092017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg's adjusted profit beats estimates as costs fall "
    },
    {
        "content": "Feb 9 Corn Flakes maker Kellogg Co posted a bigger quarterly net loss  as it took a charge related to its Venezuelan business.",
        "date": "02092017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg's quarterly loss widens  sales fall further "
    },
    {
        "content": "Please click on the link below for Kellogg Co's quarterly earnings press release:  Source text:",
        "date": "02092017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Kellogg Co Q4 results press release "
    },
    {
        "content": "Corn Flakes maker Kellogg Co said on Wednesday it would stop distributing its U.S. snacks business' products directly to stores and switch to its more widely used warehouse model to cut costs and adapt to a changing retail landscape.",
        "date": "02092017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg to switch delivery model for U.S. snacks unit to cut costs "
    },
    {
        "content": "Feb 8 Corn Flakes maker Kellogg Co said on Wednesday it would stop distributing its U.S. snacks business' products directly to stores and switch to its more widely used warehouse model to cut costs and adapt to a changing retail landscape.",
        "date": "02092017",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 3-Kellogg to switch delivery model for U.S. snacks unit to cut costs "
    },
    {
        "content": "* Kellogg Co- On Jan 31  2017 Kellogg Company entered into an unsecured 364-day credit agreement dated as of January 31  2017 - SEC Filing",
        "date": "02012017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg Co entered into an unsecured 364-day credit agreement dated as of January 31 - SEC Filing "
    },
    {
        "content": "* Kellogg company names Fareed Khan as chief financial officer",
        "date": "01132017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg company names Fareed Khan as chief financial officer "
    },
    {
        "content": "* Kellogg Company's venture capital fund  today announced it led a $4.25 million series A funding of Kuli Kuli  Source text for Eikon:  Further company coverage:",
        "date": "01112017",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-kellogg Company's venture capital fund  today announced it led a $4.25 mln series A funding of Kuli Kuli "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 07 (Fitch) Fitch Ratings has assigned a 'BBB' rating to  Kellogg Company's (Kellogg) $600 million senior unsecured notes due 2023.  Proceeds from the notes will be used to refinance the $500 million senior  unsecured notes due November 2016 and reduce commercial paper outstanding  which  totaled $420 million at Oct. 1  2016. A full list of ratings follows at the end  of this release. KEY RATING DRIVERS Kellogg's ratin",
        "date": "11072016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Fitch Rates Kellogg Co's $600MM Senior Unsecured Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "* Presentation slides - expects 2018 adjusted net sales in n. America  and europe to remain flat at constant currency",
        "date": "11012016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg CFO on conf call- curbing share buybacks in Q4 to fund Parati stake acquisition in Brazil "
    },
    {
        "content": "Corn Flakes maker Kellogg Co  reported a better-than-expected quarterly profit  helped by cost-cutting and lower cost of goods sold  but sales fell for the seventh straight quarter.",
        "date": "11012016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Corn Flakes maker Kellogg's quarterly profit beats estimates "
    },
    {
        "content": "Nov 1 Corn Flakes maker Kellogg Co  reported a better-than-expected quarterly profit  helped by cost-cutting and lower cost of goods sold  but sales fell for the seventh straight quarter.",
        "date": "11012016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 1-Corn Flakes maker Kellogg's quarterly profit beats estimates "
    },
    {
        "content": "Nov 1 Corn Flakes maker Kellogg Co posted the seventh straight drop in quarterly sales citing weak demand for cereal in the United States  a challenging UK market and \"portfolio transformations that have taken longer than anticipated to execute\".",
        "date": "11012016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Corn Flakes maker Kellogg's quarterly sales fall 2.3 pct "
    },
    {
        "content": "* Kellogg Company declares regular dividend of $0.52 per share  Source text for Eikon:  Further company coverage:",
        "date": "10212016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg Co declares regular dividend of $0.52 per share "
    },
    {
        "content": "* Kellogg's\u007f and Mistica Foods(tm) announce license partnership to launch chicken bites breaded with cheez-it(tm) crackers  Source text for Eikon:  Further company coverage:",
        "date": "10182016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg's and Mistica Foods report license partnership "
    },
    {
        "content": "Kellogg Co  said it would buy a controlling stake in privately held Brazilian food group Parati for about 1.38 billion reais ($428 million) in cash to expand in emerging markets.",
        "date": "10132016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Kellogg to buy controlling stake in Brazilian food group Parati "
    },
    {
        "content": "Oct 13 Kellogg Co said it would buy a controlling stake in privately held Brazilian food group Parati for about 1.38 billion reais ($428 million) in cash to expand in emerging markets.",
        "date": "10132016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 1-Kellogg to buy controlling stake in Brazilian food group Parati "
    },
    {
        "content": "Oct 13 Corn Flakes maker Kellogg Co said on Thursday it would buy Ritmo Investimentos  the controlling shareholder of Brazilian biscuit maker Parati Group  for about 1.38 billion reais ($428.44 million) to expand its presence in emerging markets.",
        "date": "10132016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "RPT-Kellogg to buy controlling shareholder of Brazil's Parati Group "
    },
    {
        "content": "Oct 13 Corn Flakes maker Kellogg Co said on Thursday it would buy Ritmo Investimentos  the controlling shareholder of Brazilian biscuit maker Parati Group  for about 1.38 billion reais ($428.44 million) to expand its presence in emerging markets.",
        "date": "10132016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg to buy controlling shareholder of Brazil's Parati Group "
    },
    {
        "content": "* Kellogg Company enters into agreement to acquire Ritmo Investimentos  controlling shareholder of iconic Brazilian food company Parati",
        "date": "10132016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Kellogg Co to acquire Ritmo Investimentos for R$1.38 bln  or roughly US$429 mln "
    },
    {
        "content": "* Kellogg Company renews partnership with U.S. Olympic committee",
        "date": "09272016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg Co renews partnership with U.S. Olympic Committee "
    },
    {
        "content": "* Voluntarily recalls limited number of Kellogg's\u007f Eggo\u007f Nutri grain\u007f whole wheat waffles due to potential health risk",
        "date": "09192016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg voluntarily recalls limited number of one of its Eggo\u007f products "
    },
    {
        "content": "* Co says George Harad will continue to serve as independent chair of board until Thomas Graham's appointment becomes effective on Aug. 15",
        "date": "08042016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Clorox board names Benno Dorer chairman of board "
    },
    {
        "content": "* On conf call- will make a more aggressive portfolio change to special k in 2017  expect to continue to see some drag from special k in second half of 2016",
        "date": "08042016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Kellogg on conf call- Expect $150 mln-$180 mln in savings from zero-based budgeting in 2016 "
    },
    {
        "content": "Corn Flakes maker Kellogg Co  raised its adjusted profit forecast for 2016  saying that it was saving more from its cost-cutting steps than it had expected.",
        "date": "08042016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Corn Flakes maker Kellogg raises 2016 profit forecast "
    },
    {
        "content": "* Shares rise as much as 3.7 pct   (Adds details  profit forecast)",
        "date": "08042016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 2-Corn Flakes maker Kellogg raises 2016 profit forecast "
    },
    {
        "content": "* Kellogg company reports second quarter 2016 results  raises outlook for comparable profit margin*",
        "date": "08042016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Kellogg reports Q2 diluted earnings per share $0.79 "
    },
    {
        "content": "Aug 4 Kellogg Co's quarterly sales fell 6.6 percent  the sixth straight quarter of decline  as demand slid for its breakfast foods and snacks.",
        "date": "08042016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Corn Flakes maker Kellogg's quarterly sales fall 6.6 pct "
    },
    {
        "content": "* Kellogg Company declares regular dividend of $0.52 per share  Source text for Eikon:  Further company coverage:",
        "date": "07292016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg Company declares regular dividend of $0.52/shr "
    },
    {
        "content": "* On july 13  unit  entered into a receivables sale agreement with kellogg funding company  llc - sec filing",
        "date": "07152016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg says unit entered into receivables sale agreement with Kellogg Funding Co "
    },
    {
        "content": "June 29 Kellogg Co is offering a grrrr-eat new spot for cereal-lovers  with the opening of its first cereal cafe in New York City's Times Square  the company said on Wednesday.",
        "date": "06292016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg's cereal cafe to snap  crackle and pop into Times Square "
    },
    {
        "content": "* Kellogg company establishes venture capital fund to support growth",
        "date": "06202016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg Co establishes venture capital fund to support growth "
    },
    {
        "content": "* Richard Dreiling previously served as CEO of Dollar General Corporation",
        "date": "06152016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg elects Richard Dreiling to board of directors "
    },
    {
        "content": "* Kellogg company voluntarily recalls certain snacks for potential undeclared peanut residue due to flour supplier recall",
        "date": "06132016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg voluntarily recalls certain snacks for potential undeclared peanut residue "
    },
    {
        "content": "Kellogg Co's  sales fell more than expected in the first-quarter as demand stayed sluggish in the United States  and the company said full-year sales would be hurt by the lingering effects of a sales force rejig aimed at reviving growth.",
        "date": "05052016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Corn Flakes maker Kellogg sales stay soggy on weak demand "
    },
    {
        "content": "* On conf call - CFO Ron Dissinger to retire  to stay on into 2017 to ensure an orderly ineffective transition",
        "date": "05052016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "BRIEF-Kellogg Co- toning down FY outlook outside Venezuela due to snacks sales force transition  product transitions and Europe  Latam market conditions "
    },
    {
        "content": "* Kellogg company declares regular dividend of $0.50 per share and announces plans for 4% dividend increase",
        "date": "04292016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "BRIEF-Kellogg announces plans for 4 pct dividend increase beginning with Q3 of 2016 "
    },
    {
        "content": "March 14 Breakfast cereals maker Kellogg Co  said federal regulators are conducting a criminal investigation of a video that surfaced on Friday showing a man filming himself urinating on one of its factory assembly lines.",
        "date": "03142016",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "FDA investigating graphic video linked to Kellogg factory "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 25 (Fitch) Fitch Ratings has assigned a rating of 'BBB' to  Kellogg Company's (Kellogg) $750 million due 2026 and $650 million due 2046.  Proceeds from the notes will be used to tender $440 million of the $1.1 billion  senior unsecured notes due in 2031 and to term out the outstanding $899 million  U.S. commercial paper balance. A full list of ratings follows at the end of this  release. KEY RATING DRIVERS The ratings",
        "date": "02252016",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Fitch Rates Kellogg Company's $1.4B Senior Unsecured Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "* Certified goals seen as meaningful step toward limiting warming   (Adds Kellogg goals  comment)",
        "date": "12082015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "UPDATE 1-Kellogg  Sony and others sign up to emissions goals "
    },
    {
        "content": "* CEO sees improvement in adult market cereals   (Updates to add link to graphic)",
        "date": "11032015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "UPDATE 5-Kellogg's sales fall as U.S. consumers shun cereals and snacks "
    },
    {
        "content": "Continued weak demand for cereals and snacks in the United States weighed on Kellogg Co   the maker of Corn Flakes and Cheez-It crackers  which reported a bigger-than-expected drop in quarterly net sales on Tuesday.",
        "date": "11032015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg's sales fall as U.S. consumers shun cereals and snacks "
    },
    {
        "content": "* Futures down: Dow 31 pts  S&P 4.75 pts  Nasdaq 12.25 pts   (Adds details  comment  updates prices)",
        "date": "11032015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "US STOCKS-Indexes set to open lower after Monday's rally "
    },
    {
        "content": "Nov 3 Kellogg Co's net sales fell for the third quarter in a row as the company struggles to boost demand for its snacks and cereals in the United States.",
        "date": "11032015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg sales fall for third straight quarter "
    },
    {
        "content": "Kellogg Co   which makes Corn Flakes and Rice Krispies  is in late-stage talks to buy snack foods company Diamond Foods Inc  for more than $1.5 billion  the New York Post reported on Friday  citing unnamed sources.",
        "date": "10232015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Kellogg in talks to buy Diamond Foods for $1.5 billion: NY Post "
    },
    {
        "content": "Oct 23 Kellogg Co  which makes Corn Flakes and Rice Krispies  is in late-stage talks to buy snack foods company Diamond Foods Inc for more than $1.5 billion  the New York Post reported on Friday  citing unnamed sources.",
        "date": "10232015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 2-Kellogg in talks to buy Diamond Foods for $1.5 bln - NY Post "
    },
    {
        "content": "Oct 23 Corn Flakes maker Kellogg Co is in late-stage talks to buy snack foods company Diamond Foods Inc  for more than $1.5 billion  the New York Post reported  citing sources.",
        "date": "10232015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg in talks to buy Diamond Foods for $1.5 bln - NY Post "
    },
    {
        "content": "Sept 15 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "09152015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Kellogg Co  is setting up a joint venture with the African arm of Singapore's Tolaram Group to bolster its breakfast and snack food offerings in West Africa.",
        "date": "09152015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg to spend $450 million to expand in Africa "
    },
    {
        "content": "Sept 15 Kellogg Co is setting up a joint venture with the African arm of Singapore's Tolaram Group to bolster its breakfast and snack food offerings in West Africa.",
        "date": "09152015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 1-Kellogg to spend $450 mln to expand in Africa "
    },
    {
        "content": "Sept 15 Kellogg Co said it would buy a 50 percent stake in Lagos  Nigeria-based Multipro  a sales and distribution unit owned by Singapore's Tolaram Group  for $450 million.",
        "date": "09152015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg to spend $450 mln to expand in Africa "
    },
    {
        "content": "CAPE TOWN  Aug 31 Kellogg's South African unit will urge competition authorities to block a proposed merger between rivals Pioneer Foods and Futurelife  regulators said on Monday.",
        "date": "08312015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "REFILE-Kellogg's S.African unit opposes rivals cereal merger "
    },
    {
        "content": "Wall Street ended lower on Tuesday for a third straight session as investors worried about a rise in interest rates while Apple's shares hit their lowest in over six months. | Video ",
        "date": "08042015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Wall Street moves lower on Apple  interest rate worries "
    },
    {
        "content": "Kellogg Co's Corn Flakes and Rice Krispies are set to turn all-natural soon.",
        "date": "08042015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg to stop using artificial products in cereals  snack bars "
    },
    {
        "content": "Aug 4 Kellogg Co's Corn Flakes and Rice Krispies are set to turn all-natural soon.",
        "date": "08042015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 3-Kellogg to stop using artificial products in cereals  snack bars "
    },
    {
        "content": "Kellogg Co's Corn Flakes and Rice Krispies are set to turn all-natural soon.",
        "date": "08042015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg to stop using artificial products in cereals and snacks "
    },
    {
        "content": "* Futures: Dow up 13 pts  S&P little changed  Nasdaq down 4 pts   (Adds details  comment  updates prices)",
        "date": "08042015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "US STOCKS-Wall St set to open little changed amid earnings "
    },
    {
        "content": "Aug 4 Kellogg Co reported a 5.1 percent drop in quarterly net sales  hurt by a strong dollar and lower demand for its cereals and snacks in the United States.",
        "date": "08042015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg sales fall on lower demand for cereals  snacks in US "
    },
    {
        "content": "Aug 4 U.S. stock index futures were lower on Tuesday as investors awaited earnings reports from a batch of companies that includes Walt Disney Co and Kellogg .",
        "date": "08042015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "US STOCKS-Futures lower as investors await earnings  data "
    },
    {
        "content": "A patent licenser suing the New York Times  CBS Corp and other media has asked an appeals court to rehear a case on when a patent owner should be able to amend a patent at risk of cancellation by the U.S. Patent and Trademark Office.",
        "date": "06102015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Company suing N.Y. Times  CBS  challenges court on amended patents "
    },
    {
        "content": "CAIRO  May 27 The board of Egyptian biscuit maker Bisco Misr has approved a voluntary delisting from the Egyptian stock exchange as requested by controlling shareholder U.S. company Kellogg  the company said on Wednesday.",
        "date": "05272015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Biscuit maker Bisco Misr approves delisting from Egyptian exchange "
    },
    {
        "content": "Kellogg Co   the world's largest maker of breakfast cereals  reported better-than-expected quarterly profit and sales as demand rose in Latin America.",
        "date": "05052015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Kellogg's profit beats as Latin America sales rise "
    },
    {
        "content": "May 5 Kellogg Co  the world's largest maker of breakfast cereals  reported better-than-expected quarterly profit and sales as demand rose in Latin America.",
        "date": "05052015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 1-Kellogg's profit beats as Latin America sales rise "
    },
    {
        "content": "May 5 Kellogg Co  the world's largest maker of breakfast cereals  reported a 5 percent drop in quarterly net sales as a strong dollar reduced the value of sales outside North America.",
        "date": "05052015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Cereal maker Kellogg's sales fall 5 pct "
    },
    {
        "content": "where assigned  and hit the newskey (F9 on Reuters terminals)",
        "date": "03022015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "New Issue-Kellogg prices 600 mln euro 2025 bond "
    },
    {
        "content": "NEW YORK U.S. consumers are shifting away from weight-management foods  forcing companies ranging from Kellogg Co to Nestle SA to change ingredients and focus their marketing on different health benefits as sales slip.",
        "date": "02202015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Food companies aim to reinvent diet foods to stay relevant "
    },
    {
        "content": "Kellogg Co   the world's largest maker of breakfast cereals  cut its forecast for long-term annual revenue growth as consumers shift away from cereals and snacks to cheaper private label foods and cook more at home.",
        "date": "02122015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Kellogg cuts long-term outlook on sluggish cereal  snack sales "
    },
    {
        "content": "Feb 12 Kellogg Co  the world's largest maker of breakfast cereals  cut its forecast for long-term annual revenue growth as consumers shift away from cereals and snacks to cheaper private label foods and cook more at home.",
        "date": "02122015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "UPDATE 2-Kellogg cuts long-term outlook on sluggish cereal  snack sales "
    },
    {
        "content": "Feb 12 Kellogg Co  the world's largest maker of breakfast cereals  reported lower-than-expected quarterly sales  weighed down by weak demand in Europe and Asia Pacific.",
        "date": "02122015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Kellogg's quarterly sales miss estimates as Europe  Asia Pacific weighs "
    },
    {
        "content": "Thomson Reuters Feb 11  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                  ",
        "date": "02112015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "Thomson Reuters Feb 12  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                  ",
        "date": "02122015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "LONDON  Jan 8 Tesco delivered its first salvo in a fight back against the growth of discount supermarkets on Thursday by cutting the price of hundreds of branded products such as Hovis bread  Kellogg's cornflakes and Stella Artois lager.",
        "date": "01082015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "Tesco takes fight to discounters with price cuts on brands "
    },
    {
        "content": "CAIRO  Jan 6 Shareholders in Egypt's Bisco Misr  have agreed to sell a controlling stake to Kellogg  as the world's largest breakfast cereal maker emerged as the likely winner of an $87 million takeover battle for the cake and biscuit producer.",
        "date": "01062015",
        "name": "Kellogg Company",
        "news_type": "topStory",
        "symbol": "K",
        "title": "UPDATE 2-Egypt's Bisco Misr shareholders agree to sell stake to Kellogg "
    },
    {
        "content": "CAIRO  Jan 6 Egypt's Bisco Misr said on Tuesday shareholders controlling nearly 60 percent of the company had agreed to sell to the world's largest breakfast cereal maker  Kellogg  sealing its victory in an $87 million takeover battle.",
        "date": "01062015",
        "name": "Kellogg Company",
        "news_type": "normal",
        "symbol": "K",
        "title": "Egypt's Bisco Misr shareholders agree to sell stake to Kellogg "
    }
]