[
    {
        "content": "* KAR Auction Services Inc reports third quarter 2017 financial results",
        "date": "10312017",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-KAR Auction Services reports Q3 earnings per share $0.46 "
    },
    {
        "content": "* IAA expands in Indiana  Kansas  Utah  Minnesota  Virginia and Alabama",
        "date": "08162017",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-IAA expands in Indiana  Kansas  Utah  Minnesota  Virginia and Alabama "
    },
    {
        "content": "* KAR Auction Services Inc reports second quarter 2017 financial results",
        "date": "08082017",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-KAR Auction Services reports Q2 earnings per share $0.41 "
    },
    {
        "content": "* Kar Auction Services announces pricing and upsizing of debt financing",
        "date": "05222017",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-Kar Auction Services announces pricing and upsizing of debt financing "
    },
    {
        "content": "* CARSARRIVE NETWORK ACQUIRES DEPENDABLE AUTO SHIPPERS BUSINESS",
        "date": "05172017",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-KAR AUCTION SERVICES' UNIT ACQUIRES DEPENDABLE AUTO SHIPPERS BUSINESS "
    },
    {
        "content": "* Kar Auction Services  Inc. reports first quarter 2017 financial results",
        "date": "05092017",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-Kar Auction Services reports Q1 earnings per share $0.50 "
    },
    {
        "content": "* Kar Auction Services seeks to refinance and reprice existing debt",
        "date": "05092017",
        "name": "KAR Auction Services Inc",
        "news_type": "normal",
        "symbol": "KAR",
        "title": "BRIEF-Kar Auction Services seeks to refinance and reprice existing debt "
    },
    {
        "content": "* KAR acquires Drivin to bolster data analytic capabilities and strengthen leading remarketing platform",
        "date": "04192017",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-KAR acquires Drivin to bolster data analytic capabilities "
    },
    {
        "content": "CHICAGO  April 19 KAR Auction Services Inc   a provider of car auction and salvage services  said on Wednesday it would acquire DRIVIN  which aggregates automotive retail  pricing  registration and economic data to match vehicle inventory to dealer demand  for $43 million in stock.",
        "date": "04192017",
        "name": "KAR Auction Services Inc",
        "news_type": "normal",
        "symbol": "KAR",
        "title": "KAR Auction to buy DRIVIN data provider for $43 million "
    },
    {
        "content": "* KAR Auction Services Inc - has extended up to $15 million in credit to Nth Gen Software  Inc  Source text for Eikon:  Further company coverage:",
        "date": "03162017",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-KAR Auction Services extends up to $15 mln in credit to Nth Gen Software "
    },
    {
        "content": "* KAR Auction Services  Inc. Reports 2016 financial results and the fourth quarter repurchase of 1.9 million shares",
        "date": "02212017",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-KAR Auction Services Q4 earnings per share $0.33 "
    },
    {
        "content": "* KAR Auction Services extends midwest platform with acquisition of Flint Auto Auction  Source text for Eikon:  Further company coverage:",
        "date": "11152016",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-KAR Auction Services extends Midwest Platform with acquisition of Flint Auto Auction "
    },
    {
        "content": "* Board of directors has authorized repurchase of up to $500 million of company's outstanding common stock over next three years",
        "date": "11032016",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-KAR Auction Services Q3 earnings per share $0.39 "
    },
    {
        "content": "* Q2 revenue $771.8 million versus I/B/E/S view $756.4 million",
        "date": "08022016",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-KAR Auction Services Inc Reports Q2 2016 financial results "
    },
    {
        "content": "* Kar Auction Services  inc. reports first quarter 2016 financial results",
        "date": "05032016",
        "name": "KAR Auction Services Inc",
        "news_type": "topStory",
        "symbol": "KAR",
        "title": "BRIEF-Kar auction services  inc Q1 adjusted operating EPS $0.55 "
    }
]