[
    {
        "content": "SEOUL South Korean steelmaker POSCO plans to sell a stake in KB Financial Group in a block deal worth up to 444 billion won ($383.9 million)  IFR reported on Thursday  citing a term sheet.",
        "date": "07062017",
        "name": "KB Financial Group Inc",
        "news_type": "topStory",
        "symbol": "KB",
        "title": "Posco to sell shares in KB Financial in block deal worth up to $384 million: IFR "
    },
    {
        "content": "SEOUL  July 6 South Korean steelmaker POSCO plans to sell a stake in KB Financial Group in a block deal worth up to 444 billion won ($383.9 million)  IFR reported on Thursday  citing a term sheet.",
        "date": "07062017",
        "name": "KB Financial Group Inc",
        "news_type": "normal",
        "symbol": "KB",
        "title": "Posco to sell shares in KB Financial in block deal worth up to $384 mln-IFR "
    },
    {
        "content": "* Says KB Financial Group has acquired 27.7 percent stake(5.9 million shares) in the company  increasing its stake in the company to 79.7 percent from 52.0 percent",
        "date": "05222017",
        "name": "KB Financial Group Inc",
        "news_type": "topStory",
        "symbol": "KB",
        "title": "BRIEF-KB Financial Group buys 27.7 pct stake in KB Capital "
    },
    {
        "content": "* Says KB Financial Group has acquired 54.5 percent stake(36.2 million shares) in the company  increasing its stake in the company to 94.3 percent from 39.8 percent",
        "date": "05222017",
        "name": "KB Financial Group Inc",
        "news_type": "normal",
        "symbol": "KB",
        "title": "BRIEF-KB Financial Group buys 54.5 pct stake in KB Insurance "
    },
    {
        "content": "* Says it plans to pay annual cash dividend as 1 250 won/share for FY 2016  to shareholders of record on Dec. 31  2016",
        "date": "02092017",
        "name": "KB Financial Group Inc",
        "news_type": "topStory",
        "symbol": "KB",
        "title": "BRIEF-KB Financial Group to pay annual dividend as 1 250 won/share for FY 2016 "
    },
    {
        "content": "* Says its unit Hyundai Securities Co Ltd will issue 42.2 million shares to merge with KB Investment & Securities Co Ltd  an investment deals and investment brokerage firm  to improve operating efficiency and create synergy effect",
        "date": "11022016",
        "name": "KB Financial Group Inc",
        "news_type": "topStory",
        "symbol": "KB",
        "title": "BRIEF-KB Financial Group unit Hyundai Securities to merge with KB Investment & Securities "
    },
    {
        "content": "* 67 pct of KB's net profit comes from banking unit   (Adds background on KB diversification)",
        "date": "04122016",
        "name": "KB Financial Group Inc",
        "news_type": "topStory",
        "symbol": "KB",
        "title": "UPDATE 1-S.Korea's KB Fin buying Hyundai Securities stake for $1.1 bln to diversify "
    },
    {
        "content": "SEOUL  April 12 South Korean banking group KB Financial Group Inc said on Tuesday it will acquire a stake in brokerage Hyundai Securities Co Ltd  big enough to give it operational control  for 1.25 trillion won ($1.09 billion).",
        "date": "04122016",
        "name": "KB Financial Group Inc",
        "news_type": "normal",
        "symbol": "KB",
        "title": "S.Korea's KB Financial to buy minority control of Hyundai Securities for $1.09 bln "
    },
    {
        "content": "SEOUL  March 31 KB Financial Group Inc  was chosen as preferred bidder to buy a controlling stake in South Korean stock brokerage Hyundai Securities Co Ltd   people with direct knowledge of the matter said on Thursday.",
        "date": "03312016",
        "name": "KB Financial Group Inc",
        "news_type": "topStory",
        "symbol": "KB",
        "title": "KB Financial chosen preferred bidder for Hyundai Securities - sources "
    }
]