[
    {
        "content": "* NuGen says no decisions have been taken (Adds detail  context)",
        "date": "06282017",
        "name": "Korea Electric Power Corporation",
        "news_type": "topStory",
        "symbol": "KEP",
        "title": "UPDATE 2-South Korea's KEPCO in talks for stake in UK nuclear project "
    },
    {
        "content": "* Britain  Toshiba seek to accelerate chase for deal (Adds British minister  KEPCO spokesman comments)",
        "date": "04052017",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "UPDATE 1-Korea's KEPCO cautious as Britain hunts partner for crucial nuclear project -sources "
    },
    {
        "content": "SEOUL  April 5 As Britain steps up the hunt for a new partner for a stalled nuclear power project  South Korea's KEPCO remains the most likely suitor  but two people with direct knowledge of the matter said the giant utility won't be rushed to the altar.",
        "date": "04052017",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "Korea's KEPCO cautious as Britain hunts partner for crucial nuclear project -sources "
    },
    {
        "content": "TOKYO  March 27 Shares in Toshiba Corp rose on Monday morning after a report that U.S. unit Westinghouse Electric Co could file for bankruptcy protection as early as Tuesday and is seeking support from South Korea's Korea Electric Power Corp.",
        "date": "03272017",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "Toshiba shares rise after report Westinghouse may file bankruptcy Tuesday "
    },
    {
        "content": "TOKYO  March 27 Westinghouse Electric Co  the U.S. nuclear unit of Japan's Toshiba Corp  could file for bankruptcy protection as early as Tuesday and is seeking support from South Korea's     Korea Electric Power Corp   the Nikkei said on Monday.",
        "date": "03262017",
        "name": "Korea Electric Power Corporation",
        "news_type": "topStory",
        "symbol": "KEP",
        "title": "Toshiba's Westinghouse may file bankruptcy Tuesday  seeks Kepco aid -Nikkei "
    },
    {
        "content": "TOKYO Toshiba Corp  wants its U.S nuclear unit to file for Chapter 11 protection from creditors as early as Tuesday  according to a source with direct knowledge of the matter  seeking a quick ringfencing of losses before the Japanese parent's financial year ends.",
        "date": "03282017",
        "name": "Korea Electric Power Corporation",
        "news_type": "topStory",
        "symbol": "KEP",
        "title": "Toshiba wants Westinghouse to file for bankruptcy as early as Tuesday: source "
    },
    {
        "content": "* Westinghouse bankruptcy filing on Tuesday ideal option -source",
        "date": "03272017",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "UPDATE 4-Toshiba wants Westinghouse to file for bankruptcy as early as Tuesday -source "
    },
    {
        "content": "SEOUL Korea Electric Power Corp (KEPCO)  is in talks to buy a stake in the Toshiba-Engie British nuclear joint venture NuGen  chief executive of the South Korean utility said.",
        "date": "03222017",
        "name": "Korea Electric Power Corporation",
        "news_type": "topStory",
        "symbol": "KEP",
        "title": "South Korea's KEPCO in talks to buy Toshiba's stake in UK nuclear project NuGen "
    },
    {
        "content": "SEOUL  March 22 Korea Electric Power Corp (KEPCO) is in talks to buy a stake in the Toshiba-Engie British nuclear joint venture NuGen  chief executive of the South Korean utility said.",
        "date": "03222017",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "S.Korea's KEPCO in talks to buy Toshiba's stake in UK nuclear project NuGen "
    },
    {
        "content": "* won't comment on speculation after report it is in talks to sell stake in UK nuclear venture NuGeneration Ltd to Korea Electric Power Corp   Source text for Eikon:  Further company coverage:    (Reporting by Makiko Yamazaki)",
        "date": "02132017",
        "name": "Korea Electric Power Corporation",
        "news_type": "topStory",
        "symbol": "KEP",
        "title": "BRIEF-Toshiba: won't comment on speculation after report it is in talks to sell stake in NuGen to Kepco "
    },
    {
        "content": "* Toshiba is considering selling an interest in a U.K. Nuclear venture to Korea Electric Power Corp- Nikkei  Source text (http://s.nikkei.com/2l0SNjx) Further company coverage:",
        "date": "02132017",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "BRIEF-Toshiba considering selling interest in U.K. Nuclear venture to Korea Electric Power Corp- Nikkei "
    },
    {
        "content": "* Toshiba releases unaudited numbers  forecasts full-year loss",
        "date": "02142017",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "UPDATE 4-Delays  confusion as Toshiba reports $6.3 bln nuclear hit and slides to loss "
    },
    {
        "content": "TOKYO After a day of delays and confusion  Japan's Toshiba Corp  said on Tuesday it expected to book a $6.3 billion hit to its U.S. nuclear unit  a writedown that wipes out its shareholder equity and will drag the group to a full-year loss.",
        "date": "02142017",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "Delays  confusion as Toshiba reports $6 billion nuclear hit and slides to loss "
    },
    {
        "content": "* Says it signs 2.52 billion won contract with Korea Electric Power Corporation to provide KEPCO big data integration platform building materials",
        "date": "02012017",
        "name": "Korea Electric Power Corporation",
        "news_type": "topStory",
        "symbol": "KEP",
        "title": "BRIEF-Exem signs 2.52 bln won contract with Korea Electric Power "
    },
    {
        "content": "PARIS/LONDON  Sept 12 South Korean power utility KEPCO is in talks with Japan's Toshiba and France's Engie about buying a stake in the Toshiba-Engie British nuclear joint venture NuGen  a source familiar with the situation told Reuters on Monday.",
        "date": "09132016",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "CORRECTED-UPDATE 1-Korea's KEPCO in talks to buy into UK nuclear project NuGen - source "
    },
    {
        "content": "SEOUL  Sept 13 South Korea's nuclear operator said early on Tuesday it suspended operation of four reactors at a nuclear power complex as a precaution late on Monday after two earthquakes struck the country's southeast.",
        "date": "09122016",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "Four South Korea nuclear reactors suspended due to earthquakes "
    },
    {
        "content": "SEOUL  Sept 2 State-run utility Korea Electric Power Corp (KEPCO) on Friday agreed a deal on developing nuclear energy in Kenya  as the African nation looks to broaden its sources of electricity.",
        "date": "09022016",
        "name": "Korea Electric Power Corporation",
        "news_type": "topStory",
        "symbol": "KEP",
        "title": "South Korea  Kenya to cooperate on nuclear energy "
    },
    {
        "content": "SEOUL Korea Electric Power Corp (KEPCO) signed a contract on Aug. 26 to buy a solar power plant from the U.S.-based Carlyle Group’s Cogentrix Solar Holdings  KEPCO said in a statement released on Sunday.",
        "date": "08282016",
        "name": "Korea Electric Power Corporation",
        "news_type": "topStory",
        "symbol": "KEP",
        "title": "South Korea’s KEPCO buys Colorado solar power plant from Carlyle Group "
    },
    {
        "content": "SEOUL  Aug 28 Korea Electric Power Corp (KEPCO)  signed a contract on Aug. 26 to buy a solar power plant from the U.S.-based Carlyle Group's Cogentrix Solar Holdings  KEPCO said in a statement released on Sunday.",
        "date": "08282016",
        "name": "Korea Electric Power Corporation",
        "news_type": "normal",
        "symbol": "KEP",
        "title": "S.Korea's KEPCO buys Colorado solar power plant from Carlyle Group "
    }
]