[
    {
        "content": "* Keycorp declares increased quarterly common share dividend of ten and one half cents",
        "date": "11162017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp declares increased quarterly common share dividend "
    },
    {
        "content": "* Keybank launches comprehensive treasury management platform Source text for Eikon: Further company coverage:",
        "date": "10162017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Keybank launches comprehensive treasury management platform "
    },
    {
        "content": "KeyCorp  reported a lower-than-expected quarterly profit on higher costs and tightened the range of its full-year loan growth forecast  sending its shares down 5 percent.",
        "date": "10192017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "KeyCorp misses profit estimate  trims loan growth forecast "
    },
    {
        "content": "Oct 19 KeyCorp reported a lower-than-expected quarterly profit on higher costs and tightened the range of its full-year loan growth forecast  sending its shares down 5 percent.",
        "date": "10192017",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "UPDATE 2-KeyCorp misses profit estimate  trims loan growth forecast "
    },
    {
        "content": "* KeyCorp reports third quarter 2017 net income of $349 million  or $.32 per common share",
        "date": "10192017",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp reports Q3 adjusted earnings per share $0.35‍​ "
    },
    {
        "content": "* Keycorp - Sees FY net interest income to be in the range of $3.8 billion - $3.9 billion ‍​ Source text: [http://bit.ly/2ytHFow] Further company coverage:",
        "date": "10192017",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp sees FY net interest income to be in the range of $3.8 bln - $3.9 bln ‍​ "
    },
    {
        "content": "Oct 19 U.S. regional bank KeyCorp reported quarterly profit that more than doubled as it gains from its acquisition of First Niagara  while income from loans benefited from higher interest rates.",
        "date": "10192017",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "KeyCorp's profit soars on higher interest rates "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 03 (Fitch) Fitch Ratings has affirmed the Long- and Short-Term Issuer Default Ratings (IDRs) of KeyCorp (Key)  and Key Bank  N.A. to 'A-'/'F1'. The Rating Outlook has been revised to Stable from Negative. The affirmation reflects the strong earnings profile  stable and diverse business model  and consistency of performance through time. A full list of rating actions follows at the end of this release. The rating action",
        "date": "10032017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "Fitch Affirms KeyCorp's L-T IDR at 'A-' Following Large Regional Bank Review; Outlook to Stable "
    },
    {
        "content": "* Preferred Apartment Communities Inc announces acquisition of a 300-unit multifamily community in Marietta  Georgia",
        "date": "09292017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Preferred Apartment acquires 300-unit multifamily community in Marietta  Georgia "
    },
    {
        "content": "By Dena Aubin Ohio-based KeyBank can force a lawsuit accusing it of charging unfair overdraft fees into arbitration  a federal appeals court ruled  blocking customers from suing the bank in court as a class.",
        "date": "09272017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "KeyBank customers must arbitrate overdraft dispute - 11th Circuit "
    },
    {
        "content": "* KeyCorp - ‍following closing of deal and upon receipt of regulatory approvals  Cain Brothers will go to market as a division of KeyBanc Capital Markets​",
        "date": "08152017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyBanc Capital Markets to acquire Cain Brothers "
    },
    {
        "content": "* Black Knight Financial Services - ‍ Keybank signed agreement to implement Black Knight's loansphere MSP system and portfolio overview insight solution​",
        "date": "08102017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyBank signs contract to implement Black Knight's loansphere msp servicing system "
    },
    {
        "content": "U.S. regional bank KeyCorp  said it expects average loans at the end of 2017 to be at the low end of its previous forecast  sending shares down as much as 4.7 percent.",
        "date": "07202017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "KeyCorp's 2017 loan forecast casts cloud over profit beat "
    },
    {
        "content": "July 20 U.S. regional bank KeyCorp said it expects average loans at the end of 2017 to be at the low end of its previous forecast  sending shares down as much as 4.7 percent.",
        "date": "07202017",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "UPDATE 2-KeyCorp's 2017 loan forecast casts cloud over profit beat "
    },
    {
        "content": "* Keycorp sees net interest income for full year 2017 in range of $3.8 billion to $3.9 billion - sec filing",
        "date": "07202017",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp sees full year 2017 net interest income $3.8 bln-$3.9 bln "
    },
    {
        "content": "* Q2 allowance for loan and lease losses $870 million versus $854 million",
        "date": "07202017",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp reports Q2 net income of $393 million  or $.36 per common share "
    },
    {
        "content": "July 20 U.S. regional bank KeyCorp's profit more than doubled in the second quarter as total interest income rose 63.3 percent.",
        "date": "07202017",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "KeyCorp's 2nd-qtr profit more than doubles "
    },
    {
        "content": "* KeyCorp announces CCAR capital plan which includes two common stock dividend increases and new share repurchase authorization",
        "date": "06282017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp announces CCAR capital plan "
    },
    {
        "content": "* Keycorp files for potential mixed shelf  size undisclosed - sec filing‍​ Source text for Eikon: Further company coverage:",
        "date": "06092017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp files for potential mixed shelf  size undisclosed "
    },
    {
        "content": "* Keycorp - named Christopher M. Gorman and Donald R. Kimble as vice chairmen",
        "date": "06082017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp names Christopher Gorman and Donald Kimble as vice chairmen "
    },
    {
        "content": "* Keycorp declares increased quarterly common share dividend of nine and one half cents",
        "date": "05172017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp declares increased quarterly common share dividend of nine and one half cents "
    },
    {
        "content": "* KeyCorp reports first quarter 2017 net income of $296 million  or $.27 per common share; earnings per common share of $.32  excluding $.05 of merger-related charges",
        "date": "04202017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp reports Q1 2017 net income of $296 mln "
    },
    {
        "content": "* Announces acquisition of a 312-unit multifamily community in Birmingham  Alabama",
        "date": "03272017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Preferred Apartment Communities announces acquisition of a multifamily community "
    },
    {
        "content": "* Keycorp - Keycorp and its banking affiliates have raised their prime lending rate to 4.00 percent from 3.75 percent  effective  March 16  2017  Source text for Eikon:  Further company coverage:",
        "date": "03152017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp raises its prime lending rate to 4.00 pct "
    },
    {
        "content": "* KeyCorp sees 2017 noninterest income in the range of $2.3 billion to $2.4 billion",
        "date": "01192017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp sees 2017 noninterest income in the range of $2.3 bln to $2.4 bln "
    },
    {
        "content": "* KeyCorp reports fourth quarter 2016 net income of $213 million  or $.20 per common share; earnings per common share of $.31  excluding $.11 of merger-related charges",
        "date": "01192017",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp Q4 EPS $0.31 excluding items "
    },
    {
        "content": "* KeyCorp provides notice of redemption of Series C preferred stock",
        "date": "01122017",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp provides notice of redemption of Series C preferred stock "
    },
    {
        "content": "* Expects to achieve full run rate savings (on First Niagara deal) by back half of 2017; will reflect in 2018 results - conf call  Further company coverage:",
        "date": "10252016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp expects to achieve full run-rate savings on First Niagara deal by H2 2017 - Conf Call "
    },
    {
        "content": "* Sees Q4 net charge-offs relatively stable with Q3; sees Q4 provision for credit losses to slightly exceed charge-offs for Q4",
        "date": "10252016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp sees Q4 net charge-offs relatively stable with Q3 "
    },
    {
        "content": "U.S. regional bank KeyCorp  reported a 22.1 percent fall in quarterly profit as charges related to its July acquisition of First Niagara Bank NA drove up costs by about 50 percent.",
        "date": "10252016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "KeyCorp profit falls on costs related to First Niagara deal "
    },
    {
        "content": "Oct 25 U.S. regional bank KeyCorp  reported a 22.1 percent fall in quarterly profit as charges related to its July acquisition of First Niagara Bank NA drove up costs by about 50 percent.",
        "date": "10252016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "UPDATE 1-KeyCorp profit falls on costs related to First Niagara deal "
    },
    {
        "content": "* KeyCorp reports third quarter 2016 net income of $165 million  or $.16 per common share; earnings per common share of $.30  excluding $.14 of merger-related charges",
        "date": "10252016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp reports third quarter 2016 results "
    },
    {
        "content": "Oct 25 U.S. regional bank KeyCorp  reported a 22.1 percent fall in quarterly profit as non-interest expenses jumped about 49.4 percent.",
        "date": "10252016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "KeyCorp quarterly profit falls about 22 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 04 (Fitch) Fitch Ratings has affirmed the Long-Term and  Short-Term Issuer Defaut Ratings (IDRs) of KeyCorp (Key)  and Key Bank  N.A. The  Rating Outlook is Negative. The affirmation reflects the strong earnings  profile  stable and diverse business model  and its consistency of performance  through time.   The rating action follows a periodic review of the large regional banking group   which includes Keycorp (KEY)  B",
        "date": "10042016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "Fitch Affirms KeyCorp L-T IDR at 'A-' Following Large Regional Bank Review; Outlook Remains Negative "
    },
    {
        "content": "* KeyBank receives regulatory approval for First Niagara Bank merger  Source text for Eikon:  Further company coverage:",
        "date": "09222016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyBank receives regulatory approval for First Niagara Bank merger "
    },
    {
        "content": "* On August 12  co through its operating partnership entered into interest rate swap transaction with Keybank National",
        "date": "08162016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-NexPoint Residential Trust enters interest rate swap deal with Keybank National "
    },
    {
        "content": "* KeyBank says has added masterpass by mastercard to its mobile payments capabilities  Source text for Eikon:  Further company coverage:",
        "date": "08162016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "BRIEF-KeyBank says has added masterpass by mastercard to its mobile payments capabilities "
    },
    {
        "content": "* Sees 2016 average loan growth in mid single digits versus 2015",
        "date": "07262016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp sees 2016 average loan growth in mid single digits vs. 2015 "
    },
    {
        "content": "July 26 Keycorp Reports Second Quarter 2016 Net Income Of $193 Million  Or $.23 Per Common Share; Earnings Per Common Share Of $.27  Excluding $.04 Of Merger",
        "date": "07262016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp Q2 adjusted earnings per share $0.27 "
    },
    {
        "content": "* Keycorp receives regulatory approval for First Niagara Financial Group merger",
        "date": "07122016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp receives regulatory approval for First Niagara Financial Group merger "
    },
    {
        "content": "* KeyCorp declares increased quarterly common share cash dividend of eight and one half cents",
        "date": "05192016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp raises quarterly cash dividend by 13 pct to $0.085/shr "
    },
    {
        "content": "* Joe Calabrese appointed national head of investments for Key Private Bank  Source text for Eikon:  Further company coverage:",
        "date": "05162016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Joe Calabrese appointed national head of investments for Key Private Bank "
    },
    {
        "content": "WASHINGTON Cleveland-based KeyCorp  and First Niagara Financial Group Inc  will sell 18 First Niagara branches in and around Buffalo  New York  to resolve antitrust concerns tied to KeyCorp’s planned acquisition of First Niagara  the U.S. Justice Department said on Thursday.",
        "date": "04282016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "Keycorp  First Niagara to sell 18 branches in New York "
    },
    {
        "content": "* Says merger agreement between Keycorp  first Niagara provides three members of first Niagara's board would be appointed as directors  Source text for Eikon:  Further company coverage:",
        "date": "04222016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Three first Niagara directors to join Keycorp's board "
    },
    {
        "content": "WASHINGTON  April 28 Cleveland-based KeyCorp  and First Niagara Financial Group Inc will sell 18 First Niagara branches in and around Buffalo  New York  to resolve antitrust concerns tied to KeyCorp's planned acquisition of First Niagara  the U.S. Justice Department said on Thursday.",
        "date": "04282016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "UPDATE 1-Keycorp  First Niagara to sell 18 branches in New York "
    },
    {
        "content": "WASHINGTON  April 28 KeyCorp and First Niagara Financial Group Inc will sell 18 First Niagara branches in and around Buffalo  New York  to resolve antitrust concerns tied to KeyCorp's planned acquisition of First Niagara  the U.S. Justice Department said on Thursday.",
        "date": "04282016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "Keycorp  First Niagara to sell branches to resolve antitrust concerns-U.S. DOJ "
    },
    {
        "content": "* Reports First Quarter 2016 Net Income Of $182 Million  Or $.22 Per Common Share; Earnings Per Common Share Of $.24  Excluding $.02 Of merger related expense",
        "date": "04212016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp Q1 EPS $0.24 excluding items "
    },
    {
        "content": "* CEO Beth Mooney's FY 2015 total compensation $7.0 million versus $7.1 million in fy 2014 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "04062016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-Keycorp announces CEO's FY 2015 total compensation "
    },
    {
        "content": "* KeyCorp and First Niagara Financial Group announce shareholder approval of merger",
        "date": "03232016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "BRIEF-KeyCorp and First Niagara Financial Group announce shareholder approval of merger "
    },
    {
        "content": "KeyCorp's stock price may jump 30 percent in a year after a banking sector sell-off beat down its shares and the company's purchase of First Niagara Financial Group could prove more lucrative than expected  Barron's said.",
        "date": "02142016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "KeyCorp stock may jump 30 pct on First Niagara purchase: Barron's "
    },
    {
        "content": "Feb 14 KeyCorp's stock price may jump 30 percent in a year after a banking sector sell-off beat down its shares and the company's purchase of First Niagara Financial Group could prove more lucrative than expected  Barron's said.",
        "date": "02142016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "KeyCorp stock may jump 30 pct on First Niagara purchase-Barron's "
    },
    {
        "content": "NEW YORK New York Governor Andrew Cuomo on Wednesday urged federal regulators to block KeyCorp's  plan to acquire First Niagara Financial Group Inc   saying the merger would impede retail banking competition and cost thousands of jobs upstate.",
        "date": "02102016",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "N.Y. governor urges U.S. to block KeyCorp-First Niagara merger "
    },
    {
        "content": "NEW YORK New York Governor Andrew Cuomo on Wednesday urged federal regulators to block KeyCorp's  plan to acquire First Niagara Financial Group Inc  saying the merger would impede retail banking competition and cost thousands of jobs upstate.",
        "date": "02102016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "NY governor urges U.S. to block KeyCorp-First Niagara merger "
    },
    {
        "content": "NEW YORK  Feb 10 New York Governor Andrew Cuomo on Wednesday urged federal regulators to block KeyCorp's  plan to acquire First Niagara Financial Group Inc  saying the merger would impede retail banking competition and cost thousands of jobs upstate.",
        "date": "02102016",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "UPDATE 2-NY governor urges U.S. to block KeyCorp-First Niagara merger "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 02 (Fitch) Fitch Ratings has placed the long- and short-term  Issue Default Ratings (IDRs) of First Niagara Financial Group (FNFG) and First  Niagara Bank on Rating Watch Positive following its announcement that it will be  acquired by KeyCorp. Concurrent with this action  Fitch has affirmed the L-T and  S-T IDRs of KeyCorp (Key)  and Key Bank  N.A. and revised the Rating Outlook to  Negative from Stable. A complete l",
        "date": "11022015",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "Fitch Places First Niagara on Watch Positive; Affirms KeyCorp with Negative Outlook on Merger "
    },
    {
        "content": "Oct 30 Cleveland-based KeyCorp has agreed to buy First Niagara Financial Group Inc of Buffalo for $4.1 billion in the biggest deal this year between two U.S. regional banks.",
        "date": "10302015",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "RPT-UPDATE 3-KeyCorp to buy First Niagara to create 13th biggest U.S. bank "
    },
    {
        "content": "Cleveland-based KeyCorp  has agreed to buy First Niagara Financial Group Inc  of Buffalo for $4.1 billion in the biggest deal this year between two U.S. regional banks.",
        "date": "10302015",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "KeyCorp to buy First Niagara to create 13th biggest U.S. bank "
    },
    {
        "content": "* KeyCorp shares down 6.6 pct   (Adds analyst quote  Breakingviews link  updates shares)",
        "date": "10302015",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "UPDATE 3-KeyCorp to buy First Niagara to create 13th biggest U.S. bank "
    },
    {
        "content": "Oct 30 Cleveland-based KeyCorp has agreed to buy First Niagara Financial Group Inc of Buffalo for $4.1 billion in the biggest deal this year between two U.S. regional banks.",
        "date": "10302015",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "CORRECTED-UPDATE 2-KeyCorp to buy First Niagara to create 13th biggest U.S. bank "
    },
    {
        "content": "Oct 30 Cleveland  Ohio-based KeyCorp  said on Friday it will buy Buffalo  New York-based First Niagara Financial Group Inc for $4.1 billion in a cash and stock deal.",
        "date": "10302015",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "REFILE-KeyCorp to buy First Niagara for $4.1 bln "
    },
    {
        "content": "Cleveland-based KeyCorp  is in advanced talks to buy Buffalo-based First Niagara Financial Group Inc   according to sources familiar with the matter  the latest example of a consolidation push among regional U.S. banks.",
        "date": "10292015",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "KeyCorp in talks to buy First Niagara Financial: sources "
    },
    {
        "content": "Oct 29 Cleveland-based KeyCorp is in advanced talks to buy Buffalo-based First Niagara Financial Group Inc  according to sources familiar with the matter  the latest example of a consolidation push among regional U.S. banks.",
        "date": "10292015",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "UPDATE 1-KeyCorp in talks to buy First Niagara Financial-sources "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 17 (Fitch) Following the Non-Rating Action Commentary of March  9  2015  Fitch has reviewed its previous intention to withdraw rating coverage  of KeyCorp and Key Bank N.A. and opted to continue coverage until further  notice.  Key's ratings were last affirmed on Oct. 7  2014.  KeyCorp --Long-term Issuer Default Rating (IDR) 'A-'; Outlook Stable --Short-term IDR 'F1' --Viability 'a-' --Senior debt 'A-' --Subordinated deb",
        "date": "03172015",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "Fitch to Maintain KeyCorp and KeyBank N.A. Ratings at 'A-' and 'F1' "
    },
    {
        "content": "Feb 9 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "02092015",
        "name": "KeyCorp",
        "news_type": "topStory",
        "symbol": "KEY",
        "title": "MOVES- KPMG  Candriam Investors  KeyCorp  Man Group "
    },
    {
        "content": "Feb 9 U.S.-based regional lender KeyCorp  appointed Terry Jenkins as president of Key Private Bank to develop the company's wealth management unit.",
        "date": "02092015",
        "name": "KeyCorp",
        "news_type": "normal",
        "symbol": "KEY",
        "title": "MOVES-KeyCorp appoints Terry Jenkins as president of Key Private Bank "
    }
]