[
    {
        "content": "* Kinross Gold Corp - ‍tracking towards high end of 2017 production and low end of cost guidance​",
        "date": "11082017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Kinross reports Q3 earnings per share $0.05 "
    },
    {
        "content": "* Orca Gold receives ministerial approval for the acquisition of the Kinross Cote D'Ivoire property portfolio Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Orca Gold receives ministerial approval for acquisition of Kinross Cote D'Ivoire property portfolio "
    },
    {
        "content": "* Ashanti Gold exercises option agreement with Kinross subsidiary",
        "date": "10172017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Ashanti Gold exercises option agreement with Kinross subsidiary "
    },
    {
        "content": "* On or about Sept 20  Kinross gave LKA notice of termination of agreement related to mining claims owned by LKA in Hinsdale County  Colorado Source text for Eikon: Further company coverage:",
        "date": "09252017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-LKA Gold says Kinross gave co notice of termination of agreement related to mining claims "
    },
    {
        "content": "* Integra Resources to acquire Delamar project from Kinross Gold",
        "date": "09192017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Integra Resources to acquire Delamar project from Kinross Gold "
    },
    {
        "content": "Sept 18 Kinross Gold Corp  as expected  gave the go-ahead on Monday to spend more than $1 billion to expand two of its gold mines  including its Tasiast mine in West Africa  but its shares fell as investors took profits after a stellar run this year.",
        "date": "09182017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "UPDATE 1-Kinross Gold to spend $1 bln to expand mines  stock falls "
    },
    {
        "content": "* Kinross Gold says to proceed with Tasiast Phase Two and Round Mountain Phase W expansion projects",
        "date": "09182017",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "BRIEF-Kinross Gold says to proceed with Tasiast Phase Two  Round Mountain Phase W expansion projects "
    },
    {
        "content": "Sept 18 Kinross Gold Corp said it plans to expand two gold mines  including the second phase of its Tasiast operation in West Africa  spending more than $1 billion to boost output and lower costs.",
        "date": "09182017",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Kinross Gold to spend $1 bln to expand Mauritania  Nevada mines "
    },
    {
        "content": "* Aurion announces private placement financing with Kinross Gold Corporation",
        "date": "09072017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Aurion announces private placement financing with Kinross Gold Corporation "
    },
    {
        "content": "* Kinross Gold Corp- ‍company expects to meet its 2017 capital expenditures forecast of approximately $900 million​",
        "date": "08022017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Kinross Q2 earnings per share $0.03 "
    },
    {
        "content": "* Kinross announces US$500 million unsecured 10-year debt offering",
        "date": "06282017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Kinross announces US$500 mln unsecured 10-yr debt offering "
    },
    {
        "content": "* LKA Gold Inc - reports that Kinross drilling contractors have mobilized and resumed drilling at LKA's golden wonder mine",
        "date": "06022017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Kinross resumes drilling at LKA's golden wonder mine "
    },
    {
        "content": "* Kinross announces vend-in of Yukon property to create White Gold Corp strategic alliance",
        "date": "05182017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Kinross announces vend-in of Yukon property to White Gold Corp "
    },
    {
        "content": "* Says again on track to meet our annual guidance for production and costs.",
        "date": "05022017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Kinross reports Q1 adjusted EPS $0.02 "
    },
    {
        "content": "* Has reached an agreement with Goldcorp Inc to form a new partnership at cerro casale project in Chile",
        "date": "03282017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Barrick Gold to form new partnership with Goldcorp "
    },
    {
        "content": "* Kinross Gold Corp - deal consideration includes $260 million in cash  payable at closing",
        "date": "03282017",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "BRIEF-Kinross announces sale of Cerro Casale interest "
    },
    {
        "content": "* ON CLOSING OF TRANSACTION  KINROSS WILL HOLD ABOUT 9.5% OF CO'S ISSUED  OUTSTANDING COMMON SHARES ON AN UNDILUTED BASIS",
        "date": "03222017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-BONTERRA ANNOUNCES STRATEGIC INVESTMENT BY KINROSS GOLD "
    },
    {
        "content": "* Entered into option to Joint Venture Agreement with an affiliate of Kinross Gold Corp concerning Liberty Bell project in Alaska",
        "date": "03022017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Millrock and Kinross to Explore Liberty Bell Gold project "
    },
    {
        "content": "* Kinross provides update on organic development projects and exploration",
        "date": "02152017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Kinross provides update on organic development projects and exploration "
    },
    {
        "content": "* Q4 production of 746 291 gold equivalent ounces compared with 623 716 gold equivalent ounces last year",
        "date": "02152017",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "BRIEF-Kinross Gold reports \u007f\u007fQ4 adjusted loss per share $0.04 "
    },
    {
        "content": "* Orca Gold acquires exploration assets in the Côte D'ivoire from Kinross",
        "date": "02012017",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Orca Gold acquires exploration assets in the Côte D'ivoire from Kinross "
    },
    {
        "content": "* Kinross Gold Corp - tracking towards lower half of its 2016 guidance range for production (2.7 - 2.9 million AU eq. Oz.)",
        "date": "11022016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Kinross posts Q3 adj. earnings $0.10 per share "
    },
    {
        "content": "Kinross Gold Corp  reported better-than-expected third-quarter earnings on the back of a stronger gold price and slightly higher production.",
        "date": "11022016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Kinross Gold third quarter earnings beat market expectations  cuts capex "
    },
    {
        "content": "Nov 2 Kinross Gold Corp reported better-than-expected third-quarter earnings on the back of a stronger gold price and slightly higher production.",
        "date": "11022016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "UPDATE 1-Kinross Gold Q3 earnings beat market expectations  cuts capex "
    },
    {
        "content": "Nov 2 Kinross Gold Corp  the world's fifth-biggest gold miner  returned to a third-quarter profit on Wednesday helped by a stronger gold price and slightly higher production.",
        "date": "11022016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Kinross Gold reports third-quarter profit versus loss a year ago "
    },
    {
        "content": "* Premier Gold Mines Ltd - to acquire exploration projects in Nevada and Mexico",
        "date": "10262016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Premier signs acquisition deals with Goldcorp and Kinross USA "
    },
    {
        "content": "* Yorbeau and Kinross sign definitive option agreement for the Rouyn property",
        "date": "10252016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Yorbeau Resources  Kinross Gold agree deal for Rouyn property "
    },
    {
        "content": "* Press release - Nighthawk announces strategic investment by kinross gold",
        "date": "10132016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Nighthawk plans to complete a $10.1 million non-brokered private placement "
    },
    {
        "content": "* Has agreed to a new three-year collective labour agreement (CLA) with unionized employees at its Tasiast mine in Mauritania",
        "date": "10042016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-kinross announces new collective labour agreement at Tasiast "
    },
    {
        "content": "* Lundin Gold announces sale of a portion of Kinross interest  Source text for Eikon:  Further company coverage:",
        "date": "09262016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Lundin Gold announces sale of a portion of Kinross interest "
    },
    {
        "content": "* GMP has agreed to purchase  for re-sale on a private placement basis  5 500 000 common shares of lundin gold inc.",
        "date": "09262016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "BRIEF-Press release - kinross sells portion of lundin gold shares "
    },
    {
        "content": "* Co is currently in discussions with Kinross regarding processing of Bonaparte bulk sample ore at their Kettle River mill facility  Source text for Eikon:  Further company coverage:",
        "date": "09202016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-WestKam discussions with Kinross Gold moving ahead "
    },
    {
        "content": "Aug 25 Canadian miner Kinross Gold Corp  said it has suspended operations at its Maricunga gold mine in Chile  and will lay off 300 employees after a judicial decision upheld a regulator's move to shut down the water system linked to the mine.",
        "date": "08252016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Kinross suspends operations at Chile mine  lays off 300 workers "
    },
    {
        "content": "TORONTO/SANTIAGO Canada's Kinross Gold Corp is looking to retreat from Chile and has put its main assets in that country up for sale  according to people familiar with the process.",
        "date": "08182016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Exclusive: Kinross to retreat from Chile  puts unit on the block "
    },
    {
        "content": "* Says Lauren Roberts has been appointed new COO  effective January 1  2017",
        "date": "08172016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Kinross Gold announces senior management changes "
    },
    {
        "content": "* Kinross Gold Corp has received unsolicited expressions of interest for its Maricunga gold mine in Chile  says CEO",
        "date": "07282016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "UPDATE 1-Kinross gets Maricunga \"expressions of interest\"-CEO "
    },
    {
        "content": "* Kinross Gold Corp has received unsolicited expressions of interest for its Maricunga gold mine in Chile  says CEO",
        "date": "07282016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "BRIEF-Kinross gets offers for Maricunga  made no decision-CEO "
    },
    {
        "content": "Kinross Gold Corp said on Wednesday it expected to suspend operations at a Chilean gold mine in the fourth quarter as it posted a second-quarter loss that exceeded forecasts.",
        "date": "07272016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Kinross Gold expects to suspend Chilean mine in fourth quarter "
    },
    {
        "content": "July 27 Kinross Gold Corp said on Wednesday it expected to suspend operations at a Chilean gold mine in the fourth quarter as it posted a second-quarter loss that exceeded forecasts.",
        "date": "07272016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "UPDATE 2-Kinross Gold expects to suspend Chilean mine in 4th qtr "
    },
    {
        "content": "* Qtrly production was 671 267 gold equivalent ounces (au eq. oz.)  compared with 660 898 au eq. oz. in Q2 2015",
        "date": "07272016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "BRIEF-Kinross Gold Q2 adjusted loss per share $0.01 "
    },
    {
        "content": "July 27 Kinross Gold Corp reported a slightly narrower second-quarter loss on Wednesday as production rose and costs fell at the world's fifth-biggest gold miner.",
        "date": "07272016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Kinross Gold reports narrower loss as output rises  costs fall "
    },
    {
        "content": "NOUAKCHOTT  June 19 Canada's Kinross Gold Corp  has suspended activity at its Tasiast mine in Mauritania after the West African country ordered expatriates whose work permits were invalid to stop working  a company source said.",
        "date": "06192016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Canada's Kinross suspends work at Mauritania gold mine "
    },
    {
        "content": "June 13 Kinross Gold Corp  said on Monday a nearly three-week strike by unionized workers at its Tasiast mine in Mauritania ended on Saturday.",
        "date": "06132016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Kinross says three-week strike ends at Mauritania goldmine "
    },
    {
        "content": "May 24 The processing facility remains in operation at Kinross Gold Corp's Tasiast mine in Mauritania  a spokesman for the miner said on Tuesday after workers at the site went on strike.",
        "date": "05242016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "CORRECTED-Kinross continues processing at strike-hit Mauritania gold mine "
    },
    {
        "content": "New Mexico sued the U.S. Environmental Protection Agency  an agency contractor and two mining companies on Monday over the 2015 breach of an abandoned Colorado gold mine that spilled some 3 million gallons of toxic wastewater into three states.",
        "date": "05232016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "New Mexico sues EPA  mine owners over massive gold mine waste spill "
    },
    {
        "content": "May 23 New Mexico sued the U.S. Environmental Protection Agency  an agency contractor and two mining companies on Monday over the 2015 breach of an abandoned Colorado gold mine that spilled some 3 million gallons of toxic wastewater into three states.",
        "date": "05232016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "UPDATE 1-New Mexico sues EPA  mine owners over massive gold mine waste spill "
    },
    {
        "content": "Kinross Gold Corp  reported lower-than-expected quarterly revenue as the world's fifth biggest gold miner struggled with lower realized gold prices.",
        "date": "05102016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Kinross Gold revenue misses on lower realized gold prices "
    },
    {
        "content": "May 10 Kinross Gold Corp reported lower-than-expected quarterly revenue as the world's fifth biggest gold miner struggled with lower realized gold prices.",
        "date": "05102016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "UPDATE 1-Kinross Gold revenue misses on lower realized gold prices "
    },
    {
        "content": "* Expects to be within its 2016 forecast guidance for production cost of sales and all-in sustaining cost",
        "date": "05102016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "BRIEF-Kinross Gold reports Q1 loss of $0.01 per share "
    },
    {
        "content": "May 10 Kinross Gold Corp reported a bigger quarterly loss on Tuesday as higher production costs hurt the world's fifth biggest gold miner.",
        "date": "05102016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Kinross Gold reports bigger loss as costs rise "
    },
    {
        "content": "March 30 Kinross Gold Corp said on Wednesday it plans to go ahead  with a $300 million  first-phase expansion of its Tasiast gold mine in North Africa that will nearly double the mine's production and slash its production costs.",
        "date": "03302016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "UPDATE 2-Kinross okays first-phase expansion of North Africa mine "
    },
    {
        "content": "March 30 Kinross Gold Corp   estimated it would have to spend $920 million on a two-phase expansion of its Tasiast mine in Mauritania in North Africa  lower than it had earlier estimated.",
        "date": "03302016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "CORRECTED-UPDATE 1-Kinross estimates $920 mln spending for N. Africa mine expansion "
    },
    {
        "content": "* Phase one is expected to increase mill throughput capacity from current 8 000 t/d to 12 000 t/d",
        "date": "03302016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "BRIEF-Kinross gold to proceed with phase 1 of Tasiast expansion "
    },
    {
        "content": "March 30 Kinross Gold Corp  said it would spend $300 million on the first phase of expansion at its Tasiast mine in Mauritania in North Africa.",
        "date": "03302016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Kinross to spend $300 mln on N. Africa mine expansion "
    },
    {
        "content": "* Kinross responds to recent SMA notification regarding the Maricunga Mine",
        "date": "03212016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-kinross responds to recent SMA notification regarding the Maricunga Mine "
    },
    {
        "content": "SANTIAGO  March 20 The Chilean government has shut down the water system attached to the Maricunga mine operated by Canadian company Kinross Gold  citing environmental damages  the SMA regulator said in a statement.",
        "date": "03202016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Chile regulator shuts down Kinross mine water installation "
    },
    {
        "content": "* Elected to exercise their option in full to purchase an additional 12 510 000 common shares at a price of us$3.00 per share",
        "date": "03162016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "BRIEF-Kinross gold corp to exercise over-allotment option "
    },
    {
        "content": "TORONTO Kinross Gold Corp   squeezed by slumping prices and production declines  expects to shake off a money-losing 2015 with record output and lower costs this year  the world's fifth-largest producer by output said on Wednesday.",
        "date": "02102016",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Gold miner Kinross forecasts brighter 2016 production  costs "
    },
    {
        "content": "TORONTO  Feb 10 Kinross Gold Corp  squeezed by slumping prices and production declines  expects to shake off a money-losing 2015 with record output and lower costs this year  the world's fifth-largest producer by output said on Wednesday.",
        "date": "02102016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "UPDATE 2-Gold miner Kinross forecasts brighter 2016 production  costs "
    },
    {
        "content": "TORONTO  Feb 10 Kinross Gold Corp  reported a bigger quarterly loss on Wednesday  as lower production and an ongoing slump in prices for the precious metal hurt the world's fifth-biggest producer by output.",
        "date": "02102016",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Miner Kinross reports bigger loss as production and prices drop "
    },
    {
        "content": "TORONTO  Nov 12 Barrick Gold Corp said on Thursday it will sell its stake in four non-core assets in Nevada for $720 million  putting the Canadian mining firmly on track to meet its 2015 debt-reduction target amid a multi-year slump in gold prices.",
        "date": "11122015",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "UPDATE 3-Barrick raises $720 mln from sale of stakes in Nevada assets "
    },
    {
        "content": "TORONTO  Nov 12 Barrick Gold Corp said on Thursday it has agreed to sell its stakes in four non-core assets to two parties for a total of $720 million  as the world's largest gold producer works to trim  its debt load as gold prices have weakened.",
        "date": "11122015",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Barrick sells stakes in four assets for $720 million "
    },
    {
        "content": "Nov 10 Kinross Gold Corp revived on Tuesday the possibility of expanding its Mauritanian-based mine but in a \"bite-sized \" two-step expansion that the miner's chief executive said was less risky in today's depressed metal price environment.",
        "date": "11102015",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "UPDATE 2-Kinross Gold eyes 'bite-sized' expansion for Mauritania mine "
    },
    {
        "content": "Nov 10 Kinross Gold Corp slid to a deeper net loss in the third quarter on the back of lower margins due to a weaker gold price  results showed on Tuesday.",
        "date": "11102015",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Miner Kinross quarterly net loss deepens on lower gold price "
    },
    {
        "content": "Sept 17 Canadian miner Kinross Gold Corp  on Thursday lowered its full-year capital spending and overhead costs forecasts and raised the lower end of its production outlook.",
        "date": "09172015",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Kinross Gold cuts 2015 capex and cost forecast  trims output view "
    },
    {
        "content": "July 29 Kinross Gold Corp is again considering cutting jobs at its Tasiast gold mine in Mauritania  Chief Executive Officer Paul Rollinson said on Wednesday  as the Canadian miner looks for ways to reduce costs at its higher-cost mines amid sliding metals prices.",
        "date": "07292015",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "UPDATE 2-Kinross mulls more job cuts at Mauritania mine to reduce costs "
    },
    {
        "content": "July 29 Kinross Gold Corp slid to a loss in the second quarter on the back of a weaker gold price  lower gold sales and the temporary suspension of operations at a mine in Chile.",
        "date": "07292015",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Gold miner Kinross slides to second-quarter net loss "
    },
    {
        "content": "TORONTO  May 5 Kinross Gold is scouting for acquisition opportunities but vows it will be disciplined and only strike a deal if it offers value to shareholders  the Canadian gold miner's chief executive said on Tuesday.",
        "date": "05052015",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Kinross keen on M&A but will take a disciplined approach - CEO "
    },
    {
        "content": "* Sees 2015  production cost of sales $ 720-$780 per au eq. oz",
        "date": "05052015",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "BRIEF-Kinross Gold Q1 loss per share $0.01 "
    },
    {
        "content": "TORONTO/NEW YORK  March 26 Kinross Gold Corp  has agreed pay $33 million to settle a shareholder lawsuit that had accused the Canadian gold miner of defrauding investors through an ill-advised mine acquisition in  Mauritania that has resulted in over $6 billion in writedowns.",
        "date": "03272015",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Kinross settles shareholder lawsuit tied to Mauritania debacle "
    },
    {
        "content": "April 1 Kinross Gold Corp said on Wednesday its mining and crushing operations at its Maricunga mine in northern Chile remain suspended following severe floods in the region last week.",
        "date": "04012015",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "UPDATE 1-Kinross Gold says Chile mine operations still down after flooding "
    },
    {
        "content": "April 1 Kinross Gold Corp said on Wednesday its mining and crushing operations at its Maricunga mine in northern Chile remain suspended following severe floods in the region last week.",
        "date": "04012015",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Kinross Gold says Chile mine operations still down after flooding "
    },
    {
        "content": "Kinross Gold Corp  will not go ahead with a $1.6 billion expansion of its Tasiast mine in Africa's northwest because of the weak gold price  the Toronto-based miner said on Tuesday  as it also reported an unexpected fourth-quarter loss.",
        "date": "02102015",
        "name": "Kinross Gold Corporation",
        "news_type": "topStory",
        "symbol": "KGC",
        "title": "Kinross decides not to expand Tasiast gold mine in Africa "
    },
    {
        "content": "Feb 10 Kinross Gold Corp will not go ahead with a $1.6 billion expansion of its Tasiast mine in Africa's northwest because of the weak gold price  the Toronto-based miner said on Tuesday  as it also reported an unexpected fourth-quarter loss.",
        "date": "02102015",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "UPDATE 2-Kinross decides not to expand Tasiast gold mine in Africa "
    },
    {
        "content": "* Q4 revenue $791.3 million versus $877.1 million last year; Q4 adjusted loss per share $0.01; Q4 loss per share $1.26",
        "date": "02102015",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "BRIEF-Kinross Gold reports Q4 adjusted loss per share $0.01 "
    },
    {
        "content": "Feb 10 Kinross Gold Corp reported a wider fourth-quarter loss on Tuesday as it took an impairment charge of more than $900 million against goodwill  property  plant and equipment.",
        "date": "02102015",
        "name": "Kinross Gold Corporation",
        "news_type": "normal",
        "symbol": "KGC",
        "title": "Kinross Gold loss widens  won't proceed with Tasiast expansion for now "
    }
]