[
    {
        "content": "* ‍FourKites says Kraft Heinz Co has selected ‍FourKites to provide real-time freight tracking and monitoring across its supply chain​ Source text for Eikon: Further company coverage:",
        "date": "11152017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz Co selects ‍FourKites to provide real-time freight tracking and monitoring across its supply chain​ "
    },
    {
        "content": "Nov 6 Kraft Heinz Co said on Monday it restated its cash flow statements for two quarters after it found that it implemented a new accounting standard since the start of 2017  instead of from 2018.",
        "date": "11062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz restates cash flow statements for two quarters "
    },
    {
        "content": "* Kraft Heinz - audit committee concluded that financial statements included in form 10-Q for qtrs ended april 1 & july 1  should not be relied upon​",
        "date": "11062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz says audit committee concluded that financial statements included in form 10-Q should not be relied upon​ "
    },
    {
        "content": "* ‍ACQUISITION OF OUTSTANDING 50.1% IN ITS JOINT VENTURE  FROM HEINZ FOODS SA PROPRIETARY LIMITED  A SUBSIDIARY OF KRAFT HEINZ COMPANY.​",
        "date": "11062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Pioneer Foods says to acquire full ownership of Heinz Foods SA​ "
    },
    {
        "content": "Kraft Heinz Co  marginally missed Wall Street sales estimates in the third quarter and warned it would be hampered in the fourth by many U.S. consumers working through emergency hurricane stores of its tinned goods.",
        "date": "11012017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Kraft Heinz misses sales estimates as U.S. demand weakens "
    },
    {
        "content": "Nov 1 Kraft Heinz Co marginally missed Wall Street sales estimates in the third quarter and warned it would be hampered in the fourth by many U.S. consumers working through emergency hurricane stores of its tinned goods.",
        "date": "11012017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Kraft Heinz misses sales estimates as U.S. demand weakens "
    },
    {
        "content": "* Q3 earnings per share view $0.82 -- Thomson Reuters I/B/E/S",
        "date": "11012017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz Co reports Q3 earnings per share $0.77 "
    },
    {
        "content": "Nov 1 Kraft Heinz Co reported a 12 percent rise in quarterly profit on Wednesday as it continued to rein in costs and sales rose outside the United States.",
        "date": "11012017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz profit rises 12 pct as costs fall "
    },
    {
        "content": "* The Kraft Heinz Company declares regular quarterly dividend of $0.625 per share Source text for Eikon: Further company coverage:",
        "date": "11012017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz declares of $0.625 per share "
    },
    {
        "content": "* Kraft Heinz expands animal welfare commitments to include higher standards of well-being for broiler chickens",
        "date": "10272017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz expands animal welfare commitments "
    },
    {
        "content": "* Kraft Heinz sells its Madison  Wis.  facility to Reich Brothers Holdings  LLC Source text for Eikon: Further company coverage:",
        "date": "10182017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz sells its Madison  Wis.  facility to Reich Brothers Holdings  LLC "
    },
    {
        "content": "* Says unit selling some food  instant coffee operations to Kraft Heinz for 26 billion yen ($230 million) Further company coverage: ($1 = 112.9800 yen) (Reporting By Chris Gallagher)",
        "date": "10192017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Suntory Beverage says unit selling some food  instant coffee operations to Kraft Heinz for 26 bln yen "
    },
    {
        "content": "LONDON Unilever   reported disappointing third-quarter sales having lost market share to smaller rivals  dampening hopes that a failed takeover bid by Kraft Heinz  would spark a swift improvement in performance. | Video ",
        "date": "10192017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever sales fall short as competition bites big brands "
    },
    {
        "content": "* Bids for spreads business due on Thursday - sources (Adds CFO comments  background  link to Breakingviews column)",
        "date": "10192017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 3-Unilever sales fall short as competition bites big brands "
    },
    {
        "content": "Senate Republicans are poised to approve a measure that would help pass Trump’s tax reforms  a special report lifts the lid on a backroom battle threatening a $230 million cryptocurrency venture and thirty years on from the 1987 stock market crash  cautious traders wonder if it could happen again.",
        "date": "10192017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Thursday Morning Briefing "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Unilever’s struggle gives hope to predators. The consumer giant that fended off a bid from Kraft Heinz earlier this year reported weak third-quarter sales on Thursday. Chief Executive Paul Polman is sprucing up brands  but the more pedestrian Unilever’s performance  the more vulnerable it becomes.",
        "date": "10192017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Breakingviews - Unilever struggle gives hope to predators "
    },
    {
        "content": "China's Q3 economic growth slows as expected  property measures bite",
        "date": "10192017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Reuters Business News Schedule at 0830 GMT/430AM ET "
    },
    {
        "content": "* Kraft Heinz - ‍appointment of Paulo Basili currently executive vice president and chief financial officer  as zone president of United States business​",
        "date": "09082017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz announces management changes "
    },
    {
        "content": "Sept 8 Heinz ketchup maker Kraft Heinz Co said on Friday 3G Capital partner David Knopf would replace Paulo Basilio as its chief financial officer  starting in October.",
        "date": "09082017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz names 3G Capital partner David Knopf as CFO "
    },
    {
        "content": "* Hit by consumer goods squeeze  weak U.S. (Adds reaction  details)",
        "date": "08232017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 4-WPP suffers worst day since 1998 after consumer goods groups cut spending "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 22 (Fitch) Fitch Ratings has affirmed The Kraft Heinz Company's (Kraft Heinz  or KHC) Long-Term Issuer Default Rating (IDR) at 'BBB-' and Short-Term IDR at 'F3'. The Rating Outlook is Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS Mature Markets Limit Organic Business Growth: Kraft Heinz generated $26 billion annual revenue in 2016. Its portfolio includes eight $1 billion-plu",
        "date": "08222017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Fitch Affirms The Kraft Heinz Company's IDR at 'BBB-'; Outlook Stable "
    },
    {
        "content": "Aug 20 Warren Buffett takes pride in naming his price to buy a company  and not paying a nickel more.",
        "date": "08202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Bankruptcy fight over Oncor to test Warren Buffett's discipline "
    },
    {
        "content": "* Soros Fund Management LLC dissolves share stake in Alphabet Inc class A shares   ‍​",
        "date": "08142017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Soros Fund Management LLC dissolves share stake in Alphabet  Amgen  American Airlines ‍​ "
    },
    {
        "content": "Aug 14 Activist hedge fund Corvex Management owns shares in French food group Danone SA worth about $400 million  viewing the world's largest yogurt maker as significantly undervalued  Bloomberg reported late on Monday  citing people familiar with the matter.",
        "date": "08142017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 1-Activist fund Corvex has $400 mln stake in Danone -Bloomberg "
    },
    {
        "content": "* Kraft Heinz Co - ‍issued $350 million aggregate principal amount of floating rate senior notes due 2019​ - sec filing",
        "date": "08102017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz ‍issues $350 mln aggregate principal amount of floating rate senior notes "
    },
    {
        "content": "* Kraft Heinz and Oprah Winfrey collaborate to create O  That's Good!",
        "date": "08092017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz and Oprah Winfrey collaborate to create O  That's Good! "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 08 (Fitch) Fitch Ratings has assigned 'BBB-' ratings to The Kraft Heinz Company's (Kraft Heinz) $1.5 billion senior unsecured floating notes. Three tranches were issued: a $350 million 2-year floating rate note tranche maturing in August 2019  a $650 million 3.5-year floating rate note tranche maturing in February 2021  and a $500 million 5-year floating rate note tranche maturing in August 2022. Proceeds from the transa",
        "date": "08082017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Fitch Rates The Kraft Heinz Company's $1.5B Sr Unsecured Notes 'BBB-'; Outlook Stable "
    },
    {
        "content": "* Berkshire says Berkshire Hathaway Energy to buy remaining 19.97% minority interest in Oncor through deals separate from agreement with Energy Future Holdings",
        "date": "08042017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Berkshire Hathaway says it had $27.3 bln stake in Wells Fargo as of June 30 "
    },
    {
        "content": "Kraft Heinz Co   the maker of Velveeta cheese  Heinz ketchup and Oscar Mayer meats  reported a bigger-than-expected quarterly profit on Thursday as the company continued to cut costs amid weak demand in North America.",
        "date": "08032017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Kraft Heinz's quarterly profit beat powered by cost cuts "
    },
    {
        "content": "Aug 3 Kraft Heinz Co  the maker of Velveeta cheese  Heinz ketchup and Oscar Mayer meats  reported a bigger-than-expected quarterly profit on Thursday as the company continued to cut costs amid weak demand in North America.",
        "date": "08032017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Kraft Heinz's quarterly profit beat powered by cost cuts "
    },
    {
        "content": "* Kraft Heinz Co - ‍ q2 net sales decreased 1.7%; organic net salesdecreased 0.9% pct",
        "date": "08032017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz Q2 adjusted earnings per share $0.98 "
    },
    {
        "content": "* The Kraft Heinz Company announces increase to quarterly dividend",
        "date": "08032017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-The Kraft Heinz Company increases quarterly dividend "
    },
    {
        "content": "Aug 3 Kraft Heinz Co reported a 50.5 percent rise in quarterly profit on Thursday  as the company managed to wring out more costs and demand rose for its sauces and condiment products.",
        "date": "08032017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz posts 50.5 pct rise in quarterly profit "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Unilever is half way there on its Kraft Heinz challenge. The Anglo-Dutch owner of Dove soap and Ben & Jerry’s ice cream cut costs faster than expected in the first half of the year by reducing ad spend and paying its suppliers less. Its 20 percent operating margin target looks reachable. Yet with U.S. rival Kraft Heinz free to go hostile next month  volume growth remains too low for comfort.",
        "date": "07202017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Unilever is half way there on Kraft challenge "
    },
    {
        "content": "* Kraft Heinz signs agreement with Upstate Niagara Cooperative to sell its Campbell  N.Y. facility",
        "date": "06302017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz signs agreement with Upstate Niagara Cooperative to sell its Campbell Facility "
    },
    {
        "content": "* Nestle to repurchase up to $20.8 billion in shares by June 2020",
        "date": "06272017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 3-Nestle plans $20.8 bln share buyback amid Third Point pressure "
    },
    {
        "content": "PARIS Emmanuel Faber  CEO of Danone  wants the world's biggest yogurt maker to play a central role in the revolution sweeping the global food industry as it tries to respond to a consumer shift towards healthy eating.",
        "date": "06222017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Danone looks to ride healthy food revolution wave "
    },
    {
        "content": "LONDON Nestle  may sell its roughly $900 million-a-year U.S. confectionery business  which includes Butterfinger and BabyRuth  in the Swiss food group's latest effort to improve the health profile of its sprawling portfolio.",
        "date": "06152017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Nestle may sell U.S. confectionery business "
    },
    {
        "content": "* Business makes up 1 pct of Nestle sales (Adds analyst comment  background)",
        "date": "06152017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Nestle may sell U.S. confectionery business "
    },
    {
        "content": "* Time inc - Kraft Heinz Foods Company's Cracker Barrel Macaroni & Cheese has signed on as initial launch advertiser of well done Source text for Eikon: Further company coverage:",
        "date": "05152017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Time Inc's video social brand announces Kraft Heinz as launch advertiser "
    },
    {
        "content": "May 8 Warren Buffett said on Monday that United Airlines made a \"terrible mistake\" in handling the fallout after a man was forcibly dragged off a United flight  a bloody confrontation that sparked global outrage.",
        "date": "05082017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Buffett: United made 'terrible mistake' with dragged passenger-CNBC "
    },
    {
        "content": "May 8 Warren Buffett said on Monday 3G Capital  its controversial partner on multiple transactions  follows a \"standard capitalist formula\" when it sweeps away thousands of jobs and imposes deep expense cuts to make the companies it buys more efficient.",
        "date": "05082017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Buffett says deal partner 3G follows 'standard capitalist formula'-CNBC "
    },
    {
        "content": "OMAHA  Neb.  May 6 Warren Buffett  the chairman of Berkshire Hathaway Inc  on Saturday faulted Wells Fargo & Co for failing to stop employees from signing up customers for bogus accounts even after learning it was happening  causing a scandal.",
        "date": "05062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 1-Buffett assails Wells Fargo  defends 3G at wide-ranging meeting "
    },
    {
        "content": "OMAHA  Neb. Warren Buffett  the chairman of Berkshire Hathaway Inc   on Saturday criticized Wells Fargo & Co  for failing to stop employees from signing up customers for bogus accounts even after learning it was happening  causing a scandal. | Video ",
        "date": "05072017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Buffett assails Wells Fargo  defends 3G at wide-ranging meeting "
    },
    {
        "content": "The story on Kraft Heinz cutting 5 150 jobs and closing six factories are withdrawn as the news was previously announced.",
        "date": "05042017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "ADVISORY - Story on Kraft Heinz cutting jobs  closing factories withdrawn "
    },
    {
        "content": "DALLAS (Reuters Breakingviews) - Warren Buffett respects his elders. During Berkshire Hathaway's  annual shareholder bash in Omaha on Saturday  the 86-year-old Oracle sang the praises of – and delivered early 88th birthday wishes to – Jack Bogle  the Vanguard founder who pioneered low-fee index mutual funds. While the sentiment is undoubtedly genuine  it is also starting to sound a bit self-serving.",
        "date": "05072017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Buffett's praise of Jack Bogle sounds self-serving "
    },
    {
        "content": "LONDON  May 4 Banks are putting together around €4bn-equivalent of debt financing to back a potential sale of Anglo-Dutch consumer group Unilever’s margarine and spreads business  banking source said.",
        "date": "05042017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "LPC-Banks line up €4bn debt for Unilever spreads sale "
    },
    {
        "content": "* Kraft heinz co - oscar mayer hot dog now has no by-products  no added nitrates or nitrites and no artificial preservatives in their meat Source text for Eikon: Further company coverage:",
        "date": "05012017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz says Oscar Mayer hot dog now has no by-products "
    },
    {
        "content": "May 4 Kraft Heinz Co said on Thursday it would cut about 13 percent of its workforce  close factories and consolidate its distribution network as part of its efforts to merge Kraft Foods and H.J. Heinz.",
        "date": "05042017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz to cut jobs  shutter factories under integration plan "
    },
    {
        "content": "Kraft Heinz Co   North America's No. 3 food and beverage company  reported lower-than-expected quarterly profit and sales  due to weak demand for its Velveeta cheese  Planters nuts and Oscar Mayer meats brands in the United States and Canada.",
        "date": "05032017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Kraft Heinz's profit  sales miss on weak North America demand "
    },
    {
        "content": "* Kraft Heinz says it anticipates capital expenditures of about $1.3 billion related to the integration program",
        "date": "05042017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz sees capex of about $1.3 bln related to the integration program "
    },
    {
        "content": "May 3 Kraft Heinz Co  North America's No. 3 food and beverage company  reported lower-than-expected quarterly profit and sales  due to weak demand for its Velveeta cheese  Planters nuts and Oscar Mayer meats brands in the United States and Canada.",
        "date": "05032017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Kraft Heinz's profit  sales miss on weak North America demand "
    },
    {
        "content": "* Kraft Heinz Co - Kraft Heinz Company declares regular quarterly dividend of $0.60 per share Source text for Eikon: Further company coverage:",
        "date": "05032017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz Co declares regular quarterly dividend of $0.60 per share "
    },
    {
        "content": "* Q1 earnings per share view $0.86 -- Thomson Reuters I/B/E/S",
        "date": "05032017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz Q1 adjusted earnings per share $0.84 "
    },
    {
        "content": "May 3 Kraft Heinz Co  North America's third-largest food and beverage company  reported a 3.1 percent fall in quarterly profit on Wednesday  hurt by a strong dollar and weak demand in the United States and Canada.",
        "date": "05032017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz's quarterly profit drops 3.1 pct "
    },
    {
        "content": "May 3 As the United States adapts to the presidency of Donald Trump and faces rising tensions abroad  Berkshire Hathaway Inc shareholders will descend on Omaha  Nebraska this weekend seeking reassurance  from Warren Buffett.",
        "date": "05032017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "RPT-Buffett to face big crowd as Berkshire grows bigger "
    },
    {
        "content": "May 3 As the United States adapts to the presidency of Donald Trump and faces rising tensions abroad  Berkshire Hathaway Inc shareholders will descend on Omaha  Nebraska this weekend seeking reassurance  from Warren Buffett.",
        "date": "05032017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Buffett to face big crowd as Berkshire grows bigger "
    },
    {
        "content": "* Shares up 1.5 percent (Adds comments  share activity  background  bullet points)",
        "date": "04202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Sales beat boosts Unilever's argument to go it alone "
    },
    {
        "content": "* Abertis up as market weighs Atlantia's takeover plan (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon - see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "04202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever  Man Group strength boosts European stocks "
    },
    {
        "content": "LONDON  April 20 Consumer goods maker Unilever reported better than expected first-quarter sales on Thursday  helped by pricing growth.",
        "date": "04202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever first-quarter sales top expectations "
    },
    {
        "content": "LONDON  April 13 Anglo-Dutch consumer group Unilever has decided to work with Morgan Stanley and Goldman Sachs on the sale of its margarine and spreads business  which was announced last week  sources told Reuters on Thursday.",
        "date": "04132017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever picks Morgan Stanley and Goldman to sell spreads business- sources "
    },
    {
        "content": "LONDON Unilever   promised shareholders a multi-billion euro rewards package on Thursday after February's $143 billion takeover offer from Kraft Heinz  jolted it into a corporate makeover aimed at proving it can go it alone. | Video ",
        "date": "04062017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Galvanized by Kraft  Unilever keeps shareholders sweet with cash "
    },
    {
        "content": "April 6 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Thursday:",
        "date": "04062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Combining foods/refreshment businesses into one organization (Adds comments  background)",
        "date": "04062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 5-Galvanised by Kraft  Unilever keeps shareholders sweet with cash "
    },
    {
        "content": "* Shares off lows as commodity stocks recover (Adds details  updates prices)",
        "date": "04062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "European shares fall as banks hit by cooling rate hike expectations "
    },
    {
        "content": "April 6 Britain's FTSE 100 index is seen opening down 67 points at 7 264 on Thursday  according to financial bookmakers  with futures down 0.7 percent ahead of the cash market open.",
        "date": "04062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 1-UK Stocks-Factors to watch on April 6 "
    },
    {
        "content": "LONDON  April 6 Unilever  said on Thursday it will exit its shrinking spreads business  increase its margin targets  raise its dividend and review its dual-headed legal structure  as it aims to prove it can deliver near-term growth on its own  following its swift rejection in February of a takeover proposal by Kraft Heinz.",
        "date": "04062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever announces results of business review "
    },
    {
        "content": "* Decision to eliminate about 200 salaried positions across few additional functions in U.S. and Canada out of 41 000 global employees",
        "date": "03242017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz to reduce about 200 salaried positions in U.S. and Canada "
    },
    {
        "content": "LONDON  March 18 Unilever  is preparing a 6 billion pound ($7.44 billion) sale of some of its food brands  British newspapers reported on Saturday  without citing sources.",
        "date": "03182017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever prepares 6 bln stg sale of food brands - newspapers "
    },
    {
        "content": "LONDON A boom in European deal-making activity -- a sign better growth prospects are boosting confidence in European corporate boardrooms -- is helping support stock market valuations which  on some measures  appear stretched.",
        "date": "03172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "'Sweet spot' in European M&A puts floor under valuations "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - For fans of explicitly ethical stakeholder capitalism  Unilever’s rebuttal of a takeover approach by Kraft Heinz last month was a great moment. On one side  a company that made a big deal about thinking long term and creating good products as well as profit for shareholders. On the other  a business run by some of the harshest corporate cost-cutters around. With little more than a few phone calls  the Anglo-Dutch consumer product giant saw off the much smaller co",
        "date": "03222017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Hadas: The stakeholder revolution has been delayed "
    },
    {
        "content": "NEW YORK  March 15 A former H.J. Heinz Co director's security guard was charged on Wednesday with insider trading in the ketchup maker's stock and options before Heinz was bought in 2013 by Brazil's 3G Capital and Warren Buffett's Berkshire Hathaway Inc.",
        "date": "03152017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "U.S. SEC accuses Heinz guard of insider trading before Berkshire-3G deal "
    },
    {
        "content": "* Corporate confidence returning  environment for M&A in \"sweet spot\"\": Goldman",
        "date": "03172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "INVESTMENT FOCUS-'Sweet spot' in European M&A puts floor under valuations "
    },
    {
        "content": "LONDON  March 15 Unilever  is considering returning cash to shareholders  making medium-sized acquisitions and more aggressive cost cuts as part of its business review  the Financial Times reported.",
        "date": "03152017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever review covers costs  deals  balance sheet -FT "
    },
    {
        "content": "March 15 Britain's FTSE 100 index is seen opening up 13 points on Wednesday  according to financial bookmakers  with futures up 0.1 percent ahead of the cash market open.",
        "date": "03152017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-UK Stocks-Factors to watch on March 15 "
    },
    {
        "content": "    March 15 Britain's FTSE 100 index is seen opening up 13 points on Wednesday  according to financial bookmakers.             * ASTRAZENECA: AstraZeneca's ovarian cancer drug Lynparza slashed the risk of disease progression in a closely watched clinical trial  boosting its profile against rivals within the novel PARP inhibitor drug class.      * BHP BILLITON: The Escondida copper mine in Chile plans to restart operations after striking workers again rejected an invitation by contro",
        "date": "03152017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UK Stocks-Factors to watch on March 15 "
    },
    {
        "content": "LONDON Fresh from defending Unilever  against an unsolicited $143 billion takeover attempt by Kraft Heinz   CEO Paul Polman said the British government should ensure a level playing field for target companies.",
        "date": "03142017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Unilever CEO urges UK to provide 'level playing field' after Kraft bid "
    },
    {
        "content": "LONDON  March 14 Fresh from defending Unilever  against an unsolicited $143 billion takeover attempt by Kraft Heinz  CEO Paul Polman said the British government should ensure a level playing field for target companies.",
        "date": "03142017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Unilever CEO urges UK to provide 'level playing field' after Kraft bid "
    },
    {
        "content": "LONDON  March 14 Unilever CEO Paul Polman said there should be a level playing field for companies facing takeover bids such as Kraft Heinz's failed $143 billion attempt to buy the Anglo-Dutch company  the FT reported on Tuesday.",
        "date": "03142017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever CEO calls for 'level playing field' after Kraft's failed $143 bln bid - FT "
    },
    {
        "content": "NEW YORK  Feb 27 Billionaire investor Warren Buffett told CNBC on Monday his conglomerate Berkshire Hathaway Inc had more than doubled its stake in Apple Inc.  since the end of 2016  making it one of Berkshire's biggest equity holdings  and that U.S. stocks overall were not in \"bubble territory.\"",
        "date": "03062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "RPT-UPDATE 5-Buffett's Berkshire more than doubled its stake in Apple -CNBC "
    },
    {
        "content": "NEW YORK  Feb 27 Warren Buffett  chairman and chief executive of Berkshire Hathaway Inc  told CNBC on Monday that his conglomerate had purchased \"70 million plus\" shares of Apple Inc in 2017 and that U.S. stocks were not in \"bubble territory.\"",
        "date": "03062017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "CORRECTED-(OFFICIAL)-Buffett says Berkshire owns 133 mln shares of Apple -CNBC "
    },
    {
        "content": "March 1 Britain's FTSE 100 index is seen opening up 23.1 points on Wednesday  according to financial bookmakers  with futures up 0.1 percent ahead of the cash market open.",
        "date": "03012017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-UK Stocks-Factors to watch on March 1 "
    },
    {
        "content": "LONDON Unilever   is proposing changes to how it pays executives and directors in order to make them think more like owners of the business  less than two weeks after seeing off a $143 billion takeover pursuit by U.S. rival Kraft Heinz .",
        "date": "02282017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Unilever seeks changes to pay to give managers owner's mindset "
    },
    {
        "content": "NEW YORK  Feb 27 Billionaire investor Warren Buffett told CNBC on Monday his conglomerate Berkshire Hathaway Inc had more than doubled its stake in Apple Inc.  since the end of 2016  making it one of Berkshire's biggest equity holdings  and that U.S. stocks overall were not in \"bubble territory.\"",
        "date": "02272017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 5-Buffett's Berkshire more than doubled its stake in Apple -CNBC "
    },
    {
        "content": "    March 1 Britain's FTSE 100 index is seen opening up 23.1 points on Wednesday  according to financial bookmakers.          * The UK blue chip index closed 0.1 percent higher at 7263.44 on Tuesday  as gains by GKN Plc and Pearson Plc outweighed losses from basic resources stocks.     * UNILEVER: Unilever is proposing changes to how it pays executives and directors in order to make them think more like owners of the business  less than two weeks after seeing off a $143 billion takeo",
        "date": "03012017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UK Stocks-Factors to watch on March 1 "
    },
    {
        "content": "* Incentive plan to adopt longer-term horizon   (Adds more details  background; changes headline)",
        "date": "02282017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Unilever seeks changes to pay to give managers owner's mindset "
    },
    {
        "content": "LONDON  Feb 28 Unilever  on Tuesday proposed changes to how it pays executive directors that it says are meant to ensure alignment with long-term shareholder value creation.",
        "date": "02282017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever proposes changes to how directors are paid "
    },
    {
        "content": "LONDON  Feb 27 Britain's top share index closed slightly higher on Monday  helped by earnings updates and weak sterling  although motor insurers were hit by a regulatory change that could lead to higher payouts.",
        "date": "02272017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "FTSE ends higher on some positive earnings  insurers slip "
    },
    {
        "content": "Kraft Heinz's  bid has jolted Unilever  into focusing more on delivering on its strategy in the short-term  the Anglo-Dutch company's finance chief said on Friday.",
        "date": "02242017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Kraft's shock bid triggers Unilever focus on short-term value "
    },
    {
        "content": "LONDON  Feb 27 U.S. food company Kraft Heinz  is not targeting any other large deals for now after being snubbed by Unilever because valuations in the sector are too high  major shareholder Warren Buffett told CNBC news on Monday.",
        "date": "02272017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Buffett says no backup deal for Kraft after Unilever snub - CNBC "
    },
    {
        "content": "* Sees no strategic rationale to combine with Kraft   (Adds share price and valuation details)",
        "date": "02242017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Kraft's shock bid triggers Unilever focus on short-term value "
    },
    {
        "content": "LONDON  Feb 27 Britain's major share index was up on Monday  boosted by earnings updates and a weak sterling  while motor insurers were hit by a regulatory change which could lead to higher payouts  and merger disappointment weighed on LSE shares.",
        "date": "02272017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Britain's FTSE gains despite insurers  LSE weakness "
    },
    {
        "content": "Feb 23 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "02232017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "PRESS DIGEST- Financial Times - Feb 23 "
    },
    {
        "content": "Feb 24 Kraft Heinz's bid has jolted Unilever into focusing more on delivering on its strategy in the short-term  the Anglo-Dutch company's finance chief said on Friday.",
        "date": "02242017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "CORRECTED-UPDATE 1-Kraft's shock bid triggers Unilever focus on short-term value "
    },
    {
        "content": "Feb 23 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "02232017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "PRESS DIGEST- British Business - Feb 23 "
    },
    {
        "content": "LONDON  Feb 24 Unilever said the shock of Kraft Heinz's opportunistic approach had jolted it to re-examine its strategy  and all aspects of the consumer goods giant's business were up for review to increase shareholder value.",
        "date": "02242017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever says Kraft's shock bid to spur focus on short-term value "
    },
    {
        "content": "LONDON Unilever  sought to show shareholders it can go it alone on Wednesday after rejecting Kraft Heinz's  $143 billion bid  with the promise of a swift  far-reaching review.",
        "date": "02222017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Unilever spurred into speedy value review by Kraft bid "
    },
    {
        "content": "LONDON Kraft Heinz Co's  rapid retreat from its surprise $143 billion bid for Unilever   in the face of stiff resistance knocked the Anglo-Dutch company's shares on Monday as investors assessed the impact of the failed approach. | Video ",
        "date": "02212017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Kraft backs out of Unilever bid after hostile reception "
    },
    {
        "content": "* Follows rejection of $143 bln Kraft takeover bid   (Adds detail from statements  banker quote  investor quote  background  adds bullet points  updates shares)",
        "date": "02222017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Unilever spurred into speedy value review by Kraft bid "
    },
    {
        "content": "LONDON Kraft Heinz's  dropped bid to buy Unilever  is the third-largest M&A deal to collapse  according to Thomson Reuters data  adding to a recent run of failures that highlights the appetite for the pursuit of audacious mega-mergers.",
        "date": "02212017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Collapse of Kraft-Unilever tie-up extends run of failed mega-deals "
    },
    {
        "content": "LONDON British Prime Minister Theresa May's office was not involved in Kraft Heinz's  decision to withdraw its $143 billion bid for Unilever   her spokesman said on Monday.",
        "date": "02202017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "UK PM May's office was not involved in Kraft withdrawing Unilever offer: spokesman "
    },
    {
        "content": "Feb 19 Kraft Heinz Co has agreed to withdraw its proposal for a $143 billion merger with larger rival Unilever Plc  the companies said on Sunday.",
        "date": "02192017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft withdraws offer to merge with Unilever "
    },
    {
        "content": "LONDON  Feb 22 Anglo-Dutch consumer goods group Unilever said it was reviewing its options to increase shareholder value  just days after it swiftly rejected a surprise $143 billion takeover bid from Kraft Heinz.",
        "date": "02222017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Fresh from fending off Kraft  Unilever to review strategy "
    },
    {
        "content": "DALLAS (Reuters Breakingviews) - The power behind the Burger King throne wants an extra side of nuggets. Fresh from withdrawing Kraft Heinz's $143 billion bid for Unilever over the weekend  investment firm 3G Capital's restaurant roll-up pounced on fried-chicken chain Popeyes Louisiana Kitchen. Restaurant Brands International is offering $1.8 billion for the maker of the Bonafide Chicken meal  a 27 percent premium to the undisturbed price. The deal gives the Brazilian founders of 3G a savory sna",
        "date": "02212017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "3G chews over next big move with side of nuggets "
    },
    {
        "content": "LONDON British Prime Minister Theresa May's office was not involved in Kraft Heinz's  decision to withdraw its $143 billion bid for Unilever   her spokesman said on Monday.",
        "date": "02212017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UK PM May's office was not involved in Kraft withdrawing Unilever offer: spokesman "
    },
    {
        "content": "LONDON  Feb 20 Kraft Heinz's dropped bid to buy Unilever is the third-largest M&A deal to collapse  according to Thomson Reuters data  adding to a recent run of failures that highlights the appetite for the pursuit of audacious mega-mergers.",
        "date": "02202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Collapse of Kraft-Unilever tie-up extends run of failed mega-deals "
    },
    {
        "content": "LONDON British Prime Minister Theresa May has asked top officials to examine U.S. food company Kraft Heinz's  proposed takeover of Unilever Plc   the Financial Times reported on Sunday without citing any sources.",
        "date": "02192017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UK PM May orders officials to examine Kraft Heinz bid for Unilever: FT "
    },
    {
        "content": "* Indexes up: Dow 0.54 pct  S&P 0.53 pct  Nasdaq 0.37 pct   (Adds details  comments  updates prices)",
        "date": "02212017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "US STOCKS-Wall St hits record highs as retailers post strong results "
    },
    {
        "content": "http://pictures.reuters.com/Doc/RTR/Media/TR3_UNWATERMARKED/1/1/5/8/RTSZBSX.jpg",
        "date": "02212017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Reuters Select: Popeyes Louisiana Kitchen finds a new home in Ontario "
    },
    {
        "content": "Feb 17 Buyout firm 3G Capital managed to build a consumer empire with a market value of over $140 billion in just seven years. Yet its ruthless approach to costs may end up hampering 3G-backed Kraft Heinz Co's $143 billion bid for Unilever Plc.",
        "date": "02182017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "RPT-3G Capital's austere empire-building weighs on Kraft's Unilever bid "
    },
    {
        "content": "NEW YORK  Feb 17 The Nasdaq climbed to its fourth record-high close of the week on Friday and the S&P 500 also rose as gains in Kraft Heinz helped offset selling in energy stocks.",
        "date": "02172017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "US STOCKS SNAPSHOT-S&P 500 ends week on high note  helped by Kraft Heinz "
    },
    {
        "content": "Acquire  slash costs  repeat. Billionaire investor Warren Buffet and buyout firm 3G Capital's failed $143 billion bid to combine their food conglomerate Kraft Heinz Co  with Unilever Plc  shows their winning formula now needs a growth boost.",
        "date": "02202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft's failed Unilever bid shows it needs growth over cost cuts "
    },
    {
        "content": "LONDON  Feb 19 British Prime Minister Theresa May has asked top officials to examine U.S. food company Kraft Heinz's proposed takeover of Unilever Plc  the Financial Times reported on Sunday without citing any sources.",
        "date": "02192017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UK PM May orders officials to examine Kraft Heinz bid for Unilever -FT "
    },
    {
        "content": "* Indexes up: Dow 0.32 pct  S&P 0.28 pct  Nasdaq 0.29 pct   (Updates to open)",
        "date": "02212017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "US STOCKS-Wall St hits record highs on strong retail results "
    },
    {
        "content": "Buyout firm 3G Capital managed to build a consumer empire with a market value of over $140 billion in just seven years. Yet its ruthless approach to costs may end up hampering 3G-backed Kraft Heinz Co's  $143 billion bid for Unilever Plc .",
        "date": "02182017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "3G Capital's austere empire-building weighs on Kraft's Unilever bid "
    },
    {
        "content": "* Dow down 0.25 pct  S&P down 0.11 pct  Nasdaq up 0.15 pct   (Updates to afternoon)",
        "date": "02172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "US STOCKS-Wall Street takes breather after 'Trump rally' "
    },
    {
        "content": "* 23 hedge funds made $70 million on Friday from Kraft holdings",
        "date": "02172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Hedge funds on the money in long call for Kraft Heinz "
    },
    {
        "content": "Feb 20 Acquire  slash costs  repeat. Billionaire investor Warren Buffet and buyout firm 3G Capital's failed $143 billion bid to combine their food conglomerate Kraft Heinz Co  with Unilever Plc shows their winning formula now needs a growth boost.",
        "date": "02202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "DEALTALK-Kraft's failed Unilever bid shows it needs growth over cost cuts "
    },
    {
        "content": "Feb 20 Acquire  slash costs  repeat. Billionaire investor Warren Buffet and buyout firm 3G Capital's failed $143 billion bid to combine their food conglomerate Kraft Heinz Co  with Unilever Plc shows their winning formula now needs a growth boost.",
        "date": "02212017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "RPT-DEALTALK-Kraft's failed Unilever bid shows it needs growth over cost cuts "
    },
    {
        "content": "LONDON  Feb 20 Kraft Heinz's dropped bid to buy Unilever is the third-largest M&A deal to collapse  according to Thomson Reuters data  adding to a recent run of failures that highlights the appetite for the pursuit of audacious mega-mergers.",
        "date": "02212017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "RPT-Collapse of Kraft-Unilever tie-up extends run of failed mega-deals "
    },
    {
        "content": "Kraft Heinz Co   the maker of Velveeta cheese  Heinz ketchup and Oscar Mayer meats  reported a higher-than-expected adjusted profit  helped by lower costs.",
        "date": "02152017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Kraft Heinz profit tops estimates as costs fall "
    },
    {
        "content": "NEW YORK  Feb 17 Options on the U.S-listed shares of Unilever drew unusually large and bullish trading activity ahead of Friday's disclosure by Kraft Heinz Co  that it had made a $143 billion bid for the Anglo-Dutch food company.",
        "date": "02172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Options bets on Unilever surged ahead of Kraft Heinz bid "
    },
    {
        "content": "* Pearson hit by broker target price cut   (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon  see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "02202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "FTSE steadies after setting 1-month high  Unilever slumps "
    },
    {
        "content": "Feb 21 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "02212017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "PRESS DIGEST- New York Times business news - Feb 21 "
    },
    {
        "content": "LONDON U.S. food company Kraft Heinz Co made a surprise $143 billion offer for Unilever Plc in a bid to build a global consumer goods giant  although it was flatly rejected on Friday by the maker of Lipton tea and Dove soap.",
        "date": "02182017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz bids $143 bln for Unilever in global brand grab "
    },
    {
        "content": "Feb 15 Kraft Heinz Co  the maker of Velveeta cheese  Heinz ketchup and Oscar Mayer meats  reported a higher-than-expected adjusted profit  helped by lower costs.",
        "date": "02152017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 1-Kraft Heinz profit tops estimates as costs fall "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - The world's wiliest takeover artists have found their biggest target yet. Kraft Heinz  the Kool-Aid-to-Velveeta conglomerate  has offered $143 billion for Unilever  its Anglo-Dutch rival. Even for 3G Capital  the private investment firm behind Kraft Heinz  beer giant Anheuser-Busch InBev and Burger King owner Restaurant Brands International  it's an audacious move. To land Unilever  which rejected the offer  Kraft Heinz may need to pass the hat around to shareh",
        "date": "02172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz may have to pass hat to buy Unilever "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Close shaves sometimes leave scars. Unilever boss Paul Polman can keep his M&A defence powder dry following Kraft Heinz's decision on Feb. 19 to walk away from its spurned bid. But the shock to the system will have an effect on the Anglo-Dutch food and household goods company.",
        "date": "02202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz is a good fire drill for Unilever "
    },
    {
        "content": "LONDON U.S. food company Kraft Heinz Co made a surprise $143 billion offer for Unilever Plc in a bid to build a global consumer goods giant  although it was flatly rejected on Friday by the maker of Lipton tea and Dove soap. | Video ",
        "date": "02182017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz bids $143 billion for Unilever in global brand grab "
    },
    {
        "content": "Feb 15 Kraft Heinz Co  the maker of Velveeta cheese  Heinz ketchup and Oscar Mayer meats  reported a 3.8 percent fall in quarterly sales  hit by a stronger dollar and lower demand in the United States.",
        "date": "02152017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "CORRECTED-Kraft Heinz sales fall 3.8 pct "
    },
    {
        "content": "Unilever rejected a surprise $143 billion takeover bid from Kraft Heinz  saying it saw no reason to discuss a deal which it said had no financial or strategic merit.",
        "date": "02172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Business Watch: Thanks  but no thanks "
    },
    {
        "content": "* Kraft camp had told UK Business Secretary details of plan   (Adds details on Kraft's interaction with UK government)",
        "date": "02202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 2-Kraft backs out of Unilever bid after hostile reception "
    },
    {
        "content": "LONDON  Feb 20 Shares in Anglo-Dutch consumer goods group Unilever  dropped 8 percent on Monday after U.S. rival Kraft Heinz Co abruptly ditched its surprise $143 billion merger proposal.",
        "date": "02202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever shares tumble 8 pct after Kraft ditches bid "
    },
    {
        "content": "* Unilever shares touch record high; Kraft Heinz stock up 10 pct   (Adds Moody's note)",
        "date": "02182017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 8-Kraft Heinz bids $143 bln for Unilever in global brand grab "
    },
    {
        "content": "* Kraft Heinz reports fourth quarter and full year 2016 results",
        "date": "02152017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz Q4 sales $6.9 billion "
    },
    {
        "content": "LONDON  Feb 17 (IFR) - Blue chip advisers in the City of London could reap a fee bonanza of more than US$200m from Kraft Heinz’s US$143bn approach for Anglo-Dutch household goods group Unilever  which was immediately rejected.",
        "date": "02172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Lazard big winner if Kraft Heinz eats Unilever "
    },
    {
        "content": "LONDON  Feb 17 Unilever said it saw no merit in a proposed merger with U.S. food group Kraft Heinz Co  after rejecting a $143 billion offer  saying it \"fundamentally undervalues\" the Anglo-Dutch consumer goods giant.",
        "date": "02172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Unilever rejects $143 bln Kraft offer as bid too low "
    },
    {
        "content": "* Fed's Mester talks rate hikes at start of busy week for speeches",
        "date": "02202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "GLOBAL MARKETS-Asia shares adrift for US holiday  focus on Unilever "
    },
    {
        "content": "* The Kraft Heinz Company declares regular quarterly dividend of $0.60 per share  Source text for Eikon:  Further company coverage:",
        "date": "02152017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-The Kraft Heinz Co declares regular quarterly dividend of $0.60/shr "
    },
    {
        "content": "* on Kraft Heinz's Unilever  approach: as a matter of principle we do not comment on our competitors' activities   Further company coverage:   (Reporting by Brenna Hughes Neghaiwi)",
        "date": "02172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Nestle: no comment on Kraft Heinz's Unilever approach "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Almost nothing made by Kraft Heinz or Unilever has an expiration date of just two days – except  that is  for their $143 billion merger. Kraft  the American ketchup-and-cheese concern controlled by Brazilian investment firm 3G  withdrew an offer to acquire its Anglo-Dutch counterpart on Sunday after an inopportune leak put the knickers of British politicians and unions in a twist. But the idea of pairing 3G's ruthless cost management with Unilever's innovative ",
        "date": "02202017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz has to settle for marinating Unilever "
    },
    {
        "content": "LONDON  Feb 17 U.S. food company Kraft Heinz Co  has proposed a merger with Unilever   but the Anglo-Dutch company has declined  Kraft said on Friday.",
        "date": "02172017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz proposes merger deal which Unilever rejects "
    },
    {
        "content": "Heinz ketchup maker Kraft Heinz Co  and media mogul Oprah Winfrey said on Wednesday they would form a joint venture to develop a new line of food products in the United States.",
        "date": "01252017",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Kraft Heinz  Oprah form joint venture to develop new line of food products "
    },
    {
        "content": "Jan 25 Heinz ketchup maker Kraft Heinz Co  and media mogul Oprah Winfrey said on Wednesday they would form a joint venture to develop a new line of food products in the United States.",
        "date": "01252017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz  Oprah form JV to develop new line of food products "
    },
    {
        "content": "* The Kraft Heinz Company and Oprah Winfrey announce joint venture",
        "date": "01252017",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz Company & Oprah Winfrey announce joint venture "
    },
    {
        "content": "CHICAGO (Reuters Breakingviews) - The Brazilian billionaires at 3G Capital that turned Kraft Heinz and Anheuser-Busch InBev into mega-acquisition machines will dive back into the buying business in the coming year. Their next target should be Mondelez  the $66 billion food conglomerate that failed to coax chocolate-maker Hershey into a sale in 2016. A deal will require some unusual ingredients.",
        "date": "12162016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "3G will take another bite of Corporate America "
    },
    {
        "content": "Mondelez International Inc  has not heard from Kraft Heinz Co  about any potential acquisition  people familiar with the matter said on Wednesday  after Swiss magazine Bilanz reported that the latter was planning a bid.",
        "date": "12142016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Mondelez unaware of any Kraft Heinz approach: sources "
    },
    {
        "content": "CHICAGO (Reuters Breakingviews) - The Brazilian billionaires at 3G Capital that turned Kraft Heinz and Anheuser-Busch InBev into mega-acquisition machines will dive back into the buying business in the coming year. Their next target should be Mondelez  the $66 billion food conglomerate that failed to coax chocolate-maker Hershey into a sale in 2016. A deal will require some unusual ingredients.    3G - co-founded by banker-turned-beer-magnate Jorge Paulo Lemann - gobbled up Heinz for $28 billion",
        "date": "12152016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "3G will take another bite of Corporate America "
    },
    {
        "content": "* The Kraft Heinz Company recommends stockholders reject 'mini-tender' offer by TRC Capital Corporation  Source text for Eikon:  Further company coverage:",
        "date": "11162016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz recommends stockholders reject 'mini-tender' offer by TRC Capital "
    },
    {
        "content": "SAO PAULO  Nov 8 3G Capital Inc  the buyout firm controlled by Brazilian billionaire financier Jorge Paulo Lemann  is raising between $8 billion and $10 billion to finance an acquisition of a global consumer goods firm  a Brazil-based blog said on Tuesday.",
        "date": "11082016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 1-3G Capital raising up to $10 bln for takeover  blog says "
    },
    {
        "content": "Kraft Heinz Co   the maker of Velveeta cheese  Heinz ketchup and Oscar Mayer meats  reported on Thursday quarterly sales fell 1.5 percent  as the company continues to cope with changing consumer tastes.",
        "date": "11032016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Kraft Heinz third-quarter sales dip 1.5 percent  below estimates "
    },
    {
        "content": "Nov 3 Kraft Heinz Co  the maker of Velveeta cheese  Heinz ketchup and Oscar Mayer meats  reported on Thursday quarterly sales fell 1.5 percent  as the company continues to cope with changing consumer tastes.",
        "date": "11032016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 1-Kraft Heinz 3rd-qtr sales dip 1.5 pct  below estimates "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.60per share  Source text for Eikon:  Further company coverage:",
        "date": "11032016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz sets regular quarterly dividend of $0.60per share "
    },
    {
        "content": "Nov 3 Kraft Heinz Co  the maker of Velveeta cheese  Heinz ketchup and Oscar Mayer meats  reported a 1.5 percent fall in quarterly adjusted sales  hit by a stronger dollar and pricing pressure in Europe.",
        "date": "11032016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz sales fall 1.5 pct "
    },
    {
        "content": "* Kraft Heinz Co qtrly pro forma net sales $6 267 million versus $6 363 million last year",
        "date": "11032016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz Q3 sales $6.3 bln vs. I/B/E/S view $6.3 bln "
    },
    {
        "content": "* Dewan is CEO of Arena Holdings Management  a global investment business  Source text for Eikon:  Further company coverage:",
        "date": "10212016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz adds Feroz Dewan to board "
    },
    {
        "content": "* Kraft heinz set to join s&p 100; charter communications to join s&p 500",
        "date": "08312016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-S&P Dow Jones Indices says Kraft Heinz set to join S&P 100 "
    },
    {
        "content": "* Files for potential mixed shelf offering; size not disclosed - SEC filing  Source: (http://bit.ly/2bCvrPW) Further company coverage:",
        "date": "08242016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz files for potential mixed shelf offering "
    },
    {
        "content": "* Dissolves class A shares stake in Twenty First Century Fox Inc - SEC Filing",
        "date": "08122016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Third Point Llc dissolves shares stake in Kraft Heinz "
    },
    {
        "content": "* Futures up: Dow 66 pts  S&P 4.5 pts  Nasdaq 11 pts   (Adds details)",
        "date": "08052016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "US STOCKS-Wall Street set to open higher on strong jobs data "
    },
    {
        "content": "Aug 5 Berkshire Hathaway Inc on Friday said its second-quarter profit rose 25 percent  helped by improvement in insurance underwriting  investment gains and the purchase of Precision Castparts Corp  Warren Buffett's largest acquisition.",
        "date": "08052016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 3-Berkshire profit up 25 percent as insurance helps  BNSF weighs "
    },
    {
        "content": "Aug 4 Kraft Heinz Co  the maker of Kraft cheese  Heinz ketchup and Jell-O  reported a quarterly profit that quadrupled  helped by aggressive cost-cutting measures and lower commodity costs.",
        "date": "08042016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "UPDATE 1-Kraft Heinz's quarterly profit quadruples  shares jump "
    },
    {
        "content": "Kraft Heinz Co   the maker of Velveeta cheese  Heinz ketchup and Oscar Mayer meats  is reviewing all its product categories to improve quality  an executive said on Thursday  as it works to win over customers whose tastes have shifted away from processed foods.",
        "date": "08052016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz eyes product quality as consumer tastes change "
    },
    {
        "content": "* Q2 earnings per share view $0.72 -- Thomson Reuters I/B/E/S",
        "date": "08042016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz posts Q2 adj shr $0.85 "
    },
    {
        "content": "Aug 4 Kraft Heinz Co  the maker of Kraft cheese  Heinz ketchup and Jell-O  reported a quarterly profit that quadrupled  helped by aggressive cost-cutting measures and low commodity costs.",
        "date": "08042016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Kraft Heinz's quarterly profit quadruples "
    },
    {
        "content": "* The kraft heinz company announces increase to quarterly dividend",
        "date": "08042016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "BRIEF-Kraft heinz announces increase to quarterly dividend "
    },
    {
        "content": "A federal judge in Chicago on Monday refused to dismiss a lawsuit in which wheat futures and options traders accused Kraft Heinz Co and Mondelez International Inc of illegally manipulating the grain's price at their expense.",
        "date": "06272016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Kraft  Mondelez must face wheat price-rigging lawsuit: U.S. judge "
    },
    {
        "content": "June 27 A federal judge in Chicago on Monday rejected Kraft Heinz Co's and Mondelez International Inc's effort to dismiss a lawsuit in which wheat futures and options traders accused them of illegally manipulating the grain's price.",
        "date": "06272016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "U.S. Judge says Kraft  Mondelez must face wheat price rigging lawsuit "
    },
    {
        "content": "SYDNEY Australia's consumer watchdog on Tuesday sued the Australian subsidiary of U.S.-based Kraft Heinz Co alleging it falsely advertised the nutritional value of its Little Kids Shredz range of food for young children.",
        "date": "06212016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "Australian watchdog sues Heinz over 'Little Kids' health claims "
    },
    {
        "content": "SYDNEY  June 21 Australia's consumer watchdog on Tuesday sued the Australian subsidiary of U.S.-based Kraft Heinz Co alleging it falsely advertised the nutritional value of its Little Kids Shredz range of food for young children.",
        "date": "06212016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "UPDATE 1-Australian watchdog sues Heinz over 'Little Kids' health claims "
    },
    {
        "content": "SAN FRANCISCO  June 6 Investors looking for stability and dividends have been pouring money into consumer staples stocks of late  ignoring warnings from Wall Street's analysts about pricey valuations for companies like Clorox  and Campbell Soup.",
        "date": "06062016",
        "name": "The Kraft Heinz Company",
        "news_type": "normal",
        "symbol": "KHC",
        "title": "Wall St pours money into consumer staples as valuations climb "
    },
    {
        "content": "* On May 4  2016  entered into first amendment to credit agreement dated as of July 6  2015 - SEC filing",
        "date": "05062016",
        "name": "The Kraft Heinz Company",
        "news_type": "topStory",
        "symbol": "KHC",
        "title": "BRIEF-Kraft Heinz entered into first amendment to credit agreement "
    }
]