[
    {
        "content": "* Kimco Realty Corp sees ‍ 2017 FFO as adjusted $1.51 - $1.52​",
        "date": "10252017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty reports Q3 FFO per share $0.39 "
    },
    {
        "content": "* Kimco Realty provides update on Puerto Rico assets after Hurricane Maria",
        "date": "10032017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty provides update on Puerto Rico assets after Hurricane Maria "
    },
    {
        "content": "* Kimco Realty announces redemption of its 4.30% series e medium-term notes due 2018",
        "date": "10022017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty announces redemption of notes due 2018 "
    },
    {
        "content": "* Nearly all its 17 Houston-area assets have restarted operations  including recently opened Grand Parkway Marketplace Development​ Source text for Eikon: Further company coverage:",
        "date": "09012017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty says nearly all its 17 Houston-area assets have restarted "
    },
    {
        "content": "* Says offering of $225 million 5.125% cumulative redeemable preferred stock Source text for Eikon: Further company coverage:",
        "date": "08082017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty announces update on preferred stock "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  August 07 (Fitch) Fitch Ratings has assigned 'BBB-' ratings to the perpetual preferred stock issued by Kimco Realty Corporation (NYSE: KIM). Net proceeds are expected to be utilized to redeem outstanding series of higher cost preferred stock and potentially repay other existing corporate debt. A full list of Fitch's current ratings for KIM follows at the end of this release. KEY RATING DRIVERS The ratings reflect KIM's large  ",
        "date": "08072017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "Fitch Rates Kimco's Preferred Stock 'BBB-' "
    },
    {
        "content": "* Kimco Realty announces offering of notes and cash tender offer for any and all of its outstanding 4.30% series E Medium-term notes due 2018",
        "date": "08012017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty announces offering of notes and cash tender offer for any and all of its outstanding 4.30% series E Medium-term notes due 2018 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  August 02 (Fitch) Fitch Ratings has assigned 'BBB+' ratings to the two tranches of senior unsecured notes issued by Kimco Realty Corporation (NYSE: KIM). Net proceeds are expected to be used to repay existing corporate debt and reduce the outstanding balance on the company's revolving credit facility. A full list of Fitch's current ratings for KIM follows at the end of this release. KEY RATING DRIVERS The ratings reflect KIM's",
        "date": "08022017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "Fitch Rates Kimco's Senior Unsecured Bonds 'BBB+' "
    },
    {
        "content": "NEW YORK  Aug 2 For an industry under siege by e-commerce and searching for relief  mall owner GGP Inc's announcement earlier on Wednesday that it is shelving plans to explore asset sales hit the stock hard and underscored the struggles facing brick-and-mortar retailers.",
        "date": "08022017",
        "name": "Kimco Realty Corporation",
        "news_type": "normal",
        "symbol": "KIM",
        "title": "U.S. retail REITs cannot find upside despite strong numbers "
    },
    {
        "content": "* Kimco realty acquires jantzen beach center  a rare opportunity in a high-barrier-to-entry market",
        "date": "07102017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty acquires Jantzen Beach Center for $131.8 mln "
    },
    {
        "content": "* Reaffirms its full year 2017 financial and operational outlook",
        "date": "04262017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty reports Q1 sales $113.2 million "
    },
    {
        "content": "* Kimco Realty announces pricing of $400 million 3.800 pct notes due 2027",
        "date": "03222017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty announces pricing of $400 mln 3.800 pct notes due 2027 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 22 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to the  senior unsecured notes due 2027 issued by Kimco Realty Corporation (NYSE: KIM).  Net proceeds are expected to be utilized for secured debt repayment and general  corporate purposes. A full list of Fitch's current ratings for KIM follows at  the end of this release. KEY RATING DRIVERS The ratings reflect KIM's large  diversified portfolio  its generally consist",
        "date": "03222017",
        "name": "Kimco Realty Corporation",
        "news_type": "normal",
        "symbol": "KIM",
        "title": "Fitch Rates Kimco's Senior Unsecured Bonds Due 2027 'BBB+' "
    },
    {
        "content": "* Ceo conor flynn's fy 2016 total compensation $9.04 million versus $3.2 million in fy 2015 - sec filing",
        "date": "03152017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty CEO Conor Flynn's FY 2016 compensation $9.04 mln vs $3.2 mln "
    },
    {
        "content": "* Kimco Realty Corp - Conor Flynn  who had held dual role of President and Chief Executive Officer  will remain Kimco's Chief Executive Officer",
        "date": "02272017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty Corp expands leadership team "
    },
    {
        "content": "* Kimco Realty announces new $2.25 billion revolving credit facility",
        "date": "02012017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty announces new $2.25 bln revolving credit facility "
    },
    {
        "content": "* Kimco realty appoints Mary Hogan Preusse to its board of directors",
        "date": "02032017",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco realty appoints Mary Preusse to board "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 01 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to the  expected senior unsecured notes due 2024 and 2046 issued by Kimco Realty  Corporation (NYSE: KIM). Net proceeds are expected to be used for debt repayment  and general corporate purposes. A full list of Fitch's current ratings on KIM  follows at the end of this release. KEY RATING DRIVERS The ratings reflect Kimco's large  diversified portfolio  its general",
        "date": "11012016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "Fitch Rates Kimco's Senior Unsecured Bonds Due 2024 and 2046 'BBB+' "
    },
    {
        "content": "* Kimco Realty Corp - Board increases quarterly common stock cash dividend 5.9% to $0.27 per share",
        "date": "10272016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty Q3 loss per share $0.13 "
    },
    {
        "content": "* Company's 2016 guidance range for shopping center dispositions is $1.0 billion to $1.15 billion",
        "date": "10122016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "REFILE-BRIEF-Kimco Realty sees 2016 shopping center dispositions of $1 bln-$1.15 bln (Oct. 11) "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 29 (Fitch) Fitch Ratings has affirmed the ratings of Kimco  Realty Corporation (NYSE: KIM)  including the Long-Term Issuer Default Ratings  (IDR)  at 'BBB+'. Fitch has also withdrawn all ratings for Kimco North Trust III  as the company has redeemed the senior unsecured guaranteed notes. A full list  of Fitch's rating actions follows at the end of this release KEY RATING DRIVERS The ratings reflect Kimco's large  div",
        "date": "09292016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "Fitch Affirms Kimco's IDR at 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Kimco Realty Acquires Remaining Interest In Four Property joint venture portfolio for $170.7m",
        "date": "09062016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty acquires remaining interest in Four-Property Joint Venture portfolio for $170.7m "
    },
    {
        "content": "* Kimco Realty announces redemption price for its 5.70 percent senior notes due 2017",
        "date": "08232016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco realty announces redemption price for 5.70 pct senior notes "
    },
    {
        "content": "* Kimco Realty announces pricing of $500 million 2.800 pct notes due 2026",
        "date": "08092016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty announces pricing of $500 mln 2.800 pct notes due 2026 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  August 09 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to the  senior unsecured notes due 2026 issued by Kimco Realty Corporation (NYSE: KIM).  Net proceeds are expected to be used for the redemption of the $290.9 million  aggregate principal amount of outstanding 5.70% senior notes due May 1  2017  (the 2017 notes)  with the remainder  if any  to be used for general corporate  purposes. A full list of Fitch's current ra",
        "date": "08092016",
        "name": "Kimco Realty Corporation",
        "news_type": "normal",
        "symbol": "KIM",
        "title": "Fitch Rates Kimco's Senior Unsecured Bonds due 2026 'BBB+' "
    },
    {
        "content": "* Files for potential notes offering; size not disclosed - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "08092016",
        "name": "Kimco Realty Corporation",
        "news_type": "normal",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty files for potential notes offering "
    },
    {
        "content": "* Kimco Realty Corp sees FY FFO per share $1.34 - $1.42 $1.42",
        "date": "07272016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty Corp sees FY FFO per share $1.34 - $1.42 "
    },
    {
        "content": "Kimco Announces Key Strategic Initiatives To Further Strengthen The Company's Long-Term Financial Outlook",
        "date": "07272016",
        "name": "Kimco Realty Corporation",
        "news_type": "normal",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Announces Key Strategic Initiatives To Further Strengthen The Company's Long-Term Financial Outlook "
    },
    {
        "content": "* Kimco Realty Corp.and Krcx North Holdings  Llc announce Redemption Of Canadian Connection with redemption  Kimco expects to incur a one-time prepayment charge of approximately CAD $33.1 million in Q3 of 2016",
        "date": "07262016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty Krcx North Holdings  Llc announce Redemption Of Canadian-Denominated Series 3 and series 4 notes totaling $350 million "
    },
    {
        "content": "* Says its transaction activity for Q2 of 2016 exceeded $1 billion",
        "date": "07072016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty says Q2 transaction activity exceeded $1 billion "
    },
    {
        "content": "* Sells interests in 17-property Canadian portfolio for $324.0 million  transaction advances the company's strategic exit from Canada by year end  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06092016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty sells interests in Canadian portfolio for $324 mln "
    },
    {
        "content": " ",
        "date": "05052016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty announces pricing of $150 million 4.25 pct notes due 2045 "
    },
    {
        "content": "* Kimco realty announces first quarter 2016 operating results",
        "date": "04272016",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "BRIEF-Kimco Realty Corp reports Q1 FFO per share $0.38 "
    },
    {
        "content": "WILMINGTON  Del  Oct 22 First Data Corp's Chief Executive Officer Frank Bisignano hailed a $3.5 billion fund-raising in July 2014 for drawing a \"who's who in equity investing\" and paving the way for the payment processor's huge IPO last week.",
        "date": "10222015",
        "name": "Kimco Realty Corporation",
        "news_type": "normal",
        "symbol": "KIM",
        "title": "Lehman Brothers returns in deal that led to First Data IPO "
    },
    {
        "content": "Sept 24 Canada's RioCan Real Estate Investment Trust will end a joint venture with Kimco Realty Corp  and buy its stake in 22 Canadian properties for C$715 million ($533.66 million).",
        "date": "09242015",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "RioCan to buy 22 properties from Kimco; ends joint venture "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 27 (Fitch) Fitch Ratings has affirmed Kimco Realty Corporation's  (NYSE: KIM; Kimco or the company) Issuer Default rating (IDR) at 'BBB+' and  maintained the Stable Outlook. See the full list of ratings at the end of this  release.  Fitch also assigns a 'BBB+' rating to the $350 million of 4.25% senior unsecured  notes due 2045 issued in March 2015.   KEY RATING DRIVERS The ratings reflect Kimco's large  diversified port",
        "date": "03272015",
        "name": "Kimco Realty Corporation",
        "news_type": "topStory",
        "symbol": "KIM",
        "title": "Fitch Affirms Kimco's 'BBB+' IDR; Outlook Stable "
    }
]