[
    {
        "content": "SAN FRANCISCO  Oct 22 Cisco Systems Inc   the world’s largest networking gear manufacturer  is nearing a deal to buy U.S. telecommunications software firm BroadSoft Inc for close to $2 billion  a person familiar with the matter said on Sunday.",
        "date": "10232017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "CORRECTED-Cisco nears deal to acquire BroadSoft -source "
    },
    {
        "content": "NEW  YORK  Oct 24 Vendors to Toys 'R' Us have resumed shipping top products  a bankruptcy lawyer said on Tuesday  allowing the retailer to stock its shelves ahead of the all-important holiday season.",
        "date": "10242017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Toys 'R' Us says most top vendors have resumed shipments "
    },
    {
        "content": "Cisco Systems Inc  will buy software company BroadSoft Inc  for $1.71 billion  it said on Monday  in a deal that boosts Cisco's collaboration tools and helps the company diversify its offerings away from switching and routing. | Video ",
        "date": "10242017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Cisco buys BroadSoft for $1.71 billion in software push "
    },
    {
        "content": "* KKR & Co LP - as of sept 30  aum was $153 billion  up 17 pct compared to September 30  2016‍​",
        "date": "10262017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co. L.P. Q3 net income per common unit was $0.30‍​ "
    },
    {
        "content": "* KKR becomes shareholder of PT Nippon Indosari Corpindo TBK.",
        "date": "10262017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR acquires about 12.64 pct stake in PT Nippon Indosari Corpindo TBK "
    },
    {
        "content": "TOKYO U.S. hedge fund Elliott Management Corp has raised its stake in Japan's Hitachi Kokusai Electric to 8.59 percent from 7.11 percent  a regulatory filing showed  one of several such hikes since it first disclosed a stake in the firm last month.",
        "date": "10122017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Elliott again ups Hitachi Kokusai stake  KKR raises offer price "
    },
    {
        "content": "TOKYO KKR & Co LP  has raised its offer price for Hitachi Kokusai Electric Inc  to 2 900 yen a share from 2 503 yen  the Japanese firm said on Wednesday  after a U.S. hedge fund put pressure on the private equity firm to revise terms.",
        "date": "10112017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR raises Hitachi Kokusai offer following pressure from hedge fund "
    },
    {
        "content": "* KKR is proposing to buy Hitachi Kokusai from parent Hitachi",
        "date": "10122017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-Elliott again ups Hitachi Kokusai stake  KKR raises offer price "
    },
    {
        "content": "TOKYO  Oct 12 U.S. hedge fund Elliott Management Corp has raised its stake in Japan's Hitachi Kokusai Electric to 8.59 percent from 7.11 percent  a regulatory filing showed on Thursday.",
        "date": "10122017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Elliott again ups Hitachi Kokusai stake after KKR raises offer price "
    },
    {
        "content": "TOKYO  Oct 11 KKR & Co LP has raised its offer price for Hitachi Kokusai Electric Inc to 2 900 yen a share from 2 503 yen  the Japanese firm said on Wednesday  as the U.S. buyout firm revises terms deemed unsuitable for minority shareholders.",
        "date": "10112017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Hitachi Kokusai says KKR raised offer price to 2 900 yen a share "
    },
    {
        "content": "* Nature's Bounty Co. completes transaction with KKR and names Paul Sturman as CEO",
        "date": "09282017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Nature's Bounty Co. completes transaction with KKR and names Paul Sturman as CEO "
    },
    {
        "content": "* Echonous - parent company of Signostics announced a new $35 million dollar investment from KKR Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "09282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-Echonous - parent company of Signostics announced a new $35 million dollar investment from KKR "
    },
    {
        "content": "* Signing of agreement under which KKR will invest in Suishou's series C funding round to support company's expansion across China",
        "date": "09282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR invests in Shenzhen Suishou technology "
    },
    {
        "content": "* Toshiba has picked rival Bain-led group as winner of auction",
        "date": "09262017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Western Digital to seek injunction to block Toshiba's $18 bln chip unit sale "
    },
    {
        "content": "KKR & Co LP has added a small sweetener to its bid for Australia's Pepper Group  caving to a demand from the non-bank lender's biggest shareholder and bringing the deal value to A$682 million ($543 million).",
        "date": "09252017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR lifts bid for Australia's Pepper to $543 million to appease shareholder "
    },
    {
        "content": "* KKR adds 10-cent special dividend  Pepper shares surge 4.6 pct (Recasts and adds deal value  Perpetual comment)",
        "date": "09252017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-KKR lifts bid for Australia's Pepper to $543 mln to appease shareholder "
    },
    {
        "content": "U.S. private equity investment firm KKR & Co LP  is going to bid in a 600 million-pound-plus ($800 million) auction of Britain's largest chain of health and fitness clubs  Pure Gym   according to Sky News.",
        "date": "09212017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR looks to bid in $800 million-plus auction of Britain's Pure Gym: Sky News "
    },
    {
        "content": "Sept 21 U.S. private equity investment firm KKR & Co LP is going to bid in a 600 million-pound-plus ($800 million) auction of Britain's largest chain of health and fitness clubs  Pure Gym   according to Sky News.",
        "date": "09212017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR looks to bid in $800 mln-plus auction of Britain's Pure Gym - Sky News "
    },
    {
        "content": "HONG KONG  Sept 21 Carlyle Group is targeting the first closing of a new Asia buyout fund within the next couple of months at over $4 billion  three people familiar with the matter said  bulking up in a region that has become a key market for global funds.",
        "date": "09212017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Carlyle targets first-close of new Asia buyout fund at over $4 bln - sources "
    },
    {
        "content": "Sept 19 San Francisco-based investment adviser Angel Island Capital named Dev Gopalan its chief executive officer.",
        "date": "09192017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "MOVES-Angel Island Capital names Dev Gopalan as CEO "
    },
    {
        "content": "NEW YORK  Sept 20 Toys \"R\" Us Inc will shrink its stores and revamp its bigger outlets through its bankruptcy process  which may end with the company's return to the public markets  Chief Executive David Brandon said on Wednesday.",
        "date": "09202017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Toys 'R' Us CEO sees future with smaller shops "
    },
    {
        "content": "* Valueact Capital Management LLC reports 8.9 percent stake in KKR & Co LP as of september 14 versus a 7.5 percent stake as of August 31 - SEC Filing Source text: [http://bit.ly/2xh53UK] Further company coverage:",
        "date": "09182017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Valueact Capital Management LLC reports 8.9 pct stake in KKR & Co LP as of Sept 14 versus a 7.5 pct stake as of Aug 31 - SEC Filing "
    },
    {
        "content": "Sept 15 Toys ‘R’ Us Inc could file for bankruptcy in the coming weeks as pressure from skittish suppliers intensifies  the Wall Street Journal reported on Friday  citing people familiar with the matter.",
        "date": "09162017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Toys 'R' Us mulls bankruptcy filing -Wall Street Journal "
    },
    {
        "content": "HONG KONG  Sept 14 Asia Alternatives  a regional private equity fund-of-funds (FOF) manager  said on Thursday it has raised about $1.8 billion for its most recent fund and associated vehicles  benefiting from increased demand for the relatively high returns promised by buyout deals and early-stage investing in Asian companies.",
        "date": "09142017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "RPT-Private equity investor Asia Alternatives closes new $1.8 bln fund "
    },
    {
        "content": "NEW YORK  Sept 8 US private equity firm KKR & Co will finance its acquisition of US ambulatory surgery center operator Covenant Surgical Partners with a US$195m term loan  two sources close to the matter said.",
        "date": "09082017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "LPC: KKR's Covenant Surgical Partners buy supported by US$195m loan "
    },
    {
        "content": "SAN FRANCISCO Former United States CIA Director David Petraeus said Thursday he has joined the board of a large cybersecurity company controlled by investment firm Kohlberg Kravis Roberts (KKR & Co. LP)  taking his most prominent role in the private sector.",
        "date": "09072017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Former CIA director Petraeus joins KKR backed security firm "
    },
    {
        "content": "TOKYO/HONG KONG U.S. hedge fund Elliott Management Corp said on Monday it has a stake of just over 5 percent in Hitachi Kokusai Electric   putting pressure on a stalled takeover bid by U.S. buyout firm KKR & Co LP .",
        "date": "09112017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Elliott squares off against KKR with Hitachi Kokusai stake "
    },
    {
        "content": "* Toshiba still in discussions with various parties -sources (Recasts with new sourcing; adds INCJ meeting  external director comment  context)",
        "date": "09122017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-Toshiba still in talks over chip unit sale one day before deadline -sources "
    },
    {
        "content": "SAN FRANCISCO  Sept 7 Former United States CIA Director David Petraeus said Thursday he has joined the board of a large cybersecurity company controlled by investment firm Kohlberg Kravis Roberts (KKR & Co. LP)  taking his most prominent role in the private sector.",
        "date": "09072017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Former US CIA director Petraeus joins KKR backed security firm "
    },
    {
        "content": "* Hitachi Kokusai shares rise 4.6 pct (Adds details  background on Elliott  KKR; updates share price)",
        "date": "09112017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-Elliott squares off against KKR with Hitachi Kokusai stake "
    },
    {
        "content": "* KKR invests in Laser Clinics Australia in partnership with The Growth Fund",
        "date": "09012017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR says invests in Laser Clinics Australia in partnership with The Growth Fund "
    },
    {
        "content": "* Delay could hit aim to complete sale by March  avoid delisting",
        "date": "08312017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Faced with new bid  Toshiba looks set to miss chip sale deadline "
    },
    {
        "content": "Aug 21 Australian telecoms company Vocus Group Ltd said on Monday that takeover discussions with Kohlberg Kravis Roberts & Co and Affinity Equity Partners had ended  after the private equity players had each lodged A$2.2 billion bids for the telco.",
        "date": "08202017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Australia's Vocus ends takeover talks with KKR  Affinity "
    },
    {
        "content": "* Valueact Capital Management LP reports 6.1 percent stake in KKR & Co LP as of August 10  2017 - SEC filing‍​",
        "date": "08212017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Valueact Capital Management reports 6.1 percent stake in KKR & Co LP "
    },
    {
        "content": "Aug 21 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "08212017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Termination of transaction discussion & forecast of earnings",
        "date": "08212017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-Vocus Group updates on KKR takeover proposal "
    },
    {
        "content": "Envision Healthcare Corp  said on Tuesday it would sell its ambulance business to buyout firm KKR & Co  in an all-cash deal valued at $2.4 billion as it sharpens its focus on its core businesses.",
        "date": "08082017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Envision to sell ambulance business to KKR in $2.4 billion deal "
    },
    {
        "content": "Aug 8 Envision Healthcare Corp said on Tuesday it would sell its ambulance business to buyout firm KKR & Co in an all-cash deal valued at $2.4 billion as it sharpens its focus on its core businesses.",
        "date": "08082017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Envision to sell ambulance business to KKR in $2.4 bln deal "
    },
    {
        "content": "* KKR & Co lp - financial details of transaction were not disclosed.​ Source text for Eikon: Further company coverage:",
        "date": "08082017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR to acquire Covenant Surgical Partners "
    },
    {
        "content": "Aug 8 Envision Healthcare Corp said it would sell its medical transportation unit  American Medical Response  to buyout firm KKR & Co's portfolio company  Air Medical Group Holdings  in a deal valued at $2.4 billion.",
        "date": "08082017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Envision to sell ambulance business to KKR in $2.4 bln deal "
    },
    {
        "content": "* Internet Brands - Internet Brands  a KKR portfolio co  announces commencement of tender offer for all outstanding shares of WebMD at $66.50 per share​",
        "date": "08072017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Internet Brands commences tender offer for all outstanding shares of WebMD "
    },
    {
        "content": "PharMerica Corp   a U.S. pharmacy manager for long-term care facilities  said on Wednesday it agreed to be acquired by a newly formed company controlled by buyout firm KKR & Co LP  for $1.4 billion  including debt.",
        "date": "08022017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR to take PharMerica private in $1.4 billion deal "
    },
    {
        "content": "Aug 2 PharMerica Corp  a U.S. pharmacy manager for long-term care facilities  said on Wednesday it agreed to be acquired by a newly formed company controlled by buyout firm KKR & Co LP for $1.4 billion  including debt.",
        "date": "08022017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR to take PharMerica private in $1.4 bln deal "
    },
    {
        "content": "Aug 2 PharMerica Corp  a U.S. pharmacy manager for long-term care facilities  said on Wednesday it agreed to be acquired by a newly formed company controlled by buyout firm KKR & Co LP for $1.4 billion  including debt.",
        "date": "08022017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR to take PharMerica private in $1.4 bln deal "
    },
    {
        "content": "* KKR & Co and CVC Capital Partners have begun working on a joint offer for Akzo Nobel NV's specialty chemicals division - Bloomberg  citing sources",
        "date": "07272017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR  CVC Capital have begun working on joint offer for Akzo Nobel's specialty chemicals division - Bloomberg "
    },
    {
        "content": "SEOUL U.S. buyout firm KKR & Co  has agreed to set up an auto parts joint venture with South Korea's LS Group and buy LS' materials business - a deal that follows its purchase of Nissan Motor  supplier Calsonic Kansei last year.",
        "date": "07272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR to set up auto parts JV with South Korea's LS Group  buy materials business "
    },
    {
        "content": "SEOUL  July 27 U.S. buyout firm KKR & Co has agreed to set up an auto parts joint venture with South Korea's LS Group and buy LS' materials business - a deal that follows its purchase of Nissan Motor supplier Calsonic Kansei last year.",
        "date": "07272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR to set up auto parts JV with S.Korea's LS Group  buy materials business "
    },
    {
        "content": "July 27 KKR & Co LP said on Thursday its second-quarter after-tax profit almost quadrupled to a record  as the private equity firm marked up the value of several of its investments to reflect their strong performance amid a market rally.",
        "date": "07272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR's second-quarter earnings soar to a record "
    },
    {
        "content": "* KKR & co LP - aum was $148.5 billion as of June 30  2017  an increase of $10.9 billion  compared to aum of $137.6 billion as of March 31  2017",
        "date": "07272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR & co LP reports second quarter 2017 results "
    },
    {
        "content": "SEOUL  July 27 U.S. buyout firm KKR & Co said it has agreed to buy auto parts and materials businesses from South Korea's LS Group for 1.05 trillion won ($943 million) - a deal that follows its purchase of Nissan Motor supplier Calsonic Kansei last year.",
        "date": "07272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR to acquire auto assets from S. Korea's LS Group for $943 mln "
    },
    {
        "content": "* Says will additionally acquire LS Group affiliate LS mtron's copper foil and flexible copper clad laminate business",
        "date": "07272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-LS Group and KKR announce partnership agreement "
    },
    {
        "content": "NEW YORK  July 26 Private equity firm KKR & Co has lined up a syndicate of banks including Credit Suisse  Bank of America Merrill Lynch  Jefferies  Morgan Stanley  RBC Capital Markets  HSBC and Mizuho to underwrite the debt financing for its leveraged buyout of U.S. vitamin and nutritional supplement maker Nature’s Bounty Co  according to three sources familiar with the matter.",
        "date": "07262017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "LPC: KKR lines up US$2.25bn of loans for Nature’s Bounty buy "
    },
    {
        "content": "ZURICH  July 26 Swiss pharmaceutical supplier Lonza Group AG set out ambitious growth targets and beat market expectations for first-half core profit  sending its shares more than 6 percent higher on Wednesday.",
        "date": "07262017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-Lonza outlines 2022 targets  shares hit record highs "
    },
    {
        "content": "* Toshiba also weighing offers from Western Digital  Foxconn -source (Adds details on auction  bidders)",
        "date": "07252017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Toshiba board to meet Wednesday  weigh offers for chip unit - source "
    },
    {
        "content": "Private equity firm KKR & Co LLP  is nearing an all-cash deal to acquire WebMD Health Corp   a U.S. online health publisher with a market capitalization of $2.1 billion  people familiar with the matter said on Sunday.",
        "date": "07232017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Exclusive: KKR nears deal to acquire WebMD - sources "
    },
    {
        "content": "Private equity firm KKR & Co has agreed to buy WebMD Health Corp for about $2.8 billion  bringing a slew of popular online health information websites under one umbrella  and separately said it would buy a major stake in Nature's Bounty Company. | Video ",
        "date": "07242017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR has eye on health with WebMD  Nature's Bounty deals "
    },
    {
        "content": "July 24 Private equity firm KKR & Co has agreed to buy WebMD Health Corp for about $2.8 billion  bringing a slew of popular online health information websites under one umbrella  and separately said it would buy a major stake in Nature's Bounty Company.",
        "date": "07242017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 4-KKR has eye on health with WebMD  Nature's Bounty deals "
    },
    {
        "content": "* Futures down: Dow 3 pts  S&P 0.25 pts  Nasdaq 2.25 pts (Adds details  comment  updates prices)",
        "date": "07242017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "US STOCKS-Wall St set to open flat as earnings season gathers pace "
    },
    {
        "content": "* Fund size not finalised  could be bigger than $3 bln-source",
        "date": "07202017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Blackstone raising at least $3 bln in first Asia PE fund-sources "
    },
    {
        "content": "* Kkr  Altamar Capital Partners  Deutsche Finance and other investors create Elix Vintage Residencial Socimi to invest in Spanish residential sector",
        "date": "07212017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR  Altamar Capital partners  Deutsche finance and other investors to invest in Spanish residential sector "
    },
    {
        "content": "* Hitachi Koki will spend up to about 50 billion Yen on acquisitions with aid of U.S. buyout firm and majority owner Kohlberg Kravis Roberts- Nikkei",
        "date": "07192017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Hitachi Koki to spend up to about 50 billion yen on acquisitions with aid of U.S. buyout firm and majority owner Kohlberg Kravis Roberts- Nikkei "
    },
    {
        "content": "July 24 U.S. stock index futures were slightly lower on Monday as the earnings season gathered pace  while investors awaited a two-day Federal Reserve meeting that starts on Tuesday.",
        "date": "07242017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "US STOCKS-Futures lower ahead of busy earnings week "
    },
    {
        "content": "* Fund size not finalised  could be bigger than $3 bln-source",
        "date": "07202017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Blackstone raising at least $3 bln in first Asia PE fund "
    },
    {
        "content": "TORONTO/NEW YORK Canadian pension plan Ontario Municipal Employees Retirement System has been talking with major U.S. and Canadian private equity firms about selling land registry company Teranet in a deal that could fetch about C$3 billion ($2.4 billion)  according to people familiar with the situation.",
        "date": "07192017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "OMERS in talks with buyout firms about C$3 billion Teranet sale: sources "
    },
    {
        "content": "* Following transaction close KKR will be majority owner of Nature's Bounty while Carlyle will retain a significant stake in co",
        "date": "07242017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR to acquire majority control of the Nature’s Bounty Co. from the Carlyle Group "
    },
    {
        "content": "* WebMD Health Corp - transaction valued at approximately $2.8 billion.",
        "date": "07242017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-WebMD to be acquired by KKR's Internet Brands "
    },
    {
        "content": "KKR & Co LP   the private equity firm founded and headed by Henry Kravis and George Roberts  said on Monday it had appointed Joseph Bae and Scott Nuttall as co-presidents and co-chief operating officers  setting them up as its future leaders.",
        "date": "07172017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR names Bae  Nuttall as co-presidents in step toward succession "
    },
    {
        "content": "TORONTO/NEW YORK  July 19 Canadian pension plan Ontario Municipal Employees Retirement System has been talking with major U.S. and Canadian private equity firms about selling land registry company Teranet in a deal that could fetch about C$3 billion ($2.4 billion)  according to people familiar with the situation.",
        "date": "07192017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "OMERS in talks with buyout firms about C$3 bln Teranet sale -sources "
    },
    {
        "content": "July 24 Online health publisher WebMD Health Corp said on Monday it agreed to be bought by private equity firm KKR & Co in a deal valued at about $2.8 billion.",
        "date": "07242017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR to buy WebMD in $2.8 bln deal "
    },
    {
        "content": "July 24 Private equity company KKR & Co LLP will announce on Monday that it has agreed to pay $66.50 per share in cash to acquire U.S. online health publisher WebMD Health Corp  a person familiar with the matter said on Monday.",
        "date": "07242017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR to pay $66.50 per share for WebMD -source "
    },
    {
        "content": "July 17 KKR & Co LP  the private equity firm founded and headed by Henry Kravis and George Roberts  said on Monday it had appointed Joseph Bae and Scott Nuttall as co-presidents and co-chief operating officers  setting them up as its future leaders.",
        "date": "07172017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR names Bae  Nuttall as co-presidents in step toward succession "
    },
    {
        "content": "* KKR & Co LP - ‍appointment of Joe Bae and Scott Nuttall as co-presidents and co-chief operating officers of KKR and members of KKR's board of directors​",
        "date": "07172017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR names Joe Bae  Scott Nuttall as Co-Chief Operating Officers "
    },
    {
        "content": "* KKR  & co lp - KKR will invest approximately us$200 million to acquire a 49% stake in Radiant​ Source text for Eikon: Further company coverage:",
        "date": "07172017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR to invest $200 mln in India-based Radiant Life Care "
    },
    {
        "content": "July 17 KKR & Co LP  the private equity firm founded and headed by Henry Kravis and George Roberts  said on Monday it had appointed Joseph Bae and Scott Nuttall as co-presidents and co-chief operating officers  setting them up as its future leaders.",
        "date": "07172017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR names Bae  Nuttall as co-presidents in step towards succession "
    },
    {
        "content": "July 7 Warren Buffett's Berkshire Hathaway Inc said on Friday it agreed to pay $9 billion to buy the parent of Texas power transmission company Oncor Electric Delivery Co  stepping up its pursuit of steady profits from utilities and infrastructure deals.",
        "date": "07072017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 4-Buffett bets big on power with $9 billion Oncor deal "
    },
    {
        "content": "Buyout firm KKR & Co LLP  is in advanced talks to buy Envision Healthcare Corp's  ambulance business and merge it with Air Medical Group  a medical helicopter operator it acquired two years ago  people familiar with the matter said.",
        "date": "07122017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Exclusive: Buyout firm KKR in lead to acquire Envision's ambulance unit - sources "
    },
    {
        "content": "July 5 Vocus Group Ltd said on Wednesday it would allow KKR & Co LP to conduct due diligence on a non-exclusive basis  after the private equity giant made a $1.66 billion takeover offer for the Australian internet company in June.",
        "date": "07042017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Australia's Vocus opens books for KKR to conduct due diligence "
    },
    {
        "content": "* Received a preliminary  indicative and non-binding proposal from Kohlberg Kravis Roberts & Co. L.P.​",
        "date": "07042017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-Vocus announces granting of non-exclusive due diligence to KKR "
    },
    {
        "content": "SYDNEY U.S. private equity giant KKR & Co LP moved to bolster its presence in Australia's lucrative mortgage market on Wednesday  joining a rush of players hungry for a slice of a property boom even as the sector shows early signs of slowing.",
        "date": "07052017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR bids $500 million for Australian mortgage lender Pepper "
    },
    {
        "content": "* KKR & Co LP -  on June 29  KKR Capital Markets Holdings L.p  certain units of co entered a 364-day revolving credit agreement with Mizuho Bank  Ltd",
        "date": "07062017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co  on June 29  KKR Capital Markets Holdings  certain units of co entered 364-day revolving credit agreement with Mizuho Bank "
    },
    {
        "content": "* Says announced that it has agreed to sell its entire remaining stake in Visma  together with a smaller stake from Cinven",
        "date": "06292017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co agrees to sell its entire remaining stake in Visma "
    },
    {
        "content": "HONG KONG Tencent Holdings Ltd  has invested around $100 million to $150 million in Indonesian ride-hailing startup Go-Jek  sources said  in another sign the Chinese tech giant was looking to tap into growth in Southeast Asia's mobile-based services.",
        "date": "07042017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "China's Tencent invests in Indonesia's Go-Jek amid SE Asia push: sources "
    },
    {
        "content": "* Deal comes amid early signs of property market slowdown (Recasts; adds industry context  fund manager quote  shares)",
        "date": "07052017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-KKR bids $500 mln for Australian mortgage lender Pepper "
    },
    {
        "content": "Embattled Australian internet company Vocus Group Ltd said it will open its books for KKR & Co LP to conduct due diligence  a sign it may accept a $1.66 billion buyout approach dismissed by investors weeks earlier as too low.",
        "date": "07052017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Australia's Vocus allows KKR to conduct due diligence for $1.7 billion bid "
    },
    {
        "content": "July 5 Vocus Group Ltd said on Wednesday it would allow KKR & Co LP to conduct due diligence on a non-exclusive basis  a month after the private equity firm made a $1.66 billion takeover offer for the Australian internet company.",
        "date": "07052017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "CORRECTED-UPDATE 1-Australia's Vocus opens books for KKR to conduct due diligence "
    },
    {
        "content": "* KKR & Co Lp - ‍each grocery chain will continue to operate separately  but will be managed under one executive team led by ceo john gomez​",
        "date": "07062017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co announces combination of Cardenas Markets and Mi Pueblo "
    },
    {
        "content": "HONG KONG  July 4 Tencent Holdings Ltd has invested around $100 million to $150 million in Indonesian ride-hailing startup Go-Jek  sources said  in another sign the Chinese tech giant was looking to tap into growth in Southeast Asia's mobile-based services.",
        "date": "07042017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-China's Tencent invests in Indonesia's Go-Jek amid SE Asia push -sources "
    },
    {
        "content": "HONG KONG  July 4 Tencent Holdings Ltd has invested around $100 million to $150 million in Indonesian ride-hailing startup Go-Jek  sources said  in another sign the Chinese tech giant was looking to tap into growth in Southeast Asia's mobile-based services.",
        "date": "07042017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "China's Tencent invests in Indonesia's Go-Jek amid SE Asia push -sources "
    },
    {
        "content": "* Says announced appointment of Go Yamashita as head of KKR Capital Markets Japan Source text for Eikon: Further company coverage:",
        "date": "06212017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR Names Head of KKR Capital Markets Japan "
    },
    {
        "content": "Private equity company KKR & Co LP  has sold its entire stake in Norwegian software company Visma for 1.4 billion pounds ($1.81 billion) to a group of investors that includes Singaporean wealth fund GIC  a source familiar with the matter said.",
        "date": "06282017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR sells stake in Norwegian software company Visma for $1.8 billion: source "
    },
    {
        "content": "TOKYO  June 27 Western Digital Corp said it and private equity firm KKR & Co LP had resubmitted a bid for Toshiba Corp's prized flash memory chip unit.",
        "date": "06272017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Western Digital says resubmitted bid with KKR for Toshiba's chip unit "
    },
    {
        "content": "June 28 Private equity company KKR & Co LP has sold its entire stake in Norwegian software company Visma for 1.4 billion pounds ($1.81 billion) to a group of investors that includes Singaporean wealth fund GIC  a source familiar with the matter said. KKR will get a 3.2 times return on its investment from the stake sale  the source said  without disclosing the size of the stake KKR had in Visma. GIC had bought a 12 percent stake in Visma  the source said  but had no further details. U",
        "date": "06282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR sells stake in Norwegian software company Visma for $1.8 bln - source "
    },
    {
        "content": "CHIBA  Japan Japan's Toshiba Corp  has pushed back its timeline to clinch a sale of its prized flash memory chip unit  saying the $18 billion deal was being held up due to differences of opinion within the consortium chosen as preferred bidder. | Video ",
        "date": "06282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Toshiba misses self-imposed deadline for chip unit sale  sues Western Digital "
    },
    {
        "content": "* Talks with some members of preferred bidder group taking time",
        "date": "06282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-Toshiba misses self-imposed deadline for chip unit sale  sues Western Digital "
    },
    {
        "content": "* Toshiba unlikely to make decision Thursday - source (Add more source  S&P comments)",
        "date": "06142017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 3-Japan govt-led bid for Toshiba chip unit to include SK Hynix -sources "
    },
    {
        "content": "SAN FRANCISCO/TOKYO  June 9 Private equity firm Bain Capital is replacing rival KKR & Co LP in a Japanese government-led consortium that also includes Western Digital Corp to bid for Toshiba Corp's  chip unit  sources familiar with the matter said.",
        "date": "06092017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Bain replacing KKR in Japan govt-backed bid for Toshiba chip unit -sources "
    },
    {
        "content": "Music streaming company Pandora Media Inc  said on Thursday it would briefly extend the closing of private equity firm KKR & Co LP's  $150 million investment to explore interest expressed by a strategic investor for a minority investment. | Video ",
        "date": "06082017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Pandora extends KKR investment closing to explore interest from investor "
    },
    {
        "content": "Private equity giant KKR & Co LP  made a $1.66 billion takeover approach for Australia's embattled No. 4 internet company Vocus Group Ltd   the target said  sparking a bounce in its shares which have been hit by earnings downgrades.",
        "date": "06072017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR makes $1.7 billion play for struggling Australian telco Vocus "
    },
    {
        "content": "June 7 Australian telecoms company Vocus Group Ltd said on Wednesday it received an indicative takeover offer from private equity firm KKR & Co LP which valued the company at A$2.2 billion ($1.65 billion).",
        "date": "06062017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Australia's Vocus says KKR makes $1.65 bln takeover approach "
    },
    {
        "content": "June 9 Sirius XM Holdings Inc said on Friday it will invest $480 million in Pandora Media Inc  giving the satellite radio company better exposure to internet music streaming while providing financial footing to Pandora.",
        "date": "06092017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 3-Sirius to invest $480 mln in Pandora  may be path to music streaming "
    },
    {
        "content": "June 8 Music streaming company Pandora Media Inc said on Thursday it would briefly extend the closing of private equity firm KKR & Co LP's $150 million investment to explore interest expressed by a strategic investor for a minority investment.",
        "date": "06082017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "CORRECTED-Pandora extends KKR investment closing to explore interest from investor "
    },
    {
        "content": "June 7 Australian shares closed steady on Wednesday after first-quarter economic growth data beat expectations with a 0.3 percent quarter-over-quarter expansion.",
        "date": "06072017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Australia shares flat  propped up by GDP data; NZ lower "
    },
    {
        "content": "* KKR indicative offer A$3.50 per share vs A$2.86 previous close",
        "date": "06072017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-KKR makes $1.7 bln play for struggling Australian telco Vocus "
    },
    {
        "content": "* Has received a preliminary  indicative and non-binding proposal from Kohlberg Kravis Roberts & Co. L.P to acquire 100% of shares in Vocus",
        "date": "06062017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-Vocus Group says it received a takeover proposal from Kohlberg Kravis Roberts & Co "
    },
    {
        "content": "HONG KONG Private equity firm KKR & Co  said on Friday it raised $9.3 billion for its most recent Asia-focused buyout fund  more than expected and setting a record for the region as it looks for larger deals.",
        "date": "06022017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR closes new Asia fund at record $9.3 billion  seeks bigger deals "
    },
    {
        "content": "* Western Digital says nothing resolved  still wants arbitration",
        "date": "06012017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-Toshiba  Western Digital trade barbs in spat over chip unit auction "
    },
    {
        "content": "* KKR's Asian Fund II has posted 29.1 pct return through March",
        "date": "06022017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-KKR closes new Asia fund at record $9.3 bln  seeks bigger deals "
    },
    {
        "content": "* Western Digital OK with no immediate majority stake -sources",
        "date": "05292017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Western Digital may join Japan-KKR group for Toshiba chip unit bid -sources "
    },
    {
        "content": "HONG KONG  June 2 Private equity firm KKR & Co said on Friday it raised $9.3 billion for its most recent Asia-focused buyout fund  setting a record for the region as it looks for larger deals.",
        "date": "06022017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR closes new Asia fund at record $9.3 bln  seeks bigger deals "
    },
    {
        "content": "* With closing of fund  KKR's private equity business manages over US$68 billion in assets under management worldwide Source text for Eikon: Further company coverage:",
        "date": "06022017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR closes $9.3 bln Asian Fund III "
    },
    {
        "content": "Pandora Media Inc  said on Monday that KKR & Co LP  has agreed to invest $150 million in the music streaming service  while the company explores strategic alternatives  including a sale.",
        "date": "05082017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Pandora gets KKR investment; explores strategic alternatives "
    },
    {
        "content": "Kayne Anderson Capital Advisors LP's real estate private equity arm said on Thursday it would buy healthcare real estate investment trust Sentio Healthcare Properties Inc  in an $825 million deal.",
        "date": "05042017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Kayne Anderson Real Estate to buy Sentio Healthcare in $825 million deal "
    },
    {
        "content": "May 8 Pandora Media Inc said on Monday that KKR & Co LP has agreed to invest $150 million in the music streaming service  while the company explores strategic alternatives  including a sale.",
        "date": "05082017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Pandora gets KKR investment; explores strategic alternatives "
    },
    {
        "content": "May 4 Kayne Anderson Capital Advisors LP's real estate private equity arm said on Thursday it would buy healthcare real estate investment trust Sentio Healthcare Properties Inc in an $825 million deal.",
        "date": "05042017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Kayne Anderson Real Estate to buy Sentio Healthcare in $825 mln deal "
    },
    {
        "content": "May 4 Kayne Anderson Capital Advisors LP's real estate private equity arm said on Thursday it would buy healthcare real estate investment trust Sentio Healthcare Properties Inc for $825 million.",
        "date": "05042017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Kayne Anderson Real Estate to buy Sentio Healthcare for $825 mln "
    },
    {
        "content": "LONDON Barclays  Chief Executive Jes Staley is involved in a dispute with private equity firm KKR & Co   which is a client of the bank  the Wall Street Journal reported on Tuesday.",
        "date": "05022017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Barclays CEO Staley in dispute with KKR over soured deal: WSJ "
    },
    {
        "content": "* Pandora media inc- offering may be upsized to a total of $250 million should company determine to issue additional shares",
        "date": "05082017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-Pandora announces $150 million investment by KKR "
    },
    {
        "content": "LONDON  May 2 Barclays Chief Executive Jes Staley is involved in a dispute with private equity firm KKR & Co  which is a client of the bank  the Wall Street Journal reported on Tuesday.",
        "date": "05022017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Barclays CEO Staley in dispute with KKR over soured deal - WSJ "
    },
    {
        "content": "SYDNEY  April 28 A group backed by KKR & Co said on Friday it would not undertake further work on a takeover offer for Australia's Tatts Group after its A$6.15 billion ($4.60 billion) cash bid was rejected by the lottery operator's board.",
        "date": "04282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR-backed group halts work on Tatts takeover offer "
    },
    {
        "content": "* KKR announces tender offer to acquire Hitachi Kokusai Electric",
        "date": "04262017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR announces tender offer to buy Hitachi Kokusai Electric "
    },
    {
        "content": "* Competition tribunal due to rule on Tabcorp bid in mid-June",
        "date": "04282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 3-KKR-backed group halts work on Tatts takeover offer "
    },
    {
        "content": "SYDNEY  April 28 Australian lottery operator Tatts Group on Friday said a A$6.15 billion cash takeover offer from a consortium backed by U.S. private equity giant KKR & Co was not superior to a cash-and-scrip bid from Tabcorp Holdings.",
        "date": "04272017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Australia's Tatts says KKR-backed takeover offer inferior to Tabcorp bid "
    },
    {
        "content": "NEW YORK  April 27 ValueAct Capital on Thursday said it was investing in private equity firm KKR & Co LP   unveiling its latest position as the activist fund dives deeper into the financial sector.",
        "date": "04272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 3-ValueAct unveils interest in KKR as firm shows earnings beat "
    },
    {
        "content": "NEW YORK Activist shareholder ValueAct Capital said on Thursday it had invested in private equity firm KKR & Co LP  after the buyout firm posted stronger-than-expected earnings on a stock market rally that boosted investment returns.",
        "date": "04272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "ValueAct unveils interest in KKR as firm shows earnings beat "
    },
    {
        "content": "NEW YORK  April 27 Activist shareholder ValueAct Capital said on Thursday it had invested in private equity firm KKR & Co LP after the buyout firm posted stronger-than-expected earnings on a stock market rally that boosted investment returns.",
        "date": "04272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-ValueAct unveils interest in KKR as firm shows earnings beat "
    },
    {
        "content": "NEW YORK ValueAct Capital said it has invested in asset management group KKR & Co  as the $16 billion activist investment fund deepens its reach into the financial sector.",
        "date": "04272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Activist ValueAct says invested in private equity pioneer KKR "
    },
    {
        "content": "U.S. private equity firm KKR & Co LP  and Japanese government-backed fund  Innovation Network Corp of Japan (INCJ)  will submit a joint offer for Toshiba Corp's  memory chip unit  the Nikkei business daily reported on Friday.",
        "date": "04212017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR  INCJ plan joint bid for Toshiba's chip unit: Nikkei "
    },
    {
        "content": "NEW YORK  April 27 ValueAct Capital  the $16 billion activist shareholder  said it has invested in asset management company KKR & Co.  and owns less than 5 percent.",
        "date": "04272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "ValueAct says owns under 5 pct of KKR & Co. "
    },
    {
        "content": "April 21 U.S. private equity firm KKR & Co LP and Japanese government-backed fund  Innovation Network Corp of Japan (INCJ)  will submit a joint offer for Toshiba Corp's memory chip unit  the Nikkei business daily reported on Friday.",
        "date": "04212017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  INCJ plan joint bid for Toshiba's chip unit - Nikkei "
    },
    {
        "content": "NEW YORK  April 27 Private equity firm KKR & Co LP posted better-than-expected earnings on Thursday as a jump in income on the back of higher investment returns lifted the bottom line.",
        "date": "04272017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Buyout firm KKR Q1 earnings beat forecasts "
    },
    {
        "content": "SYDNEY  April 19 A consortium backed by U.S. private equity giant KKR & Co offered A$6.15 billion ($4.65 billion) cash for Australian lottery operator Tatts Group Ltd  threatening an agreed merger with Tabcorp Holdings Ltd  two sources familiar with the situation said on Wednesday.",
        "date": "04182017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR-backed consortium makes $4.7 bln cash offer for Australia's Tatts "
    },
    {
        "content": "SYDNEY A group backed by private equity firm KKR & Co  on Wednesday said it had made a revised A$6.15 billion ($4.65 billion) offer for Australia's biggest lottery operator Tatts Group Ltd   upping the ante in a bidding war against Tabcorp Holdings Ltd .",
        "date": "04192017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR-led group ups ante in bidding war for Australia's Tatts lotto "
    },
    {
        "content": "* Consortium cash bid rivals cash-and-scrip offer from Tabcorp",
        "date": "04192017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 3-KKR-led group ups ante in bidding war for Australia's Tatts lotto "
    },
    {
        "content": "* Focus financial partners to receive significant investment from Stone Point Capital and KKR",
        "date": "04192017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR to acquire majority stake in Focus Financial valuing it at about $2 bln "
    },
    {
        "content": "* Says KKR invests in Lyft as part of $600 million series G round of funding into Lyft; financial details not disclosed Further company coverage:",
        "date": "04112017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR invests in Lyft as part of $600 million funding round "
    },
    {
        "content": "HANOI  April 3 Vietnamese food producer Masan Group Corp on Monday said it has received a $250 million investment pledge from global investor KKR & Co LP   in the latest move by a foreign firm seeking to tap Vietnam's fast-growing middle class.",
        "date": "04032017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Vietnam food producer Masan Group gets $250 mln investment from KKR "
    },
    {
        "content": "SYDNEY  March 29 U.S. private equity firm KKR & Co LP is preparing a potential consortium bid for Australia's Quintis Ltd backed by the sandalwood plantation group's managing director  a source said.",
        "date": "03282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR prepares bid for Australia's Quintis: source "
    },
    {
        "content": "MUMBAI India's Bharti Airtel  said it sold a 10.3 percent stake in its telecom tower unit Bharti Infratel  to U.S. private equity firm KKR & Co LP  and Canada Pension Plan Investment Board (CPPIB) for more than 61.9 billion rupees ($952.75 million).",
        "date": "03282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Bharti Airtel sells 10 percent stake in tower unit to KKR  Canada Pension "
    },
    {
        "content": "* Bharti Airtel sells 10 pct stake in tower unit for $953 mln",
        "date": "03282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Bharti Airtel sells 10 pct stake in tower unit to KKR  Canada Pension "
    },
    {
        "content": "MUMBAI  March 28 India's Bharti Airtel said it sold a 10.3 percent stake in its telecom tower unit Bharti Infratel to U.S. private equity firm KKR & Co LP and Canada Pension Plan Investment Board for more than 61.9 billion rupees ($952.75 million).",
        "date": "03282017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Bharti Airtel sells 10 pct stake in tower unit to KKR  Canada Pension "
    },
    {
        "content": "Private equity firm KKR & Co LP  and Canadian pension fund Caisse de dépôt et placement du Québec announced plans on Friday to buy USI Insurance Services from Onex Corp  for $4.3 billion  including debt.",
        "date": "03172017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  Canada's Caisse to buy U.S. insurance broker USI "
    },
    {
        "content": "* Provident Healthcare Partners advises Air Medical on its acquisition by Airmed International",
        "date": "03232017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Provident Healthcare Partners advises Air Medical on its acquisition by Airmed International "
    },
    {
        "content": "* USI has been buying up smaller rivals   (Adds comments from interview with Caisse executive)",
        "date": "03172017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 3-KKR  Canada's Caisse to buy U.S. insurance broker USI "
    },
    {
        "content": "* Says 255 018 138 shares of Calsonic Kansei Corp were offered in a takeover bid by U.S. buyout firm KKR & Co 's wholly owned unit (the acquirer) from Feb. 22 to March 22",
        "date": "03232017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-Calsonic Kansei says outcome of ToB offered by KKR "
    },
    {
        "content": "* KKR will be investing nearly $1.4 billion in capital alongside investors through the firm's balance sheet and employee commitments  Source text for Eikon: Further company coverage:",
        "date": "03062017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR says to invest nearly $1.4 bln in capital alongside investors "
    },
    {
        "content": "* Says KKR makes its investment from its China growth fund. Further details of transaction are not disclosed   Further company coverage:",
        "date": "02272017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR invests in China's Gambol pet group "
    },
    {
        "content": "Buyout firm KKR & Co LP  is preparing an initial public offering (IPO) of Gardner Denver Inc that could value the U.S. industrial machinery maker at between $6 billion and $7 billion  including debt  according to people familiar with the matter.",
        "date": "02242017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Exclusive: KKR prepares IPO of Gardner Denver - sources "
    },
    {
        "content": "* KKR & Co LP - agreed to acquire Travelopia from TUI AG  Source text for Eikon:  Further company coverage:",
        "date": "02132017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR to acquire Travelopia from TUI "
    },
    {
        "content": "FRANKFURT  Feb 10 Shareholders in GfK  have tendered 14.5 percent of stock in the German market researcher to private equity firm KKR  still short of a minimum threshold only hours before KKR's offer expires  a regulatory filing showed on Friday.",
        "date": "02102017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR's GfK bid short of minimum level ahead of midnight deadline "
    },
    {
        "content": "SAO PAULO A Brazilian land developer controlled by Carlyle Group LP  investment vehicles is buckling under mounting client and creditor lawsuits and an unsustainable debt load  highlighting legal risks facing global buyout giants in Latin America's No. 1 economy.",
        "date": "02132017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Exclusive: Carlyle's Brazil developer battles mounting client  creditor lawsuits "
    },
    {
        "content": "NEW YORK  Feb 9 Private equity firm KKR & Co LP  said on Thursday it would raise its quarterly dividend payout from the end of March by a cent  after posting a nearly fivefold rise in fourth-quarter earnings that came close to most analysts' forecasts.",
        "date": "02092017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "UPDATE 2-Buyout firm KKR to hike dividend payout as earnings jump "
    },
    {
        "content": "NEW YORK Private equity firm KKR & Co LP  said on Thursday it will raise its quarterly dividend payout from the end of March by a cent  after posting lower-than-expected fourth-quarter earnings  hurt by unrealized losses in its buyout investments.",
        "date": "02092017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Buyout firm KKR to hike dividend payout; earnings disappoints "
    },
    {
        "content": "NEW YORK  Feb 9 Private equity firm KKR & Co LP reported lower-than-expected earnings on Thursday as losses in privately held investments that have yet to be realized dragged on overall performance.",
        "date": "02092017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Buyout firm KKR posts lower-than-expected Q4 earnings "
    },
    {
        "content": "* KKR & Co. L.P. reports fourth quarter and full year 2016 results",
        "date": "02092017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co reports AUM of $129.6 bln as of Dec. 31  2016 "
    },
    {
        "content": "Please click on the link below for KKR & Co LP's fourth-quarter earnings press release:  Source text:",
        "date": "02092017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co LP Q4 results press release "
    },
    {
        "content": "* KKR Capstone hires Claus Benkert to lead European operations",
        "date": "01312017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR Capstone hires Claus Benkert to lead European operations "
    },
    {
        "content": "Feb 6 KKR & Co LP said on Monday it would merge its hedge fund KKR Prisma with institutional investment firm PAAMCO to form an investment company with more than $30 billion in assets.",
        "date": "02062017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR to merge hedge fund Prisma with PAAMCO to form new investment firm "
    },
    {
        "content": "* PAAMCO and KKR Prisma form strategic partnership to create new liquid alternatives investment firm",
        "date": "02062017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-PAAMCO and KKR Prisma form strategic partnership "
    },
    {
        "content": "TOKYO Bidders for Japan's Takata Corp  are pushing for a court-mediated turnaround for the embattled air bag maker's domestic business  a source said  a strategy the company opposes and news of which sent its shares tumbling 17 percent.",
        "date": "01192017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Takata bidders plan court-led turnaround for Japan business: source "
    },
    {
        "content": "* Takata has said wants private process for global operations",
        "date": "01192017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 3-Takata bidders plan court-led turnaround for Japan business - source "
    },
    {
        "content": "TOKYO U.S. private equity firm KKR & Co LP  said on Friday it has agreed to buy Hitachi Ltd's  power tools unit  Hitachi Koki Co Ltd   for about $1.3 billion  its second billion-dollar deal in Japan in three months.",
        "date": "01132017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR to buy Hitachi's power tools unit for $1.3 billion "
    },
    {
        "content": "* KKR raising new Asia fund   (Adds details on KKR's acquisitions)",
        "date": "01132017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR to buy Hitachi's power tools unit for $1.3 bln "
    },
    {
        "content": "TOKYO  Jan 13 U.S. private equity firm KKR & Co LP has agreed to buy Japanese conglomerate Hitachi Ltd's  power tools unit  Hitachi Koki Co Ltd  for about $1.3 billion  the companies said on Friday.",
        "date": "01132017",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR to buy Hitachi's power tools unit for $1.3 bln "
    },
    {
        "content": "* \"as we look ahead into 2017  we think that we are at a major inflection point across global capital markets.\"",
        "date": "01112017",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR releases 2017 global macro outlook "
    },
    {
        "content": "TOKYO KKR & Co  is in talks to buy Japanese conglomerate Hitachi Ltd's  power tools unit Hitachi Koki Co   a person with direct knowledge of the matter said  in a deal that could be worth over $1.3 billion.",
        "date": "12282016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR in talks to buy Hitachi's power tools unit - source "
    },
    {
        "content": "FRANKFURT U.S. private equity firm Kohlberg Kravis Roberts  launched a tender offer on Thursday for a stake in Germany's GfK   teaming up with the faltering market research firm to develop new computer-based strategies and fend off competition.",
        "date": "12082016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR wants stake in German research firm GfK to drive turnaround "
    },
    {
        "content": "Private equity firm KKR & Co  said on Tuesday it would acquire a majority stake in cybersecurity company Optiv Security Inc  which is majority owned by Blackstone Group LP .",
        "date": "12062016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR to buy majority stake in cybersecurity firm Optiv from Blackstone "
    },
    {
        "content": "* Following transaction  KKR will become majority shareholder in hilding anders  Source text for Eikon:  Further company coverage:",
        "date": "11292016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co Lp acquires Arle's stake in Hilding Anders "
    },
    {
        "content": "Nov 22 Nissan Motor Co will sell 41 percent of its stake in auto parts supplier Calsonic Kansei Corp  to U.S. buyout firm KKR & Co  the Nikkei reported.",
        "date": "11212016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Nissan to sell 41 pct stake in Calsonic Kansei to KKR - Nikkei "
    },
    {
        "content": "* Calsonic relies on Nissan for 80 pct of sales   (Adds KKR executive's comments  details of its previous deals in Japan)",
        "date": "11222016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "UPDATE 4-KKR to buy Nissan-backed supplier Calsonic for up to $4.5 bln "
    },
    {
        "content": "* Mitsui & Co will acquire about 20 percent interest in medical equipment maker Panasonic Healthcare Holdings for 50 billion yen ($456 million) - Nikkei",
        "date": "11172016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Mitsui & Co to acquire about 20 pct interest in Panasonic Healthcare - Nikkei "
    },
    {
        "content": "* U.S. buyout firm KKR & Co is offering a takeover bid for 267 882 277 shares (or no less than 178 588 185 shares) of the company's stock via KKR's unit  at the price of 1 860 yen per share",
        "date": "11222016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-Calsonic Kansei announces 498 bln yen ToB offered by KKR "
    },
    {
        "content": "TOKYO  Nov 22 U.S. buyout firm KKR & Co  is buying Japanese auto parts maker Calsonic Kansei Corp  from Nissan Motor and other shareholders for as much as 498.3 billion yen ($4.50 billion)  the companies said on Tuesday.",
        "date": "11222016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR launches $4.5 bln offer for Japan's Calsonic Kansei "
    },
    {
        "content": "* Blackstone Group  Carlyle Group LP  KKR & Co among buyout firms in talks with banks for financing to back bids for Valeant's Australian drug unit - Bloomberg",
        "date": "11102016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Blackstone  Carlyle  KKR among firms in talks to bid for Valeant's Inova unit - Bloomberg "
    },
    {
        "content": "Nov 1 Private equity firm KKR & Co LP  hired Timothy Franks to join its team in London.",
        "date": "11012016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "MOVES-KKR hires Timothy Franks for its London office "
    },
    {
        "content": "TOKYO U.S. buyout firm KKR & Co  is no longer in the bidding to buy Takata Corp   the Japanese parts maker at the center of the world's biggest auto recall  according to a person briefed on the bidding process.",
        "date": "11022016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR no longer in bidding for Japan's Takata: source "
    },
    {
        "content": "* Announced appointment of Timothy R. Franks as a member in its London office as of 1 February 2017",
        "date": "11012016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co announced appointment of Timothy Franks as a member in its London office "
    },
    {
        "content": "HONG KONG  Nov 1 Shares of Chinese pork producer COFCO Meat Holdings Ltd  backed by a private equity group including KKR & Co  plunged in their trading debut on Tuesday  underscoring tepid investor demand for the deal.",
        "date": "11012016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR-backed COFCO Meat plunges 17.5 pct in afternoon trade in HK debut "
    },
    {
        "content": "TOKYO  Nov 2 U.S. buyout firm KKR & Co  is no longer in the bidding to buy Takata Corp  the Japanese parts maker at the centre of the world's biggest auto recall  according to a person briefed on the bidding process.",
        "date": "11022016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR no longer in bidding for Japan's Takata - source "
    },
    {
        "content": "TOKYO  Nov 2 U.S. buyout firm KKR & Co  is no longer in the bidding to buy Takata Corp  the Japanese parts maker at the centre of the world's biggest auto recall  said a person who was briefed on the bidding process.",
        "date": "11022016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR no longer in bidding for Japan's Takata - source "
    },
    {
        "content": "* KKR & Co drops from bidding for Takata Corp - Bloomberg  citing sources",
        "date": "11022016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR drops from bidding for Takata - Bloomberg  citing sources "
    },
    {
        "content": "* Nissan to pick KKR as preferred bidder for 41 pct stake-Nikkei",
        "date": "10282016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "UPDATE 2-KKR to be preferred bidder for Nissan supplier Calsonic in $3.8 bln deal -Nikkei "
    },
    {
        "content": "* Nissan Motor has solidified plans to sell its interest in group autoparts maker Calsonic Kansei to Kohlberg Kravis Roberts - Nikkei",
        "date": "10272016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Nissan eyes sale of Calsonic Kansei stake to KKR - Nikkei "
    },
    {
        "content": "NEW YORK Private equity firm KKR & Co LP reported higher-than-expected third-quarter earnings on Tuesday as stronger energy and credit markets boosted investment returns.",
        "date": "10252016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Buyout firm KKR's third-quarter earnings beat forecasts "
    },
    {
        "content": "TOKYO  Oct 28 Nissan Motor Co has decided to sell its entire stake in Japanese auto parts maker Calsonic Kansei Corp to U.S. private equity firm KKR &Co as part of a $3.8 billion takeover  the Nikkei daily reported  without citing its sources.",
        "date": "10282016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "CORRECTED-Japan's Nissan to sell parts maker Calsonic Kansei to KKR - Nikkei "
    },
    {
        "content": "* Says its unit forms a business alliance with Federation of National Public Service Personnel Aid Associations (KKR)  to support on clinical study net work business for KKR's hospital facilities",
        "date": "10272016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-I'rom Group unit forms business alliance with KKR "
    },
    {
        "content": "NEW YORK  Oct 25 Private equity firm KKR & Co LP  reported higher-than-expected third-quarter earnings on Tuesday as stronger energy and credit markets boosted investment returns.",
        "date": "10252016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-Buyout firm KKR's third-quarter earnings beat forecasts "
    },
    {
        "content": "NEW YORK  Oct 25 Private equity firm KKR & Co LP  reported higher-than-expected earnings on Tuesday as stronger energy and credit markets boosted investment returns.",
        "date": "10252016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Buyout firm KKR Q3 earnings beat forecasts "
    },
    {
        "content": "* KKR & Co Lp - for the quarter after-tax economic net income per adjusted unit $0.71",
        "date": "10252016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co Lp qtrly net income per unit $0.73 "
    },
    {
        "content": "NEW YORK  Oct 21 (IFR) - When private equity firm KKR & Co set its sights on a small Midwestern retailer in late 2015  it turned to some of the largest banks on Wall Street to obtain debt financing for the acquisition. It found no takers.",
        "date": "10212016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR reaps reward from going it alone "
    },
    {
        "content": "SAO PAULO  Oct 12 KKR & Co LP's  ill-fated takeover of a Brazilian data center provider has embroiled the private equity firm in a battle with the sellers in the deal as well as a key lender as it struggles to unwind the transaction on its own terms.",
        "date": "10122016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "CORRECTED-KKR battling over Brazil acquisition with sellers  bank -sources "
    },
    {
        "content": "HONG KONG  Oct 4 U.S. private equity firm KKR & Co LP has told investors it will refrain from launching a new fund targeting small- and medium-sized companies in China and will instead focus on larger  more profitable buyouts  people familiar with the plans told Reuters.",
        "date": "10042016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR backs off new China smaller-cap fund as it eyes bigger returns -sources "
    },
    {
        "content": "* Kkr & Co LP and Venado Oil and Gas announced a partnership to consolidate proven assets in Eagle Ford shale of South Texas",
        "date": "09292016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Kkr & Co LP and Venado Oil and Gas announced a partnership to consolidate proven assets in Eagle Ford shale of South Texas "
    },
    {
        "content": "* After deal  CDPQ will hold significant minority interest in capital of Sedgwick  in partnership with existing shareholders  including KKR  Source text for Eikon:  Further company coverage:",
        "date": "09282016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-CDPQ announces $500-million investment in Sedgwick "
    },
    {
        "content": "TOKYO The plan to sell beleaguered Takata Corp  to a rescuer  slated by year-end  is likely to extend into next year as some bidders want to drag the air bag maker through bankruptcy to wipe out most of its debt  people with knowledge of the matter said.",
        "date": "09262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Takata's search for a savior could drag into next year: sources "
    },
    {
        "content": "Sept 21 Harley-Davidson Inc. shares jumped nearly 7 percent early on Wednesday as speculation resurfaced the company was a buyout target of equity firm Kohlberg Kravis and Roberts.",
        "date": "09212016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Harley-Davidson shares pare gains after comment on buyout speculation "
    },
    {
        "content": "TOKYO  Sept 26 The plan to sell beleaguered Takata Corp to a rescuer  slated by year-end  is likely to extend into next year as some bidders want to drag the air bag maker through bankruptcy to wipe out most of its debt  people with knowledge of the matter said.",
        "date": "09262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Takata's search for a saviour could drag into next year -sources "
    },
    {
        "content": "Sept 26 Australian shares held steady on Monday  with gains in materials and financials offset by losses in consumer and health care stocks  as investors shifted their attention from central banks to American politics.",
        "date": "09262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Australia shares tread water before U.S. presidential debate; NZ eases "
    },
    {
        "content": "Sept 20 U.S. private equity firm KKR & Co LP  said Paul Yang  who has two decades of industry experience in Asia  would lead its operations in Greater China as the firm seeks to expand the scope of investments in the region.",
        "date": "09202016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "MOVES-KKR names CDFC executive as head of Greater China operations "
    },
    {
        "content": "Sept 26 Australian shares cooled after four straight sessions of gains  dragged by consumer and health care stocks and as investors shifted their attention from central banks to American politics.",
        "date": "09262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Australia shares retreat after 4-session gain  NZ stocks ease "
    },
    {
        "content": "* Says appointment of Paul Yang  current CEO of China Development Financial Corporation  as head of Greater China  effective Jan. 2017  Source text for Eikon:  Further company coverage:",
        "date": "09202016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR appoints Paul Yang as head of Greater China "
    },
    {
        "content": "* AcuFocus raises $66 million in new financing round led by KKR  Source text for Eikon:  Further company coverage:",
        "date": "09092016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-AcuFocus raises $66 mln in new financing round led by KKR "
    },
    {
        "content": "* Low global rates  Asian growth seen boosting PE fund appetite   (Adds funds raised in Asia  returns for KKR's second Asian fund  investments)",
        "date": "09072016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR prepares launch of new Asia fund  targets record $7 bln-sources "
    },
    {
        "content": "NEW YORK Private equity firm KKR & Co LP  is investing around $66 million in AcuFocus  a medical devices maker which specializes in technology that corrects near vision  a source familiar with the matter said on Friday.",
        "date": "09092016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Buyout fund KKR invests $66 million in medical device maker: source "
    },
    {
        "content": "NEW YORK  Sept 9 Private equity firm KKR & Co LP  is investing around $66 million in AcuFocus  a medical devices maker which specialises in technology that corrects near vision  a source familiar with the matter said on Friday.",
        "date": "09092016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Buyout fund KKR invests $66 mln in medical device maker-source "
    },
    {
        "content": "Sept 7 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Wednesday:",
        "date": "09072016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "HONG KONG  Sept 7 Private equity firm KKR & Co  has started talks with investors for a third Asia fund that it plans to formally launch by year-end and which aims to raise around $7 billion  a regional record  people familiar with the plans said.",
        "date": "09072016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR preparing to launch new Asia fund by year-end  seeking a record $7 bln "
    },
    {
        "content": "HONG KONG  Sept 7 KKR & Co LP and HKBN Ltd have placed final bids for the Hong Kong telecom arm of Wharf Holdings Ltd  in a deal likely to fetch $1 billion to $1.2 billion  people familiar with the matter told Reuters.",
        "date": "09072016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  HKBN place final bids for Wharf's HK telecom unit -sources "
    },
    {
        "content": "* Genesys CEO says not contemplating further large M&A   (Adds CEO quotes  background)",
        "date": "08312016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 3-Contact center company Genesys to buy Interactive Intelligence "
    },
    {
        "content": "* KKR to acquire Calabrio  a global leader in customer engagement and analytics software",
        "date": "08302016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR to acquire Calabrio "
    },
    {
        "content": "HONG KONG  Aug 30 KKR & Co has named Ming Lu as the sole head of its Asia private equity business  as other co-head David Liu has decided to leave the firm  the U.S. buyout firm said in a statement on Tuesday.",
        "date": "08302016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR names Ming Lu as sole head for Asia private equity "
    },
    {
        "content": "* Kkr expands asia pacific leadership team with new appointments in china  korea  and singapore",
        "date": "08302016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR expands Asia Pacific leadership team "
    },
    {
        "content": "* Takata hopes to narrow list to two final bidders by mid-Sept",
        "date": "08262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Takata shortlists Daicel  KKR  Ningbo  others in rescue search -sources "
    },
    {
        "content": "TOKYO  Aug 26 Takata Corp has shortlisted six or seven companies  including a competitor and private-equity funds  as potential financial investors to bail out the Japanese car-parts maker  people involved in the process said.",
        "date": "08262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Takata shortlists Daicel  KKR  Ningbo  others in rescue search -sources "
    },
    {
        "content": "Private-equity firm KKR & Co  may bid for television distributor Entertainment One Ltd  after the owner of the preschool cartoon character \"Peppa Pig\" rejected an offer from UK broadcaster ITV Plc   Bloomberg reported on Sunday.",
        "date": "08152016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR weighs bid for 'Peppa Pig' owner Entertainment One: Bloomberg "
    },
    {
        "content": "Aug 15 Britain's FTSE 100 index is seen opening slightly up on Monday  according to financial bookmakers  with futures up 0.12 percent ahead of the cash market open.",
        "date": "08152016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Aug 15 "
    },
    {
        "content": "Aug 15 Britain's FTSE 100 index is seen opening slightly up on Monday  according to financial bookmakers.          * The UK blue chip index closed flat in percentage terms at 6 916.02 points as the top share index steadied on Friday after reaching a 14-month high  though mining stocks fell following a weak set of data from China.      * GLENCORE: Swiss-based mining and trading firm Glencore said it would begin arbitration proceedings against Bolivia over the nationalization of some o",
        "date": "08152016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UK Stocks-Factors to watch on Aug 15 "
    },
    {
        "content": "Aug 14 Private-equity firm KKR & Co may bid for television distributor Entertainment One Ltd  after the owner of the preschool cartoon character \"Peppa Pig\" rejected an offer from UK broadcaster ITV Plc  Bloomberg reported on Sunday.",
        "date": "08152016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR weighs bid for 'Peppa Pig' owner Entertainment One -Bloomberg "
    },
    {
        "content": "July 29 Power producer NextEra Energy Inc  said it agreed to buy bankrupt Texas power company Energy Future Holdings Corp's stake in Oncor Electric Delivery Co in a deal valued at about $18.4 billion.",
        "date": "07292016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 4-NextEra to buy bankrupt Energy Future Holdings' Oncor stake "
    },
    {
        "content": "HONG KONG/MUMBAI Shanghai Fosun Pharmaceutical Group Co Ltd has agreed to buy an 86 percent stake in Gland Pharma - backed by KKR & Co LP - for up to $1.3 billion  the largest acquisition of an Indian company from abroad this year.",
        "date": "07282016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Fosun to buy KKR-backed Indian drugmaker for up to $1.3 billion "
    },
    {
        "content": "NEW YORK Private equity firm KKR & Co LP  reported higher-than-expected earnings on Tuesday  benefiting from a steady rise in oil prices and stronger U.S. equity and credit markets.",
        "date": "07262016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Private equity firm KKR beats second-quarter earnings forecasts "
    },
    {
        "content": "* Shanghai Fosun plans to raise $800 mln loan for deal   (Adds details)",
        "date": "07282016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 4-Fosun to buy KKR-backed Indian drugmaker for up to $1.3 bln "
    },
    {
        "content": "HONG KONG  July 28 Shanghai Fosun Pharmaceutical Group Co Ltd  has agreed to buy Gland Pharma - which is backed by KKR & Co LP - for about $1.4 billion  a person with direct knowledge of the matter said  in India's largest inbound acquisition this year.",
        "date": "07282016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Fosun agrees to buy KKR-backed Indian drug maker for $1.4 bln -source "
    },
    {
        "content": "NEW YORK  July 26 Private equity firm KKR & Co LP reported higher-than-expected earnings on Tuesday  benefiting from a steady rise in oil prices and stronger U.S. equity and credit markets.",
        "date": "07262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-Private equity firm KKR beats 2nd qtr earnings forecasts "
    },
    {
        "content": "NEW YORK  July 26 Private equity firm KKR & Co LP on Tuesday reported higher-than-expected earnings as a rebound in investment returns and stabilizing financial markets helped to lift performance.",
        "date": "07262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Private equity firm KKR's earnings beat forecasts "
    },
    {
        "content": "* Qtrly after-tax economic net income per adjusted unit $0.23",
        "date": "07262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co reports Q2 net income per common unit $0.19 "
    },
    {
        "content": "* Harley-Davidson extends summer sale as rivals keep up pressure",
        "date": "07082016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Harley moves to keep premium status  attract younger riders "
    },
    {
        "content": "* Harley-Davidson extends summer sale as rivals keep up pressure",
        "date": "07082016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Harley-Davidson extends summer sales to attract customers "
    },
    {
        "content": "Cyber-security firm Darktrace said it has raised $65 million in an equity funding round led by U.S. private equity firm KKR & Co LP  valuing the company at more than $400 million.",
        "date": "07062016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Darktrace raises $65 mln in funding round led by KKR "
    },
    {
        "content": "* KKR & Co.'s agreement to acquire Epicor Software Corp from Apax Partners is valued at $3.3 billion - Bloomberg  citing sources  Source text : (http://bloom.bg/29gfZaI) Further company coverage:",
        "date": "07052016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR's agreement to acquire Epicor Software from Apax Partners is valued at $3.3 bln - Bloomberg  citing sources "
    },
    {
        "content": "* KKR's Henry Mcvey says \"despite negative overhang of Brexit  we are not yet calling for a recession and/or bear market\"",
        "date": "06302016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR's new mid-year report discusses global macro trends "
    },
    {
        "content": "* Resource Environmental Solutions receives investment from kkr  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06302016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-Resource Environmental receives investment from KKR "
    },
    {
        "content": "June 30 British insurer esure Group Plc  denied on Thursday a report that it been approached with a potential takeover offer.",
        "date": "06302016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UK insurer esure says hasn't received takeover approach "
    },
    {
        "content": "NEW YORK  June 27 U.S. private equity firm KKR & Co LP said it has invested in ecological solutions provider Resource Environmental Solutions (RES).",
        "date": "06272016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR invests in ecological solutions firm "
    },
    {
        "content": "* Fund's primary investing activity will be ownership of real property or entities where primary value resides in real property",
        "date": "06212016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR closes first european real estate fund at $739 million "
    },
    {
        "content": "* Says it is offering 6.2 million of its 6.50 pct Series B preferred units - SEC filing  Source: (http://1.usa.gov/21l0O02)  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06142016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co says offering 6.2 mln of its 6.50 pct Series B preferred units - SEC filing "
    },
    {
        "content": "SEOUL  June 15 South Korean retail group E-Land said on Wednesday it signed a binding memorandum of understanding (MOU) to sell hypermarket chain Kim's Club to U.S. private equity fund KKR & Co LP without disclose the price of the deal.",
        "date": "06152016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "S.Korea's E-Land signs accord to sell hypermarket chain to KKR "
    },
    {
        "content": "* Files for potential series B preferred units offering; size not disclosed - SEC filing  Source - (http://bit.ly/1VV4kPh) Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06132016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR & Co LP files for potential series B preferred units offering: size not disclosed - SEC filing "
    },
    {
        "content": "HONG KONG  June 13 Hong Kong tycoon Peter Woo's Wharf Holdings Ltd plans to sell its telecoms business in a deal that could be worth more than $1 billion  people familiar with the matter said  and has asked more than a dozen potential suitors  including both giant Chinese insurers and Western buyout firms  to submit bids.",
        "date": "06132016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "REFILE-EXCLUSIVE-HK's Wharf Holdings seeks buyers for telecoms unit  sale may fetch more than $1 bln -sources "
    },
    {
        "content": "* Recalls mount after Takata declared more airbags defective   (Updates recalled vehicle count  adds details on global recall)",
        "date": "06092016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Honda recalls more vehicles in Japan over Takata air bags "
    },
    {
        "content": "TOKYO Takata Corp's  external steering committee charged with developing a restructuring plan for the embattled auto parts maker is talking with \"several funds\" including Kohlberg Kravis Roberts (KKR)   a source with knowledge of the matter said.",
        "date": "05262016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Takata steering committee talking with KKR  several other funds: source "
    },
    {
        "content": "TOKYO  May 26 Takata Corp's external steering committee charged with developing a restructuring plan for the embattled auto parts maker is talking with \"several funds\" including Kohlberg Kravis Roberts (KKR)  a source with knowledge of the matter said.",
        "date": "05262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Takata steering committee talking with KKR  several other funds -source "
    },
    {
        "content": "TOKYO  May 26 U.S. investment fund Kohlberg Kravis Roberts (KKR) is interested in offering financial support to embattled air bag maker Takata Corp  Japan's Nikkei reported on Thursday.",
        "date": "05262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR interested in becoming financial sponsor to Takata - Nikkei "
    },
    {
        "content": "May 19 The following bids  mergers  acquisitions and disposals were reported by 1340 GMT on Thursday:",
        "date": "05192016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK/SINGAPORE Singapore state investor Temasek Holdings and a consortium that includes China Investment Corp (CIC) and KKR & Co  have advanced to a second round of bidding for a minority stake in Yum Brands Inc's   China unit  people familiar with the matter told Reuters.",
        "date": "05192016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Temasek  CIC-KKR advance to second round of Yum China stake sale: sources "
    },
    {
        "content": "* Yum shares have jumped 9.7 pct this year   (Adds China performance  comment  Temasek consumer deals)",
        "date": "05192016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Temasek  CIC-KKR advance to 2nd round of Yum China stake sale -sources "
    },
    {
        "content": "NEW YORK/SINGAPORE  May 19 Singapore's Temasek Holdings and a consortium that includes China Investment Corp and KKR & Co have advanced to a second round of bidding for a minority stake in Yum Brands China unit  people familiar with the matter told Reuters.",
        "date": "05192016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Temasek  CIC-KKR advance to second round of Yum China stake sale -sources "
    },
    {
        "content": "* Further expansion of its pillarstone platform in europe through signing of a binding agreement with Alpha Bank and Eurobank in greece",
        "date": "05172016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR expands Pillarstone platform into Greece "
    },
    {
        "content": "NEW YORK Choppy financial markets nudged private equity firm KKR & Co LP  into its second quarterly loss in less than a year on Monday  while a tough investment environment led to its undeployed capital soaring to a record $35 billion.",
        "date": "04252016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR slips into quarterly loss as market turbulence bites "
    },
    {
        "content": "NEW YORK  April 25 Choppy financial markets nudged private equity firm KKR & Co LP into its second quarterly loss in less than a year on Monday  while a tough investment environment led to its undeployed capital soaring to a record $35 billion.",
        "date": "04252016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-KKR slips into quarterly loss as market turbulence bites "
    },
    {
        "content": "NEW YORK  April 25 Private equity firm KKR & Co LP reported its second loss in quarterly earnings in less than a year on Monday as volatile financial markets dragged on the value of its investments.",
        "date": "04252016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR posts loss in Q1 as choppy financial market bites "
    },
    {
        "content": "April 18 China Investment Corp  China's state-owned sovereign wealth fund  is backing a group of investors who have expressed interest in buying a majority stake in Yum Brands Inc's China unit  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04192016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "China sovereign fund to seek majority control of Yum unit-Bloomberg "
    },
    {
        "content": "* Energy services group  llc says terms of investment were not disclosed.  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04142016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Energy Services Group announces strategic investment from Accel-KKR; terms not disclosed "
    },
    {
        "content": "April 14 Academy Sports + Outdoors and Dick's Sporting Goods Inc have expressed interest in buying the assets of rival U.S. retailer Sports Authority Inc that are on sale in a bankruptcy auction  according to people familiar with the matter.",
        "date": "04142016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Dick's  Academy Sports eye Sports Authority assets -sources "
    },
    {
        "content": "HONG KONG McDonald's Corp  is targeting private equity firms  including Bain Capital  MBK Partners  TPG Capital Management and Chinese state-backed conglomerate China Resources (Holdings) for its planned sale of 2 800 restaurants in North Asia  people familiar with the matter told Reuters.",
        "date": "04142016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "McDonald's targeting buyout firms as it seeks to sell North Asia stores "
    },
    {
        "content": "NEW YORK  April 15 Private equity firm KKR & Co took the lead from investment banks constrained by regulation to arrange a US$325m dividend recapitalization loan for insurance claims services provider Sedgwick Claims Management  which is the first large dividend deal of 2016  as volatility continues to make it difficult for some banks to price risk.",
        "date": "04152016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "LPC: KKR brings back dividend deals with US$325m Sedgwick loan "
    },
    {
        "content": "HONG KONG  April 15 Global buyout firm Advent International and U.S.-based Baxter International are among suitors preparing to submit separate bids to buy unlisted Indian drugmaker Gland Pharma Ltd  three people with direct knowledge of the matter told Reuters.",
        "date": "04152016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Advent  Baxter set to submit bids for India's Gland Pharma -sources "
    },
    {
        "content": "SEOUL  March 28 South Korean retail group E-Land said on Monday it picked KKR & Co LP as preferred bidder for hypermarket chain Kim's Club.",
        "date": "03282016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "S.Korea E-Land picks KKR as preferred bidder for hypermarket chain "
    },
    {
        "content": "TOKYO Yokohama Rubber Co Ltd  said on Friday it had agreed to buy Alliance Tire Group B.V. from private equity firm KKR & Co LP  and others for about $1.2 billion in a bid to expand its commercial tire business.",
        "date": "03252016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Yokohama Rubber to buy Alliance Tire Group for about $1.2 billion "
    },
    {
        "content": " ",
        "date": "03242016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "UPDATE 4-Yum in talks with KKR  Hopu  to sell stake in China unit-sources "
    },
    {
        "content": "BERLIN Germany will ensure that its security interests are protected even after the sale of Airbus Group's  defense electronics business to private equity firm KKR   a spokeswoman for the Economy Ministry said on Monday.",
        "date": "03212016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Germany wants to safeguard security interests after Airbus unit sale "
    },
    {
        "content": "Yum Brands Inc  is in talks with private equity company KKR & Co LP  and others about a possible sale of a nearly 20 percent stake in its China business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "03232016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Yum in talks with KKR  others to sell stake in China unit: WSJ "
    },
    {
        "content": "TOKYO  March 25 Yokohama Rubber Co Ltd  said on Friday it had agreed to buy Alliance Tire Group B.V. from private equity firm KKR & Co LP and others for about $1.2 billion in a bid to expand its commercial tyre business.",
        "date": "03252016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Yokohama Rubber to buy Alliance Tire Group for about $1.2 bln "
    },
    {
        "content": "SINGAPORE/HONG KONG Yum Brands Inc   owner of KFC and Pizza Hut  is in talks with private equity firms including KKR & Co LP  and Hopu Investments to sell a minority stake in its China operations as it prepares to spin off the once booming unit  two sources familiar with the plans said on Thursday.",
        "date": "03242016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Yum in talks with KKR  Hopu  to sell stake in China unit: sources "
    },
    {
        "content": "March 23 Yum Brands Inc  the owner of the KFC and Pizza Hut chains  is in talks with private equity company KKR & Co LP and others about a possible sale of a 19.9 percent stake in its China business  CNBC reported  citing Dow Jones.",
        "date": "03232016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Yum in talks with KKR to sell stake in China unit-CNBC citing DJ "
    },
    {
        "content": "* Western fast food companies battling slowing China sales   (Adds analyst comment  context  Temasek declining to comment)",
        "date": "03242016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 5-Yum in talks with KKR  Hopu  to sell stake in China unit-sources "
    },
    {
        "content": "SINGAPORE/HONG KONG  March 24 Private equity firm Hopu Investments is among the investors that Yum Brands Inc  is in talks to sell a minority stake in its China unit to  sources familiar with the matter told Reuters.",
        "date": "03242016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Hopu  KKR among investors in talks to buy stake in Yum's China unit -sources "
    },
    {
        "content": "NEW YORK Private equity firm KKR & Co LP  said on Tuesday it is investing $45 million into California-based medical device maker Spirox Inc with a group of other investors  the latest in a string of similar deals in the sector.",
        "date": "03152016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR leads $45 million investment in medical device maker "
    },
    {
        "content": "NEW YORK  March 15 Private equity firm KKR & Co LP said on Tuesday it is investing $45 million into California-based medical device maker Spirox Inc with a group of other investors  the latest in a string of similar deals in the sector.",
        "date": "03152016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR leads $45 mln investment in medical device maker "
    },
    {
        "content": "* Toshiba plans to sell entire unit to bolster finances -sources",
        "date": "02292016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Toshiba to sell entire medical unit  deal may see aggressive bids -sources "
    },
    {
        "content": "TOKYO  Feb 29 Struggling Toshiba Corp  plans to sell its entire medical equipment unit rather than just a controlling stake  people familiar with matter said  adding that aggressive bidding could value the business at much more than initial estimates of $3.5 billion.",
        "date": "02292016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Toshiba to sell entire medical unit  deal may see aggressive bids -sources "
    },
    {
        "content": "HONG KONG KKR & Co LP  bought a 10 percent stake in India's Max Financial Services  for about $140 million  the latest foreign investor to bet on the country's booming life insurance market.",
        "date": "02182016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR bets on Indian life insurance with 10 percent stake in Max Financial "
    },
    {
        "content": "NEW YORK KKR & Co LP  posted weaker-than-expected fourth-quarter earnings on Thursday after losses in its credit and hedge fund investments offset solid returns from private equity holdings.",
        "date": "02112016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR results miss forecast  but private equity arm shines "
    },
    {
        "content": "NEW YORK  Feb 11    KKR & Co LP posted weaker-than-expected fourth-quarter earnings on Thursday after losses in its credit and hedge fund investments offset solid returns from private equity holdings.",
        "date": "02112016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR results miss forecast  but private equity arm shines "
    },
    {
        "content": "NEW YORK  Feb 11 KKR & Co LP posted weaker-than-expected fourth-quarter earnings on Thursday after losses in its credit and hedge fund investments offset solid returns from its private equity holdings.",
        "date": "02112016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR Q4 results miss forecast but private equity arm shines "
    },
    {
        "content": "HONG KONG  Feb 18 Private equity firms KKR & Co LP said on Thursday it bought a 10 percent stake in Max Financial Services for an undisclosed sum  looking to benefit from \"robust growth\" in India's life insurance market.",
        "date": "02182016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR bets on Indian life insurance with 10 pct stake in Max Financial "
    },
    {
        "content": "* Signs three agreements to acquire a combined 50 percent stake in Sweden's Välinge  a Swedish industrial R&D company founded and owned by the Pervan family",
        "date": "02092016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR to acquire a combined 50 percent stake of Swedish industrial R&D firm Valinge "
    },
    {
        "content": "Feb 2 Marc Lipschultz  the head of energy investments at KKR & Co LP who helped put together the world's largest leveraged buyout only to see it go bust  is leaving to start a credit fund  the private equity firm announced to its fund investors.",
        "date": "02032016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR's energy chief Lipschultz leaves to start new fund "
    },
    {
        "content": "NEW YORK  Jan 26 U.S. private equity firm KKR & Co said on Tuesday it led a group investing $20 million in U.S. cloud services provider Jitterbit Inc.",
        "date": "01262016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR invests in cloud company Jitterbit "
    },
    {
        "content": "BEIJING/SHANGHAI KKR & Co said it had partnered with one of China's biggest state-owned bad debt managers to take advantage of opportunities in the country's growing market for distressed debt  particularly in the property sector.",
        "date": "01222016",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR  China Orient team up to invest in property-related bad debt "
    },
    {
        "content": "* Sector dominated by China Big Four asset management firms   (Adds details of venture)",
        "date": "01222016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR  China Orient team up to invest in property-related bad debt "
    },
    {
        "content": "SHANGHAI  Jan 22 KKR & Co said on Friday it had teamed up with a large state-owned Chinese asset manager and a local investment manager to co-invest in credit and distressed opportunities in China.",
        "date": "01222016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  COAMI  COS-Capital team up to explore China opportunities "
    },
    {
        "content": "NEW YORK  Jan 15 For KKR & Co LP  the private equity firm behind some of the world's largest leveraged buyouts  the acquisition of U.S. outdoor retailer Mills Fleet Farm for a little more than $1.2 billion should have been a formality.",
        "date": "01152016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "INSIGHT-Private equity deals hit as banks curb lending for leveraged buyouts "
    },
    {
        "content": "TOKYO A $3 billion restructuring plan for Japanese electronics firm Sharp Corp is likely to be finalised as early as this week  a person with direct knowledge of the discussions said on Tuesday.",
        "date": "01122016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Sharp $3 billion overhaul plan could be concluded this week: source "
    },
    {
        "content": "* Latest rescue would split LCD business  merge with Japan Display   (Adds details  context)",
        "date": "01122016",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Sharp $3 bln overhaul plan could be concluded this week- source "
    },
    {
        "content": "TOKYO U.S. buyout firm KKR & Co  is among other private equity firms which are interested in investing in Sharp Corp   Nikkei business daily reported Saturday  without citing sources.",
        "date": "12192015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR among suitors to buy Sharp's business: Nikkei "
    },
    {
        "content": "TOKYO  Dec 19 U.S. buyout firm KKR & Co  is among other private equity firms which are interested in investing in Sharp Corp  Nikkei business daily reported Saturday  without citing sources.",
        "date": "12192015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR among suitors to buy Sharp's business-Nikkei "
    },
    {
        "content": "Buyout firm KKR & Co  is in the lead to acquire U.S. outdoor retailer Mills Fleet Farm for more than $1.2 billion  including debt  according to people familiar with the matter  defying a slowdown in private equity dealmaking.",
        "date": "12092015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR in the lead to acquire U.S. retailer Mills Fleet Farm: sources "
    },
    {
        "content": "Dec 9 Buyout firm KKR & Co is in the lead to acquire U.S. outdoor retailer Mills Fleet Farm for more than $1.2 billion  including debt  according to people familiar with the matter  defying a slowdown in private equity dealmaking.",
        "date": "12092015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR in the lead to acquire U.S. retailer Mills Fleet Farm - sources "
    },
    {
        "content": "WILMINGTON  Del.  Dec 2 The U.S. judge overseeing the Energy Future Holdings Corp bankruptcy will announce on Thursday morning whether he will approve a Chapter 11 exit plan for the company  Texas's biggest power company  the judge said on Wednesday.",
        "date": "12022015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Ruling on Energy Future bankruptcy exit plan set for Thursday "
    },
    {
        "content": "Buyout firms KKR & Co LP   Thoma Bravo LLC and Vista Equity Partners Management LLC are competing for $4 billion worth of Dell Inc's assets  people familiar with the matter said  as the computer maker steps up asset sales.",
        "date": "12022015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Exclusive: KKR  Thoma Bravo  Vista eye $4 billion Dell assets - sources "
    },
    {
        "content": "SEOUL  Dec 3 KKR & Co LP and Carlyle Group LP are among the private equity firms considering buying Doosan Infracore's machine tools business  the Korea Economic Daily newspaper reported on Thursday.",
        "date": "12032015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR  Carlyle considering buying Doosan machine tools unit-Korea Economic Daily "
    },
    {
        "content": "Nov 16 Private equity firm KKR & Co LP  said on Monday it has agreed to invest $35 million in Australian handheld ultrasound device maker Signostics Ltd  in a deal that underscores the potential of portable diagnostic technology.",
        "date": "11162015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR to invest $35 million in handheld ultrasound device maker "
    },
    {
        "content": "MUMBAI  Nov 17 Global private-equity firm KKR & Co LP invested an undisclosed sum in Indian wealth manager and financial adviser Avendus Capital  the companies said on Tuesday.",
        "date": "11172015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR invests in Indian financial adviser Avendus Capital "
    },
    {
        "content": "Nov 17 The following bids  mergers  acquisitions and disposals were reported by 1100 GMT on Tuesday:",
        "date": "11172015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Private equity firm KKR & Co LP  reported a wider than expected third-quarter loss on Tuesday  as a stock market rout weighed on the value of its assets  yet it sought to please its shareholders by announcing a $500 million stock repurchase.",
        "date": "10272015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR reports third-quarter loss  announces share buyback "
    },
    {
        "content": "Oct 27 Private equity firm KKR & Co LP  reported a wider than expected third-quarter loss on Tuesday  as a stock market rout weighed on the value of its assets  yet it sought to please its shareholders by announcing a $500 million stock repurchase.",
        "date": "10272015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "CORRECTED-KKR reports third-quarter loss  announces share buyback "
    },
    {
        "content": "-- Note: Reuters has not verified this story and does not vouch for its accuracy",
        "date": "10222015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "MEDIA-Kohlberg Kravis investing $50 mln in Cohera Medical- NYT "
    },
    {
        "content": "Oct 14 Jarden Corp  owner of Sunbeam kitchen appliances and Coleman outdoor gear  said it would buy Jostens Inc  a maker of class rings and yearbooks  in a deal worth $1.5 billion.",
        "date": "10142015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "CORRECTED-UPDATE 3-Jarden to buy school products maker Jostens for $1.5 bln "
    },
    {
        "content": "Neiman Marcus Group Inc  the U.S. luxury specialty department store chain that registered with regulators in August for an initial public offering  has pushed back its stock market flotation to 2016  according to people familiar with the matter.",
        "date": "10132015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Exclusive: Neiman Marcus delays IPO amid stock market volatility "
    },
    {
        "content": "Oct 9 PetSmart Inc's talks to acquire Petco Holdings Inc have stalled over disagreements about sharing the risk of getting the deal approved by U.S. antitrust authorities  people familiar with the matter said on Friday.",
        "date": "10102015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "CORRECTED-PetSmart-Petco merger talks stall over antitrust risk -sources "
    },
    {
        "content": "PetSmart Inc's talks to acquire Petco Holdings Inc have stalled over disagreements about sharing the risk of getting the deal approved by U.S. antitrust authorities  people familiar with the matter said on Friday.",
        "date": "10102015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "PetSmart-Petco merger talks stall over antitrust risk -sources "
    },
    {
        "content": "LAGOS  Oct 6 U.S. private equity firm KKR & Co LP is considering investing around $100 million in Africa within a year  a senior executive said on Tuesday.",
        "date": "10062015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR to invest $100 million in Africa within a year  make Nigeria regional base "
    },
    {
        "content": "* Deal comes amid low metals prices   (Adds analyst comment and share price move)",
        "date": "10012015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR buys 10 pct stake in Australia copper miner Oz Minerals "
    },
    {
        "content": "* Plans to use proceeds to pay down debt   (Adds details  background)",
        "date": "10012015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-Payment processor First Data to raise up to $3.2 bln in IPO "
    },
    {
        "content": "SYDNEY  Oct 1 U.S. private equity firm KKR & Co LP said on Thursday it had bought a 10 percent stake in Australian copper miner Oz Minerals Ltd for an undisclosed sum.",
        "date": "10012015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR says bought 10 pct of Australian copper miner Oz Minerals "
    },
    {
        "content": "SYDNEY  Oct 1 Shares in Australian copper miner Oz Minerals Ltd jumped as much as 14 percent on Thursday after an unsourced media report said U.S. private equity giant KKR & Co LP was attempting to buy a 10 percent stake.",
        "date": "10012015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Australia's Oz Minerals shares soar on speculation KKR could up stake "
    },
    {
        "content": "Oil and gas producer Samson Resources Corp filed for Chapter 11 bankruptcy protection on Wednesday to carry out a debt-cutting plan reached with key lenders  who will assume control of the company.",
        "date": "09172015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR's Samson Resources files for bankruptcy  lenders to take control "
    },
    {
        "content": "Sept 17 Oil and gas producer Samson Resources Corp filed for Chapter 11 bankruptcy protection on Wednesday to carry out a debt-cutting plan reached with key lenders  who will assume control of the company.",
        "date": "09172015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR's Samson Resources files for bankruptcy  lenders to take control "
    },
    {
        "content": "Sept 16 Oil and gas producer Samson Resources Corp filed for Chapter 11 bankruptcy protection on Wednesday to carry out a debt-cutting plan reached with key lenders  who will assume control of the company.",
        "date": "09172015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Samson Resources files for bankruptcy "
    },
    {
        "content": "KKR & Co  and Apollo Global Management  are seeking to acquire General Electric Co's  inventory finance arm  Bloomberg reported on Friday.",
        "date": "09112015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR  Apollo Global seek to buy GE's inventory finance arm "
    },
    {
        "content": "LONDON/BENGALURU American private equity firm KKR & Co  is buying a stake in European hedge fund operator Marshall Wace  raising its bets on the rapidly growing $3 trillion industry.",
        "date": "09092015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR to buy stake in Marshall Wace in hedge fund drive "
    },
    {
        "content": "* Deal ups KKR's bets on lucrative hedge fund sector   (Adds quotes from interviews  details  background)",
        "date": "09092015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-KKR to buy stake in Marshall Wace in hedge fund drive "
    },
    {
        "content": "Sept 9 Private equity firm  KKR & Co LP  said it would acquire a 24.9 percent stake in London-based hedge fund Marshall Wace LLP.",
        "date": "09092015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "REFILE-KKR to acquire 24.9 pct stake in UK hedge fund Marshall Wace "
    },
    {
        "content": "KKR & Co's Samson Resources Corp said on Friday it finalized a restructuring plan with key creditors that it expects to implement under a Chapter 11 bankruptcy reorganization and which will give the creditors control of the company.",
        "date": "08152015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR's Samson in restructuring plan  to implement via Chapter 11 "
    },
    {
        "content": "Aug 14 KKR & Co's Samson Resources Corp said on Friday it finalized a restructuring plan with key creditors that it expects to implement under a Chapter 11 bankruptcy reorganization and which will give the creditors control of the company.",
        "date": "08152015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR's Samson in restructuring plan  to implement via Chapter 11 "
    },
    {
        "content": "Aug 14 KKR & Co's Samson Resources Corp may file for Chapter 11 bankruptcy protection by mid-September  the Wall Street Journal reported on Friday  citing sources familiar with the matter.",
        "date": "08142015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR's Samson Resources to file for bankruptcy by Sept 16 - WSJ "
    },
    {
        "content": "WASHINGTON Jerome Kohlberg Jr.  a founder of investment firm Kohlberg Kravis Roberts & Co and a pioneer of the leveraged buyout  died on Thursday at his home in Martha's Vineyard  Massachusetts  aged 90.",
        "date": "08012015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Private equity pioneer Jerome Kohlberg dies "
    },
    {
        "content": "WASHINGTON  Aug 1 Jerome Kohlberg Jr.  a founder of investment firm Kohlberg Kravis Roberts & Co and a pioneer of the leveraged buyout  died on Thursday at his home in Martha's Vineyard  Massachusetts  aged 90.",
        "date": "08012015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-Private equity pioneer Jerome Kohlberg dies "
    },
    {
        "content": "DUBLIN  July 28 U.S. private equity firm KKR & Co LP and Ireland's new strategic investment fund will launch a 500 million euro ($552 million) joint venture to provide credit for builders amid a severe housing shortage.",
        "date": "07282015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR and Irish investment fund bid to revive house building "
    },
    {
        "content": "July 23 KKR & Co LP said on Thursday that its second-quarter earnings rose 67 percent year-on-year  reaching a quarterly record that far exceeded most analysts' expectations  as its private equity funds appreciated far more than the wider market.",
        "date": "07232015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Private equity firm KKR second-quarter earnings hit record "
    },
    {
        "content": "July 23 Diversified manufacturer 3M Co  reported weaker-than-expected second-quarter sales on Thursday and said it lowered its full-year forecasts for revenue and earnings due to sluggish global growth.",
        "date": "07232015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-3M cuts 2015 forecast  citing sluggish global growth "
    },
    {
        "content": "* 41 pct gain in CICC value in past 5 yrs seen low for TPG  KKR",
        "date": "07242015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "China's oldest investment bank CICC fails to pay off for KKR  TPG "
    },
    {
        "content": "TOKYO  July 22 Private equity firm KKR & Co  said on Wednesday it has hired Atsushi Saito  the former chief executive of Tokyo bourse operator Japan Exchange Group Inc  as chairman of its Japan operations.",
        "date": "07222015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "MOVES-KKR hires ex-Tokyo bourse head Saito as Japan chairman "
    },
    {
        "content": "July 23 KKR & Co LP's Embarcadero Maritime unit will pay $254.5 million to buy 18 dry bulk and container ships from Commerzbank AG's Hanseatic Ship Asset Management GmbH  the companies said on Thursday.",
        "date": "07232015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR-backed venture acquires Commerzbank ships for $254.5 million "
    },
    {
        "content": "* CICC Q1 profits jump because of higher China trading volumes",
        "date": "07232015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-China's CICC says Q1 profit doubled ahead of planned $1 bln HK IPO "
    },
    {
        "content": "TOKYO Permira said on Wednesday that it had hired ex-KKR deal-maker Ryotaro Fujii to head its Japan operations  as the European private equity firm chases billion-dollar deals in the world's third-biggest economy.",
        "date": "07152015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Permira hires ex-KKR deal-maker Fujii to head Japan operations "
    },
    {
        "content": "SYDNEY Macquarie Group  U.S. private equity giant Carlyle and China's HNA Group are among the bidders shortlisted for ANZ Banking Group's $6 billion-plus car and equipment loan book  five sources with direct knowledge of the matter said on Friday.",
        "date": "07172015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Macquarie  Carlyle among shortlisted bidders for $6.4 billion ANZ car finance unit: sources "
    },
    {
        "content": "TOKYO  July 15 Permira said on Wednesday that it had hired ex-KKR deal-maker Ryotaro Fujii to head its Japan operations  as the European private equity firm chases billion-dollar deals in the world's third-biggest economy.",
        "date": "07152015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Permira hires ex-KKR deal-maker Fujii to head Japan ops "
    },
    {
        "content": "SYDNEY  July 17 Macquarie Group  U.S. private equity giant Carlyle and China's HNA Group  are among the bidders shortlisted for ANZ Banking Group's $6 billion-plus car and equipment loan book  five sources with direct knowledge of the matter said on Friday.",
        "date": "07172015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Macquarie  Carlyle among shortlisted bidders for $6.4 bln ANZ car finance unit-sources "
    },
    {
        "content": "SEOUL Private equity firm KKR & Co  has re-entered the list of eligible bidders for Tesco's  South Korean business after offering to increase its bid price  the Korea Economic Daily reported on Tuesday.",
        "date": "07072015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR rejoins bidding process for Tesco's South Korea unit: Korea Economic Daily "
    },
    {
        "content": "LONDON  July 7 Britain's FTSE 100 index is seen opening about 12 points higher  or up 0.2 percent on Tuesday  according to financial bookmakers. For more on the factors affecting European stocks  please click on",
        "date": "07072015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UK Stocks-Factors to watch on July 7 "
    },
    {
        "content": "SEOUL  July 7 Private equity firm KKR & Co  has re-entered the list of eligible bidders for Tesco's  South Korean business after offering to increase its bid price  the Korea Economic Daily reported on Tuesday.",
        "date": "07072015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR rejoins bidding process for Tesco's S.Korea unit-Korea Economic Daily "
    },
    {
        "content": "WASHINGTON  June 29 Private equity giant Kohlberg Kravis Roberts & Co. will pay nearly $30 million to settle civil charges that it misallocated more than $17 million in expenses and breached its fiduciary duty to clients  U.S. regulators said.",
        "date": "06292015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR to pay $30 mln to settle U.S. SEC charges over misallocating expenses "
    },
    {
        "content": "WASHINGTON Private equity giant Kohlberg Kravis Roberts & Co. will pay nearly $30 million to settle civil charges that it misallocated more than $17 million in expenses and breached its fiduciary duty to clients  U.S. regulators said.",
        "date": "06292015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR to pay $30 million to settle SEC charges over misallocating expenses "
    },
    {
        "content": "WASHINGTON  June 29 Private equity giant Kohlberg Kravis Roberts & Co. will pay nearly $30 million to settle civil charges that it misallocated more than $17 million in expenses and breached its fiduciary duty to clients  U.S. regulators said.",
        "date": "06292015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 3-KKR to pay $30 mln to settle U.S. SEC charges over misallocating expenses "
    },
    {
        "content": "* Launches a pan-european platform to support companies and actively manage bank assets",
        "date": "06252015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-KKR launches pan-European platform to support Italian companies "
    },
    {
        "content": "SYDNEY  June 29 Shares of Australian No. 1 supermarket operator Woolworths Ltd eased on Monday as speculation it may be the object of a takeover approach from U.S. buyout firm KKR & Co LP failed to gather momentum.",
        "date": "06292015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Australia's Woolworths shares see-saw on takeover talk "
    },
    {
        "content": "SEOUL Snack maker Orion Corp  said it had submitted a preliminary bid for British retailer Tesco's  South Korean unit Homeplus Co Ltd  joining several private equity firms in vying for what could be a $6 billion deal.",
        "date": "06252015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Snack maker Orion  buyout firms make initial bids for Tesco South Korea unit "
    },
    {
        "content": "* Orion expected to team up with pvt equity for deal - analysts   (Adds details of private equity bids and analyst comment)",
        "date": "06252015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Snack maker Orion  buyout firms make initial bids for Tesco S.Korea unit "
    },
    {
        "content": "3M Co  on Tuesday struck a deal to boost its presence in worker protection gear by buying Capital Safety from private equity firm KKR & Co  for $1.8 billion  the U.S. diversified manufacturer’s largest-ever purchase.",
        "date": "06232015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "3M strikes biggest-ever deal for KKR's Capital Safety "
    },
    {
        "content": "June 23 3M Co on Tuesday struck a deal to boost its presence in worker protection gear by buying Capital Safety from private equity firm KKR & Co for $1.8 billion  the U.S. diversified manufacturer's largest-ever purchase.",
        "date": "06232015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 4-3M strikes biggest-ever deal for KKR's Capital Safety "
    },
    {
        "content": "June 23 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06232015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON - President Barack Obama's quest for a Pacific Rim trade deal to strengthen U.S. ties with Asia advances  with the Senate moving toward a final vote on granting Obama the power to speed trade agreements through Congress. (USA-TRADE/ (UPDATE 2)  moved  by Krista Hughes and Richard Cowan  500 words)",
        "date": "06232015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "REUTERS BUSINESS NEWS SCHEDULE AT 1830 GMT/2:30 PM ET "
    },
    {
        "content": "June 23 3M Co  the maker of Post-it notes and Scotch tape  said it agreed to buy Capital Safety  which manufactures harnesses and safety equipment  from private equity firm KKR & Co LP in a $2.5 billion deal  including debt.",
        "date": "06232015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "3M to buy harness maker Capital Safety from KKR "
    },
    {
        "content": "SEOUL/HONG KONG  June 17 Any buyer of Tesco's  $6 billion South Korea unit will need a strategy to boost returns in a lethargic and saturated market for traditional retailers  likely involving real estate sales and a greater focus on Internet shopping.",
        "date": "06162015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Brutal retail market awaits buyer of Tesco South Korea business "
    },
    {
        "content": "FRANKFURT  June 13 The chief executive of Henkel & Co KGaA AG poured cold water on speculation the consumer goods maker was preparing to buy hair care firm Wella from Procter & Gamble Co  saying his company didn't need big acquisitions to grow.",
        "date": "06132015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-Henkel CEO downplays Wella takeover speculation - paper "
    },
    {
        "content": "FRANKFURT  June 13 The chief executive of Henkel & Co KGaA AG poured cold water on speculation the consumer goods maker was preparing to buy hair care firm Wella from Procter & Gamble Co  saying his company didn't need big acquisitions to grow.",
        "date": "06132015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "Henkel CEO downplays Wella takeover speculation - paper "
    },
    {
        "content": "* Proposed placing of 108 million ordinary shares in Pets At Home Group Plc",
        "date": "06082015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BRIEF-Kohlberg Kravis Roberts to sell 108 mln shares in Pets At Home - bookrunner "
    },
    {
        "content": "HONG KONG/SEOUL British retailer Tesco Plc  has invited at least six firms including KKR & Co  and Carlyle Group  to bid for its South Korean unit Homeplus  valued at about $6 billion  people familiar with the matter told Reuters.",
        "date": "06092015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR  Carlyle among firms invited to bid for Tesco's South Korea unit: sources "
    },
    {
        "content": "* Growth opportunities seen limited but property assets valuable",
        "date": "06092015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-KKR  Carlyle among firms invited to bid for Tesco's S.Korea unit-sources "
    },
    {
        "content": "* Funds managed and advised by Kohlberg Kravis Roberts & Co  have sold an aggregate 108 000 000 ordinary shares in capital of co at a price of 267 pence per share",
        "date": "06092015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "BRIEF-Kohlberg Kravis Roberts sold 108 mln shares in Pets At Home- bookrunner "
    },
    {
        "content": "HONG KONG  June 9 British retailer Tesco Plc  has invited about six firms including KKR & Co  and Carlyle Group to bid for its South Korean unit  valued at about $6 billion  people familiar with the matter told Reuters.",
        "date": "06092015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  Carlyle among firms invited to bid for Tesco S.Korea unit -sources "
    },
    {
        "content": "June 1 The following bids  mergers  acquisitions and disposals were reported by 2020 GMT on Monday:",
        "date": "06012015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "DUBAI KKR & Co  and Dubai-based Fajr Capital are close to buying a 25 percent stake in fashion retailer Azadea Group  said three sources aware of the matter  in what would be the U.S. private equity firm's first Middle Eastern investment.",
        "date": "06012015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  Fajr close in on stake in Mideast retailer Azadea: sources "
    },
    {
        "content": "DUBAI  June 1 KKR & Co and Dubai-based Fajr Capital are close to buying a 25 percent stake in fashion retailer Azadea Group  said three sources aware of the matter  in what would be the U.S. private equity firm's first Middle Eastern investment.",
        "date": "06012015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  Fajr close in on stake in Mideast retailer Azadea - sources "
    },
    {
        "content": "KKR & Co LP  said it would merge some of its private equity industry teams in the United States after two more of its leaders stepped down  and as it prepares the ground for raising its next flagship North American buyout fund.",
        "date": "05042015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Exclusive: KKR merges teams after more leaders step down "
    },
    {
        "content": "May 4 Artivest  a startup that gives individual investors access to private equity funds  hedge funds  and other alternative investments  said Monday it has raised $15 million in a funding round led by private equity firm KKR & Co.",
        "date": "05042015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR backs startup that gets smaller investors into alternative funds "
    },
    {
        "content": "HONG KONG  May 4 Private equity firm KKR & Co LP  launched on Monday an up to $200 million selldown in Hong Kong-listed Far East Horizon Ltd  IFR reported  citing a term sheet.",
        "date": "05042015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR launches up to $200 mln selldown in Far East Horizon -IFR "
    },
    {
        "content": "April 23 KKR & Co LP on Thursday reported a smaller-than-expected 4.9 percent year-on-year drop in first-quarter profit  as proceeds from private equity asset sales offset most credit investment losses.",
        "date": "04232015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR's first-quarter earnings drop 4.9 pct on credit losses "
    },
    {
        "content": "Jeff Rowbottom  KKR & Co LP's head of capital markets for the Americas  will resign to join Israeli venture capital firm Pontifax Group.",
        "date": "04212015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR's Americas capital markets head Rowbottom to leave "
    },
    {
        "content": "April 21 Jeff Rowbottom  KKR & Co LP's  head of capital markets for the Americas  will resign to join Israeli venture capital firm Pontifax Group.",
        "date": "04212015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-MOVES-KKR's Americas capital markets head Rowbottom to leave "
    },
    {
        "content": "April 21 Jeff Rowbottom  KKR & Co LP's  head of capital markets for the Americas  will resign to join Israeli venture capital firm Pontifax Group.",
        "date": "04212015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "MOVES-KKR's Americas capital markets head Rowbottom to leave - Bloomberg "
    },
    {
        "content": "April 22 Private equity firm KKR & Co LP  has secured $1.7 billion for its second special situations fund  which is seeking to raise as much as $3 billion in all to invest in distressed assets  according to people familiar with the process.",
        "date": "04222015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR secures $1.7 billion for special situations fund "
    },
    {
        "content": "SEOUL Private equity firms KKR & Co LP  and Hong Kong-based Anchor Partners are in talks to buy a majority stake in Groupon Inc's  South Korean unit for around 350 billion won ($316 million)  a South Korean newspaper reported on Tuesday.",
        "date": "03312015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR in talks over Groupon's South Korean unit: Korea Economic Daily "
    },
    {
        "content": "SEOUL  March 31 Private equity firms KKR & Co LP  and Hong Kong-based Anchor Partners are in talks to buy a majority stake in Groupon Inc's South Korean unit for around 350 billion won ($316 million)  a South Korean newspaper reported on Tuesday.",
        "date": "03312015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR in talks over Groupon's S.Korean unit-Korea Economic Daily "
    },
    {
        "content": "HONG KONG Private equity firm KKR & Co LP  search engine Baidu Inc and hedge fund Coatue said on Wednesday they will jointly invest $170 million in Chinese online used-car auction firm Uxin  aiming for a piece of the booming used-car market.",
        "date": "03182015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR  Baidu  Coatue to invest $170 million in China online used-car platform "
    },
    {
        "content": "SYDNEY A group comprising KKR & Co  Varde Partners and Deutsche Bank are looking to securitize about A$7 billion ($5.33 billion) of debt they acquired from a unit of GE  three sources with knowledge of the matter said.",
        "date": "03162015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR  Varde  Deutsche seek to securitize $5.3 billion of GE Capital debt: sources "
    },
    {
        "content": "HONG KONG  March 18 Private equity firm KKR & Co LP  search engine Baidu Inc and hedge fund Coatue said on Wednesday they will jointly invest $170 million in Chinese online used-car auction firm Uxin  aiming for a piece of the booming used-car market.",
        "date": "03182015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  Baidu  Coatue to invest $170 mln in China online used-car platform "
    },
    {
        "content": "SYDNEY  March 16 A group comprising KKR & Co   Varde Partners and Deutsche Bank are looking to securitise about A$7 billion ($5.33 billion) of debt they acquired from a unit of GE  three sources with knowledge of the matter said.",
        "date": "03162015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 2-KKR  Varde  Deutsche seek to securitise A$7 bln of GE Capital debt-sources "
    },
    {
        "content": "SYDNEY  March 16 A group comprising KKR & Co   Varde Partners and Deutsche Bank are looking to securitise about A$7 billion ($5.33 billion) of debt they acquired from a unit of GE  three sources with knowledge of the matter said.",
        "date": "03162015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR  Varde  Deutsche seek to securitise A$7 bln of GE Capital debt-sources "
    },
    {
        "content": "SYDNEY  March 16 A group comprising KKR & Co   Varde Partners and Deutsche Bank are looking to securitise about A$7 billion ($5.33 billion) of debt they acquired from a unit of GE  three sources with knowledge of the matter said.",
        "date": "03162015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "RPT-KKR  Varde  Deutsche seek to securitise A$7 bln of GE Capital debt-sources "
    },
    {
        "content": "SYDNEY  March 16 A group comprising KKR & Co   Varde Partners and Deutsche Bank are looking to securitise about A$7 billion ($5.33 billion) of debt they acquired from a unit of GE  three sources with knowledge of the matter said.",
        "date": "03162015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  Varde  Deutsche seek to securitise A$7 bln of GE Capital debt-sources "
    },
    {
        "content": "SYDNEY  March 15 A consortium of private equity firm KKR & Co LP  alternative investment manager Varde Partners and Deutsche Bank has agreed to buy GE Capital's Australian and New Zealand consumer lending arm for A$8.2 billion ($6.26 billion).",
        "date": "03152015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "RPT-KKR  Varde and Deutsche buy GE Capital consumer finance arm for $6.3 bln "
    },
    {
        "content": "KKR & Co LP  is in advanced talks to acquire Air Medical Group Holdings Inc in a deal that could value the U.S. helicopter ambulance company at around $2 billion  including debt  according to people familiar with the matter.",
        "date": "03102015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Exclusive: KKR nears $2 billion deal for Air Medical - sources "
    },
    {
        "content": "SYDNEY A consortium of private equity firm KKR & Co LP   alternative investment manager Varde Partners and Deutsche Bank  has agreed to buy GE Capital's Australian and New Zealand consumer lending arm for A$8.2 billion ($6.26 billion).",
        "date": "03152015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  Varde and Deutsche buy GE Capital consumer finance arm for $6.3 billion "
    },
    {
        "content": "SYDNEY  March 15 A consortium of private equity firm KKR & Co LP  alternative investment manager Varde Partners and Deutsche Bank has agreed to buy GE Capital's Australian and New Zealand consumer lending arm for A$8.2 billion ($6.26 billion).",
        "date": "03152015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR  Varde and Deutsche buy GE Capital consumer finance arm for $6.3 bln "
    },
    {
        "content": "NEW YORK  Feb 27 Private equity firm KKR & Co LP  said on Friday its head of credit and capital markets would step down  just two years after his predecessor departed  the latest leadership change to businesses that have more than $37 billion in assets.",
        "date": "02272015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "MOVES-KKR credit investments chief steps down "
    },
    {
        "content": "KKR & Co LP  on Tuesday reported an 89 percent drop in fourth-quarter profit  much steeper than expected  becoming the latest alternative asset manager to report lower earnings because of plunging oil prices.",
        "date": "02102015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "KKR profit misses expectations due to energy exposure "
    },
    {
        "content": "Feb 10 KKR & Co LP on Tuesday reported an 89 percent drop in fourth-quarter profit  much steeper than expected  becoming the latest alternative asset manager to report lower earnings because of plunging oil prices.",
        "date": "02102015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "UPDATE 1-KKR profit misses expectations due to energy exposure "
    },
    {
        "content": "Feb 10 KKR & Co LP reported a much higher-than-expected 89 percent year-on-year drop in fourth-quarter profit on Tuesday  making it the latest alternative asset manager to report lower earnings as a result of the plunge in oil prices.",
        "date": "02102015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR misses fourth-quarter profit expectations on energy exposure "
    },
    {
        "content": "DUBLIN  Feb 2 CRH will not keep sole control of all the assets it agreed to pay Lafarge and Holcim 6.5 billion euros ($7.4 billion) for and is in talks with private equity firm KKR& Co LP to partner on some.",
        "date": "02022015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "CRH says in talks with KKR on partnering on new UK assets "
    },
    {
        "content": "NEW YORK A senior U.S. Securities and Exchange Commission official said on Thursday any enforcement cases against private equity firms over how they handled fees and expenses could take years to build.",
        "date": "01232015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "SEC official says private equity enforcement cases take time "
    },
    {
        "content": "Jan 21 Private equity firm KKR & Co LP  refunded money to investors in some of its buyout funds after U.S. regulators found it overcharged them  the Wall Street Journal reported on Wednesday  citing a pension-fund document.",
        "date": "01222015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "Private equity firm KKR refunds some fees to investors -WSJ "
    },
    {
        "content": "NEW YORK  Jan 22 A senior U.S. Securities and Exchange Commission official said on Thursday any enforcement cases against private equity firms over how they handled fees and expenses could take years to build.",
        "date": "01232015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "CORRECTED-U.S. SEC official says private equity enforcement cases take time "
    },
    {
        "content": "NEW YORK  Jan 22 A senior U.S. Securities and Exchange Commission official said on Thursday any enforcement cases against private equity firms over how they handled fees and expenses could take years to build  but that may not be necessary in many instances.",
        "date": "01222015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "U.S. SEC official sees no immediate crackdown on private equity "
    },
    {
        "content": "** Philips shares up 3.4 percent on local newspaper report of private equity interest in lighting division",
        "date": "01202015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "BUZZ-Philips shares up on report of private equity interest "
    },
    {
        "content": "Jan 12 Private-equity firm KKR & Co  appointed Haroun van Hovell as a managing director and head of its energy team in Europe  Middle East and Africa.",
        "date": "01122015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "MOVES-KKR appoints Haroun van Hovell as head of EMEA energy team "
    },
    {
        "content": "Jan 8 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01092015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "CORRECTED-MOVES- KKR  BNY Mellon  Angel CoFund  Marathon Asset (Jan 8) "
    },
    {
        "content": "Jan 8 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01082015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "MOVES- KKR  BNY Mellon  Angel CoFund  Marathon Asset "
    },
    {
        "content": "Jan 8 KKR & Co LP has hired Matt Salem and a team of debt experts from Rialto Capital Management with plans to start making real-estate debt investments for the first time since forming its property group in 2011  the Wall Street Journal reported  citing a person familiar with the matter.",
        "date": "01082015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "MOVES-KKR hires debt experts from Rialto Capital - WSJ "
    },
    {
        "content": "MUMBAI  Jan 8 Private equity fund KKR & Co LP  said on Thursday it had set up a non-banking financial company in India for lending to the real estate sector  with an investment from Singapore sovereign wealth fund GIC.",
        "date": "01082015",
        "name": "KKR & Co LP",
        "news_type": "normal",
        "symbol": "KKR",
        "title": "KKR partners GIC to set up India real estate lending company "
    },
    {
        "content": "LONDON  March 23 US private equity fund KKR  has raised a 265 million pound ($395.14 million) leveraged loan to back its acquisition of British rail ticket website thetrainline.com  two funds involved in the deal announced.",
        "date": "03232015",
        "name": "KKR & Co LP",
        "news_type": "topStory",
        "symbol": "KKR",
        "title": "TRLPC-KKR's Trainline buy backed with 265 mln stg loan "
    }
]