[
    {
        "content": "Oct 27 The city of Burnaby  British Columbia  accused Kinder Morgan Canada Ltd of disrespecting municipal regulations on Friday  after the company appealed to Canada's energy regulator for approval to start work on its Trans Mountain oil pipeline.",
        "date": "10272017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Canada's Burnaby  B.C.  hits back at Kinder Morgan in pipeline dispute "
    },
    {
        "content": "Pipeline operator Kinder Morgan Inc's  quarterly revenue edged past analysts' estimates as a rise in natural gas volumes helped offset the impact of Hurricane Harvey and loss of revenue from the divestiture of its Canadian assets.",
        "date": "10182017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan's revenue beats as natgas volumes rise "
    },
    {
        "content": "* Shares gain 1.3 aftermarket (Adds revenue estimate  shares  Kinder Morgan Canada results)",
        "date": "10182017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-Kinder Morgan's revenue beats as natgas volumes rise "
    },
    {
        "content": "* Q3 earnings per share view $0.15 -- Thomson Reuters I/B/E/S",
        "date": "10182017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan says Q3 earnings per share $0.15 "
    },
    {
        "content": "Oct 18 Pipeline operator Kinder Morgan Inc reported a 1.5 percent fall in quarterly revenue  partly due to the impact of Hurricane Harvey.",
        "date": "10182017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan 3rd-qtr revenue dips on Hurricane Harvey impact "
    },
    {
        "content": "* Kinder Morgan  DCP Midstream and Targa Resources enter into letter of intent to jointly develop Gulf Coast Express pipeline project",
        "date": "10042017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan  DCP Midstream  Targa Resources to develop GCX pipeline "
    },
    {
        "content": "CALGARY  Alberta  Sept 29 Kinder Morgan Canada Ltd's Trans Mountain pipeline expansion may be delayed if the country's energy regulator continues to bar it from installing anti-fish-spawning mats in construction areas  the company said late on Thursday.",
        "date": "09292017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan says fish-mat ban may delay Canada pipe expansion "
    },
    {
        "content": "CALGARY  Alberta  Sept 12 Canadian lender Desjardins is considering backing out of its C$145 million ($113 million) commitment to Kinder Morgan Inc's Trans Mountain pipeline expansion  two people present at a meeting with the financial institution told Reuters.",
        "date": "09122017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Canada's Desjardins mulls withdrawal from Kinder pipeline expansion "
    },
    {
        "content": "CALGARY  Alberta  Sept 12 Canadian lender Desjardins is considering backing out of its C$145 million ($113 million) commitment to Kinder Morgan Inc's Trans Mountain pipeline expansion  two people present at a meeting with the financial institution told Reuters.",
        "date": "09122017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Canada's Desjardins mulls withdrawal from Kinder pipeline expansion "
    },
    {
        "content": "CALGARY  Alberta  Aug 30 A Canadian aboriginal band seeking to stop Kinder Morgan Inc's Trans Mountain pipeline expansion has asked a court to consider the federal government's position for a tougher review on a rival project.",
        "date": "08302017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Canada band raises new issue in Kinder Morgan pipeline challenge "
    },
    {
        "content": "CALGARY  Alberta  Aug 31 Canada's National Energy Board (NEB) will hold a series of public hearings beginning this year to determine the route for Kinder Morgan Inc's Trans Mountain pipeline expansion  the regulator said on Thursday.",
        "date": "08312017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "New Canada hearings for Kinder Morgan pipeline expansion route "
    },
    {
        "content": "CALGARY  Alberta Canada's National Energy Board will hold a series of public hearings beginning this year to determine the route for Kinder Morgan Inc's Trans Mountain pipeline expansion  the regulator said on Thursday.",
        "date": "09012017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "New Canada hearings for Kinder Morgan pipeline expansion route "
    },
    {
        "content": "CALGARY  Alberta  Aug 31 Canada's National Energy Board will hold a series of public hearings beginning this year to determine the route for Kinder Morgan Inc's Trans Mountain pipeline expansion  the regulator said on Thursday.",
        "date": "09012017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-New Canada hearings for Kinder Morgan pipeline expansion route "
    },
    {
        "content": "* Kinder morgan says terminals along houston ship channel  gulf coast secured; mobilizing resources to resume full operations as soon as possible Source text for Eikon: Further company coverage:",
        "date": "08282017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder morgan says terminals along houston ship channel  gulf coast secured mobilizing resources to resume full operations as soon as possible "
    },
    {
        "content": "HOUSTON  Aug 25 Kinder Morgan has started shutting down parts of its KMCC pipeline system for crude and condensate  its Double Eagle pipeline  several gas storage facilities and compressor stations due to Hurricane Harvey  the firm said on Friday.",
        "date": "08252017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan shutting down pipelines  gas facilities due to Harvey "
    },
    {
        "content": "* Philly Shipyard delivers third product tanker to Kinder Morgan",
        "date": "07262017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Philly Shipyard delivers third product tanker to Kinder Morgan "
    },
    {
        "content": "CALGARY  Alberta Little major construction will happen on Kinder Morgan Canada Ltd's Trans Mountain pipeline expansion this year although construction remains on schedule to begin in September  company President Ian Anderson said on Wednesday.",
        "date": "07192017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan's Trans Mountain to see little major work this year "
    },
    {
        "content": "CALGARY  Alberta  July 19 Little major construction will happen on Kinder Morgan Canada Ltd's Trans Mountain pipeline expansion this year although construction remains on schedule to begin in September  company President Ian Anderson said on Wednesday.",
        "date": "07192017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 3-Kinder Morgan's Trans Mountain to see little major work this year "
    },
    {
        "content": "* Kinder morgan announces expected 60% dividend increase for 2018 and projects 25% annual dividend growth from 2018 through 2020",
        "date": "07192017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan Q2 earnings per share $0.15 "
    },
    {
        "content": "CALGARY  Alberta  July 18 Pipeline operator Kinder Morgan Canada Ltd posted lower-than-expected quarterly profit on Wednesday in its first earnings report following its May spinoff from Houston-based Kinder Morgan Inc .",
        "date": "07192017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan Canada quarterly profit misses analysts' forecasts "
    },
    {
        "content": "* Kinder Morgan- ‍on June 16  two subsidiaries of Kinder Morgan Canada Limited  Kinder Morgan Cochin ULC  Trans Mountain Pipeline ULC entered into credit agreement​",
        "date": "06222017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan Canada units enter into credit agreement​ "
    },
    {
        "content": "CALGARY  Alberta  May 31 Kinder Morgan Inc's Trans Mountain pipeline expansion has \"met every test\" in its bid to attain approval  the company said on Wednesday  responding to a vow by the British Columbia province's de facto incoming government to block the project.",
        "date": "05312017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan Canada says pipeline facing obstacle has 'met every test' "
    },
    {
        "content": "VICTORIA  British Columbia May 30 British Columbia's New Democrats and Greens  which have struck a  deal to govern in the Western Canadian province  said on Tuesday they will use \"every tool available\" to stop the expansion of Kinder Morgan Inc's Trans Mountain pipeline.",
        "date": "05302017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "RPT-British Columbia's Greens  NDP vow to halt Kinder Morgan pipeline "
    },
    {
        "content": "VICTORIA  British Columbia May 30 British Columbia's New Democrats and Greens  which have struck a  deal to govern in the Western Canadian province  said on Tuesday they will use \"every tool available\" to stop the expansion of Kinder Morgan Inc's Trans Mountain pipeline.",
        "date": "05302017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "British Columbia's Greens  NDP vow to halt Kinder Morgan pipeline "
    },
    {
        "content": "TORONTO/ALBERTA  May 30  Shares in Kinder Morgan Canadian debuted at C$16.06 on Tuesday on the Toronto Stock Exchange after raising C$1.75 billion ($1.3 billion) in an initial public offering (IP0) at C$17.00 each last week.",
        "date": "05302017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan Canada shares drop on debut after $1.3 bln IPO "
    },
    {
        "content": "Kinder Morgan Inc has made a final investment decision on its Trans Mountain pipeline expansion  contingent on the successful public offering of its Canadian division  the company said on Thursday as it acknowledges the political uncertainty weighing on the project.",
        "date": "05262017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Trans Mountain investment contingent on Canada IPO: Kinder Morgan "
    },
    {
        "content": "TORONTO/CALGARY  Alberta U.S. pipeline company Kinder Morgan Inc  has priced its Canadian initial public offering at C$17 per share  according to a term sheet of the deal seen by Reuters on Wednesday.",
        "date": "05242017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan prices Canadian IPO at C$17 per share: term sheet "
    },
    {
        "content": "May 25 Kinder Morgan Inc has made a final investment decision on its Trans Mountain pipeline expansion  contingent on the successful public offering of its Canadian division  the company said on Thursday as it acknowledges the political uncertainty weighing on the project.",
        "date": "05262017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Trans Mountain investment contingent on Canada IPO -Kinder Morgan "
    },
    {
        "content": "TORONTO/CALGARY  Alberta  May 24 U.S. pipeline company Kinder Morgan Inc has priced its Canadian initial public offering at C$17 per share  according to a term sheet of the deal seen by Reuters on Wednesday.",
        "date": "05242017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-Kinder Morgan prices Canadian IPO at C$17 per share -term sheet "
    },
    {
        "content": "TORONTO  May 24 Kinder Morgan Inc has priced its Canadian initial public offering at C$17 per share  according to a term sheet of the deal seen by Reuters on Wednesday.",
        "date": "05242017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "CORRECTED-Kinder Morgan prices Canadian IPO at C$17 per share - term sheet "
    },
    {
        "content": "* Makes final investment decision on Trans Mountain expansion project",
        "date": "05252017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan makes final investment decision on Trans Mountain expansion project "
    },
    {
        "content": "CALGARY  Alberta  May 18 Environmental group Greenpeace on Thursday asked the Alberta securities regulator to halt Kinder Morgan's initial public offering (IPO) of its Canadian business until the company disclosed climate-related risks to potential investors.",
        "date": "05182017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Greenpeace asks Alberta regulator to halt Kinder Morgan Canada IPO "
    },
    {
        "content": "TORONTO U.S. pipeline Kinder Morgan Inc's  Canadian unit is seeking to raise up to C$1.75 billion ($1.3 billion) in an initial public offering (IPO) in Toronto  Kinder Morgan Canada said in a regulatory filing on Wednesday.",
        "date": "05102017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan to raise up to $1.3 billion in Canadian IPO "
    },
    {
        "content": "TORONTO  May 10 U.S. pipeline Kinder Morgan Inc's Canadian unit is seeking to raise up to C$1.75 billion ($1.3 billion) in an initial public offering (IPO) in Toronto  Kinder Morgan Canada said in a regulatory filing on Wednesday.",
        "date": "05102017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder Morgan to raise up to $1.3 billion in Canadian IPO "
    },
    {
        "content": "TORONTO  May 10 U.S. pipeline giant Kinder Morgan Inc's Canadian unit is looking to raise up to C$1.75 billion ($1.28 billion) in an initial public offering in Toronto  Kinder Morgan Canada said in a regulatory filing on Wednesday.",
        "date": "05102017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan to raise up to C$1.75 bln in Canadian IPO "
    },
    {
        "content": "May 2 Evraz Plc  Russia's No. 2 steelmaker  signed an agreement with Kinder Morgan Inc to supply about 250 000 metric tons of pipe to the U.S. pipeline company for the expansion of the Trans Mountain pipeline.",
        "date": "05022017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Russia's Evraz to supply pipes for Kinder Morgan's pipeline expansion "
    },
    {
        "content": "CALGARY  Alberta U.S. pipeline company Kinder Morgan Inc  said on Monday its Canadian unit filed a prospectus for an initial public offering of restricted voting shares  to help finance its C$7.4 billion ($5.48 billion) Trans Mountain expansion project.",
        "date": "04242017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan Canada files for IPO to raise Trans Mountain funds "
    },
    {
        "content": "CALGARY  Alberta  April 24 U.S. pipeline company Kinder Morgan Inc said on Monday its Canadian unit filed a prospectus for an initial public offering of restricted voting shares  to help finance its C$7.4 billion ($5.48 billion) Trans Mountain expansion project.",
        "date": "04242017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder Morgan Canada files for IPO to raise Trans Mountain funds "
    },
    {
        "content": "* Kinder Morgan says its unit Kinder Morgan Canada has filed a preliminary prospectus in connection with proposed IPO of its restricted voting shares",
        "date": "04242017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan's Canadian unit files for IPO of restricted voting shares "
    },
    {
        "content": "April 24 U.S. pipeline company Kinder Morgan Inc said on Monday its Canadian unit has filed with Canadian regulators for an initial public offering of restricted voting shares.",
        "date": "04242017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan's Canadian unit files for IPO of restricted voting shares "
    },
    {
        "content": "* FTC requires kidney dialysis chain DaVita Inc to divest assets as a condition of acquiring competitor Renal Ventures Management LLC",
        "date": "03282017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-FTC requires DaVita to divest assets in relation to Renal Ventures Management deal "
    },
    {
        "content": "* Stockholder Lowell Miller files proposal raising concerns about Kinder Morgan's policies regarding methane emissions from oil production - SEC filing  Source text for Eikon: (http://bit.ly/2mqiAp0) Further company coverage:",
        "date": "03212017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Stockholder Lowell Miller files proposal raising concerns about Kinder Morgan's policies regarding methane emissions "
    },
    {
        "content": "March 22 Kinder Morgan Inc said it had booked all of the 22 000 barrels per day of capacity it had offered to the oil industry on its Canadian Trans Mountain pipeline expansion project earlier this month  following a dip in shipper commitments.",
        "date": "03222017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan secures commitments for Trans Mountain after dip "
    },
    {
        "content": "March 22 Kinder Morgan Inc said it had booked all of the 22 000 barrels per day of capacity it had offered to the oil industry earlier this month on its Canadian Trans Mountain pipeline expansion project  following a dip in shipper commitments.",
        "date": "03222017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder Morgan secures commitments for Trans Mountain after dip "
    },
    {
        "content": "March 9 Shipper commitment for Kinder Morgan Inc's Canadian Trans Mountain pipeline expansion project dipped by 3 percent  or 22 000 barrels per day  after the company raised its cost estimate to C$7.4 billion ($5.48 billion) and increased tolls  the company said on Thursday.",
        "date": "03092017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "UPDATE 2-Kinder Morgan raises Canada's Trans Mountain cost  commitments drop "
    },
    {
        "content": "* Kinder Morgan sells 49% interest in Elba Liquefaction company to EIG Global Energy Partners investment funds",
        "date": "03032017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan sells 49 pct interest in Elba Liquefaction Co "
    },
    {
        "content": "A Kinder Morgan Inc natural gas pipeline exploded early on Wednesday in southern Texas  the company said  and a television reported homes up to 60 miles (96 km) away were shaken by the blast.",
        "date": "02152017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan gas pipeline explodes in Texas  no injuries "
    },
    {
        "content": "TORONTO/NEW YORK Kinder Morgan Inc  has begun talks with institutional investors including major Canadian pension funds and private equity firms to raise capital for the C$6.8 billion ($5.2 billion) expansion of its Trans Mountain pipeline project  according to people familiar with the process.",
        "date": "02172017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Exclusive: Kinder Morgan starts talks with investors for $5.2 billion Canada pipeline project - sources "
    },
    {
        "content": "* Kinder Morgan Inc - on January 18  2017  board of directors of Kinder Morgan  inc elected Kimberly A. Dang as a member of board of directors",
        "date": "01242017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan elects CFO Kimberly Dang to board "
    },
    {
        "content": "U.S. federal energy regulators said Thursday they would investigate rates charged by two natural gas pipelines operated by Kinder Morgan Inc to determine if they may be over-recovering costs  resulting in unjust and unreasonable rates.",
        "date": "01192017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "U.S. regulator to probe Kinder Morgan natural gas pipeline rates "
    },
    {
        "content": "Kinder Morgan Inc  reported lower-than-expected quarterly revenue for the ninth straight quarter as its pipelines transported lower volumes of oil and gas.",
        "date": "01182017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Pipeline company Kinder Morgan's revenue misses estimates "
    },
    {
        "content": "Jan 18 Kinder Morgan Inc reported lower-than-expected quarterly revenue for the ninth straight quarter as its pipelines transported lower volumes of oil and gas.",
        "date": "01182017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-Pipeline company Kinder Morgan's revenue misses estimates "
    },
    {
        "content": "* Q4 earnings per share view $0.19 -- Thomson Reuters I/B/E/S",
        "date": "01182017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan reports Q4 earnings per share $0.08 "
    },
    {
        "content": "Jan 18 Kinder Morgan Inc reported a 6.8 percent drop in quarterly revenue as its pipelines moved lower volumes of oil and gas.",
        "date": "01182017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Pipeline company Kinder Morgan's revenue falls 6.8 pct "
    },
    {
        "content": "VANCOUVER British Columbia on Wednesday gave the green light to Kinder Morgan Inc's plan to nearly triple its Trans Mountain oil pipeline  which runs from Canada's oil sands through the province to a marine terminal on the Pacific Coast.",
        "date": "01122017",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "British Columbia approves Kinder Morgan pipeline expansion "
    },
    {
        "content": "VANCOUVER  Jan 11 British Columbia on Wednesday gave the green light to Kinder Morgan Inc's plan to nearly triple its Trans Mountain oil pipeline  which runs from Canada's oil sands through the province to a marine terminal on the Pacific Coast.",
        "date": "01122017",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-British Columbia approves Kinder Morgan pipeline expansion "
    },
    {
        "content": "WILMINGTON  Del. The Delaware Supreme Court dismissed on Tuesday a $171 million investor lawsuit against Kinder Morgan Inc stemming from the pipeline operator's acquisition of El Paso Corp and its affiliates.",
        "date": "12212016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan wins dismissal of $171 million investor lawsuit "
    },
    {
        "content": "CALGARY  Alberta Two environmental groups on Tuesday filed for a judicial review of the Canadian government's decision to approve Kinder Morgan's  Trans Mountain pipeline expansion  the first legal challenge to the project since it received the green light last month.",
        "date": "12202016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Environmentalists file suit over Kinder Morgan pipeline in Canada "
    },
    {
        "content": "VANCOUVER  Nov 28 If Canada approves Kinder Morgan's Trans Mountain pipeline expansion  the company's four-year campaign for the project will be far from over. Next up is a battle against hardening opposition amongst some communities along its planned route.",
        "date": "11282016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "RPT-Canada pipeline opponents ready to take on Kinder Morgan  Ottawa "
    },
    {
        "content": "* Says next steps will include final cost estimate review with shippers  final investment decision by company's board of investors",
        "date": "11292016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan planning to start Trans Mountain construction Sept. 2017 "
    },
    {
        "content": "* Canada PM says we know we need to increase pipeline capacity to keep crude shipments off railways",
        "date": "11292016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Canada PM says under no illusions that Kinder Morgan decision will be bitterly disputed by some people "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 17 A Husky Energy Inc  oil spill into a major Canadian river last summer that cut off drinking water supply for two cities was caused by ground movement that buckled a section of pipeline  the company said in a report to the Saskatchewan provincial government.",
        "date": "11172016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Husky oil spill in Canadian river caused by ground movement "
    },
    {
        "content": "* Berkshire Hathaway takes share stake of 21.8 million shares in American Airlines - SEC filing",
        "date": "11142016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Berkshire Hathaway takes share stake in American Airlines  cuts in Kinder Morgan - SEC filing "
    },
    {
        "content": "* Appaloosa LP cuts share stake in Alphabet Inc to 472 000 shares of class C capital stock from 630 000 shares of class C capital stock",
        "date": "11142016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Appaloosa cuts share stake in Alphabet  ups in Kinder Morgan "
    },
    {
        "content": "WASHINGTON  Oct 28 Fayez Sarofim  who is on the Kinder Morgan board of directors  has agreed to pay a $720 000 civil penalty for failing to report the purchase of voting securities of Kinder Morgan and Kemper Corporation  to antitrust enforcers  the Justice Department said on Friday.",
        "date": "10282016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Investment firm chairman Fayez Sarofim to pay to settle antitrust violations "
    },
    {
        "content": "WASHINGTON  Oct 28 Fayez Sarofim  a billionaire darling of Houston high society known for running a Texas investment company  has agreed to pay a $720 000 civil penalty for failing to report the purchase of voting securities of Kinder Morgan and Kemper Corporation  the Federal Trade Commission said on Friday.",
        "date": "10282016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Investment firm chairman Fayez Sarofim to pay to settle antitrust violations "
    },
    {
        "content": "HOUSTON Kinder Morgan  will begin construction on its Elba Liquefaction project near Savannah  Georgia  on Nov. 1  ahead of a final ruling from federal regulators on rehearing requested by environmental activists  the company said on Wednesday.",
        "date": "10192016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan to begin construction on Elba Liquefaction project November 1 "
    },
    {
        "content": "Kinder Morgan Inc reported lower-than-expected quarterly revenue as its pipelines moved lower volumes of oil and gas.",
        "date": "10192016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Pipeline company Kinder Morgan's revenue misses estimates "
    },
    {
        "content": "Oct 19 Kinder Morgan Inc reported lower-than-expected quarterly revenue as its pipelines moved lower volumes of oil and gas.",
        "date": "10192016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-Pipeline company Kinder Morgan's revenue misses estimates "
    },
    {
        "content": "* Kinder Morgan Inc says  for 2016  KMI expects to declare dividends of $0.50 per share",
        "date": "10192016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan posts Q3 loss of $0.10 per share "
    },
    {
        "content": "Oct 19 Kinder Morgan Inc reported a 10.2 percent drop in quarterly revenue as its pipelines moved lower volumes of oil and gas.",
        "date": "10192016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan's revenue falls 10.2 pct "
    },
    {
        "content": "* Says feeder pipeline on Trans Mountain system in Washington state that trespassers targeted has now reopened  Source text for Eikon:  Further company coverage:    (Reporting By Nia Williams)",
        "date": "10112016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan says Trans Mountain feeder pipeline has now reopened "
    },
    {
        "content": "* Says trespassers broke into location on Trans Mountain pipeline in Washington state on Tuesday morning",
        "date": "10112016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan says trespassers broke into location on Trans Mountain line "
    },
    {
        "content": "TORONTO/OTTAWA  Oct 3 Canada's federal government on Monday vowed to bring in a minimum price on carbon emissions by 2018  prompting one energy-producing province to threaten legal action and another to demand approval of an oil pipeline in return.",
        "date": "10032016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 3-Canada unveils carbon price  energy-producing provinces unhappy "
    },
    {
        "content": "* Southern Company  Kinder Morgan finalize southern natural gas pipeline strategic venture  Source text for Eikon:  Further company coverage:",
        "date": "09012016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Southern Company  Kinder Morgan finalize Southern Natural Gas pipeline strategic venture "
    },
    {
        "content": "* GLM Holdco  LLC says it has sold $13.9 mln in equity financing - SEC Filing  Source - http://bit.ly/2ahC73b   (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "07282016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-GLM Holdco  LLC says it has sold $13.9 mln in equity financing "
    },
    {
        "content": "Kinder Morgan Inc said on Tuesday it shut several natural gas pipeline segments near the King Ranch gas processing plant in Kleberg County  Texas  after a fire on Monday morning.",
        "date": "07192016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan shuts natgas pipelines after fire in Texas "
    },
    {
        "content": "* Says agreement with nucor corporation to provide in-plant services for five of Nucor's facilities  Source text for Eikon:  Further company coverage:    )",
        "date": "07062016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan Terminals signs 10-year agreement with Nucor Corporation "
    },
    {
        "content": "Valero Energy Corp said on Tuesday it bought Kinder Morgan Inc's 50 percent stake in Parkway Pipeline LLC  previously a joint venture between the two companies.",
        "date": "07122016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Valero buys out partner in Louisiana-Mississippi pipeline "
    },
    {
        "content": "July 12 Valero Energy Corp said on Tuesday it bought Kinder Morgan Inc's 50 percent stake in Parkway Pipeline LLC  previously a joint venture between the two companies.",
        "date": "07122016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Valero buys out partner in Louisiana-Mississippi pipeline "
    },
    {
        "content": "July 12 Valero Energy Corp bought the remaining 50 percent stake in Parkway Pipeline LLC and said it would gain increased access to eastern United States by connecting the pipeline to Colonial Pipeline Co's Gulf Coast-to-U.S. Northeast system.",
        "date": "07122016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Valero buys remaining stake in Parkway Pipeline "
    },
    {
        "content": "Kinder Morgan Inc said it had agreed to sell half its stake in an Ohio pipeline project to private equity firm Riverstone Investment Group LLC for an undisclosed amount.",
        "date": "06282016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan sells 50 percent stake in Ohio pipeline to Riverstone "
    },
    {
        "content": "June 28 Kinder Morgan Inc said it had agreed to sell half its stake in an Ohio pipeline project to private equity firm Riverstone Investment Group LLC for an undisclosed amount.",
        "date": "06282016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder Morgan sells 50 pct stake in Ohio pipeline to Riverstone "
    },
    {
        "content": "* Kinder Morgan sells 50 pct equity interest in Utopia pipeline project to Riverstone Investment Group",
        "date": "06282016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan sells 50 pct stake in in Utopia pipeline project to Riverstone Investment Group "
    },
    {
        "content": "June 28 Kinder Morgan Inc said it agreed to sell half of its stake in an Ohio pipeline project to Riverstone Investment Group LLC and the private equity firm would help fund construction and commissioning of the pipeline.",
        "date": "06282016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan sells 50 pct stake in Ohio pipeline to PE firm "
    },
    {
        "content": "* TSSP Sub-Fund Holdco Llc reports 9.3 percent passive stake in pdvWireless Inc as of June 8  2016- sec filing  Source text: http://1.usa.gov/28Japcq    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06202016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-TSSP Sub-Fund Holdco Llc reports 9.3 pct passive stake in pdvWireless Inc "
    },
    {
        "content": "VANCOUVER  June 20 The City of Vancouver said on Monday it had taken legal action against the Canadian energy regulator's approval of Kinder Morgan's Trans Mountain pipeline expansion  which would increase the number of oil tankers passing through city waters.",
        "date": "06202016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-Vancouver takes legal action to block Kinder Morgan pipeline plan "
    },
    {
        "content": "* Kinder Morgan Inc says about $2 billion project will be constructed and operated at existing Elba Island LNG terminal near Savannah  Georgia",
        "date": "06022016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan projects receive FERC authorizations "
    },
    {
        "content": "VANCOUVER  May 19 Canada's energy regulator on Thursday recommended the approval of Kinder Morgan Inc's  plan to expand its Trans Mountain oil pipeline  subject to 157 conditions  clearing a major hurdle for the proposed trebling of capacity to serve lucrative Asian markets.",
        "date": "05192016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "UPDATE 3-Canada regulator approves Kinder Morgan pipeline with conditions "
    },
    {
        "content": "* Neb report recommends conditional approval of trans mountain expansion project",
        "date": "05192016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Canadian regulator recommends conditional approval of Kinder Morgan pipeline "
    },
    {
        "content": "* Canada energy regulator says Trans Mountain expansion project's \"considerable benefits\" outweigh the \"residual burdens\"",
        "date": "05192016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Canada regulator supports Kinder Morgan oil pipeline expansion "
    },
    {
        "content": "* Kmi stockholders did not approve stockholder proposal relating to a report on kmi's response to climate change",
        "date": "05132016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan says stockholders did not approve climate change proposal "
    },
    {
        "content": "* CEO says co is reflecting Peabody bankruptcy in forecast update - conf call  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04202016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan CEO says co is reflecting Peabody bankruptcy in forecast update "
    },
    {
        "content": "* Kinder Morgan generates more than $1.2 billion of distributable cash flow for first quarter 2016",
        "date": "04202016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan qtrly net income per class P shares $0.12 "
    },
    {
        "content": "U.S. pipeline operator Kinder Morgan Inc reported a lower first-quarter profit and further cut its 2016 capital budget as a result of a prolonged slump in crude oil prices.",
        "date": "04202016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan posts lower profit  cuts 2016 budget amid oil slump "
    },
    {
        "content": "April 20 U.S. pipeline operator Kinder Morgan Inc reported a lower first-quarter profit and further cut its 2016 capital budget as a result of a prolonged slump in crude oil prices.",
        "date": "04202016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder Morgan posts lower profit  cuts 2016 budget amid oil slump "
    },
    {
        "content": "April 20 U.S. pipeline operator Kinder Morgan Inc reported a lower first-quarter profit  hurt by a prolonged slump in crude oil prices.",
        "date": "04202016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan posts lower profit amid oil price slump "
    },
    {
        "content": "* Kinder morgan units award EPC contract to IHI E&C for planned LNG export facility at Elba Island  Georgia",
        "date": "04052016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder morgan units award EPC contract to IHI E&C for planned LNG export facility at Elba Island  Georgia "
    },
    {
        "content": "* Kinder Morgan Inc - CEO Steven J. Kean's 2015 total compensation was $1.1 mln vs $1.3 mln in 2014 - SEC filing",
        "date": "03302016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan CEO Steven J. Kean's 2015 total compensation $1.1 mln "
    },
    {
        "content": "* Indexes up: Dow 0.85 pct  S&P 0.92 pct  Nasdaq 0.96 pct   (Updates to open)",
        "date": "02172016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "US STOCKS-Wall St up as oil prices boost energy  materials stocks "
    },
    {
        "content": "Warren Buffett's Berkshire Hathaway Inc  on Tuesday disclosed a new investment in pipeline operator Kinder Morgan Inc   boosting its bet on the oil industry as crude prices hover near 12-year lows.",
        "date": "02162016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Buffett's Berkshire raises oil bet with Kinder Morgan stake "
    },
    {
        "content": "Feb 16 Warren Buffett's Berkshire Hathaway Inc  on Tuesday disclosed a new investment in pipeline operator Kinder Morgan Inc  boosting its bet on the oil industry as crude prices hover near 12-year lows.",
        "date": "02162016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 3-Buffett's Berkshire raises oil bet with Kinder Morgan stake "
    },
    {
        "content": "Feb 16 Warren Buffett's Berkshire Hathaway Inc  on Tuesday disclosed a new investment in pipeline operator Kinder Morgan Inc  boosting its bet on the oil industry as prices hover near lows not seen in more than a decade.",
        "date": "02162016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Berkshire boosts oil bet with Kinder Morgan stake "
    },
    {
        "content": "NEW YORK U.S. oil and gas pipeline companies including Williams Companies Inc and Kinder Morgan Inc have contracts worth billions of dollars that might be at risk as Chesapeake Energy Corp aims to slash its debts amid collapsing energy prices.",
        "date": "02092016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Chesapeake Energy woes cast shadow on U.S. pipeline companies "
    },
    {
        "content": "WILMINGTON  Del.  Feb 4 A former investment banker landed a so-called incentive fee of $450 000  one of the largest of its kind  for pursuing a securities lawsuit that led to $100 million in damages against Kinder Morgan Inc.",
        "date": "02042016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Investor gets $450 000 fee for leading Kinder Morgan lawsuit "
    },
    {
        "content": "OTTAWA Following are the transitional rules for environmental reviews of major energy projects that the Canadian government unveiled on Wednesday:",
        "date": "01272016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Details of Canadian transitional rules for energy reviews "
    },
    {
        "content": "Shares of U.S. pipeline company Kinder Morgan Inc  shot up on Thursday as investors welcomed the company's plans to cut debt  reduce spending and potentially increase its dividend or buy back shares.",
        "date": "01212016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan surges on prospect of higher dividend  buyback "
    },
    {
        "content": "Jan 21 Shares of U.S. pipeline company Kinder Morgan Inc shot up on Thursday as investors welcomed the company's plans to cut debt  reduce spending and potentially increase its dividend or buy back shares.",
        "date": "01212016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "CORRECTED-Kinder Morgan surges on prospect of higher dividend  buyback "
    },
    {
        "content": "Jan 20 U.S. pipeline giant Kinder Morgan Inc  swung to a fourth-quarter loss  hurt by a $1.15 billion in impairment charges due to falling commodity prices.",
        "date": "01202016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder Morgan swings to loss on $1.15 bln charge "
    },
    {
        "content": "U.S. pipeline company Kinder Morgan Inc  swung to a fourth-quarter loss after a $1.15 billion writedown on natural gas assets  and said weak commodity and stock markets could bring more trouble.",
        "date": "01212016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan swings to loss on $1.15 billion charge "
    },
    {
        "content": "HOUSTON  Jan 20 Kinder Morgan Inc  recorded a $1.15 billion non-cash goodwill writedown on midstream natural gas assets and a $285 million writedown primarily in carbon dioxide segment  Chief Financial Officer Kimberly Allen Dang told analysts on Wednesday.",
        "date": "01202016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan discloses writedowns  warns of more with falling energy prices "
    },
    {
        "content": "Jan 20 U.S. pipeline giant Kinder Morgan Inc  swung to a fourth-quarter loss as it moved lower volumes of oil and gas amid falling prices.",
        "date": "01202016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan swings to loss in Q4 "
    },
    {
        "content": "The British Columbia government said on Monday it will formally oppose the expansion of Kinder Morgan Inc's Trans Mountain pipeline to Canada's west coast  another blow to oil sands producers already reeling from a global crude price crash.",
        "date": "01112016",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "British Columbia to oppose Kinder Morgan's pipeline expansion "
    },
    {
        "content": "Jan 11 The British Columbia government said on Monday it will formally oppose the expansion of Kinder Morgan Inc's Trans Mountain pipeline to Canada's west coast  another blow to oil sands producers already reeling from a global crude price crash.",
        "date": "01112016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-British Columbia to oppose Kinder Morgan's pipeline expansion "
    },
    {
        "content": "* Says Trans Mountain pipeline committed to meeting British Columbia's five conditions",
        "date": "01112016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "BRIEF-Kinder Morgan confident it can meet BC pipeline requirements "
    },
    {
        "content": "Jan 11 The British Columbia government will formally oppose expansion of the Trans Mountain pipeline by Kinder Morgan Inc in a written submission to the National Energy Board  the Vancouver Sun reported  citing the province's environment minister.",
        "date": "01112016",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "British Columbia to oppose Kinder Morgan's pipeline expansion-Vancouver Sun "
    },
    {
        "content": "CALGARY  Alberta  Dec 15 Kinder Morgan Inc  filed its final written argument for the Trans Mountain crude oil pipeline expansion project with Canadian regulators on Tuesday  in a bid to gain approval for shipping more oil sands crude to the Pacific Coast.",
        "date": "12152015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan files final argument for Canadian pipeline expansion "
    },
    {
        "content": "NEW YORK Oil and gas pipeline operator Kinder Morgan's  shares do not appear cheap despite having fallen 60 percent this year  and could fall further before reaching fair value  U.S. weekly investment publication Barron's said in its Dec. 14 edition.",
        "date": "12142015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan shares' fair value could be around $13 apiece: Barron's "
    },
    {
        "content": "NEW YORK  Dec 13 Oil and gas pipeline operator Kinder Morgan's shares do not appear cheap despite having fallen 60 percent this year  and could fall further before reaching fair value  U.S. weekly investment publication Barron's said in its Dec. 14 edition.",
        "date": "12142015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan shares' fair value could be around $13 apiece - Barron's "
    },
    {
        "content": "HOUSTON  Dec 8 Kinder Morgan Inc slashed its dividend 75 percent on Tuesday  marking the first time the U.S. pipeline giant has cut payouts to shareholders since it has been a publicly traded company.",
        "date": "12082015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "UPDATE 1-Pipeline giant Kinder Morgan slashes dividend 75 percent "
    },
    {
        "content": "HOUSTON  Dec 8 Kinder Morgan Inc slashed its dividend 75 percent on Tuesday  marking the first time ever the pipeline giant has cut payouts to shareholders since it has been a publicly traded company.",
        "date": "12082015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Pipeline giant Kinder Morgan slashes dividend 75 percent "
    },
    {
        "content": "WILMINGTON  Del.  Dec 2 Energy Pipeline operator Kinder Morgan Inc is on the hook for the bulk of $171 million in damages owed to investors in an affiliate of El Paso Corp  which Kinder Morgan acquired in 2014  a Delaware judge ruled on Wednesday.",
        "date": "12022015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan on hook for $171 mln judgment tied to El Paso deal "
    },
    {
        "content": "WILMINGTON  Del. Energy pipeline operator Kinder Morgan Inc is on the hook for the bulk of $171 million in damages owed to investors in an affiliate of El Paso Corp  which Kinder Morgan acquired in 2014  a Delaware judge ruled on Wednesday.",
        "date": "12022015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan on hook for $171 million judgment tied to El Paso deal "
    },
    {
        "content": "WILMINGTON  Del.  Dec 2 Energy pipeline operator Kinder Morgan Inc is on the hook for the bulk of $171 million in damages owed to investors in an affiliate of El Paso Corp  which Kinder Morgan acquired in 2014  a Delaware judge ruled on Wednesday.",
        "date": "12022015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder Morgan on hook for $171 mln judgment tied to El Paso deal "
    },
    {
        "content": "OTTAWA  Nov 18 Canada's environmental review of existing applications for crude oil pipeline projects is continuing despite the new Liberal government's plans to make the assessment process more robust  Natural Resources Minister Jim Carr said on Wednesday.",
        "date": "11182015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-Canada says pipeline reviews proceed despite change to process "
    },
    {
        "content": "HOUSTON  Oct 29 Kinder Morgan's 95 000 barrels per day Cochin pipeline  which transports diluent from the U.S. to Canada  is currently running near capacity  the company's President of Pipeline Products  Ron McClain  said today at an Argus conference.",
        "date": "10292015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan's 95 000 barrels per day Cochin pipeline near capacity - Executive "
    },
    {
        "content": "HOUSTON U.S. pipeline company Kinder Morgan Inc   looking to fund its growth at a time of low oil prices  on Monday said it plans a $1.6 billion offering of 32 million depositary shares that will convert to preferred shares in three years.",
        "date": "10262015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder plans $1.6 billion convertible deal  shares fall "
    },
    {
        "content": "HOUSTON  Oct 26 U.S. pipeline company Kinder Morgan Inc  looking to fund its growth at a time of low oil prices  on Monday said it plans a $1.6 billion offering of 32 million depositary shares that will convert to preferred shares in three years.",
        "date": "10262015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder plans $1.6 bln convertible deal  shares fall "
    },
    {
        "content": "Oct 21 Kinder Morgan Inc on Wednesday increased its quarterly dividend but said the payout would grow a bit slower next year as the U.S. pipeline company seeks to maintain financial flexibility in a slumping commodities market.",
        "date": "10212015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "UPDATE 2-Kinder Morgan raises dividend  but sees slower growth "
    },
    {
        "content": "U.S. pipeline company Kinder Morgan Inc  on Wednesday increased its quarterly dividend and said it would also pay a higher dividend in 2016.",
        "date": "10212015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan hikes dividend  says profit fell 43 percent "
    },
    {
        "content": "Oct 21 U.S. pipeline company Kinder Morgan Inc  increased its quarterly dividend on Wednesday  to meet its full-year dividend target of $2 per share.",
        "date": "10212015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan raises dividend "
    },
    {
        "content": "BP Plc  will sell 15 fuel storage terminals in the United States to pipeline company Kinder Morgan Inc  in a $350 million deal  as it sheds assets to pay for liabilities arising from its 2010 Gulf of Mexico oil spill.",
        "date": "10202015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan  BP form fuel storage JV "
    },
    {
        "content": "* Kinder Morgan to own 75 pct stake in JV   (Updates with details from BP statement)",
        "date": "10202015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-Kinder Morgan  BP form fuel storage JV "
    },
    {
        "content": "Oct 20 Pipeline company Kinder Morgan Inc  said it would buy 15 refined products terminals in the United States from a unit of BP Plc in a deal valued at about $350 million.",
        "date": "10202015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan buys some U.S. terminals from BP in $350 mln deal "
    },
    {
        "content": "CALGARY  Alberta  Sept 24 Canada's National Energy Board said on Thursday it has delayed the release of its recommendation report on Kinder Morgan Inc's Trans Mountain pipeline expansion by five months to acquire additional information on the project.",
        "date": "09242015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Canadian regulators delay review of Trans Mountain pipeline "
    },
    {
        "content": "HOUSTON  Sept 8 A Texas district judge issued temporary restraining orders on Tuesday to preserve evidence in the death of a bulldozer operator at Total SA's Port Arthur  Texas  refinery on Saturday  according to court documents.",
        "date": "09092015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Texas judge issues restraining orders in Port Arthur refinery death "
    },
    {
        "content": "HOUSTON  Sept 6 Total SA's Port Arthur  Texas  refinery is running at about half of its 225 500 barrel per day (bpd) capacity as coker throughput is minimal following a fatal accident at the unit on Saturday  sources familiar with plant operations said on Sunday.",
        "date": "09062015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "UPDATE 1-Total Port Arthur refinery operating at 50 pct capacity -sources "
    },
    {
        "content": "HOUSTON  Sept 5 Total SA cut production at its Port Arthur  Texas  refinery on Saturday after a contract worker was killed when the bulldozer he was driving in a pit beneath a giant refining unit flipped over in petroleum coke and coarse dust  said sources familiar with plant operations.",
        "date": "09052015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "CORRECTED-UPDATE 3-Total Port Arthur refinery cuts production after worker killed -sources "
    },
    {
        "content": "Aug 4 Kinder Morgan's Tennessee Gas Pipeline (TGP) declared a force majeure event for its system near Falfurrias  Texas  effective from Tuesday.",
        "date": "08042015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "UPDATE 1-Tennessee Gas Pipeline declares force majeure for system near Falfurrias  Texas "
    },
    {
        "content": "Aug 4 Kinder Morgan's Tennessee Gas Pipeline (TGP) declared a force majeure event for its system near Falfurrias  Texas  effective from Tuesday.",
        "date": "08042015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Tennessee Gas Pipeline declares force majeure for system near Falfurrias  Texas "
    },
    {
        "content": "HOUSTON  July 15 Kinder Morgan Inc is considering more export opportunities from Texas and the U.S. Northeast  including liquid petroleum gas  refined products and potentially crude  a top executive told analysts on Wednesday.",
        "date": "07152015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder Morgan considering LPG  product and potential crude exports "
    },
    {
        "content": "Kinder Morgan Inc  said it would buy the 49 percent stake that it does not already own in natural gas joint venture Elba Liquefaction Co from Royal Dutch Shell Plc   and it raised its dividend.",
        "date": "07152015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan to buy out Shell's JV stake; raises dividend "
    },
    {
        "content": "July 15 Kinder Morgan Inc said it would buy the 49 percent stake that it does not already own in natural gas joint venture Elba Liquefaction Co from Royal Dutch Shell Plc  and it raised its dividend.",
        "date": "07152015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder Morgan to buy out Shell's JV stake; raises div "
    },
    {
        "content": "July 15 Kinder Morgan Inc's  second-quarter profit fell nearly 29 percent from the first quarter  and the pipeline company said it increased its quarterly dividend by 14 percent.",
        "date": "07152015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "REFILE-Kinder Morgan profit falls 29 pct; hikes dividend "
    },
    {
        "content": "HOUSTON  June 25 Kinder Morgan Inc aims to start up its second condensate splitter at its Houston Ship Channel complex next month  a spokeswoman said.",
        "date": "06252015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan to start up second Texas condensate splitter in July "
    },
    {
        "content": "NEW YORK  May 22 Shipments of ethanol into Kinder Morgan's terminal at the U.S. hub of Argo  Illinois  were disrupted this week due to a train derailment at the company's terminal  a company spokesman told Reuters on Friday.",
        "date": "05222015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Ethanol shipments disrupted at Kinder Morgan's Argo hub "
    },
    {
        "content": "HOUSTON  May 19 The state of Georgia's top transportation official has denied Kinder Morgan Inc's  request for a key permit to build a $1.12 billion gasoline and distillate pipeline through the southeast part of the state.",
        "date": "05192015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Georgia denies key permit for Kinder's Palmetto pipeline "
    },
    {
        "content": "Thomson Reuters May 7  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For ",
        "date": "05072015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "A Delaware judge found an affiliate of El Paso Corp liable for $171 million for overpaying in a pipeline deal  a ruling that could bolster the legal power of investors in an increasingly popular investment vehicle used in the energy sector.",
        "date": "04202015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Delaware judge hits El Paso pipeline deal with $171 million judgment "
    },
    {
        "content": "April 20 A Delaware judge found an affiliate of El Paso Corp liable for $171 million for overpaying in a pipeline deal  a ruling that could bolster the legal power of investors in an increasingly popular investment vehicle used in the energy sector.",
        "date": "04202015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Delaware judge hits El Paso pipeline deal with $171 mln judgment "
    },
    {
        "content": "CALGARY  Alberta  March 31 Canada's Keyera Corp  and midstream company Kinder Morgan Inc plan to build 4.8 million barrels of new crude oil storage in the marketing hub of Edmonton  Alberta  the two companies said on Tuesday.",
        "date": "03312015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "UPDATE 1-Keyera  Kinder Morgan to build 4.8 mln bbls of Alberta crude storage "
    },
    {
        "content": "CALGARY  Alberta  March 31 Canada's Keyera Corp  and midstream giant Kinder Morgan Inc plan to build 4.8 million barrels of new crude oil storage in the marketing hub of Edmonton  Alberta  Keyera said in a statement on Tuesday.",
        "date": "03312015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Keyera  Kinder Morgan to build 4.8 mln bbls of Alberta crude storage "
    },
    {
        "content": "where assigned  and hit the newskey (F9 on Reuters terminals)",
        "date": "03092015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "New Issue- Kinder Morgan prices dual tranche deal "
    },
    {
        "content": "HOUSTON Kinder Morgan Inc is commissioning the first of two condensate splitters at its Houston Ship Channel complex after months of delays  the company said on Tuesday.",
        "date": "03102015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan commissioning condensate splitter after months of delays "
    },
    {
        "content": "HOUSTON Kinder Morgan Inc's  proposed Freedom Pipeline  which would move West Texas crude oil to Southern California  is \"getting more interest\" from U.S. West Coast refiners  the head of the company's natural gas pipeline unit told analysts on Wednesday.",
        "date": "01282015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Kinder Morgan says Freedom Pipeline project is gaining refiner interest "
    },
    {
        "content": "Pipeline company Energy Transfer Partners LP  said on Monday it would buy affiliate Regency Energy Partners LP  for about $11 billion  the latest example of master limited partnerships (MLP) trying to simplify their structures and lift returns.",
        "date": "01262015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Energy Transfer Partners to buy Regency unit for $11 billion "
    },
    {
        "content": "Jan 26 Pipeline company Energy Transfer Partners LP said on Monday it would buy affiliate Regency Energy Partners LP for about $11 billion  the latest example of master limited partnerships (MLP) trying to simplify their structures and lift returns.",
        "date": "01262015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-Energy Transfer Partners to buy Regency unit for $11 bln "
    },
    {
        "content": "CHICAGO (Reuters Breakingviews) - Leave it to Harold Hamm to pump Kinder Morgan for a tidy gain. The Continental Resources boss is selling Hiland Partners  his private pipeline company  to its giant rival for $3 billion  more than enough to cover his nearly $1 billion divorce bill. The sale also eliminates a conflict of interest that arose from a 2013 deal between Hiland and Continental. Kinder Morgan  meanwhile  gets a prized - if pricey - foothold in North Dakota's Bakken shale.",
        "date": "01222015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "Breakingviews: Oil billionaire pumps Kinder Morgan for tidy gain "
    },
    {
        "content": "HOUSTON  Jan 21 Kinder Morgan Inc will buy Hiland Partners  a pipeline and logistics company founded by Continental Resources Inc Chief Executive Officer Harold Hamm  for $3 billion  the company said on Wednesday.",
        "date": "01212015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan to buy Hiland Partners for $3 billion "
    },
    {
        "content": "NEW YORK  Jan 22 Energy infrastructure company Kinder Morgan Inc will back the acquisition of Hiland Partners with a $2.025 billion bridge loan  Kinder Morgan said in a press release.",
        "date": "01222015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "TRLPC: Kinder Morgan backs Hiland acq. with $2.025B bridge loan "
    },
    {
        "content": "HOUSTON Leading U.S. pipeline Kinder Morgan Inc  said on Wednesday it will enter North Dakota's Bakken shale with a $3 billion acquisition of Hiland Partners  a pipeline and logistics company founded by Continental Resources  Chief Executive Officer Harold Hamm.",
        "date": "01222015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan entering Bakken with $3 billion deal "
    },
    {
        "content": "Oil pipelines in the United States are undergoing a historic realignment in response to new production in the Eagle Ford development in south-central Texas  redevelopment of older production in the Permian Basin  and new flows of oil from the Midwest and Canada that have oversupplied Midwest markets.",
        "date": "01212015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "U.S. crude oil pipeline projects: Kinder Morgan acquiring Hiland Crude "
    },
    {
        "content": "Kinder Morgan Inc   the top U.S. pipeline company  on Wednesday said co-founder Rich Kinder will step down as chief executive this summer in a long-expected move.",
        "date": "01212015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder stepping down as Kinder Morgan CEO  to be executive chairman "
    },
    {
        "content": "HOUSTON  Jan 21 Leading U.S. pipeline Kinder Morgan Inc said on Wednesday it will enter North Dakota's Bakken shale with a $3 billion acquisition of Hiland Partners  a pipeline and logistics company founded by Continental Resources Chief Executive Officer Harold Hamm.",
        "date": "01222015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 2-Kinder Morgan entering Bakken with $3 billion deal "
    },
    {
        "content": "Jan 21 Kinder Morgan Inc  the top U.S. pipeline company  on Wednesday said co-founder Rich Kinder will step down as chief executive this summer in a long-expected move.",
        "date": "01212015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder stepping down as Kinder Morgan CEO  to be exec chair "
    },
    {
        "content": "HOUSTON  Jan 21 Leading pipeline company Kinder Morgan Inc will buy Hiland Partners  a pipeline and logistics company founded by Continental Resources Inc  Chief Executive Officer Harold Hamm  for $3 billion  the company said on Wednesday.",
        "date": "01212015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "UPDATE 1-Kinder Morgan to buy Hiland Partners for $3 billion "
    },
    {
        "content": "Jan 21 Kinder Morgan Inc  the top U.S. pipeline company  on Wednesday said co-founder Rich Kinder will step down as chief executive this summer.",
        "date": "01212015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "Kinder Morgan CEO Kinder stepping down "
    },
    {
        "content": "NEW YORK  Jan 12 With nearly a quarter of U.S. energy shares' value wiped out by oil's six-month slide  investors are wondering if the sector has taken enough punishment and whether it is time to pile back in ahead of earnings reports later this month.",
        "date": "01122015",
        "name": "Kinder Morgan Inc",
        "news_type": "topStory",
        "symbol": "KMI",
        "title": "REFILE-RPT-As oil plummets  how much pain still looms for US energy firms? "
    },
    {
        "content": "NEW YORK  Jan 12 With nearly a quarter of U.S. energy shares' value wiped out by oil's six-month slide  investors are wondering if the sector has taken enough punishment and whether it is time to pile back in ahead of earnings reports later this month.",
        "date": "01122015",
        "name": "Kinder Morgan Inc",
        "news_type": "normal",
        "symbol": "KMI",
        "title": "REFILE-As oil plummets  how much pain still looms for US energy firms? "
    }
]