[
    {
        "content": "SAO PAULO Heineken NV and Brazilian distributors for Coca-Cola Co will begin arbitration in February regarding a distribution contract that the Dutch brewer decided to end this year  according to a Friday report by newspaper Valor Economico.",
        "date": "11172017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Heineken  Coke distributors start Brazil arbitration in February: Valor "
    },
    {
        "content": "* Coca-Cola CEO on CNBC says \"never say never\" on getting into booze  but it \"doesn't make sense\" right now‍​ Further company coverage: ( Bangalore.newsroom@thomsonreuters.com )",
        "date": "11162017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola CEO on CNBC says \"never say never\" on getting into booze  but it \"doesn't make sense\" right now "
    },
    {
        "content": "SAO PAULO  Nov 17 Heineken NV and Brazilian distributors for Coca-Cola Co will begin arbitration in February regarding a distribution contract that the Dutch brewer decided to end this year  according to a Friday report by newspaper Valor Economico.",
        "date": "11172017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Heineken  Coke distributors start Brazil arbitration in Feb -Valor "
    },
    {
        "content": "* Coca-Cola hosts investor day: company reaffirms guidance and updates long-term growth targets",
        "date": "11162017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola reaffirms guidance and updates long-term growth targets "
    },
    {
        "content": "* Coca-Cola bottling co. Consolidated reports third quarter 2017 results",
        "date": "11072017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Bottling Co posts Q3 EPS of $1.86 "
    },
    {
        "content": "BUENOS AIRES Coca-Cola Co  may withdraw part of a $1 billion investment in Argentina due to concerns over a government proposal to raise taxes on soft drinks  newspaper El Cronista reported on Friday.",
        "date": "11102017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola mulls withdrawing Argentina investment: newspaper "
    },
    {
        "content": "* Coca-Cola Co - ‍Coca-Cola Company completes refranchising of company-owned bottling operations in United States​ Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Co completes refranchising of company-owned bottling operations in United States​ "
    },
    {
        "content": "BUENOS AIRES  Nov 10 Coca-Cola Co may withdraw part of a $1 billion investment in Argentina due to concerns over a government proposal to raise taxes on soft drinks  newspaper El Cronista reported on Friday.",
        "date": "11102017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola mulls withdrawing Argentina investment -newspaper "
    },
    {
        "content": "* Liberty Coca-Cola Beverages acquires local bottling operations in Tri-State Metropolitan Area",
        "date": "10302017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Liberty Coca-Cola Beverages acquires territory from Coca-Cola across New York Tri-State Metro Area "
    },
    {
        "content": "NAIROBI Coca-Cola Co plans to invest up to $90 million in Kenya over the three years through 2018 to increase its product range in the region's biggest economy  the soft drinks maker said on Tuesday.",
        "date": "10242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola to invest up to $90 million in Kenya to broaden product range "
    },
    {
        "content": "NAIROBI  Oct 24 Coca-Cola Co plans to invest up to $90 million in Kenya over the three years through 2018 to increase its product range in the region's biggest economy  the soft drinks maker said on Tuesday.",
        "date": "10242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola to invest up to $90 mln in Kenya to broaden product range "
    },
    {
        "content": "* On conf call- US refranchising will be complete when tri-state operating unit and west operating unit transactions close  which is expected in coming weeks‍​",
        "date": "10252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola on conf call- US refranchising expected to be completed in coming weeks‍​ "
    },
    {
        "content": "Oct 23 Coca-Cola Co said the president of its North America business was retiring and would be replaced by James Dinkins  the head of its Minute Maid Business.",
        "date": "10232017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola names new head of North America business "
    },
    {
        "content": "Coca-Cola Co  topped profit and revenue estimates for the third quarter on a 3 percent rise in North American sales  gaining market share over arch rival PepsiCo Inc  as it sold more Sprite  teas and coffees.",
        "date": "10252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke's North American sales rise fuels market share gains over Pepsi "
    },
    {
        "content": "* The Coca-Cola company announces leadership transition for Coca-Cola North America",
        "date": "10232017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-The Coca-Cola company announces leadership transition for Coca-Cola North America "
    },
    {
        "content": "* 3rd-qtr N.America sales propped up by Sprite  teas  coffees",
        "date": "10252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 3-Coke's N.American sales rise fuels market share gains over Pepsi "
    },
    {
        "content": "* The Coca-Cola Company reports solid operating results in third quarter 2017",
        "date": "10252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Co reports Q3 non-GAAP EPS of $0.50 "
    },
    {
        "content": "Oct 25 Coca-Cola Co reported a 38 percent jump in quarterly profit  helped by cost-cutting and higher demand for Sprite and tea and coffee in North America  its biggest market.",
        "date": "10252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola's quarterly profit jumps 38 pct "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.37/share Source text for Eikon: Further company coverage:",
        "date": "10192017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola sets regular quarterly dividend of $0.37/share "
    },
    {
        "content": "HONG KONG  Oct 17 China Foods Ltd said it would sell its wine and other non-beverage businesses to a unit of its state-owned parent COFCO Corp in a deal valued at HK$5.07 billion ($649 million) as it aims to focus on its beverage business.",
        "date": "10172017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "China Foods to sell wine  non-beverage business to parent for $649 mln "
    },
    {
        "content": "* The Coca-Cola Company and AB InBev complete transition of majority ownership in Coca-Cola Beverages Africa Source text for Eikon: Further company coverage:",
        "date": "10042017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-The Coca-Cola Company  AB InBev complete transition of majority ownership in Coca-Cola Beverages Africa "
    },
    {
        "content": "Oct 3 Warren Buffett is closely monitoring whether U.S. President Donald Trump can lower corporate taxes  one of the rare times the billionaire has looked to Washington to help him decide which stocks to buy and sell.",
        "date": "10032017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Buffett says success of Trump tax plan may affect stock investments "
    },
    {
        "content": "BRUSSELS  Oct 6 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10062017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "EU mergers and takeovers (Oct 6) "
    },
    {
        "content": "* APPROVES WITH CONDITIONS COCA-COLA COMPANY DEAL TO BUY SHARES OWNED BY SABMILLER IN COCA COLA BEVERAGE AFRICA ‍​",
        "date": "09282017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-South Africa's Competition Tribunal updates on Coca-Cola merger  Unilever collusion application "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  September 05 (Fitch) Fitch Ratings has assigned Coca-Cola Icecek's (CCI) planned senior notes issue an expected senior unsecured rating of 'BBB(EXP)'. The final rating is contingent upon the receipt of final documents conforming to information already received by Fitch. Proceeds of the notes will be used to refinance the company's 4.75% notes due in 2018. The planned notes will be unguaranteed  ranking equally with all existing ",
        "date": "09052017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Fitch Rates Coca-Cola Icecek's Planned Unsecured Eurobond Issue 'BBB(EXP)' "
    },
    {
        "content": "NEW YORK  Aug 29 (Thomson Reuters Foundation) - Food and beverage companies face the risk of forced labor in countries where they obtain sugarcane but most fall short in efforts to tackle the problem that threatens millions of workers  according to a study released on Tuesday.",
        "date": "08292017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Cereal  drinks companies often overlook risk of forced labor in sugarcane - study "
    },
    {
        "content": "* Berkshire also largest shareholder of Wells Fargo (Adds details on investment  comment from Bank of America CEO  background  byline)",
        "date": "08292017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Buffett becomes Bank of America's top shareholder "
    },
    {
        "content": "* Mr. Richard T. Williams named to Coca-Cola consolidated’s board of directors Source text for Eikon: Further company coverage:",
        "date": "08242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Richard Williams named to Coca-Cola consolidated’s board of directors "
    },
    {
        "content": "* REG-JLT MOBILE COMPUTERS AB: JLT SELECTED BY SWIRE COCA-COLA  USA  ONE OF THE LARGEST INDEPENDENT COCA-COLA BOTTLERS IN THE UNITED STATES Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "08242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-JLT Mobile Computers: JLT Selected by Swire Coca-Cola "
    },
    {
        "content": "SINGAPORE Seven major drinks companies including Coca-Cola and PepsiCo will limit the sugar content of drinks they sell in Singapore  as part of the city-state's campaign to fight diabetes.",
        "date": "08222017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola  PespiCo and others agree to cap sugar in drinks in Singapore "
    },
    {
        "content": "LONDON  Aug 10 Soft drink bottler Coca-Cola HBC reported higher-than-expected first-half sales on Thursday  helped by price increases  sending its shares up more than 8 percent to all-time highs.",
        "date": "08102017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "UPDATE 2-Drinks bottler Coke HBC's shares soar after sales surprise "
    },
    {
        "content": "LONDON  Aug 10 Soft drink bottler Coca-Cola HBC reported higher quarterly sales on Thursday  helped by warm weather in June and a late Easter holiday.",
        "date": "08102017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke HBC sales up on warm weather  late Easter "
    },
    {
        "content": "* Coca-Cola Bottling Co Consolidated - Co  Coca-Cola Co and Coca-Cola Refreshments USA terminated certain non-binding letter of intent executed feb 6",
        "date": "08022017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-cola Bottling Co Consolidated  Coca-Cola Co and Coca-Cola Refreshments USA terminate certain non-binding LOI "
    },
    {
        "content": "JERUSALEM Israel's Tax Authority wants Coca-Cola to pay some 160 million shekels ($45 million) in taxes on royalties that the global beverage giant receives from its local franchise for use of the brand name in Israel  local newspapers reported.",
        "date": "08022017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Israeli taxman seeks $45 million from Coca Cola over royalties: report "
    },
    {
        "content": "JERUSALEM  Aug 2 Israel's Tax Authority wants Coca-Cola to pay some 160 million shekels ($45 million) in taxes on royalties that the global beverage giant receives from its local franchise for use of the brand name in Israel  local newspapers reported.",
        "date": "08022017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Israeli taxman seeks $45 mln from Coca Cola over royalties -report "
    },
    {
        "content": "* DELIVERY HERO ANNOUNCES STRATEGIC PARTNERSHIP WITH THE COCA-COLA COMPANY Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "07312017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Delivery Hero announces strategic partnership with Coca-Cola "
    },
    {
        "content": "* Coca-Cola Zero sugar launches in U.S. with new and improved real Coca-Cola taste Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Zero sugar launches in U.S. "
    },
    {
        "content": "Coca-Cola Co  said it would replace Coke Zero with a new sugar-free drink in the United States next month  as the company sharpens its focus on low and no-sugar versions of its sodas that helped best quarterly profit estimates.",
        "date": "07262017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola to sell Coke Zero Sugar in U.S.; profit beats "
    },
    {
        "content": "MEXICO CITY Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Monday it is poised to lose a key distribution contract in Brazil  sending its shares down 5 percent  even as it reported an 11.5 percent jump in quarterly net profit.",
        "date": "07242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke Femsa loses key Brazil distribution deal; shares slump "
    },
    {
        "content": "* Expects smaller decline in full-yr profit (Adds details on Coca-Cola Zero Sugar  updates shares)",
        "date": "07262017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 4-Coca-Cola to sell Coke Zero Sugar in US; profit beats "
    },
    {
        "content": "MEXICO CITY  July 24 Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Monday it is poised to lose a key distribution contract in Brazil  sending its shares down 5 percent  even as it reported an 11.5 percent jump in quarterly net profit.",
        "date": "07242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 4-Coke Femsa loses key Brazil distribution deal; shares slump "
    },
    {
        "content": "* To issue up to $1 billion in foreign currency  turkish lira debt",
        "date": "07262017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Turkey's Coca-Cola Icecek says to issue up to $1 bln in debt "
    },
    {
        "content": "* Q2 earnings per share view $0.57 -- Thomson Reuters I/B/E/S",
        "date": "07262017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Q2 earnings per share $0.32 "
    },
    {
        "content": "July 26 Coca-Cola Co reported a 60.2 percent drop in quarterly profit  as the beverage maker incurred a charge of $653 million related to refranchising its North America bottling operations.",
        "date": "07262017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola profit drops 60 pct on refranchising charge "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.37 per share Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Co sets regular quarterly dividend of $0.37 per share "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON/MILAN  July 06 (Fitch) Fitch Ratings has upgraded Coca-Cola Icecek A.S's (CCI) Long-Term Foreign-Currency (FC) Issuer Default Rating (IDR) and senior unsecured rating to 'BBB' from 'BBB-'. The Long-Term Local-Currency (LC) IDR is affirmed at 'BBB'. The Outlooks on the FC and LC IDRs are Stable. The upgrade of the FC IDR and senior unsecured rating to 'BBB' reflects the strong implied and proven support of The Coca-Cola Company (T",
        "date": "07062017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Fitch Upgrades Coca-Cola Icecek's Long-Term Foreign-Currency IDR to 'BBB'; Outlook Stable "
    },
    {
        "content": "* Arca continental and Coca-Cola boost the dairy industry in Ecuador",
        "date": "06302017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Arca Continental and Coca-Cola set new dairy plant in Ecuador "
    },
    {
        "content": "* Berkshire also largest shareholder of Wells Fargo (Recasts to include additional transaction details  Buffett comments on Bank of America  updated stock price  bylines)",
        "date": "06302017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 3-Buffett's company to become Bank of America's top shareholder "
    },
    {
        "content": "JOHANNESBURG Drinks giant Coca-Cola  said on Thursday it had reached an agreement with the South African government on a package of conditions as it finalizes the purchase of a controlling 54.5 percent stake in its joint Africa venture with ABInBev .",
        "date": "06292017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola says reaches agreement with S. African government. on acquisition of local arm "
    },
    {
        "content": "* The coca-cola company announces final results of consent solicitation and tender offer and extension of consent solicitation and tender offer for two series",
        "date": "06212017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Co announces final results of consent solicitation and tender offer "
    },
    {
        "content": "* By 2020  Co expects EBITDA margin over 10 percent Source text for Eikon: (http://bit.ly/2rXlnbN) Further company coverage:",
        "date": "06052017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Bottlers Japan sees 2020 revenue growth of 1.8 pct YOY in CAGR "
    },
    {
        "content": "* The Coca-Cola Company announces the results of the consent solicitation and tender offer and extends the consent solicitation for certain notes",
        "date": "06062017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-The Coca-Cola Co extends consent solicitation for certain notes "
    },
    {
        "content": "NEW YORK Soda giant Coca-Cola Co and major corn syrup makers have joined the political battle against the U.S. sugar industry in recent weeks  as the deadline to hammer out a years-long trade dispute with Mexico nears.",
        "date": "06042017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke  Cargill enter fray as sugar dispute threatens Mexico trade "
    },
    {
        "content": "* The Coca-Cola Company nears completion of u.s. Refranchising plan with letter of intent for territory in Northeast Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola signs letter of intent for bottling territory in Northeast "
    },
    {
        "content": "LONDON Food and drink megabrands are seeing their sales chewed away by smaller  nimbler  cooler rivals. They can't beat them - so now they're joining them.",
        "date": "05242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "'Food revolution': megabrands turn to small start-ups for big ideas "
    },
    {
        "content": "LONDON  May 24 Food and drink megabrands are seeing their sales chewed away by smaller  nimbler  cooler rivals. They can't beat them - so now they're joining them.",
        "date": "05242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "INSIGHT-'Food revolution': megabrands turn to small start-ups for big ideas "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 22 (Fitch) Fitch Ratings has assigned an 'A+' rating to The Coca-Cola Company's (Coca-Cola) issuance of 5- and 10-year senior notes. The Rating Outlook is Negative. The notes will be issued by Coca-Cola and will rank equally with the company's senior unsecured obligations. Proceeds will be used to purchase any notes accepted in Coca-Cola's tender offer  pay any consent payments and general corporate purposes. Coca-Cola had ",
        "date": "05222017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Fitch Rates Coca-Cola's Issuance 'A+'; Outlook Negative "
    },
    {
        "content": "* The Coca-Cola company announces cash tender offer and consent solicitation",
        "date": "05222017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-The Coca-Cola company announces cash tender offer and consent solicitation "
    },
    {
        "content": "MEXICO CITY  May 16 Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Tuesday it has abandoned plans to acquire certain territories in the United States after thorough analysis and negotiations with The Coca Cola Company.",
        "date": "05162017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Mexico's Coca-Cola Femsa ditches plans to buy U.S. operations "
    },
    {
        "content": "MEXICO CITY  May 16 Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Tuesday it has abandoned plans to acquire certain territories in the United States after thorough analysis and negotiations with The Coca Cola Company.",
        "date": "05162017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Mexico's Coca-Cola Femsa ditches plans to buy U.S. operations "
    },
    {
        "content": "* Reyes Holdings says to expand its footprint in U.S. Coca-Cola system by adding territory in California and Nevada",
        "date": "05162017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Reyes Holdings expands footprint in U.S. Coca-Cola system by adding territory in California and Nevada "
    },
    {
        "content": "JOHANNESBURG Coca-Cola Beverages South Africa (CCBSA) said on Monday it had sold a 17.5 percent stake in carbonated fruit juice brand Appletiser to investment holding company African Pioneer Group  as part of a merger agreement with SABMiller .",
        "date": "05102017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola Beverages South Africa sells stake in Appletiser "
    },
    {
        "content": "JOHANNESBURG  May 8 Coca-Cola Beverages South Africa (CCBSA) said on Monday it had sold a 17.5 percent stake in carbonated fruit juice brand Appletiser to investment holding company African Pioneer Group  as part of a merger agreement with SABMiller.",
        "date": "05102017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "REFILE-Coca-Cola Beverages South Africa sells stake in Appletiser "
    },
    {
        "content": "* Q1 net loss of 86.0 million lira  ($24.33 million) versus profit of 29.4 million lira year ago",
        "date": "05032017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek Q1 net result swings to loss of 86.0 million lira "
    },
    {
        "content": "MEXICO CITY  April 27 Mexican Coke bottler Arca Continental plans to ramp up its capital expenditures by 43 percent  to 10 billion pesos ($525.6 million)  this year as it starts a new U.S. venture  the company said Thursday.",
        "date": "04282017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Mexican Coke bottler Arca plans 43 pct investment hike in 2017 "
    },
    {
        "content": "* Incoming CEO on sugar taxes- number of govts facing fiscal pressure  \"if govts need money  they should widen their tax bases\"",
        "date": "04252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola incoming CEO on sugar taxes- \"If govts need money  they should widen their tax bases\" "
    },
    {
        "content": "* COO on conf call-  saw improved Q1 performance in China  in part driven by a strong chinese new year campaign; India performance improved",
        "date": "04252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola COO - To reduce about 1 200 job reductions beginning in second half of 2017 "
    },
    {
        "content": "Coca-Cola Co  said on Tuesday it would cut about 1 200 jobs as the beverage maker expands its savings target amid falling demand for fizzy drinks globally.",
        "date": "04252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola to cut 1 200 jobs  boosts savings target "
    },
    {
        "content": "* Global soda sales fall 1 pct in Q1 (Adds conference call details  CEO comment; updates shares)",
        "date": "04252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 3-Coca-Cola to cut 1 200 jobs  boosts savings target "
    },
    {
        "content": "* Q1 earnings per share view $0.44 -- Thomson Reuters I/B/E/S",
        "date": "04252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Q1 earnings per share $0.27 "
    },
    {
        "content": "April 25 Coca-Cola Co reported a 20 percent drop in quarterly profit  largely weighed down by higher costs related to refranchising its North America bottling operations.",
        "date": "04252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola's profit plunges 20 pct on bottling refranchising costs "
    },
    {
        "content": "* Coca Cola Bottling Co Consolidated - on April 11  2017  co and Coca-Cola Company enters into a non-binding letter of intent  the ' Somerset LOI '",
        "date": "04122017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca Cola Bottling Co Consolidated and Coca-Cola Company enters into a non-binding letter of intent "
    },
    {
        "content": "* Said on Tuesday that it completed evaluation to buy stake in Coca-Cola Beverages Africa (CCBA) from The Coca-Cola Company (TCCC)",
        "date": "04052017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek withdraws from CCBA stake purchase transaction "
    },
    {
        "content": "Coca-Cola Co is putting the likeness of Warren Buffett on Cherry Coke cans in China  hoping to benefit from its biggest shareholder's popularity in the country.",
        "date": "04032017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Warren Buffett adorns Cherry Coke cans in China "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 24 (Fitch) Fitch Ratings has affirmed the Issuer Default Ratings  (IDRs) and debt ratings of The Coca-Cola Company (Coca-Cola) and its  subsidiaries at 'A+/F1'. The Rating Outlook is Negative. Coca-Cola had  approximately $45.7 billion of debt as of Dec. 31  2016. A complete list of  rating actions follows at the end of this release. The Negative Outlook reflects Coca-Cola's elevated leverage (on both a gross and  supplem",
        "date": "03242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Fitch Affirms Coca-Cola's IDRs at 'A+/F1'; Outlook Negative "
    },
    {
        "content": "WASHINGTON  March 24 (Thomson Reuters Foundation) - C oca-Cola and PepsiCo's efforts to stop illegal land seizures by sugar suppliers in Brazil have made progress but Coke has had the greater impact and its competitor needs to do more  a World Bank conference heard this week.",
        "date": "03242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke and Pepsi get mixed reviews in bid to clean up Brazil sugar supplies "
    },
    {
        "content": "* CEO Muhtar Kent's total compensation for 2016 was $17.6 million versus $14.6 million in 2015 - SEC filing",
        "date": "03092017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola CEO Muhtar Kent's 2016 total compensation $17.6 mln vs $14.6 mln in 2015 "
    },
    {
        "content": "HANOI  March 9 Coca-Cola Co is planning to invest an additional $285 million in Vietnam  state media reported  quoting the company's general director for the country.",
        "date": "03092017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola to invest additional $285 mln in Vietnam - state media "
    },
    {
        "content": "NEW YORK  March 6 Soft drinks maker Coca-Cola Co  has launched a gay-friendly ad featuring a brother and sister vying for the attention of a handsome pool boy in the campaign that has won praise for diversity and inclusion.",
        "date": "03062017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola serves up gay-friendly ad for all genders  generations "
    },
    {
        "content": "ZURICH/LONDON Nestle  and Coca-Cola Co  have agreed to end their  Nestea iced tea joint venture after 16 years and pursue separate strategies in the fast-changing bottled drinks market.",
        "date": "03032017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Nestle and Coke end Nestea iced tea venture "
    },
    {
        "content": "* FY 2016 loss of 28.4 million lira ($7.76 million) versus profit of 117.2 million lira year ago",
        "date": "03012017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek 2016 net result turns to loss of 28.4 million lira "
    },
    {
        "content": "ZURICH/LONDON  March 3 Nestle and Coca-Cola Co have agreed to end their  Nestea iced tea joint venture after 16 years and pursue separate strategies in the fast-changing bottled drinks market.",
        "date": "03032017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Nestle and Coke end Nestea iced tea venture "
    },
    {
        "content": "LONDON  March 3 (IFR) - Coca-Cola and Pfizer broke new ground in the European corporate market this week  pricing the first above par floating-rate notes as the sector adapts to the deeply negative rates sparked by eurozone monetary policy.",
        "date": "03032017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Corporates break new ground to cope with negative rates "
    },
    {
        "content": "ZURICH  March 3 Nestle and The Coca-Cola Company have agreed to dissolve their tea joint venture Beverage Partners Worldwide (BPW) as of the start of 2018  Nestle announced on Friday.",
        "date": "03032017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Nestle  Coca-Cola to end tea joint venture - Nestle "
    },
    {
        "content": "NEW YORK  Feb 25 Billionaire Warren Buffett  whose stock picks over several decades have enriched generations of Berkshire Hathaway Inc shareholders  delivered a black eye to the investment industry on Saturday  urging ordinary investors to buy plain-vanilla index funds.",
        "date": "02252017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "WRAPUP 4-Warren Buffett rails against fee-hungry Wall Street managers "
    },
    {
        "content": "* Says comparable total revenues grew 3.7% to ps. 44 300 million",
        "date": "02242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Femsa Q4 EPS 1.69 pesos "
    },
    {
        "content": "Feb 24 Coca-Cola Femsa SAB de CV  the largest Coke bottler in the world  reported a jump in quarterly profit on Friday  helped by higher volume sales in Costa Rica  Nicaragua and the Philippines.",
        "date": "02242017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Mexico's Coca-Cola Femsa profit boosted by Central America sales "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 23 (Fitch) Fitch Ratings plans to withdraw The Coca-Cola  Company's ratings on or about March 23  2017 (approximately 30 days from the  date of this release) for commercial reasons. Fitch currently rates The Coca-Cola Company and its subsidiaries as follows:  The Coca-Cola Company --Long-term Issuer Default Rating (IDR) 'A+';  --Short-term IDR 'F1'; --Bank credit facilities 'A+';  --Senior unsecured debt 'A+'; --Commer",
        "date": "02232017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Fitch Plans to Withdraw The Coca-Cola Company's Ratings "
    },
    {
        "content": "* At CAGNY conference- are increasing availability and options of single-serve drinks",
        "date": "02232017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola exec at CAGNY conference- Will make corporate center much leaner  jobs will be affected "
    },
    {
        "content": "NEW YORK  Feb 14 Warren Buffett's Berkshire Hathaway Inc was an aggressive buyer of stocks in last year's fourth quarter  nearly quadrupling its stake in Apple Inc  and increasing its stake sevenfold in the four biggest U.S. airlines.",
        "date": "02152017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Berkshire takes huge bite of Apple  boosts airline stakes "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Coca Cola Co - SEC filing",
        "date": "02142017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Soros Fund Management takes share stake in Tata Motors  dissolves share stake in Coca Cola  Dunkin' Brands "
    },
    {
        "content": "Coca-Cola Co  forecast a surprise drop in full-year profit as costs related to refranchising its U.S. bottling operations are expected to be higher than previously anticipated.",
        "date": "02092017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola forecasts drop in 2017 profit amid refranchising "
    },
    {
        "content": "* Hit from sale of U.S. bottling ops to be higher than expected",
        "date": "02092017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 3-Coca-Cola forecasts drop in 2017 profit amid refranchising "
    },
    {
        "content": "* On conf call-  in Q4 in India demonetization impacted the whole CPG landscape",
        "date": "02092017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola COO - \"In the developed countries we are looking to drive probably a little more price than volume\" "
    },
    {
        "content": "* Fitch ratings downgrades long term foreign currency IDR and senior unsecured rating to 'BBB-' from 'BBB'",
        "date": "02012017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek announces Fitch rating downgrade "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  February 01 (Fitch) Fitch Ratings has downgraded Coca Cola Icecek A.S's  (CCI) Long Term Foreign Currency (FC) Issuer Default Rating (IDR) and senior  unsecured rating to 'BBB-' from 'BBB'. The Long-Term Local Currency (LC) IDR is  affirmed at 'BBB'. The IDR Outlooks are Stable.  The downgrade follows the sovereign rating action that resulted in Turkey's Long  Term Foreign Currency (LTFC) IDR being downgraded to 'BB+' from 'BBB-",
        "date": "02012017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Fitch Downgrades Coca-Cola Icecek's Long Term Foreign Currency IDR to 'BBB-'; Outlook Stable "
    },
    {
        "content": "* Coca Cola Bottling Co Consolidated- co  unit of Coca-Cola Co  entered into amendment to asset purchase agreement dated September 1  2016 - SEC filing",
        "date": "01272017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca Cola Bottling  Coca-Cola unit entered into amendment to APA "
    },
    {
        "content": "LONDON/NEW YORK Vita Coco  the world's leading brand of coconut water  is exploring a sale of the company that could value it at up to $1 billion  according to sources familiar with the matter. | Video ",
        "date": "01272017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Exclusive: Top coconut water maker Vita Coco exploring sale - sources "
    },
    {
        "content": "* National Amusements - reached a multi-year agreement with Coca-Cola Company",
        "date": "01182017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-National Amusements and Coca-Cola announce new partnership "
    },
    {
        "content": "DAVOS  Switzerland Chinese e-commerce company Alibaba has become a major sponsor of the Olympics after signing a deal with the International Olympic Committee (IOC) that runs until 2028  the two parties said on Thursday",
        "date": "01192017",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "China's Alibaba becomes major sponsor of Olympics "
    },
    {
        "content": "* Consolidated sales volume increased by 5.0% in 4Q16  while volume growth for FY 16 was 3.2%  in line with company guidance",
        "date": "01122017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek FY 2016 consolidated sales volume up 3.2 pct in line with company guidance "
    },
    {
        "content": "Coca-Cola Co and the American Beverage Association trade group were sued on Wednesday for allegedly misleading consumers about the health risks from consuming sugary beverages.",
        "date": "01042017",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Lawsuit in U.S. says Coca-Cola downplays risks of sugary drinks "
    },
    {
        "content": "BEIJING Chinese steel rebar prices fell more than 2 percent  reversing the previous day's gains  while coke and coking coal remained under pressure on Thursday as concerns about weakening demand returned in volatile end-of-year trading.",
        "date": "12292016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "China steel prices fall as demand fears return in volatile trade "
    },
    {
        "content": "Coca-Cola Co said on Friday that Muhtar Kent would step aside as chief executive next year and be replaced by James Quincey  a company veteran credited with several recent changes to help the company cut its dependence on sugary drinks. | Video ",
        "date": "12092016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke CEO Muhtar Kent hands reins to Quincey in widely expected move "
    },
    {
        "content": "PHNOM PENH Coca-Cola Co  opened a new $100 million facility in Cambodian capital Phnom Penh on Monday to expand its production capacity in the Southeast Asian nation.",
        "date": "12052016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola opens new $100 million plant in Cambodia "
    },
    {
        "content": "Hong Kong conglomerate Swire Pacific Ltd  is in talks to buy Coca-Cola Co's  bottling assets in China from Cofco Corp's [CNCOF.UL] China Foods Ltd  unit  Bloomberg reported.",
        "date": "11172016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Swire Pacific in talks to buy Coca-Cola bottling assets in China: Bloomberg "
    },
    {
        "content": "Nov 17 Hong Kong conglomerate Swire Pacific Ltd  is in talks to buy Coca-Cola Co's bottling assets in China from Cofco Corp's China Foods Ltd  unit  Bloomberg reported.",
        "date": "11172016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Swire Pacific in talks to buy Coca-Cola bottling assets in China - Bloomberg "
    },
    {
        "content": "* Swire near deal for $1 billion coke bottling operations - Bloomberg  citing sources",
        "date": "11172016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Swire near deal for $1 billion Coke bottling operations - Bloomberg  citing sources "
    },
    {
        "content": "* Coca-Cola european partners plc - affirms full-year 2016 outlook.",
        "date": "11102016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola European Partners Q3 EPS eur 0.67 "
    },
    {
        "content": "LONDON  Nov 3 European drinks bottler Coca-Cola HBC is open to acquisitions of juice and water brands or new territories  its chief executive said on Thursday  following the release of first-half results.",
        "date": "11032016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola HBC CEO says open to deals for water  juice  territory "
    },
    {
        "content": "* Agreement includes acquisition of production facilities near Seattle and Portland and distribution facilities in territories",
        "date": "10312016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Swire Coca-Cola and Coca-Cola company reach agreement on expansion of territories "
    },
    {
        "content": "* Q3 net profit of 154.2 million lira ($49.49 million) versus 54.3 million lira year ago",
        "date": "11022016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek Q3 net profit jumps to 154.2 million lira "
    },
    {
        "content": "* Files for a mixed shelf offering; size undisclosed - SEC filing  Source text (http://bit.ly/2dPTlDm) Further company coverage:",
        "date": "10272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Co files for mixed shelf offering - SEC filing "
    },
    {
        "content": "* The Coca-Cola Co names Barry Simpson chief information officer  Source text for Eikon:  Further company coverage:",
        "date": "10272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-The Coca-Cola Co names Barry Simpson chief information officer "
    },
    {
        "content": "Coca-Cola Co  reported a better-than-expected quarterly profit  and said it would step up efforts to reduce sugar in its beverages  amid growing pressure from health experts and governments who have blamed sugary drinks for a rise in obesity. | Video ",
        "date": "10262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola speeds up efforts to cut sugar in drinks "
    },
    {
        "content": "* Over 200 drink reformulations underway to reduce sugar -COO",
        "date": "10262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 3-Coca-Cola speeds up efforts to cut sugar in drinks "
    },
    {
        "content": "* The board of directors of the Coca-Cola company elects corporate secretary  declares quarterly dividend",
        "date": "10202016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola sets regular quarterly dividend of $0.35/share "
    },
    {
        "content": "* CEO on conf call - continue to see challenges in many emerging and developing markets",
        "date": "10262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola COO - Currently have over 200 reformulation initiatives under way to reduce added sugar "
    },
    {
        "content": "* Coca-Cola Co says North America refranchising plan remains on track for completion in 2017",
        "date": "10262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Co says North America refranchising plan remains on track for completion in 2017 "
    },
    {
        "content": "* Kirin says in talks for cooperation in distribution  procurement",
        "date": "10262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Kirin  Japan Coca-Cola bottlers talk distribution deal  capital tie-up "
    },
    {
        "content": "Oct 26 The Coca-Cola group in Japan and brewer Kirin Holdings Co Ltd are near a deal for an operational and capital partnership amid intense price competition in the Japanese soft-drink market  the Nikkei reported.",
        "date": "10262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "RPT--Japan's Coca-Cola  Kirin plan tie-up to cut costs - Nikkei "
    },
    {
        "content": "Oct 26 The Coca-Cola group in Japan and brewer Kirin Holdings Co Ltd are near a deal for an operational and capital partnership amid intense price competition in the Japanese soft-drink market  the Nikkei reported.",
        "date": "10262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "CORRECTED-Japan's Coca-Cola  Kirin plan tie-up to cut costs - Nikkei "
    },
    {
        "content": "Oct 10 Coca-Cola Co said it would exercise its right to buy Anheuser-Busch InBev's stake in bottler Coca-Cola Beverages Africa (CCBA)  following the brewer's merger with SABMiller.",
        "date": "10102016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola to buy AB InBev's stake in African bottler "
    },
    {
        "content": "Oct 10 Coca-Cola Co said it would exercise its right to buy Anheuser-Busch InBev's stake in Africa's biggest Coke drinks bottler  after the brewer's takeover of SABMiller.",
        "date": "10102016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Coca-Cola to buy AB InBev's stake in African bottler "
    },
    {
        "content": "* The Coca-Cola Company exercises call option to acquire Anheuser-Busch Inbev's stake in Coca-Cola Beverages Africa",
        "date": "10102016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola exercises call option to acquire Anheuser-Busch Inbev's stake in Coca-Cola Beverages Africa "
    },
    {
        "content": "Oct 6 The candy maker Mars Inc on Thursday said it would take full control of its Wrigley chewing gum business  acquiring the minority stake held by Warren Buffett's Berkshire Hathaway Inc.",
        "date": "10062016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Mars Inc buying out Buffett stake in Wrigley "
    },
    {
        "content": "* Signs collective labour agreement with Tek-Gida labour union",
        "date": "10052016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek signs collective labour agreement "
    },
    {
        "content": "NEW YORK  Oct 5 Apple Inc  Alphabet Inc's Google and Coca-Cola Co topped the list of the world's 100 most valuable brands in 2016  while technology and automotive brands dominated the overall rankings  according to a new report from brand consultancy  Interbrand.",
        "date": "10052016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Apple  Google  Coca-Cola top list of 100 most valuable brands -report "
    },
    {
        "content": "Dunkin' Brands Group Inc  said on Thursday its doughnut chain will partner with Coca-Cola Co  to launch a line of bottled coffee beverages in the United States  its first foray into the ready-to-drink coffee market dominated by rival Starbucks Corp .",
        "date": "09292016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Dunkin' partners with Coca-Cola on bottled coffee "
    },
    {
        "content": "* Coca-Cola West and Coca-Cola East Japan announce proposed integration",
        "date": "09302016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola West and Coca-Cola East Japan announce proposed integration "
    },
    {
        "content": "Sept 29 Dunkin' Brands Group Inc said on Thursday its doughnut chain will partner with Coca-Cola Co  to launch a line of bottled  coffee beverages in the United States  its first foray into the ready-to-drink coffee market dominated by rival Starbucks Corp.",
        "date": "09292016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Dunkin' partners with Coca-Cola on bottled coffee "
    },
    {
        "content": "MEXICO CITY  Sept 30 Mexican bottling company Arca Continental said on Friday that Coca-Cola Bottling Company United will not longer form part of a previously announced intention to sign a deal to operate the Coca-Cola bottling franchise in parts of the United States.",
        "date": "09302016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Arca says Coke's United no longer part of possible U.S. bottling deal "
    },
    {
        "content": "Sept 29 Dunkin' Brands Group Inc said its donut chain  Dunkin' Donuts  will partner with Coca-Cola Co  to launch a line of cold coffee beverages in the United States  its first foray into the ready-to-drink coffee market.",
        "date": "09292016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Dunkin' Donuts partners with Coca-Cola to enter cold coffee market "
    },
    {
        "content": "* Michael Coombs will be re-joining CCI to assume the Chief Financial Officer (CFO) position as of as of Jan. 1  2017",
        "date": "09272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek names Michael Coombs as CFO as of Jan. 1  2017 "
    },
    {
        "content": "Sept 26 Japan's two leading Coca-Cola bottlers agreed to merge as early as next spring to create a company with annual sales of more than 1 trillion yen ($9.95 billion) in a declining domestic soft-drink market  Nikkei reported  citing sources.",
        "date": "09262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Japanese Coca-Cola bottlers agree to merge - Nikkei "
    },
    {
        "content": "* Japan's two leading Coca-Cola bottlers have reached a basic agreement to merge as early as next spring- Nikkei",
        "date": "09262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Japan's two leading Coca-Cola bottlers to merge as early as next spring- Nikkei "
    },
    {
        "content": "* Evan G. Greenberg to resign from the Coca-Cola Company board of directors",
        "date": "09262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Evan Greenberg to resign from Coca-Cola board "
    },
    {
        "content": "* CCHBC Lithuania has entered into a binding agreement for sale of 50 pct of Neptunas' share capital to Coca-Cola Company",
        "date": "09162016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca Cola HBC Lithuania unit to sell 50 pct Neptunas stake to Coca-Cola Co "
    },
    {
        "content": "* Cola European Partners to present at Barclays global consumer staples conference; affirms full-year 2016 EPS guidance",
        "date": "09072016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola European partners affirms FY 2016 EPS guidance "
    },
    {
        "content": "* Fitch Rates Coca-Cola's benchmark Euro notes 'A+'; Outlook negative",
        "date": "08302016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Fitch rates Coca-Cola's benchmark Euro notes 'A+' "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 30 (Fitch) Fitch Ratings has assigned an 'A+' rating to The  Coca-Cola Company's (Coca-Cola) benchmark issuance of Euro senior notes due  2036. The Rating Outlook is Negative. Coca-Cola had approximately $48 billion of  debt as of July 1  2016. A complete list of ratings follows at the end of this  release. The notes will be issued by Coca-Cola and will rank equally with the company's  senior unsecured obligations. Coca-",
        "date": "08302016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Fitch Rates Coca-Cola's Benchmark Euro Notes 'A+'; Outlook Negative "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 29 (Fitch) Fitch Ratings has assigned an 'A+' rating to The  Coca-Cola Company's (Coca-Cola) multi-tranche proposed benchmark issuance of  senior notes including senior notes due 2021 and senior notes due 2026. The  Rating Outlook is Negative. Coca-Cola had approximately $48 billion of debt as  of July 1  2016. A complete list of ratings follows at the end of this release. The notes will be issued by Coca-Cola and will r",
        "date": "08292016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Fitch Rates Coca-Cola's Benchmark Issuance 'A+'; Outlook Negative "
    },
    {
        "content": "* Moody's on Coca-Cola - All other ratings for the company remain unchanged. The outlook is stable  Source text for Eikon:  Further company coverage:",
        "date": "08302016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Moody's rates Coca-Cola's new Euro notes at Aa3 "
    },
    {
        "content": "* S&P - The Coca-Cola Co.'s proposed 5 and 10 year fixed notes assigned 'AA-' ratings",
        "date": "08292016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-S&P rates Coca-Cola's proposed 5 and 10 year fixed notes 'AA-' "
    },
    {
        "content": "* Moody's on Coca-Cola - All other ratings for the company remain unchanged. The outlook is stable  Source text for Eikon:  Further company coverage:",
        "date": "08292016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Moody's rates Coca-Cola's new notes at AA3 "
    },
    {
        "content": "* Fitch affirms Long-Term Foreign Currency Issuer Default rating (IDRs) at BBB changes the outlook to 'negative' from 'stable'",
        "date": "08262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Fitch affirms Coca-Cola Icecek long-term foreign currency IDR  cuts outlook "
    },
    {
        "content": "JOHANNESBURG  Aug 18 Africa's biggest Coke bottler  Coca-Cola Beverages Africa  will rethink its spending plans in South Africa if Pretoria's proposed tax on sugary drinks gets the green light  a spokeswoman said on Thursday.",
        "date": "08182016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke bottler to rethink South Africa spending plans due to sugar tax "
    },
    {
        "content": "* Q2 net profit of 148.1 million lira ($50.55 million) versus 149.2 million lira year ago",
        "date": "08162016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek Q2 net profit slightly down at 148.1 mln lira "
    },
    {
        "content": "* Shares up 5.5 pct  top gainer in FTSE 100   (Adds CEO comments  shares)",
        "date": "08112016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "UPDATE 2-Coca-Cola HBC upbeat on full year after first-half profit rises "
    },
    {
        "content": "* CEO says expects volume to improve in 2h  helped by one additional selling day and new marketing plans",
        "date": "08112016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola HBC comments on outlook  investment "
    },
    {
        "content": "LONDON  Aug 11 Soft drink bottler Coca-Cola HBC  reported lower revenue for the first half of the year hurt by unseasonably cool weather in Europe and economic problems in other markets  it said on Thursday.",
        "date": "08112016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola HBC sales fall on cool weather  economic uncertainty "
    },
    {
        "content": "* Reaches agreement with Tek-Gida labor union on collective labor agreement",
        "date": "08082016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek reaches agreement with labor union on collective labor agreement "
    },
    {
        "content": "* Co's entering into a new multi-year research and development agreement with Coca-Cola company  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "07262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Chromocell extends collaboration with Coca-Cola Company "
    },
    {
        "content": "* Dow +0.2 pct  S&P -0.01 pct  Nasdaq +0.54 pct   (Updates following Fed announcement)",
        "date": "07272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "US STOCKS-Wall St recovers after Fed keeps rates steady "
    },
    {
        "content": "MEXICO CITY  July 27 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) said on Wednesday that second-quarter net profit rose more than a quarter compared with the year-earlier period  helped by its fast-growing retail division.",
        "date": "07272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "CORRECTED-UPDATE 2-Femsa's profit jumps on Mexico retail strength "
    },
    {
        "content": "* Dow down 0.07 pct  S&P down 0.27 pct  Nasdaq up 0.32 pct   (Updates to early afternoon)",
        "date": "07272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "US STOCKS-Wall St treads lower ahead of Fed rate decision "
    },
    {
        "content": "Coca-Cola Co  reported lower-than-expected quarterly revenue due to weakness in China and certain Latin American economies  and the company warned of no improvement in those markets for the rest of the year. | Video ",
        "date": "07272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola's revenue misses on weak China  LatAm markets "
    },
    {
        "content": "* Indexes: Dow up 0.06 pct  S&P down 0.14 pct  Nasdaq up 0.44 pct   (Adds details  comments  updates prices)",
        "date": "07272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "US STOCKS-Wall St gives up gains as Coke  weak oil drag "
    },
    {
        "content": "* Shares fall to more than three-month low   (Adds executive's comments from conference call; updates shares)",
        "date": "07272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 3-Coca-Cola's revenue misses on weak China  LatAm markets "
    },
    {
        "content": "* Coca-Cola HBC gains after upgrade   (Adds detail and updates prices at close)",
        "date": "07192016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Britain's FTSE pulls back from 11-month closing high "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.35 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "07212016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola sets regular quarterly dividend of $0.35 per share "
    },
    {
        "content": "* Coca-Cola president & COO James Quincey on CNBC - business continues to be robust in the UK   Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola COO quincey says business continues to be robust in UK - CNBC "
    },
    {
        "content": "* Consumer environment weakening in China  wholesalers are adjusting to lower expected sales growth and bringing down inventory levels",
        "date": "07272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola on conf call- not expecting a material improvement in weak markets in remainder of year "
    },
    {
        "content": "July 27 Coca-Cola Femsa  Latin America's largest Coke bottler  reported a 25 percent fall in second-quarter profit  hurt by lower margins and higher raw material costs.",
        "date": "07272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "CORRECTED-Mexican bottler Coke Femsa's profit falls 25 pct "
    },
    {
        "content": "* Qtrly comparable total revenues grew 9.1 pct to ps. 38 536 million",
        "date": "07272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Femsa says Q2 comparable revenue rose 9.1 pct "
    },
    {
        "content": "NEW YORK  July 8 Flat beverages are helping overall sales at Coca-Cola Co and PepsiCo Inc  stay fizzy in Mexico despite a tax on sodas.",
        "date": "07082016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "PepsiCo  Coca-Cola still sparkle in Mexico after fizzy drinks tax "
    },
    {
        "content": "* On June 29  Co  Coca-Cola Company and Coca-Cola Refreshments USA Inc entered into an agreement - SEC filing",
        "date": "07052016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca Cola Bottling Co Consolidated  Coca-Cola Co and Coca-Cola Refreshments USA enter into an agreement "
    },
    {
        "content": "* In accordance with law  products containing GMO ingredients will have required language printed on label or on stickers",
        "date": "06282016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola says lower-volume brands and packages could be temporarily unavailable in Vermont "
    },
    {
        "content": "* Cola co - now expects items to be a 5 to 6 point headwind on net revenues and a 4 to 5 point headwind on income before taxes in q2",
        "date": "06162016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola now expects items to be a 5-6 point headwind on net revenues "
    },
    {
        "content": "* Coca-Cola Company to refranchise territory to Coca-Cola Bottling Co consolidated",
        "date": "06152016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola to refranchise territory to Coca-Cola Bottling Co consolidated "
    },
    {
        "content": "* Amazon plans \"methodical and considered\" UK rollout   (Adds detail  analyst  executive comment)",
        "date": "06092016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-AmazonFresh cranks up pressure on British supermarkets "
    },
    {
        "content": "SAN FRANCISCO  June 6 Investors looking for stability and dividends have been pouring money into consumer staples stocks of late  ignoring warnings from Wall Street's analysts about pricey valuations for companies like Clorox  and Campbell Soup.",
        "date": "06062016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Wall St pours money into consumer staples as valuations climb "
    },
    {
        "content": "* HP Inc joins Coca-Cola and Microsoft in declining to donate to the Republican National Convention -NYT  Source text: (http://nyti.ms/25zot3u)   (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "05312016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-HP joins Coca-Cola  Microsoft in declining to donate to Republican National Convention-NYT "
    },
    {
        "content": "Coca-Cola Co  and its largest bottler  Coca-Cola Femsa   said they agreed to buy Unilever's  AdeS soy-based beverage unit for about $575 million as the soft-drinks giant bolsters its portfolio of healthy and non-fizzy drinks.",
        "date": "06012016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke  Coke Femsa to buy Unilever's soy beverage business "
    },
    {
        "content": "* Recommended to tribunal that Anheuser-Busch InBev-SABMiller deal be approved with conditions",
        "date": "05312016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-S.Africa's Competition Commission recommends conditional approval of ABInBev-SabMiller deal "
    },
    {
        "content": "NEW YORK The United States has seized low-calorie sweetener stevia imported from China by PureCircle Ltd  making it the latest company to be targeted by a new law that bans imports of products made by forced labor.",
        "date": "06012016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "U.S. impounds PureCircle stevia under new forced labor law "
    },
    {
        "content": "SYDNEY  May 31 (IFR) - Coca-Cola has announced details of a debut Kangaroo bond transaction with the global drinks giant expected to price four and eight-year bonds no later than tomorrow  June 1.",
        "date": "05312016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola launches debut 4 and 8 year kangaroo bond offering "
    },
    {
        "content": "June 1 Coca-Cola Co and its largest bottler  Coca-Cola Femsa  said they agreed to buy Unilever's AdeS soy-based beverage unit for about $575 million as the soft-drinks giant bolsters its portfolio of healthy and non-fizzy drinks.",
        "date": "06012016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Coke  Coke Femsa to buy Unilever's soy beverage business "
    },
    {
        "content": "* The Coca-Cola company and coca-cola femsa to acquire ades soy-based beverage business from unilever",
        "date": "06012016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Co  Coca-Cola FEMSA to buy AdeS Soy-Based beverage biz from Unilever "
    },
    {
        "content": "* Says credit rating agency Moody's affirms long term credit rating at Baa3 with stable outlook",
        "date": "05302016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "REFILE-BRIEF-Moody's affirms Coca-Cola Icecek's long term credit rating at Baa3 "
    },
    {
        "content": "SINGAPORE  May 26 (IFR) - The Coca-Cola Co  rated Aa3/AA-/A+  has hired banks to manage its debut in the Kangaroo bond market.",
        "date": "05262016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola hires for debut Kangaroo bond issue "
    },
    {
        "content": "The Venezuelan bottler of Coca-Cola has halted production of the sugar-sweetened beverage due to a lack of sugar  a Coca-Cola Co  spokeswoman said on Monday.",
        "date": "05242016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Production of Coke halted in Venezuela for lack of sugar "
    },
    {
        "content": "* The Coca-Cola Company announces new international structure  promotes key leaders",
        "date": "05242016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola announces new international structure "
    },
    {
        "content": "May 23 The Venezuelan bottler of Coca-Cola has halted production of the sugar-sweetened beverage due to a lack of sugar  a Coca-Cola Co spokeswoman said on Monday.",
        "date": "05242016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Production of Coke halted in Venezuela for lack of sugar "
    },
    {
        "content": "MEXICO CITY  May 25 Mexican bottling company Arca Continental said on Wednesday it had signed a letter of intent with the Coca-Cola Company and Coca-Cola Bottling Company UNITED to operate the Coca-Cola franchise in parts of the United States.    (Reporting by Gabriela Lopez; Editing by Sandra Maler)",
        "date": "05252016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Mexico's Arca signs letter of intent with Coca-Cola bottling franchise in U.S. "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 25 (Fitch) Fitch Ratings has assigned an 'A+' rating to The  Coca-Cola Company's (Coca-Cola) multi-tranche proposed benchmark issuance of  senior notes including senior notes due 2019 and senior notes due 2026. The  Rating Outlook is Negative. Coca-Cola had approximately $46.8 billion of debt as  of April 1  2016. A complete list of ratings follows at the end of this release. The notes will be issued by Coca-Cola and will r",
        "date": "05252016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Fitch Rates Coca-Cola's Benchmark Issuance 'A+'; Outlook Negative "
    },
    {
        "content": "LONDON  May 13 Coca-Cola HBC  a bottler of Coca-Cola drinks  is open to further acquisitions in Africa if the right opportunity became available  its chief executive said on Friday.",
        "date": "05132016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola HBC would consider expanding in Africa "
    },
    {
        "content": "* Says it will merge with a Tokyo-based wholly owned unit COCA-COLA EAST JAPAN PRODUCTS COMPANY  LIMITED  on Oct. 1",
        "date": "05132016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola East Japan to merge with Tokyo sales unit "
    },
    {
        "content": "* Reported volumes stable in Q1 with an improving underlying trend in established  emerging market segments",
        "date": "05132016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola HBC - Q1 sales revenues drop on weak currencies  strong euro "
    },
    {
        "content": "JOHANNESBURG South Africa's Competition Tribunal on Tuesday conditionally approved a SABMiller  and Coca-Cola  deal to combine their African soft drink operations into what would be the continent's biggest Coke drinks bottler.",
        "date": "05102016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "South Africa approves SABMiller  Coke bottling deal with conditions "
    },
    {
        "content": "* Transaction to complete as soon as practicable   (Adds comment from Coca-Cola and Gutsche)",
        "date": "05102016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-South Africa approves SABMiller  Coke bottling deal with conditions "
    },
    {
        "content": "JOHANNESBURG  May 10 South Africa's Competition Tribunal on Tuesday conditionally approved a merger between SABMiller and Coca-Cola to merge African soft drink operations into what would be the continent's biggest Coke drinks bottler.",
        "date": "05102016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "South Africa's antitrust authority conditionally approves SABMiller  Coke bottling deal "
    },
    {
        "content": "JOHANNESBURG/LONDON SABMiller  and Coca-Cola  have agreed concessions with the South African government to win approval for their plan to merge African soft drink operations into what would be the continent's biggest Coke drinks bottler.",
        "date": "05042016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "SABMiller  Coke agree concessions with South Africa over bottling deal "
    },
    {
        "content": "JOHANNESBURG SABMiller  and Coca-Cola  have agreed concessions with the South African government to win approval for a deal to combine their soft-drink operations  the companies said on Wednesday.",
        "date": "05042016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "SABMiller  Coke agree concessions with South Africa over bottling merger "
    },
    {
        "content": "* Coca-Cola Beverages Africa Merger Parties and South African Government reach agreement on public interest conditions for merger",
        "date": "05042016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-SABMiller  Coke reach agreement with S.Africa over deal conditions "
    },
    {
        "content": "* Q1 revenue of 1.30 billion lira ($456.38 million) versus 1.20 billion lira year ago",
        "date": "05032016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek Q1 net result turns to profit of 29.4 mln lira "
    },
    {
        "content": "OMAHA  Neb.  April 30 Warren Buffett on Saturday vigorously defended Berkshire Hathaway Inc's   large  long-standing investment  in Coca-Cola Co  rejecting critics who say the company's sugary drinks harm people's health.",
        "date": "04302016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Buffett defends Berkshire's big Coke stake "
    },
    {
        "content": "MEXICO CITY Latin America's biggest Coke bottler Coca-Cola Femsa  on Wednesday said its first-quarter profit rose 9.3 percent  helped by an increase in sales.",
        "date": "04272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke Femsa says first-quarter profit rises on sales increase "
    },
    {
        "content": "* Qtrly comparable revenue 34.62 billion pesos  Source text for Eikon:  Further company coverage:",
        "date": "04272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-cola Femsa reports Q1 non-gaap earnings 1.13 peson per share "
    },
    {
        "content": "* The board of directors of the Coca-Cola Company elects officers  declares quarterly dividend",
        "date": "04282016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Company elects Helen Smith Price  Christine Quinn as vice presidents "
    },
    {
        "content": "Coca-Cola Co's sales fell for the fourth straight quarter as demand weakened for its fizzy drinks in Europe and a strong dollar ate into revenue from other markets outside the United States  including Latin America. | Video ",
        "date": "04202016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Weak Europe demand  strong dollar take fizz out of Coke's sales "
    },
    {
        "content": "* Indexes end higher: Dow 0.24 pct  S&P 0.08 pct  Nasdaq 0.16 pct   (Updates to close)",
        "date": "04202016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "US STOCKS-Wall St flirts with record high levels as companies report "
    },
    {
        "content": "April 20 Coca-Cola Co's sales fell for the fourth straight quarter as demand weakened for its fizzy drinks in Europe and a strong dollar ate into revenue from other markets outside the United States  including Latin America.",
        "date": "04202016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "CORRECTED-UPDATE 3-Weak Europe demand  strong dollar take fizz out of Coke's sales "
    },
    {
        "content": "* Indexes up: Dow 0.57 pct  S&P 0.41 pct  Nasdaq 0.51 pct   (Updates to afternoon)",
        "date": "04202016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "US STOCKS-Wall St nears record high after upbeat quarterly reports "
    },
    {
        "content": "* Indexes up: Dow 0.37 pct  S&P 0.24 pct  Nasdaq 0.35 pct   (Updates to early afternoon)",
        "date": "04202016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "US STOCKS-Oil rebound nudges Wall St higher "
    },
    {
        "content": "* Indexes: Dow flat  S&P down 0.06 pct  Nasdaq down 0.18 pct   (Updates to open)",
        "date": "04202016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "US STOCKS-Wall St flat as strong earnings counter fall in oil "
    },
    {
        "content": "* Swire Coca-Cola USA signs definitive agreement with the Coca-Cola company to acquire territory in Albuquerque  N.M.",
        "date": "04202016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Swire Coca-Cola USA signs agreement with Coca-Cola to buy territory in Albuquerque "
    },
    {
        "content": "* Coca-Cola Beverages Florida to acquire four production facilities from the Coca-Cola Company",
        "date": "04202016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Beverages Florida to buy 4 facilities in Florida from Coca-Cola Co "
    },
    {
        "content": "April 20 Coca-Cola Co's sales fell for the fourth straight quarter as demand for its fizzy drinks declined in Europe and a strong dollar eroded the value of sales in markets outside the United States  including Latin America.",
        "date": "04202016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "REFILE-UPDATE 1-Coca-Cola sales fall on strong dollar  weak Europe demand "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 25 (Fitch) Fitch Ratings has affirmed the Issuer Default Ratings  (IDRs) and the debt ratings of The Coca-Cola Company (Coca-Cola) and its  subsidiaries at 'A+/F1'. The Rating Outlook is Negative. A full list of rating  actions follows at the end of this release.  KEY RATING DRIVERS The Negative Outlook reflects Coca-Cola's elevated leverage (on both a gross  leverage and supplemental net leverage basis) as currently high",
        "date": "03252016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Fitch Affirms Coca-Cola's IDRs at 'A+/F1'; Outlook Negative "
    },
    {
        "content": "LONDON  March 18 The British government's planned levy on sugary soft drinks means more business for suppliers of specialty ingredients that boost sweetness without adding calories and can mask aftertastes or add texture.",
        "date": "03182016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "CORRECTED-UK sugary drink tax could be sweet for food ingredient suppliers "
    },
    {
        "content": "* Cola on Great Britain ruling - \"we understand obesity is an issue that needs to be addressed and will continue our work to reduce the sugar and calories in our drinks\"  Further company coverage:",
        "date": "03162016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola comments on Great Britain ruling "
    },
    {
        "content": "* Proposes to pay 0.1003 lira dividend per C group share for FY 2015",
        "date": "03092016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek announces dividends for FY 2015 "
    },
    {
        "content": "* Says extends contract with Russian units of Coca-Cola Hellenic to provide high-speed internet access services\u007f\u007f",
        "date": "03032016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Rostelecom extends contract with Russian Coca-Cola Hellenic units "
    },
    {
        "content": "March 2 S.Africa's Congress of South African Trade Unions(COSATU):",
        "date": "03022016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-S.Africa's COSATU say SABMiller should ensure job protection "
    },
    {
        "content": "* FY 2015 net profit of 117.2 million lira  ($40.05 million) versus 315.4 million lira year ago",
        "date": "03032016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek 2015 net profit shrinks to 117.2 mln lira "
    },
    {
        "content": "Feb 27 Warren Buffett's Berkshire Hathaway Inc  on Saturday said fourth-quarter profit rose 32 percent  helped by improved results in its insurance operations and higher gains from investments and derivatives.",
        "date": "02272016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Warren Buffett's Berkshire Hathaway quarterly profit jumps almost one third "
    },
    {
        "content": "MEXICO CITY  Feb 23 Latin America's biggest Coke bottler Coca-Cola Femsa on Tuesday said its fourth-quarter profit rose 1.5 percent.",
        "date": "02232016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Mexico's Coke Femsa reports slightly higher 4th-qtr profit "
    },
    {
        "content": "LONDON  Feb 19 Soft drink bottler Coca-Cola HBC  reported a decline in annual revenue on Friday  hurt by devaluations of currencies such as the Russian rouble.",
        "date": "02192016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola HBC revenue falls on foreign exchange hit "
    },
    {
        "content": "SYDNEY  Feb 16 (IFR) - The Coca-Cola Company  (Aa3/AA/A+) looks set to provide the first real test of the year for the corporate Kangaroo market  having mandated Deutsche Bank to arrange investor meetings from March 7 for a potential debut trade.",
        "date": "02162016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola hopes to refresh corporate Kangaroo market "
    },
    {
        "content": "Feb 10 Berkshire Hathaway Inc has bought an additional $1 billion of stock in Phillips 66  this year  and now owns roughly 14.1 percent of the oil refiner.",
        "date": "02102016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Buffett's Berkshire buys $1 bln worth of Phillips 66 stock in 2016 "
    },
    {
        "content": "Coca-Cola Co  reported a better-than-expected profit in the last three months of 2015  helped by aggressive cost-cutting and lower commodity costs.",
        "date": "02092016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Cost cuts  cheaper commodities help Coca-Cola top profit estimates "
    },
    {
        "content": "* Global sales volume up 3 pct   (Adds details from conference call  shares  graphic)",
        "date": "02092016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 3-Cost cuts  cheaper commodities help Coca-Cola top profit estimates "
    },
    {
        "content": "Feb 9 Coca-Cola Co reported an 8 percent fall in quarterly net revenue  as a strong dollar once again reduced the value of sales from outside the United States.",
        "date": "02092016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola's quarterly sales fall 8 pct hit by strong dollar "
    },
    {
        "content": "Feb 9 Coca-Cola Co said it would refranchise all its North America bottling operations  including its 39 cold-fill production factories  three years earlier than expected  as the soda maker looks to cut costs.",
        "date": "02092016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola to fully refranchise N America bottling operations by 2017 "
    },
    {
        "content": "SAN FRANCISCO Coca-Cola Co   PepsiCo  and other consumer-facing companies spending big bucks to advertise during Sunday's Super Bowl football extravaganza will be making a play for more market share to offset a slow economy and less overseas revenue.",
        "date": "02052016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "For Coke and Pepsi  Super Bowl is market share play "
    },
    {
        "content": "SAN FRANCISCO  Feb 5 Coca-Cola Co  PepsiCo and other consumer-facing companies spending big bucks to advertise during Sunday's Super Bowl football extravaganza will be making a play for more market share to offset a slow economy and less overseas revenue.",
        "date": "02052016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Wall St Week Ahead-For Coke and Pepsi  Super Bowl is market share play "
    },
    {
        "content": "LAGOS Coca-Cola  has bought a 40 percent stake in Nigerian juice and snack producer Chi Ltd  it said on Saturday  as it continues to expand in Africa to tap a young and fast-growing population.",
        "date": "01302016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola takes stake in Nigerian juice maker Chi "
    },
    {
        "content": "LAGOS  Jan 30 The Coca-Cola Company has bought a 40-percent stake in Nigerian juice and dairy firm Chi Ltd from unlisted European firm TGI Group  both companies said in a statement on Saturday.",
        "date": "01302016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola buys stake in Nigerian juice and dairy firm Chi "
    },
    {
        "content": "Jan 21 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "01212016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  Jan 21 (Thomson Reuters Foundation) - More than a third of the world's food goes uneaten  and many crops harvested in Africa are discarded rather than sold  according to an initiative announced on Thursday by the Rockefeller Foundation to cut food waste and loss by half.",
        "date": "01212016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "New $130 million project aims to cut food waste from fields to tables "
    },
    {
        "content": "BUENOS AIRES Coca-Cola Co  will invest $1 billion over four years in its bottling and distribution operations in Argentina  the company said on Thursday  and leave the door open to further acquisitions in the South American country.",
        "date": "01212016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola to invest $1 billion in Argentina over next four years "
    },
    {
        "content": "BUENOS AIRES  Jan 21 Coca-Cola Co will invest $1 billion over four years in its bottling and distribution operations in Argentina  the company said on Thursday  and leave the door open to further acquisitions in the South American country.",
        "date": "01212016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Coca-Cola to invest $1 bln in Argentina over next four years "
    },
    {
        "content": "KIEV Ukrainian prosecutors have launched a criminal investigation into the online publication by U.S. drinks companies Coca-Cola and Pepsico of a map that showed Crimea as a part of Russia  a Ukrainian lawmaker said on Thursday.",
        "date": "01212016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Ukraine investigates Coca-Cola and Pepsico over Crimea map row: MP "
    },
    {
        "content": "KIEV  Jan 21 Ukrainian prosecutors have launched a criminal investigation into the online publication by U.S. drinks companies Coca-Cola and Pepsico of a map that showed Crimea as a part of Russia  a Ukrainian lawmaker said on Thursday.",
        "date": "01212016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Ukraine investigates Coca-Cola and Pepsico over Crimea map row -MP "
    },
    {
        "content": "BUENOS AIRES  Jan 21 Coca-Cola Co will invest $1 billion over four years in its bottling and distribution operations in Argentina  the office of Argentine President Mauricio Macri said in a statement on Thursday.",
        "date": "01212016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Argentina says Coca-Cola to invest $1 bln over four years "
    },
    {
        "content": "* \u007fTurkey sales volume made up 51 percent of total volume in 2015  while share of international sales volume was 49 percent",
        "date": "01132016",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek 2015 sales volume was up by 1.9% to 1.15 bln uc "
    },
    {
        "content": "MOSCOW/KIEV  Jan 5 U.S. drinks firm Coca-Cola  on Wednesday blamed a marketing agency for a map used in an online advertising campaign that showed Crimea to be part of Russia and which drew protests and threats of a boycott from angry Ukrainians.",
        "date": "01062016",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola blames ad agency for map showing Crimea as part of Russia "
    },
    {
        "content": "JOHANNESBURG  Dec 17 SABMiller and Coca-Cola's proposed deal to combine their operations that mix  bottle and distribute soft drinks in Africa  cleared a major hurdle on Thursday after South Africa's competition watchdog gave its preliminary approval.",
        "date": "12172015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "South Africa's antitrust watchdog gives SABMiller  Coke deal preliminary approval "
    },
    {
        "content": "* Has recommended a conditional approval of merger whereby SABMiller  Gutsche Family Investments Ltd (GFI) and The Coca Cola Company (TCCC) are proposing to combine",
        "date": "12172015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Competition Commission says recommends conditional approval of bottling operations of SABMiller  GFI  TCCC "
    },
    {
        "content": "Coca-Cola Co  will appoint Hendrik Steckhan as president of its U.S. operations and named Stuart Kronauge and Ivan Pollard as co-heads of U.S. marketing  according to an internal memo.",
        "date": "12082015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola appoints Hendrik Steckhan to lead U.S. operations "
    },
    {
        "content": "NEW YORK  Dec 8 Taking coffee maker Keurig Green Mountain Inc private will give JAB Holding Co an opportunity to press for higher margins and even increase prices for the single-serve K-Cups used in about 21 million U.S. homes  analysts and industry bankers said.",
        "date": "12082015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Stumptown in a K-Cup? Keurig deal brings margin opportunity "
    },
    {
        "content": "NEW YORK Taking coffee maker Keurig Green Mountain Inc  private will give JAB Holding Co an opportunity to press for higher margins and even increase prices for the single-serve K-Cups used in about 21 million U.S. homes  analysts and industry bankers said.",
        "date": "12092015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Stumptown in a K-Cup? Keurig deal brings margin opportunity "
    },
    {
        "content": "NEW DELHI  Dec 11 The Indian subsidiary of Coca-Cola Co said on Friday it may have to close some bottling plants if the government pushes through a proposal that would subject fizzy drinks to a 40 percent \"sin\" tax  as part of a broader fiscal overhaul.",
        "date": "12112015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "UPDATE 2-Coca-Cola India says may have to shut factories if new sin tax passed "
    },
    {
        "content": "Dec 8 Coca-Cola Co will appoint Hendrik Steckhan as president of its U.S. operations and named Stuart Kronauge and Ivan Pollard as co-heads of U.S. marketing  according to an internal memo.",
        "date": "12082015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Coca-Cola appoints Hendrik Steckhan to lead U.S. operations "
    },
    {
        "content": "Dec 8 Coca-Cola Co has appointed Hendrik Steckhan as president of its U.S. operations and named Stuart Kronauge and Ivan Pollard as co-heads of U.S. marketing  the Wall Street Journal reported.",
        "date": "12082015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola appoints Hendrik Steckhan to lead U.S. operations-WSJ "
    },
    {
        "content": "* Says unit to cooperate with Coca-Cola in Zhuhai on logistics",
        "date": "12032015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Zhuhai Port's unit to cooperate with Coca-Cola in Zhuhai on logistics "
    },
    {
        "content": "* Signs advertisement rights agreement with Coca-Cola Mesrubat Pazarlama at seasonal 900 000 lira ($312 283.14) plus VAT for 2015-2016 and 2016-2017 seasons",
        "date": "12022015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Trabzonspor signs advertisement rights agreement with Coca-Cola Mesrubat "
    },
    {
        "content": "NEW DELHI (Thomson Reuters Foundation) - Eighteen village councils in Uttar Pradesh are demanding a local Coca-Cola bottling plant be prohibited from extracting water from the ground  claiming its over usage has led to water scarcity in the area  said an environmental campaign group.",
        "date": "11282015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Varanasi villagers blame Coca-Cola for water scarcity "
    },
    {
        "content": "* Says committed to performance  employees during takeover period   (Adds comments by CEO  analyst)",
        "date": "11122015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Pricey beers lift SABMiller's quarterly underlying sales "
    },
    {
        "content": "ATHENS  Nov 5 Soft drinks bottler Coca-Cola HBC  posted on Thursday a 2.7 percent drop in net sales revenues in the third quarter year-on-year  hurt by adverse currency movements in Russia and other markets.",
        "date": "11052015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Drinks bottler Coca-Cola HBC sales revenue down on currency headwinds "
    },
    {
        "content": "* Reported on Wednesday Q3 revenue of 2.20 billion lira  ($768.67 million) versus 1.92 year ago",
        "date": "11052015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek Q3 net profit shrinks to 54.3 million lira "
    },
    {
        "content": "MEXICO CITY  Oct 28 Latin America's largest Coke bottler  Coca-Cola Femsa  reported lower third-quarter profit on Wednesday  hurt by currency volatility and weak sales.",
        "date": "10282015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "UPDATE 2-Mexico's Coke Femsa 3rd-qtr profit slumps on volatile forex "
    },
    {
        "content": "WASHINGTON  Oct 26 Indonesian President Joko Widodo  speaking after a meeting with U.S. President Barack Obama on Monday  said his Southeast Asian country intends to join the Trans-Pacific Partnership trade deal the United States has forged with 11 other nations.",
        "date": "10272015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 3-President says Indonesia intends to join TPP trade deal "
    },
    {
        "content": "MEXICO CITY  Oct 28 Latin America's largest Coke bottler  Coca-Cola Femsa  on Wednesday reported a weaker third-quarter profit  hurt by currency volatility.",
        "date": "10282015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Mexico's Coke Femsa reports lower third-quarter profit "
    },
    {
        "content": "MEXICO CITY  Oct 28 Latin America's largest Coke bottler  Coca-Cola Femsa  on Wednesday reported a preliminary third-quarter profit of 1.988 billion pesos ($117.4 million).",
        "date": "10282015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke Femsa reports preliminary third-quarter profit "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 22 (Fitch) Fitch Ratings has assigned an 'A+' rating to The  Coca-Cola Company's (Coca-Cola) multi-tranche issuance of senior notes  including: --$750 million senior fixed rate notes due 2017; --$1.5 billion senior fixed rate notes due 2020; --$1.75 billion senior fixed rate notes due 2025.  The Rating Outlook is Negative.  Coca-Cola had approximately $46.2 billion of debt as of Oct. 2  2015. A complete  list of ratings",
        "date": "10222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Fitch Rates Coca-Cola's Issuance 'A+'; Outlook Negative "
    },
    {
        "content": "SHANGHAI An environmental protection bureau in northwest China said police temporarily detained an executive at a Coca-Cola Co bottling facility in Gansu province after it found the facility had falsified pollution data.",
        "date": "10222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "China environment bureau says Coca-Cola bottling plant falsified pollution data "
    },
    {
        "content": "SHANGHAI  Oct 22 An environmental protection bureau in northwest China said police temporarily detained an executive at a Coca-Cola Co bottling facility in Gansu province after it found the facility had falsified pollution data.",
        "date": "10222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-China environment bureau says Coca-Cola bottling plant falsified pollution data "
    },
    {
        "content": "Coca-Cola Co  reported a bigger-than-expected drop in quarterly sales due to a strong dollar  and the company said it expected the currency to hurt its full-year revenue more than previously anticipated.",
        "date": "10212015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola warns of bigger hit on revenue from strong dollar "
    },
    {
        "content": "Oct 21 Coca-Cola Co reported a bigger-than-expected drop in quarterly sales due to a strong dollar  and the company said it expected the currency to hurt its full-year revenue more than previously anticipated.",
        "date": "10212015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 3-Coca-Cola warns of bigger hit on revenue from strong dollar "
    },
    {
        "content": "Oct 21 Coca-Cola Co reported a bigger-than-expected drop in quarterly sales due to a strong dollar and the company said it expected the currency to hurt its full-year revenue more than previously anticipated.",
        "date": "10212015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "CORRECTED-UPDATE 2-Coca-Cola warns of bigger hit on revenue from strong dollar "
    },
    {
        "content": "Oct 21 Coca-Cola Co's quarterly revenue fell nearly 5 percent as a strong dollar reduced the value of sales in markets outside North America.",
        "date": "10212015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola's quarterly revenue falls nearly 5 pct "
    },
    {
        "content": "* Signs letter of intent with Coca-Cola Mesrubat for advertisement rights",
        "date": "10212015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Trabzonspor signs letter of intent with Coca-Cola Mesrubat for advertisement rights "
    },
    {
        "content": "Coca-Cola Co  has ended talks to invest in Chobani LLC after deciding that the maker of Greek yogurt was not the best fit for its portfolio  people familiar with the matter said on Wednesday.",
        "date": "10142015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola drops pursuit of Chobani: sources "
    },
    {
        "content": "Oct 14 Coca-Cola Co has ended talks to invest in Chobani LLC after deciding that the maker of Greek yogurt was not the best fit for its portfolio  a person familiar with the matter said on Wednesday.",
        "date": "10142015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola drops pursuit of Chobani-source "
    },
    {
        "content": "PepsiCo Inc  and Coca-Cola Co  are in talks to invest in Chobani LLC  in a deal that the Greek yogurt maker hopes could value it at as much $3 billion  including debt  according to people familiar with the matter.",
        "date": "10122015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Exclusive: Pepsi  Coca-Cola competing for investment in Chobani "
    },
    {
        "content": "BRUSSELS European Union competition regulators will rule by Nov. 9 whether to approve a plan by three Coca-Cola bottlers in Europe to merge their businesses to deal better with industry challenges.",
        "date": "10052015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "EU ruling on European Coca-Cola bottlers merger due by November 9 "
    },
    {
        "content": "BRUSSELS  Oct 5 European Union competition regulators will rule by Nov. 9 whether to approve a plan by three Coca-Cola bottlers in Europe to merge their businesses to deal better with industry challenges.",
        "date": "10052015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "EU ruling on European Coca-Cola bottlers merger due by Nov. 9 "
    },
    {
        "content": "NEW YORK  Oct 2 The Coca-Cola Co called on Friday for FIFA's President Sepp Blatter to step down immediately following Swiss authorities saying they were opening a criminal investigation into the head of the world soccer body.",
        "date": "10022015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola calls on FIFA's Sepp Blatter to resign immediately "
    },
    {
        "content": "NEW YORK  Oct 1 Coca-Cola Co agreed to change labels on its Vitaminwater beverages to resolve a lawsuit claiming it overstated their health benefits  but will not owe damages to consumers who alleged they were misled into buying the drinks.",
        "date": "10012015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke to change Vitaminwater labels to settle U.S. consumer lawsuit "
    },
    {
        "content": "NEW YORK Coca-Cola Co  said on Thursday it plans to sell nine production facilities to three of its largest independent bottlers as it seeks to unload low-margin assets and reduce manufacturing costs in the United States.",
        "date": "09242015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola to sell nine U.S. bottling plants  set up new supply system "
    },
    {
        "content": "NEW YORK  Sept 24 Coca-Cola Co said on Thursday it plans to sell nine production facilities to three of its largest independent bottlers as it seeks to unload low-margin assets and reduce manufacturing costs in the United States.",
        "date": "09242015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Coca-Cola to sell nine U.S. bottling plants  set up new supply system "
    },
    {
        "content": "Sept 24 Coca-Cola Co said its Coca-Cola Refreshments bottling unit was considering selling nine of its production facilities to three independent bottlers to reduce costs.",
        "date": "09242015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola considers selling nine bottling plants "
    },
    {
        "content": "Sept 18 Besiktas Futbol Yatirimlari Sanayi ve Ticaret As :",
        "date": "09182015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Besiktas signs letter of intent with Coca-Cola Mesrubat "
    },
    {
        "content": "Suja Life LLC said on Wednesday that it had sold minority stakes to Goldman Sachs Group Inc's  merchant banking division and to Coca-Cola Co   which will distribute its organic juices and smoothies.",
        "date": "08192015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke takes minority stake in organic juice maker Suja "
    },
    {
        "content": "Aug 19 Suja Life LLC said on Wednesday that it had sold minority stakes to Goldman Sachs Group Inc's  merchant banking division and to Coca-Cola Co  which will distribute its organic juices and smoothies.",
        "date": "08192015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Coke takes minority stake in organic juice maker Suja "
    },
    {
        "content": "Aug 19 Juice maker Suja Life LLC said Coca-Cola Co had bought a minority stake in the company and will distribute its products.",
        "date": "08192015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke takes minority stake in organic juice maker Suja Life "
    },
    {
        "content": "BERNE  Aug 18 FIFA will meet some of its leading commercial partners on Thursday to discuss reforms  a source close to soccer's world governing body said on Tuesday.",
        "date": "08182015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "UPDATE 1-Soccer-FIFA to meet sponsors on Thursday "
    },
    {
        "content": "ZURICH  Aug 18 FIFA will meet some of its leading commercial partners on Thursday to discuss reforms  a source close to soccer's governing body said on Tuesday.",
        "date": "08182015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Soccer-FIFA to meet sponsors on Thursday - source "
    },
    {
        "content": "Coca-Cola Co  on Thursday named James Quincey president and chief operating officer  setting up the long-time company veteran to possibly one day take the helm of the world’s largest soda maker.",
        "date": "08132015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola names Quincey president  fuelling succession speculation "
    },
    {
        "content": "Aug 13 Coca-Cola Co on Thursday named James Quincey president and chief operating officer  setting up the long-time company veteran to possibly one day take the helm of the world's largest soda maker.",
        "date": "08132015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 3-Coca-Cola names Quincey president  fuelling succession speculation "
    },
    {
        "content": "* Q2 net profit of 149.2 million lira ($53.84 million) versus 203.1 million lira year ago",
        "date": "08122015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek Q2 net profit down to 149.2 mln lira "
    },
    {
        "content": "Aug 13 Coca-Cola Co named James Quincey president and chief operating officer  a management shake-up that prompted questions of whether Quincey is now positioned to one day take the helm of the world's largest soda maker.",
        "date": "08132015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "CORRECTED-UPDATE 2-Coca-Cola names Quincey COO  raising succession question "
    },
    {
        "content": "* FTSE 100 rebounds from losses earlier in week  now up 0.8 pct",
        "date": "08132015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Britain's FTSE rebounds  Coca-Cola HBC leads gainers "
    },
    {
        "content": "Aug 13 Coca-Cola Co named James Quincey chief operating officer  and said company veteran Ahmet Bozer  who had been seen as a possible successor to Muhtar Kent as CEO  would be leaving.",
        "date": "08132015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola names Quincey COO  Bozer to leave "
    },
    {
        "content": "LONDON  Aug 13 Soft drink bottler Coca-Cola HBC  reported lower first-half sales on Thursday  as weak currencies offset a gain in volume.",
        "date": "08132015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "CORRECTED-Drinks bottler Coke HBC sales fall slightly "
    },
    {
        "content": "Coca-Cola Co  is nearing a deal to buy a minority stake in U.S. organic juice company Suja Life LLC  people familiar with the matter said on Friday  as the soft drink giant tries to identify the next big hit with consumers.",
        "date": "08082015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola near deal for organic juice company Suja: sources "
    },
    {
        "content": "Aug 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "08072015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Coca-Cola Co  is nearing a deal to buy a minority stake in U.S. organic juice company Suja Life LLC  people familiar with the matter said on Friday  as the soft drink giant tries to identify the next big hit with consumers.",
        "date": "08072015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola near deal for organic juice company Suja: sources "
    },
    {
        "content": "LONDON Three European bottlers of Coca-Cola  drinks have agreed to merge in what will be one of the continent's largest consumer products deals ever  as they hope greater scale and cost cutting will revitalize sluggish soft drink sales.",
        "date": "08062015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Three European Coca-Cola bottlers to merge "
    },
    {
        "content": "Aug 7 Coca-Cola Co is nearing a deal to buy a minority stake in U.S. organic juice company Suja Life LLC  people familiar with the matter said on Friday  as the soft drink giant tries to identify the next big hit with consumers.",
        "date": "08072015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola near deal for organic juice company Suja -sources "
    },
    {
        "content": "LONDON  Aug 4 Top UK shares opened on a downbeat note on Tuesday  with a mixed bag of corporate earnings and weakness in the technology sector offsetting reports of activist stake-building.",
        "date": "08042015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Earnings-day blues drags UK shares down "
    },
    {
        "content": "* CCEP to have enterprise value about 28 bln euros-source   (Adds Breakingviews link)",
        "date": "08062015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 5-Three European Coca-Cola bottlers to merge "
    },
    {
        "content": "Aug 7 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08072015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "PRESS DIGEST- Financial Times - Aug 7 "
    },
    {
        "content": "LONDON  Aug 6 Coca-Cola Enterprises  a European soft drink bottler  is to combine with Coca-Cola Iberian Partners (CCIP) and the German bottling business of Coca-Cola Co  the companies said on Thursday  creating the world's largest independent bottler of Coke drinks with business in 13 countries.",
        "date": "08062015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "CORRECTED-Coca-Cola bottlers agree to 3-way combination "
    },
    {
        "content": "ZURICH World Cup sponsor McDonald’s has joined Coca-Cola and Visa in urging FIFA to adopt an independent reform commission in response to the scandals that have plagued world soccer’s governing body.",
        "date": "08062015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "FIFA sponsor McDonald's backs independent reform body: group "
    },
    {
        "content": "ZURICH  Aug 6 World Cup sponsor McDonald's  has joined Coca-Cola and Visa in urging FIFA to adopt an independent reform commission in response to the scandals that have plagued world football's governing body.",
        "date": "08062015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Soccer-FIFA sponsor McDonald's backs independent reform body-group "
    },
    {
        "content": "WASHINGTON  July 27 Some of the biggest U.S. corporate names on Monday offered their support - and billions of dollars in green financing pledges - to buttress the Obama administration's quest for a global agreement on combating climate change.",
        "date": "07272015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "U.S. private sector vows to ante up on climate finance "
    },
    {
        "content": "ST PETERSBURG FIFA will meet its leading commercial partners next month after three of them increased pressure for major reforms to soccer's governing body following a series of corruption scandals.",
        "date": "07242015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "FIFA to meet sponsors after reproaches from Coke  Visa  McDonald's "
    },
    {
        "content": "ST PETERSBURG  July 24 FIFA will meet its leading commercial partners next month after three of them increased pressure for major reforms to soccer's governing body following a series of corruption scandals.",
        "date": "07242015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-FIFA to meet sponsors after reproaches from Coke  Visa  McDonald's "
    },
    {
        "content": "NEW YORK  July 23 Visa Inc joined fellow FIFA sponsor Coca-Cola Co on Thursday in calling for an independent commission to reform the way that soccer's governing body is run.",
        "date": "07232015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Visa joins Coke in call for independent body to reform FIFA "
    },
    {
        "content": "MONTERREY  Mexico  July 23 Coca-Cola Femsa  Latin America's biggest Coke bottler  on Thursday reported that second-quarter profit fell 0.4 percent compared to the same period in 2014  dragged down by weak growth in sales volumes and foreign exchange effects in Venezuela.",
        "date": "07232015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Mexico's Coca Cola Femsa second-quarter profit falls 0.4 pct "
    },
    {
        "content": "Coca-Cola Co  on Wednesday reported higher-than-expected quarterly earnings and revenue as it raised prices and boosted sales volumes in North America  where it has struggled to grow as consumers ditch soda for healthier options.",
        "date": "07222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke's second-quarter profit  sales beat estimates "
    },
    {
        "content": "* Share buyback plan tightened to $2.0-$2.5 bln from $2-$3 bln",
        "date": "07222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Coke's second-quarter profit  sales beat estimates "
    },
    {
        "content": "MIAMI Two top sponsors of FIFA and its World Cup tournaments on Friday ratcheted up pressure on the global soccer body for major reforms as a corruption scandal casts a lengthening shadow over the sport.",
        "date": "07172015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Major sponsors  Coca-Cola  McDonald's  demand reforms at FIFA "
    },
    {
        "content": "MIAMI  July 17 Two top sponsors of FIFA and its World Cup tournaments on Friday ratcheted up pressure on the global soccer body for major reforms as a corruption scandal casts a lengthening shadow over the sport.",
        "date": "07172015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Soccer-Major sponsors  Coca-Cola  McDonald's  demand reforms at FIFA "
    },
    {
        "content": "MIAMI  July 17 Coca-Cola Co  a major sponsor of FIFA and its World Cup  has urged the scandal-hit global soccer governing body to support the creation of an independent commission to reform the way FIFA is run.",
        "date": "07172015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Soccer-Sponsor Coca-Cola urges FIFA to support independent reform commission "
    },
    {
        "content": "* Consolidated sales volume declined by 1.1 percent in H1 to 561 mln uc  cycling 10 percent volume growth in H1 2014",
        "date": "07092015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola Icecek H1 sales volume down by 1.1 pct to 561 mln uc "
    },
    {
        "content": "LONDON/ATHENS  July 3 A halt to international payments from Greek bank accounts is hurting Greek businesses and their foreign partners and threatening supplies of vital goods like food and clothing into the debt-crippled country.",
        "date": "07032015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Greek bank closures may deplete supermarket shelves "
    },
    {
        "content": "MOSCOW  June 4 Coca-Cola HBC  the world's second-largest bottler of Coca-Cola brand drinks  continues to invest in juice production in Russia  confident of the market's recovery  its Russian head said on Thursday.",
        "date": "06042015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coca-Cola HBC says keeps investing in Russia juice production "
    },
    {
        "content": "May 29 Coca-Cola Co urged FIFA to take \"concrete actions\" to address the issues that have been raised  hours after Sepp Blatter was re-elected the president of the world football governing body mired in a corruption scandal.",
        "date": "05292015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Post Blatter's re-election  Coca-Cola urges FIFA to address issues "
    },
    {
        "content": "NEW YORK  May 28 Visa Inc's public warning to FIFA that it may end its sponsorship if world soccer's governing body does not quickly clean up its act will likely prompt other sponsors to take a tough stance as a major corruption scandal involving FIFA unfolds  brand experts said.",
        "date": "05292015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "RPT-Visa's tough stance on FIFA augurs more sponsor demands -experts "
    },
    {
        "content": "NEW YORK Visa Inc's public warning to FIFA that it may end its sponsorship if world soccer's governing body does not quickly clean up its act will likely prompt other sponsors to take a tough stance as a major corruption scandal involving FIFA unfolds  brand experts said.",
        "date": "05292015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Visa's tough stance on FIFA augurs more sponsor demands: experts "
    },
    {
        "content": "NEW YORK  May 28 Visa Inc's public warning to FIFA that it may end its sponsorship if world soccer's governing body does not quickly clean up its act will likely prompt other sponsors to take a tough stance as a major corruption scandal involving FIFA unfolds  brand experts said.",
        "date": "05292015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Visa's tough stance on FIFA augurs more sponsor demands -experts "
    },
    {
        "content": "* Adidas  Coca-Cola Hyundai  McDonald's  Anheuser-Busch concerned",
        "date": "05282015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "UPDATE 4-Visa threatens to ditch FIFA as sponsor dismay mounts "
    },
    {
        "content": "ZURICH/NEW YORK  May 27 The world's most popular sport was plunged into turmoil on Wednesday as seven senior soccer officials were arrested on U.S. corruption charges and faced extradition from Switzerland  whose authorities also announced a criminal investigation into the awarding of the next two World Cups.",
        "date": "05272015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "WRAPUP 7-World soccer rocked by U.S.  Swiss arrests of officials for graft "
    },
    {
        "content": "DHAKA One of two men arrested in Bangladesh as a suspected member of Islamic State was an IT manager at a subsidiary of Coca-Cola Co  police and company sources told Reuters on Monday.",
        "date": "05252015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Bangladesh Islamic State suspect worked for Coca-Cola unit: sources "
    },
    {
        "content": "DHAKA  May 25 One of two men arrested in Bangladesh as a suspected member of Islamic State was an IT manager at a subsidiary of Coca-Cola Co  police and company sources told Reuters on Monday.",
        "date": "05252015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Bangladesh Islamic State suspect worked for Coca-Cola unit - sources "
    },
    {
        "content": "BERNE  May 20 FIFA sponsors Visa have expressed \"grave concern\" at the conditions of migrant workers in 2022 World Cup hosts Qatar.",
        "date": "05202015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "UPDATE 1-Soccer-FIFA sponsors Visa express \"grave concern\" over Qatar workers "
    },
    {
        "content": "* We are encouraged by results business has delivered in quarter",
        "date": "05152015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola HBC 'encouraged' by first-quarter volume rise "
    },
    {
        "content": "May 15 Warren Buffett's Berkshire Hathaway Inc  on Friday said it has boosted its holdings in some of the billionaire's favorite companies  including Wells Fargo & Co  and International Business Machines Corp.",
        "date": "05152015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Buffett's Berkshire adds to favorites IBM  Wells Fargo "
    },
    {
        "content": "LOS ANGELES  May 8 Starbucks Corp on Friday said it would stop sourcing water for its Ethos Water brand in California  which is in the fourth year of a serious drought that has prompted the state's first-ever mandatory cuts in water use.",
        "date": "05082015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "UPDATE 2-Starbucks moves Ethos water bottling out of drought-hit California "
    },
    {
        "content": "NEW YORK  May 4 Billionaire investor Warren Buffett defended some of his core holdings in a televised interview on Monday  but reiterated that equities in general would look expensive in an environment with normal interest rates.",
        "date": "05042015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Buffett defends core holdings like IBM  Coca-Cola  in interview "
    },
    {
        "content": "NEW YORK  May 4 Billionaire investor Warren Buffett defended some of his core holdings in a televised interview on Monday  but reiterated that equities in general would look expensive in an environment with normal interest rates.",
        "date": "05042015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Buffett defends core holdings like IBM  Coca-Cola  in interview "
    },
    {
        "content": "NEW YORK/BOSTON Coca-Cola Co  shareholders on Wednesday approved the beverage maker's pay for top executives by a lower-than-average margin in the face of concerns by large proxy advisers.",
        "date": "04292015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke executive pay approved  but by lower-than-average margin "
    },
    {
        "content": "NEW YORK/BOSTON  April 28 Coca-Cola Co  faces renewed pressure over its executive pay from large proxy advisory firms ahead of a shareholder meeting on Wednesday and at least two major pension funds disclosed they voted against the company's compensation.",
        "date": "04282015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola faces renewed pressure over executive pay "
    },
    {
        "content": "NEW YORK/BOSTON  April 29 Coca-Cola Co  shareholders on Wednesday approved the beverage maker's pay for top executives by a lower-than-average margin in the face of concerns by large proxy advisers.",
        "date": "04292015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Coke executive pay approved  but by lower-than-average margin "
    },
    {
        "content": "NEW YORK/BOSTON  April 29 Coca-Cola Co's  shareholders on Wednesday approved the beverage maker's pay for top executives  but by a lower-than-average margin in the face of concerns by large proxy advisers.",
        "date": "04292015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke shareholders approve executive pay  but by low margin "
    },
    {
        "content": "MEXICO CITY  April 29 Coca-Cola Femsa  Latin America's largest Coke bottler  on Wednesday reported a 5-percent lower first-quarter profit.",
        "date": "04292015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Mexico's Coke Femsa reports lower first-quarter results "
    },
    {
        "content": "U.S. stocks ended stronger on Wednesday as Visa's potential expansion into China and talk of a turnaround at McDonald's helped investors look beyond a mixed bag of quarterly earnings.",
        "date": "04222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Stocks end stronger as investors look beyond mixed earnings "
    },
    {
        "content": "Coca-Cola Co  on Wednesday reported better than expected profit and revenue  helped by price increases in North America  as the beverage maker struggles to grow amid sluggish demand for soda.",
        "date": "04222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke profit tops estimates  announces bottler deals "
    },
    {
        "content": "April 22 Coca-Cola Co on Wednesday reported better than expected profit and revenue  helped by price increases in North America  as the beverage maker struggles to grow amid sluggish demand for soda.",
        "date": "04222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "REFILE-UPDATE 3-Coke profit tops estimates  announces bottler deals "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.1 pct  Nasdaq 0.3 pct   (Updates to open)",
        "date": "04222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "US STOCKS-Wall St slips on mixed bag of earnings "
    },
    {
        "content": "* Futures up: Dow 3 pts  S&P 1.5 pct  Nasdaq 6.75 pts   (Adds details  comment  updates prices)",
        "date": "04222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "US STOCKS-Wall St to open flat on mixed bag of earnings "
    },
    {
        "content": "MEXICO CITY  April 22 Mexico's No.2 Coke bottler  Arca Continental  on Wednesday reported a 12 percent rise in its first-quarter profit  helped by stronger sales.",
        "date": "04222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Mexico's Arca Continental reports higher 1st-qtr profit "
    },
    {
        "content": "April 17 The following bids  mergers  acquisitions and disposals were reported by 1300 GMT on Friday:",
        "date": "04172015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "April 22 Coca-Cola Co reported a rise in revenue for the first time in nine quarters  helped by a 6 percent rise in revenue from North America  its biggest market.",
        "date": "04222015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola reports revenue growth for first time in nine quarters "
    },
    {
        "content": "HONG KONG Coca-Cola Co  has agreed to buy the beverage business of China Culiangwang Beverages Holdings Ltd  for $400.5 million including debt  to get a foothold in the fast growing multi-grain drinks category.",
        "date": "04172015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke to buy China multi-grain drinks maker for $400 million "
    },
    {
        "content": "HONG KONG  April 17 Coca-Cola Co has agreed to buy the beverage business of China Culiangwang Beverages Holdings Ltd for $400.5 million including debt  to get a foothold in the fast growing multi-grain drinks category.",
        "date": "04172015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Coke to buy China multi-grain drinks maker for $400 mln "
    },
    {
        "content": "PepsiCo Inc is taking over league sponsorship rights for the National Basketball Association  ending a 28-year partnership that the league has had with Coca-Cola Co.",
        "date": "04132015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Pepsi takes over NBA sponsorship rights from Coke "
    },
    {
        "content": "* Terms of the deal were not disclosed   (Changes sourcing  adds details)",
        "date": "04132015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Pepsi takes over NBA sponsorship rights from Coke "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO/LONDON  March 27 (Fitch) Fitch Ratings has published its new Rating  Navigators for: --The Coca-Cola Company --Coca-Cola Enterprises Inc. --PepsiCo Inc. --Coca-Cola Icecek --Coca-Cola FEMSA SAB --Corporacion Lindley --Embotelladora Andina --Grupo Embotellador Atic --Ajecorp  These reports should be read in conjunction with the 'Introducing Rating  Navigators for Corporates' report dated Nov. 5  2014 and 'Non-Alcoholic  Beverages",
        "date": "03272015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Fitch Publishes Ratings Navigator for 9 Non-Alcoholic Beverage Companies "
    },
    {
        "content": "WASHINGTON (Thomson Reuters Foundation) - The Coca-Cola Co has made a good start in axing land grabs from its supply chain  but it must work harder in proving that its bottlers and sugar suppliers do not violate land rights  development experts told the company.",
        "date": "03252015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke's zero tolerance for land grabs proves difficult to fulfill "
    },
    {
        "content": "* Land experts say Coke must work harder to check its suppliers",
        "date": "03252015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke's zero tolerance for land grabs proves difficult to fulfil - TRFN "
    },
    {
        "content": "March 17 Fuel cell maker Plug Power Inc  reported a bigger-than-expected quarterly loss as costs and expenses more than doubled  sending its shares down nearly 11 percent in premarket trading.",
        "date": "03172015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 1-Fuel cell maker Plug Power's loss bigger than expected as costs rise "
    },
    {
        "content": "BOSTON A decision by Coca-Cola Co's chief executive to decline his 2014 bonus did not go far enough  a well-known pay critic said Friday  indicating the company could face more scrutiny of its compensation ahead of its shareholder meeting this spring.",
        "date": "03132015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke CEO's declined bonus not enough for pay critic Winters "
    },
    {
        "content": "Coca-Cola Co  said on Thursday its chief executive declined a $2.5 million bonus in 2014 while other top-level employees received lower-than-expected compensation as the world's largest soda maker struggles to boost revenues amid sluggish demand for soft drinks.",
        "date": "03122015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "Coke CEO declines bonus as company performance falls short "
    },
    {
        "content": "March 12 Coca-Cola Co said on Thursday its chief executive declined a $2.5 million bonus in 2014 while other top-level employees received lower-than-expected compensation as the world's largest soda maker struggles to boost revenues amid sluggish demand for soft drinks.",
        "date": "03122015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UPDATE 2-Coke CEO declines bonus as company performance falls short "
    },
    {
        "content": "March 12 Coca-Cola Co said Chief Executive Muhtar Kent earned $25.2 million in compensation in 2014  about 23 percent higher than the previous year.",
        "date": "03122015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke CEO took 23 pct higher compensation last year "
    },
    {
        "content": "Coca-Cola and David Puttnam  the producer of the 1984 film \"The Killing Fields \" have been recruited by the government to help shift the world's image of Cambodia away from land mines and corruption and toward one of a booming economy and easy business  Cambodia Daily reported  citing the Commerce Minister Sun Chanthol. (http://bit.ly/1H39P4B)",
        "date": "03062015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "CAMBODIA PRESS-Coca-Cola  Lord Puttnam to 'Rebrand' Cambodia - Cambodia Daily "
    },
    {
        "content": "MEXICO CITY  Feb 25 Coca-Cola Femsa  the biggest Coke bottler in Latin America  on Wednesday reported a 0.3 percent increase in fourth-quarter earnings  hurt by muted sales and currency weakness in Venezuela and Mexico.",
        "date": "02252015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "UPDATE 2-Mexico's Coke Femsa reports flat fourth-quarter profit "
    },
    {
        "content": "MEXICO CITY  Feb 25 Coca-Cola Femsa  the biggest Coke bottler in Latin America  on Wednesday reported a 0.3 percent increase in its fourth-quarter profit.",
        "date": "02252015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Mexico's Coke Femsa reports flat fourth-quarter profit "
    },
    {
        "content": "Feb 24 Donald Keough  Coca-Cola Co's COO and president during the company's intense \"cola war\" days with PepsiCo Inc in the '80s  has died at the age of 88.",
        "date": "02242015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Former Coca-Cola executive Donald Keough dies "
    },
    {
        "content": "* Coca-Cola HBC falls away on Russia tensions   (Adds quotes  details)",
        "date": "02182015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Britain's FTSE stalls after touching 15-year peak "
    },
    {
        "content": "Feb 18 Beverage can maker Ball Corp is close to a deal to buy UK-based Rexam Plc this week  according to people familiar with the matter  the Wall Street Journal reported.",
        "date": "02182015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Ball Corp  Rexam deal likely this week - WSJ "
    },
    {
        "content": "MEXICO CITY  Feb 18 Arca Continental  Mexico's No. 2 Coca-Cola bottler  on Wednesday reported a 23 percent jump in fourth-quarter profit  as it charged more for its drinks and sales volume increased.",
        "date": "02182015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Mexican Coke bottler Arca reports 23 pct jump in 4th-qtr profit "
    },
    {
        "content": "ATHENS  Feb 18 Swiss based Coca-Cola HBC (CC HBC)  the world's second-largest bottler of Coca-Cola drinks  is cautious on Greece due to the macroeconomic and political uncertainty in the country but is committed to investing in the country  its chief executive said on Wednesday.",
        "date": "02182015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola HBC says cautious on Greece but not cutting investment "
    },
    {
        "content": "* Lowers target for 2013-2015 free cash flow to 1.1-1.2 bln eur",
        "date": "02182015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola HBC's Q4 profit down 11.4 pct  sees challenging year "
    },
    {
        "content": "* In q4  fx-neutral net sales revenue per unit case continued to improve  bringing full-year increase to 2.5%",
        "date": "02182015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "BRIEF-Coca-Cola HBC sees 'challenging' year after Q4 profit falls "
    },
    {
        "content": "LONDON  Feb 12 Britain's top share index rose on Thursday  with bottler Coca Cola HBC leading the market higher after news of a general ceasefire from Sunday in Ukraine's east  where Kiev is fighting pro-Russian separatists.",
        "date": "02122015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Ukraine ceasefire boost for Coca Cola bottler helps FTSE "
    },
    {
        "content": "NEW YORK  Feb 10 U.S. stocks rose on Tuesday on hopes that Greek debt negotiations could result in a deal that stabilizes Europe although a drop in oil prices limited the advance.",
        "date": "02102015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "REFILE-US STOCKS-Wall St rises on Greek deal hopes even as energy drops "
    },
    {
        "content": "NEW YORK  Feb 10 Coca-Cola Co raised the overall prices it charges its retail customers in North America 4 percent in the latest quarter  the company said on Tuesday  a signal to industry watchers that soft-drink rival PepsiCo  probably raised prices too.",
        "date": "02102015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke's price increase encourages beverage company shareholders "
    },
    {
        "content": "* Greek debt hopes help European  U.S. shares     * Coca-Cola earnings boost U.S. shares     * U.S. bond yields rise as Fed rate hike eyed     * Oil slips on IEA warning   (Updates prices  adds oil settlement prices)     By Sam Forgione     NEW YORK  Feb 10 U.S. and European shares rose on Tuesday on hopes for a debt agreement between Greece and its major creditors  while U.S. Treasury yields rose on continued expectations of a Federal Reserve interest rate hike this year.      Europ",
        "date": "02102015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "GLOBAL MARKETS-Shares rally on hopes for Greek deal; U.S. yields rise "
    },
    {
        "content": "NEW YORK  Feb 5 Three years ago  Coca-Cola Co  ended a joint venture with Nestle SA to sell iced tea in the United States and focused on the ready-to-drink teas it was developing in-house.",
        "date": "02052015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coke's Fuze and Gold Peak brands top $1 billion in sales "
    },
    {
        "content": "* Indexes up: Dow 0.43 pct  S&P 0.63 pct  Nasdaq 0.93 pct   (Adds data  updates to late morning)",
        "date": "02102015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "US STOCKS-Wall St rises on Greek deal hopes even as energy drops "
    },
    {
        "content": "British drinks can maker Rexam Plc  said it is in talks to be bought by U.S. rival Ball Corp  for 4.3 billion pounds ($6.6 billion)  a deal that would form an industry giant better equipped to withstand rising aluminum costs.",
        "date": "02052015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Drinks can maker Ball in talks to buy UK rival Rexam "
    },
    {
        "content": "* Greek debt hopes help European  U.S. shares     * Coca-Cola earnings boost U.S. shares     * U.S. bond yields rise as Fed rate hike eyed     * Oil slips on IEA warning   (Updates to U.S. trading  changes byline  dateline; previous LONDON)     By Sam Forgione     NEW YORK  Feb 10 U.S. and European shares rose on Tuesday after press reports on the possibility of a debt agreement between Greece and its major creditors  while U.S. Treasury yields rose on continued expectations of a Fed",
        "date": "02102015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "GLOBAL MARKETS-Shares rise on Greek debt hopes; U.S. yields rise "
    },
    {
        "content": "* Indexes up: Dow 0.48 pct  S&P 0.48 pct  Nasdaq 0.54 pct   (Updates to market open)",
        "date": "02102015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "US STOCKS-Wall St advances on Greek debt hopes  Coke earnings "
    },
    {
        "content": "Coca-Cola Co  reported a  slightly higher-than-expected profit on Tuesday as sales in North America  its biggest market  rose for the first time in four quarters  offsetting the impact of a stronger dollar on its overseas business.",
        "date": "02102015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "Coca-Cola profit beats estimates; North American soda sales up "
    },
    {
        "content": "LONDON  Jan 26 Britain's top share index recovered late on Monday  helped by a rebound in energy shares  although hefty falls in Greece-exposed Coca-Cola HBC  capped gains.",
        "date": "01262015",
        "name": "Coca-Cola Company (The)",
        "news_type": "normal",
        "symbol": "KO",
        "title": "UK's FTSE lags continental peers amid commodity selloff "
    },
    {
        "content": "KAPALUA  Hawaii Chris Kirk ended a roller-coaster week at the Hyundai Tournament of Champions in record-equalling style  profiting from a new putting grip as he fired a sizzling 11-under-par 62 in Monday's final round.",
        "date": "01132015",
        "name": "Coca-Cola Company (The)",
        "news_type": "topStory",
        "symbol": "KO",
        "title": "New putting grip helps Kirk sign off with a 62 "
    }
]