[
    {
        "content": "MEXICO CITY  Oct 27 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) said on Friday it could see a slowdown in sales in the fourth quarter and in 2018 as high inflation  concerns over trade talks and an upcoming election dampen consumer appetite.",
        "date": "10272017",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "Femsa sees Mexico inflation hitting consumption in Q4  2018 "
    },
    {
        "content": "MEXICO CITY  Oct 26 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) reported on Thursday a nearly four-fold surge in third-quarter net profit after selling a 5.24 percent stake in Dutch beer company Heineken NV.",
        "date": "10262017",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "UPDATE 1-Mexico's Femsa third-quarter profit jumps 385 pct "
    },
    {
        "content": "MEXICO CITY  Oct 25 Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Wednesday it posted a third quarter net profit of 3.15 billion pesos ($173.4 million)  a 39.2 percent increase over the year earlier quarter  as sales jumped.",
        "date": "10252017",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "topStory",
        "symbol": "KOF",
        "title": "Profit jumps 39 percent at Mexico's Coca-Cola Femsa "
    },
    {
        "content": "MEXICO CITY  May 16 Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Tuesday it has abandoned plans to acquire certain territories in the United States after thorough analysis and negotiations with The Coca Cola Company.",
        "date": "05162017",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "Mexico's Coca-Cola Femsa ditches plans to buy U.S. operations "
    },
    {
        "content": "MEXICO CITY  May 16 Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Tuesday it has abandoned plans to acquire certain territories in the United States after thorough analysis and negotiations with The Coca Cola Company.",
        "date": "05162017",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "UPDATE 1-Mexico's Coca-Cola Femsa ditches plans to buy U.S. operations "
    },
    {
        "content": "Feb 24 Coca-Cola Femsa SAB de CV  the largest Coke bottler in the world  reported a jump in quarterly profit on Friday  helped by higher volume sales in Costa Rica  Nicaragua and the Philippines.",
        "date": "02242017",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "topStory",
        "symbol": "KOF",
        "title": "UPDATE 1-Mexico's Coca-Cola Femsa profit boosted by Central America sales "
    },
    {
        "content": "Feb 24 Coca-Cola Femsa SAB de CV  the largest Coke bottler in the world  reported a jump in quarterly profit on Friday  helped by higher sales volumes in Costa Rica  Nicaragua and the Philippines.",
        "date": "02242017",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "Mexico's Coca-Cola Femsa reports a rise in quarterly profit "
    },
    {
        "content": "MEXICO CITY Coca-Cola Femsa   the largest Coke bottler in the world  on Tuesday reported a 13.9 percent rise in third-quarter profit  helped by fewer foreign exchange losses  lower taxes  and higher prices to consumers.",
        "date": "10252016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "topStory",
        "symbol": "KOF",
        "title": "Mexico's Coke Femsa net profit up 14 percent in third quarter "
    },
    {
        "content": "MEXICO CITY  Oct 25 Coca-Cola Femsa  the largest Coke bottler in the world  on Tuesday reported a 13.9 percent rise in third-quarter profit  helped by fewer foreign exchange losses  lower taxes  and higher prices to consumers.",
        "date": "10252016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "UPDATE 2-Mexico's Coke Femsa net profit up 14 pct in 3rd qtr "
    },
    {
        "content": "* Q3 earnings per share view mxn 1.23  revenue view mxn 41.56 billion -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:",
        "date": "10252016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "BRIEF-Coca-Cola Femsa posts Q3 adj. earnings 99 cents/shr "
    },
    {
        "content": "MEXICO CITY Coca-Cola Femsa  Latin America's largest Coke bottler  on Friday said it would buy Brazilian beverage company Vonpar in a cash  stock and debt deal valued at 3.5 billion reais ($1.09 billion).",
        "date": "09232016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "topStory",
        "symbol": "KOF",
        "title": "Mexico's Coke Femsa says to buy Brazil's Vonpar in $1.1 billion deal "
    },
    {
        "content": "MEXICO CITY  Sept 23 Coca-Cola Femsa  Latin America's largest Coke bottler  on Friday said it would buy Brazilian beverage company Vonpar in a cash  stock and debt deal valued at 3.5 billion reais ($1.09 billion).",
        "date": "09232016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "UPDATE 1-Mexico's Coke Femsa says to buy Brazil's Vonpar in $1.1 bln deal "
    },
    {
        "content": "MEXICO CITY  Sept 23 Coca-Cola Femsa  Latin America's largest Coke bottler  on Friday said it would buy Brazilian bottler Vonpar in a cash  stock and debt deal valued at 3.5 billion reais ($1.09 billion).",
        "date": "09232016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "Mexico's Coke Femsa says to buy Brazil's Vonpar in $1.1 bln deal "
    },
    {
        "content": "* Coca-Cola Femsa reaches an agreement to acquire Vonpar in Brazil",
        "date": "09232016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "BRIEF-Coca-Cola Femsa to acquire Vonpar in brazil "
    },
    {
        "content": "July 27 Coca-Cola Femsa  Latin America's largest Coke bottler  reported a 25 percent fall in second-quarter profit  hurt by lower margins and higher raw material costs.",
        "date": "07272016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "topStory",
        "symbol": "KOF",
        "title": "CORRECTED-Mexican bottler Coke Femsa's profit falls 25 pct "
    },
    {
        "content": "MEXICO CITY Latin America's biggest Coke bottler Coca-Cola Femsa  on Wednesday said its first-quarter profit rose 9.3 percent  helped by an increase in sales.",
        "date": "04272016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "topStory",
        "symbol": "KOF",
        "title": "Coke Femsa says first-quarter profit rises on sales increase "
    },
    {
        "content": "MEXICO CITY  April 27 Latin America's biggest Coke bottler Coca-Cola Femsa on Wednesday said its first-quarter profit rose 9.3 percent  helped by an increase in sales.",
        "date": "04272016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "UPDATE 1-Coke Femsa says 1st-qtr profit rises on sales increase "
    },
    {
        "content": "MEXICO CITY  April 27 Latin America's biggest Coke bottler Coca-Cola Femsa on Wednesday said its first-quarter profit rose 9.3 percent.",
        "date": "04272016",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "normal",
        "symbol": "KOF",
        "title": "CORRECTED-Coke Femsa says 1st-qtr profit rises 9.3 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) MONTERREY  December 10 (Fitch) Fitch Ratings has affirmed the ratings of  Coca-Cola FEMSA  S.A.B. de C.V. (KOF) as follows: --Long-term foreign currency Issuer Default Rating (IDR) at 'A'; --Long-term local currency IDR at 'A'; --National scale long-term rating at 'AAA(mex)'; --National scale short-term rating at 'F1+(mex)'; --Senior notes for USD1 billion due 2018 at 'A'; --Senior notes for USD500 million due 2020 at 'A'; --Senior note",
        "date": "12102015",
        "name": "Coca Cola Femsa SAB de CV",
        "news_type": "topStory",
        "symbol": "KOF",
        "title": "Fitch Affirms Coca-Cola FEMSA's Ratings at 'A'; Outlook Stable "
    }
]