[
    {
        "content": "* H. Charles Floyd elected to Kohl's Corporation board of directors Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "11082017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-.Kohl Corp names Charles Floyd to board "
    },
    {
        "content": "Department store operator Kohl's Corp  reported a lower-than-expected quarterly profit  hit by higher costs and store closures due to hurricanes  sending its shares down 7 percent and dragging the sector down.",
        "date": "11092017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's profit misses estimates on higher costs; shares fall "
    },
    {
        "content": "CHICAGO This holiday season  retailers are making a list  checking it twice  and then ordering less for U.S. shoppers. | Video ",
        "date": "11082017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "U.S. department stores tap brakes on stocking for holiday season "
    },
    {
        "content": "Nov 9 Department store operator Kohl's Corp reported a lower-than-expected quarterly profit  hit by higher costs and store closures due to hurricanes  sending its shares down 7 percent and dragging the sector down.",
        "date": "11092017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 2-Kohl's profit misses estimates on higher costs; shares fall "
    },
    {
        "content": "* Kohls Corp qtrly sales $‍​4 332 million versus $4 327 million",
        "date": "11092017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's reports Q3 diluted earnings per share $0.70 "
    },
    {
        "content": "Nov 9 Department store operator Kohl's Corp reported its first increase in comparable-store sales in seven quarters  helped by higher traffic and strong back-to-school sales.",
        "date": "11092017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's posts surprise rise in comparable sales "
    },
    {
        "content": "* Retailers willing to sacrifice orders for tighter inventory",
        "date": "11072017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "U.S. department stores tap brakes on stocking for holiday season "
    },
    {
        "content": "* Kohls Corp - ‍on November 3  2017  Kohl's Corporation entered into a second amended and restated credit agreement​",
        "date": "11032017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Kohls Corp says enters into a second amended and restated credit agreement​ "
    },
    {
        "content": "Department store operator Kohl's Corp  said on Tuesday long-time Chief Executive Kevin Mansell would retire in May  and would be succeeded by Chief Merchandising Officer Michelle Gass.",
        "date": "09262017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's CEO Mansell to retire  merchandising chief to succeed "
    },
    {
        "content": "Sept 26 Department store operator Kohl's Corp said on Tuesday that Chief Executive Kevin Mansell will retire in May 2018.",
        "date": "09262017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "CORRECTED-Kohl's CEO Kevin Mansell to retire next year "
    },
    {
        "content": "* kohl’s announces CEO succession plan: Kevin Mansell to retire in May 2018  Michelle Gass appointed CEO-elect",
        "date": "09262017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohl’s CEO Kevin Mansell to retire in May 2018  Michelle Gass appointed CEO-elect "
    },
    {
        "content": "Sept 19 Department store operator Kohl's Corp said on Tuesday that select merchandise bought from Amazon.com Inc can be returned at 82 Kohl's stores in Los Angeles and Chicago  starting October.",
        "date": "09192017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's to accept Amazon returns in 82 stores "
    },
    {
        "content": "Sept 19 Department store operator Kohl's Corp said it would accept returns of select items bought from Amazon.com Inc at some of its stores in Los Angeles and Chicago  expanding its partnership with the ecommerce giant.",
        "date": "09192017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 2-Kohl's to accept Amazon returns in 82 stores "
    },
    {
        "content": "* Kohls Corp - ‍82 stores across Los Angeles and Chicago will be offering free  convenient returns for Amazon customers starting in October​",
        "date": "09192017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohls Corp - ‍82 stores to offer free returns for Amazon customers starting Oct "
    },
    {
        "content": "Sept 6 U.S. department store operator Kohl's Corp said on Wednesday it would sell Amazon.com Inc devices at 10 stores in Los Angeles and Chicago starting in October.",
        "date": "09062017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's to sell Amazon devices at 10 LA  Chicago stores "
    },
    {
        "content": "* Kohl's announces new Amazon smart home experience at Kohl's stores",
        "date": "09062017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's announces new Amazon smart home experience at Kohl's stores "
    },
    {
        "content": "* Kohl's invests in stores and opens fifth e-commerce fulfillment center to enhance omnichannel capabilities",
        "date": "08222017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's invests in stores  opens fifth e-commerce fulfillment center "
    },
    {
        "content": "Aug 10 Department store operator Macy's Inc joined rival Kohl's Corp in reporting a smaller-than-expected decline in quarterly comparable sales.",
        "date": "08102017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Macy's quarterly comparable sales top estimates "
    },
    {
        "content": " (This version of the Aug. 10 story corrects the quote in paragraph 5 to say \"disruptive\" not \"destructive\") | Video ",
        "date": "08112017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Macy's  Kohl's sales declines raise turnaround concerns "
    },
    {
        "content": "* Kohl's Corporation reports second quarter financial results",
        "date": "08102017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's Corporation posts Q2 adj. earnings $1.24/shr "
    },
    {
        "content": "Aug 11 J.C. Penney Co Inc's stock hit a life-low as sweeping store closures and a challenging retail environment drove the embattled department store chain to report a bigger-than-expected quarterly loss and took a toll on comparable sales.",
        "date": "08112017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 3-J.C. Penney hits record low on wider loss  retail gloom "
    },
    {
        "content": "* \"Environment of intense  destructive competition\"- Macy's CEO",
        "date": "08112017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "CORRECTED-UPDATE 4-Macy's  Kohl's sales declines raise turnaround concerns "
    },
    {
        "content": "Aug 10 Department store operator Kohl's Corp reported a 48.6 percent rise in quarterly profit from a year earlier  when it recorded charges of $128 million related to impairments and store closures.",
        "date": "08102017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's quarterly profit jumps 48.6 pct "
    },
    {
        "content": "* Kohls Corp says new CFO Bruce Besanko will receive  an annualized base salary of $900 000 - SEC filing Source: (http://bit.ly/2vlTrMm) Further company coverage:",
        "date": "07142017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Kohls Corp says CFO Bruce Besanko to receive annualized base salary of $900 000 "
    },
    {
        "content": "July 13 Department store operator J.C. Penney Co Inc said it was opening toy shops in all its stores and was planning to have a bigger assortment of toys available in time for the holiday season  as it seeks new avenues of growth amid weak sales.",
        "date": "07132017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 1-J.C. Penney pushes into toy sales in move away from apparel "
    },
    {
        "content": "* Kohls - on May 10  following previously announced retirement of Wesley Mcdonald as CFO  appointed Kevin Mansell as interim principal financial officer",
        "date": "05102017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Kohls appoints Kevin Mansell as interim principal financial officer "
    },
    {
        "content": "Nordstrom Inc on Thursday became the latest department store operator after Macy's and Kohl's to report weaker-than-expected quarterly same-store sales  underscoring the industry's struggle to attract customers amid a slump in demand for apparel and a shift to shopping online.",
        "date": "05122017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Nordstrom's comparable sales miss deepens department-store gloom "
    },
    {
        "content": "* Penney shares hit record low  rival's shares fall (Adds Penney CEO and analyst comments  background; updates shares)",
        "date": "05122017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 3-J.C. Penney at record low  wraps up dismal quarter for department stores "
    },
    {
        "content": "* Macy's shares hit 6-yr low in regular trade  weigh on rivals (Adds Nordstrom's earnings; updates shares)",
        "date": "05112017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "UPDATE 4-Nordstrom's comparable sales miss deepens department-store gloom "
    },
    {
        "content": "* On conf call- Q1  average transaction value increased driven by a continued increase in average unit retail",
        "date": "05112017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's CEO - Saw strength across activewear due in large part to launch of Under Armour "
    },
    {
        "content": "Department store operator Kohl's Corp  reported a better-than-expected quarterly profit  helped by lower costs and a leaner inventory amid a tough retail environment in the United States. | Video ",
        "date": "05112017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's profit beats on lower costs  leaner inventory levels "
    },
    {
        "content": "May 11 Department store operator Kohl's Corp reported a better-than-expected quarterly profit  helped by lower costs and a leaner inventory amid a tough retail environment in the United States.",
        "date": "05112017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 1-Kohl's profit beats on lower costs  leaner inventory levels "
    },
    {
        "content": "May 11 Department store operator Kohl's Corp reported a 14 percent jump in adjusted quarterly profit  helped by higher traffic in stores in March and April and as a leaner inventory helped it discount lesser.",
        "date": "05112017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's posts higher profit as store traffic improves "
    },
    {
        "content": "* Kohls Corp - qtrly sales $ 3 843 million versus $3 972 million last year",
        "date": "05112017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's Corp's qtrly comparable store sales down 2.7 pct "
    },
    {
        "content": "NEW YORK  May 5 A glance at the U.S. stock market's main measure for the health of retailers suggests all is well among those companies in the business of peddling stuff directly to consumers.",
        "date": "05072017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "RPT-Wall St Weekahead-Old-guard retail back in the cross hairs "
    },
    {
        "content": "* Prior to joining Kohl's  Revelle was chief marketing officer at Best Buy Source text for Eikon: Further company coverage:",
        "date": "04102017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Greg Revelle named Kohls' Chief Marketing Officer "
    },
    {
        "content": "* Kohls Corp says CEO Kevin Mansell's total 2016 compensation was $8.4 million versus $8.2 million in 2015 - SEC filing Source text: (http://bit.ly/2nnWqiX) Further company coverage:",
        "date": "03312017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Kohls Corp says CEO Kevin Mansell's total 2016 compensation was $8.4 mln vs $8.2 mln in 2015 - SEC filing "
    },
    {
        "content": "LAS VEGAS  March 21 Kohl's Corp's chief executive officer said on Tuesday the department store operator needs to \"change faster\" in order to remain a strong competitor to online and brick-and-mortar retailers.",
        "date": "03212017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's Corp CEO says retailer needs to change faster "
    },
    {
        "content": "* Kohl's CEO on border adjustment tax leading to consumer price hike: \"the impact on consumers  our customers is going to be massive\" - CNBC  Further company coverage:   (Bengaluru Newsroom)",
        "date": "03212017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's CEO on border adjustment tax leading to consumer price hike \"the impact on consumers  our customers is going to be massive\" - CNBC "
    },
    {
        "content": "Department store operators Kohl's Corp  and Nordstrom Inc  followed larger rival Macy's Inc  in reporting a better-than-expected profit for the holiday quarter as lower inventories helped the retailers avoid deep discounting.",
        "date": "02232017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Lower inventories help Kohl's  Nordstrom top profit estimates "
    },
    {
        "content": "* Kohl's sees FY comp sales flat to down 2 pct   (Adds Nordstrom's results  updates shares)",
        "date": "02232017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 4-Lower inventories help Kohl's  Nordstrom top profit estimates "
    },
    {
        "content": "Department store operators Kohl's Corp  and rival Macy's Inc  are betting on a potential money-spinner - carving out prime space within their sprawling stores and leasing them to other retailers.",
        "date": "02232017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's  Macy's turn landlords in bid to unlock real estate value "
    },
    {
        "content": "* Kohls Corp - qtrly comparable store sales were down 2.2 percent",
        "date": "02232017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's Corp Q4 comparable store sales down 2.2 pct "
    },
    {
        "content": "Feb 23 Department store operator Kohl's Corp  reported lower-than-expected quarterly sales as it struggles with low demand for apparel and competition from online retailers.",
        "date": "02232017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's reports lower-than-expected quarterly sales "
    },
    {
        "content": "Jan 25 EBay Inc reported a 3.1 percent rise in revenue for the fourth-quarter holiday period  offering signs of improvement at the company's traditional marketplace business and sending shares up more than 8 percent in extended trading on Wednesday.",
        "date": "01262017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 3-EBay holiday-quarter revenue up 3.1 pct  shares jump "
    },
    {
        "content": "WASHINGTON  Jan 13 U.S. retail sales rose in December amid strong demand for automobiles and furniture  providing further evidence that the economy ended the fourth quarter with momentum and is poised for stronger growth this year.",
        "date": "01132017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "WRAPUP 3-U.S. retail sales boosted by auto demand; producer prices climb "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 06 (Fitch) Fitch Ratings has affirmed the Long-Term Issuer  Default Rating (IDR) for Kohl's Corporation (Kohl's) at 'BBB'. The Rating  Outlook has been revised to Negative from Stable. A full list of ratings is  provided at the end of this release. The Negative Outlook reflects Fitch's reduced confidence in Kohl's ability to  stabilize comparable store sales and therefore EBITDA over the next 24-36  months.  EBITDA is ",
        "date": "01062017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Fitch Affirms Kohl's Corporation at 'BBB'; Outlook Revised to Negative "
    },
    {
        "content": "WASHINGTON U.S. employment increased less than expected in December but a rebound in wages pointed to sustained labor market momentum that sets up the economy for stronger growth and further interest rate increases from the Federal Reserve this year. | Video ",
        "date": "01062017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "U.S. job growth slows  but wages rebound strongly "
    },
    {
        "content": "WASHINGTON  Jan 6 U.S. employment increased less than expected in December but a rebound in wages pointed to sustained labor market momentum that sets up the economy for stronger growth and further interest rate increases from the Federal Reserve this year.",
        "date": "01062017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "WRAPUP 6 -U.S. job growth slows  but wages rebound strongly "
    },
    {
        "content": "CHICAGO  Jan 5 Weak holiday sales by some U.S. department stores have reignited fears that the sector may never recover its growth levels of the past  but some investors are holding out hope for a longer-term recovery.",
        "date": "01062017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "RPT-U.S. department store challenges fail to rattle some investors "
    },
    {
        "content": "* Asian shares hit 4-week high  world shares at 1-1/2-year high",
        "date": "01062017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "GLOBAL MARKETS-Asian shares rise as US interest rates ease  China steps up yuan defence "
    },
    {
        "content": "Department store chains Macy's Inc  and Kohl's Corp  both cut their 2016 profit forecasts on Wednesday  after holiday season sales fell more than expected  pushing down shares in the retail sector in extended trading.",
        "date": "01052017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Macy's  Kohl's slash 2016 profit forecasts citing weak holiday sales "
    },
    {
        "content": "Macy's Inc  and Kohl's Corp  struck an optimistic note going into the holiday shopping season  giving a rare boost to shares of department store operators  which have struggled to grow in the face of intense competition from online retailers.",
        "date": "11102016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Department store shares get a boost from upbeat Macy's and Kohl's "
    },
    {
        "content": "Department store operator Kohl's Corp  reported a better-than-expected quarterly profit  helped mainly by cost-cutting  and the company reaffirmed its full-year profit forecast.",
        "date": "11102016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's quarterly profit beats estimates  shares rise "
    },
    {
        "content": "Nov 10 Department store operator Kohl's Corp  reported a better-than-expected quarterly profit  helped mainly by cost-cutting  and the company reaffirmed its full-year profit forecast.",
        "date": "11102016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 1-Kohl's quarterly profit beats estimates  shares rise "
    },
    {
        "content": "Nov 10 Department store operator Kohl's Corp  reported a better-than-expected 21.7 percent jump in quarterly profit on Thursday  helped mainly by cost-cutting.",
        "date": "11102016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Department store operator Kohl's profit beats estimates "
    },
    {
        "content": "* Kohl's will be conducting a comprehensive search for CFO position over next few months",
        "date": "11092016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Kohl says CFO Wesley Mcdonald to retire "
    },
    {
        "content": "Amazon.com Inc said it would hire more than 120 000 seasonal workers in the United States for the holiday season  20 percent more than last year  highlighting the growing threat the e-commerce giant poses to traditional retailers. | Video ",
        "date": "10132016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Amazon to hire 120 000 temporary workers for holiday season "
    },
    {
        "content": "* Kohl's launches kohl's pay nationwide  Source text for Eikon:  Further company coverage:    ;))",
        "date": "10052016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's launches Kohl's Pay nationwide "
    },
    {
        "content": "Department store operator Kohl's Corp  said on Monday it would hire more than 69 000 extra workers in the United States this holiday shopping season  about the same as last year  echoing larger retailer Target Corp's  decision to keep seasonal hiring around last year's level.",
        "date": "09192016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's to keep seasonal hiring little changed at about 69 000 "
    },
    {
        "content": "Sept 19 Department store operator Kohl's Corp  said on Monday it would hire more than 69 000 extra workers in the United States this holiday shopping season  about the same as last year  echoing larger retailer Target Corp's  decision to keep seasonal hiring around last year's level.",
        "date": "09192016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 1-Kohl's to keep seasonal hiring little changed at about 69 000 "
    },
    {
        "content": "Sept 19 Department store operator Kohl's Corp  said it would hire more than 69 000 extra workers in the United States for the holiday selling season  the same as last year.",
        "date": "09192016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's to hire over 69 000 workers this holiday season "
    },
    {
        "content": "* Anticipates hiring more than 69 000 associates nationwide this holiday season",
        "date": "09192016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohls to hire more than 69 000 associates nationwide "
    },
    {
        "content": "Jan 9 Hudson's Bay Co  the owner of U.S. luxury retail chain Saks Fifth Avenue  cut its full-year revenue forecast for the second time  citing a challenging retail environment in the United States and Europe.",
        "date": "01092017",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Canadian retailer Hudson's Bay cuts revenue forecast "
    },
    {
        "content": "* Dale Jones resigned as a member of board of directors of company",
        "date": "08102016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's Corp names Adrianne Shapira as new board member "
    },
    {
        "content": "Kohl's Corp  reported a higher-than-expected quarterly profit  helped by better inventory management and warm weather that boosted sales of summer clothes and accessories. | Video ",
        "date": "08112016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's quarterly profit beats estimates; shares rise "
    },
    {
        "content": "All three major U.S. stock indexes closed at record highs on Thursday for the first time since 1999 as surging oil prices and strong earnings from department stores Macy's and Kohl's buoyed investor sentiment. | Video ",
        "date": "08112016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Three major indexes end at records for first time since 1999 "
    },
    {
        "content": "* CFO on conf call - our teams continue to aggressively and effectively manage store payroll as sales trends change",
        "date": "08112016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's CEO on conf call- Targeting end of Q3 inventory to be down in mid-single digits "
    },
    {
        "content": "Aug 11 Kohl's Corp reported a higher-than-expected quarterly profit  helped by better inventory management and warm weather that boosted sales of summer clothes and accessories.",
        "date": "08112016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 2-Kohl's quarterly profit beats estimates; shares rise "
    },
    {
        "content": "* Sees fy 2016 earnings per share $3.80 to $4.00 excluding items",
        "date": "08112016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohls qtrly diluted earnings per share $0.77 "
    },
    {
        "content": "Aug 11 Kohl's Corp reported quarterly sales above analysts' estimates as warm weather in the quarter boosted demand for summer clothes and accessories.",
        "date": "08112016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's quarterly sales beat estimates "
    },
    {
        "content": "* Kohl's announces new partnership with Under Armour to propel its active business",
        "date": "07272016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's announces new partnership with Under Armour to propel its active business "
    },
    {
        "content": "TJX Cos Inc   the owner of off-price chains T.J. Maxx and Marshalls  reported better-than-expected quarterly sales and raised its profit forecast for the year as its discounted offerings lured shoppers from full-price retailers.",
        "date": "05172016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "T.J. Maxx owner raises forecast as shoppers hunt for bargains "
    },
    {
        "content": "* Shares rise as much as 4.2 pct   (Adds Marmaxx sales  analyst comment; updates shares)",
        "date": "05172016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 3-T.J. Maxx owner raises forecast as shoppers hunt for bargains "
    },
    {
        "content": "* 1st-qtr U.S. comparable sales rise 7.4 pct vs. est. 4.9 pct",
        "date": "05172016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 7-Home Depot raises forecasts after strong start to the year "
    },
    {
        "content": "* 1st-qtr U.S. comparable sales rise 7.4 pct vs. est. 4.9 pct",
        "date": "05172016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "CORRECTED-UPDATE 4-Home Depot raises forecasts after strong start to the year "
    },
    {
        "content": "* Shares recover after steep premarket fall   (Adds details from conference call  analyst comment; updates shares)",
        "date": "05132016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 5-J.C. Penney sales drop adds to department store blues "
    },
    {
        "content": "May 10 Wall Street securities analysts revised their ratings and price targets on several U.S.-listed companies  including Your Community Bankshares  Kohls and Nordic American Tanker  on Tuesday.            HIGHLIGHTS      * Aflac Inc        : FBR cuts to market perform rating        * Sprouts Farmers market Inc        : Goldman Sachs cuts to sell from neutral        * Hasbro Inc        : Piper Jaffray cuts to neutral from overweight           * St. Jude Medical Inc        : SunTrust",
        "date": "05102016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "U.S. RESEARCH ROUNDUP-Aflac  St. Jude Medical  Gap "
    },
    {
        "content": "Kohl's Corp  and Nordstrom Inc  reported a surprise fall in quarterly comparable sales on Thursday  highlighting the malaise in the department store sector as consumers pull back spending on apparel. | Video ",
        "date": "05122016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's  Nordstrom results deepen retail jitters "
    },
    {
        "content": "* Nordstrom down 17 pct after-market   (Adds Nordstrom results; updates shares)",
        "date": "05122016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 4-Kohl's  Nordstrom results deepen retail jitters "
    },
    {
        "content": "* On conf call -  transactions per store were down 4.8% for Q1",
        "date": "05122016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohl's on conf call - Need to take our expenses down to meet FY earnings forecast "
    },
    {
        "content": "* Were able to manage gross margin and inventory levels consistent with expectations as co took markdowns necessary to clear excess inventory",
        "date": "05122016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "BRIEF-Kohls Corp posts Q1 EPS of $0.09 "
    },
    {
        "content": "May 12 Department store operator Kohl's Corp  reported its first drop in net sales in six quarters as unseasonably cool weather in late March and early April hurt sales of spring apparel.",
        "date": "05122016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's reports first drop in net sales in six quarters "
    },
    {
        "content": "* Moody's on Kohl's - Downgrade reflects the persistent declines in earnings which started in 2011 and has resulted in weakening credit metrics",
        "date": "04192016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Moody's Downgrades Kohl's Senior Unsecured Rating To Baa2 "
    },
    {
        "content": "* Fitch downgrades Kohl's Corporation to 'BBB'; Outlook stable",
        "date": "04152016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "BRIEF-Fitch downgrades Kohl's Corporation to 'BBB' outlook stable "
    },
    {
        "content": "Capital One Financial Corp and department store chain Kohl's Corp must face a proposed class action lawsuit by customers who claim they were improperly charged for worthless credit card add-on services  a federal judge in Philadelphia has ruled.",
        "date": "03302016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Lawsuit over Capital One  Kohl's credit cards can proceed-ruling "
    },
    {
        "content": "U.S. department store operator Kohl's Corp  warned that sales could fall this year and said it was unlikely to meet its 2017 target of $21 billion in sales because of a weak economy and a pullback in consumer spending on its core categories such as apparel.",
        "date": "02252016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's warns 2016 sales may fall "
    },
    {
        "content": "* Full-year sales to be down or up 0.5 pct   (Adds details from conference call  analysts' comments  shares)",
        "date": "02252016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 2-Kohl's warns 2016 sales may fall "
    },
    {
        "content": "Feb 25 Department store operator Kohl's Corp  forecast full-year earnings largely below analysts' average estimate and said it will close 18 underperforming stores in 2016.",
        "date": "02252016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's forecasts profit below analyst estimates "
    },
    {
        "content": "Feb 12 Department store chain operator Kohl's Corp said it was eliminating three senior positions  including chief digital officer  to create a more \"nimble organization\".",
        "date": "02122016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Department store operator Kohl's eliminates 3 senior positions "
    },
    {
        "content": "Feb 12 Department store chain operator Kohl's Corp said it was eliminating three senior positions  including chief digital officer  to create a more \"nimble organization\".",
        "date": "02122016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 1-Department store operator Kohl's eliminates 3 senior positions "
    },
    {
        "content": "* Shares down 7.8 pct   (Adds details; updates share movement)",
        "date": "02092016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 3-Sears estimates quarterly sales below analysts' expectations "
    },
    {
        "content": "Ralph Lauren Corp  and Kohl's Corp  warned of a tough year ahead after reporting disappointing holiday-quarter sales on Thursday  leading investors to dump their stocks and dragging down shares of several other retailers.",
        "date": "02042016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Weak sales at Kohl's  Ralph Lauren spark selloff in retailers "
    },
    {
        "content": "* Kohl's estimates \"significantly lower\" 4th-qtr gross margin",
        "date": "02042016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 3-Weak sales at Kohl's  Ralph Lauren spark selloff in retailers "
    },
    {
        "content": "NEW YORK Beleaguered department store Kohl's Corp  is said to be debating whether to take itself private  according to a source cited by the Wall Street Journal on Sunday.",
        "date": "01112016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's exploring taking itself private: WSJ "
    },
    {
        "content": "NEW YORK  Jan 10 Beleaguered department store Kohl's Corp is said to be debating whether to take itself private  according to a source cited by the Wall Street Journal on Sunday.",
        "date": "01112016",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's exploring taking itself private -WSJ "
    },
    {
        "content": "Department store operator Kohl's Corp  appointed Walgreens Boots Alliance Inc  Chief Marketing Officer Sona Chawla to the newly created position of chief operating officer.",
        "date": "11172015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's appoints Walgreens marketing head COO "
    },
    {
        "content": "Department store operator Kohl's Corp  reported better-than-expected quarterly net sales and profit on Thursday due to strong back-to-school sales  a day after Macy's  full-year forecast cut raised concerns about the sector's performance. | Video ",
        "date": "11122015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's sales beat allays concerns about U.S. retail slowdown "
    },
    {
        "content": "Nov 17 Department store operator Kohl's Corp  appointed Walgreens Boots Alliance Inc Chief Marketing Officer Sona Chawla to the newly created position of chief operating officer.",
        "date": "11172015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "CORRECTED-UPDATE 1-Kohl's appoints Walgreens marketing head COO "
    },
    {
        "content": "* Shares rise as much as 9.5 pct   (Adds details from conference call  graphic; updates shares)",
        "date": "11122015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 3-Kohl's sales beat allays concerns about U.S. retail slowdown "
    },
    {
        "content": "Nov 17 Department store operator Kohl's Corp  named Walgreens Boots Alliance Inc Chief Marketing Officer Sona Chawla to the newly created position of chief operating officer.",
        "date": "11172015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's names Walgreens marketing head as COO "
    },
    {
        "content": "Nov 12 Department store operator Kohl's Corp  reported a 15.5 percent drop in quarterly profit as warmer-than-usual weather hurt sales of winter apparel and footwear.",
        "date": "11122015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's quarterly profit drops 15.5 pct "
    },
    {
        "content": "Mounting inventory at Macy's Inc  portends a tough holiday quarter for U.S. department store operators as they compete with home improvement and electronics retailers for the attention of thrifty customers.",
        "date": "11122015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Macy's rising inventory rings warning bells for dept stores "
    },
    {
        "content": "Nov 11 Mounting inventory at Macy's Inc  portends a tough holiday quarter for U.S. department store operators as they compete with home improvement and electronics retailers for the attention of thrifty customers.",
        "date": "11112015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Macy's rising inventory rings warning bells for dept stores "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)  Cisco Systems Inc's first-quarter revenue and profit are set to beat the average analyst estimates  according to Thomson Reuters StarMine. The network equipment maker is expected to benefit from a recovery in sales of its switches and routers. Inve",
        "date": "11112015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "What to Watch in the Day Ahead - Thursday  Nov 12 "
    },
    {
        "content": "Oct 12 Kohl's Corp said on Monday it will offer same-day delivery services in six more U.S. cities  taking a leaf out of Macy's Inc's book  as department stores aim to make online shopping more appealing ahead of the holiday season.",
        "date": "10122015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's expands same-day delivery to 9 cities ahead of holiday season "
    },
    {
        "content": "Sept 16 Department store operator Kohl's Corp  said on Wednesday it would hire an extra 69 000 workers for the holiday selling season  about 3 percent more than last year.",
        "date": "09162015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's to hire 3 pct more workers in stores this holiday season "
    },
    {
        "content": "Department store operator Kohl's Corp  reported lower-than-expected quarterly same-store sales as consumers delayed back-to-school shopping due to a shift in tax holidays to August.",
        "date": "08132015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's misses estimates on delayed back-to-school shopping "
    },
    {
        "content": "* Shares fall 11.3 pct   (Adds conference call details  analyst comments; updates shares)",
        "date": "08132015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 3-Kohl's misses estimates on delayed back-to-school shopping "
    },
    {
        "content": "Aug 13 Department store operator Kohl's Corp  reported lower-than-expected same-store sales for the second quarter as a shift in tax-free holidays to August delayed back-to-school shopping.",
        "date": "08132015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's same-store sales miss on delayed back-to-school shopping "
    },
    {
        "content": "Department store operator Kohl's Corp  reported quarterly same-store sales that missed analysts expectation  hurt by colder-than-usual weather in February. | Video ",
        "date": "05142015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's same-store sales nipped by cold February  shares fall "
    },
    {
        "content": "* Indexes up: Dow 0.8 pct  S&P 0.7 pct  Nasdaq 0.9 pct   (Adds details  changes comment  updates prices)",
        "date": "05142015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "US STOCKS-Wall St rises as jobless claims fall  dollar weakens "
    },
    {
        "content": "* Shares fall as much as 11.7 pct   (Adds analyst comments and graphic  update shares)",
        "date": "05142015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "UPDATE 3-Kohl's same-store sales nipped by cold February  shares fall "
    },
    {
        "content": "* Indexes up: Dow 0.6 pct  S&P 0.5 pct  Nasdaq 0.4 pct   (Updates to open)",
        "date": "05142015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "US STOCKS-Wall St opens higher as jobless claims fall  dollar weakens "
    },
    {
        "content": "* Futures up: Dow 107 pts  S&P 12 pts  Nasdaq 31 pts   (Adds details  comment  updates prices)",
        "date": "05142015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "US STOCKS-Wall St set to open up as weekly jobless claims fall "
    },
    {
        "content": "May 14 Department store operator Kohl's Corp  reported lower-than-expected quarterly same-store sales  hurt by colder-than-usual weather in February.",
        "date": "05142015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Kohl's same-store sales miss estimates  hurt by cold February "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 03 (Fitch) Fitch Ratings has affirmed its ratings on Kohl's  Corporation (Kohl's)  including the Issuer Default Rating (IDR) at 'BBB+'  and  has revised the Rating Outlook to Stable from Negative. A full list of ratings  is provided at the end of this release. KEY RATING DRIVERS The affirmation reflects the company's strong market share position as the  third-largest department store retailer in the U.S.  convenient off-",
        "date": "03032015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Fitch Affirms Kohl's IDR at 'BBB+'; Outlook Revised to Stable "
    },
    {
        "content": "Department store operator Kohl's Corp  forecast full-year revenue above analysts' expectations and reported higher-than-expected quarterly profit and sales  helped by demand for apparel and accessories in the holiday shopping season.",
        "date": "02262015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "KSS",
        "title": "Kohl's forecasts full-year sales above estimates "
    },
    {
        "content": "Feb 26 Department store operator Kohl's Corp  forecast full-year revenue above analysts' expectations and reported higher-than-expected quarterly profit and sales  helped by demand for apparel and accessories in the holiday shopping season.",
        "date": "02262015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "REFILE-UPDATE 2-Kohl's forecasts full-year sales above estimates "
    },
    {
        "content": "Feb 26 Department store operator Kohl's Corp  reported a 10.5 percent rise in quarterly profit  helped by higher sales of apparel and accessories in the holiday shopping season.",
        "date": "02262015",
        "name": "Kohl&#39;s Corporation",
        "news_type": "normal",
        "symbol": "KSS",
        "title": "Department store operator Kohl's profit rises 10.5 pct "
    }
]