[
    {
        "content": "* Files for potential mixed shelf; size not disclosed - SEC Filing Source text: (http://bit.ly/2ACe3Ti) Further company coverage:",
        "date": "11132017",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern files for potential mixed shelf size not disclosed "
    },
    {
        "content": "Regional U.S. railroad Kansas City Southern  posted a better-than expected quarterly profit on Friday despite disruptions from Hurricane Harvey but may be impacted by the NAFTA negotiations as more than a quarter of its revenue comes from shipments between Mexico and the United States.",
        "date": "10202017",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "Kansas City Southern overcomes hurricane to beat on revenue "
    },
    {
        "content": "Oct 20 Regional U.S. railroad Kansas City Southern posted a better-than expected quarterly profit on Friday despite disruptions from Hurricane Harvey but may be impacted by the NAFTA negotiations as more than a quarter of its revenue comes from shipments between Mexico and the United States.",
        "date": "10202017",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "UPDATE 3-Kansas City Southern overcomes hurricane to beat on revenue "
    },
    {
        "content": "* Kansas City Southern reports record third quarter 2017 operating income and operating ratio",
        "date": "10202017",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern Q3 earnings per share $1.23 "
    },
    {
        "content": "Oct 20 Kansas City Southern  the fourth-largest U.S. railroad  reported a higher quarterly net profit on Friday  driven by year-over-year growth from all of its six business units and increased rail car volumes.",
        "date": "10202017",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "Railroad Kansas City Southern quarterly profit rises "
    },
    {
        "content": "* Kansas City Southern reports record second quarter 2017 revenues and earnings per share  and all-time record quarterly operating income",
        "date": "07212017",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern reports Q2 EPS $1.27 "
    },
    {
        "content": "* KCS adds four directors to board; strengthens key areas on board",
        "date": "05302017",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern adds four directors to board "
    },
    {
        "content": "Regional U.S. railroad Kansas City Southern  beat expectations for first-quarter earnings  reporting a 36 percent jump in quarterly profit driven by an increase in overall carload volumes  including a significant rise in energy revenue.",
        "date": "04212017",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "Kansas City Southern beats expectations  stock dips on Mexico uncertainty "
    },
    {
        "content": "April 21 Regional U.S. railroad Kansas City Southern beat expectations for first-quarter earnings  reporting a 36 percent jump in quarterly profit driven by an increase in overall carload volumes  including a significant rise in energy revenue.",
        "date": "04212017",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "UPDATE 2-Kansas City Southern beats expectations  stock dips on Mexico uncertainty "
    },
    {
        "content": "* Kansas City Southern reports record first quarter revenues  carloads  operating income  operating ratio and earnings per share",
        "date": "04212017",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern Q1 earnings per share $1.38 "
    },
    {
        "content": "April 21 Regional U.S. railroad Kansas City Southern reported a 36 percent jump in quarterly net profit on Friday  driven by an increase in overall carload volumes.",
        "date": "04212017",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "Kansas City Southern profit jumps 36 pct as volumes rise "
    },
    {
        "content": "* Kansas City Southern de Mexico files response to the investigating authority of the mexican federal competition commission preliminary report on effective competition in the mexican railway freight system",
        "date": "04202017",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern files response on effective competition in the Mexican Railway Freight System "
    },
    {
        "content": "* Says CEO Patrick Ottensmeyer's 2016 total compensation $5.9 million versus $3.1 million in 2015 Source tex:(http://bit.ly/2ozMjMA) Further company coverage:",
        "date": "04042017",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern's CEO's 2016 total compensation $5.9 mln "
    },
    {
        "content": "* Kansas city issues statement regarding mexican economic competition commission preliminary report on effective competition in market for interconnection services",
        "date": "03162017",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City issues statement regarding Mexican Economic Competition Commission's preliminary report "
    },
    {
        "content": "CHICAGO Kansas City Southern  on Friday reported a lower quarterly net profit that missed Wall Street estimates by a wide margin as a historic drop in the Mexican peso after the election of President-elect Donald Trump affected the regional U.S. railroad's operations in Mexico.",
        "date": "01202017",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "Mexican peso's slump hits Kansas City Southern profit "
    },
    {
        "content": "CHICAGO  Jan 20 Kansas City Southern on Friday reported a lower quarterly net profit that missed Wall Street estimates by a wide margin as a historic drop in the Mexican peso after the election of President-elect Donald Trump affected the regional U.S. railroad's operations in Mexico.",
        "date": "01202017",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "UPDATE 3-Mexican peso's slump hits Kansas City Southern profit "
    },
    {
        "content": "CHICAGO  Jan 20 Regional U.S. railroad Kansas City Southern on Friday reported a lower quarterly net profit  which the company blamed on the weakness of the Mexican peso versus the U.S. dollar.",
        "date": "01202017",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "Kansas City Southern profit falls on weak Mexican peso "
    },
    {
        "content": "* KCS  Watco  WTC announce Mexico refined energy products terminal to facilitate increased U.S. export of liquid fuels",
        "date": "01112017",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern  Watco Companies and WTC Industrial announce joint venture investment "
    },
    {
        "content": "NEW YORK  Nov 17 The head of U.S. railroad Kansas City Southern said on Thursday the company could transfer money from Mexico to the United States if President-elect Donald Trump lowers taxes for those transactions  even as the company works to convince Trump not to clamp down on trade with Mexico.",
        "date": "11172016",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "KC Southern railroad could transfer funds to U.S. from Mexico "
    },
    {
        "content": "DETROIT Regional U.S. railroad Kansas City Southern  on Tuesday reported a worse-than-expected quarterly net profit  weighed by falling freight volumes and disruptions stemming from anti-government protests in Mexico.",
        "date": "10182016",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "Lower revenue  Mexico problems hurt Kansas City Southern profit "
    },
    {
        "content": "DETROIT  Oct 18 Regional U.S. railroad Kansas City Southern on Tuesday reported a worse-than-expected quarterly net profit  weighed by falling freight volumes and disruptions stemming from anti-government protests in Mexico.",
        "date": "10182016",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "UPDATE 1-Lower revenue  Mexico problems hurt Kansas City Southern profit "
    },
    {
        "content": "DETROIT  Oct 18 Regional U.S. railroad Kansas City Southern on Tuesday reported a lower quarterly net profit  as freight volumes fell in sectors including automotive and consumer goods.",
        "date": "10182016",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "Kansas City Southern third-quarter profit falls "
    },
    {
        "content": "* Q3 earnings per share view $1.18 -- Thomson Reuters I/B/E/S",
        "date": "10182016",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern Q3 EPS $1.12 "
    },
    {
        "content": "* Kansas City Southern Railway Company opened a new  multi-commodity transload terminal in Dallas  Texas",
        "date": "10072016",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-KCS opens new transload terminal in Dallas  Texas "
    },
    {
        "content": "CHICAGO U.S regional railroad Kansas City Southern  on Tuesday reported a higher-than-expected second-quarter profit  helped by cost cutting  but its freight volumes were flat and revenue fell more than analysts had forecast.",
        "date": "07192016",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "Kansas City Southern profit rises  helped by cost cutting "
    },
    {
        "content": "CHICAGO  July 19 U.S regional railroad Kansas City Southern on Tuesday reported a higher-than-expected second-quarter profit  helped by cost cutting  but its freight volumes were flat and revenue fell more than analysts had forecast.",
        "date": "07192016",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "UPDATE 1-Kansas City Southern profit rises  helped by cost cutting "
    },
    {
        "content": "CHICAGO  July 19 U.S regional railroad Kansas City Southern on Tuesday reported a higher quarterly net profit  due to cost cutting and a fuel excise tax credit on its Mexican operations.",
        "date": "07192016",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "Kansas City Southern quarterly profit rises "
    },
    {
        "content": "* KCS announces registered exchange offers for $2.088 billion of senior notes  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06272016",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern announces registered exchange offers for $2.09 bln of senior notes "
    },
    {
        "content": "* Pricing of $250.0 million in aggregate principal amount of its 3.125% senior notes due 2026",
        "date": "05112016",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern prices senior notes "
    },
    {
        "content": "* KCS names Patrick J. Ottensmeyer as president and chief executive officer",
        "date": "05102016",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas City Southern names Patrick Ottensmeyer as CEO "
    },
    {
        "content": "* Ceo David Starling's FY 2015 total compensation $7.9 million versus $5.7 million in fy 2014 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "04052016",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "BRIEF-Kansas city southern - CEO David Starling's FY 2015 total compensation "
    },
    {
        "content": "CHICAGO  July 17 Regional U.S. railroad Kansas City Southern on Friday reported a lower quarterly net profit  hurt by falling coal shipments in particular as shipments declined almost across the board.",
        "date": "07172015",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "UPDATE 1-Falling coal  grain shipments hurt Kansas City Southern profit "
    },
    {
        "content": "CHICAGO  July 17 Regional U.S. railroad Kansas City Southern on Friday reported a lower quarterly net profit  as revenue was hit primarily by falling coal and grain freight volumes.",
        "date": "07172015",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "Kansas City Southern quarterly profit falls "
    },
    {
        "content": "NEW YORK  May 14 U.S. corporate spending on capital projects could fall this year to the lowest level since 2011  with steep reductions by the energy industry and companies in other sectors cutting spending amid broad concerns about global growth.",
        "date": "05142015",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "UPDATE 1-U.S. capital spending seen falling to four-year low in 2015 "
    },
    {
        "content": "CHICAGO  April 21 Regional U.S. railroad Kansas City Southern on Tuesday reported a drop in revenue as its coal and energy-related freight volumes took a hit and the strong U.S. dollar hurt its Mexico-based business  but net profit rose.",
        "date": "04212015",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "UPDATE 1-Kansas City Southern reports decline in 1st-qtr revenue "
    },
    {
        "content": "CHICAGO  April 21 Regional U.S. railroad Kansas City Southern on Tuesday reported higher quarterly net profit as a lower tax rate and lower fuel prices offset a dip in revenue.",
        "date": "04212015",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "Kansas City Southern reports higher 1st-qtr profit "
    },
    {
        "content": "CHICAGO Regional railroad Kansas City Southern  reported a higher quarterly net profit that came in well above Wall Street expectations  driven mainly by higher freight volumes  and said it expected to benefit from a growing U.S. economy in 2015.",
        "date": "01232015",
        "name": "Kansas City Southern",
        "news_type": "topStory",
        "symbol": "KSU",
        "title": "Kansas City Southern profit rises  expects solid 2015 growth "
    },
    {
        "content": "CHICAGO  Jan 23 Regional railroad Kansas City Southern reported a higher quarterly net profit that came in well above Wall Street expectations  driven mainly by higher freight volumes  and said it expected to benefit from a growing U.S. economy in 2015.",
        "date": "01232015",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "UPDATE 1-Kansas City Southern profit rises  expects solid 2015 growth "
    },
    {
        "content": "CHICAGO  Jan 23 Regional railroad Kansas City Southern on Friday reported a higher quarterly net profit that came in above Wall Street expectations  driven by rising freight volumes in particular in the automotive and energy sectors.",
        "date": "01232015",
        "name": "Kansas City Southern",
        "news_type": "normal",
        "symbol": "KSU",
        "title": "Kansas City Southern profit rises  beats expectations "
    }
]