[
    {
        "content": "(The following statement was released by the rating agency) SEOUL  September 11 (Fitch) Fitch Ratings has upgraded South Korea-based KT Corporation's (KT) Long-Term Foreign- and Local-Currency Issuer Default Ratings (IDRs) and its senior unsecured ratings to 'A' from 'A-'. The Outlook on the IDRs is Stable. The upgrade reflects our expectations of a sustained stronger financial profile achieved through the disposal of non-core assets  workforce reduction and effective cost control. The company h",
        "date": "09112017",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "Fitch Upgrades KT Corporation to 'A'; Outlook Stable "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  August 09 (Fitch) Fitch Ratings has assigned KT Corporation's (KT  A-/Stable) USD400 million 2.625% notes due 2022 a final rating of 'A-'. KT will use the net proceeds to refinance existing debt and for general corporate purposes. The notes are rated at the same level as KT's senior unsecured rating as they represent direct  unconditional  unsecured and unsubordinated obligations of the company. The assignment of the final rating",
        "date": "08092017",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "Fitch Assigns KT Corporation's USD Bond Final 'A-' Rating "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  July 30 (Fitch) Fitch Ratings has assigned KT Corporation's (KT  A-/Stable) proposed US dollar senior unsecured bond an expected rating of 'A-(EXP)'. KT will use the net proceeds to refinance existing debt and for general corporate purposes. The notes are rated at the same level as KT's senior unsecured rating as they represent direct  unconditional  unsecured and unsubordinated obligations of the company. The final rating is con",
        "date": "07312017",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "Fitch Assigns KT Corporation's USD Bond 'A-(EXP)' Rating "
    },
    {
        "content": "* Says KT Corporation sold 10.4 percent stake in the company  decreasing its stake in the company down to 48.0 percent from 58.4 percent",
        "date": "04252017",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "BRIEF-KT sells 10.4 pct stake in Genie Music "
    },
    {
        "content": "* Says it signed a 4.53 billion won contract with KT on KT UTP modem unit price",
        "date": "04102017",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "BRIEF-Ubiquoss signs contract worth 4.53 bln won "
    },
    {
        "content": "* KT Corporation's CEO Chang-Gyu Hwang says group to launch a 3D GPS  Further company coverage:   (Reporting by Sophie Sassard)",
        "date": "02272017",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "BRIEF-KT Corps's Chang-Gyu Hwang says group to launch a 3D GPS "
    },
    {
        "content": "* Says it will pay annual cash dividend at 800 won/share for FY 2016",
        "date": "02012017",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "BRIEF-KT says annual cash dividend for FY 2016 "
    },
    {
        "content": "* Says Agrokontsern Kanevskoy decreases its stake in company to 9.8776 pct from 29.6329 pct",
        "date": "01172017",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "BRIEF-Kanevsksakhar announces changes in the shareholding structure "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  September 12 (Fitch) Fitch Ratings has affirmed South Korea-based KT  Corporation's (KT) Long-Term Foreign- and Local-Currency Issuer Default Ratings  (IDRs) as well as its senior unsecured rating at 'A-'. The Outlook is Stable. KEY RATING DRIVERS Stabilising Margin: Fitch expects KT's margins to continue to benefit from lower  marketing and selling  general and administrative costs following a  restructuring to streamline its bu",
        "date": "09122016",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "Fitch Affirms KT Corporation at 'A-'; Outlook Stable "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  July 18 (Fitch) Fitch Ratings has assigned KT Corporation's (KT  A-/  Stable) US dollar senior unsecured bond a final rating of 'A-'. KT will use the  net proceeds from the bond to refinance existing debt and for general corporate  purposes. The notes are rated at the same level as KT's senior unsecured rating as they  represent direct  unconditional  unsecured and unsubordinated obligations of the  company. The assignment of the",
        "date": "07192016",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "Fitch Assigns KT's USD Bond Final 'A-' Rating "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  July 11 (Fitch) Fitch Ratings has assigned KT Corporation's (KT  A-/  Stable) proposed US dollar bond an expected rating of 'A-(EXP)'. KT will use the  net proceeds from the bond to refinance existing debt and for general corporate  purposes. The notes are rated at the same level as KT's senior unsecured rating as they  represent direct  unconditional  unsecured and unsubordinated obligations of the  company. The final rating is ",
        "date": "07122016",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "Fitch Assigns KT's USD Bond 'A-(EXP)' Rating "
    },
    {
        "content": "* Alcatel-Lucent and Korea's KT sign collaboration agreement to deliver 5G mobile networks of the future",
        "date": "05192015",
        "name": "KT Corporation",
        "news_type": "topStory",
        "symbol": "KT",
        "title": "REFILE-BRIEF-Alcatel-Lucent and Korea's KT sign collaboration agreement "
    }
]