[
    {
        "content": "* Lamar Advertising Co announces third quarter 2017 operating results",
        "date": "11062017",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "BRIEF-Lamar Advertising reports Q3 adjusted FFO per share $1.40 "
    },
    {
        "content": "* Lamar advertising company announces second quarter 2017 operating results",
        "date": "08082017",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "BRIEF-Lamar Advertising reports Q2 adjusted FFO per share $1.39 "
    },
    {
        "content": "* Lamar Advertising acquires Billboards from Steen Outdoor Advertising",
        "date": "08042017",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "BRIEF-Lamar Advertising buys Billboards from Steen Outdoor Advertising "
    },
    {
        "content": "* Lamar advertising company announces first quarter 2017 operating results",
        "date": "05042017",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "BRIEF-Lamar Advertising reports Q1 EPS of $0.42 "
    },
    {
        "content": "* Lamar Advertising Company announces fourth quarter and year end 2016 operating results",
        "date": "02222017",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "BRIEF-Lamar Advertising Co announces Q4 revenue of $386.7 mln "
    },
    {
        "content": "* Janus Capital Management discloses 10 percent passive stake in Lamar Advertising Co as of January 31  2017  - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "02102017",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "BRIEF-Janus Capital discloses 10 pct passive stake in Lamar Advertising Co as of Jan. 31 "
    },
    {
        "content": "* Lamar Advertising Company announces third quarter 2016 operating results",
        "date": "11032016",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "BRIEF-Lamar Advertising Company announces third quarter 2016 operating results "
    },
    {
        "content": "* Lamar Advertising Company announces second quarter 2016 operating results",
        "date": "08092016",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "BRIEF-Lamar Advertising Q2 adjusted FFO per share $1.37 "
    },
    {
        "content": "* Lamar Advertising Co says commencement of exchange offer for 5 3/4 pct senior notes due 2026",
        "date": "08012016",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "BRIEF-Lamar Advertising says commencement of exchange offer for 5 3/4 pct senior notes due 2026 "
    },
    {
        "content": "* Qtrly net revenue increased 11.9% to $338.5 million  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05052016",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "BRIEF-Lamar Advertising says qtrly net revenue increased 11.9 pct to $338.5 million "
    },
    {
        "content": "LOS ANGELES Rapper Kendrick Lamar dropped a surprise album that went straight to the top of the weekly U.S. Billboard 200 album chart on Monday  following in the steps of Beyonce  Drake and Future. | Video ",
        "date": "03142016",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "Kendrick Lamar's surprise 'untitled unmastered' album tops Billboard "
    },
    {
        "content": "LOS ANGELES Rapper Kendrick Lamar led the Grammy winners on Monday with five wins but was shut out of the night's top categories as Taylor Swift nabbed album of the year in an upset victory. | Video ",
        "date": "02162016",
        "name": "Lamar Advertising Company",
        "news_type": "normal",
        "symbol": "LAMR",
        "title": "Lamar shut out as Swift  Sheeran  Mars win top Grammy awards "
    },
    {
        "content": "Lamar Advertising Co  is in advanced talks to buy billboard assets in five U.S. cities from Clear Channel Outdoor Holdings Inc  worth roughly $450 million  according to people familiar with the matter.",
        "date": "01062016",
        "name": "Lamar Advertising Company",
        "news_type": "topStory",
        "symbol": "LAMR",
        "title": "Lamar in advanced talks to buy Clear Channel Outdoor assets: sources "
    },
    {
        "content": "Jan 6 Lamar Advertising Co is in advanced talks to buy billboard assets in five U.S. cities from Clear Channel Outdoor Holdings Inc worth roughly $450 million  according to people familiar with the matter.",
        "date": "01062016",
        "name": "Lamar Advertising Company",
        "news_type": "normal",
        "symbol": "LAMR",
        "title": "Lamar in advanced talks to buy Clear Channel Outdoor assets-sources "
    },
    {
        "content": "Nov 9 Billboard operator Clear Channel Outdoor  is exploring the sale of assets in some U.S. markets that could be worth at least $800 million  according to sources familiar with the matter.",
        "date": "11092015",
        "name": "Lamar Advertising Company",
        "news_type": "normal",
        "symbol": "LAMR",
        "title": "Clear Channel Outdoor may sell some US billboard assets -sources "
    }
]