[
    {
        "content": "Lazard Ltd  reported a better-than-expected quarterly profit on Thursday  as strength in its asset management business offset a sharp drop in financial advisory fees.",
        "date": "10262017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard's asset management powers profit as advisory fees drop "
    },
    {
        "content": "Oct 26 Lazard Ltd reported a better-than-expected quarterly profit on Thursday  as strength in its asset management business offset a sharp drop in financial advisory fees.",
        "date": "10262017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 2-Lazard's asset management powers profit as advisory fees drop "
    },
    {
        "content": "Financial adviser Lazard Ltd  reported a better-than-expected quarterly profit  helped by strength in its asset management business.",
        "date": "10262017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard's asset management powers profit beat "
    },
    {
        "content": "* Lazard Ltd reports third-quarter and nine-month 2017 results",
        "date": "10262017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard Q3 earnings per share $0.82 "
    },
    {
        "content": "Oct 26 Financial adviser Lazard Ltd reported a 3 percent fall in quarterly profit on Thursday as costs rose.",
        "date": "10262017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard's profit falls as expenses rise "
    },
    {
        "content": "Sept 18 Toys \"R\" Us Inc has been relying on the debt restructuring advice of investment bank Lazard Ltd as it prepares to file for bankruptcy and now the struggling U.S. toy retailer has decided it wants to bring some of Lazard's expertise inhouse.",
        "date": "09182017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-Lazard debt restructuring banker returns to Toys \"R\" Us "
    },
    {
        "content": "LONDON  Sept 7 (IFR) - Lazard has hired Tim Loftsgard as a managing director in its Canadian financial advisory business.",
        "date": "09072017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-Loftsgard heads to Lazard "
    },
    {
        "content": "Aug 14 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "08142017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES- HSBC  Lazard  Baird "
    },
    {
        "content": "NEW YORK  Aug 14 (IFR) - Lazard has hired Jerry Wiant as managing director in its North America financial institutions group covering depository institutions.",
        "date": "08142017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "MOVES-RBC co-head of FIG Wiant joins Lazard "
    },
    {
        "content": "Lazard Ltd said on Monday that Jerry Wiant has joined the asset management firm as a managing director for its financial advisory business  covering depository institutions.",
        "date": "08142017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard names Jerry Wiant managing director of financial advisory "
    },
    {
        "content": "* Lazard ltd says  effective october 1  2017  evan russo  will become chief financial officer of lazard",
        "date": "07262017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard reports senior-level appointments "
    },
    {
        "content": "July 26 Energy Capital Partners LLC is in advanced talks to buy power producer Calpine Corp  Bloomberg reported  citing people familiar with the matter.",
        "date": "07262017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Energy Capital in advanced talks to buy Calpine - Bloomberg "
    },
    {
        "content": "* Sets quarterly dividend of $0.41per share Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard declares quarterly dividend "
    },
    {
        "content": "Lazard Ltd  reported higher-than-expected quarterly profit and revenue on Thursday as it earned more from advising on deals and on strength in its asset management unit.",
        "date": "07272017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard profit beats on record advisory  asset management revenue "
    },
    {
        "content": "* Global M&A environment remains favorable - CEO (Adds Breakingviews link)",
        "date": "07272017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 3-Lazard profit beats on record advisory  asset management revenue "
    },
    {
        "content": "* Lazard Ltd reports second-quarter and first-half 2017 results",
        "date": "07272017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard Q2 adjusted earnings per share $0.98 excluding items "
    },
    {
        "content": "July 27 Financial advisory and asset management firm Lazard Ltd reported a 50 percent jump in quarterly profit on Thursday as it earned more from advising on deals.",
        "date": "07272017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard's quarterly profit jumps 50 percent "
    },
    {
        "content": "July 13 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "07132017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-Lazard  Duff & Phelps  Credit Suisse  BTIG "
    },
    {
        "content": "July 13 Financial advisory firm and asset manager Lazard Ltd said on Thursday it appointed Ruediger Grube as chairman of investment banking  Germany.",
        "date": "07132017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "MOVES-Lazard names new chairman of investment banking for Germany "
    },
    {
        "content": "June 13 U.S. department store operator Neiman Marcus said on Tuesday it had ended talks regarding a partial or full sale of the company  three months after embarking on a review of strategic alternatives under the weight of a $4.8 billion debt load.",
        "date": "06132017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 2-Debt-laden Neiman Marcus abandons hope of a sale "
    },
    {
        "content": "May 10 Power producer Calpine Corp is exploring a sale and is working with investment bankers at Lazard Ltd to find possible buyers  the Wall Street Journal reported on Wednesday.",
        "date": "05102017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 1-Power company Calpine explores sale - WSJ "
    },
    {
        "content": "May 10 Power producer Calpine Corp is exploring a sale  the Wall Street Journal reported on Wednesday.",
        "date": "05102017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Power producer Calpine exploring a sale - WSJ "
    },
    {
        "content": "MADRID  May 11 Spain's Banco Popular has hired JPMorgan and Lazard to advise it on exploring a sale of the bank  El Confidencial newspaper reported on Thursday  citing financial sources.",
        "date": "05112017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Spain's Banco Popular hires Lazard  JPMorgan for sale - report "
    },
    {
        "content": "Lazard Ltd  reported a higher-than-expected quarterly profit  mainly driven by growth in its financial advisory business as cross-border mergers and acquisitions got off to the strongest start in a decade.",
        "date": "04272017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard profit beats estimates as deal-making picks up "
    },
    {
        "content": "* Increases quarterly dividend by 8 percent to $0.41 per share Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard increases quarterly dividend by 8 pct to $0.41 per share "
    },
    {
        "content": "* Shares rise 2.3 pct (Adds Breakingviews link  updates share price)",
        "date": "04272017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 4-Lazard profit beats estimates as deal-making picks up "
    },
    {
        "content": "April 27 Financial advisory and asset management firm Lazard Ltd reported a 61 percent jump in quarterly profit  helped by growth in its financial advisory and asset management businesses.",
        "date": "04272017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard quarterly profit jumps 61 pct "
    },
    {
        "content": "NEW YORK  March 23 Lazard Ltd has tapped a portfolio manager at investment firm Dimensional Fund Advisors (DFA) to bolster its expanding activist shareholder defense team  according to people familiar with the matter.",
        "date": "03232017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "CORRECTED-MOVES-Lazard taps Dimensional Fund exec for activist defense team -sources "
    },
    {
        "content": "* Eugenio Garza y Garza joins Lazard as a managing director in financial advisory  Mexico  Source text for Eikon: Further company coverage:",
        "date": "03162017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Eugenio Garza y Garza joins Lazard as a managing director in financial advisory  Mexico "
    },
    {
        "content": "* Lazard ltd - ceo kenneth jacobs' fy 2016 total compensation $11.64 million versus $11.68 million in fy 2015 - sec filing",
        "date": "03142017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard Ltd CEO Kenneth Jacobs' FY 2016 total compensation $11.64 mln vs $11.68 mln "
    },
    {
        "content": "* Takata at centre of global airbag recall  seeks financial rescue",
        "date": "02042017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 1-Takata taps KSS as final bidder for restructuring deal - sources "
    },
    {
        "content": "Lazard Ltd  reported better-than-expected earnings on Thursday  as a surge in deals activity in the fourth quarter boosted revenue in its financial advisory business.",
        "date": "02022017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard's quarterly earnings beat on M&A boost "
    },
    {
        "content": "* First half of 2017 looks strong - CEO   (Adds Breakingviews link)",
        "date": "02022017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 4-Lazard's quarterly earnings beat on M&A boost "
    },
    {
        "content": "* Expects vesting  settlement of deferred incentive compensation awards scheduled to vest on March 1 may be accelerated to earlier dates  Source text: (http://bit.ly/2k3kPfd) Further company coverage:",
        "date": "02022017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard expects vesting  settlement of deferred incentive compensation awards "
    },
    {
        "content": "* Board of directors has voted to declare a special dividend of $1.20 per share  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard declares special dividend and quarterly dividend "
    },
    {
        "content": "* Lazard Ltd reports full-year and fourth-quarter 2016 results",
        "date": "02022017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard Q4 adjusted earnings per share $1.13 "
    },
    {
        "content": "Feb 2 Financial advisory and asset management firm Lazard Ltd reported a fall of about 19 percent in quarterly profit on Thursday  hurt by higher costs.",
        "date": "02022017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard's profit slumps 19 pct as costs rise "
    },
    {
        "content": "* Takata has said wants private process for global operations",
        "date": "01192017",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 3-Takata bidders plan court-led turnaround for Japan business - source "
    },
    {
        "content": "* Kevin Bonebrake joins Lazard as a managing director in oil and gas financial advisory  Source text for Eikon:  Further company coverage:",
        "date": "01112017",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard names Kevin Bonebrake managing director in oil and gas financial advisory "
    },
    {
        "content": "Nov 16 (IFR) - Mary Ann Deignan  co-head of global equity capital markets at Bank of America Merrill Lynch  is to join Lazard as a managing director advising on shareholder activism.",
        "date": "11162016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-Deignan switches from BAML to Lazard "
    },
    {
        "content": "* Lazard world dividend & income fund announces stock repurchase program",
        "date": "11092016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard world dividend & income fund announces stock repurchase program "
    },
    {
        "content": "* Raises full-year net profit forecast  banking on asset sales   (Adds details from results briefing)",
        "date": "11042016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 3-Takata mulls bankruptcy for U.S. unit  filing will take time - source "
    },
    {
        "content": "WASHINGTON Japanese auto parts maker Takata Corp  has been considering a possible bankruptcy filing for its U.S. unit but no filing is expected soon  a source briefed on the matter said.",
        "date": "11042016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Takata U.S. unit mulling bankruptcy but no filing expected soon: source "
    },
    {
        "content": "WASHINGTON  Nov 3 Japanese auto parts maker Takata Corp has been considering a possible bankruptcy filing for its U.S. unit but no filing is expected soon  a source briefed on the matter said.",
        "date": "11042016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Takata U.S. unit mulling bankruptcy but no filing expected soon -source "
    },
    {
        "content": "TOKYO  Trading in shares of Takata Corp  was halted on Friday after the Nikkei business daily reported the embattled Japanese auto parts maker was preparing for a possible bankruptcy filing for its U.S. unit to help secure a financial sponsor.",
        "date": "11042016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Takata shares halted on report U.S. unit preparing possible bankruptcy filing "
    },
    {
        "content": "* Lazard board of directors approves share repurchase authorization",
        "date": "11012016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard board of directors approves share repurchase authorization "
    },
    {
        "content": "TOKYO  Nov 2 U.S. buyout firm KKR & Co  is no longer in the bidding to buy Takata Corp  the Japanese parts maker at the centre of the world's biggest auto recall  according to a person briefed on the bidding process.",
        "date": "11022016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 1-KKR no longer in bidding for Japan's Takata - source "
    },
    {
        "content": "* Lazard Ltd - is commencing an offering of $300 million aggregate principal amount of senior notes due 2027",
        "date": "11012016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard - commencing an offering of $300 million aggregate principal amount of senior notes "
    },
    {
        "content": "TOKYO  Nov 2 U.S. buyout firm KKR & Co  is no longer in the bidding to buy Takata Corp  the Japanese parts maker at the centre of the world's biggest auto recall  said a person who was briefed on the bidding process.",
        "date": "11022016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "KKR no longer in bidding for Japan's Takata - source "
    },
    {
        "content": "Lazard Ltd  reported a higher-than-expected quarterly profit as strength in its financial advisory unit edged up slightly from the year-ago period.",
        "date": "10272016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard profit beats expectation as restructuring advisory fees jump "
    },
    {
        "content": "* Lazard Ltd - Board of directors has voted to declare a quarterly dividend of $0.38 per share on its outstanding class a common stock.  Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard Declares Quarterly Dividend "
    },
    {
        "content": "* Lazard acquires remaining 50% stake in mba lazard  fully integrating its latin american operations",
        "date": "10252016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard acquires remaining stake in MBA Lazard "
    },
    {
        "content": "NEW YORK  Oct 23 When Time Warner Inc's  Jeff Bewkes welcomed AT&T Inc's Randall Stephenson for lunch at Time Warner Center in New York in late August  their meeting was supposed to be one of the catch-ups the two chief executives have had over the years.",
        "date": "10232016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "DEALTALK-For AT&T  Time Warner was always on the menu "
    },
    {
        "content": "Oct 27 Lazard Ltd reported a higher-than-expected quarterly profit as strength in its financial advisory unit edged up slightly from the year-ago period.",
        "date": "10272016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 3-Lazard profit beats expectation as restructuring advisory fees jump "
    },
    {
        "content": "Oct 27 Financial advisory and asset management firm Lazard Ltd's quarterly profit tumbled 71.8 percent as costs rose.",
        "date": "10272016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard's profit tumbles 71.8 pct "
    },
    {
        "content": "* Lazard ltd reports third-quarter and nine-month 2016 results",
        "date": "10272016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard Q3 GAAP earnings per share $0.85 "
    },
    {
        "content": "FRANKFURT  Oct 26 British packaging group RPC  is preparing a bid for private equity-owned French peer Albea in a potential $1.5 billion deal as it seeks to broaden its footprint in bottles  dispensers and tubes for cosmetics  people close to the matter said.",
        "date": "10262016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "British packaging group RPC prepares bid for French peer Albea - sources "
    },
    {
        "content": "SINGAPORE/HONG KONG DBS Group Holdings  and Julius Baer Gruppe  are weighing bids for Dutch lender ABN AMRO Group's  Asia private banking business that manages about $20 billion in assets  several people with direct knowledge of the matter said.",
        "date": "10252016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "DBS  Julius Baer weigh bids for ABN AMRO Asia wealth unit - sources "
    },
    {
        "content": "* Bank manages about $20 billion in Asia private banking assets",
        "date": "10252016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 1-DBS  Julius Baer weigh bids for ABN AMRO Asia wealth unit- sources "
    },
    {
        "content": "TOKYO Shares of Takata Corp  fell sharply on Tuesday after The Wall Street Journal reported late last week that the troubled Japanese air bag maker is weighing a U.S. bankruptcy filing as one option for clearing a path for an outside investor.",
        "date": "10112016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Takata tumbles after report company weighs U.S. bankruptcy filing "
    },
    {
        "content": "TOKYO  Oct 11 Shares of Takata Corp  fell sharply on Tuesday after The Wall Street Journal reported late last week that the troubled Japanese air bag maker is weighing a U.S. bankruptcy filing as one option for clearing a path for an outside investor.",
        "date": "10112016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 1-Takata tumbles after report company weighs U.S. bankruptcy filing "
    },
    {
        "content": "TOKYO  Sept 29 All five bidders seeking to bail out Japan's beleaguered Takata Corp have presented restructuring plans that require the air bag maker to file for bankruptcy protection  people with knowledge of the process told Reuters.",
        "date": "09292016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Takata should file for bankruptcy protection  all five bidders say -sources "
    },
    {
        "content": "TOKYO  Sept 26 The plan to sell beleaguered Takata Corp to a rescuer  slated by year-end  is likely to extend into next year as some bidders want to drag the air bag maker through bankruptcy to wipe out most of its debt  people with knowledge of the matter said.",
        "date": "09262016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Takata's search for a saviour could drag into next year -sources "
    },
    {
        "content": "TORONTO Investment banking and asset management firm Lazard Ltd  said on Wednesday that it had acquired Verus Partners  a boutique Canadian investment bank  to expand its financial advisory business into Canada.",
        "date": "09142016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard acquires boutique Verus to expand into Canadian advisory market "
    },
    {
        "content": "TORONTO  Sept 14 Investment banking and asset management firm Lazard Ltd said on Wednesday that it had acquired Verus Partners  a boutique Canadian investment bank  to expand its financial advisory business into Canada.",
        "date": "09142016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 1-Lazard acquires boutique Verus to expand into Canadian advisory market "
    },
    {
        "content": "TORONTO  Sept 14 Investment banking and asset management firm Lazard Ltd said on Wednesday that it had acquired Verus Partners  a boutique Canadian investment bank  to expand its financial advisory business into Canada.",
        "date": "09142016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard acquires boutique Canadian investment bank Verus Partners "
    },
    {
        "content": "TOKYO  Sept 8 Takata Corp will take initial bids from seven potential rescuers on Sept. 19  as the Japanese air bag maker at the heart of the auto industry's biggest-ever global recall fights for survival  two people with direct knowledge of the process said.",
        "date": "09082016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Japan's Takata to take bids from 7 potential rescuers on Sept. 19 - sources "
    },
    {
        "content": "* Takata hopes to narrow list to two final bidders by mid-Sept",
        "date": "08262016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 1-Takata shortlists Daicel  KKR  Ningbo  others in rescue search -sources "
    },
    {
        "content": "TOKYO  Aug 26 Takata Corp has shortlisted six or seven companies  including a competitor and private-equity funds  as potential financial investors to bail out the Japanese car-parts maker  people involved in the process said.",
        "date": "08262016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Takata shortlists Daicel  KKR  Ningbo  others in rescue search -sources "
    },
    {
        "content": "Lazard Ltd's  quarterly profit beat analysts' estimates as lower costs and higher revenue from advising on restructuring more than offset a slump in M&A fees.",
        "date": "07282016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard profit beats on higher restructuring advisory revenue "
    },
    {
        "content": "* Operating expenses down 70 pct   (Adds details on asset management business  paragraphs 3-8)",
        "date": "07282016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 3-Lazard profit beats on higher restructuring advisory revenue "
    },
    {
        "content": "* Q2 earnings per share view $0.58 -- Thomson Reuters I/B/E/S",
        "date": "07282016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard Q2 adjusted earnings per share $0.61 "
    },
    {
        "content": "July 25 Financial advisory and asset management firm Lazard Ltd appointed Christopher Mulshine managing director in its private capital advisory group  effective immediately.",
        "date": "07252016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-Lazard appoints Christopher Mulshine managing director "
    },
    {
        "content": "July 28 Financial advisory and asset management firm Lazard Ltd's quarterly profit fell 78.5 percent from a year earlier  when the company had an income tax gain of $1.2 billion.",
        "date": "07282016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard's quarterly profit falls 78.5 pct "
    },
    {
        "content": "* Lazard hires christopher mulshine as a managing director in private capital advisory",
        "date": "07252016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard hires Christopher Mulshine as a managing director in private capital advisory "
    },
    {
        "content": "LONDON  July 7 (IFR) - Lazard has hired former European Central Bank board member and senior German politician Jörg Asmussen as a managing director in financial advisory to work with sovereign and corporate clients across Europe.",
        "date": "07072016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-Lazard hires ex-ECB member Asmussen for advisory role "
    },
    {
        "content": "TOKYO  June 9 Investment bank Lazard has sidelined the founding family of  Takata Corp as momentum builds to a market-based solution for the Japanese air bag maker embroiled in the auto industry's biggest safety recall  a person briefed on the process told Reuters.",
        "date": "06102016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "CORRECTED-Lazard in control as momentum builds for Takata solution - source "
    },
    {
        "content": "* Announced expansion of multi asset offerings with launch of Lazard global dynamic multi asset portfolio  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06072016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard Asset Management announces expansion of multi asset offerings "
    },
    {
        "content": "Takata Corp  confirmed on Wednesday it has hired investment bank Lazard Ltd to lead a financial restructuring in an effort to resolve costs stemming from its recall of tens of millions of faulty air bags linked to at least 13 deaths and more than 100 injuries worldwide.",
        "date": "05262016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Takata hires Lazard  seeks cash infusion after air bag deaths "
    },
    {
        "content": "Takata Corp confirmed on Wednesday it has hired investment bank Lazard Ltd to lead a financial restructuring in an effort to resolve costs stemming from its recall of tens of millions of faulty air bags linked to at least 13 deaths and more than 100 injuries worldwide.",
        "date": "05252016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Takata hires Lazard  seeks cash infusion after air bag deaths "
    },
    {
        "content": "May 25 Takata Corp confirmed on Wednesday it has hired investment bank Lazard Ltd to lead a financial restructuring in an effort to resolve costs stemming from its recall of tens of millions of faulty air bags linked to at least 13 deaths and more than 100 injuries worldwide.",
        "date": "05252016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 4-Takata hires Lazard  seeks cash infusion after air bag deaths "
    },
    {
        "content": "May 25 Air bag manufacturer Takata Corp  hired investment bank Lazard to lead efforts to seek new investment and help resolve financial issues stemming from its record-setting recall of tens of millions of inflators that can rupture  sources said Wednesday.",
        "date": "05252016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Takata hires Lazard Ltd as financial advisor to consider restructuring alternatives "
    },
    {
        "content": "* Takata hired Lazard Ltd to craft restructuring plan for dealing with rising liabilities from safety crisis - WSJ  citing sources",
        "date": "05252016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "BRIEF-Takata hires Lazard Ltd to craft restructuring plan for dealing with rising liabilities from safety crisis - WSJ "
    },
    {
        "content": "May 6 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "05062016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Files for potential mixed shelf; size not disclosed - sec filing  Source text - http://1.usa.gov/24kVyMC Further company coverage:",
        "date": "04272016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard files for potential mixed shelf "
    },
    {
        "content": "* Increases quarterly dividend by 9 percent to $0.38 per share",
        "date": "04202016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "BRIEF-Lazard increases quarterly dividend "
    },
    {
        "content": "Financial advisory firm and asset manager Lazard Ltd reported a worse-than-expected 35 percent drop in adjusted quarterly profit as volatile global markets slowed dealmaking.",
        "date": "04212016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard's profit misses expectations as deal activity slows "
    },
    {
        "content": "April 21 Financial advisory firm and asset manager Lazard Ltd reported a worse-than-expected 35 percent drop in adjusted quarterly profit as volatile global markets slowed dealmaking.",
        "date": "04212016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 3-Lazard's profit misses expectations as deal activity slows "
    },
    {
        "content": "April 21 Lazard Ltd's quarterly profit rose 19 percent as the financial advisory firm and asset manager cut operating costs by more than a fifth.",
        "date": "04212016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard quarterly profit jumps 19 pct "
    },
    {
        "content": "NEW YORK  April 7 (IFR) - Boutique advisory firms will lose out on millions of dollars in fees if the US Treasury Department's latest proposed rules on tax-avoiding corporate mergers causes more M&A deals to fall apart.",
        "date": "04072016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "CORRECTED-Inversion rules will hit boutique M&A advisors hardest "
    },
    {
        "content": "LONDON  March 15 (IFR) - Lazard is hiring David Burlison from KPMG as a managing director to lead its London restructuring team  beefing up its European capabilities.",
        "date": "03152016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-KPMG's Burlison moves to Lazard "
    },
    {
        "content": "Feb 24 Investment bank Lazard Ltd has hired former White House official Peter Orszag to help advise companies on mergers.",
        "date": "02242016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Former White House official  Citi banker Orszag joins Lazard "
    },
    {
        "content": "Feb 2 Financial advisory and asset manager Lazard Ltd reported a 28 percent decline in fourth-quarter profit as operating revenue fell.",
        "date": "02022016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard profit falls 28 pct "
    },
    {
        "content": "Feb 5 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "02052016",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "PARIS  Feb 5 Investment funds Sagard and Equistone Partners have mandated investment bank Lazard  to organise the sale of Swiss air treatment and ventilation systems group Flakt Woods  two sources familiar with the situation told Reuters.",
        "date": "02052016",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard mandated for sale of Swiss Flakt Woods -sources "
    },
    {
        "content": "LONDON/NEW YORK/FRANKFURT Investment bank Lazard is working with Sanofi's management to prepare a sale or listing of its Merial animal health unit  aiming to land the leading advisory job for the deal  which could value the business at up 12 billion euros ($12.7 billion)  sources familiar with the matter said.",
        "date": "11272015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Exclusive: Lazard works with Sanofi on $12.7 billion animal health unit deal - sources "
    },
    {
        "content": "Lazard Ltd   a financial advisory and asset management firm  reported a better-than-expected profit and record quarterly operating revenue after advising on several billion-dollar deals. | Video ",
        "date": "10222015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard profit beats forecast after busy quarter for M&A "
    },
    {
        "content": "* 3rd-qtr M&A and other advisory fees rise 19 pct to $288 mln",
        "date": "10222015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 2-Lazard profit beats forecast after busy quarter for M&A "
    },
    {
        "content": "Oct 22 Investment bank and asset manager Lazard Ltd reported a better-than-expected quarterly profit  helped by a rise in M&A advisory fees.",
        "date": "10222015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Asset manager Lazard's profit beats Wall Street view "
    },
    {
        "content": "FRANKFURT  Oct 6 Deutsche Bahn has hired investment bank Lazard to explore options for its Arriva passenger transport business  including a possible stock market listing.",
        "date": "10062015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "UPDATE 1-Deutsche Bahn hires Lazard to look at Arriva options "
    },
    {
        "content": "FRANKFURT  Oct 6 German rail operator Deutsche Bahn has mandated investment bank Lazard to explore options for its Arriva passenger transport business as it seeks to raise money for investments in an increasingly competitive market  two people familiar with the matter said.",
        "date": "10062015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Deutsche Bahn eyes options for Arriva with help of Lazard -sources "
    },
    {
        "content": "Sept 21 Investment bank and asset manager Lazard Ltd said Ngozi Okonjo-Iweala has joined the firm as a senior adviser  with a focus on sovereign advisory.",
        "date": "09212015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-Lazard names Ngozi Okonjo-Iweala as senior adviser "
    },
    {
        "content": "PARIS  Sept 21 Investment bank Lazard has hired Nigeria's former finance minister  Ngozi Okonjo-Iweala  for its business advising governments.",
        "date": "09212015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "MOVES-Lazard hires former Nigerian finance minister "
    },
    {
        "content": "HOUSTON Bankruptcy proceedings over the future of the Hovensa refinery were slated to open in federal court in the U.S. Virgin Islands on Thursday  two days after it filed for protection  saying it owes $1.86 billion to owners Hess Corp  and Venezuela's PDVSA.",
        "date": "09172015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Hovensa faces bankruptcy  owes $1.86 billion to owners "
    },
    {
        "content": "Sept 18 The most significant bankruptcy of the current oil downturn  has shone a spotlight on what is perhaps the most oversupplied corner of the energy world: the market for offshore rig services.",
        "date": "09182015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Samson bankruptcy highlights M&A plans in offshore oil industry "
    },
    {
        "content": "HOUSTON  Sept 17 Bankruptcy proceedings over the future of the Hovensa refinery were slated to open in federal court in the U.S. Virgin Islands on Thursday  two days after it filed for protection  saying it owes $1.86 billion to owners Hess Corp and Venezuela's PDVSA.",
        "date": "09172015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 1-Hovensa faces bankruptcy  owes $1.86 billion to owners "
    },
    {
        "content": "Aug 25 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "08252015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-Lazard  Nomura  Royal London  RBC Global  KBS Realty "
    },
    {
        "content": "Aug 25 Lazard Middle Market  a subsidiary of financial advisory and asset management firm Lazard Ltd  hired Nathan Pund as managing director in its consumer and retail group.",
        "date": "08252015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "MOVES-Lazard unit hires Nathan Pund as managing director "
    },
    {
        "content": "July 30 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "07302015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES- ANZ  Lazard  US Bank  BTIG "
    },
    {
        "content": "July 30 Boutique investment bank Lazard Ltd  has hired investment banker Eric Medow from Citigroup Inc to help lead its tech  media and telecom group  it said in a statement Thursday.",
        "date": "07302015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "MOVES-Lazard hires new telecom banker from Citigroup "
    },
    {
        "content": "Investment bank and asset manager Lazard Ltd  on Thursday reported a quarterly profit that handily beat analysts' estimates as a jump in corporate dealmaking boosted M&A advisory fees.",
        "date": "07232015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard profit beats estimates as M&A advisory fees jump "
    },
    {
        "content": "July 23 Investment bank and asset manager Lazard Ltd on Thursday reported a quarterly profit that handily beat analysts' estimates as a jump in corporate dealmaking boosted M&A advisory fees.",
        "date": "07232015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 4-Lazard profit beats estimates as M&A advisory fees jump "
    },
    {
        "content": "July 23 Investment bank and asset manager Lazard Ltd on Thursday reported a quarterly profit that handily beat analysts' estimates as a jump in corporate dealmaking boosted M&A advisory fees.",
        "date": "07232015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 3-Lazard profit beats estimates as M&A advisory fees jump "
    },
    {
        "content": "July 23 Investment bank and asset manager Lazard Ltd reported a 53 percent rise in quarterly adjusted profit as a jump in corporate dealmaking boosted M&A advisory fees.",
        "date": "07232015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard adjusted profit jumps 53 pct "
    },
    {
        "content": "MILAN  July 14 Barclays has hired Lazard to sell its retail banking business in Italy as the British bank presses ahead with the sale of European assets  a source with knowledge of the matter said on Tuesday.",
        "date": "07142015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Barclays hires Lazard to sell Italy branches -source "
    },
    {
        "content": "MILAN  June 9 Italian cooperative bank Banca Popolare di Milano has hired Citi and Lazard to advise it on the planned transformation into joint-stock company and merger options  it said on Tuesday.",
        "date": "06092015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Italy's Pop Milano hires Citi  Lazard as M&A advisers "
    },
    {
        "content": "Payment processing company Worldpay has hired investment bank Lazard as an adviser to prepare for a floatation in London  Sky News reported on Tuesday.",
        "date": "05122015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Worldpay hires Lazard for likely floatation: Sky News "
    },
    {
        "content": "May 12 Payment processing company Worldpay has hired investment bank Lazard as an adviser to prepare for a floatation in London  Sky News reported on Tuesday.",
        "date": "05122015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Worldpay hires Lazard for likely floatation - Sky News "
    },
    {
        "content": "MADRID  May 8 Spanish builder Sacyr  has hired investment bank Lazard as an adviser in the possible sale of a 30 percent stake in its listed real estate unit Testa  a source with knowledge of the matter said on Friday.",
        "date": "05082015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "UPDATE 1-Spain's Sacyr hires Lazard for possible sale of real estate stake -source "
    },
    {
        "content": "Investment bank and asset manager Lazard Ltd  reported a better-than-expected quarterly profit as a jump in corporate dealmaking boosted its M&A advisory fees.",
        "date": "04232015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Lazard profit beats estimates on higher M&A advisory fees "
    },
    {
        "content": "April 23 Investment bank and asset manager Lazard Ltd reported a better-than-expected quarterly profit as a jump in corporate dealmaking boosted its M&A advisory fees.",
        "date": "04232015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "REFILE-UPDATE 2-Lazard profit beats estimates on higher M&A advisory fees "
    },
    {
        "content": "Thomson Reuters April 21  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04212015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "April 9 Investment bank Perella Weinberg said telecom banker George Young III from Lazard would join the company as a partner  according to an internal memo reviewed by Reuters.",
        "date": "04102015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-Investment bank Perella Weinberg to hire George Young from Lazard "
    },
    {
        "content": "March 3 Lazard Ltd appointed Alberto Weisser  former head of agricultural trading house Bunge Ltd   as a senior adviser for the agriculture  commodities and related sectors.",
        "date": "03032015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "MOVES-Lazard appoints former Bunge CEO Alberto Weisser as senior advisor "
    },
    {
        "content": "LONDON/PARIS Lazard banker Vincent Le Stradic recently took a break from his job advising Europe's top telecoms companies on deals to help little-known French start-up Sigfox raise 100 million euros.",
        "date": "02252015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "No deal too small for Lazard’s $500 billion banker "
    },
    {
        "content": "ATHENS  Feb 13 Greece's Finance Ministry said on Friday the investment group Lazard is working with Greece on a pro bono basis.",
        "date": "02132015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Greek finance ministry says Lazard is working with it \"free of charge\" "
    },
    {
        "content": "PARIS Matthieu Pigasse  head of investment bank Lazard in Paris which is advising the Greek government on its debt restructuring  said on Tuesday the troika imposing austerity on Greece was totally mistaken and had driven the country's economy into a wall.",
        "date": "02102015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "Pigasse  head of Lazard Paris  says troika 'all wrong' on Greece "
    },
    {
        "content": "PARIS  Feb 10 Matthieu Pigasse  head of investment bank Lazard in Paris which is advising the Greek government on its debt restructuring  said on Tuesday the troika imposing austerity on Greece was totally mistaken and had driven the country's economy into a wall.",
        "date": "02102015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "CORRECTED-Pigasse  head of Lazard Paris  says troika \"all wrong\" on Greece "
    },
    {
        "content": "LONDON  Feb 5 Soon after politicians from the far-left Syriza party won power in Greece they said they had hired Lazard to advise them on restructuring their debt.",
        "date": "02062015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "RPT-Greek radicals play it safe with debt advisers Lazard "
    },
    {
        "content": "LONDON  Feb 5 Soon after politicians from the far-left Syriza party won power in Greece they said they had hired Lazard to advise them on restructuring their debt.",
        "date": "02052015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Greek radicals play it safe with debt advisers Lazard "
    },
    {
        "content": "Investment bank and asset manager Lazard Ltd  reported a better-than-expected quarterly profit as a jump in corporate dealmaking boosted M&A advisory fees.",
        "date": "02052015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard profit beats estimates on higher advisory fees "
    },
    {
        "content": "Feb 5 Investment bank and asset manager Lazard Ltd reported a better-than-expected quarterly profit as a jump in corporate dealmaking boosted M&A advisory fees.",
        "date": "02052015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 1-Lazard profit beats estimates on higher advisory fees "
    },
    {
        "content": "Feb 5 Investment bank and asset manager Lazard Ltd reported a 57 percent rise in adjusted quarterly profit due to a jump in advisory fees from higher M&A activity.",
        "date": "02052015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Lazard adjusted profit rises 57 pct on higher advisory fees "
    },
    {
        "content": "LONDON  Jan 28 (IFR) - Ukraine has hired Lazard to advise on talks with bondholders about a possible restructuring of its debt  sources close to the situation said on Wednesday.",
        "date": "01282015",
        "name": "Lazard Ltd",
        "news_type": "topStory",
        "symbol": "LAZ",
        "title": "UPDATE 1-Ukraine appoints Lazard as restructuring adviser - sources "
    },
    {
        "content": "LONDON  Jan 28 (IFR) - Ukraine has hired Lazard to advise on talks with bondholders about a possible restructuring of its debt  sources close to the situation said on Wednesday.",
        "date": "01282015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "Ukraine appoints Lazard as restructuring adviser - sources "
    },
    {
        "content": "WASHINGTON  Jan 12 Antonio Weiss  an investment banker who was a controversial nominee for a top post at the U.S. Treasury Department  has decided to withdraw from consideration  the White House said on Monday.",
        "date": "01132015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 2-U.S. Treasury nominee Weiss withdraws from consideration-White House "
    },
    {
        "content": "WASHINGTON Antonio Weiss  an investment banker who was a controversial nominee for a top post at the U.S. Treasury Department  has decided to withdraw from consideration  the White House said on Monday.",
        "date": "01122015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "U.S. Treasury nominee Weiss withdraws from consideration: White House "
    },
    {
        "content": "WASHINGTON  Jan 12 Antonio Weiss  an investment banker who was a controversial nominee for a top post at the U.S. Treasury Department  has decided to withdraw from consideration  the White House said on Monday.",
        "date": "01122015",
        "name": "Lazard Ltd",
        "news_type": "normal",
        "symbol": "LAZ",
        "title": "UPDATE 1-U.S. Treasury nominee Weiss withdraws from consideration-White House "
    }
]