[
    {
        "content": "LONDON  Nov 15 The London-based Formula E electric car racing series will leave Britain if Brexit goes ahead without a deal on tax and employment  Spanish chief executive Alejandro Agag said on Wednesday.",
        "date": "11152017",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Motor racing-Formula E will leave Britain if no Brexit deal  says CEO "
    },
    {
        "content": "* Shares rise over 5 percent to three-month high (Adds more comments from CEO on convergence  Liberty Global)",
        "date": "11142017",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 3-Vodafone lifts profit view as customers ditch wifi for mobile "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Vodafone is figuring out how to go it alone. The 58 billion pound mobile operator and cable group Liberty Global ended talks over a tie-up in 2015. The possibility of a deal hasn’t gone away. But an improving outlook and fibre-broadband growth plans in Germany and Britain make a combination with John Malone’s group – or anyone else – less urgent.",
        "date": "11142017",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Breakingviews - Vodafone is doing just fine without Liberty "
    },
    {
        "content": "* Liberty Global - ‍Balan Nair to become president  CEO of entity formed from splitting off of co's Latin American and Caribbean businesses  ​",
        "date": "11032017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-‍Balan Nair to become CEO of Liberty Global's spun off L. American and Caribbean businesses  ​ "
    },
    {
        "content": "* Lilac appoints new CEO; split-off on track for year-end 2017​",
        "date": "11012017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global reports Q3 2017 results "
    },
    {
        "content": "* Liberty Global appoints new CEO for Latin American & Caribbean operation",
        "date": "10302017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global appoints new CEO for Latin American & Caribbean operation "
    },
    {
        "content": "* Tivo- Multi-year extension to their IP license provides Liberty Global with expanded access to co's patent portfolios covers all liberty global units​ Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Tivo renews product and IP agreements with Liberty Global "
    },
    {
        "content": "* Liberty Global provides update on the impact of hurricanes in the Caribbean",
        "date": "10062017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global provides update on the impact of hurricanes in the Caribbean "
    },
    {
        "content": "LONDON  Sept 22 Kazakhstan-focused copper miner Central Asia Metals said it would buy Bermuda-based Lynx Resources Ltd in a $402.5 million reverse-takeover deal from its owners.",
        "date": "09222017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "UPDATE 1-Central Asia Metals to buy Lynx Resources for $402.5 mln "
    },
    {
        "content": "Kazakhstan-focused copper miner Central Asia Metals  said it would buy Bermuda-based Lynx Resources Ltd in a $402.5 million reverse-takeover deal from its owners.",
        "date": "09222017",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Central Asia Metals to buy Lynx Resources for $402.5 million "
    },
    {
        "content": "Sept 22 Kazakhstan-focused copper miner Central Asia Metals said it would buy Bermuda-based Lynx Resources Ltd in a $402.5 million reverse-takeover deal from its owners.",
        "date": "09222017",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Central Asia Metals to buy Lynx Resources for $402.5 mln "
    },
    {
        "content": "FRANKFURT Liberty Global  aims to catch up on German broadband customer growth in the second half of the year after its technicians work off a backlog of helping customers switch to digital from analogue television  its Germany chief said.",
        "date": "08082017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global Germany chief sees second-half recovery after analogue switch-off "
    },
    {
        "content": "* Liberty Global Plc - ‍Lilac Group spin-off remains on track for year-end 2017​",
        "date": "08072017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global reports Q2 and H1 2017 results "
    },
    {
        "content": "* TPG Growth and Liberty Global launch independent television studio  platform one media",
        "date": "07172017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-TPG Growth and Liberty Global launch independent television studio  Platform One Media "
    },
    {
        "content": "* Liberty Global - on june 21  its unit facility aq borrower entered into an additional facility accession agreement",
        "date": "06272017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global says its unit facility AQ borrower entered into an additional facility accession agreement "
    },
    {
        "content": "* Liberty Global Plc - on May 23  Sable International Finance And Coral-US Co-Borrower Llc entered into the financing arrangements‍​ ‍​",
        "date": "06022017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global Plc  Sable International Finance and Coral-US Co-Borrower Llc entered into the financing arrangements‍​ ‍​ "
    },
    {
        "content": "* Liberty Global - Telenet Financing USD entered into financing by way of additional facility drawn under credit agreement originally dated August 1  2007",
        "date": "05192017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global says Telenet Financing USD entered into financing by way of additional facility drawn under credit agreement originally dated Aug 1  2007 "
    },
    {
        "content": "LONDON  May 11 Liberty Global's John Malone says he is open to doing separate deals with Vodafone and British broadcaster ITV  but has yet to make the valuations work.",
        "date": "05112017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty's interest in Vodafone  ITV thwarted by valuations -Malone "
    },
    {
        "content": "* Q1 revenue view $3.52 billion -- Thomson Reuters I/B/E/S Source text for Eikon: Further company coverage:",
        "date": "05072017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global reports first quarter 2017 results "
    },
    {
        "content": "* Liberty global plc- ceo michael t. Fries 2016 total compensation was $40.1 million versus $27.7 million in 2015 - sec filing",
        "date": "05012017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global says CEO Michael Fries 2016 total compensation was $40.1 mln versus $27.7 mln in 2015 - Sec Filing "
    },
    {
        "content": "* Liberty Global CEO Fries says 2020 is a \"too aggressive\" target for the deployment of 5G wireless technology",
        "date": "02282017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global CEO says 2020 target for 5G too aggressive "
    },
    {
        "content": "* Third Point Llc dissolves share stake in Allergan Plc - SEC Filing",
        "date": "02102017",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Third Point LLC takes share stake in JPMorgan  Bank of America - SEC Filing "
    },
    {
        "content": "DAVOS  Switzerland  Jan 18 International cable TV group Liberty Global's joint venture with Vodafone  in the Netherlands has started well but is not a blueprint for deals in other European markets where both are present  its CEO said on Wednesday.",
        "date": "01182017",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global says Vodafone joint venture is not a deal blueprint "
    },
    {
        "content": "* Telenet International Finance  existing security providers entered into a EUR400.0 million additional facility accession agreement",
        "date": "11292016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global says Telenet International Finance  existing security providers entered into agreement "
    },
    {
        "content": "* On Nov 18  two units of co entered into a joinder agreement in respect of credit agreement dated May 16  2016 - sec filing",
        "date": "11232016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global- Two units entered into a joinder agreement in respect of credit agreement dated May 16 "
    },
    {
        "content": "BARCELONA Liberty Global's chief executive said the cable group's joint venture with mobile operator Vodafone in the Netherlands did not signal more deals between the two companies in Europe.",
        "date": "11172016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty says Vodafone Dutch joint venture 'probably not' a template for more deals "
    },
    {
        "content": "BARCELONA Vodafone  said regulators could look favorably on any wider tie-up between the mobile telecoms giant and cable company Liberty Global  in Europe because it would counterbalance the power of former incumbents in Germany  Italy and Britain.",
        "date": "11172016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone says regulators might welcome any new Liberty deal "
    },
    {
        "content": "BARCELONA  Nov 17 Liberty Global's  chief executive said the cable group's joint venture with mobile operator Vodafone in the Netherlands did not signal more deals between the two companies in Europe.",
        "date": "11172016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 1-Liberty says Vodafone Dutch JV 'probably not' a template for more deals "
    },
    {
        "content": "BARCELONA  Nov 16 Vodafone said regulators could look favourably on any wider tie-up between the mobile telecoms giant and cable company Liberty Global  in Europe because it would counterbalance the power of former incumbents in Germany  Italy and Britain.",
        "date": "11172016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "REFILE-Vodafone says regulators might welcome any new Liberty deal "
    },
    {
        "content": "* Liberty global- Its Liberty Global Latin America & Caribbean Group (LiLAC Group) to launch $300 million stock repurchase program for LiLAC ordinary shares",
        "date": "11072016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global's LiLAC to launch $300 mln share buyback program "
    },
    {
        "content": "* Qtrly revenue attributed to Liberty Global Group increased 1% to $4.3 billion",
        "date": "11032016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global qtrly revenue increased 1 pct to $4.3 bln "
    },
    {
        "content": "Oct 18 Telecommunications company Liberty Global Plc said its unit  UPC Poland  has entered into a definitive agreement to buy the cable business of Multimedia Polska SA for an enterprise value of 3 billion zlotys ($763.5 million).",
        "date": "10182016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global unit to buy Multimedia Polska's cable business "
    },
    {
        "content": "* Says deal for enterprise value of pln 3.0 billion (about $760 million)",
        "date": "10182016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global to acquire Multimedia Polska "
    },
    {
        "content": "Telecommunications company Liberty Global Plc said its unit  UPC Poland  has agreed to buy the cable business of Multimedia Polska SA [MULPO.UL] for an enterprise value of 3 billion zlotys ($763.5 million).",
        "date": "10192016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global signs deal to expand cable business in Poland "
    },
    {
        "content": "Oct 18 Telecommunications company Liberty Global Plc said its unit  UPC Poland  has agreed to buy the cable business of Multimedia Polska SA for an enterprise value of 3 billion zlotys ($763.5 million).",
        "date": "10192016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 2-Liberty Global signs deal to expand cable business in Poland "
    },
    {
        "content": "* Says partners with Liberty Global Partners to expand DVR (Digital Video Recording) services in Latin America",
        "date": "09262016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Ericsson says enters DVR partnership in Latin America "
    },
    {
        "content": "AMSTERDAM  Sept 14 Liberty Global  the international telecommunications company controlled by American tycoon John Malone  said on Wednesday it has struck a deal to offer Netflix to all its customers directly via cable set top boxes.",
        "date": "09142016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global to offer Netflix to all customers "
    },
    {
        "content": "* Revealed multi-year partnership with Netflix Inc; Netflix content to be made available to Liberty Global video customers  Source text for Eikon:  Further company coverage:",
        "date": "09142016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global revealed multi-year partnership with Netflix "
    },
    {
        "content": "* On Aug 16 Ziggo secured finance and Bank Of Nova Scotia as facility agent entered into eur 2 589.2 million dditional facility accession deed",
        "date": "08222016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global- Ziggo secures finance and Bank Of Nova Scotia as facility agent enters into Eur 2 589.2 mln additional facility accession deed "
    },
    {
        "content": "Aug 25 Liberty Global Plc * Announces changes within finance organization * Bernie Dvorak to retire as co-CFO * Charlie bracken to assume sole CFO position Source text for Eikon: Further company coverage: ",
        "date": "08252016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global says Bernie Dvorak to retire as co-CFO "
    },
    {
        "content": "* Genesis Asset Managers LLP reports 13.42 percent passive stake in Liberty Global Plc as of July 31  2016 - SEC filing  Source text (http://bit.ly/2akRwld) Further company coverage:",
        "date": "08042016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Genesis Asset Managers LLP reports 13.42 pct passive stake in Liberty Global - SEC filing "
    },
    {
        "content": "* Liberty Global and All3media have agreed a major multi-territorial original programming partnership  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08022016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global and All3media have agreed a multi-territorial original programming partnership "
    },
    {
        "content": "BRUSSELS  Aug 3 The European Commission has authorised on Wednesday a joint venture in the Netherlands between British telecoms firm Vodafone and U.S. cable operator Liberty Global in exchange for concessions.",
        "date": "08032016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global  Vodafone win EU conditional approval for Dutch tie-up "
    },
    {
        "content": "* Liberty Global and Discovery Communications renew long-term  comprehensive distribution partnership",
        "date": "08022016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "BRIEF-Discovery Communications and Liberty Global renew distribution partnership "
    },
    {
        "content": "BRUSSELS  Aug 3 The European Commission authorised a joint venture in the Netherlands between British telecoms firm Vodafone Group Plc and U.S. cable operator Liberty Global Plc in exchange for concessions.",
        "date": "08032016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 1-Liberty Global  Vodafone win EU conditional approval for Dutch tie-up "
    },
    {
        "content": "BRUSSELS  Aug 2 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08022016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Aug 2) "
    },
    {
        "content": "* Having already received a number of expressions of interest  parties will now proceed with sale process",
        "date": "08032016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "BRIEF-Vodafone says European Commmission clears Liberty Global deal "
    },
    {
        "content": "BRUSSELS U.S. cable group Liberty Global and UK telecoms firm Vodafone are set to win EU antitrust approval for their plan to merge their Dutch operations after offering minor concessions  two people familiar with the matter said on Friday.",
        "date": "07292016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Exclusive: Liberty Global  Vodafone to win EU approval for Dutch tie-up - sources "
    },
    {
        "content": "BRUSSELS  July 29 U.S. cable group Liberty Global and UK telecoms firm Vodafone are set to win EU antitrust approval for their plan to merge their Dutch operations after offering minor concessions  two people familiar with the matter said on Friday.",
        "date": "07292016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EXCLUSIVE-Liberty Global  Vodafone to win EU approval for Dutch tie-up - sources "
    },
    {
        "content": "LONDON  July 22 Vodafone's planned listing of its Indian business could help the British group if it pursues any further tie-ups with cable-TV company Liberty Global in Europe  its chief executive said on Friday.",
        "date": "07222016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone chief says India listing could help with any future Liberty tie-up "
    },
    {
        "content": "* Vodafone Group and Liberty Global announce intention to appoint two senior executives for their proposed Netherlands joint venture  Source text for Eikon:  Further company coverage:",
        "date": "07192016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global Vodafone Group says intend to appoint 2 executives for Netherlands joint venture "
    },
    {
        "content": "July 19 Wall Street securities analysts revised their ratings and price targets on several U.S.-listed companies  including Michaels Companies  Tesoro and Star Bulk Carriers  on Tuesday.           HIGHLIGHTS      * Hyatt Hotels Corp      : Stifel cuts to hold from buy        * Yahoo! Inc         : Pivotal Research cuts to hold from buy        * Chipotle Mexican Grill        : CLSA raises to outperform from underperform        * Schlumberger        : SocGen raises to buy from hold    ",
        "date": "07192016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "U.S. RESEARCH ROUNDUP-Netflix  Schlumberger  Hyatt Hotels "
    },
    {
        "content": "July 19 Vodafone UK's chief executive will head the company's Dutch telecoms joint venture with Liberty Global  the two companies said on Tuesday.",
        "date": "07192016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone  Liberty Global name CEO  CFO for Dutch venture "
    },
    {
        "content": "July 11 ITV Plc  Britain's biggest free-to-air commercial broadcaster  said on Monday it had agreed to sell UTV Ireland to Virgin Media  a company owned by Liberty Global Plc  for an undisclosed amount.",
        "date": "07112016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "ITV agrees to sell UTV Ireland to Virgin Media "
    },
    {
        "content": "AMSTERDAM  July 6 The Dutch markets regulator on Wednesday asked for EU permission to conduct an antitrust review of a proposed merger between Liberty Global's Dutch cable company Ziggo and Vodafone's Dutch operations.",
        "date": "07062016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Dutch regulator asks EU if it can oversee Ziggo-Vodafone merger review "
    },
    {
        "content": "LONDON  June 17 British companies are preparing for the possibility that the country will vote to leave the European Union with extra funds  pre-written statements and plans for late-night vigils by teams of consultants.",
        "date": "06172016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "British companies prepare for long night to possible Brexit "
    },
    {
        "content": "BRUSSELS  June 15 - European Union antitrust regulators will rule by July 19 whether to clear a plan by British mobile operator Vodafone and U.S. cable company Liberty Global  to merge their Dutch operations.",
        "date": "06152016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU to decide on Vodafone  Liberty Global's Dutch deal by July 19 "
    },
    {
        "content": "WARSAW  June 10 Liberty Global  which owns Poland's largest cable operator UPC  is close to agreeing a takeover of UPC's local rival Multimedia in a deal that would create a business covering half of the Polish cable market  Puls Biznesu newspaper  reported.",
        "date": "06102016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global close to buying Polish cable operator Multimedia -newspaper "
    },
    {
        "content": "* Approved distribution of 117.4 million Lilac Group ordinary shares that represent inter-group interest to liberty global group shareholders",
        "date": "06072016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty approves distribution of 117.4 mln Lilac Group shares "
    },
    {
        "content": "* $5 billion distribution to take place at close of trading on July 1  2016",
        "date": "06022016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global announces distribution of Lilac Group shares to Liberty Global Group shareholders "
    },
    {
        "content": "* Capex to fall  not as much as expected as investment continues",
        "date": "05172016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 3-Vodafone returns to profit growth with pick-up in Europe "
    },
    {
        "content": "LONDON  May 10 Liberty Global said it would consider buying Telefonica's O2 in Britain if Brussels blocks Hutchison buying the mobile network  but it valued the flexibility of its current mobile strategy based on a virtual network.",
        "date": "05102016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global says would look at Telefonica's O2 "
    },
    {
        "content": "* All full-year 2016 guidance targets confirmed for LBTY and LILAC",
        "date": "05092016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global reports Q1 revenue $4.6 billion "
    },
    {
        "content": "* Boston Partners reports 11 percent passive stake in Liberty Global PLC as of April 30  2016  Source - http://1.usa.gov/1SYPhlS Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "05092016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "BRIEF-Boston Partners reports 11 percent passive stake in Liberty Global PLC "
    },
    {
        "content": "LONDON  May 3 Metals group Liberty House will submit a letter of intent to buy the British assets of Tata Steel on Tuesday  a spokeswoman said  in the first concrete bid since the Indian conglomerate put the business up for sale  threatening thousands of jobs.",
        "date": "05032016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty House to submit bid for Tata Steel UK on Tuesday "
    },
    {
        "content": "* Ceo Michael T. Fries' 2015 total comepnsation was $27.7 million versus $112.2 million in 2014 - SEC filing",
        "date": "04292016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global PLC - CEO's 2015 total comepnsation was $27.7 mln "
    },
    {
        "content": "* Liberty Global receives shareholder approval for acquisition of Cable & Wireless Communications PLC",
        "date": "04202016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Liberty Global receives shareholder approval for acquisition of Cable & Wireless Communications PLC "
    },
    {
        "content": "BARCELONA  Feb 22 The chief executive of Vodafone underlined the benefits of the company's plan to work with Liberty Global in the Netherlands  an arrangement being closely watched by analysts and investors who hope the two firms will one day reach a wider deal.",
        "date": "02222016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone CEO talks up benefits of going Dutch with Liberty "
    },
    {
        "content": "Feb 15 UK phone network operator Vodafone Plc  and John Malone's cable company Liberty Global Plc  agreed on Monday to combine their operations in the Netherlands by creating a joint venture.",
        "date": "02162016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Vodafone  Liberty agree on Dutch joint venture "
    },
    {
        "content": "* Banks under pressure as JP Morgan suggest not to buy   (Adds details  updates prices)",
        "date": "02162016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "European shares fall after oil output deal disappoints "
    },
    {
        "content": "AMSTERDAM/LONDON Mobile telecoms network operator Vodafone  and cable company Liberty Global  have agreed to combine their Dutch operations to create a stronger package of TV  broadband Internet and mobile  aiming to better take on former incumbent KPN .",
        "date": "02162016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone ties up with Liberty in Dutch deal to take on KPN "
    },
    {
        "content": "LONDON/MILAN  Feb 16 European shares edged lower on Tuesday  with banking stocks again under pressure after a short rebound  while oil companies came off earlier highs on disappointment over a deal to tackle a global supply glut.",
        "date": "02162016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "European shares edge lower as bank stocks fall; oils off highs "
    },
    {
        "content": "* FTSEurofirst 300 steady after 6 pct rise in last 2 sessions",
        "date": "02162016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "European shares steady as oil companies rise "
    },
    {
        "content": "LONDON  Feb 16 European stock markets rose on Tuesday  helped by stronger energy stocks which gained ground as oil prices surged on the possibility of output cuts.",
        "date": "02162016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "European shares rise as energy and mining stocks climb "
    },
    {
        "content": "Feb 16 Britain's FTSE 100 index is seen to open up by 24-26 points  or 0.4-0.5 percent  on Tuesday  according to financial bookmakers. Futures were up 0.5 percent at 0746 GMT. For more on the factors affecting European stocks  please click on",
        "date": "02162016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Feb. 16 "
    },
    {
        "content": "Feb 16 Britain's FTSE 100 index is seen to open up by 24-26 points  or 0.4-0.5 percent  on Tuesday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue-chip index closed up 116.68 points  or 2 percent  at 5 825.17 on Monday  extending its recovery from three-year lows hit last week  helped by a surge in consumer goods group Reckitt Benckiser.      * VODAFONE: UK phone network operator Vodafone and John Malone's",
        "date": "02162016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UK Stocks-Factors to watch on Feb. 16 "
    },
    {
        "content": "BRUSSELS  Feb 4 The European Commission on Friday cleared the acquisition of the Belgian mobile unit of Dutch telecoms group KPN by U.S. cable investor Liberty Global subject to conditions.",
        "date": "02042016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "EU clears Liberty buy of KPN's Belgian unit "
    },
    {
        "content": "LONDON  Feb 2 Mobile phone operator Vodafone  said on Tuesday it was in talks with John Malone's cable company Liberty Global about forming a joint venture in the Netherlands.",
        "date": "02022016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "CORRECTED-Vodafone in talks with Liberty Global on Dutch joint venture "
    },
    {
        "content": "Feb 4 Vodafone CEO says on conference call with reporters:",
        "date": "02042016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "BRIEF-Vodafone declines to comment further on Liberty Global talks "
    },
    {
        "content": "BRUSSELS  Feb 2 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02022016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Feb 2) "
    },
    {
        "content": "* \u007fConfirms it is in discussions with Liberty Global Plc regarding creation of a joint ventur\u007fe",
        "date": "02022016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "BRIEF-Vodafone confirms in talks with Liberty Global about Netherlands JV "
    },
    {
        "content": "JOHANNESBURG  Jan 29 South Africa's Liberty Holdings has bought a controlling stake in a short-term insurer in Uganda for an undisclosed sum  pursuing its strategy of expanding on the African continent.",
        "date": "01292016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "South Africa's Liberty buys control of Ugandan short-term insurer "
    },
    {
        "content": "Jan 22 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "01222016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "PRESS DIGEST- British Business - Jan 22 "
    },
    {
        "content": "BRUSSELS  Jan 20 EU antitrust regulators are set to approve Liberty Global's 1.3-billion-euro ($1.42 billion) offer for KPN's Belgian unit after the U.S. cable group agreed to divest assets to boost a rival  two people familiar with the matter said on Wednesday.",
        "date": "01202016",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "EU regulators to OK 1.3-bln-euro Liberty Global  KPN deal -sources "
    },
    {
        "content": "BRUSSELS  Jan 15 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01152016",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Jan 15) "
    },
    {
        "content": "BRUSSELS  Dec 3 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "12032015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Dec 3) "
    },
    {
        "content": "Nov 17 The following bids  mergers  acquisitions and disposals were reported by 1100 GMT on Tuesday:",
        "date": "11172015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "John Malone-backed Liberty Global Plc offered to buy Cable & Wireless Communications Plc for 3.6 billion pounds ($5.5 billion) to extend its reach in the Caribbean.",
        "date": "11162015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global expands in Caribbean with Cable & Wireless buy "
    },
    {
        "content": "* Offer of 78.04 pence per share   (Adds analyst comment  details  background  updates shares)",
        "date": "11162015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 3-Liberty Global expands in Caribbean with Cable & Wireless buy "
    },
    {
        "content": "Nov 16 John Malone-backed Liberty Global Plc  said it would buy Cable & Wireless Communications Plc  in a stock deal valued at about 3.6 billion pounds ($5.5 billion).",
        "date": "11162015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global to buy Cable & Wireless Communications "
    },
    {
        "content": "BRUSSELS  Nov 13 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "11132015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Nov 13) "
    },
    {
        "content": "* Announce that they have reached agreement regarding terms of a recommended acquisition",
        "date": "11162015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "BRIEF-Cable & Wireless says Liberty Global to acquire co in 3.6 bln stg deal "
    },
    {
        "content": "BRUSSELS  Nov 16 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "11162015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Nov 16) "
    },
    {
        "content": "BRUSSELS  Nov 3 - European Union competition authorities have extended their investigation of U.S. cable operator Liberty Global's 1.3-billion-euro ($1.43 billion) bid for KPN's Belgian unit to March 17  the European Commission said on Tuesday.",
        "date": "11032015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "EU regulators extend Liberty Global  KPN deal probe to March 17 "
    },
    {
        "content": "BRUSSELS  Oct 28 - U.S. cable operator Liberty Global  has offered fresh concessions in a bid to win over European Union antitrust regulators concerned about the competition impact of its proposed takeover of KPN's  Belgian unit.",
        "date": "10282015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global offers fresh EU concessions over KPN Belgian deal "
    },
    {
        "content": "Liberty Global Plc  is in talks with Cable & Wireless Communications Plc  about a potential deal to unite two companies backed by billionaire cable pioneer John Malone and extend Liberty's reach in the Caribbean.",
        "date": "10222015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global in talks to buy Cable & Wireless "
    },
    {
        "content": "* Cable & Wireless says discussing possible cash-and-stock offer",
        "date": "10222015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 3-Liberty Global in talks to buy Cable & Wireless "
    },
    {
        "content": "Oct 22 Telecoms group Cable & Wireless Communications Plc said it was in talks with Liberty Global Plc about a possible cash-and-share offer for the company.",
        "date": "10222015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Cable & Wireless Communications in talks with Liberty Global "
    },
    {
        "content": "* Confirms that CWC is in discussions with Liberty Global Plc regarding a possible shares and cash offer for co",
        "date": "10222015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "BRIEF-Cable & Wireless Comms says in deal talks with Liberty Global "
    },
    {
        "content": "BRUSSELS  Oct 22 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10222015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Oct 22) "
    },
    {
        "content": "BRUSSELS  Oct 7 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10072015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Oct 7) "
    },
    {
        "content": "BRUSSELS  Oct 7 - European Union antitrust regulators have extended their investigation into U.S. cable company Liberty Global's  bid for Dutch peer KPN's Belgian unit to March 3.",
        "date": "10072015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU regulators extend Liberty Global  KPN deal probe to March 3 "
    },
    {
        "content": "BRUSSELS  Oct 5 European Union antitrust regulators opened a full-scale investigation on Monday into U.S. cable company Liberty Global's  bid for Dutch peer KPN's Belgian unit  concerned that the deal may lead to higher prices.",
        "date": "10052015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "EU antitrust regulators to probe deeper into Liberty Global  KPN deal "
    },
    {
        "content": "LONDON  Sept 28 Vodafone and Liberty Global have abandoned  talks about a swap of business assets in Europe's converging mobile phone  broadband and TV markets  they said on Monday  having failed to agree on valuations.",
        "date": "09282015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "REFILE-UPDATE 3-Vodafone and Liberty Global end European tie-up talks "
    },
    {
        "content": "LONDON  Sept 28 European shares dipped lower on Monday  although Vodafone lagged after ending talks with Liberty Global and carmaker Volkswagen  which has been hit by an emissions data scandal  also declined.",
        "date": "09282015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "European shares dip as VW and Vodafone lose ground "
    },
    {
        "content": "LONDON Talks between Vodafone and Liberty Global collapsed because the two companies could not agree on the valuation of assets on either side  but the door has not closed on potential future discussions  according to a person close to the talks.",
        "date": "09282015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone  Liberty talks broke down on asset values: source "
    },
    {
        "content": "LONDON  Sept 28 European shares slipped on Monday  with Vodafone lagging after ending talks with Liberty Global while Spanish shares tracked other markets after separatists won a majority of seats in an election in Catalonia.",
        "date": "09282015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "European shares slip  Vodafone lags "
    },
    {
        "content": "LONDON  Sept 28 Talks between Vodafone  and Liberty Global collapsed because the two companies could not agree on the valuation of assets on either side  but the door has not closed on potential future discussions  according to a person close to the talks.",
        "date": "09282015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone  Liberty talks broke down on asset values-source "
    },
    {
        "content": "LONDON  Sept 28 Vodafone  the world's second largest mobile operator  said on Monday it had ended talks with Liberty Global about an exchange of assets.",
        "date": "09282015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone says Liberty Global tie-up talks ended "
    },
    {
        "content": "* Discussions with Liberty Global have terminated  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "09282015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "BRIEF-Vodafone Group says talks with Liberty Global have ended "
    },
    {
        "content": "LONDON Cable operator Liberty Global  and mobile phone group Vodafone  have not worked out how to progress with an exchange of assets  months after they said they were in talks  Liberty's Chairman John Malone told Bloomberg.",
        "date": "09152015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty's Malone says no progress on Vodafone deal: Bloomberg "
    },
    {
        "content": "LONDON  Sept 15 Cable operator Liberty Global  and mobile phone group Vodafone have not worked out how to progress with an exchange of assets  months after they said they were in talks  Liberty's Chairman John Malone told Bloomberg.",
        "date": "09152015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty's Malone says no progress on Vodafone deal -Bloomberg "
    },
    {
        "content": "BRUSSELS  Sept 15 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09152015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Sept 15) "
    },
    {
        "content": "BRUSSELS U.S. cable company Liberty Global  has offered concessions in a bid to secure European Union antitrust approval for its 1.33 billion euro ($1.5 billion) offer for KPN's Belgian mobile operator  the European Commission said on Tuesday.",
        "date": "09152015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global offers EU concessions over $1.5 billion Belgian buy "
    },
    {
        "content": "BRUSSELS  Sept 15 U.S. cable company Liberty Global has offered concessions in a bid to secure European Union antitrust approval for its 1.33 billion euro ($1.5 billion) offer for KPN's Belgian mobile operator  the European Commission said on Tuesday.",
        "date": "09152015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global offers EU concessions over $1.5 bln Belgian buy "
    },
    {
        "content": "BRUSSELS  Sept 1 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09022015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "CORRECTED-EU mergers and takeovers (Sept 1) "
    },
    {
        "content": "AMSTERDAM  Aug 27 There was no timeframe for talks between telecommunications group Liberty Global  and rival Vodafone on swapping assets from the two global companies' portfolios  the former's chief executive officer said on Thursday.",
        "date": "08272015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global CEO: no timeframe on talks with Vodafone "
    },
    {
        "content": "BRUSSELS  Aug 18 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08182015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Aug 18) "
    },
    {
        "content": "LONDON  July 31 Britain's top equity index gained ground for the fourth day in a row on Friday  lifted by a rise in the shares of engine maker Rolls Royce and cruise ship company Carnival.",
        "date": "07312015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "UK's FTSE rises for fourth day  Rolls Royce rallies "
    },
    {
        "content": "LONDON  July 31 Britain's top equity index forged ahead on Friday  lifted by a rise in the shares of media group ITV and cruise ship company Carnival  which set the market up for a fourth straight day of gains.",
        "date": "07312015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Britain's FTSE fortified by gains at ITV and Carnival "
    },
    {
        "content": "LONDON  July 31 Britain's top equity index edge down on Friday as a pullback in mining stocks weighed on the market  which had risen for the last three sessions in a row.",
        "date": "07312015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Britain's FTSE slips as mining stocks weaken "
    },
    {
        "content": "LONDON  July 31 Britain's top equity index moved forward on Friday as a rise in the shares of media group ITV  and energy company BG set the market up for a fourth straight day of gains.",
        "date": "07312015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Britain's FTSE forges ahead as BG and ITV rise "
    },
    {
        "content": "LONDON  July 31 European cable operator Liberty Global said it had raised its stake in ITV to 9.9 percent through a hedging deal but still had no intention of taking over Britain's biggest free-to-air commercial TV firm.",
        "date": "07312015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 1-Liberty Global ups stake in broadcaster ITV to 9.9 pct "
    },
    {
        "content": "LONDON  July 31 European cable operator Liberty Global said it had increased its stake in ITV  to 9.9 percent via a hedging deal  but said it still had no intention of taking over Britain's biggest free-to-air commercial TV company.",
        "date": "07312015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global ups stake in broadcaster ITV to 9.9 pct "
    },
    {
        "content": "* Vodafone and Liberty Global are market leaders   (Adds shares  regulatory detail  background on sector consolidation)",
        "date": "07162015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "UPDATE 2-German cable provider Tele Columbus buys PrimaCom "
    },
    {
        "content": "June 23 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06232015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Liberty Global  Europe's biggest cable company  is in talks to buy Irish TV channel TV3 for more than 100 million euros ($111.76 million)  the Financial Times reported  citing people familiar with the matter.",
        "date": "06232015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global in talks to buy Irish broadcaster TV3: FT "
    },
    {
        "content": "June 23 Liberty Global  Europe's biggest cable company  is in talks to buy Irish TV channel TV3 for more than 100 million euros ($111.76 million)  the Financial Times reported  citing people familiar with the matter.",
        "date": "06232015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global in talks to buy Irish broadcaster TV3 -FT "
    },
    {
        "content": "COLOGNE  Germany  June 9 The head of Europe's biggest cable company Liberty Global said on Tuesday that offering mobile telecom services packaged with traditional television and broadband helped keep subscribers loyal for longer.",
        "date": "06092015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global has newfound appreciation for mobile -CEO "
    },
    {
        "content": "Network operator Vodafone Group Plc and cable telecoms company Liberty Global Plc are looking at a range of transactions including a merger  Bloomberg reported.",
        "date": "06042015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Vodafone  Liberty looking at merger: Bloomberg "
    },
    {
        "content": "June 5 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "06052015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "June 4 Network operator Vodafone Group Plc  and cable telecoms company Liberty Global Plc  are looking at a range of transactions including a merger  Bloomberg reported.",
        "date": "06042015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone  Liberty looking at merger - Bloomberg "
    },
    {
        "content": "LONDON Vodafone  the world's second biggest mobile company  said it is in early talks about exchanging selected assets with Europe's largest cable operator Liberty Global  which could enable each to better compete with rivals.",
        "date": "06052015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone in talks with Liberty Global on asset swap  not merger "
    },
    {
        "content": "* Vodafone shares finish down 2.4 pct   (Adds reaction  background)",
        "date": "06052015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 4-Vodafone in talks with Liberty Global on asset swap  not merger "
    },
    {
        "content": "* Confirms that it is in early stages of discussions with Liberty Global",
        "date": "06052015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "REFILE-BRIEF-Vodafone in early talks with Liberty Global on asset swaps "
    },
    {
        "content": "LONDON  June 5 Vodafone  the world's second-biggest mobile operator  said it was considering an exchange of selected assets with Liberty Global  putting an end to speculation that a merger between the two companies was on the cards.",
        "date": "06052015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone says considering asset swap with Liberty "
    },
    {
        "content": "LONDON  May 28 Some of the biggest investors in Vodafone say they are open to a European tie-up with Liberty Global  as the British company is now in a stronger position to negotiate a deal with John Malone's cable group.",
        "date": "05292015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "RPT-Vodafone investors open to Liberty deal "
    },
    {
        "content": "LONDON  May 28 Some of the biggest investors in Vodafone say they are open to a European tie-up with Liberty Global  as the British company is now in a stronger position to negotiate a deal with John Malone's cable group.",
        "date": "05282015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone investors open to Liberty deal "
    },
    {
        "content": "May 15 Warren Buffett's Berkshire Hathaway Inc  on Friday said it has boosted its holdings in some of the billionaire's favorite companies  including Wells Fargo & Co  and International Business Machines Corp.",
        "date": "05152015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 1-Buffett's Berkshire adds to favorites IBM  Wells Fargo "
    },
    {
        "content": "A merger with Vodafone Group Plc  would be a \"great fit\" for Liberty Global Plc  in western Europe  Liberty Chairman John Malone said on Tuesday.",
        "date": "05192015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Malone says Liberty  Vodafone a 'great fit' in Europe: Bloomberg "
    },
    {
        "content": "May 19 A merger with Vodafone Group Plc  would be a \"great fit\" for Liberty Global Plc in western Europe  Liberty Chairman John Malone said on Tuesday.",
        "date": "05192015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Malone says Liberty  Vodafone a 'great fit' in Europe -Bloomberg "
    },
    {
        "content": "LONDON  May 20 Britain's top share index climbed back towards earlier record highs on Wednesday  buoyed by gains in major bank stocks and after bid speculation lifted the shares of mobile network operator Vodafone.",
        "date": "05202015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "UK's FTSE rises near record high as banks and Vodafone advance "
    },
    {
        "content": "LONDON  May 20 Britain's top share index held firm on Wednesday  as bid speculation lifted mobile network operator Vodafone  whose gains offset a slump in the shares of luxury goods group Burberry.",
        "date": "05202015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Britain's FTSE kept steady by rise in Vodafone "
    },
    {
        "content": "LONDON Vodafone's  shares jumped 4 percent on Wednesday after the chairman of Liberty Global   John Malone  said the two companies would make a \"great fit\"  reigniting long-running merger speculation.",
        "date": "05202015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Vodafone shares rise on Malone's Liberty tie-up comments "
    },
    {
        "content": "LONDON  May 20 Vodafone's shares jumped 4 percent on Wednesday after the chairman of Liberty Global   John Malone  said the two companies would make a \"great fit\"  reigniting long-running merger speculation.",
        "date": "05202015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 1-Vodafone shares rise on Malone's Liberty tie-up comments "
    },
    {
        "content": "LONDON  May 20 Britain's top share index edged lower in choppy trade on Wednesday  weighed down by a hefty drop in luxury goods maker Burberry after it gave a lower outlook for 2016  although M&A talk around Vodafone supported the market.",
        "date": "05202015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Britain's FTSE edges lower after Burberry cuts outlook "
    },
    {
        "content": "May 20 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "05202015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "PRESS DIGEST- British Business - May 20 "
    },
    {
        "content": "* Telenet/Base combination to have op. profit of 1.1 bln euros",
        "date": "04202015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "UPDATE 3-Liberty Global's Telenet to buy KPN's Belgian unit for $1.43 bln "
    },
    {
        "content": "AMSTERDAM/BRUSSELS Cable telecoms company Liberty Global's  Belgian subsidiary Telenet  said on Monday it has agreed to buy local mobile network operator Base from Dutch group KPN  for 1.325 billion euros ($1.43 billion).",
        "date": "04202015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global's Telenet to buy KPN's Belgian unit for $1.43 billion "
    },
    {
        "content": "AMSTERDAM  April 20 Cable company Liberty Global Plc said on Monday it would buy KPN's Base mobile telephony subsidiary in Belgium for 1.325 billion euros ($1.43 billion) in cash.",
        "date": "04202015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global's Telnet subsidiary to buy KPN's Base for $1.43 bln "
    },
    {
        "content": "BRUSSELS Liberty Global's German unit has set its sights on business-to-business (B2B) broadband and mobile as part of its strategy to keep expanding in Europe's biggest cable market  ramping up the pressure on established telecom players.",
        "date": "03122015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global's Unitymedia eyes expansion in B2B  mobile "
    },
    {
        "content": "BRUSSELS  March 11 Investments in high-speed broadband networks helped Europe's cable operators such as Liberty Global and Altice accelerate revenue growth in 2014 to 4.6 percent  industry group Cable Europe said on Wednesday.",
        "date": "03112015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Fast broadband lifts revenue growth for Europe's cable operators "
    },
    {
        "content": "LONDON John Malone's Liberty Global and Discovery Communications  who have been linked in the past with Formula One  have become shareholders in the new Formula E electric series.",
        "date": "03102015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "Liberty Global buys into Formula E "
    },
    {
        "content": "LONDON  March 10 John Malone's Liberty Global and Discovery Communications  who have been linked in the past with Formula One  have become shareholders in the new Formula E electric series.",
        "date": "03102015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Motor racing-Liberty Global buys into Formula E "
    },
    {
        "content": "* Mauricio Ramos appointed Millicom's Chief Executive Officer",
        "date": "03032015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "BRIEF-Millicom picks Liberty Global's Mauricio Ramos as CEO "
    },
    {
        "content": "BRUSSELS  Feb 24 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02242015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "EU mergers and takeovers (Feb 24) "
    },
    {
        "content": "BRUSSELS  Feb 24 Liberty Global  secured EU regulatory approval on Tuesday to acquire a controlling stake in Belgian media group De Vijver after agreeing to license the Belgian broadcaster's TV channels on reasonable and non-discriminatory terms to rivals.",
        "date": "02242015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "EU regulators clear Liberty Global's Belgian TV deal with conditions "
    },
    {
        "content": "* Will add 4 million premises to British network   (Adds further analyst reaction  updates shares)",
        "date": "02132015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "UPDATE 1-Virgin Media shakes up UK fixed-line market with expansion plan "
    },
    {
        "content": "* Unitymedia says court case ends due to deal   (adds Liberty settlement amount  CEO comment)",
        "date": "02132015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "UPDATE 2-Liberty settles KabelBW antitrust case for 183 mln euros "
    },
    {
        "content": "FRANKFURT  Feb 13 European cable operator Liberty Global said it would pay 183.5 million euros ($209 million) to two companies who objected to its 3 billion euro purchase of Germany's KabelBW.",
        "date": "02132015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global to pay 183.5 mln euros in KabelBW settlement "
    },
    {
        "content": "FRANKFURT European cable operator Liberty Global's  German unit has reached an agreement with two companies who objected to its 3 billion euro ($3.43 billion) purchase of cable provider KabelBW  the company said in a statement on Friday.",
        "date": "02132015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty's Unitymedia settles KabelBW antitrust case "
    },
    {
        "content": "FRANKFURT  Feb 13 Liberty Global's  German unit has reached an agreement with two companies who objected its 3 billion euro ($3.43 billion) purchase of cable provider KabelBW  the company said in a statement on Friday.",
        "date": "02132015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty's Unitymedia reaches deal in KabelBW antitrust case "
    },
    {
        "content": "* Reorganisation to simplify debt structure   (Updates with quotes  context)",
        "date": "01122015",
        "name": "Liberty Global plc",
        "news_type": "topStory",
        "symbol": "LBTYK",
        "title": "UPDATE 1-Liberty Global overhauling subsidiaries' debt structure "
    },
    {
        "content": "LONDON  Jan 12 (IFR) - Liberty Global is reorganising its European businesses  merging UPC Netherlands with Ziggo  and UPC Ireland with Virgin Media  according to sources close to the matter.",
        "date": "01122015",
        "name": "Liberty Global plc",
        "news_type": "normal",
        "symbol": "LBTYK",
        "title": "Liberty Global reorganising European businesses "
    }
]