[
    {
        "content": "* Lear president and CEO Matt Simoncini announces retirement date",
        "date": "11162017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-CEO Matt Simoncini to retire on February 28  2018​ "
    },
    {
        "content": "* Norges Bank reports a 5.11 percent passive stake in Lear Corp as of October 26  2017 - SEC filing‍​ Source text : [ID:http://bit.ly/2gJAn5b] Further company coverage:",
        "date": "10272017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Norges Bank reports a 5.11 percent passive stake in Lear Corp as of Oct 26 "
    },
    {
        "content": "* Lear reports record third quarter 2017 results and increases full year financial outlook",
        "date": "10252017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear says Q3 adjusted earnings per share $3.96 "
    },
    {
        "content": "* 156 000-sq.ft. facility in Flint to begin production of seats by April 2018​ Source text for Eikon: Further company coverage:",
        "date": "10022017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear Corporation breaks ground on new facility in Flint "
    },
    {
        "content": "* Lear Corporation confirms plans to construct a new world-class automotive seat manufacturing facility in Flint  Michigan",
        "date": "08232017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear Corp to construct new automotive seat manufacturing facility in Flint  Michigan "
    },
    {
        "content": "* Lear announces pricing of $750 million senior notes offering",
        "date": "08142017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear announces pricing of $750 mln senior notes offering "
    },
    {
        "content": "* Intends to commence an underwritten public offering of senior unsecured notes due 2027​",
        "date": "08142017",
        "name": "Lear Corporation",
        "news_type": "normal",
        "symbol": "LEA",
        "title": "BRIEF-Lear intends to commence offering of senior unsecured notes due 2027​ "
    },
    {
        "content": "* ‍Entered into a new credit agreement to refinance its existing credit facilities​",
        "date": "08082017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear Corp enters into a new credit agreement to refinance its existing credit facilities​ "
    },
    {
        "content": "* Lear Corp files for potential mixed shelf; size undislosed Source text: (http://bit.ly/2fvD1hX) Further company coverage:",
        "date": "08102017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear Corp files for potential mixed shelf size undislosed "
    },
    {
        "content": "* Unifor members at Lear Corporation in Whitby ratified a new collective agreement on May 7",
        "date": "05092017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Unifor says members at Lear Corp in Whitby ratified new collective agreement on May 7 "
    },
    {
        "content": "* Q1 earnings per share view $3.92 -- Thomson Reuters I/B/E/S",
        "date": "04262017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear reports Q1 adjusted earnings per share $4.27 "
    },
    {
        "content": "BRUSSELS  April 10 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04102017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "EU mergers and takeovers (April 10) "
    },
    {
        "content": "BRUSSELS  April 12 European Union regulators on Wednesday cleared U.S. car supplier Lear's takeover of the seats and metals business of Spain's Grupo Antolín-Irausa  saying it would still face sufficient competition.",
        "date": "04122017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "EU clears Lear's takeover of Grupo Antolin's car seat business "
    },
    {
        "content": "* CEO Matthew Simoncini's FY 2016 total compensation was $14.4 million versus $13.6 million in FY 2015 - sec filing Source text (http://bit.ly/2oIaYuM) Further company coverage:",
        "date": "03312017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear CEO Matthew Simoncini's FY 2016 total compensation was $14.4 mln vs $13.6 mln in FY 2015 "
    },
    {
        "content": "BRUSSELS  April 7 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04072017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "EU mergers and takeovers (April 7) "
    },
    {
        "content": "* Lear Corporation selected by Wyoming department of transportation for connected vehicle pilot program  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear selected by Wyoming Department Of Transportation for connected vehicle pilot program "
    },
    {
        "content": "* Lear increases share repurchase authorization to $1 billion and increases quarterly cash dividend from $0.30 to $0.50 per share",
        "date": "02132017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear increases share repurchase authorization to $1 billion "
    },
    {
        "content": "* Lear signs definitive agreement to acquire grupo antolin's automotive seating business",
        "date": "02062017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear signs definitive agreement to acquire Grupo Antolin's automotive seating business "
    },
    {
        "content": "* Lear Corp sees sales in 2017 are expected to be approximately $19.5 billion",
        "date": "01262017",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear reports record 2016 results "
    },
    {
        "content": "* Lear Corp says sales in 2016 are expected to be $18.6 billion",
        "date": "10262016",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear reports third quarter 2016 results and increases full year outlook "
    },
    {
        "content": "* Press Release - Lear enters into a strategic partnership with Tempronics and secures exclusive rights to thermoelectric seat heating and cooling technology for use in automotive applications",
        "date": "09082016",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear Corp obtains a minority equity interest in Tempronics "
    },
    {
        "content": "* Lear signs investment agreement for a new leather plant in Yangzhou",
        "date": "08232016",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear signs investment agreement for a new leather plant in Yangzhou "
    },
    {
        "content": "* Lear corp sees sales in 2016 are expected to be in range of $18.5 billion to $18.8 billion",
        "date": "07282016",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear qtrly adjusted earnings per share $3.66 "
    },
    {
        "content": "* Lear will be including Qualcomm Halo WEVC technology in its product portfolio",
        "date": "07272016",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Qualcomm  Lear sign commercial wireless electric vehicle charging license agreement "
    },
    {
        "content": "A federal appeals court on Friday lifted a preliminary injunction against Lear Corp that had blocked the Michigan-based automotive and aerospace giant from suing current or former employees for complaining about health and safety conditions at the company.",
        "date": "05162016",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "Appeals court lifts injunction blocking Lear Corp from suing workers "
    },
    {
        "content": "* Q1 earnings per share view $2.77 -- Thomson Reuters I/B/E/S",
        "date": "04272016",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear reports Q1 adjusted earnings $3.40/shr "
    },
    {
        "content": "April 25 Investment management firm Franklin Resources Inc  which operates as Franklin Templeton Investments  said it appointed Dan O'Lear as president of Franklin Templeton Distributors.",
        "date": "04252016",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "MOVES-Franklin Templeton appoints U.S. retail distribution president "
    },
    {
        "content": "* Says Ceo Matthew J. Simoncini fy 2015 total compensation $13.6 million versus $12.2 million in fy 2014",
        "date": "03312016",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "BRIEF-Lear says CEO Matthew Simoncini's 2015 compensation was $13.6 mln vs $12.2 mln in 2014 "
    },
    {
        "content": "A slew of Dow 30 companies report results in the week: Chemicals conglomerate DuPont  industrial conglomerate United Technologies Corp and property and casualty insurer Travelers Companies Inc on Tuesday; planemaker Boeing Co  beverage maker Coca-Cola Co and McDonald's Corp on Wednesday; and diversified manufacturer 3M Co  Procter & Gamble and Microsoft Corp on Thursday. While DuPont is expected to report lower first-quarter results  Travelers Companies Inc's first-quarter results are expected t",
        "date": "04172015",
        "name": "Lear Corporation",
        "news_type": "normal",
        "symbol": "LEA",
        "title": "What to Watch in the Week Ahead and on Monday  April 20 "
    },
    {
        "content": "Feb 3 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "02032015",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Activist investor Mick McGuire said Tuesday Lear Corp's stock price could surge by nearly 50 percent if the auto supplier splits into two publicly traded companies  a proposal that Lear's management said it was considering.",
        "date": "02032015",
        "name": "Lear Corporation",
        "news_type": "normal",
        "symbol": "LEA",
        "title": "Activist hedge fund Marcato urges Lear to split up "
    },
    {
        "content": "Feb 3 Activist investor Mick McGuire said Tuesday Lear Corp's stock price could surge by nearly 50 percent if the auto supplier splits into two publicly traded companies  a proposal that Lear's management said it was considering.",
        "date": "02032015",
        "name": "Lear Corporation",
        "news_type": "normal",
        "symbol": "LEA",
        "title": "UPDATE 3-Activist hedge fund Marcato urges Lear to split up "
    },
    {
        "content": "Feb 3 Activist investor Mick McGuire has urged Lear Corp's chief executive to split the company's car seat and electrical parts businesses into two publicly traded companies  CNBC reported  citing a person familiar with the matter.",
        "date": "02032015",
        "name": "Lear Corporation",
        "news_type": "normal",
        "symbol": "LEA",
        "title": "Marcato Capital's McGuire urges Lear Corp to split up - CNBC "
    },
    {
        "content": "Lear Corp   a maker of auto seats and electrical power systems  reported a better-than-expected quarterly profit due to strong demand from North America.",
        "date": "01302015",
        "name": "Lear Corporation",
        "news_type": "topStory",
        "symbol": "LEA",
        "title": "Car seat maker Lear's profit jumps as demand from North America rises "
    },
    {
        "content": "Jan 30 Lear Corp  a maker of auto seats and electrical power systems  reported a better-than-expected quarterly profit due to strong demand from North America.",
        "date": "01302015",
        "name": "Lear Corporation",
        "news_type": "normal",
        "symbol": "LEA",
        "title": "UPDATE 1-Car seat maker Lear's profit jumps as demand from N America rises "
    },
    {
        "content": "Jan 30 Lear Corp  a maker of auto seats and electrical power systems  reported an over three-fold rise in quarterly profit  helped by strong demand from North America and a tax gain.",
        "date": "01302015",
        "name": "Lear Corporation",
        "news_type": "normal",
        "symbol": "LEA",
        "title": "Car seat maker Lear Corp's quarterly profit jumps "
    }
]