[
    {
        "content": "Eli Lilly and Co  said on Tuesday it is considering the sale of its Elanco animal health business and expressed optimism that its rejected rheumatoid arthritis drug would pass muster with U.S. regulators when it resubmits its application.",
        "date": "10242017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly mulls sale  other options for animal health business "
    },
    {
        "content": "* Eli Lilly says \"very optimistic\" on U.S. prospect for arthritis drug baricitinib; still sees resubmission to FDA by January Source text for Eikon: Further company coverage: (Reporting By Bill Berkrot)",
        "date": "10242017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "BRIEF-Lilly \"very optimistic\" on U.S. prospect for arthritis drug "
    },
    {
        "content": "Oct 24 Eli Lilly and Co  one of the world's top insulin makers  on Tuesday reported a 28.5 percent drop in quarterly profit and said it was reviewing options  including a sale or an IPO  for its Elanco Animal Health business.",
        "date": "10242017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Eli Lilly says profit falls  to mull sale of animal health business "
    },
    {
        "content": "Oct 19 NOVO NORDISK CHIEF SCIENTIFIC OFFICER MADS KROGSGAARD THOMSEN SAYS IN INTERVIEW:",
        "date": "10192017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Novo Nordisk VP says seeks market share from Eli Lilly with semaglutide "
    },
    {
        "content": "* Declared a dividend for Q4 of 2017 of $0.52 per share on outstanding common stock​ Source text for Eikon: Further company coverage:",
        "date": "10162017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly ‍declares Q4 dividend of $0.52/share "
    },
    {
        "content": "* Sets quarterly dividend of $0.52 per share Source text for Eikon: Further company coverage:",
        "date": "10162017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly sets quarterly dividend of $0.52 per share "
    },
    {
        "content": "* Patent trial and appeal board of U.S. PTO ruled in company's favor regarding patentability of vitamin regimen for Alimta",
        "date": "10052017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-U.S. PTO rules in Eli Lilly's favor on Alimta "
    },
    {
        "content": "* ‍BIOLOGICS INC SAYS HAS BEEN SELECTED BY ELI LILLY AND COMPANY TO BE IN LIMITED DISTRIBUTION NETWORK FOR VERZENIO​ Source text for Eikon: Further company coverage:",
        "date": "10112017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-‍BIOLOGICS SAYS SELECTED BY ELI LILLY TO BE IN LIMITED DISTRIBUTION NETWORK FOR VERZENIO​ "
    },
    {
        "content": "* Eli lilly and co says Lilly Endowment Inc reports open market sale of 205 000 shares of co's common stock on OCT. 4 at average price of $86.805 per share - SEC filing Source text for Eikon: Further company coverage:",
        "date": "10052017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "BRIEF-Eli lilly says Lilly Endowment Inc reports open market sale of 205 000 shares of co's common stock on Oct. 4 "
    },
    {
        "content": "* Eli Lilly and Co - ‍Humalog Junior Kwikpen now available by prescription for treatment of diabetes in U.S.​ Source text for Eikon: Further company coverage:",
        "date": "10042017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly's ‍Humalog Junior Kwikpen now available by prescription in U.S.​ "
    },
    {
        "content": "* Eli Lilly And Co says Lilly Endowment Inc reports open market sale of 162 557 shares of co's common stock at average of $85.1/shr‍​ on Sept 29 - sec filing",
        "date": "10022017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli lilly says lilly endowment reports open market sale of co's common stock "
    },
    {
        "content": "* Eli Lilly and Co - ‍josh Smiley has been promoted to senior vice president and chief financial officer​",
        "date": "09292017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly appoints ‍Josh Smiley as chief financial officer​ "
    },
    {
        "content": "* Eli Lilly says list price of new breast cancer drug Verzenio to be about $10 948 per month",
        "date": "09282017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly sets list price of new breast cancer drug at $10 948/month "
    },
    {
        "content": "Sept 29 The U.S. Food and Drug Administration on Friday approved Novo Nordisk's fast-acting insulin to treat diabetes.",
        "date": "09292017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "U.S. FDA approves Novo Nordisk fast-acting insulin Fiasp "
    },
    {
        "content": "Sept 28 The U.S. Food and Drug Administration said on Thursday it approved an Eli Lilly and Co drug to treat advanced breast cancer that has progressed following prior treatment.",
        "date": "09282017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Eli Lilly wins U.S. approval for breast cancer drug "
    },
    {
        "content": "* Geisinger and Boehringer Ingelheim and its diabetes alliance Eli Lilly collaborate to create a predictive model to help improve health outcomes for people with type 2 diabetes at greatest risk of serious long-term complications  including cardiovascular death Source text for Eikon: Further company coverage:",
        "date": "09252017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Boehringer Ingelheim and Eli Lilly collaborate to create a predictive model to help improve health outcomes for people with type 2 diabetes "
    },
    {
        "content": "Sept 22 The U.S. Food and Drug Administration has declined to approve Johnson & Johnson's rheumatoid arthritis drug sirukumab  saying additional clinical data is needed to further evaluate its safety  the company said on Friday.",
        "date": "09252017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "CORRECTED-UPDATE 2-FDA declines to approve J&J arthritis drug sirukumab "
    },
    {
        "content": "* Jardiance® (Empagliflozin) tablets reduced risk of cardiovascular death in people with type 2 diabetes and established cardiovascular disease independent of background blood sugar control",
        "date": "09122017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly updates on Jardiance tablets "
    },
    {
        "content": "* Lilly takes steps to streamline business  invest in new medicines and drive growth",
        "date": "09072017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly to cuts jobs  focus on developing new medicines "
    },
    {
        "content": "* Acrux and Eli Lilly and Company have mutually agreed to terminate their licensing agreement for Axiron",
        "date": "09062017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Acrux says co and Eli Lilly and Co agreed to terminate licensing agreement for Axiron "
    },
    {
        "content": "* Nektar Therapeutics - Co  Eli Lilly got notice of early termination of waiting period related to license agreement to co-develop NKTR-358 - SEC filing Source text:[http://bit.ly/2wFqKyD] Further company coverage:",
        "date": "08252017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Nektar Therapeutics and Eli Lilly got notice of early termination of waiting period related to license agreement "
    },
    {
        "content": "* Shares down 1.4 pct (Adds investor comment  company response; updates shares)",
        "date": "08082017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "UPDATE 3-CVS Health's dull Q3 forecast overshadows profit beat "
    },
    {
        "content": "* Eli Lilly announces positive results for second phase 3 study of Lasmiditan for the acute treatment of Migraine",
        "date": "08042017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly announces positive results for second phase 3 study of Lasmiditan for treatment of Migraine "
    },
    {
        "content": "* Says got civil investigative demand from Minnesota's office of Attorney General relating to pricing  sale of insulin products - SEC filing‍​",
        "date": "07282017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Lilly gets civil investigative demand from Minnesota AG for insulin product pricing‍​ "
    },
    {
        "content": "Eli Lilly and Co on Tuesday outlined a likely multi-year delay for its experimental rheumatoid arthritis drug with blockbuster sales potential  and disappointed investors sent its shares down nearly 4 percent.",
        "date": "07252017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly signals long delay for arthritis drug  shares fall "
    },
    {
        "content": "* Dow up 0.49 pct  S&P up 0.34 pct  Nasdaq down 0.06 pct (Adds details  changes comment  updates prices)",
        "date": "07252017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "US STOCKS-Strong earnings boost S&P  Dow; Alphabet drags Nasdaq "
    },
    {
        "content": "* Eli Lilly says intends to be more active seeking external preclinical and early stage immuno-oncology assets",
        "date": "07252017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "BRIEF-Eli lilly says seeks external early cancer assets "
    },
    {
        "content": "July 25 Eli Lilly and Co on Tuesday reported a 35 percent rise in quarterly profit as the U.S. drugmaker benefited from higher sales of its diabetes treatment Trulicity as well as its psoriasis drug Taltz.",
        "date": "07252017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Drugmaker Lilly's profit jumps 35 percent "
    },
    {
        "content": "* Eular 2017: Lilly's Taltz (ixekizumab) demonstrated significant improvements in disease signs and symptoms at 24 weeks among patients with active psoriatic arthritis who had prior inadequate response or intolerance to TNF inhibitors",
        "date": "06152017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly files supplemental biologics license application with FDA for Taltz "
    },
    {
        "content": "* Sets quarterly dividend of $0.52per share Source text for Eikon: Further company coverage:",
        "date": "06192017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly and Co sets quarterly dividend of $0.52 per share "
    },
    {
        "content": "* Jardiance® (empagliflozin) analysis reinforces established safety profile",
        "date": "06132017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly updates on study data on Jardiance "
    },
    {
        "content": "* Jardiance® (empagliflozin) tablets to be studied in chronic kidney disease",
        "date": "06122017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Lilly says Jardiance tablets to be studied in chronic kidney disease "
    },
    {
        "content": "* Says it completes the technology transfer of the Peptide Discovery Platform System (PDPS) to US-based Eli Lilly and Company",
        "date": "06072017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-PeptiDream announces completion of technology transfer of Peptide Discovery Platform System to Lilly "
    },
    {
        "content": "* Upadacitinib  a JAK inhibitor  more effective than a placebo",
        "date": "06072017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "CORRECTED-UPDATE 3-AbbVie's rheumatoid arthritis drug succeeds in trial "
    },
    {
        "content": "CHICAGO  May 19 Talks on restarting U.S. beef exports to China are moving fast and final details should be in place by early June  the U.S. Department of Agriculture said on Friday  allowing American farmers to vie for business that has been lost by rival Brazil.",
        "date": "05222017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "CORRECTED-U.S.  China accelerate beef talks; deal possible by early June "
    },
    {
        "content": " (This version of the May 19th story corrects paragraphs 2 and 18 to show China will likely test for residue of beta-agonists in beef instead of banning beef from cattle fed the drugs)",
        "date": "05222017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "U.S.  China accelerate beef talks; deal possible by early June "
    },
    {
        "content": "CHICAGO  May 19 Talks on restarting U.S. beef exports to China are moving fast and final details should be in place by early June  the U.S. Department of Agriculture said on Friday  allowing American farmers to vie for business that has been lost by rival Brazil.",
        "date": "05222017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "CORRECTED-RPT-U.S.  China accelerate beef talks; deal possible by early June "
    },
    {
        "content": "* United Therapeutics Corp - on May 17  2017  co entered into first amendment to license agreement with Eli Lilly and company",
        "date": "05182017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-United Therapeutics says it entered into first amendment to license agreement with Eli Lilly and company "
    },
    {
        "content": "* Eli Lilly and Co files for potential three-part notes offering; size undisclosed Source text :(http://bit.ly/2qIKWbH) Further company coverage:",
        "date": "05042017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly and Co files for potential three-part notes offering "
    },
    {
        "content": "* Sets quarterly dividend of $0.52 per share Source text for Eikon: Further company coverage:",
        "date": "05012017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly and Co sets Q2 2017 dividend of $0.52 per share "
    },
    {
        "content": "Neurotrope Inc's shares more than halved after data from a small trial on the company's Alzheimer's drug failed to impress investors  the latest in a series of setbacks in the quest for an effective treatment for the memory-robbing disease.",
        "date": "05012017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Neurotrope Alzheimer's drug data fails to impress; shares crater "
    },
    {
        "content": "May 1 Neurotrope Inc's shares more than halved after data from a small trial on the company's Alzheimer's drug failed to impress investors  the latest in a series of setbacks in the quest for an effective treatment for the memory-robbing disease.",
        "date": "05012017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "UPDATE 4-Neurotrope Alzheimer's drug data fails to impress; shares crater "
    },
    {
        "content": "April 21 A European Medicines Agency panel said on Friday it recommended granting marketing approval to Sanofi and Regeneron's experimental drug to treat rheumatoid arthritis.",
        "date": "04212017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "EMA panel recommends nod for Sanofi  Regeneron's arthritis drug "
    },
    {
        "content": "* Intelgenx Technologies- Eli Lilly granted Intelgenx' Versafilm exclusive license for tadalafil film product under erectile dysfunction dosing patent",
        "date": "03282017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Intelgenx Technologies says Eli Lilly granted Versafilm exclusive license for tadalafil film product under erectile dysfunction dosing patent "
    },
    {
        "content": "* Lilly Endowment Inc reports open market sale of 210 000 of co's common stock on march 30 at $84.674 per share - SEC filing Source text (http://bit.ly/2nrnkag) Further company coverage:",
        "date": "03312017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly says Lilly Endowment Inc reports open market sale of 210 000 of stock "
    },
    {
        "content": "* CEO John C. Lechleiter's 2016 total compensation was $18.4 million versus $16.6 million in 2015",
        "date": "03202017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly and Co says CEO John Lechleiter's 2016 total compensation was $18.4 mln "
    },
    {
        "content": "By Jan  Wolfe The U.S. Court of Appeals for the Federal Circuit has breathed new life into a research institute’s claims that Eli Lilly and Co’s erectile dysfunction drug Cialis infringes on one of its patents.",
        "date": "02282017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Federal Circuit revives Cialis patent claims against Lilly "
    },
    {
        "content": "Feb 28 Nestle SA-backed Accera Inc said on Tuesday its experimental Alzheimer's drug failed a late-stage study  adding to the laundry list of disappointments in the pursuit of an effective treatment for the rampant mind-wasting disease.",
        "date": "02282017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Accera's Alzheimer's trial fails  in yet another setback for disease "
    },
    {
        "content": "Seniors' advocacy group AARP and drugmaker Eli Lilly & Co on Thursday urged a federal appeals court to overturn a court order barring sales of Sanofi SA and Regeneron Pharmaceuticals Inc's cholesterol drug Praluent.",
        "date": "02242017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "AARP  Eli Lilly support Sanofi  Regeneron in cholesterol drug fight "
    },
    {
        "content": "* Provisions included in legislation repealing  replacing affordable care act could have material adverse effect on consolidated results  cash flows  Source text - (http://bit.ly/2kIQynP) Further company coverage:",
        "date": "02212017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Lilly says provisions included in legislation to repeal Affordable Care Act could adversely affect results "
    },
    {
        "content": "* Eli Lilly - additional results from pivotal ra-beam study published in New England Journal of Medicine",
        "date": "02152017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly says additional results from pivotal ra-beam study published in New England Journal of Medicine "
    },
    {
        "content": "Eli Lilly and Co's  quarterly revenue beat analysts' estimates  driven by higher demand for its diabetes drug Humalog as well as its newer products such as Trulicity and Basaglar.",
        "date": "01312017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly revenue beats as diabetes drug sales rise "
    },
    {
        "content": "NEW YORK  Jan 30 Three of the biggest makers of diabetes treatments  Sanofi SA  Novo Nordisk  and Eli Lilly & Co  were named in a class action lawsuit about price fixing filed by a group of patients.",
        "date": "01302017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Sanofi  Novo Nordisk and Lilly named in patients' price fixing suit "
    },
    {
        "content": "Jan 31 Eli Lilly and Co reported a 7.2 percent rise in quarterly revenue  lifted by higher demand for its diabetes drug Trulicity and other new treatments.",
        "date": "01312017",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Lilly revenue rises 7.2 pct on higher demand for new drugs "
    },
    {
        "content": "* Japan ip high court rules in lilly's favor on alimta vitamin regimen patents",
        "date": "02022017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Japan high court rules in Lilly's favor on Alimta patents "
    },
    {
        "content": "* Colucid Pharmaceuticals - upon termination of deal under specified circumstances  co will be required to pay Eli Lilly termination fee of $34 million  Source text (http://bit.ly/2jKbOWp) Further company coverage:",
        "date": "01182017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Colucid Pharmaceuticals says termination fee of $34 mln to be payable to Eli Lilly upon termination "
    },
    {
        "content": "Jan 12 U.S. Appeals Court rules for Eli Lilly  and against Teva Pharmaceutical in Alimta patent case -- court ruling",
        "date": "01122017",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-U.S. appeals court rejects Teva appeal in Lilly patent case over Alimta "
    },
    {
        "content": "* Dow up 0.1 pct  S&P down 0.1 pct  Nasdaq down 0.3 pct   (Updates to late afternoon  adds dateline)",
        "date": "11232016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "US STOCKS-S&P 500 dips with healthcare shares  Dow edges up ahead of holiday "
    },
    {
        "content": "* Eli Lilly and CO incoming CEO David Ricks on CNBC - Amyloid Hypothesis should be continued to be studied in reference to its Alzheimer's drug",
        "date": "11232016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly and CO incoming CEO David Ricks on CNBC - Amyloid Hypothesis should be continued to be studied in reference to its Alzheimer's drug "
    },
    {
        "content": "* Eli lilly -new analyses of phase 3 trials show improvements in rheumatoid arthritis symptoms following treatment with Baricitinib  Source text for Eikon:  Further company coverage:",
        "date": "11142016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli lilly and Incyte says Baricitinib treatment show improvements in rheumatoid arthritis symptoms in phase 3 "
    },
    {
        "content": "* New data from pivotal RA-BEACON study show significant improvement in patient-reported outcomes in rheumatoid arthritis patients treated with baricitinib compared to placebo",
        "date": "11022016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly and Co says new data from pivotal RA-BEACON study show significant improvement in patient-reported outcomes "
    },
    {
        "content": "* Sets quarterly dividend of $0.51 per share  Source text for Eikon:  Further company coverage:",
        "date": "10172016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly and Co sets quarterly dividend of $0.51/share "
    },
    {
        "content": "Sept 20 Regeneron Pharmaceuticals Inc  and Israeli drugmaker Teva Pharmaceutical Industries  on Tuesday said they would co-develop Regeneron's experimental new type of pain drug and together market the medicine if it succeeds in trials and is approved.",
        "date": "09202016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Regeneron  Teva take aim at Lilly/Pfizer pain drug "
    },
    {
        "content": "* Recommends approval of Eli Lilly and Boehringer Ingelheim's Glyxambi for treatment of type 2 diabetes",
        "date": "09162016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-EMA recommends approval of three new cancer treatments "
    },
    {
        "content": "* Levi garraway  m.d.  ph.d.  to become senior vice president of global oncology at lilly  succeeding richard gaynor  m.d.  who is retiring after a distinguished career",
        "date": "09142016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Levi Garraway to become senior vice president of global oncology at Lilly "
    },
    {
        "content": "* Health Canada approves new indication for Jardiance (empagliflozin) tablets for adults with type 2 diabetes and established cardiovascular disease  Source text for Eikon:  Further company coverage:",
        "date": "08112016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Lilly-Health Canada approves new indication for Jardiance tablets "
    },
    {
        "content": "Aug 11 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08112016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "PRESS DIGEST - Wall Street Journal - Aug 11 "
    },
    {
        "content": "* Eli lilly and co says  joshua smiley will be appointed to senior vice president  finance  and treasurer effective october 1  Source text for Eikon:  Further company coverage:",
        "date": "08102016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly names Joshua Smiley senior VP  finance  and treasurer effective Oct 1 "
    },
    {
        "content": "U.S. drugmaker Eli Lilly and Co on Wednesday said it would continue a late-stage trial of its experimental breast cancer drug in combination with a widely used treatment even though an independent panel determined the combination therapy failed to meet its interim effectiveness goal.",
        "date": "08102016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Lilly breast cancer drug stumbles  but trial continues "
    },
    {
        "content": "Aug 10 Eli Lilly and Co said an interim analysis of a late-stage study testing its breast cancer drug abemaciclib by an independent panel showed the treatment did not meet the effectiveness criteria and recommended that the company continue the trial.",
        "date": "08102016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Panel recommends Lilly continue breast cancer drug study "
    },
    {
        "content": "Aug 1 Express Scripts : *   says adds Eli Lilly's new Taltz psoriasis drug to its list of excluded medications  making it ineligible for coverage.",
        "date": "08012016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Express Scripts adds Lilly's Taltz psoriasis drug to its excluded medicines list "
    },
    {
        "content": "Eli Lilly and Co said it received a civil investigative demand from the U.S. attorney's office for the southern district of New York  requesting documents and information relating to contracts with pharmacy benefit managers (PBMs).",
        "date": "07282016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "U.S. probes contracts between Eli Lilly and PBMs "
    },
    {
        "content": "Eli Lilly and Co on Tuesday reported better-than-expected quarterly sales  fueled by newer drugs  and predicted average annual revenue growth of at least 5 percent through the end of the decade due to its growing roster of medicines.",
        "date": "07262016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly sales beat estimates  helped by newer drugs "
    },
    {
        "content": "Eli Lilly & Co will likely step up the pace of making deals with other drugmakers while aggressively developing new drugs on its own  the company's newly appointed chief executive said on Wednesday.",
        "date": "07272016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Incoming Lilly CEO says dealmaking will be a focus "
    },
    {
        "content": "July 28 Eli Lilly and Co said it received a civil investigative demand from the U.S. attorney's office for the southern district of New York  requesting documents and information relating to contracts with pharmacy benefit managers.",
        "date": "07282016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Eli Lilly says authorities seek documents on PBM contracts "
    },
    {
        "content": "* Eli Lilly CEO John Lechleiter says view a future where drug pricing is going to be challenging across the board - CNBC     (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "07262016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly CEO John Lechleiter says view a future where drug pricing is going to be challenging across the board- CNBC "
    },
    {
        "content": "July 27 Eli Lilly & Co will likely step up the pace of making deals with other drugmakers while aggressively developing new drugs on its own  the company's newly appointed chief executive said on Wednesday.",
        "date": "07272016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "UPDATE 2-Incoming Lilly CEO says dealmaking will be a focus "
    },
    {
        "content": "* Q2 earnings per share view $0.86 -- Thomson Reuters I/B/E/S",
        "date": "07262016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly reports quarterly earnings of $0.71 per share "
    },
    {
        "content": "July 27 U.S. drugmaker Eli Lilly and Co  said on Wednesday John Lechleiter  its chief executive of eight years  would retire by the end of the year and would be succeeded by senior vice president David Ricks on January 1.",
        "date": "07272016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "UPDATE 1-Lilly CEO Lechleiter to retire; David Ricks to succeed "
    },
    {
        "content": "July 26 Eli Lilly and Co reported a 24.5 percent jump in quarterly profit  driven by demand for its newer treatments for diabetes and cancer.",
        "date": "07262016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Lilly quarterly profit  sales jump on demand for new drugs "
    },
    {
        "content": "* John C. Lechleiter to retire as Lilly CEO; board elects David A. Ricks as successor",
        "date": "07272016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "BRIEF-John Lechleiter to retire as Lilly CEO "
    },
    {
        "content": "* On July 27  John Lechleiter announced retirement as president and chief executive officer",
        "date": "07272016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly says CEO John Lechleiter to retire "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 22 (Fitch) Fitch Ratings has affirmed Eli Lilly & Co. Inc.'s  (Lilly) Long-Term Issuer Default Rating (IDR) at 'A' with a Stable Outlook.  Fitch also affirmed the company's short-term IDR at 'F1'. The rating actions  apply to roughly $7.8 billion of debt outstanding at Mar. 31  2016. A full list  of the rating actions is provided at the end of this release. KEY RATING DRIVERS --Lilly is facing a manageable patent expiry pe",
        "date": "07222016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Fitch Affirms Eli Lilly's IDR at 'A'; Outlook Stable "
    },
    {
        "content": "* U.S. FDA expands indication for type 2 diabetes treatment Synjardy\u007f (empagliflozin/metformin hydrochloride) to include treatment-naïve adults",
        "date": "07192016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly  U.S. FDA expand indication for type 2 diabetes treatment Synjardy "
    },
    {
        "content": "* Sets quarterly dividend of $0.51 per share  Source text for Eikon:  Further company coverage:",
        "date": "06202016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly sets quarterly dividend of $0.51/shr "
    },
    {
        "content": "* Promotion of Aarti Shah   Ph.D.  to Senior Vice President and Chief Information Officer effective July 1",
        "date": "06132016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Lilly names Aarti Shah Chief Information Officer "
    },
    {
        "content": "WASHINGTON  June 2 Some major U.S. drug companies have hired their own auditors to perform compliance reviews mandated in government settlements over alleged civil violations  such as paying kickbacks or off-label drug promotion  according to federal records reviewed by Reuters.",
        "date": "06022016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Independence of compliance reviews is questioned in drug firm settlements "
    },
    {
        "content": "* FDA grants priority review for lilly's Olaratumab  an investigational medicine for advanced soft tissue sarcoma",
        "date": "05042016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-FDA grants priority review for Lilly's Olaratumab "
    },
    {
        "content": "* Sets quarterly dividend of $0.51 per share  Source text for Eikon:  Further company coverage:",
        "date": "05022016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Eli Lilly sets quarterly dividend of $0.51/shr "
    },
    {
        "content": "A federal judge in Texas has blocked a Texas pharmacy chain's early exit from the patent war between Eli Lilly and a German pharmaceutical firm over the use of the erectile dysfunction drug Cialis to treat the prostate condition known as BPH.",
        "date": "04282016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Pharmacy stuck in Cialis patent war between Eli Lilly  German firm "
    },
    {
        "content": "FRANKFURT  April 19 Boehringer Ingelheim  Germany's second-largest drugmaker  posted 11 percent higher sales and a 6 percent gain in operating profit for 2015  boosted by its diabetes treatment business  where it collaborates with Eli Lilly.",
        "date": "04192016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Boehringer's operating profit up 6 percent on diabetes drugs "
    },
    {
        "content": "U.S. health regulators said on Tuesday they have approved a drug from Eli Lilly and Co to treat adults with moderate to severe cases of the skin condition plaque psoriasis.",
        "date": "03222016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "U.S. FDA approves Eli Lilly drug for psoriasis "
    },
    {
        "content": "Drugmaker Eli Lilly and Co  reported a 5 percent rise in quarterly revenue  helped by increased sales of its diabetes drugs and higher volume.",
        "date": "01282016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Eli Lilly's revenue rises 5 percent as diabetes drugs gain "
    },
    {
        "content": "* Adocia and Eli Lilly and Co initiate phase 1b study evaluating ultra-rapid insulin biochaperone Lispro U100 in healthy Japanese subjects  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "01292016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Adocia and Lilly initiate phase 1b study evaluating Lispro U100 "
    },
    {
        "content": "Eli Lilly and Co on Tuesday forecast 2016 revenue below expectations but said that its Jardiance diabetes treatment grabbed market share during the fourth quarter  which helped shares rise as much as 3 percent.",
        "date": "01052016",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly 2016 revenue outlook falls short but Jardiance boosts shares "
    },
    {
        "content": "Jan 5 Drugmaker Eli Lilly and Co revised its 2015 earnings estimate lower and forecast 2016 earnings of $2.92-$3.02 per share.",
        "date": "01052016",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Lilly revises 2015 earnings estimate lower "
    },
    {
        "content": "SHANGHAI  Dec 30 China Animal Healthcare   part owned by Eli Lilly and Co  said on Wednesday it was hunting for five years-worth of financial documents that were lost after the truck carrying them was stolen as the driver took a lunch break.",
        "date": "12312015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "REFILE-UPDATE 1-China firm loses 5 years of financial documents as truck stolen "
    },
    {
        "content": "* Says will begin two alzheimer's trials in 2016 targeting tau protein",
        "date": "12082015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Lilly says plans in 2016 to report results from early-stage trial of n3pg  an antibody that targets deposited brain plaque "
    },
    {
        "content": "ZURICH Eli Lilly's plan to close a Swiss laboratory that conducts tests and experiments on live animals has caused concerns by a local animal welfare group over the fate of the facility's hundreds of dogs  cats and livestock.",
        "date": "12032015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Eli Lilly's Swiss lab closure worries animal rights group "
    },
    {
        "content": "ZURICH  Dec 3 Eli Lilly's plan to close a Swiss laboratory that conducts tests and experiments on live animals has caused concerns by a local animal welfare group over the fate of the facility's hundreds of dogs  cats and livestock.",
        "date": "12032015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "REFILE-Eli Lilly's Swiss lab closure worries animal rights group "
    },
    {
        "content": "Nov 24 The U.S. Food and Drug Administration on Tuesday approved Eli Lilly & Co's cancer treatment  Portrazza  in combination with two forms of chemotherapy to treat patients with advanced squamous non-small cell lung cancer.",
        "date": "11242015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "FDA approves Lilly's lung cancer drug "
    },
    {
        "content": "Nov 24 The U.S. Food and Drug Administration said it had approved Eli Lilly & Co's Portrazza  in combination with two forms of chemotherapy  to treat patients with a type of lung cancer.",
        "date": "11242015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "UPDATE 1-FDA approves Lilly's lung cancer drug "
    },
    {
        "content": "Eli Lilly & Co  reported better-than-expected quarterly earnings due to cost controls and sales of new treatments for diabetes and cancer  keeping the U.S. drugmaker on track for its planned return to growth this year.",
        "date": "10222015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly beats forecasts on cost cuts  raises 2015 view "
    },
    {
        "content": "Oct 22 Drugmaker Eli Lilly & Co reported a nearly 2 pct rise in revenue  helped by higher demand for its diabetes and cancer drugs.",
        "date": "10222015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Drugmaker Eli Lilly's revenue rises 2 percent "
    },
    {
        "content": "Eli Lilly and Co has stopped a late-stage trial of its closely watched cholesterol treatment after it proved ineffective  sending its stock down more than 9 percent and casting greater skepticism over the potentially lucrative class of medicines.",
        "date": "10122015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Eli Lilly halts study of heart drug  stock tumbles "
    },
    {
        "content": "Oct 12 Eli Lilly and Co has stopped a late-stage trial of its closely watched cholesterol treatment after it proved ineffective  sending its stock down more than 9 percent and casting greater skepticism over the potentially lucrative class of medicines.",
        "date": "10122015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "UPDATE 3-Eli Lilly halts study of heart drug  stock tumbles "
    },
    {
        "content": "Oct 12 Eli Lilly and Co said it stopped development of its experimental heart drug  evacetrapib  and scrapped a late-stage study as the treatment did not show enough efficacy in the trial.",
        "date": "10122015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Eli Lilly discontinues heart drug development "
    },
    {
        "content": "SHANGHAI  Oct 12 Eli Lilly and Co has expanded a tie-up up with China-based biopharmaceutical company Innovent Biologics Inc to develop cancer treatments for the fast-growing Chinese market  the two companies said in a joint statement on Monday.",
        "date": "10122015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Eli Lilly expands cancer tie-up in fast-growing China market "
    },
    {
        "content": "* Adocia and  Eli Lilly and Company initiate a phase 1b study evaluating ultra-rapid BioChaperone Lispro in patients with type 1 diabetes using insulin pump therapy",
        "date": "10062015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Adocia and Lilly initiate phase 1b study evaluating BioChaperone Lispro "
    },
    {
        "content": "* Adocia and Eli Lilly and Company initiate a new phase 1b study of repeat administration of ultra-rapid BioChaperone Lispro in patients with type 2 diabetes",
        "date": "09302015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Adocia and Lilly initiate a new phase 1b study of BioChaperone Lispro "
    },
    {
        "content": "Eli Lilly and Co and Incyte Corp said their experimental drug was found to be more effective in treating rheumatoid arthritis than a commonly prescribed medicine  in a late-stage study.",
        "date": "09292015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly  Incyte arthritis drug found better than common treatment "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Friday:",
        "date": "09182015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "NORDIC STOCKS - Factors to watch on Sept 18 "
    },
    {
        "content": "Aug 20 Eli Lilly and Co :  * Jardiance demonstrated cardiovascular (cv) risk reduction in people with type 2 diabetes at high risk for cv events  * Says empa-reg outcome met its primary endpoint  * Says empa-reg outcome demonstrated superiority of jardiance  when added to standard of care  in cv risk reduction * Source text for Eikon  * Further company coverage",
        "date": "08202015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "CORRECTED-BRIEF- Eli Lilly and Co says EMPA-REG OUTCOME met its primary endpoint "
    },
    {
        "content": "Pharmaceutical giant Eli Lilly announced Tuesday it will shift the funding for clinical trials of an early-stage Alzheimer's treatment from the University of California San Diego to the University of Southern California. The study of solanezumab is a large part of the Alzheimer's Disease Cooperative Study  a $100 million  70-member consortium that has been headquartered at UCSD since its inception in 1991.",
        "date": "08062015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Eli Lilly shifts Alzheimer-drug study to USC "
    },
    {
        "content": "July 23 Eli Lilly and Co said its quarterly revenue rose about 1 percent  helped by demand for its new cancer and diabetes treatments and the acquisition of Novartis AG's animal health business.",
        "date": "07232015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly sales inch up on demand for animal health  new drugs "
    },
    {
        "content": "DUBLIN  July 16 Britain's Immunocore completed Europe's largest ever financing round by a private life sciences company on Thursday  raising $320 million from investors including Eli Lilly & Co  Malin and Woodford Investment Management.",
        "date": "07162015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Britain's Immunocore raises $320 mln in record financing round "
    },
    {
        "content": "* British biotech firm immunocore says secures $320 million in Europe's largest private life sciences financing",
        "date": "07162015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "BRIEF-British biotech firm Immunocore to raise $320 mln in finance "
    },
    {
        "content": "WASHINGTON Eli Lilly & Co.'s experimental lung cancer drug necitumumab improved overall survival by an average of 1.6 months but also increased the risk of sometimes fatal blood clots  according to a preliminary review by the U.S. Food and Drug Administration.",
        "date": "07072015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly cancer drug improves survival  raises blood clot risk: FDA "
    },
    {
        "content": "July 7 Eli Lilly & Co.'s experimental lung cancer drug necitumumab improved overall survival by an average of 1.6 months but also increased the risk of sometimes fatal blood clots according to a preliminary review by the U.S. Food and Drug Administration.",
        "date": "07072015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "FDA asks panel to weigh benefit  risk of Lilly lung cancer drug "
    },
    {
        "content": "* Indexes up: Dow 0.06 pct  S&P 0.13 pct  Nasdaq 0.14 pct   (Updates to early afternoon)",
        "date": "06252015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "US STOCKS-Wall St little changed; health stocks rally "
    },
    {
        "content": "where assigned  and hit the newskey (F9 on Reuters terminals)",
        "date": "05262015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "New Issue- Eli Lilly prices a triple tranche deal "
    },
    {
        "content": "Eli Lilly and Co  soundly beat quarterly profit estimates on lower-than-expected spending on research and marketing  but revenue slipped as the stronger dollar hurt sales outside the United States.",
        "date": "04232015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly profit beats estimates  helped by cost cuts "
    },
    {
        "content": "April 23 Eli Lilly and Co reported a 27 percent fall in quarterly profit  hurt by a stronger dollar.",
        "date": "04232015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Lilly profit falls 27 percent  hurt by strong dollar "
    },
    {
        "content": "Eli Lilly and Co said its experimental drug  ixekizumab  reduced the signs and symptoms of active psoriatic arthritis in patients more than a placebo did in a late-stage trial.",
        "date": "04202015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly's psoriatic arthritis drug succeeds in late-stage study "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 21 (Fitch) Fitch Ratings affirms Eli Lilly & Co. Inc.'s (Lilly)  long-term Issuer Default Rating (IDR) at 'A'. In addition  Fitch affirms the  company's short-term IDR at 'F1'. The Rating Outlook is Stable. The rating  actions apply to roughly $7.6 billion of debt outstanding at Dec. 31  2014. A  full list of the rating actions is provided at the end of this release.  KEY RATING DRIVERS --Fitch views the acquisition of No",
        "date": "04212015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Fitch Affirms Eli Lilly's IDR at 'A'; Outlook Stable "
    },
    {
        "content": "The U.S. Food and Drug Administration said it would not recommend changes to the prescribing or use of Eli Lilly and Co's schizophrenia drug after a review of two deaths.",
        "date": "03232015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "FDA recommends no changes to Lilly's schizophrenia injection use "
    },
    {
        "content": "A federal judge has ruled that a former manager at drug company Eli Lilly & Co is entitled to long-term disability benefits because she has fibromyalgia  overruling a determination by the company's disability plan.",
        "date": "02182015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Court orders benefits for ex-Lilly manager with fibromyalgia "
    },
    {
        "content": "Jan 30 U.S. drugmaker Eli Lilly and Co  reported a 41 percent fall in quarterly profit  hurt by a stronger dollar and a one-time charge related to a restructuring program.",
        "date": "01302015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Drugmaker Lilly's Q4 profit falls on strong dollar  charge "
    },
    {
        "content": "* Announces closing of Sentinel brands family acquisition in United States from Eli Lilly",
        "date": "01052015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "BRIEF-Virbac closes Sentinel brands family acquisition Eli Lilly "
    },
    {
        "content": "Eli Lilly and Co  forecast 2015 earnings and revenue just shy of market expectations as the drugmaker looks to bounce back after the expiration of patents on some of its biggest sellers.",
        "date": "01072015",
        "name": "Eli Lilly and Company",
        "news_type": "topStory",
        "symbol": "LLY",
        "title": "Lilly forecasts 2015 earnings  revenue shy of Street estimates "
    },
    {
        "content": "Jan 7 Eli Lilly and Co  which has been battered in the past three years by competition from generics  forecast 2015 revenue shy of Wall Street expectations.",
        "date": "01072015",
        "name": "Eli Lilly and Company",
        "news_type": "normal",
        "symbol": "LLY",
        "title": "Lilly 2015 revenue forecast falls short of Wall St estimates "
    }
]