[
    {
        "content": "* Legg Mason reports assets under management and flows for October 2017",
        "date": "11102017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports assets under management and flows for Oct 2017 "
    },
    {
        "content": "* Q2 earnings per share view $0.69 -- Thomson Reuters I/B/E/S",
        "date": "10252017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports Q2 earnings $0.78/shr "
    },
    {
        "content": "Oct 16 Asset manager Legg Mason promoted Joe O'Donnell to head of wealth management distribution and investment trusts.",
        "date": "10162017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "MOVES-Legg Mason promotes Joe O'Donnell to wealth management distribution head "
    },
    {
        "content": "* Legg Mason reports assets under management and flows for august 2017",
        "date": "09122017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports assets under management and flows for Aug 2017 "
    },
    {
        "content": "* Reported preliminary assets under management (AUM) of about $745.0 billion as of June 30  2017",
        "date": "07132017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports assets under management and flows for June 2017 "
    },
    {
        "content": "* CEO Joseph Sullivan's FY 2017 total compensation was $8.9 million versus $10.2 million for FY 2016 - SEC filing",
        "date": "06142017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason says CEO Joseph Sullivan's FY 2017 total compensation was $8.9 million "
    },
    {
        "content": "* Legg mason - ‍on June 2  co entered into fourth amendment and waiver to company's unsecured credit agreement  dated as of Dec 29  2015​ - sec filing",
        "date": "06052017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason  ‍on June 2  co entered into fourth amendment  waiver to co's unsecured credit agreement  dated as of Dec 29  2015​ "
    },
    {
        "content": "* Sandstorm Gold Ltd - receipt of 10.76 million common shares and 205 792 warrants of Mason Resources Corp",
        "date": "05232017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Sandstorm Gold - receipt of 10.76 mln common shares  205 792 warrants of Mason Resources "
    },
    {
        "content": "* Appoints Frances Cashman  John Kenney  Patricia Lattin to executive committee",
        "date": "05052017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason announces appointments to executive committee "
    },
    {
        "content": "* At its shareholder  meeting  shareholders voted 97.93% in favour of approving the spin-out of Mason Resources Corp",
        "date": "05022017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Entree Gold Inc says shareholders voted 97.93 pct in favour of approving the spin-out of Mason Resources Corp "
    },
    {
        "content": "* Legg Mason reports results for fourth fiscal quarter and fiscal year-end 2017",
        "date": "04262017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports Q4 earnings per share $0.76 "
    },
    {
        "content": "* Legg Mason reports assets under management and flows for March 2017",
        "date": "04122017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports AUM and flows for March 2017 "
    },
    {
        "content": "* Preliminary assets under management of approximately $722.9 billion as of February 28  2017",
        "date": "03102017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports assets under management and flows for Feb "
    },
    {
        "content": "LONDON  March 10 Asset manager Legg Mason is setting up a management company in Ireland to ensure it can still sell its funds to European Union clients after Britain leaves the bloc.",
        "date": "03102017",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "Legg Mason bulks up in Dublin for Brexit fund flexibility "
    },
    {
        "content": "* Legg Mason reports assets under management and flows for January 2017",
        "date": "02102017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports AUM of about $713.8 bln as of Jan. 31 "
    },
    {
        "content": "* Legg Mason appoints Tianqiao Chen and Robert Chiu to its board of directors  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason appoints Tianqiao Chen and Robert Chiu to its board "
    },
    {
        "content": "* Q3 earnings per share view $0.64 -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports third fiscal quarter results "
    },
    {
        "content": "Asset manager Legg Mason Inc  said on Monday its largest shareholder  Chinese billionaire Tianqiao Chen's Shanda Group  plans to increase its stake in the company to up to 15 percent.",
        "date": "12192016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "Shanda Group to increase stake in Legg Mason to up to 15 percent "
    },
    {
        "content": "* Board of directors has declared a quarterly cash dividend on its common stock in amount of $0.22 per share",
        "date": "10282016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports second fiscal quarter results "
    },
    {
        "content": "* Entered into a second amendment to the company's unsecured credit agreement  dated as of December 29  2015 - SEC filing",
        "date": "09072016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason entered into a second amendment to co's unsecured credit agreement "
    },
    {
        "content": "* Trian Fund Management L.P. dissolves shared share stake in Tiffany & Co",
        "date": "08122016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Trian Fund Management dissolves shared share stake in Tiffany & Co  Legg Mason "
    },
    {
        "content": "* Legg Mason reports assets under management and flows for July 2016",
        "date": "08102016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports assets under management and flows for July "
    },
    {
        "content": "NEW YORK/BOSTON  Aug 11 Legg Mason Inc's Bill Miller  whose mutual fund beat the S&P 500 handily for 15 consecutive years at the turn of the century  is riding off into the sunset after his recent lagging returns left a trail of disappointed investors.",
        "date": "08112016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "UPDATE 2-RPT-Legg Mason's Bill Miller leaves firm amid faded glory "
    },
    {
        "content": "NEW YORK/BOSTON Legg Mason Inc's Bill Miller  whose mutual fund beat the S&P 500 handily for 15 consecutive years at the turn of the century  is riding off into the sunset after his recent lagging returns left a trail of disappointed investors.",
        "date": "08112016",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "Legg Mason's Bill Miller leaves firm amid faded glory "
    },
    {
        "content": "NEW YORK  Aug 11 Legg Mason fund manager Bill Miller will leave the firm after 35 years  the Baltimore-based investment company said on Thursday.",
        "date": "08112016",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "CORRECTED-UPDATE 1-Veteran fund manager Bill Miller leaves Legg Mason after 35 years "
    },
    {
        "content": "NEW YORK  Aug 11 Veteran stock fund manager Bill Miller will leave Legg Mason after 35 years  the Baltimore-based investment company said on Thursday.",
        "date": "08112016",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "Bill Miller leaves Legg Mason after 35 years "
    },
    {
        "content": "* Miller  together with companies he controls  will own 100 percent of LMM",
        "date": "08112016",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "BRIEF-Bill Miller to acquire Legg Mason's stake in LMM LLC "
    },
    {
        "content": "* CEO Joseph Sullivan's FY 2016 total compensation was $10.2 million versus $10.6 million in FY 2015 - SEC filing",
        "date": "06152016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason CEO Joseph Sullivan's FY 2016 total compensation $10.2 mln - SEC filing "
    },
    {
        "content": "* Preliminary assets under management of $707.1 billion as of April 30   2016",
        "date": "05112016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason reports assets under management of $707.1 bln as of April 30 "
    },
    {
        "content": "* Shanda Media Limited reports 9.9 percent stake in Legg Mason Inc as of April 11  2016    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04212016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Shanda Media reports 9.9 pct stake in Legg Mason Inc "
    },
    {
        "content": "April 12 Nelson Peltz Had Previously Reported 9.96 Pct Stake In Legg Mason Inc As Of May 27  2015",
        "date": "04122016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Nelson Peltz cuts stake in Legg Mason to 0.48 pct "
    },
    {
        "content": "* Shanda Group makes long term strategic investment in Legg Mason",
        "date": "04122016",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "BRIEF-Shanda Group makes long term strategic investment in Legg Mason "
    },
    {
        "content": "* Says on March 31  2016  entered into a first amendment to company's unsecured credit agreement  dated as of December 29  2015",
        "date": "04012016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "BRIEF-Legg Mason enters first amendment to unsecured credit agreement - SEC Filing "
    },
    {
        "content": "NEW YORK  Jan 22 Legg Mason Inc said on Friday it bought a stake in a company re-engineering exchange-traded funds in the hope of improving the performance of the popular investment products.",
        "date": "01222016",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "Legg Mason gets a foothold in campaign to re-engineer ETFs "
    },
    {
        "content": "Global asset manager Legg Mason Inc  is in talks to buy a majority stake in real estate investment manager Clarion Partners LLC in a deal valuing the company at about $850 million  Bloomberg reported.",
        "date": "01052016",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "Legg Mason in talks to buy Clarion Partners: Bloomberg "
    },
    {
        "content": "Jan 4 Global asset manager Legg Mason Inc  is in talks to buy a majority stake in real estate investment manager Clarion Partners LLC in a deal valuing the company at about $850 million  Bloomberg reported.",
        "date": "01052016",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "Legg Mason in talks to buy Clarion Partners - Bloomberg "
    },
    {
        "content": "Nov 19 Private equity firm Lightyear Capital is looking to sell its majority stake in real estate investment manager Clarion Partners LLC for around $800 million  people familiar with the sales talks said this week.",
        "date": "11192015",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "REFILE-Most of real estate firm Clarion Partners on the block -sources "
    },
    {
        "content": "NEW YORK  June 28 Legg Mason Inc's share price does not fully reflect the asset manager's sharply improved financial prospects and could climb 20 percent or more over the next year  according to the June 29 edition of Barron's.",
        "date": "06282015",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "Legg Mason shares could gain another 20 pct or more - Barron's "
    },
    {
        "content": "March 11 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03112015",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "MOVES- BofA Merrill Lynch  William Blair  Baird "
    },
    {
        "content": "March 11 Asset manager Legg Mason Inc  said it appointed Ursula Schliessler as chief administrative officer  effective April.",
        "date": "03112015",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "MOVES-Legg Mason names Ursula Schliessler chief administrative officer "
    },
    {
        "content": "Feb 18 The following financial services industry appointments and departures were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "02182015",
        "name": "Legg Mason Inc",
        "news_type": "topStory",
        "symbol": "LM",
        "title": "MOVES-Legg Mason  Deutsche Asset & Wealth  Standard Life  Mercia "
    },
    {
        "content": "Feb 18 Asset manager Legg Mason Inc hired mutual fund company Vanguard Group's executives  Rick Genoni and Brandon Clark  to boost its exchange-traded funds business.",
        "date": "02182015",
        "name": "Legg Mason Inc",
        "news_type": "normal",
        "symbol": "LM",
        "title": "MOVES-Legg Mason builds out ETF business with two hires "
    }
]