[
    {
        "content": "* Says it will transfer search service related business to wholly owned new unit  which will be established on Nov. 8",
        "date": "09292017",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "BRIEF-Line to transfer search service related business to wholly owned new unit "
    },
    {
        "content": "* Appier announces Series C investment round with Softbank group  line corporation  Naver corporation  EDBI and AMTD Group",
        "date": "08302017",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "BRIEF-Appier announces series C investment round with Softbank  Line Corp  Naver Corp  EDBI and AMTD Group "
    },
    {
        "content": "TOKYO Japan's Line Corp said its number of monthly active users fell from the previous quarter  its first such decline  underscoring the messaging app operator's struggles to grow outside its home country since last year's high-profile IPO.",
        "date": "07262017",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "One year after IPO  Japanese chat app Line reports drop in user numbers "
    },
    {
        "content": "* Monthly active users fell by 2 mln from last qtr to 169 mln (Adds details of decline in average monthly users)",
        "date": "07262017",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "UPDATE 2-One year after IPO  Japanese chat app Line reports drop in user numbers "
    },
    {
        "content": "* Says it will transfer LINE Friends Store business to LINE Friends Japan  which will be established on Sept. 1",
        "date": "07262017",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "BRIEF-Line to transfer LINE Friends Store business to LINE Friends Japan "
    },
    {
        "content": "TOKYO  July 26 Japan's Line Corp posted a 39 percent jump in first-half profit  boosted by a transfer of assets.",
        "date": "07262017",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "Line Corp first-half profit jumps 39 percent  boosted by asset transfer "
    },
    {
        "content": "TOKYO Japanese messaging app operator Line Corp  announced on Wednesday it swung to a full-year net profit on the back of growth in advertising revenue  although operating profit undershot forecasts due to higher operating costs and payment settlement issues. | Video ",
        "date": "01262017",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "Japan's Line swings to full-year profit on higher ad revenue "
    },
    {
        "content": "TOKYO  Jan 25 Japanese messaging app operator Line Corp announced on Wednesday it swung to a full-year net profit on the back of growth in advertising revenue  although operating profit undershot forecasts due to higher operating costs and payment settlement issues.",
        "date": "01252017",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "Japan's Line swings to full-year profit on higher ad revenue "
    },
    {
        "content": "* New platform helps ad sales rise 66 pct   (Adds details  Q3 net profit and revenue calculations)",
        "date": "10262016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "UPDATE 1-Line Corp swings to third quarter net profit of 2.4 bln yen "
    },
    {
        "content": "TOKYO  Oct 26 Japanese messaging app operator Line Corp said on Wednesday it had swung to a net profit of 5.3 billion yen  ($50.8 million) for the first nine months of the year.",
        "date": "10262016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "Line Corp swings to nine-mth net profit of 5.3 bln yen "
    },
    {
        "content": "* Says co plans to invest 50 billion won in a South Korea-based firm Snow Corporation  and will hold a 25 percent stake in it up from 0 percent  in mid-Nov.",
        "date": "10172016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "BRIEF-Line to raise stake in Snow Corporation to 25 pct for 50 bln won "
    },
    {
        "content": "* Says it to acquire 2 220 000 ordinary shares (20 percent stake) of Yume No Machi Souzou Iinkai Co Ltd in the middle of October",
        "date": "10132016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "BRIEF-Line to buy 20 pct stake in Yume No Machi Souzou Iinkai for 4 bln yen "
    },
    {
        "content": "* Says the co to buy about 110 000 new shares of Snow Corp in its private placement  to raise stake in it to 25 percent from 0 percent",
        "date": "09292016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "BRIEF-Line Corp to raise 25 pct stake in Snow Corp via private placement "
    },
    {
        "content": "* Line Corp CFO says co is aiming for a net profit in 2016 - Nikkei   Source text - (http://s.nikkei.com/2aYb1f2)",
        "date": "08162016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "BRIEF-Line Corp's CFO says co is aiming for net profit in 2016 - Nikkei "
    },
    {
        "content": "TOKYO Japan's Line Corp   on Wednesday said soaring advertising revenue helped it swing into profit in the first half of the year  in the messaging app maker's first public earnings report since its billion-dollar stock market listing.",
        "date": "07272016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "Japan's Line Corp swings to first-half profit as ad revenue soars "
    },
    {
        "content": "* Pokemon GO a boon for the industry -CEO   (Adds CEO comments  details on advertising growth  Pokemon GO)",
        "date": "07272016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "UPDATE 2-Japan's Line Corp swings to H1 profit as ad revenue soars "
    },
    {
        "content": "Jul 27 (Reuters) Line Corporation CONSOLIDATED FINANCIAL HIGHLIGHTS (in billions of yen unless specified)                           6 months               6 months                                        ended Jun 30  2016     ended Jun 30  2015                                                 LATEST               YEAR-AGO                                             RESULTS                RESULTS                  Revenues                   67.31                  56.18                              ",
        "date": "07272016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "TABLE-Line -6-MTH group results (IFRS) "
    },
    {
        "content": "TOKYO  July 27 Japan's Line Corp  reporting earnings for the first time since listing  said net profit was 2.56 billion yen ($24.3 million) for the first half of the year.",
        "date": "07272016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "Line Corp books H1 net profit of 2.56 bln yen vs 5.29 bln yen loss year earlier "
    },
    {
        "content": "July 14 Shares of Japanese messaging app operator Line Corp soared as much as 36 percent in their U.S. market debut on Thursday  valuing the high-profile tech startup at $9.34 billion in the biggest tech IPO this year.",
        "date": "07142016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "Japanese chat app operator Line Corp soars in New York debut "
    },
    {
        "content": "TOKYO  July 13 Shares in Line Corp  traded at 3 800 yen in the grey market on Wednesday  market participants told Dealwatch  indicating a likely strong global listing later this week.",
        "date": "07132016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "Line Corp shares trade at 3 800 yen in grey market "
    },
    {
        "content": "* IPO pricing values firm at around $6.9 bln   (Recasts  adds trader's comments  context)",
        "date": "07112016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "UPDATE 2-Hunger for tech startups helps Japan's Line price IPO at top of range "
    },
    {
        "content": "TOKYO Japanese messaging app firm Line Corp priced its initial public offering at the top of its marketed range  putting it on track to raise as much as $1.3 billion and reflecting robust appetite for the world's biggest tech listing this year.",
        "date": "07112016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "Japan's Line prices IPO at top of the range  may raise up to $1.3 billion "
    },
    {
        "content": "TOKYO  July 11 Line Corp set the price for its initial public offering at the top of its marketing range  raising up to $1.3 billion  a regulatory filing showed on Monday  reflecting robust appetite for the Japanese messaging app firm.",
        "date": "07112016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "Japan's Line sets top price for up to $1.3 bln IPO "
    },
    {
        "content": "TOKYO Japan's Line Corp   saw its shares rocket on their Tokyo debut on Friday  extending a strong start in New York the day before  and taking the value of the messaging app firm to $8.6 billion in the year's biggest tech IPO. | Video ",
        "date": "07152016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "Japanese chat app Line soars in New York-Tokyo dual listing "
    },
    {
        "content": "* Ad-based growth key in Japan  Southeast Asia -CEO   (Adds CEO comments)",
        "date": "07152016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "UPDATE 4-Japanese chat app Line soars in New York-Tokyo dual listing "
    },
    {
        "content": "TOKYO  July 15 Japan's Nikkei posted its biggest weekly gain in 6-1/2 years after a fifth straight winning session on Friday  lifted by Wall Street's record run and a sagging yen  while newly-listed Line Corp ended 32 percent above its IPO price.",
        "date": "07152016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "Nikkei posts biggest weekly gain in 6-1/2 yrs; Line catapults on debut "
    },
    {
        "content": "TOKYO  July 15 Line Corp shares opened 48 percent above their IPO price in their Tokyo debut on Friday after the Japanese messaging app firm raised 115 billion yen ($1.1 billion) from a dual New York-Tokyo listing.",
        "date": "07152016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "Line shares debut in Tokyo 48 pct above IPO price "
    },
    {
        "content": "July 15 LINE Corp :  * Says it began listing on TSE first section on July 15  Source text in Japanese: https://goo.gl/mFcg3D Further company Coverage:    (Beijing Headline News) ",
        "date": "07152016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "BRIEF-LINE lists on TSE first section on July 15 "
    },
    {
        "content": "TOKYO  July 4 Line Corp has raised the tentative price range for its initial public offering with the IPO to be worth as much as $1.3 billion  a regulatory filing showed on Monday  in a sign of strong demand for shares of the Japanese messaging app firm.",
        "date": "07042016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "Line sets higher IPO price range  to raise up to $1.3 bln -filing "
    },
    {
        "content": "* Sees IPO price Of American Depositary Shares will be $28.50-$32.50 and IPO price of shares will be between ¥2 900 and ¥3 300 - SEC filing",
        "date": "07052016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "BRIEF-Line Corp sees IPO price of ADS will be $28.50-$32.50 "
    },
    {
        "content": "TOKYO Japan's Line Corp on Tuesday set a price range for a Tokyo share sale that could value the messaging app operator at up to $6.57 billion  indicating strong demand for a firm that pitched itself as a stable investment rather than quick-growing startup. | Video ",
        "date": "06292016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "Line's IPO price range indicates strong demand  values firm at up to $6.6 billion "
    },
    {
        "content": "* Sees IPO Of 35 mln shares of common stock in the form of shares or american depositary shares - SEC filing",
        "date": "06282016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "BRIEF-Line Corp sees IPO price of ADS shares between $26.50-$31.50 - SEC filing "
    },
    {
        "content": "* Interest strong from retail  foreign investors -sources   (Recasts  adds investor comment  context)",
        "date": "06282016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "UPDATE 2-Line's IPO price range indicates strong demand  values firm at up to $6.6 bln "
    },
    {
        "content": "* sets 2 700-3 200 yen tentative IPO price range versus 2 800 yen initial reference price - filing  Further company coverage:",
        "date": "06282016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "BRIEF-Line Corp sets 2 700-3 200 yen tentative IPO price range - filing "
    },
    {
        "content": "TOKYO  June 24 Japanese messaging app firm Line Corp said on Friday there is no change to the schedule for its upcoming dual listing following Britain's vote to leave the European Union.",
        "date": "06242016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "Japan's Line says no change to dual listing schedule following Brexit vote "
    },
    {
        "content": "TOKYO  June 28 Japanese messaging app operator Line Corp has set a tentative price range of 2 700 yen to 3 200 yen ($26 to $32) a share for an initial public offering (IPO) in Tokyo  Dow Jones reported on Tuesday  citing an unidentified source.",
        "date": "06282016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "Line Corp sets 2 700-3 200 yen tentative IPO price range -Dow Jones "
    },
    {
        "content": "TOKYO Japanese messaging app firm Line Corp has delayed setting a tentative price range for its initial public offering (IPO) by one day  until Tuesday  the company said in a regulatory filing  citing the \"market environment\".",
        "date": "06272016",
        "name": "LINE Corporation",
        "news_type": "topStory",
        "symbol": "LN",
        "title": "Line IPO range announcement delayed until Tuesday "
    },
    {
        "content": "TOKYO  June 26 In delaying its IPO by two years  Japanese messaging app company Line Corp bought time to correct weak financial reporting controls  work on its business plan  bolster staffing - and left billions of dollars on the table as its valuation shrivelled.",
        "date": "06262016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "Line  the biggest tech IPO of the year  struggles to show its growth plan can work "
    },
    {
        "content": "TOKYO  June 27 Japanese messaging app firm Line Corp has delayed setting a tentative price range for its initial public offering (IPO) by one day  until Tuesday  the company said in a regulatory filing  citing the \"market environment\".",
        "date": "06272016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "CORRECTED-UPDATE 1-Line IPO range announcement delayed until Tuesday - filing "
    },
    {
        "content": "TOKYO  June 27 Japanese messaging app firm Line Corp has delayed setting a tentative price range for its initial public offering (IPO) by one day  until Tuesday  a regulatory filing showed.",
        "date": "06272016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "Line IPO range announcement delayed until Tuesday - filing "
    },
    {
        "content": "TOKYO  June 26 In delaying its IPO by two years  Japanese messaging app company Line Corp bought time to correct weak financial reporting controls  work on its business plan  bolster staffing - and left billions of dollars on the table as its valuation shrivelled.",
        "date": "06272016",
        "name": "LINE Corporation",
        "news_type": "normal",
        "symbol": "LN",
        "title": "RPT-Line  the biggest tech IPO of the year  struggles to show its growth plan can work "
    }
]