[
    {
        "content": "ZURICH  Oct 24 Logitech Chief Executive Bracken Darrell said he felt confident about the company's third quarter - traditionally its biggest of the year - after the maker of peripherals for gaming consoles and PCs beat forecasts in its latest quarter.",
        "date": "10242017",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "Logitech CEO Darrell upbeat about Q3 prospects "
    },
    {
        "content": "* Logitech International- outlook for FY 2018 is 10 to 12 percent sales growth in constant currency and $260 to $270 million in non-GAAP operating income​",
        "date": "10242017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech reports Q2 non-GAAP earnings per share $0.40 "
    },
    {
        "content": "* Logitech acquires Astro Gaming Source text for Eikon: Further company coverage:",
        "date": "08122017",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech acquires Astro Gaming "
    },
    {
        "content": "ZURICH Logitech International raised its profit outlook for the year after strong sales of its gaming and video collaboration products helped the computer peripheral maker beat forecasts in its first quarter.",
        "date": "07252017",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "Logitech increases outlook after first-quarter beats forecasts "
    },
    {
        "content": "ZURICH  July 25 Logitech International raised its profit outlook for the year after strong sales of its gaming and video collaboration products helped the computer peripheral maker beat forecasts in its first quarter.",
        "date": "07252017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "UPDATE 1-Logitech increases outlook after Q1 beats forecasts "
    },
    {
        "content": "* Logitech CEO Bracken Darrell tells Reuters  strong q1 gave confidence to raise guidance",
        "date": "07252017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech CEO says strong q1 gave confidence to raise guidance "
    },
    {
        "content": "* Says Q1 sales were $530 million  up 13 percent in constant currency compared to Q1 of prior year",
        "date": "07252017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech delivers double-digit growth and raises outlook "
    },
    {
        "content": "* Logitech nominates two new directors to board; proposes 10% annual increase for FY17 dividend",
        "date": "06282017",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech proposes 10 percent increase in annual dividend for FY 2017 "
    },
    {
        "content": "ZURICH Logitech  has proposed raising its dividend by 10 percent to 0.62 Swiss francs per share  the computer peripherals and mobile speaker maker said on Thursday  after it reported its highest level of operating cash flow in seven years.",
        "date": "06292017",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "Logitech proposes 10 percent dividend hike "
    },
    {
        "content": "ZURICH  June 29 Logitech has proposed raising its dividend by 10 percent to 0.62 Swiss francs per share  the computer peripherals and mobile speaker maker said on Thursday  after it reported its highest level of operating cash flow in seven years.",
        "date": "06292017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Logitech proposes 10 pct dividend hike "
    },
    {
        "content": "LONDON  May 4 The McLaren Formula One team launched a virtual racing competition on Thursday with a real job as a simulator driver as the prize.",
        "date": "05042017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Motor racing-McLaren offer F1 simulator role for virtual racer "
    },
    {
        "content": "* Logitech cfo says sees growth in four of five markets in fy2018",
        "date": "04262017",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech CFO says restructuring is virtually done "
    },
    {
        "content": "ZURICH  April 26 Logitech is looking at acquisitions to accelerate growth and help expand into new product categories  Chief Executive Bracken Darrell said on Wednesday after the computer peripherals maker's fourth-quarter results beat forecasts.",
        "date": "04262017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Logitech looking at acquisitions after strong Q4 - CEO "
    },
    {
        "content": "* Logitech CEO says looking at small bolt-on acquisitions  strategy not dependent on them",
        "date": "04262017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech looking at small bolt-on acquisitions  strategy not dependent on them "
    },
    {
        "content": "* Fy 2017 gaap operating income grew 53 percent to $197 million",
        "date": "04262017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech qtrly earnings per share $0.15 "
    },
    {
        "content": "* Logitech International Sa - says 2018 outlook of high single-digit retail sales growth in constant currency and $250 to $260 million in non-gaap operating income.",
        "date": "03072017",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech reaffirms 2017 retail sales growth outlook "
    },
    {
        "content": "ZURICH Shares in computer peripherals maker Logitech  were indicated more than 12 percent higher on Wednesday after the company reported a jump in quarterly earnings and raised its outlook.",
        "date": "01252017",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "Logitech shares set to soar after third quarter earnings jump "
    },
    {
        "content": "ZURICH  Jan 25 Logitech International  Chief Executive Bracken Darrell said on Wednesday he plans to stay with the computer peripherals maker for the \"long haul\" after it reported record sales and profitability during its third quarter.",
        "date": "01252017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Logitech CEO says plans to stay put after record results "
    },
    {
        "content": "LONDON  Jan 25 European shares climbed higher on Wednesday  with strong updates from companies such as computer peripherals maker Logitech and Spain's Banco Santander  boosting the broader equity market.",
        "date": "01252017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "European shares climb higher as earnings brighten sentiment "
    },
    {
        "content": "LONDON  Jan 25 European shares climbed higher in early trading on Wednesday  with strong updates from companies such as computer peripherals maker Logitech and Spain's Banco Santander boosting the broader equity market.",
        "date": "01252017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "European shares up 1 pct as earnings brighten mood "
    },
    {
        "content": "* Logitech reports highest retail revenue in company's history",
        "date": "01252017",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech Q3 non-gaap earnings per share $0.56 "
    },
    {
        "content": "BARCELONA  Nov 16 Pioneering computer mouse maker Logitech isn't ready to walk away from the personal computer business just yet  even though its chief executive spends all his time these days thinking how to expand into faster-growing accessory markets.",
        "date": "11162016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Mouse-maker Logitech finds success by moving beyond PC legacy "
    },
    {
        "content": "* Q2 GAAP earnings per share $0.28 from continuing operations",
        "date": "10262016",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech International Q2 non-GAAP earnings per share $0.35 "
    },
    {
        "content": "* Mad Catz\u007f announces sale of Saitek\u007f Simulation product line to Logitech",
        "date": "09152016",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "BRIEF-Mad Catz reports sale of Saitek Simulation product line to Logitech "
    },
    {
        "content": "* Acquired Mad Catz interactive's Saitek(REG) brand  Saitek line of flight  space simulation game controller assets for $13 million in cash",
        "date": "09152016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech acquires Saitek Simulation product line from Mad Catz "
    },
    {
        "content": "* Logitech CEO Bracken Darrell tells Reuters his company is benefiting from growth in most categories  regions",
        "date": "07282016",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech CEO says confident company can reach new raised guidance "
    },
    {
        "content": "* Logitech International shares rise more than 8 percent after the company lifted its outlook for sales and operating income following better-than-expected financial results for the first quarter of fiscal year 2017.",
        "date": "07282016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Logitech shares jump after raises outlook "
    },
    {
        "content": "ZURICH  July 28 The Swiss blue-chip SMI  was seen opening 0.1 percent firmer at 8227 points on Thursday  according to premarket indications by bank Julius Baer .",
        "date": "07282016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Swiss stocks - Factors to watch on July 28 "
    },
    {
        "content": "* Accelerates with best retail sales growth in over five years  up 13%",
        "date": "07282016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech international Q1 Shr from cont ops $0.13 "
    },
    {
        "content": "NANJING  China  June 6 Chinese electronics retailer Suning Commerce Group Co Ltd is buying nearly 70 percent of Italian soccer club Inter Milan for 270 million euros ($307 million) in the highest profile takeover of a European team by a Chinese firm.",
        "date": "06062016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "UPDATE 3-China's Suning pays more than $300 million for control of Inter Milan "
    },
    {
        "content": "ZURICH Swiss-American technology accessories maker Logitech could benefit from a slowdown in the smartphone market  Chief Executive Bracken Darrell said on Thursday after it reported its best annual retail sales growth in five years.",
        "date": "04282016",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "Logitech CEO upbeat amid smartphone slowdown: CNBC "
    },
    {
        "content": "ZURICH  April 28 Swiss-American technology accessories maker Logitech could benefit from a slowdown in the smartphone market  Chief Executive Bracken Darrell said on Thursday after it reported its best annual retail sales growth in five years.",
        "date": "04282016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Logitech CEO upbeat amid smartphone slowdown - CNBC "
    },
    {
        "content": "* Logitech delivers best annual retail sales growth in five years",
        "date": "04282016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech International says Q4 sales $431 million "
    },
    {
        "content": "The U.S. Securities and Exchange Commission announced two fraud cases alleging that accounting failures left investors in the dark about the finances of computer accessories maker Logitech International SA and now-defunct electric car battery maker Ener1 Inc.",
        "date": "04192016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "SEC sets penalties in two corporate fraud cases "
    },
    {
        "content": "April 19 The U.S. Securities and Exchange Commission announced two fraud cases alleging that accounting failures left investors in the dark about the finances of computer accessories maker Logitech International SA   and now-defunct electric car battery maker Ener1 Inc.",
        "date": "04192016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "UPDATE 1-U.S. SEC sets penalties in two corporate fraud cases "
    },
    {
        "content": "April 19 The U.S. Securities and Exchange Commission announced two fraud cases alleging that accounting failures left investors in the dark about the finances of computer accessories maker Logitech International SA   and now-defunct electric car battery maker Ener1 Inc.",
        "date": "04192016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "U.S. SEC sets penalties in two corporate fraud cases "
    },
    {
        "content": "The U.S. Securities and Exchange Commission has sued two former executives of computer accessories maker Logitech International SA   accusing them of deceiving investors in 2011 by fraudulently concealing the poor performance of a failed TV set-top device.",
        "date": "04192016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "U.S. SEC sues two ex-Logitech executives for inflating results "
    },
    {
        "content": "April 19 The U.S. Securities and Exchange Commission has sued two former executives of computer accessories maker Logitech International SA   accusing them of deceiving investors in 2011 by inflating the results of an unsuccessful TV set-top device.",
        "date": "04192016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "SEC sues two ex-Logitech executives for inflating results "
    },
    {
        "content": "April 19 The U.S. Securities and Exchange Commission has sued two former executives of computer accessories maker Logitech International SA   accusing them of deceiving investors in 2011 by fraudulently concealing the poor performance of a failed TV set-top device.",
        "date": "04192016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "UPDATE 1-U.S. SEC sues two ex-Logitech executives for inflating results "
    },
    {
        "content": "* CEO: Restructuring complete; now 100 pct retail focused   (Recasts with outlook  CEO comments  stock action  details)",
        "date": "01212016",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "UPDATE 1-With restructuring done  Logitech raises 2016 outlook "
    },
    {
        "content": "LONDON  Jan 21 European equities steadied on Thursday after slumping in the previous session following a rout in commodities prices  with a strong rally in shares of companies such as Pearson and Logitech  underpinning the market.",
        "date": "01212016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "European shares steady after Wednesday's slump  Pearson jumps "
    },
    {
        "content": "LONDON  Jan 21 European shares advanced in early trading on Thursday after slumping in the previous session following a rout in commodities prices  with strong gains at Pearson and Logitech supporting the market.",
        "date": "01212016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "European shares rebound from lows  Pearson surges "
    },
    {
        "content": "Swiss-American technology accessories maker Logitech International  said late Wednesday its quarterly operating profit fell 1.5 percent  as strong year-end demand for newer music and video accessories failed to offset shrinking demand for computer add-ons.",
        "date": "01212016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Logitech third-quarter operating profit falls "
    },
    {
        "content": "Jan 20 Swiss-American technology accessories maker Logitech International said late Wednesday its quarterly operating profit fell 1.5 percent  as strong year-end demand for newer music and video accessories failed to offset shrinking demand for computer add-ons.",
        "date": "01212016",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Logitech third-qtr operating profit falls "
    },
    {
        "content": "* Opens up 3.7 percent  Source text for Eikon:  Further company coverage:",
        "date": "10222015",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech international sa opens up 3.7 percent "
    },
    {
        "content": "Swiss-American gadget maker Logitech International SA on Thursday posted a 2 percent drop in quarterly revenue  hurt by a strong dollar and falling demand for its computer accessories.",
        "date": "07232015",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "Logitech first-quarter revenue falls by 2 percent to $470 million "
    },
    {
        "content": "July 23 Swiss-American gadget maker Logitech International SA on Thursday posted a 2 percent drop in quarterly revenue  hurt by a strong dollar and falling demand for its computer accessories.",
        "date": "07232015",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "UPDATE 1-Logitech first-quarter revenue falls by 2 pct to $470 mln "
    },
    {
        "content": "July 23 Swiss-American gadget maker Logitech International SA on Thursday posted a 2 percent fall in quarterly revenue  hurt by a strong dollar and falling demand for its computer accessories.",
        "date": "07232015",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Logitech Q1 revenue falls by 2 pct to $470 mln "
    },
    {
        "content": "FRANKFURT  June 6 Swiss-American gadget maker Logitech has set aside $3.25 million to cover a potential civil penalty stemming from a previously disclosed investigation by U.S. securities regulators  the company said in a filing on Saturday.",
        "date": "06062015",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "REFILE-Logitech sets aside $3.25 mln to cover possible SEC penalty "
    },
    {
        "content": "FRANKFURT Gadget maker Logitech International SA said on Thursday quarterly operating profit fell 34 percent on steep currency declines and shrinking demand for accessories like the computer mouse on which it built its global brand name.",
        "date": "04232015",
        "name": "Logitech International SA",
        "news_type": "topStory",
        "symbol": "LOGI",
        "title": "Logitech moves away from computer mouse  looks to wireless "
    },
    {
        "content": "* Actions position firm for sustained sales growth  CEO says   (Updates shares  adds analyst quote)",
        "date": "04232015",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "UPDATE 3-Logitech moves away from computer mouse  looks to wireless "
    },
    {
        "content": "FRANKFURT  April 23 Gadget maker Logitech International SA said on Thursday quarterly operating profit fell 34 percent on steep currency declines and shrinking demand for accessories like the computer mouse on which it built its global brand name.",
        "date": "04232015",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "CORRECTED-UPDATE 2-Logitech moves away from computer mouse  looks to wireless "
    },
    {
        "content": "* CEO says plans to boost product prices in fiscal q1 to make up for forex moves",
        "date": "04232015",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "BRIEF-Logitech CEO eyes price increases to make up for forex moves "
    },
    {
        "content": "April 22 Swiss-American gadget maker Logitech International SA on Thursday posted a 33 percent decline in quarterly profits  as demand for new music and video game add-ons was not enough to offset falling demand for its computer accessories.",
        "date": "04232015",
        "name": "Logitech International SA",
        "news_type": "normal",
        "symbol": "LOGI",
        "title": "Logitech Q4 profit drops on slump in music  video game add-ons "
    }
]