[
    {
        "content": "SYDNEY  Oct 30 Asian shares climbed on Monda  as technology stocks were bolstered by solid earnings from U.S. stalwarts and on strong pre-orders for Apple's iPhone X  while oil hovered around a 2-year peak on concerns of tightening supplies.",
        "date": "10302017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "GLOBAL MARKETS-Asia shares get tech boost from Apple  crude near 2-year high "
    },
    {
        "content": "ISTANBUL  Oct 30 Here are news  reports and events that may affect Turkish financial markets on Monday.",
        "date": "10302017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "Turkey - Factors to Watch on Oct 30 "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd booked an 80 percent surge in quarterly profits just ahead of expectations  helped by strong demand for its screens used in high-end TV sets as well as mobile devices ahead of the year-end holidays.",
        "date": "10252017",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display third-quarter profit surges on year-end demand for TVs  mobile devices "
    },
    {
        "content": "* Q4 shipments to increase by a mid-single digit percent -CFO (Writes through and adds analyst comment)",
        "date": "10252017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 2-LG Display Q3 profit surges on year-end demand for TVs  mobile devices "
    },
    {
        "content": "SEOUL  Oct 25 South Korea's LG Display Co Ltd said third-quarter operating profit surged 81 percent from a year earlier on the back of a recovery in panel prices.",
        "date": "10252017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says Q3 operating profit rose on year to $519 mln "
    },
    {
        "content": "* President says \"no script  no theme\" for free conversation with executives",
        "date": "07272017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "REFILE-UPDATE 1-Happy hour? Craft beer  no ties as S.Korea's leader hosts business tycoons "
    },
    {
        "content": "SEOUL LG Display Co Ltd  outlined plans to invest $13.5 billion to boost output of organic light-emitting diode (OLED) screens over the next three years  aiming to cement its lead in big panels for TVs and make inroads against rival Samsung in smartphone displays.",
        "date": "07252017",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display to take on Samsung as it lifts OLED investment "
    },
    {
        "content": "SEOUL  July 27 Craft beer and finger food will replace a full-course meal when South Korean President Moon Jae-in plays host to corporate tycoons on Thursday and Friday for the first time since his election in May.",
        "date": "07272017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "Happy hour? Craft beer  no ties as S.Korea’s leader hosts business tycoons "
    },
    {
        "content": "* Also plans to invest in China OLED production (Recasts and adds analyst comment  rivalry with Samsung)",
        "date": "07252017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 2-LG Display to take on Samsung as it lifts OLED investment "
    },
    {
        "content": "SEOUL  July 25 South Korea's LG Display Co Ltd said on Tuesday it will invest 7.8 trillion won ($7 billion) in production facilities to make both large and small organic light-emitting diode (OLED) panels.",
        "date": "07252017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display to invest $7 bln in OLED production  Q2 profit jumps "
    },
    {
        "content": "SEOUL  June 12 Shares of major South Korean technology companies were broadly lower on Monday  hurt by weaker investor sentiment following a selloff in the U.S. tech sector on Friday amid concerns about sales of Apple Inc's new iPhones.",
        "date": "06122017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "S.Korea tech shares broadly weaker as U.S. selloff hurts sentiment "
    },
    {
        "content": "* Tensions grow between U.S. and N.Korea over missile program",
        "date": "04282017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "RPT-Investors  South Korean tech suppliers brush off N.Korea threat "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd  on Wednesday posted record quarterly profit of 1.03 trillion won ($915.08 million) in the January-March period  beating market expectations on demand for large television panels.",
        "date": "04262017",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display books record quarterly profit on demand for large TV panels "
    },
    {
        "content": "SEOUL  April 26 South Korea's LG Display Co Ltd said on Wednesday that capital expenditure for this year could be higher than previously planned  due to rising demand for new technology development.",
        "date": "04262017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says 2017 capex could be higher than planned "
    },
    {
        "content": "SEOUL  April 26 South Korea's LG Display Co Ltd said on Wednesday its first-quarter operating profit rose to 1.03 trillion won($915.08 million) from 39.5 billion won a year earlier  beating market expectations  as healthy demand for large-sized television panels boosted margins.",
        "date": "04262017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says Q1 operating profit rose to 1 trln won "
    },
    {
        "content": "SEOUL Google Inc has offered to invest at least 1 trillion won ($880.29 million) to help South Korea's LG Display Co Ltd  boost output of organic light-emitting diode (OLED) screens for smartphones  the Electronic Times reported on Monday citing unnamed sources.",
        "date": "04102017",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "Google offers at least $880 million to LG display for OLED investment: Electronic Times "
    },
    {
        "content": "SEOUL  April 10 Google Inc has offered to invest at least 1 trillion won  ($880.29 million) to help South Korea's LG Display Co Ltd boost output of organic light-emitting diode (OLED) screens for smartphones  the Electronic Times reported on Monday citing unnamed sources.",
        "date": "04102017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "Google offers at least $880 mln to LG display for OLED investment-Electronic Times "
    },
    {
        "content": "* Says it signed 7.87 billion won contract with LG Display Co Ltd to provide laser manufacturing equipment",
        "date": "03132017",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "BRIEF-LIS signs 7.87 bln won contract with LG Display "
    },
    {
        "content": "SEOUL  Jan 24 South Korea's LG Display Co Ltd  said on Tuesday it reported a record fourth-quarter operating profit of 904.3 billion won ($778.33 million) due to a pickup in panel prices.",
        "date": "01262017",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "CORRECTED-UPDATE 1-LG Display reports record Q4 profits; panel prices seen rising further "
    },
    {
        "content": "* Says expects 2017 capital expenditure to be mid-5 trln won  Further company coverage:    (Reporting by Joyce Lee)",
        "date": "01242017",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "BRIEF-LG Display expects 2017 capex to be around 5.5 trln won "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd  said on Tuesday it reported a record fourth-quarter operating profit of 904.3 billion won ($778.33 million) due to a pickup in panel prices.",
        "date": "01242017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display reports record fourth-quarter profits; panel prices seen rising further "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd said on Tuesday its fourth-quarter operating profit rose 180 percent from a year earlier in its largest quarterly profit ever  due to a pickup in panel prices.",
        "date": "01232017",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display reports record fourth quarter profit of $778 million "
    },
    {
        "content": "SEOUL  Jan 24 South Korea's LG Display Co Ltd  said on Tuesday its fourth-quarter operating profit rose 180 percent from a year earlier in its largest quarterly profit ever  due to a pickup in panel prices.",
        "date": "01232017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display reports record 4th qtr profit of $778 mln "
    },
    {
        "content": "SEOUL  Jan 24 South Korea's LG Display Co Ltd  said on Tuesday its 2016 operating profit fell 19 percent from a year earlier.",
        "date": "01232017",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says 2016 profit $1.1 bln  down 19 pct on year "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd said it was in talks with Samsung Electronics Co Ltd about a supply agreement for television display panels.",
        "date": "01052017",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display in talks to supply LCD TV panels to Samsung Elec "
    },
    {
        "content": "SEOUL Samsung Electronics Co Ltd is in talks with South Korea's LG Display Co Ltd about a potential liquid crystal display (LCD) panel supply deal for televisions  South Korea's Yonhap News Agency reported on Wednesday.",
        "date": "01042017",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "Samsung Electronics in talks with LG Display for LCD panel supply: Yonhap "
    },
    {
        "content": "* Says LG Display Co.  Ltd has sold 1.0 million shares of the company  decreasing its stake down to 0 percent from 10.2 percent",
        "date": "11252016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "BRIEF-LG Display sells its entire 10.2 pct stake in TLI "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd  on Wednesday said it expects strong fourth-quarter earnings as the Apple Inc  supplier tipped growth in shipments of medium-to-small sized panels to a key client it would not name.",
        "date": "10262016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "Apple supplier LG Display tips strong fourth-quarter  flags order pickup from key client "
    },
    {
        "content": "* LG says expects Q4 profit to \"improve significantly\"   (Updates with comments from LG Display  background on Apple)",
        "date": "10262016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 2-Apple supplier LG Display tips strong Q4  flags order pickup from key client "
    },
    {
        "content": "* Says it aims to record operating profit from its OLED panel business by 2019",
        "date": "10262016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "BRIEF-Lg Display says Q4 total production capacity to be similar to Q3 "
    },
    {
        "content": "SEOUL  Oct 26 South Korea's LG Display Co Ltd  said on Wednesday it expects medium-to-small size display panel shipments for a key client to rise in the fourth quarter.",
        "date": "10262016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says its Q4 panel shipments to a key client to rise "
    },
    {
        "content": "SEOUL  Oct 26 South Korea's LG Display Co Ltd  said on Wednesday its third-quarter operating profit fell 2.9 percent from a year earlier  beating market expectations.",
        "date": "10262016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display Q3 profit down 2.9 pct vs year earlier "
    },
    {
        "content": "* To launch in S.Korea at September-end  no pricing given   (Adds LG comment  context)",
        "date": "09072016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 1-LG Electronics seeks to revive mobile arm with new V20 smartphone "
    },
    {
        "content": "* Says exchange rate volatility was a major factor for profits",
        "date": "07272016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "BRIEF-LG Display expects Q3 profits to rise vs Q2 "
    },
    {
        "content": "SEOUL  July 27 South Korea's LG Display Co Ltd  said on Wednesday its second-quarter operating profit fell 91 percent from a year earlier  as weak demand for gadgets such as smartphones hurt panel prices  though the result was in line with expectations.",
        "date": "07272016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says Q2 profit down 91 pct vs year earlier "
    },
    {
        "content": "PAJU  South Korea  July 13 South Korea's LG Display Co Ltd is seeing signs of improvement in the display panel industry and expects its business performance to pick up in the second half of the year  the firm's chief executive said.",
        "date": "07132016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display sees signs of display market improvement "
    },
    {
        "content": "* Says it signed contract with LG Display Co.  Ltd.  to provide FPD manufacture equipment",
        "date": "06132016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "BRIEF-ICD signs contract with LG Display "
    },
    {
        "content": "TOKYO  June 16 A glimmer of light for Japan's battered electronics sector: while Sharp Corp and Japan Display Inc lag South Korean rivals in making organic light emitting diode (OLED) screens  some smaller Japanese equipment makers are booming in niche areas further up the OLED manufacturing process.",
        "date": "06152016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "As Sharp  Japan Display struggle  smaller Japan tech firms thrive in OLED niche "
    },
    {
        "content": "* Says it will pay cash dividend of 0.6 yuan per 10 shares (before tax) to shareholders for 2015 as a record of June 16",
        "date": "06092016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "BRIEF-Inspur software to pay 2015 dividend payment on June 17 "
    },
    {
        "content": "* Says it signs a contract with LG Display Co.  Ltd.  to supply display manufacturing equipment",
        "date": "05242016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "BRIEF-JUSUNG ENGINEERING signs contract with LG Display "
    },
    {
        "content": "* Says it does not plan equity offerings to fund future investments  Further company coverage:    (Reporting By Se Young Lee)",
        "date": "04272016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "BRIEF-LG Display says it expects Q2 mobile panel sales growth "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd said on Wednesday its first-quarter operating profit fell 95 percent from a year earlier  beating market expectations but still the weakest in four years as soft tech demand hit display panel prices.",
        "date": "04272016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display first-quarter down 95 percent vs year ago  but beats forecast "
    },
    {
        "content": "* LG Display Q1 operating profit $34 mln  better than expected",
        "date": "04272016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 1-LG Display Q1 down 95 pct vs year ago  but beats forecast "
    },
    {
        "content": "SEOUL  April 27 South Korea's LG Display Co Ltd  said on Wednesday its first-quarter operating profit fell 95 percent from a year earlier  its weakest result in four years as sluggish global demand for consumer electronics hit display panel prices.",
        "date": "04272016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says Q1 profit down 95 pct vs year earlier "
    },
    {
        "content": "SEOUL/HANOI  April 7 South Korea's LG Display Co Ltd will invest $1.5 billion in Vietnam to build its first organic light emitting diode (OLED) screens plant  aiming to start production in the second half of 2017  the company and Vietnamese authorities said.",
        "date": "04072016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "UPDATE 1-LG Display to build $1.5 bln OLED screens plant in Vietnam "
    },
    {
        "content": "SEOUL LG Display will supply information displays for Tesla Motors' new Model 3 sedans  a person with direct knowledge of the matter said  grabbing a key contract for center consoles from another supplier.",
        "date": "04012016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display to supply car displays for Tesla Model 3: source "
    },
    {
        "content": "SEOUL  April 1 LG Display will supply information displays for Tesla Motors' new Model 3 sedans  a person with direct knowledge of the matter said  grabbing a key contract for centre consoles from another supplier.",
        "date": "04012016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display to supply car displays for Tesla Model 3 - source "
    },
    {
        "content": "SEOUL  March 17 Consumer electronics screen maker LG Display Co Ltd said on Thursday it will build a new production plant that will manufacture organic light-emitting diode panels for its lighting business in South Korea.",
        "date": "03172016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says to invest in new OLED lighting panel plant "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd said the pace of decline in the average selling price of panels will slow in the first quarter of this year compared with fourth-quarter 2015  though shipments are also expected to decline.",
        "date": "01272016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display says pace of panel price decline to slow in first-quarter 2016 vs. fourth-quarter 2015 "
    },
    {
        "content": "SEOUL  Jan 27 South Korea's LG Display Co Ltd  said the pace of decline in the average selling price of panels will slow in the first quarter of this year compared with fourth-quarter 2015  though shipments are also expected to decline.",
        "date": "01272016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says pace of panel price decline to slow in Q1 2016 vs Q4 2015 "
    },
    {
        "content": "SEOUL  Jan 27 South Korea's LG Display Co Ltd  forecast demand for its panels to remain weak in the first-quarter  citing uncertainties in the global economy.",
        "date": "01272016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "RPT-LG Display says panel demand to remain weak in Q1 "
    },
    {
        "content": "SEOUL  Jan 27 South Korea's LG Display Co Ltd  forecast demand for its panels to remain weak in the first-quarter  citing uncertainties in the global economy.",
        "date": "01272016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says panel demand to remain weak in Q1 "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd  said its fourth-quarter operating profit slid 90 percent from a year earlier  missing market expectations  as weak demand for consumer electronics weighed on panel prices.",
        "date": "01262016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display Q4 profit tumbles to lowest in nearly four years as panel demand weakens "
    },
    {
        "content": "* Weaker global economy undercutting display panel prices   (Updates with background  LG Display's OLED investment plans)",
        "date": "01262016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 1-LG Display Q4 profit tumbles to lowest in nearly four years as panel demand weakens "
    },
    {
        "content": "SEOUL  Jan 26 South Korea's LG Display Co Ltd  said on Tuesday it will invest 460 billion won ($380 million) to boost production of large organic light-emitting diode (OLED) display panels for televisions.",
        "date": "01262016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display to invest $380 mln in large OLED panel production "
    },
    {
        "content": "SEOUL  Jan 26 South Korea's LG Display Co Ltd  said its fourth-quarter operating profit slid 90 percent from a year earlier  missing market expectations  as weak demand for consumer electronics weighs on panel prices.",
        "date": "01262016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display Q4 operating profit tumbles 90 pct vs year earlier "
    },
    {
        "content": "* March quarter iPhone sales almost certain to show first annual drop-analysts",
        "date": "01222016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "Fewer orders at Apple suppliers could signal first iPhone sales decline "
    },
    {
        "content": "SEOUL South Korean consumer electronics supplier LG Display Co Ltd expects earnings to improve starting in the second quarter of the year  despite challenging business conditions for the January-March period  the company's chief executive said.",
        "date": "01062016",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display says expects earnings to rebound starting in second-quarter "
    },
    {
        "content": "SEOUL  Jan 6 South Korean consumer electronics supplier LG Display Co Ltd expects earnings to improve starting in the second quarter of the year  despite challenging business conditions for the January-March period  the company's chief executive said.",
        "date": "01062016",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says expects earnings to rebound starting in Q2 "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd and the panel-making unit of Samsung Electronics Co Ltd will supply organic light emitting diode (OLED) screens for Apple Inc's iPhones  the Electronic Times reported on Wednesday citing unnamed sources.",
        "date": "12302015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display  Samsung Display to supply OLED screens for iPhones - report "
    },
    {
        "content": "SEOUL  Dec 30 South Korea's LG Display Co Ltd  and the panel-making unit of Samsung Electronics Co Ltd will supply organic light emitting diode (OLED) screens for Apple Inc's iPhones  the Electronic Times reported on Wednesday citing unnamed sources.",
        "date": "12302015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 1-LG Display  Samsung Display to supply OLED screens for iPhones -report "
    },
    {
        "content": "SEOUL  Dec 30 South Korea's LG Display Co Ltd  and panel-making subsidiary of Samsung Electronics Co Ltd will supply organic light emitting diode (OLED) screens for Apple Inc's iPhones  the Electronic Times reported on Wednesday citing unnamed sources.",
        "date": "12302015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display  Samsung Display to supply OLED screens to Apple iPhones-report "
    },
    {
        "content": "SEOUL South Korea's LG Display said it will invest more than 10 trillion won ($8.71 billion) to build a large plant to make panels using organic light-emitting diode (OLED) panels  raising its big bet on the ultra-clear display technology.",
        "date": "11272015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "South Korea's LG Display to invest $8.7 billion in new OLED plant "
    },
    {
        "content": "SEOUL  Nov 27 South Korea's LG Display  said it will build a new plant to make panels using organic light-emitting diode (OLED) technology  with total investment expected to exceed 10 trillion won ($8.71 billion).",
        "date": "11262015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display to invest $8.7 billion in new OLED plant "
    },
    {
        "content": "SEOUL  Nov 27 South Korea's LG Display  said it will invest more than 10 trillion won ($8.71 billion) to build a large plant to make panels using organic light-emitting diode (OLED) panels  raising its big bet on the ultra-clear display technology.",
        "date": "11272015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 1-South Korea's LG Display to invest $8.7 bln in new OLED plant "
    },
    {
        "content": "* Expects investment will be completed by Q2  2018  Source text in Korean: http://bit.ly/21iHnHk Further company coverage:    (Reporting by Hooyeon Kim)",
        "date": "11262015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "BRIEF-LG Display says to invest 1.84 trillion won in new facilities "
    },
    {
        "content": "SEOUL  Nov 19 The world's No.2 TV maker  South Korea's LG Electronics Inc  is betting that chopping prices almost in half before the U.S. year-end holiday season will create enough buzz to push its next-generation TV technology mainstream.",
        "date": "11182015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Elec seeks U.S. prime time for next-gen TV "
    },
    {
        "content": "SEOUL  Oct 22 South Korea's LG Display Co Ltd   the world's biggest maker of liquid crystal display (LCD) panels  said third-quarter profit slid 30 percent  missing estimates  citing broadly weaker demand for consumer electronics devices.",
        "date": "10222015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "UPDATE 1-LG Display Q3 profit skids 30 pct as appliance makers' panel demand slows "
    },
    {
        "content": "SEOUL  Oct 22 South Korea's LG Display Co Ltd  said on Thursday its third-quarter operating profit fell 29.8 percent from a year earlier  missing market expectations  as slowing demand for consumer electronics products hurt panelmakers' pricing power.",
        "date": "10222015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says Q3 profit down nearly 30 pct vs year earlier "
    },
    {
        "content": "* Sister firm LG Display already a major car display supplier",
        "date": "08212015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "CORRECTED-UPDATE 1-LG Elec to supply auto displays to Honda  Porsche - source "
    },
    {
        "content": "* Says business conditions to be more challenging next year  but will be manageable  Further company coverage:    (Reporting By Se Young Lee)",
        "date": "08172015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "BRIEF-LG Display says 2016 business condition challenging but manageable "
    },
    {
        "content": "* Says considering additional investment for large OLED panel production",
        "date": "08132015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "BRIEF-LG Display says considering investment for large OLED panels  no decision yet "
    },
    {
        "content": "* Says considering additional investment for large-size OLED panel production",
        "date": "08172015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "RPT-BRIEF-LG Display plans to invest in new large-size OLED panel plant "
    },
    {
        "content": "* Says considering additional investment for large-size OLED panel production",
        "date": "08172015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "BRIEF-LG Display plans to invest in new large-size OLED panel plant "
    },
    {
        "content": "SEOUL  Aug 17 South Korea's LG Display Co Ltd  said on Monday it would focus investment on organic light-emitting diode (OLED) displays  betting on the next-generation technology to steer it clear of price wars and ahead of the competition.",
        "date": "08172015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display to focus investment on OLED in next-generation push "
    },
    {
        "content": "SEOUL LG Display Co Ltd  said on Thursday it will invest nearly $1 billion to build a fourth organic light-emitting diode (OLED) display factory  pinning its future firmly on the high-end next-generation technology.",
        "date": "07232015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display to build OLED plant; second-quarter profit beats estimates "
    },
    {
        "content": "* To build plant for small  mid-sized OLED screens in South Korea",
        "date": "07232015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 2-LG Display to build OLED plant; Q2 profit beats estimates "
    },
    {
        "content": "SEOUL  July 23 South Korea's LG Display Co Ltd  said on Thursday that operating profit for the April-June quarter nearly tripled from a year earlier  beating expectations on panel sales for large-sized televisions and mobile products.",
        "date": "07232015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display Q2 profit beats expectations  shares rebound "
    },
    {
        "content": "* Firm supplies OLED screens to Apple  LG Electronics   (Updates with details on new investment  background)",
        "date": "07222015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "UPDATE 1-LG Display to spend $908 mln for new plastic OLED plant "
    },
    {
        "content": "SEOUL  July 23 South Korea's LG Display Co Ltd  said on Thursday that it will invest 1.05 trillion won ($908.11 million) to boost capacity for plastic organic light-emitting diode displays to be used for smartphones  cars and foldable screens.",
        "date": "07222015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says to invest 1.05 trln won to boost plastic OLED production "
    },
    {
        "content": "SEOUL  July 6 South Korea's LG Display Co Ltd  is considering investments related to organic light-emitting diode display technology  the firm said on Monday  following a media report that it plans to spend up to 900 billion won ($800.04 million) for a new production plant.",
        "date": "07062015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display says considering OLED display investment "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd plans to invest up to 900 billion won ($802.75 million) to build a new production line for small- and medium-sized organic light emitting diode (OLED) displays  the DongA Ilbo newspaper reported on Monday.",
        "date": "07062015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display to invest up to $803 million for new OLED panel line: newspaper "
    },
    {
        "content": "SEOUL  July 6 South Korea's LG Display Co Ltd  plans to invest up to 900 billion won ($802.75 million) to build a new production line for small- and medium-sized organic light emitting diode (OLED) displays  the DongA Ilbo newspaper reported on Monday.",
        "date": "07062015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display to invest up to $803 mln for new OLED panel line - DongA Ilbo "
    },
    {
        "content": "SEOUL  June 5 Shares of LG Display Co Ltd  fell sharply in early trade on Friday  hitting their lowest point in almost a year  after data from researcher DisplaySearch showed industry-wide display panel prices were broadly lower.",
        "date": "06052015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display shares hit lowest in almost a year after fall in panel prices "
    },
    {
        "content": "BRUSSELS  April 23 The European Court of Justice upheld on Thursday a 210 million euro ($224.8 million) fine imposed on South Korea's LG Display for participating in a cartel of LCD panel makers between 2001 and 2006.",
        "date": "04232015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "EU court upholds LCD panel cartel fine for LG Display "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd  downplayed risks of a supply glut in the global panel market after reporting its best quarterly profit in more than four years  seeking to assuage fear about a sharp profit decline later this year.",
        "date": "04222015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display books four-year-high profit  downplays supply glut fear "
    },
    {
        "content": "* CFO says severe oversupply problems unlikely   (Recasts; adds comments from LG Display  context)",
        "date": "04222015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 2-LG Display books 4-year-high profit  downplays supply glut fear "
    },
    {
        "content": "SEOUL  April 22 South Korea's LG Display Co Ltd  on Wednesday said it does not expect any major oversupply of display panels though market-watchers have expressed growing concern about the declining business environment of television set makers.",
        "date": "04222015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says does not expect major panel oversupply issue "
    },
    {
        "content": "* Q2 shipments seen growing by low-to-mid single digit pct vs Q1",
        "date": "04222015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "CORRECTED-UPDATE 1-LG Display Q1 profit at 4-year high  buoyed by sales at client Apple "
    },
    {
        "content": "SEOUL  April 22 South Korea's LG Display Co Ltd  said on Wednesday that January-March operating profit was up nearly eight times from a year earlier  beating market expectations on healthy television panel sales and orders from key client Apple Inc.",
        "date": "04222015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display Q1 operating profit 744 bln won  beats estimates "
    },
    {
        "content": "* LG executive accused of deliberately damaging Samsung machines",
        "date": "02152015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "UPDATE 2-LG Electronics executive indicted over damaged Samsung washers "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd  said on Wednesday that its 2014 operating profit rose 16.7 percent from a year earlier  as the company benefited from a pickup in demand for television sets and launch of Apple Inc's  new iPhones.",
        "date": "01272015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display says 2014 operating profit up 16.7 percent on year "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd reported on Wednesday its highest quarterly profit in almost four years  buoyed by robust demand for liquid crystal displays (LCDs) from television makers and client Apple Inc.",
        "date": "01282015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "LG Display Q4 profit at four-year high  2015 growth seen strong "
    },
    {
        "content": "SEOUL  Jan 28 South Korea's LG Display Co Ltd  said on Wednesday that its 2014 operating profit rose 16.7 percent from a year earlier  as the company benefited from a pickup in demand for television sets and launch of Apple Inc's new iPhones.",
        "date": "01272015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says 2014 operating profit up 16.7 pct on year "
    },
    {
        "content": "* Q4 operating profit 625.8 bln won vs 623 bln won analyst view",
        "date": "01282015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "UPDATE 2-LG Display Q4 profit at four-year high  2015 growth seen strong "
    },
    {
        "content": "SEOUL  Jan 28 South Korea's LG Display Co Ltd  said on Wednesday that it will pay an end-2014 dividend of 500 won ($0.46) per common share  marking the display panel maker's first such payout in four years.",
        "date": "01272015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display says to pay first dividend in 4 years "
    },
    {
        "content": "SEOUL South Korea's LG Display Co Ltd said on Wednesday that profit in the first quarter would decline from the preceding quarter  as the display maker enters a seasonally weak period for consumer electronics products.",
        "date": "01282015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display sees first quarter profit falling from fourth quarter on seasonally weak demand "
    },
    {
        "content": "SEOUL  Jan 28 South Korea's LG Display Co Ltd  said on Wednesday that profit in the first quarter would decline from the preceding quarter  as the display maker enters a seasonally weak period for consumer electronics products.",
        "date": "01282015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display sees Q1 profit falling from Q4 on seasonally weak demand "
    },
    {
        "content": "SEOUL  Jan 14 South Korea's labour ministry has ordered LG Display Co Ltd to halt operations of an organic light-emitting diode (OLED) panel production line following a nitrogen gas leak.",
        "date": "01142015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display ordered to halt operations at OLED TV panel line "
    },
    {
        "content": "* LG to more than quadruple monthly OLED TV panel capacity",
        "date": "01062015",
        "name": "LG Display Co Ltd",
        "news_type": "topStory",
        "symbol": "LPL",
        "title": "CORRECTED-UPDATE 2-LG Display presses on with OLED TV despite doubts "
    },
    {
        "content": "SEOUL  Jan 6 Shares in LG Display Co Ltd   South Korea's largest display maker  rose more than 5 percent on Tuesday morning  bucking the decline in the broader market  as several brokerages tipped a positive outlook for the sector in the first quarter.",
        "date": "01062015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display shares jump more 5 pct on Q1 outlook "
    },
    {
        "content": "SEOUL  Jan 6 South Korea's LG Display Co Ltd  said on Tuesday that it plans to more than quadruple its monthly production capacity for organic light-emitting diode panels for televisions by the year-end.",
        "date": "01062015",
        "name": "LG Display Co Ltd",
        "news_type": "normal",
        "symbol": "LPL",
        "title": "LG Display plans sharp OLED TV panel production capacity growth in 2015 "
    }
]