[
    {
        "content": "* Sees Q4 same store net operating income of negative 1.00 percent to 0.00 pct‍​",
        "date": "11012017",
        "name": "Life Storage Inc",
        "news_type": "topStory",
        "symbol": "LSI",
        "title": "BRIEF-Life Storage Inc reports Q3 FFO per share of $1.34 "
    },
    {
        "content": "* Life Storage Inc names Joseph V. Saffire chief investment officer; Paul T. Powell to retire",
        "date": "11012017",
        "name": "Life Storage Inc",
        "news_type": "normal",
        "symbol": "LSI",
        "title": "BRIEF-Life Storage Inc names Joseph V. Saffire chief investment officer "
    },
    {
        "content": "* Life Storage Inc appoints Carol Hansell to the board of directors Source text for Eikon: Further company coverage:",
        "date": "11012017",
        "name": "Life Storage Inc",
        "news_type": "normal",
        "symbol": "LSI",
        "title": "BRIEF-Life Storage Inc appoints Carol Hansell to the board of directors "
    },
    {
        "content": "* Has received a request for admission to trading from Self Storage Group ASA",
        "date": "10162017",
        "name": "Life Storage Inc",
        "news_type": "topStory",
        "symbol": "LSI",
        "title": "BRIEF-Self Storage Group applies for Oslo listing "
    },
    {
        "content": "* Life Storage Inc provides update on Hurricanes Irma and Harvey",
        "date": "09142017",
        "name": "Life Storage Inc",
        "news_type": "topStory",
        "symbol": "LSI",
        "title": "BRIEF-Life Storage provides update on Hurricanes Irma and Harvey "
    },
    {
        "content": "* Life Storage  Inc. reports second quarter 2017 results; announces $200 million share repurchase program; adjusts 2017 guidance",
        "date": "08022017",
        "name": "Life Storage Inc",
        "news_type": "topStory",
        "symbol": "LSI",
        "title": "BRIEF-Life Storage Q2 FFO per share $1.24 "
    },
    {
        "content": "* Life Storage Inc announces acquisition of 18 properties through a joint venture",
        "date": "06052017",
        "name": "Life Storage Inc",
        "news_type": "topStory",
        "symbol": "LSI",
        "title": "BRIEF-Life Storage Inc announces acquisition of 18 properties through a joint venture "
    },
    {
        "content": "* Announced increase in quarterly common stock dividend from $0.95 per share to $1.00 per share or $3.80 to $4.00 annualized Source text for Eikon: Further company coverage:",
        "date": "04052017",
        "name": "Life Storage Inc",
        "news_type": "topStory",
        "symbol": "LSI",
        "title": "BRIEF-Life Storage raises quarterly common stock dividend "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 01 (Fitch) Fitch Ratings plans to withdraw Life Storage  Inc.'s  ratings on or about April 3  2017 (approximately 30 days from the date of this  release) for commercial reasons. Fitch currently rates Life Storage Inc. and its subsidiaries as follows: Life Storage Inc. --Issuer Default Rating (IDR) 'BBB'; --Unsecured revolving credit facility 'BBB'; --Unsecured term notes 'BBB'. Life Storage LP --IDR 'BBB'; --Unsecured re",
        "date": "03012017",
        "name": "Life Storage Inc",
        "news_type": "topStory",
        "symbol": "LSI",
        "title": "Fitch Plans to Withdraw Life Storage  Inc.'s Ratings "
    },
    {
        "content": "Feb 10 Security Capital Research & Management Inc",
        "date": "02102017",
        "name": "Life Storage Inc",
        "news_type": "topStory",
        "symbol": "LSI",
        "title": "BRIEF-Security Capital Research & Management reports a 5.5 percent passive stake in Life Storage as of December 30  2016 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 14 (Fitch) Fitch Ratings has removed the Rating Watch  Negative on the 'BBB' Long-Term Issuer Default Rating (IDR) of Life Storage   Inc. (LSI) and its operating partnership  Life Storage LP. Fitch has affirmed  the 'BBB' IDR and assigned a Negative Outlook. A full list of rating actions  follows at the end of this release.  KEY RATING DRIVERS The Negative Outlook reflects that while the issuer has resolved the liquid",
        "date": "11142016",
        "name": "Life Storage Inc",
        "news_type": "topStory",
        "symbol": "LSI",
        "title": "Fitch Removes Life Storage from Rating Watch Negative; Assigns Negative Outlook "
    },
    {
        "content": "* Sees revenue for full year 2016 increase between 5.0% - 6.0%",
        "date": "11022016",
        "name": "Life Storage Inc",
        "news_type": "topStory",
        "symbol": "LSI",
        "title": "BRIEF-Life Storage reports third quarter results "
    }
]