[
    {
        "content": "* LIBERTY MEDIA CHAIRMAN JOHN MALONE SAYS HAD 4 APPROACHES FOR CHARTER - CNBC",
        "date": "11162017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media Chairman Malone says had 4 approaches for Charter - CNBC "
    },
    {
        "content": "* LIBERTY MEDIA CORPORATION REPORTS THIRD QUARTER 2017 FINANCIAL RESULTS",
        "date": "11092017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-LIBERTY MEDIA REPORTS Q3 EARNINGS PER SHARE ATTRIBUTABLE TO LIBERTY SIRIUSXM GROUP $0.06 "
    },
    {
        "content": "LONDON  Oct 7 Formula One's American bosses have hired boxing announcer Michael Buffer to bring some big fight buzz to the title tussle between Lewis Hamilton and Sebastian Vettel at this month's U.S. Grand Prix.",
        "date": "10072017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Motor racing-The voice of boxing to call out F1 title rivals "
    },
    {
        "content": "LONDON  Oct 4 ESPN will replace NBC as Formula One's U.S. broadcaster next season as part of a multi-year and multimedia deal  the sport announced on Wednesday.",
        "date": "10042017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Motor racing-ESPN to replace NBC as U.S. F1 broadcaster in 2018 "
    },
    {
        "content": "* Liberty Media Corp prices secondary offering on behalf of selling stockholders of series c Liberty Formula one common stock",
        "date": "09202017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media Corp prices secondary offering on behalf of selling stockholders of series C Liberty formula one common stock "
    },
    {
        "content": "* Spanish driver Carlos Sainz moves to Renault for 2018 (Repeats adding link to earlier story)",
        "date": "09152017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "UPDATE 1-Motor racing-McLaren split from Honda and switch to Renault "
    },
    {
        "content": "LONDON  Sept 13 Formula One announced a limited three-year free-to-air deal with France's TF1 television on Wednesday that will include the broadcaster's home race next year as well as the showcase Monaco Grand Prix.",
        "date": "09132017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "REFILE-Motor racing-Formula One agrees free-to-air deal with France's TF1 "
    },
    {
        "content": "NEW YORK  Aug 14 Warren Buffett's Berkshire Hathaway Inc on Monday said it added a stake in Synchrony Financial  boosting its bet on the credit card industry  and shed its investment in the company's former parent  General Electric Co.",
        "date": "08142017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "UPDATE 1-Buffett's Berkshire adds Synchrony  sheds GE "
    },
    {
        "content": "* Liberty Media Corporation reports second quarter 2017 financial results",
        "date": "08092017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media reports qtrly total revenue of $2 140 mln "
    },
    {
        "content": "* Liberty Media announces closing of increase to formula 1 revolving credit facilities Source text for Eikon: Further company coverage:",
        "date": "08032017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media announces closing of increase to formula 1 revolving credit facilities "
    },
    {
        "content": "* Liberty Media Corporation announces expiration of investment opportunity for Formula 1 teams; shares retired to treasury",
        "date": "07242017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media announces expiration of investment opportunity for Formula 1 teams "
    },
    {
        "content": "* Fairview Capital Investment Management LLC reports 6.4 percent passive stake in Liberty Media Corp as of July 7 - sec filing Source text : http://bit.ly/2ttPKru Further company coverage:",
        "date": "07202017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Fairview Capital Investment Management reports 6.4 pct passive stake in Liberty Media "
    },
    {
        "content": "U.S. Spanish-language broadcaster Univision Communications Inc held early-stage talks with John Malone's Liberty Media Corp   after he expressed interest in an acquisition or significant investment  a person familiar with the matter said on Wednesday.",
        "date": "07202017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Liberty Media discusses potential deal with Univision: source "
    },
    {
        "content": "July 19 U.S. Spanish-language broadcaster Univision Communications Inc held early-stage talks with John Malone's Liberty Media Corp  after he expressed interest in an acquisition or significant investment  a person familiar with the matter said on Wednesday.",
        "date": "07202017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Liberty Media discusses potential deal with Univision -source "
    },
    {
        "content": "* Gamco Asset Management Inc reports 4.74 percent stake in Liberty Media Corp as of July 5 - SEC Filing Source text: [http://bit.ly/2tSbxb3] Further company coverage:",
        "date": "07142017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Gamco Asset Management reports 4.74 pct stake in Liberty Media Corp as of July 5 - SEC Filing "
    },
    {
        "content": "* Liberty Media launches process to increase Formula 1 term loan and revolver capacity",
        "date": "07172017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media launches process to increase Formula 1 term loan and revolver capacity "
    },
    {
        "content": "SPIELBERG  Austria  July 10 Force India believe Formula One is moving in the direction of a franchise future under new owners Liberty Media and the Silverstone-based team want to be ready for it.",
        "date": "07102017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "Motor racing-Force India see F1 moving to a franchise future "
    },
    {
        "content": "SPIELBERG  Austria  July 8 Formula One's new owners Liberty Media should buy Silverstone to end lingering uncertainty over the future of the British Grand Prix circuit and grow the sport  McLaren executive director Zak Brown said on Saturday.",
        "date": "07082017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Motor racing-Formula One should buy Silverstone  says McLaren boss "
    },
    {
        "content": "* As of June 15  Gamco Asset Management and affiliates report a combined stake of 5.22 pct in Liberty Media Corp - SEC filing Source text for Eikon: (http://bit.ly/2tDgSkl) Further company coverage:",
        "date": "06232017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Gamco Asset Management and affiliates report a combined stake of 5.22 pct in Liberty Media "
    },
    {
        "content": "Sirius XM Holdings Inc  the U.S. satellite radio company controlled by John Malone's Liberty Media Corp  is seeking to invest in internet music provider Pandora Media Inc  people familiar with the matter said.",
        "date": "06082017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Exclusive: Sirius XM in talks to invest in Pandora - sources "
    },
    {
        "content": "MONACO Pirelli is committed to Formula One but there are no plans to take a stake in the sport following Liberty Media's takeover  the tire company's chief executive Marco Tronchetti Provera said on Sunday.",
        "date": "05282017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "Pirelli committed to F1 under Liberty "
    },
    {
        "content": "MONACO  May 28 Pirelli is committed to Formula One but there are no plans to take a stake in the sport following Liberty Media's takeover  the tyre company's chief executive Marco Tronchetti Provera said on Sunday.",
        "date": "05282017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Motor racing-Pirelli committed to F1 under Liberty "
    },
    {
        "content": "* Liberty media corporation prices primary offering and secondary offering on behalf of selling stockholders of series C liberty formula one common stock",
        "date": "05192017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media Corporation prices primary offering and secondary offering "
    },
    {
        "content": "* Liberty media corporation reports first quarter 2017 financial results",
        "date": "05092017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media Q1 revenue rose 8 percent to $1.3 billion "
    },
    {
        "content": "* Liberty Media Corp - CEO Gregory B. Maffei's 2016 total compensation $16.9 million versus $12.1 million in 2015 - SEC filing Source text for Eikon: (http://bit.ly/2o6OGHm) Further company coverage:",
        "date": "04202017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media's CEO Gregory B. Maffei's 2016 total compensation $16.9 mln "
    },
    {
        "content": "MANAMA Azerbaijan Grand Prix promoter Arif Rahimov has cleared the air with Formula One boss Chase Carey after criticism of the race by  the sport's new owners Liberty Media.",
        "date": "04142017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "Motor racing: Baku promoter clears the air with F1 boss "
    },
    {
        "content": "MANAMA  April 14 Azerbaijan Grand Prix promoter Arif Rahimov has cleared the air with Formula One boss Chase Carey after criticism of the race by  the sport's new owners Liberty Media.",
        "date": "04142017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Motor racing-Baku promoter clears the air with F1 boss "
    },
    {
        "content": "LONDON  April 5 Former world champions Williams expressed optimism for Formula One's future under the sport's new owners Liberty Media after the team reported a profit and increased revenues for 2016 on Wednesday.",
        "date": "04052017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "Motor racing-Williams upbeat for F1 future after revenue growth "
    },
    {
        "content": "* Park West Asset Management LLC reports 5.6 percent passive stake in Liberty Media Corp  as of March 14  2017 - sec filing  Source text (http://bit.ly/2oejJwj) Further company coverage:",
        "date": "03242017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Park West Asset Management reports 5.6 pct passive stake in Liberty Media  as of March 14  2017 "
    },
    {
        "content": "BAKU The promoter of the Azerbaijan Grand Prix hit back on Wednesday at \"ignorant\" criticism of his race by Formula One's new owners Liberty Media.",
        "date": "03152017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "Motor racing: Baku promoter hits back at Liberty Media "
    },
    {
        "content": "BAKU  March 15 The promoter of the Azerbaijan Grand Prix hit back on Wednesday at \"ignorant\" criticism of his race by Formula One's new owners Liberty Media.",
        "date": "03152017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "UPDATE 1-Motor racing-Baku promoter hits back at Liberty Media "
    },
    {
        "content": "BAKU  March 15 The promoter of the Azerbaijan Grand Prix has hit back at 'ignorant' criticism of his race by Formula One's new owners Liberty Media.",
        "date": "03152017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Motor racing-Baku promoter hits back at Liberty Media criticism "
    },
    {
        "content": "* Pandora falls as much as 8 pct after Liberty Media CEO reportedly says Pandora's valuation doesn't make sense but it's interesting at right price- CNBC",
        "date": "02282017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Pandora shares falls as much as 8 pct after Liberty Media CEO reportedly says Pandora's valuation doesn't make sense- CNBC "
    },
    {
        "content": "* Liberty Media Corporation reports fourth quarter and year end 2016 financial results",
        "date": "02282017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media Q4 revenue $1.3 billion "
    },
    {
        "content": "LONDON Formula One has appointed global heads for sponsorship and research as it accelerates into a new era under U.S.-based Liberty Media following the departure of Bernie Ecclestone.",
        "date": "03102017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "Formula One makes commercial appointments "
    },
    {
        "content": "LONDON  March 10 Formula One has appointed global heads for sponsorship and research as it accelerates into a new era under U.S.-based Liberty Media following the departure of Bernie Ecclestone.",
        "date": "03102017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Motor racing-Formula One makes commercial appointments "
    },
    {
        "content": "* Liberty Media launches process to refinance portion of Formula 1 debt",
        "date": "02132017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media launches process to refinance part of Formula 1 debt "
    },
    {
        "content": "VIENNA Formula One teams should consider Liberty Media's invitation to take a stake in the sport and should not reject it out of hand  Mercedes motorsport head Toto Wolff said on Friday.    \"This is an idea which one shouldn't dismiss easily \" Wolff  a shareholder and team boss of world champions Mercedes  told Austrian magazine Trend.    \"But in any case one must know more about the business case and our role in the whole (project). Talks about this have only just begun and will pro",
        "date": "02032017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "F1 teams should not dismiss Liberty's stake offer: Mercedes' Wolff "
    },
    {
        "content": "VIENNA  Feb 3 Formula One teams should consider Liberty Media's invitation to take a stake in the sport and should not reject it out of hand  Mercedes motorsport head Toto Wolff said on Friday.",
        "date": "02032017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Motor racing-F1 teams should not dismiss Liberty's stake offer - Mercedes' Wolff "
    },
    {
        "content": "LONDON McLaren's 2017 Formula One car will be a break with the past  and the era of now-departed boss Ron Dennis  the team said on Friday.",
        "date": "02032017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Motor racing: New McLaren F1 car name to break with the past "
    },
    {
        "content": "* Liberty Media - files for resale of up to 70.4 million shares of series c Liberty Formula One common stock offered by selling stockholders   Source text: (http://bit.ly/2kZFQFr) Further company coverage:",
        "date": "02022017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "BRIEF-Liberty Media files for resale of up to 70.4 mln shares of Series C Liberty formula one common stock "
    },
    {
        "content": "LONDON Bernie Ecclestone is set to make a quick $29 million from Liberty Media's takeover of Formula One after being deposed as the sport's commercial supremo this week.",
        "date": "01262017",
        "name": "Liberty Media Corporation",
        "news_type": "topStory",
        "symbol": "LSXMK",
        "title": "Ecclestone selling shares in Formula One "
    },
    {
        "content": "LONDON  Jan 26 Bernie Ecclestone is set to make a quick $29 million from Liberty Media's takeover of Formula One after being deposed as the sport's commercial supremo this week.",
        "date": "01262017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "Motor racing-Ecclestone selling shares in Formula One "
    },
    {
        "content": "* Seizert Capital Partners LLC reports a 5.96 percent passive stake in Liberty Media Corp as of December 31  2016 - SEC filing  Source text (http://bit.ly/2jVQkWY)",
        "date": "01262017",
        "name": "Liberty Media Corporation",
        "news_type": "normal",
        "symbol": "LSXMK",
        "title": "BRIEF-Seizert Capital Partners LLC reports 5.96 pct passive stake in Liberty Media Corp as of Dec 31 "
    }
]