[
    {
        "content": "    SAO PAULO  Nov 17 The Mexican peso firmed as much as 1 percent on Friday amid expectations that ongoing NAFTA talks in Mexico City would adopt a slightly more deliberative tone than in the past and focus on low-impact issues.     The peso  which was trading at its strongest level against the dollar since mid-October  was also lifted by news that U.S. special counsel investigators into possible Russian interference in the 2016 U.S. election were seeking more documents from the Tru",
        "date": "11172017",
        "name": "LATAM Airlines Group SA",
        "news_type": "normal",
        "symbol": "LTM",
        "title": "EMERGING MARKETS-Mexican peso up on NAFTA talks  Trump investigation "
    },
    {
        "content": "SANTIAGO LATAM Airlines   Latin America's largest airline  posted a higher-than-expected third-quarter profit on Wednesday as the economies of regional markets recovered.",
        "date": "11152017",
        "name": "LATAM Airlines Group SA",
        "news_type": "topStory",
        "symbol": "LTM",
        "title": "LATAM Airlines posts higher-than-expected quarterly profit "
    },
    {
        "content": "SANTIAGO  Nov 15 LATAM Airlines  Latin America's largest airline  posted a higher-than-expected third-quarter profit on Wednesday as the economies of regional markets recovered.",
        "date": "11152017",
        "name": "LATAM Airlines Group SA",
        "news_type": "normal",
        "symbol": "LTM",
        "title": "UPDATE 1-LATAM Airlines posts higher-than-expected quarterly profit "
    },
    {
        "content": "*  Been selected by Latam Airlines Brazil to introduce inflight connectivity using Gogo's 2KU technology to 100 of its A320 aircraft​",
        "date": "10242017",
        "name": "LATAM Airlines Group SA",
        "news_type": "topStory",
        "symbol": "LTM",
        "title": "BRIEF-Latam Airlines Brazil selects Gogo to introduce inflight connectivity "
    },
    {
        "content": "Oct 3 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "10032017",
        "name": "LATAM Airlines Group SA",
        "news_type": "topStory",
        "symbol": "LTM",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "SANTIAGO  Oct 3 LATAM Airlines  Latin America's largest carrier  said on Tuesday that Brazil's antitrust authority Cade had approved its joint business agreement (JBA) with American Airlines Group Inc without restrictions.",
        "date": "10032017",
        "name": "LATAM Airlines Group SA",
        "news_type": "normal",
        "symbol": "LTM",
        "title": "UPDATE 1-LATAM Airlines says Brazil watchdog approves deal with American "
    },
    {
        "content": "SANTIAGO  Oct 3 LATAM Airlines  Latin America's largest carrier  said on Tuesday that Brazil's antitrust authority Cade had approved its joint business agreement (JBA) with American Airlines Group Inc without restrictions.",
        "date": "10032017",
        "name": "LATAM Airlines Group SA",
        "news_type": "normal",
        "symbol": "LTM",
        "title": "LATAM Airlines says Brazil watchdog approves JBA with American "
    },
    {
        "content": "SANTIAGO  Sept 22 The passenger volume of carrier LATAM Airlines rose 2.3 percent year-over-year in August  the company said late on Thursday  potentially marking a turning point for demand in Brazil  the largest market for the Santiago-based company.",
        "date": "09222017",
        "name": "LATAM Airlines Group SA",
        "news_type": "topStory",
        "symbol": "LTM",
        "title": "Brazil rebound boosts LATAM Airlines traffic in August  shares climb "
    },
    {
        "content": "SANTIAGO LATAM Airlines Group SA  Latin America's largest airline  is still \"very cautious\" on the outlook for its key domestic Brazilian market  with demand volatile  a top executive of the company said on Friday.",
        "date": "08182017",
        "name": "LATAM Airlines Group SA",
        "news_type": "topStory",
        "symbol": "LTM",
        "title": "LATAM Airlines 'very cautious' on Brazil demand outlook "
    },
    {
        "content": "SANTIAGO LATAM Airlines   Latin America's largest airline  posted a bigger-than-expected second quarter net loss on Thursday but said it was maintaining its margin guidance as revenues and operating income rose.",
        "date": "08172017",
        "name": "LATAM Airlines Group SA",
        "news_type": "topStory",
        "symbol": "LTM",
        "title": "LATAM Airlines reports bigger than expected second quarter loss "
    },
    {
        "content": "SANTIAGO  Aug 18 LATAM Airlines Group SA  Latin America's largest airline  is still \"very cautious\" on the outlook for its key domestic Brazilian market  with demand volatile  a top executive of the company said on Friday.",
        "date": "08182017",
        "name": "LATAM Airlines Group SA",
        "news_type": "normal",
        "symbol": "LTM",
        "title": "UPDATE 1-LATAM Airlines 'very cautious' on Brazil demand outlook "
    },
    {
        "content": "Gym operator Life Time Fitness Inc  said it would be taken private by Leonard Green & Partners and TPG [TPG.UL] in a deal valued at over $4 billion.",
        "date": "03162015",
        "name": "LATAM Airlines Group SA",
        "news_type": "topStory",
        "symbol": "LTM",
        "title": "Life Time Fitness to be taken private for over $4 billion "
    },
    {
        "content": "March 16 Gym operator Life Time Fitness Inc  said it would be taken private by Leonard Green & Partners and TPG in a deal valued at over $4 billion.",
        "date": "03162015",
        "name": "LATAM Airlines Group SA",
        "news_type": "normal",
        "symbol": "LTM",
        "title": "UPDATE 3-Life Time Fitness to be taken private for over $4 bln "
    },
    {
        "content": "March 16 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "03162015",
        "name": "LATAM Airlines Group SA",
        "news_type": "normal",
        "symbol": "LTM",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Futures up: Dow 96 pts  S&P 12.25 pts  Nasdaq 22.25 pts   (Adds market moves  commentary)",
        "date": "03162015",
        "name": "LATAM Airlines Group SA",
        "news_type": "normal",
        "symbol": "LTM",
        "title": "US STOCKS-Wall St futures rise as euro recovers "
    },
    {
        "content": "March 16 Gym operator Life Time Fitness Inc  said it would be taken private by Leonard Green & Partners and TPG in a deal valued over $4 billion.",
        "date": "03162015",
        "name": "LATAM Airlines Group SA",
        "news_type": "normal",
        "symbol": "LTM",
        "title": "Life Time Fitness to be taken private for more than $4 bln "
    }
]