[
    {
        "content": "NEW YORK Leucadia National Corp has doubled down on hedge fund firm Folger Hill Asset Management LP with a new approximately $100 million investment  according to a person familiar with the situation.",
        "date": "11062017",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "Leucadia adds $100 million to Folger Hill bet as hedge fund stabilizes "
    },
    {
        "content": "NEW YORK  Nov 6 Leucadia National Corp has doubled down on hedge fund firm Folger Hill Asset Management LP with a new approximately $100 million investment  according to a person familiar with the situation.",
        "date": "11062017",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Leucadia adds $100 mln to Folger Hill bet as hedge fund stabilizes "
    },
    {
        "content": "* ‍Leucadia National Corp reports 12.1 percent passive stake in Easterly Acquisition Corp as of Aug 31 - SEC filing​ Source text: (http://bit.ly/2wfn8id) Further company coverage:",
        "date": "09082017",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "BRIEF-‍Leucadia National reports 12.1 percent passive stake in Easterly Acquisition Corp ​ "
    },
    {
        "content": "* Leucadia National Corporation announces second quarter 2017 results",
        "date": "07272017",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "BRIEF-Leucadia National Q2 earnings per share $0.16 "
    },
    {
        "content": "NEW YORK Shares of Leucadia National Corp  stand to rise about 15 percent as some of the conglomerate's key holdings bounce back  according to a Barron's article published on Sunday.",
        "date": "07232017",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "Leucadia shares could gain as Jefferies  National Beef rebound: Barron's "
    },
    {
        "content": "NEW YORK  July 23 Shares of Leucadia National Corp stand to rise about 15 percent as some of the conglomerate's key holdings bounce back  according to a Barron's article published on Sunday.",
        "date": "07232017",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Leucadia shares could gain as Jefferies  National Beef rebound -Barron's "
    },
    {
        "content": "* Leucadia National Corp reports a 5 percent stake in Fiesta Restaurant Group as of June 9 - SEC filing Source text for Eikon: (http://bit.ly/2sIYeJQ) Further company coverage:",
        "date": "06192017",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "BRIEF-Leucadia National reports a 5 pct stake in Fiesta Restaurant "
    },
    {
        "content": "* Total net revenue up 8.3 pct (Adds Breakingviews link  Leucadia share price)",
        "date": "06202017",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "UPDATE 3-Jefferies' profit boosted by strong investment banking revenue "
    },
    {
        "content": "* Leucadia National Corporation announces first quarter 2017 results",
        "date": "04272017",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "BRIEF-Leucadia National Corp Q1 earnings per share $0.75 "
    },
    {
        "content": "* Q1 earnings per share view $0.67 -- Thomson Reuters I/B/E/S Source text for Eikon: Further company coverage:",
        "date": "04272017",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "BRIEF-Leucadia National reports Q1 earnings per share $0.75 "
    },
    {
        "content": "Jefferies Group LLC  the investment banking unit of Leucadia National Corp   on Tuesday reported a quarterly profit  compared with a year-ago loss  helped by strong revenue from its equities and fixed-income securities trading business.",
        "date": "03212017",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "Jefferies posts first-quarter profit on strong equities  bond trading "
    },
    {
        "content": "March 21 Jefferies Group LLC  the investment banking unit of Leucadia National Corp  on Tuesday reported a quarterly profit  compared with a year-ago loss  helped by strong revenue from its equities and fixed-income securities trading business.",
        "date": "03212017",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "UPDATE 2-Jefferies posts Q1 profit on strong equities  bond trading "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 27 (Fitch) Fitch Ratings has affirmed Leucadia National  Corporation's (Leucadia) Long-term Issuer Default Rating (IDR) at 'BBB-'. The  Rating Outlook is Stable. A full list of ratings follows at the end of this  release. Fitch has also affirmed the ratings of Leucadia's wholly-owned subsidiary   Jefferies Group LLC (Jefferies)  today. The Rating Outlook is Stable. For more  information  see 'Fitch Affirms Jefferies a",
        "date": "02272017",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "Fitch Affirms Leucadia at 'BBB-'; Outlook Stable "
    },
    {
        "content": "* Leucadia National Corporation announces fourth quarter 2016 results",
        "date": "02272017",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "BRIEF-Leucadia National Corporation Q4 EPS $0.37 "
    },
    {
        "content": "* First Pacific Advisors  LLC reports 6 percent passive stake in Leucadia National Corp as on December 31  2016 - SEC filing  Source text (http://bit.ly/2kObohS) Further company coverage:",
        "date": "02162017",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "BRIEF-First Pacific Advisors LLC reports 6 pct passive stake in Leucadia National Corp "
    },
    {
        "content": "Jefferies Group LLC  the investment banking unit of Leucadia National Corp   reported a sharp increase in quarterly profit on Tuesday  driven by strong revenue in its equities and fixed-income securities trading business.",
        "date": "12202016",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "Jefferies profit jumps more than four-fold on strong trading "
    },
    {
        "content": "* Q3 2016 results were impacted by a $55 million non-cash impairment charge related to decisions at juneau energy",
        "date": "11022016",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "BRIEF-Leucadia National reports qtrly earnings per share $ 0.41 "
    },
    {
        "content": "Sept 30 Online trading company IG Group Holdings Plc said it had agreed to buy news and research portal DailyFX and its associated assets from U.S. retail broker FXCM Inc for $40 million.",
        "date": "09302016",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "UPDATE 2-UK's IG Group to buy DailyFX from FXCM Inc for $40 mln "
    },
    {
        "content": "* Leucadia and FXCM complete long-term partnership agreement  Source text for Eikon:  Further company coverage:",
        "date": "09012016",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "BRIEF-Leucadia and FXCM complete long-term partnership agreement "
    },
    {
        "content": "* Leucadia National Corporation announces second quarter 2016 results",
        "date": "08032016",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "BRIEF-Leucadia National reports qtrly earnings per share $0.15 "
    },
    {
        "content": "* Leucadia will acquire ITG investment research for $12 million in cash",
        "date": "05102016",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "BRIEF-Leucadia National to buy ITG Investment Research for $12 mln in cash "
    },
    {
        "content": "* Leucadia National Corporation announces first quarter 2016 results",
        "date": "05042016",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "BRIEF-Leucadia National Q1 loss per share $0.60 "
    },
    {
        "content": "NEW YORK  Sept 18 For U.S. banks' bond trading desks  the Federal Reserve just made a bad quarter even worse  accentuating a longer-term decline in what was once their most lucrative business  executives  analysts and traders told Reuters.",
        "date": "09182015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "For U.S. banks  Fed inaction makes a bad trading quarter even worse "
    },
    {
        "content": "Lennar Corp   the second-largest U.S. homebuilder  reported a better-than-expected jump in quarterly profit as it sold more homes at higher prices across the United States  especially in the West and Southeast Florida markets. | Video ",
        "date": "06242015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "U.S. homebuilders on the rise as Lennar's profit beats estimates "
    },
    {
        "content": "Investment bank Jefferies Group LLC  owned by Leucadia National Corp   reported a 2.5 percent fall in quarterly profit as a prolonged slump in its bond trading business more than offset a rise in investment banking revenue.",
        "date": "06162015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "Dip in bond trading revenue hurts Jefferies' second-quarter profit "
    },
    {
        "content": "June 16 Investment bank Jefferies Group LLC  owned by Leucadia National Corp  reported a 2.5 percent fall in quarterly profit as a prolonged slump in its bond trading business more than offset a rise in investment banking revenue.",
        "date": "06162015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "UPDATE 1-Dip in bond trading revenue hurts Jefferies' 2nd-qtr profit "
    },
    {
        "content": "LONDON/NEW YORK Australia's Macquarie Group Ltd is looking to recruit the precious metals trading team of Jefferies Group LLC's commodities brokerage  two sources familiar with the matter said on Friday.",
        "date": "05012015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "Macquarie revives talks with Jefferies on precious metals business: sources "
    },
    {
        "content": "April 9 Investment bank Jefferies Group LLC   owned by Leucadia National Corp  said it will sell most of its Bache unit's futures business to Societe Generale.",
        "date": "04092015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "RPT-UPDATE 1-Jefferies to sell most of Bache futures business to SocGen "
    },
    {
        "content": "April 9 Investment bank Jefferies Group LLC   owned by Leucadia National Corp  said it will sell most of Bache unit's futures business to Societe Generale .",
        "date": "04092015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Jefferies to sell most of Bache futures business to Societe Generale "
    },
    {
        "content": "March 17 Investment bank Jefferies Group LLC  owned by Leucadia National Corp  reported a 90 percent drop in quarterly profit  hurt by lower revenue from bond trading and investment banking businesses.",
        "date": "03172015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "UPDATE 2-Jefferies profit plunges on lower fixed income revenue "
    },
    {
        "content": "March 17 Investment bank Jefferies Group LLC  owned by Leucadia National Corp  reported a 90 percent drop in quarterly profit  hurt by lower revenue from its fixed income and investment banking businesses.",
        "date": "03172015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Jefferies profit falls 90 pct on lower fixed income revenue "
    },
    {
        "content": "NEW YORK Investment bank Jefferies Group LLC [JGLL.UL]  owned by Leucadia National Corp   has cut about 20 jobs in its commodities futures brokerage in New York and Chicago  three sources familiar with the cuts said on Friday.",
        "date": "03062015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "Jefferies cuts commodities jobs in New York  Chicago: sources "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 05 (Fitch) Fitch Ratings has affirmed Leucadia National  Corporation's (Leucadia) long-term Issuer Default Rating (IDR) at 'BBB-'. The  Rating Outlook remains Stable. See the full list of ratings at the end of this  rating action commentary. The ratings of Leucadia and its main operating subsidiary  Jefferies Group LLC  (Jefferies)  continue to be equalized  as Fitch considers Jefferies a core  subsidiary of Leucadia. Th",
        "date": "03052015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "Fitch Affirms Leucadia's Long-Term IDR at 'BBB-'; Outlook Stable "
    },
    {
        "content": "NEW YORK  March 6 Investment bank Jefferies Group LLC  owned by Leucadia National Corp  has cut about 20 jobs in its commodities futures brokerage in New York and Chicago  three sources familiar with the cuts said on Friday.",
        "date": "03062015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "UPDATE 2-Jefferies cuts commodities jobs in New York  Chicago -sources "
    },
    {
        "content": "NEW YORK  Feb 10 A divided federal appeals court in New York allowed more than 100 000 potential plaintiffs to pursue class action litigation accusing Leucadia National Corp  and a law firm of fraudulently cutting corners to win default judgments in debt collection cases.",
        "date": "02102015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "US court allows 'sewer service' debt collection class action "
    },
    {
        "content": "Feb 4 Richard Handler  the chief executive of Leucadia National Corp  parent of investment bank Jefferies Group LLC  turned down his bonus for the previous year  which was dogged by lackluster performance.",
        "date": "02042015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Jefferies CEO Richard Handler turns down bonus "
    },
    {
        "content": "MELBOURNE/NEW YORK Macquarie Group Ltd  is in talks to buy Jefferies Group LLC's [JGLL.UL] commodities and financial derivatives brokerage  three sources said  as the Australian bank continues to expand its commodities business while rivals retreat.",
        "date": "01292015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Macquarie in talks to buy Jefferies' futures arm: sources "
    },
    {
        "content": "MELBOURNE/NEW YORK  Jan 29 Macquarie Group Ltd  is in talks to buy Jefferies Group LLC's  commodities and financial derivatives brokerage  three sources said  as the Australian bank continues to expand its commodities business while rivals retreat.",
        "date": "01292015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Macquarie in talks to buy Jefferies' futures arm - sources "
    },
    {
        "content": "Jan 20 Leucadia National Corp officers and directors have agreed to a $70 million settlement to resolve a lawsuit claiming that executives had conflicts of interest that tainted the company's November 2012 agreement to buy Jefferies Group Inc.",
        "date": "01202015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "Leucadia in $70 mln settlement over Jefferies purchase "
    },
    {
        "content": "NEW YORK Retail foreign exchange broker FXCM Inc   reeling after customers lost more than $200 million from the surging Swiss franc  will get a $300 million loan from Leucadia National Corp to keep operating  the companies said in a statement Friday.",
        "date": "01172015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "FX broker FXCM gets rescue from Jefferies parent Leucadia "
    },
    {
        "content": "Leucadia National Corp  will give $300 million to retail foreign exchange broker FXCM Inc  to meet regulatory capital requirements  the two companies said on Friday.",
        "date": "01172015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Leucadia to give FXCM $300 million to continue operations "
    },
    {
        "content": "NEW YORK Retail foreign exchange broker FXCM Inc   reeling after customers lost more than $200 million from the surging Swiss franc  will get a $300 million loan from Leucadia National Corp to keep operating  the companies said in a statement Friday.",
        "date": "01162015",
        "name": "Leucadia National Corporation",
        "news_type": "topStory",
        "symbol": "LUK",
        "title": "FX broker FXCM gets rescue from Jefferies parent Leucadia "
    },
    {
        "content": "NEW YORK  Jan 16 Retail foreign exchange broker FXCM Inc  reeling after customers lost more than $200 million from the surging Swiss franc  will get a $300 million loan from Leucadia National Corp to keep operating  the companies said in a statement Friday.",
        "date": "01162015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "UPDATE 5-FX broker FXCM gets rescue from Jefferies parent Leucadia "
    },
    {
        "content": "LONDON  Jan 16 The Swiss franc shock reverberated through currency trading firms around the world on Friday  wiping out many small-scale investors and the brokerages that cater to them and forcing regulators to take a closer look at the sector.",
        "date": "01162015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "WRAPUP 5-Swiss franc shock shuts some FX brokers; regulators move in "
    },
    {
        "content": "Leucadia National Corp  will give $300 million to retail foreign exchange broker FXCM Inc  to meet regulatory capital requirements  the two companies said on Friday.",
        "date": "01162015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Leucadia to give FXCM $300 million to continue operations "
    },
    {
        "content": "Jan 16 Leucadia National Corp will give $300 million to retail foreign exchange broker FXCM Inc  to meet regulatory capital requirements  the two companies said on Friday.",
        "date": "01162015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Leucadia to give FXCM $300 mln to continue operations "
    },
    {
        "content": "Leucadia National Corp   the parent of investment bank Jefferies  will provide foreign exchange brokerage FXCM Inc  with $300 million in financing  CNBC said on Friday.",
        "date": "01162015",
        "name": "Leucadia National Corporation",
        "news_type": "normal",
        "symbol": "LUK",
        "title": "Leucadia National to provide FXCM with $300 million in financing: CNBC "
    }
]