[
    {
        "content": "* Lululemon Athletica Inc - ‍Lee Holman  executive vice president and creative director  has resigned​ Source text for Eikon: Further company coverage:",
        "date": "11092017",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon Athletica announces leadership change "
    },
    {
        "content": "Sept 1 Lululemon Athletica Inc is coming off two straight quarters of solid growth and is forging ahead with expansion plans that include a focus on menswear  a move that could breathe life into an ailing athleisure market.",
        "date": "09012017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon is leaning toward men to bolster growth "
    },
    {
        "content": "TORONTO Canadian yoga and leisure apparel maker Lululemon Athletica Inc  reported quarterly profit and sales on Thursday that topped expectations as online sales surged 30 percent thanks to an effort to beef up its e-commerce strategy  and the company raised its outlook.",
        "date": "09012017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon beats forecasts  lifts outlook as online sales jump "
    },
    {
        "content": "TORONTO  Aug 31 Canadian yoga and leisure apparel maker Lululemon Athletica Inc reported quarterly profit and sales on Thursday that topped expectations as online sales surged 30 percent thanks to an effort to beef up its e-commerce strategy  and the company raised its outlook.",
        "date": "08312017",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "UPDATE 2-Lululemon beats forecasts  lifts outlook as online sales jump "
    },
    {
        "content": "TORONTO  Aug 31 Canadian yogawear apparel maker Lululemon Athletica Inc reported a quarterly profit and revenue on Thursday that topped expectations  as same-store sales increased  particularly online.",
        "date": "08312017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon profit tops forecasts as online sales jump "
    },
    {
        "content": "* Lululemon Athletica Inc. Announces second quarter fiscal 2017 results",
        "date": "08312017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon Athletica Q2 earnings per share $0.36 "
    },
    {
        "content": "* Lululemon Athletica - ‍ Patrick was designated for appointment to board by Advent International in accordance with terms of a support agreement​ Source text for Eikon: Further company coverage:",
        "date": "08312017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Tricia Patrick joins Lululemon board of directors "
    },
    {
        "content": "TORONTO Athletic apparel maker Lululemon Athletica Inc  on Thursday said it would close most of its money-losing Ivivva girls stores and boost investment in its online business as it reported quarterly profit that beat analysts' forecasts.",
        "date": "06012017",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon to close Ivivva stores during online push  profit beats "
    },
    {
        "content": "TORONTO  June 1 Athletic apparel maker Lululemon Athletica Inc on Thursday said it would close most of its money-losing Ivivva girls stores and boost investment in its online business as it reported quarterly profit that beat analysts' forecasts.",
        "date": "06012017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 2-Lululemon to close Ivivva stores during online push  profit beats "
    },
    {
        "content": "TORONTO  June 1 Premium athletic apparel maker Lululemon Athletica Inc on Thursday reported quarterly earnings that beat analysts' forecasts and said it plans to shut down 40 Ivivva stores for young girls  sending shares up 10 percent.",
        "date": "06012017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon profit beats forecasts  plans store closings "
    },
    {
        "content": "* Lululemon athletica inc. Announces first quarter fiscal 2017 results and plan to restructure its ivivva operations",
        "date": "06012017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon sees FY 2017 adj EPS $2.28 to $2.38 excluding items "
    },
    {
        "content": "* Asia Pac operating profit up 13 pct  N. America falls 91 pct",
        "date": "04272017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 3-Under Armour's smaller-than-expected loss eases investor fears "
    },
    {
        "content": "* CEO Laurent Potdevin's 2016 total compensation $6.6 million versus $5.2 million in 2015 Source text: (http://bit.ly/2pyJwjH) Further company coverage:",
        "date": "04132017",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon Athletica CEO's 2016 total compensation $6.6 mln "
    },
    {
        "content": "* In connection with Murphy's appointment to board  board of directors increased size of board from nine to ten members Source text: [http://bit.ly/2oRJQdT] Further company coverage:",
        "date": "04072017",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon Athletica says size of board increases from nine to ten members with Murphy's appointment "
    },
    {
        "content": "Shares of Lululemon Athletica Inc  were set for their biggest one-day percentage loss in more than eight years on Thursday  after the Canadian yogawear apparel maker warned that first-quarter sales would fall. | Video ",
        "date": "03302017",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon shares plummet after disappointing sales forecast "
    },
    {
        "content": "TORONTO  March 29 Canada's Lululemon Athletica Inc on Wednesday reported fourth-quarter earnings per share that fell shy of analysts' expectations  hurt by a stronger-than-expected Canadian dollar  and said first-quarter comparable sales were expected to fall.",
        "date": "03292017",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "UPDATE 2-Lululemon shares tumble on miss  weak first-quarter outlook "
    },
    {
        "content": "March 30 The steep drop in Lululemon Athletica's stock price  following a sales warning that resulted from poor color choices in the company's spring collection  turns the spotlight on slowing growth in the athleisure category pioneered by the Canadian yogawear retailer.",
        "date": "03302017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Sour Lululemon results may signal squeeze for athletic leisure lines "
    },
    {
        "content": "* Q4 revenue $789.9 million versus I/B/E/S view $783.5 million",
        "date": "03292017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon Athletica reports Q4 EPS $0.99 "
    },
    {
        "content": "TORONTO  March 29 Canada's Lululemon Athletica Inc on Wednesday reported a higher quarterly profit  but earnings per share fell short of analysts' expectations due in part to slower sales.",
        "date": "03292017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon posts higher profit  but EPS misses "
    },
    {
        "content": "March 30 Shares of Lululemon Athletica Inc were set for their biggest one-day percentage loss in more than eight years on Thursday  after the Canadian yogawear apparel maker warned that first-quarter sales would fall.",
        "date": "03302017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 1-Lululemon shares plummet after disappointing sales forecast "
    },
    {
        "content": "TORONTO Canada's Lululemon Athletica Inc  on Wednesday reported fourth-quarter earnings per share that fell shy of analysts' expectations  hurt by a stronger-than-expected Canadian dollar  and said first-quarter comparable sales were expected to fall.",
        "date": "03302017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon shares tumble on miss  weak first-quarter outlook "
    },
    {
        "content": "Jan 9 Canadian yoga and leisure apparel retailer Lululemon Athletica Inc said on Monday it had narrowed the range of its profit and revenue forecasts for the fourth quarter of 2016.",
        "date": "01092017",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "UPDATE 2-Canada's Lululemon Athletica narrows Q4 forecast range "
    },
    {
        "content": "Jan 9 Canadian yoga and leisure apparel retailer Lululemon Athletica Inc said on Monday it had narrowed its profit and revenue forecasts for the fourth quarter of 2016.",
        "date": "01092017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Canada's Lululemon Athletica narrows Q4 forecast "
    },
    {
        "content": "* Lululemon Athletica Inc. Updates guidance for fourth quarter of fiscal 2016 ahead of presentation at the icr conference",
        "date": "01092017",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon Athletica Inc. updates guidance for fourth quarter of fiscal 2016 "
    },
    {
        "content": "TORONTO Canadian yoga and leisure apparel retailer Lululemon Athletica Inc on Wednesday reported quarterly profit that beat analysts' forecasts  helped by higher-than-expected gross margins and sales.",
        "date": "12082016",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon quarterly sales top expectations  shares jump "
    },
    {
        "content": "Sept 2 Stock futures pointed to a flat opening for Canada's main stock index on Friday as investors play it safe ahead of U.S. jobs data  awaiting clues on the next U.S. Federal Reserve rate hike.",
        "date": "09022016",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "CANADA STOCKS-Futures flat ahead of U.S. jobs data "
    },
    {
        "content": "TORONTO  Sept 1 Canadian yoga wear retailer Lululemon Athletica Inc reported an increase in quarterly earnings on Thursday as sales rose.",
        "date": "09012016",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon earnings rise on higher sales "
    },
    {
        "content": "VANCOUVER  Aug 9 One of Lululemon Athletica's  longest-serving board members  recently the source of online speculation over her identity and background  has stepped down  according to a company filing posted on Tuesday.",
        "date": "08092016",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon director whose existence was questioned quits "
    },
    {
        "content": "* On August 3  2016  Rhoda Pitcher resigned from her position as a member of our Board of Directors - SEC filing  Source text for Eikon :  Further company coverage:",
        "date": "08092016",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon athletica's Rhoda Pitcher resigns from position as member of Board of Directors "
    },
    {
        "content": "* Lululemon Athletica Inc files for potential mixed shelf offering; size not disclosed - SEC filing  Source text: (http://bit.ly/29Zl7y2) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07152016",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon files for potential mixed shelf offering "
    },
    {
        "content": "VANCOUVER Lululemon Athletica Inc  on Wednesday reported first-quarter sales that beat analyst expectations thanks to better-managed inventory  new store openings and online sales  sending shares up.",
        "date": "06082016",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon sales beat expectations  shares rise "
    },
    {
        "content": "VANCOUVER  June 8 Lululemon Athletica Inc  on Wednesday reported first-quarter sales that beat analyst expectations thanks to better-managed inventory  new store openings and online sales  sending shares up.",
        "date": "06082016",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 3-Lululemon sales beat expectations  shares rise "
    },
    {
        "content": "June 8 Canadian yoga-wear retailer Lululemon Athletica Inc's quarterly profit fell 5 percent as costs rose.",
        "date": "06082016",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon Athletica quarterly profit falls 5 pct "
    },
    {
        "content": "June 1 Lululemon Athletica Inc founder Chip Wilson criticized the Canadian yogawear retailer's board on Wednesday  calling for annual election of the entire board to make directors more accountable for the company's performance.",
        "date": "06012016",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "UPDATE 3-Canadian retailer Lululemon's founder seeks board election changes "
    },
    {
        "content": "June 1 Lululemon Athletica Inc's  founder Chip Wilson called for annual election of the Canadian yogawear retailer's board to hold members accountable for the company's performance.",
        "date": "06012016",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Canadian retailer Lululemon's founder urges annual board election "
    },
    {
        "content": "June 1 Lululemon Athletica Inc * Cnbc   Further company coverage: ",
        "date": "06012016",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon founder Chip Wilson says if co changes board structure  he could help as an consultant -CNBC "
    },
    {
        "content": "* Jon Mcneill joins Lululemon Athletica board of directors  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04192016",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "BRIEF-Jon Mcneill joins Lululemon Athletica board "
    },
    {
        "content": "Canadian retailer Lululemon Athletica Inc  said it expected improved margins and sales to drive its earnings growth this year  sending its shares up 10 percent in morning trading.",
        "date": "03302016",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon expects better margins to boost profit this year "
    },
    {
        "content": "March 30 Canadian retailer Lululemon Athletica Inc said it expected improved margins and sales to drive its earnings growth this year  sending its shares up 10 percent in morning trading.",
        "date": "03302016",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 2-Lululemon expects better margins to boost profit this year "
    },
    {
        "content": "* Lululemon Athletica Inc announces fourth quarter and full year fiscal 2015 results",
        "date": "03302016",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon Athletica Inc Q4 earnings per share $0.85 "
    },
    {
        "content": "March 30 Canadian yoga-wear retailer Lululemon Athletica Inc  reported a 6 percent rise in quarterly net profit  helped by higher same-store sales.",
        "date": "03302016",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon Athletica posts 6 pct rise in quarterly profit "
    },
    {
        "content": "VANCOUVER/BENGALURU Shares of Canadian yogawear retailer Lululemon Athletica Inc  plunged on Wednesday after it warned that profit margins were unlikely to fully recover until 2017 and cut its full-year earnings forecast.",
        "date": "12092015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon shares pummeled after profit-margin warning "
    },
    {
        "content": "VANCOUVER/BENGALURU  Dec 9 Shares of Canadian yogawear retailer Lululemon Athletica Inc plunged on Wednesday after it warned that profit margins were unlikely to fully recover until 2017 and cut its full-year earnings forecast.",
        "date": "12092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 4-Lululemon shares pummeled after profit-margin warning "
    },
    {
        "content": "Dec 9 Canadian yogawear retailer Lululemon Athletica Inc reported a 12 percent fall in quarterly profit  hurt by higher costs.",
        "date": "12092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Yogawear retailer Lululemon's profit falls 12 pct "
    },
    {
        "content": "Shares of Canadian yogawear retailer Lululemon Athletica Inc  tumbled on Thursday as results showed margins had narrowed due to higher costs  even as it reported consensus-beating sales and modestly raised its full-year forecasts.",
        "date": "09102015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Fraying Lululemon margins disappoint  shares slump 12 percent "
    },
    {
        "content": "Sept 10 Shares of Canadian yogawear retailer Lululemon Athletica Inc tumbled on Thursday as results showed margins had narrowed due to higher costs  even as it reported consensus-beating sales and modestly raised its full-year forecasts.",
        "date": "09102015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 3-Fraying Lululemon margins disappoint  shares slump 12 percent "
    },
    {
        "content": "* CFO says company operated stores represented 75% of total revenue or $339.8 million",
        "date": "09102015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon expects margins to grow next year "
    },
    {
        "content": "Sept 10 Canadian yogawear apparel retailer Lululemon Athletica Inc reported a 16 percent increase in quarterly sales and raised its full-year forecast  helped by strong total comparable store sales.",
        "date": "09102015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon quarterly revenue up  raises full-year forecast "
    },
    {
        "content": "TORONTO Lululemon Athletica Inc   which was hit by a high-profile recall of overly sheer yoga pants in 2013  is recalling the drawstrings on more than 300 000 women's tops due to the risk of injury  but said the financial impact was not material.",
        "date": "06252015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon recalls draw cords on women's top due to injury risk "
    },
    {
        "content": "TORONTO  June 25 Lululemon Athletica Inc   which was hit by a high-profile recall of overly sheer yoga pants in 2013  is recalling the drawstrings on more than 300 000 women's tops due to the risk of injury  but said the financial impact was not material.",
        "date": "06252015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 1-Lululemon recalls draw cords on women's top due to injury risk "
    },
    {
        "content": "* Says financial impact from drawstring recall on women's tops is not material  Further company coverage:    (Reporting by Solarina Ho)",
        "date": "06252015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon says drawstring recall financial impact not material "
    },
    {
        "content": "TORONTO Chip Wilson  who founded Lululemon Athletica Inc  and left its board earlier this year after disagreements with fellow directors  is now looking to potentially sell his family's estimated $1.3 billion stake in the yogawear maker.",
        "date": "06112015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Founder Chip Wilson looking at sale of entire Lululemon stake "
    },
    {
        "content": "TORONTO  June 11 Chip Wilson  who founded Lululemon Athletica Inc and left its board earlier this year after disagreements with fellow directors  is now looking to potentially sell his family's estimated $1.3 billion stake in the yogawear maker.",
        "date": "06112015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 1-Founder Chip Wilson looking at sale of entire Lululemon stake "
    },
    {
        "content": "June 11 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Thursday:",
        "date": "06112015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TORONTO  June 11 Chip Wilson  who founded Lululemon Athletica Inc and left the company's board earlier this year after disagreements with fellow board members  is now looking to potentially sell his entire stake in the yoga apparel maker.",
        "date": "06112015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon founder Chip Wilson may sell entire stake in company "
    },
    {
        "content": "* Indexes: Dow down 0.01 pct  S&P up 0.04 pct  Nasdaq down 0.2 pct   (Updates to close)",
        "date": "06092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "US STOCKS-Wall St ends flat; S&P 500 snaps 3-day losing streak "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P up 0.1 pct  Nasdaq down 0.1 pct   (Updates to late afternoon)",
        "date": "06092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "US STOCKS-Dow  S&P 500 inch higher with financial  energy shares "
    },
    {
        "content": "* Indexes: Dow up 0.11 pct  S&P up 0.12 pct  Nasdaq down 0.25 pct   (Updates to early afternoon)",
        "date": "06092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "US STOCKS-Wall St little changed after more strong economic data "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P up 0.09 pct  Nasdaq down 0.36 pct   (Adds details  changes comment  updates prices)",
        "date": "06092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "US STOCKS-Wall St mixed as expectations grow for Sept rate hike "
    },
    {
        "content": "Lululemon Athletica Inc  shares jumped on Tuesday after the Canadian yogawear retailer raised its full-year outlook  further evidence it is regaining its footing following a high-profile 2013 recall of overly sheer yoga pants.",
        "date": "06092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon shares jump after profit  revenue forecasts raised "
    },
    {
        "content": "* Positive comparable sales trend seen in Canadian and U.S. stores",
        "date": "06092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 3-Lululemon shrs jump after profit  revenue forecasts raised "
    },
    {
        "content": "* CEO says men's business delivering 19 percent comparable sales growth",
        "date": "06092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "BRIEF-Lululemon sees positive sales trend in Canada  U.S. "
    },
    {
        "content": "* April job openings and labor turnover numbers expected later",
        "date": "06092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "US STOCKS-U.S. stocks fall as rate hike prospects spook investors "
    },
    {
        "content": "* April job openings and labor turnover numbers expected later",
        "date": "06092015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "US STOCKS-Wall St set to open modestly lower as rate hike fears grow "
    },
    {
        "content": "A U.S. appeals court on Friday agreed with Lululemon Athletica Inc that a lawsuit accusing the retailer of defrauding shareholders by failing to reveal defects that caused yoga pants to become see-through was properly dismissed.",
        "date": "05152015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon yoga pants lawsuit properly dismissed - U.S. appeals court "
    },
    {
        "content": "NEW YORK A U.S. appeals court on Friday agreed with Lululemon Athletica Inc that a lawsuit accusing the retailer of defrauding shareholders by failing to reveal defects that caused yoga pants to become see-through was properly dismissed.",
        "date": "05152015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon yoga pants lawsuit properly dismissed: U.S. appeals court "
    },
    {
        "content": "NEW YORK  May 15 A U.S. appeals court on Friday agreed with Lululemon Athletica Inc that a lawsuit accusing the retailer of defrauding shareholders by failing to reveal defects that caused yoga pants to become see-through was properly dismissed.",
        "date": "05152015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon yoga pants lawsuit properly dismissed -US appeals court "
    },
    {
        "content": "TORONTO  April 29 The uproar around yogawear retailer Lululemon Athletica two years ago was about a little too much transparency. Now some shareholders are complaining about a lack of it.",
        "date": "04292015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon facing calls for board reform  transparency "
    },
    {
        "content": "Canadian yogawear retailer Lululemon Athletica Inc  on Thursday reported stronger-than-expected quarterly results and gave a weak outlook that it said was largely due to temporary problems.",
        "date": "03262015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon reassures investors that its problems are temporary "
    },
    {
        "content": "* Earnings of 78 cents a share beat analysts' estimates   (Adds analyst comments  details  stock reaction)",
        "date": "03262015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 5-Lululemon reassures investors that its problems are temporary "
    },
    {
        "content": "March 26 Canadian yogawear retailer Lululemon Athletica Inc reported a slightly higher quarterly net profit on Thursday  helped by a 5 percent rise in comparable store sales.",
        "date": "03262015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon posts higher profit as same-store sales rise "
    },
    {
        "content": "TORONTO  March 17 When retailer Lululemon Athletica pulled its \"Define Jacket\" off the shelves in 2013  customers were dismayed. When it embarrassingly recalled its signature yoga pants for being too sheer  they rushed for the exits.",
        "date": "03172015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon customers say selection at core of sales turnaround "
    },
    {
        "content": "Feb 10 Privately held Canadian specialty tea retailer David's Tea  whose investors include Lululemon Athletica Inc founder Chip Wilson  has selected banks for a potential initial public offering  according to two people familiar with the matter.",
        "date": "02102015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Tea retailer David's Tea prepares for IPO-sources "
    },
    {
        "content": "Lululemon Athletica Inc  founder Chip Wilson  a sometimes controversial figure who helped build the Canadian yogawear retailer into an international success story  said on Monday he was resigning from the company's board. | Video ",
        "date": "02032015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Founder of yogawear chain Lululemon steps down from board "
    },
    {
        "content": "Lululemon Athletica Inc  founder Chip Wilson said on Monday he is quitting the board of directors of the yogawear retailer  hit nearly two years ago by a major recall  because the company was back on track with a strong management team. | Video ",
        "date": "02022015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon founder to leave board  keep stake in yogawear chain "
    },
    {
        "content": "Feb 2 Lululemon Athletica Inc founder Chip Wilson said on Monday he is quitting the board of directors of the yogawear retailer  hit nearly two years ago by a major recall  because the company was back on track with a strong management team.",
        "date": "02022015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 2-Lululemon founder to leave board  keep stake in yogawear chain "
    },
    {
        "content": "TORONTO  Feb 2 Canadian yogawear retailer Lululemon Athletica Inc's founder Chip Wilson has no immediate plans to trim his stake in the company  said a spokesman for Wilson on Monday.",
        "date": "02022015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon founder to retain stake in company -spokesman "
    },
    {
        "content": "Lululemon Athletica Inc  founder Chip Wilson  a sometimes controversial figure who helped build the Canadian yogawear retailer into an international success story  said on Monday he was resigning from the company's board.",
        "date": "02022015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Founder of yogawear chain Lululemon steps down from board "
    },
    {
        "content": " ",
        "date": "02022015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Yogawear chain Lululemon founder Chip Wilson steps down from board "
    },
    {
        "content": "Lululemon Athletica Inc  issued a robust forecast for the current quarter on Monday that topped market expectations and lifted its shares as strong holiday sales signaled the Canadian yogawear maker's comeback efforts may be paying off.",
        "date": "01122015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon forecast signals turnaround moves bearing fruit "
    },
    {
        "content": "Jan 12 Lululemon Athletica Inc issued a robust forecast for the current quarter on Monday that topped market expectations and lifted its shares as strong holiday sales signaled the Canadian yogawear maker's comeback efforts may be paying off.",
        "date": "01122015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "UPDATE 3-Lululemon forecast signals turnaround moves bearing fruit "
    },
    {
        "content": "Jan 12 Yogawear chain Lululemon Athletica Inc  raised its revenue and profit forecast for the fourth quarter  citing strong holiday season sales.",
        "date": "01122015",
        "name": "lululemon athletica inc",
        "news_type": "normal",
        "symbol": "LULU",
        "title": "Lululemon raises revenue  profit forecast "
    },
    {
        "content": "TORONTO  Jan 7 Canadian yoga wear maker Lululemon Athletica Inc on Wednesday named Stuart Haselden as its new chief financial officer  replacing long-time executive John Currie  who announced in June his plan to retire by the end of the fiscal year.",
        "date": "01072015",
        "name": "lululemon athletica inc",
        "news_type": "topStory",
        "symbol": "LULU",
        "title": "Lululemon appoints former J. Crew executive as CFO "
    }
]