[
    {
        "content": "* Las Vegas Sands Corp files for potential mixed shelf; size not disclosed Source text: (http://bit.ly/2hERKoZ) Further company coverage:",
        "date": "11032017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las Vegas Sands Corp files for potential mixed shelf size "
    },
    {
        "content": "HONG KONG  Oct 26 Las Vegas Sands  the casino behemoth owned by U.S. billionaire Sheldon Adelson  said on Wednesday it plans to spend $1.1 billion on new projects in the world's largest gambling hub  including building a London-themed attraction.",
        "date": "10262017",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "London comes to Macau as Las Vegas Sands revamps casino resort "
    },
    {
        "content": "* Change in accounting estimate resulted in $0.06 increase to Q3 EPS",
        "date": "10252017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las Vegas Sands reports Q3 EPS of $0.06 "
    },
    {
        "content": "Shares of Las Vegas casino operators fell as much as 5 percent in premarket trading on Monday after a gunman killed at least 50 people and wounded 200 others in a mass shooting on the Las Vegas strip.",
        "date": "10022017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "U.S. casino stocks fall following mass shooting in Las Vegas "
    },
    {
        "content": "* Casino stocks dip  while gunmakers rise after Las Vegas shooting",
        "date": "10022017",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "US STOCKS-Wall St to open higher on hopes of Trump tax plan progress "
    },
    {
        "content": "* Q2 earnings per share view $0.59 -- Thomson Reuters I/B/E/S",
        "date": "07262017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las Vegas Sands Q2 adjusted earnings per share $0.73 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  July 07 (Fitch) Fitch Ratings has affirmed the Issuer Default Ratings (IDRs) of Las Vegas Sands Corp. (LVS) and all of its subsidiaries at 'BBB-'. The Rating Outlook is Stable. The subsidiaries affirmed include Las Vegas Sands  LLC (LVS LLC)  Sands China  Ltd. (Sands China)  VML US Finance  LLC (VML US)  and Marina Bay Stands Pte. Ltd. (MBS). Fitch links all of the IDRs within the LVS corporate structure. A full list of rating",
        "date": "07072017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Fitch Affirms Las Vegas Sands' IDR at 'BBB-'; Outlook Stable "
    },
    {
        "content": "* Las Vegas Sands Corp - CEO Sheldon G. Adelson's 2016 total compensation was $12.7 million versus $12.2 million in 2015 – sec filing",
        "date": "04212017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las Vegas Sands CEO's 2016 compensation was $12.7 mln "
    },
    {
        "content": "* Las Vegas Sands Corp - Units entered into a fourth amendment to existing credit agreement dated as of December 19  2013",
        "date": "03292017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las Vegas Sands Corp's units entered into a fourth amendment to existing credit agreement dated as of Dec 19  2013 "
    },
    {
        "content": " (This Feb. 21 story corrects to show Melco Crown Entertainment is based in Hong Kong  not Australia  in the fifth paragraph)",
        "date": "02222017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Las Vegas Sands CEO says Japan casino resort could cost up to $10 billion "
    },
    {
        "content": "TOKYO  Feb 21 A resort hosting casinos in Japan could cost up to $10 billion to construct  Las Vegas Sands Corp's chief said on Tuesday  as the casino operator looks to win operating rights in what is widely expected to become the world's second-biggest casino market.",
        "date": "02212017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Las Vegas Sands CEO says Japan casino resort could cost up to $10 billion "
    },
    {
        "content": "TOKYO  Feb 21 A resort hosting casinos in Japan could cost up to $10 billion to build  Las Vegas Sands Corp's  chief said  as the casino operator looks to win operating rights in what is widely expected to become the world's second-biggest casino market.",
        "date": "02222017",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "CORRECTED-UPDATE 1-Las Vegas Sands CEO says Japan casino resort could cost up to $10 billion "
    },
    {
        "content": "* Las Vegas Sands reports fourth quarter and full year 2016 results",
        "date": "01252017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las Vegas Sands reports Q4 GAAP earnings per share $0.64 "
    },
    {
        "content": "Las Vegas Sands Corp agreed to pay a $6.96 million criminal penalty to end a U.S. Department of Justice probe into whether it violated a federal anti-bribery law by making payments to a consultant to help it do business in China and Macau.",
        "date": "01202017",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Las Vegas Sands pays $7 million to end U.S. criminal bribery case "
    },
    {
        "content": "Jan 19 Las Vegas Sands Corp agreed to pay a $6.96 million criminal penalty to end a U.S. Department of Justice probe into whether it violated a federal anti-bribery law by making payments to a consultant to help it do business in China and Macau.",
        "date": "01202017",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "UPDATE 2-Las Vegas Sands pays $7 mln to end U.S. criminal bribery case "
    },
    {
        "content": "Las Vegas Sands Corp agreed to pay a $6.96 million criminal penalty to end a U.S. Department of Justice probe into whether it violated a federal anti-bribery law by making payments to a consultant to help it do business in China and Macau.",
        "date": "01202017",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "Las Vegas Sands pays $7 mln to end U.S. criminal bribery case "
    },
    {
        "content": "Jan 19 Las Vegas Sands Corp agreed to pay a $6.96 million criminal penalty to end a U.S. Department of Justice probe into whether it violated a federal anti-bribery law by paying a consultant to help it do business in China and Macau.",
        "date": "01202017",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "Las Vegas Sands pays $7 mln to end US criminal bribery case "
    },
    {
        "content": "TOKYO Las Vegas-based MGM Resorts International  could plow almost $10 billion into a Japanese casino via a publicly traded real estate investment trust  its chief executive said on Monday  as Tokyo inches closer to legalizing the industry.",
        "date": "10312016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "MGM Resorts ready to bet up to $10 billion on Japan casino  possibly via REIT "
    },
    {
        "content": "* Odds for legalisation of casinos have improved   (Corrects the third bullet point and eighth and ninth paragraphs to show MGM is interested only in facilities in large metropolitan  not regional  areas)",
        "date": "10312016",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "CORRECTED-UPDATE 1-MGM Resorts ready to bet up to $10 bln on Japan casino  possibly via REIT "
    },
    {
        "content": " (This version of the Oct. 25 story corrects a typographical error in paragraph two to make it \"manner\" instead of \"matter\")",
        "date": "10262016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Nevada gambling regulator probes Las Vegas Sands over front gamblers "
    },
    {
        "content": "LAS VEGAS By the time the Las Vegas Sands Corp tried to collect on the gambling debts last year  the two women owed $6.4 million  lost during a few disastrous days of baccarat.",
        "date": "09302016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Special Report: Casino’s attempt to collect debt exposes world of Chinese high-rollers "
    },
    {
        "content": "LAS VEGAS  Sept 30 By the time the Las Vegas Sands Corp tried to collect on the gambling debts last year  the two women owed $6.4 million  lost during a few disastrous days of baccarat.",
        "date": "09302016",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "SPECIAL REPORT-Casino's attempt to collect debt exposes world of Chinese high-rollers "
    },
    {
        "content": "* Unit borrowed U.S. Dollar equivalent of approximately US$1 billion of new initial term loans  Source text: [http://bit.ly/2bAMhQ1] Further company coverage:",
        "date": "08312016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las vegas sands unit borrowed U.S. Dollar equivalent of nearly US$1 billion of new initial term loans "
    },
    {
        "content": "* Pursuant to amendment revolving lenders to provide revolving credit commitments in amount of $1.15 billion with a maturity of Sept. 19  2020",
        "date": "08122016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las Vegas Sands Says its Unit Las Vegas Sands LLC Entered into a second amendment to Existing Credit Agreement "
    },
    {
        "content": "HONG KONG  July 27 A U.S. court has ruled that a Hong Kong businessman's role in arranging meetings between Las Vegas Sands and Chinese government officials helped the casino company secure a license in Macau  the world's biggest gambling hub.",
        "date": "07272016",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "U.S. court rules Beijing meetings helped Las Vegas Sands in Macau "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 17 (Fitch) Fitch Ratings has affirmed the Issuer Default Ratings  (IDRs) of Las Vegas Sands Corp. (LVS) and all of its subsidiaries at 'BBB-'. The  Rating Outlook is Stable.  The subsidiaries affirmed include Las Vegas Sands  LLC (LVS LLC)  Sands China   Ltd. (Sands China)  VML US Finance  LLC (VML US)  and Marina Bay Stands Pte.  Ltd. (MBS). Fitch links all of the IDRs within the LVS corporate structure.  A full list of ",
        "date": "06172016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Fitch Affirms Las Vegas Sands' IDR at 'BBB-'; Outlook Stable "
    },
    {
        "content": "HONG KONG Sands China Ltd  the Macau casino company controlled by U.S. billionaire and prominent Republican donor Sheldon Adelson  said its parent Las Vegas Sands Corp has settled a lawsuit filed by a former chief executive  bringing an end to a near six-year legal battle.",
        "date": "06012016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Las Vegas Sands settles with former CEO of Macau casino unit "
    },
    {
        "content": "* Adelson denied former CEO allegations as fabrications   (Adds analyst comment  background context)",
        "date": "06012016",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "UPDATE 2-Las Vegas Sands settles with former CEO of Macau casino unit "
    },
    {
        "content": "HONG KONG  June 1 Sands China Ltd  the Macau casino company controlled by U.S. billionaire and prominent Republican donor Sheldon Adelson  said it has settled with a former chief executive  bringing an end to a near six-year legal battle.",
        "date": "06012016",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "U.S. billionaire Adelson's Macau casino says settles with former CEO "
    },
    {
        "content": "* Unit entered into an agreement with a subsidiary of Las Vegas Sands Corp",
        "date": "05252016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Madison Square Garden unit  Las Vegas Sands unit enter into an agreement "
    },
    {
        "content": "* On may 11  Nevada Gaming Control board filed complaint against co alleging certain violations of Nevada Gaming Control Act",
        "date": "05122016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las Vegas Sands- Nevada Gaming Control board filed complaint against co on May 11 "
    },
    {
        "content": "* Las Vegas Sands CEO Sheldon Adelson says he will back Donald Trump for the GOP nomination for President - New York Times",
        "date": "05062016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las Vegas Sands CEO says he will back Donald Trump for the GOP nomination for President - New York Times "
    },
    {
        "content": "HONG KONG A Macau court has ruled that a former business partner of Las Vegas Sands Corp  the world's biggest casino company  can proceed with a lawsuit seeking billions in damages for breaking the terms of their former partnership agreement.",
        "date": "04042016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Former Macau partner gets court nod to sue Las Vegas Sands for billions "
    },
    {
        "content": "HONG KONG  April 3 A Macau court has ruled that a former business partner of Las Vegas Sands Corp  the world's biggest casino company  can proceed with a lawsuit seeking billions in damages for breaking the terms of their former partnership agreement.",
        "date": "04032016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "RPT-Former Macau partner gets court nod to sue Las Vegas Sands for billions "
    },
    {
        "content": "April 7 The casino operator Las Vegas Sands Corp  agreed to pay $9 million to settle U.S. Securities and Exchange Commission charges it failed to properly authorize or document millions of dollars of payments to a consultant helping it do business in China and Macau.",
        "date": "04072016",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "Las Vegas Sands pays $9 mln to end SEC probe into China  Macau "
    },
    {
        "content": "HONG KONG  April 3 A Macau court has ruled that a former business partner of Las Vegas Sands Corp  the world's biggest casino company  can proceed with a lawsuit seeking billions in damages for breaking the terms of their former partnership agreement.",
        "date": "04032016",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "Former Macau partner gets court nod to sue Las Vegas Sands for billions "
    },
    {
        "content": "Las Vegas Sands Corp agreed to pay $9 million to end the U.S. Securities and Exchange Commission's more than five-year probe into whether it violated a federal anti-bribery law by paying a consultant to help it do business in China and Macau.",
        "date": "04072016",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "Las Vegas Sands pays $9 million to end SEC probe into China  Macau "
    },
    {
        "content": "April 7 Las Vegas Sands Corp agreed to pay $9 million to end the U.S. Securities and Exchange Commission's more than five-year probe into whether it violated a federal anti-bribery law by paying a consultant to help it do business in China and Macau.",
        "date": "04072016",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "UPDATE 2-Las Vegas Sands pays $9 mln to end SEC probe into China  Macau "
    },
    {
        "content": "* Las Vegas Sands announces appointment of Patrick Dumont as chief financial officer",
        "date": "03302016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "BRIEF-Las Vegas Sands appoints Patrick Dumont as CFO "
    },
    {
        "content": "Las Vegas Sands Corp persuaded Nevada's highest court to throw out a more than $100 million verdict in favor of a Hong Kong businessman for helping Sheldon Adelson's gaming company enter the fledgling Macau casino market more than a decade ago.",
        "date": "03142016",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Adelson's Las Vegas Sands wins new U.S. trial in $100 million Macau case "
    },
    {
        "content": "March 14 Las Vegas Sands Corp persuaded Nevada's highest court to throw out a more than $100 million verdict in favor of a Hong Kong businessman for helping Sheldon Adelson's gaming company enter the fledgling Macau casino market more than a decade ago.",
        "date": "03142016",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "Adelson's Las Vegas Sands wins new U.S. trial in $100 mln Macau case "
    },
    {
        "content": "MACAU  Dec 18 Gambling giant Las Vegas Sands Corp's Chief Executive Sheldon Adelson said on Friday that a long-term slide in Macau's gaming market is close to bottoming out  with a turnaround in sight in 2016 after 18 consecutive months of declines.",
        "date": "12182015",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "Las Vegas Sands CEO Adelson says Macau gaming market near bottom  sees 2016 turnaround "
    },
    {
        "content": "NEW YORK  Dec 16 Putting to end a week-long guessing game that has obsessed media watchers and political pundits alike  billionaire Sheldon Adelson  the CEO of Las Vegas Sands Corp.   was unmasked Wednesday as the new owner of the Las Vegas Review-Journal newspaper  according to Fortune magazine  which cited \"multiple sources familiar with the situation.\"",
        "date": "12162015",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "RPT-Republican mega donor Sheldon Adelson revealed as mystery buyer of Nevada newspaper "
    },
    {
        "content": "A federal judge in Las Vegas granted the Las Vegas Sands Corp a temporary restraining order against the unknown owners of 15 online gambling sites that prominently feature the resort's trademarked \"Venetian\" logo on their websites.",
        "date": "12112015",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Las Vegas Sands gets TRO against online casinos "
    },
    {
        "content": "NEW YORK A U.S. government watchdog group has asked two federal oversight agencies to investigate billionaire Sheldon Adelson to determine  if any money he donated to political campaigns in the past was illegally laundered in his foreign casinos.",
        "date": "11192015",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Watchdog group seeks probe of billionaire Adelson's U.S. political donations "
    },
    {
        "content": "Casino operator Las Vegas Sands Corp's  said cost cutting at its Macau properties helped it post better second-quarter earnings  compared with the first quarter  sending its shares up about 4 percent.",
        "date": "07222015",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Las Vegas Sands's cost cutting in Macau sends shares up "
    },
    {
        "content": "July 22 Casino operator Las Vegas Sands Corp's  said cost cutting at its Macau properties helped it post better second-quarter earnings  compared with the first quarter  sending its shares up about 4 percent.",
        "date": "07222015",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "UPDATE 1-Las Vegas Sands's cost cutting in Macau sends shares up "
    },
    {
        "content": "July 22 Casino operator Las Vegas Sands Corp  reported a 19.4 percent fall in second-quarter revenue because of challenging conditions in Macao.",
        "date": "07222015",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "Las Vegas Sands revenue falls 19.4 pct "
    },
    {
        "content": "LAS VEGAS  May 5 Las Vegas Sands Chief Executive Sheldon Adelson denied accusations of wrongdoing in China's casino center of Macau on Tuesday  telling a Las Vegas court that the former head of Sands China had fabricated allegations in a wrongful termination lawsuit.",
        "date": "05062015",
        "name": "Las Vegas Sands Corp",
        "news_type": "normal",
        "symbol": "LVS",
        "title": "Las Vegas Sands CEO Adelson denies wrongdoing in China "
    },
    {
        "content": "Caesars Entertainment Corp   under investigation by the U.S. Treasury and a federal grand jury over alleged failures to comply with anti-money laundering law  has hired away Wal-Mart Stores Inc's  top expert.",
        "date": "02032015",
        "name": "Las Vegas Sands Corp",
        "news_type": "topStory",
        "symbol": "LVS",
        "title": "Exclusive: Amid U.S. probes  Caesars poaches top money laundering expert "
    }
]