[
    {
        "content": "LONDON  Nov 6 The former head of Lloyds Banking Group told a court on Monday the decision to buy troubled rival HBOS at the height of the financial crisis nine years ago was purely commercial and not an act of charity.",
        "date": "11062017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Former Lloyds boss says takeover of HBOS was no act of charity "
    },
    {
        "content": "LONDON  Nov 2 The initial public offering (IPO) of En+   which manages tycoon Oleg Deripaska's aluminium and hydropower businesses  is expected to price at $14 per global depositary receipt (GDR)  the bottom of a previously announced range.",
        "date": "11022017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Russia's En+ expected to price at $14/depositary receipt  bottom of range -bookrunner "
    },
    {
        "content": "LONDON Lloyds Banking Group opened a 500 million pound ($658 million) fund to help British businesses finance equipment on Tuesday  targeting small and medium-sized companies which banks froze out of credit following the financial crisis.",
        "date": "10232017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Britain's Lloyds launches 500 million pound fund for small companies "
    },
    {
        "content": "LONDON  Oct 24 Lloyds Banking Group opened a 500 million pound ($658 million) fund to help British businesses finance equipment on Tuesday  targeting small and medium-sized companies which banks froze out of credit following the financial crisis.",
        "date": "10232017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain's Lloyds launches 500 mln stg fund for small companies "
    },
    {
        "content": "LONDON  Oct 25 The former finance director of Lloyds Banking Group denied on Wednesday that the bank had been compelled to rescue British rival HBOS during the financial crisis nine years ago  and said the price it paid for HBOS was \"appropriate\".",
        "date": "10252017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds paid \"appropriate\" price for HBOS  former finance chief tells court "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Lloyds Banking Group’s dividend gusher has suffered a regulatory blockage. Britain’s biggest retail lender reported a robust pre-tax profit of close to 2 billion pounds for the three months to September and topped up its already-healthy capital ratios. Shareholders might have hoped that Lloyds will spray some of that cash in their direction. Regulators have other ideas.",
        "date": "10252017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Breakingviews - Lloyds capital gusher suffers regulatory blockage "
    },
    {
        "content": "LONDON  Oct 18 Former bosses of Lloyds Banking Group used \"spin and sales puff\" to win over investors and secure a \"disastrous\" acquisition of rival HBOS during the credit crisis  a lawyer for thousands of shareholders told London's High Court on Wedesday.",
        "date": "10182017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Ex-Lloyds bank bosses used \"spin and puff\" in HBOS deal  court told "
    },
    {
        "content": "* Consumers well placed to cope with rate hike - CEO (Recasts  adds share performance)",
        "date": "10252017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds gives \"resilient\" British economy all clear as profit rises "
    },
    {
        "content": "LONDON  Oct 25 Lloyds Banking Group said its pre-tax profit for the first nine months of the year rose 38 percent to 4.5 billion pounds ($5.91 billion)  building on the eight-year profit record it achieved in the first six months of the year.",
        "date": "10252017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain's Lloyds posts 38 pct rise in nine month profit "
    },
    {
        "content": "LONDON  Oct 12 Lloyds Banking Group has agreed a deal to buy Zurich Insurance's UK workplace pensions and savings business  the bank said on Thursday.",
        "date": "10122017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds buys Zurich UK's pensions  savings business "
    },
    {
        "content": "LONDON  Oct 12 Lloyds Banking Group has agreed to buy Zurich Insurance's UK workplace pensions and savings business as it expands its retirement business  the bank said on Thursday.",
        "date": "10122017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds buys Zurich UK's pensions  savings business "
    },
    {
        "content": "LONDON  Oct 11 (IFR) - Lloyds Banking Group has appointed Ed Thurman as head of global transaction banking (GTB) under a rejig of senior management in its commercial banking division.",
        "date": "10112017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES-Thurman to head Lloyds transaction banking "
    },
    {
        "content": "* ‍ENTERED INTO AN AGREEMENT WITH ZURICH TO ACQUIRE ITS UK WORKPLACE PENSIONS AND SAVINGS BUSINESS WITH ASSETS UNDER ADMINISTRATION OF 19 BILLION STG​",
        "date": "10122017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking to buy Zurich UK workplace pensions and savings unit "
    },
    {
        "content": "Oct 11 Lloyds Banking Group Plc said it made two appointments in its commercial banking division  including naming a new managing director of global transaction banking.",
        "date": "10112017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "MOVES-Lloyds Banking makes two appointments in commercial banking unit "
    },
    {
        "content": "LONDON  Sept 26 Lloyds Banking Group on Tuesday told about 1 000 staff in its insurance division that they will be moving to Diligenta  a subsidiary of India's Tata Consultancy Services  according to the Unite union.",
        "date": "09262017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds bank to transfer 1 000 staff to India's Tata Consultancy Services "
    },
    {
        "content": "LONDON  Sept 26 Lloyds Banking Group on Tuesday told about 1 000 staff in its insurance division that they will be moving to Diligenta  a subsidiary of India's Tata Consultancy Services  in a move criticised by trade union Unite.",
        "date": "09262017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds bank to transfer 1 000 staff to India's Tata Consultancy Services "
    },
    {
        "content": "Sept 22 Lloyds Banking Group Plc named Scott Barton managing director  mid markets  of it its commercial banking unit  effective Nov. 1.",
        "date": "09222017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES-Lloyds hires ex-StanChart exec as managing director "
    },
    {
        "content": "LONDON  Sept 5 Complaints about banks and insurers in Britain rose in the first half of 2017 with the figures still dominated by loan insurance as a compensation deadline for mis-selling is publicised  the Financial Ombudsman Service said on Tuesday.",
        "date": "09042017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds bank tops complaints league in Britain "
    },
    {
        "content": "LONDON  Sept 4 Lloyds Banking Group will announce on Monday the boss of a credit card business bought by the lender will lead a push into expanding its card business in an effort to boost profit and reduce its reliance on mortgage lending.",
        "date": "09042017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds appoints MBNA boss to lead credit card growth push-source "
    },
    {
        "content": "* LLOYDS BANKING - INTRODUCED CHANGES TO ITS LENDING POLICY ON NEW BUILD PROPERTIES IN ORDER TO PROVIDE GREATER CHOICE FOR HOMEBUYERS AND THEIR ADVISERS",
        "date": "08102017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking introduces changes to lending policy "
    },
    {
        "content": "Aug 8 Lloyds Banking Group Plc's commercial banking division on Tuesday named Madeleine McDougall as head of its real estate team.",
        "date": "08082017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES-Lloyds names McDougall head of commercial real estate team "
    },
    {
        "content": "LONDON British TV presenter and former disc jockey Noel Edmonds has more than quadrupled the damages he is seeking from Lloyds Banking Group to 300 million pounds ($392 million) as he steps up a 12-year demand for compensation.",
        "date": "07252017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "British TV personality Edmonds demands $392 million compensation for Lloyds HBOS' unit fraud "
    },
    {
        "content": "LONDON  July 25 British TV presenter and former disc jockey Noel Edmonds has more than quadrupled the damages he is seeking from Lloyds Banking Group to 300 million pounds ($392 million) as he steps up a 12-year demand for compensation.",
        "date": "07252017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-British TV personality Edmonds demands $392 mln compensation for Lloyds HBOS' unit fraud "
    },
    {
        "content": "LONDON  July 25 British TV presenter and former disc jockey Noel Edmonds has more than quadrupled the amount of damages he is seeking from Lloyds Banking Group to 300 million pounds ($392 million) as he steps up his 12-year demand for compensation.",
        "date": "07252017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "British TV personality Edmonds demands $392 mln compensation for Lloyds HBOS' unit fraud "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Lloyds is a good bank in a bad place: Britain. The UK lender beat earnings expectations in the second quarter. The productivity of its loan book is rising and costs are falling relative to income. If it weren’t for fears about Britain’s exit from the European Union  and a seemingly bottomless pit of charges for past bad behaviour  Lloyds could be worth 10 percent more. Sadly  what is matters more to investors than what might be.",
        "date": "07272017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds is a good bank in a bad place "
    },
    {
        "content": "LONDON  July 21 Lloyds Banking Group said it on Friday it was close to making compensation offers to 30 of the 67 customers impacted by one of Britain's biggest banking frauds after criticism about the pace of redress.",
        "date": "07212017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds bank makes offers on compensation for fraud after delay "
    },
    {
        "content": "* CEO says no intention of leaving the bank (Adds shares  CEO comment)",
        "date": "07272017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds bank posts biggest half-year profit since 2009 "
    },
    {
        "content": "* Lloyds banking group ceo says \"i have no intention of going anywhere\" in response to speculation over departure Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds banking group ceo says \"i have no intention of going anywhere\" in response to speculation over departure "
    },
    {
        "content": "LONDON  July 19 The Bank of England has widened access to Britain's interbank payments system to increase competition from new fintech firms in the financial system  where the \"Big Four\" high street banks have long dominated.",
        "date": "07192017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Bank of England opens up payments systems to spur fintech "
    },
    {
        "content": "* Britain's FCA says Lloyds to set up redress scheme for mortgage customers who incurred fees after they fell behind with their mortgage payments",
        "date": "07272017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds to pay 283 mln stg in compensation over mortgage fees "
    },
    {
        "content": "LONDON  July 12 Lloyds Banking Group announced on Wednesday it is overhauling overdraft charges for millions of customers after widespread criticism about the high rates of borrowing.",
        "date": "07122017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds bank to reduce cost of overdrafts after criticism "
    },
    {
        "content": "LONDON  July 5 Lloyds Banking Group has reshuffled its senior management team  it said on Wednesday  as Britain's biggest mortgage lender prepares for the next phase of its transformation into a leaner  low-risk bank.",
        "date": "07052017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds Bank shuffles management team ahead of 2018 strategy "
    },
    {
        "content": "LONDON  July 5 (IFR) - Lloyds Banking Group has expanded the role of finance chief George Culmer and named David Oldfield as new head of commercial and wholesale banking as part of a raft of senior leadership changes  potentially providing options for who will become its next CEO.",
        "date": "07052017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "MOVES-All change at Lloyds as Oldfield takes over commercial "
    },
    {
        "content": "LONDON  July 5 Lloyds Banking Group has reshuffled its senior management team and made a raft of changes to its organisational structure as it prepares to announce its next three-year strategic plan  the lender said on Wednesday.",
        "date": "07052017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds Bank reshuffles senior management team ahead of new strategy "
    },
    {
        "content": "LONDON  June 27 Lloyds Banking Group is set to miss an end-June deadline for offering compensation to victims of one of Britain's largest fraud cases  the latest delay in a decade-long struggle by business owners for redress.",
        "date": "06272017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds fraud victims bemoan 'pyrrhic victory' as compensation scheme drags "
    },
    {
        "content": "LONDON  June 30 Lloyds Banking Group said on Friday it has made compensation offers to only seven of 67 customers impacted by one of Britain's biggest banking frauds  the latest delay in a decade-long struggle by business owners for redress.",
        "date": "06302017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UK bank Lloyds misses HBOS fraud payout deadline "
    },
    {
        "content": "* Victims say face delays for compensation (Adds comment from parliamentary group for fair banking)",
        "date": "06272017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds fraud victims bemoan 'pyrrhic victory' as compensation scheme drags "
    },
    {
        "content": "LONDON  June 30 Britain's Lloyds Banking Group said on Friday that it has stopped trading Qatari riyals and that the currency is no longer available for sale or buy-back at its high-street banks.",
        "date": "06302017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Britain's Lloyds bank says it has stopped trading Qatari riyals "
    },
    {
        "content": "LONDON  June 30 Britain's Lloyds Banking Group said on Friday that it has stopped trading Qatari Riyals and that the currency is no longer available for sale or buy-back at its high-street banks.",
        "date": "06302017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain's Lloyds bank says it has stopped trading Qatari Riyals "
    },
    {
        "content": "June 6 Lloyds Bank Commercial Banking  a unit of Lloyds Banking Group Plc  named John Feeney as the head of its global corporates division.",
        "date": "06062017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES-Lloyds Bank names new head of global corporates unit "
    },
    {
        "content": "* Lloyds banking group (' group') today announces that it has completed acquisition of MBNA Ltd Source text for Eikon: Further company coverage: (Reporting By Rachel Armstrong)",
        "date": "06012017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds completes acquisition of MBNA "
    },
    {
        "content": "* Bank of America - expects to complete sale of consumer credit card business in U.K.  MBNA Ltd.  to Lloyds Banking Group on June 1",
        "date": "05312017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Bank of America expects to complete sale of consumer credit card business in UK  MBNA Ltd  to Lloyds Banking Group on June 1 "
    },
    {
        "content": "* CEO Antonio Horta-Osorio bought 50 000 shares in the bank at 72.31 pence per share on May 17 Source text for Eikon: Further company coverage: (Reporting By Rachel Armstrong)",
        "date": "05182017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds CEO buys 50 000 shares in the bank "
    },
    {
        "content": "LONDON  May 17 Britain has sold its last remaining stake in Lloyds Banking Group  making the lender the first to re-emerge from British state ownership in a symbolic step for the country's recovering banking sector.",
        "date": "05172017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds new era begins as government sells off final shares "
    },
    {
        "content": "LONDON Britain is set to sell its remaining stake in Lloyds Banking Group  on Wednesday  making the lender the first to re-emerge from British state ownership in a symbolic step for the country's recovering banking sector.",
        "date": "05162017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Britain set to sell last of Lloyds stake in symbolic step "
    },
    {
        "content": "LONDON Lloyds  Chief Executive Antonio Horta-Osorio traveled at the front of the British Airways plane last week  enjoying the extra leg room in the business section on his way from London to the bank's annual meeting in Edinburgh.",
        "date": "05172017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "As Lloyds flies free  RBS years away from leaving state hands "
    },
    {
        "content": "LONDON  May 17 Britain has sold its last remaining stake in Lloyds Banking Group  making the lender the first to re-emerge from British state ownership in a symbolic step for the country's recovering banking sector.",
        "date": "05172017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds new era begins as government sells off final shares "
    },
    {
        "content": "* Disposal comes after 2008 bailout led to state holding (Adds details)",
        "date": "05162017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Britain set to sell last of Lloyds stake in symbolic step "
    },
    {
        "content": "LONDON  May 16 The British government is due to announce the sale of its  remaining stake in Lloyds Banking Group on Wednesday  the first lender to fully repay its state bailout in a landmark moment for the recovery of Britain's banking sector.",
        "date": "05162017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "British government is due to sell down its final stake in Lloyds - sources "
    },
    {
        "content": "* UK government reduces stake in Lloyds Banking Group Plc to 0 percent Source text for Eikon: Further company coverage: (Reporting By Rachel Armstrong)",
        "date": "05172017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-UK government sells final stake in Lloyds "
    },
    {
        "content": "*  says bank is well-managed  valuation \"very attractive\" Further company coverage:",
        "date": "05122017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Woodford fund starts investing in Lloyds Bank "
    },
    {
        "content": "EDINBURGH The British government will make at least a 500 million pound ($645 million) profit from its bailout of Lloyds Banking Group   Chief Executive Antonio Horta-Osorio said on Thursday  as the lender nears a return to private hands.",
        "date": "05112017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds Bank says Britain to make at least $645 million from bailout "
    },
    {
        "content": "* Shareholders grill bank over HBOS scandal (Adds details  HBOS case)",
        "date": "05112017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds Bank says Britain to make at least 500 mln pounds from bailout "
    },
    {
        "content": "LONDON  May 11 The British government's stake in Lloyds Banking Group is down to 0.25 percent  the bank's chairman Norman Blackwell said on Thursday  putting the lender on track to be in full private ownership within 'days'.",
        "date": "05112017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds Banking Group says government shareholding down to 0.25 pct "
    },
    {
        "content": "* Uk financial holdings' stake in Lloyds Banking Group reduced to 0.25 percent- Bank Chairman Blackwell Source text for Eikon: Further company coverage: (Reporting by Lawrence White)",
        "date": "05112017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Uk financial holdings' stake in lloyds banking group reduced to 0.25 percent "
    },
    {
        "content": "LONDON  May 2 Lloyds Banking Group said on Tuesday that James Lupton  chairman of investment bank Greenhill's European arm  will be joining its board.",
        "date": "05022017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds names James Lupton as chair of non ring-fenced bank "
    },
    {
        "content": "* Conservative peer Lord Lupton to join Lloyds Bank board as the government sells its remaining shares in the company - Sky News  citing sources Further company coverage: (Bengaluru Newsroom)",
        "date": "05012017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Conservative peer Lord Lupton to join Lloyds Bank board as the government sells its remaining shares in the company - Sky News "
    },
    {
        "content": "May 5 Uk Competition Authority has decided not to refer Lloyds Banking Group Plc acquisition of MBNA Ltd to a Phase 2 investigation",
        "date": "05052017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds' MBNA acquisition avoids in-depth UK competition probe "
    },
    {
        "content": "LONDON  April 28 The British government has reduced its holding in Lloyds Banking Group PLC to less than 1 percent  putting the lender on track to be in full private ownership within weeks.",
        "date": "04282017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "British government cuts stake in Lloyds bank to below 1 percent "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Lloyds Banking Group has hit peak Antonio Horta-Osorio. The UK lender’s recovery under its current chief executive has been impressive  however one slices it. But from here  his efforts become relatively less important in driving Lloyds’ returns than what happens to the British economy.",
        "date": "04272017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds hits peak Horta-Osorio "
    },
    {
        "content": "LONDON Taxpayers have recouped all of the 20.3 billion pounds ($26 billion)invested in the bailout of Lloyds Banking Group  during the 2008 financial crisis  Britain's Chancellor of the Exchequer Philip Hammond said on Friday.",
        "date": "04212017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Britain draws line under Lloyds rescue with $26 billion recovery "
    },
    {
        "content": "* Shares climb 3.5 pct (Adds share reaction  executive quote)",
        "date": "04272017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds bucks expectations of post-Brexit dip as Q1 profit holds up "
    },
    {
        "content": "* Lloyds bank CEO says does not expect any base interest rate increase in 2017 Source text for Eikon: Further company coverage: (Reporting by Lawrence White)",
        "date": "04272017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds bank CEO says does not expect any rate hike in 2017 "
    },
    {
        "content": "* On track to deliver group financial targets for 2017 with longer term guidance maintained",
        "date": "04272017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Bank targets cost-income ratio of 45 pct "
    },
    {
        "content": "* Lloyds appoints lawyer to probe its handling of case (Adds victim statement)",
        "date": "04072017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-Britain's Lloyds to compensate fraud victims with $125 mln scheme "
    },
    {
        "content": "LONDON Lloyds Banking Group  plans to close a further 100 branches resulting in the loss of over 325 jobs  the bank said on Wednesday  as part of a strategy to reduce costs.",
        "date": "04052017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds Banking Group to close 100 branches and cut over 325 jobs "
    },
    {
        "content": "LONDON  April 7 Lloyds Banking Group will set aside about 100 million pounds ($124.51 million) to compensate customers who were victims of a fraud for which six people were jailed earlier this year  it said on Friday.",
        "date": "04072017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds to take 100 mln stg charge for HBOS fraud compensation "
    },
    {
        "content": "LONDON  April 5 Lloyds Banking Group plans to close a further 100 branches resulting in the loss of over 325 jobs  the bank said on Wednesday  as part of a strategy to reduce costs.",
        "date": "04052017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds Banking Group to close 100 branches and cut over 325 jobs "
    },
    {
        "content": "LONDON  April 5 Lloyds Banking Group plans to close a further 100 branches resulting in the loss of over 200 jobs  according to the Unite trade union.",
        "date": "04052017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds to close 100 branches  over 200 jobs eliminated - union "
    },
    {
        "content": "LONDON  April 3 The British government has reduced its holding in Lloyds Banking Group PLC to less than 2 percent  putting the lender on track to be in full private ownership within weeks.",
        "date": "04032017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "British government cuts stake in Lloyds Bank to below 2 pct "
    },
    {
        "content": "* Government has continued to sell shares in Lloyds Banking Group  reducing its remaining shareholding to less than 2 percent",
        "date": "04032017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-British government cuts stake in Lloyds to below 2 percent "
    },
    {
        "content": "LONDON  March 20 Lloyds Banking Group on Monday said it appointed a businessman to review the cases of British companies which lost out in a 245 million pound ($304 million) fraud for which six people were jailed earlier this year.",
        "date": "03202017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds appoints businessman to review HBOS fraud compensation claims "
    },
    {
        "content": "LONDON  March 15 The British government has reduced its stake in Lloyds Banking Group to just below 3 percent  putting the lender on track to be back in private ownership within the next few months.",
        "date": "03152017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "British government cuts stake in Lloyds to below 3 percent "
    },
    {
        "content": "* Simon Henry  independent non-exec director  will succeed Nick Luff as chairman of audit committee with effect from May 1  2017",
        "date": "03162017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking Group names next chairman of audit committee "
    },
    {
        "content": "NEW YORK A U.S. judge on Friday dismissed Lloyds Banking Group Plc  ICAP Europe Ltd and Tullett Prebon Plc as defendants from litigation alleging a conspiracy among many financial services companies to manipulate the yen Libor and Euroyen Tibor benchmark interest rates.",
        "date": "03132017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds  two others dismissed from yen Libor litigation in U.S. "
    },
    {
        "content": "NEW YORK  March 10 A U.S. judge on Friday dismissed Lloyds Banking Group Plc  ICAP Europe Ltd and Tullett Prebon Plc as defendants from litigation alleging a conspiracy among many financial services companies to manipulate the yen Libor and Euroyen Tibor benchmark interest rates.",
        "date": "03102017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds  two others dismissed from yen Libor litigation in U.S. "
    },
    {
        "content": "LONDON  March 10 Lloyds Banking Group took a surprise 350 million pound ($425 million) charge on Friday to compensate customers mis-sold loan insurance  six months after saying it had hopefully drawn a line under the scandal.",
        "date": "03102017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds dealt new blow with $425 million pound charge "
    },
    {
        "content": "LONDON  March 10 Lloyds Banking Group said on Friday it has taken a further 350 million pound ($425.29 million) provision to compensate customers for mis-sold loan insurance.",
        "date": "03102017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Mis-sold loan insurance costs Lloyds another $425 million "
    },
    {
        "content": "LONDON  Feb 23 The British government said on Thursday it has further reduced its stake in Lloyds Banking Group  a day after the bank posted its highest profit since before the 2007-2009 global financial crisis.",
        "date": "02232017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "CORRECTED-British government cuts stake in Lloyds to below 4 percent "
    },
    {
        "content": "LONDON  Feb 22 Britain's top share index edged up on Wednesday as Lloyds reported its highest annual profit in a decade and the UK's biggest housebuilder Barratt  announced upbeat results.",
        "date": "02222017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds and Barratt help Britain's FTSE edge higher "
    },
    {
        "content": "* Shares climb 4 pct  top in FTSE 100   (Adds shares  EU subsidiary plans)",
        "date": "02222017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Britain's Lloyds hits 10-year profit high as new era beckons "
    },
    {
        "content": "LONDON  Feb 22 European shares climbed to a new 14-month high on Wednesday  supported by well-received earnings updates from companies such as Lloyds  Telefonica Deutschland and Scor.",
        "date": "02222017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "European shares hit new 14-month high  positive earnings boost "
    },
    {
        "content": "* Total bonus outcome has increased year-on-year to 392.9 million pounds (from 353.7 million pounds in 2015).",
        "date": "02222017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds raises 2016 bonuses "
    },
    {
        "content": "* Lloyds banking group  full year underlying profit 7.9 billion stg",
        "date": "02222017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking Group 2016 statutory profit before tax 4.2 billion stg "
    },
    {
        "content": "LONDON Lloyds Banking Group  is close to selecting Berlin as a European base to secure market access to the European Union when Britain leaves the bloc  sources told Reuters.",
        "date": "02132017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Exclusive: Lloyds Bank closes in on Berlin as post-Brexit EU hub - sources "
    },
    {
        "content": "LONDON Lloyds Banking Group  is to review the cases of British businesses which lost out in a 245 million pound ($303 million) fraud for which six people were jailed last week.",
        "date": "02072017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds bows to pressure to review HBOS fraud compensation claims "
    },
    {
        "content": "* Six people convicted and given combined 47 years in jail   (Adds details)",
        "date": "02072017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds bows to pressure to review HBOS fraud compensation claims "
    },
    {
        "content": "LONDON  Feb 9 Lloyds Banking Group is the latest bank to join a new British cyber security group for banks called the Cyber Defence Alliance (CDA)  sources with direct knowledge of the matter told Reuters.",
        "date": "02092017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds joins new British banking cyber defence alliance -sources "
    },
    {
        "content": "LONDON  Feb 7 Lloyds Banking Group said it is undertaking a review of customer cases impacted by two corrupt former bankers who helped orchestrate a 245 million pound  ($302.92 million) fraud that siphoned off money from struggling businesses.",
        "date": "02072017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds to review customers impacted by HBOS loan scandal "
    },
    {
        "content": "LONDON  Jan 30 The British government has reduced its stake in Lloyds Banking Group to just below 5 percent as it aims to return the bank to full private ownership in the next few months.",
        "date": "01302017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-British government cuts stake in Lloyds to below 5 percent "
    },
    {
        "content": "LONDON  Jan 30 The British government has cut its stake in Lloyds Banking Group to just below 5 percent as it aims to return the bank to full private ownership in the next few months.",
        "date": "01302017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "British government cuts stake in Lloyds to below 5 percent "
    },
    {
        "content": "Jan 25 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01252017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES-Lloyds Bank  Harvard University  HSBC  Unicredit "
    },
    {
        "content": "Lloyds Bank appointed Kristan Gochee as head of financial markets and Wesley Fallan as head of capital markets  both to its North America business.",
        "date": "01262017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds Bank makes appointments to North America business "
    },
    {
        "content": "LONDON  Jan 23 Lloyds Banking Group is working with law enforcement agencies to trace who may be behind a cyber attack that caused intermittent outages for customers of its personal banking websites almost two weeks ago  according to a source familiar with the incident.",
        "date": "01232017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds a victim of cyber attack that hit banking services "
    },
    {
        "content": "Jan 25 Lloyds Bank appointed Kristan Gochee as head of financial markets and Wesley Fallan as head of capital markets  both to its North America business.",
        "date": "01262017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "REFILE-MOVES-Lloyds Bank makes appointments to North America business (Jan. 25) "
    },
    {
        "content": "LONDON  Jan 19 (Thomson Reuters Foundation) - Lloyds Banking Group was named on Thursday as Britain's best employer for lesbian  gay  bisexual and transgender (LGBT) people in a nationwide workplace equality index  followed by law firm Pinsent Masons and J.P. Morgan bank.",
        "date": "01192017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds bank named Britain's best employer for LGBT people "
    },
    {
        "content": "LONDON/ANKARA  Jan 19 The Royal Bank of Scotland  has rebuffed efforts by the British government  a major shareholder  to coax the lender into facilitating trade with Iran as it seeks to avoid risky business  sources with knowledge of the discussions say.",
        "date": "01192017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "State-backed British bank rebuffs government push to boost Iran trade - sources "
    },
    {
        "content": "LONDON Lloyds Banking Group  is considering setting up a subsidiary in Frankfurt as Britain prepares to leave the European Union  according to a person familiar with the plans.",
        "date": "01182017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds Bank considers setting up subsidiary in Germany: source "
    },
    {
        "content": "Jan 12 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01122017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES-Mizuho  RWC Partners  BMO "
    },
    {
        "content": "Jan 12 Lloyds Bank said Andy Schaeffer would replace Mark Grant as chief executive of its North America business  effective Feb. 1.",
        "date": "01122017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "MOVES-Lloyds Bank North America appoints CEO "
    },
    {
        "content": "LONDON  Jan 12 Some Lloyds Banking Group  customers were struggling to access their online accounts for a second day after the British bank said on Thursday it was working to identify an intermittent glitch in its system.",
        "date": "01122017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds online banking services hit by intermittent glitch "
    },
    {
        "content": "LONDON  Jan 9 The British government is no longer top shareholder in Lloyds Banking Group after reducing its stake to below 6 percent as it aims to return the lender to full private ownership this year.",
        "date": "01092017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-British government no longer top Lloyds shareholder "
    },
    {
        "content": "LONDON  Jan 9 Britain has cut its stake in Lloyds Banking Group to below 6 percent as it attempts to return the lender to full private ownership this year.",
        "date": "01092017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain sells further 1 percent of Lloyds shares "
    },
    {
        "content": "* UK government reduces stake in Lloyds Banking Group to 5.95 percent  Source text for Eikon:  Further company coverage:    (Reporting By Rachel Armstrong)",
        "date": "01092017",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Britain sells further 1 percent of Lloyds shares "
    },
    {
        "content": "LONDON Lloyds Banking Group  is buying the MBNA UK credit card business from Bank of America  for 1.9 billion pounds ($2.4 billion) in an effort to increase profit and reduce its reliance on mortgage lending.",
        "date": "12202016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds banks on credit card growth with $2.4 billion MBNA buy "
    },
    {
        "content": "LONDON Britain has cut its stake in Lloyds Banking Group  to just below 8 percent in a renewed attempt to return the lender to full private ownership over the next year.Lloyds said in a statement on Tuesday the government had reduced its stake in the bank by about 1 percentage point to 7.99 percent.  UK Financial Investments Limited (UKFI)  which manages the government's stake in the bailed-out bank  last month resumed share sales that were shelved almost a year ago bec",
        "date": "11222016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Britain sells a further 1 percent of Lloyds shares "
    },
    {
        "content": "LONDON  Nov 22 Britain has cut its stake in Lloyds Banking Group to just below 8 percent in a renewed attempt to return the lender to full private ownership over the next year.",
        "date": "11222016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Britain sells a further 1 percent of Lloyds shares "
    },
    {
        "content": "LONDON  Nov 22 Britain has cut its stake in Lloyds Banking Group to just below 8 percent in a renewed attempt to return the lender to full private ownership over the next year.",
        "date": "11222016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain sells about 1 percent of Lloyds shares "
    },
    {
        "content": "* Redemption of preference shares issued by Lloyds Banking Group plc",
        "date": "11152016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking Group redeems $1 bln preference shares "
    },
    {
        "content": "* Previously announced cash tender offer for a combined aggregate purchase price of up to $2 000 000 000 of certain series of outstanding U.S. dollar denominated notes",
        "date": "11102016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds announces early results of tender offer for up to $2 bln U.S. notes "
    },
    {
        "content": "LONDON Lloyds Banking Group is to cut a further 520 jobs as part of a three-year restructuring plan announced in October 2014 aimed at cutting costs and improving returns for shareholders.",
        "date": "11092016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds Bank to cut further 520 jobs and close 49 branches "
    },
    {
        "content": "* Branch closures to start in Q1 2017   (Adds background on previous cuts  shares)",
        "date": "11092016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds Bank to cut further 520 jobs and close 49 branches "
    },
    {
        "content": "LONDON  Nov 9 Lloyds Banking Group has announced on Wednesday that it will cut a further 520 jobs as part of a three-year restructuring plan announced in October 2014 aimed at cutting costs and improving returns for shareholders.",
        "date": "11092016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds Bank announces 520 job cuts and 49 branch closures "
    },
    {
        "content": "LONDON Britain has cut its stake in Lloyds Banking Group  to just below 9 percent in a renewed attempt to return the lender to full private ownership over the next year.",
        "date": "10272016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Britain resumes Lloyds exit with first share sale in a year "
    },
    {
        "content": "LONDON  Oct 27 Britain has cut its stake in Lloyds Banking Group to just below 9 percent in a renewed attempt to return the lender to full private ownership over the next year.",
        "date": "10272016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Britain resumes Lloyds exit with first share sale in a year "
    },
    {
        "content": "LONDON  Oct 27 The British government said on Thursday it had reduced its stake in Lloyds Banking Group  to just below 9 percent  its first sale since the relaunch of a trading plan that was shelved almost a year ago because of market turbulence.",
        "date": "10272016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "British government reduces stake in Lloyds to below 9 pct "
    },
    {
        "content": "LONDON  Oct 26 Britain's top share index fell on Wednesday  hit by weakness in banks and mining stocks after Lloyds and Antofagasta respectively fell after disappointing earnings updates.",
        "date": "10262016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds and Anto hit Britain's FTSE after reuslts "
    },
    {
        "content": "* Customer demand for loans in line with pre-Brexit volumes   (Releads  adds shares and detail)",
        "date": "10262016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds confounds Brexit fears with steady performance "
    },
    {
        "content": "* lloyds banking group plc to continue to expect to generate around 160 basis points of cet1 capital in 2016 pre dividend percent",
        "date": "10262016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds posts lower operating costs  says economic outlook uncertain "
    },
    {
        "content": "LONDON  Oct 26 Lloyds Banking Group on Wednesday reported third-quarter profits largely unchanged from a year ago  confounding initial expectations of a sharp squeeze on earnings caused by Britain's surprise vote to quit the European Union.",
        "date": "10262016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds Banking Group posts 1.9 bln stg Q3 pretax profit despite Brexit headwinds "
    },
    {
        "content": "LONDON  Oct 12 Fund supermarket Hargreaves Lansdown said on Wednesday it had written to the British government to protest about the potential exclusion of retail investors from the sale of its remaining stake in Lloyds Banking Group.",
        "date": "10122016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Hargreaves Lansdown complains to govt over Lloyds share sale plan "
    },
    {
        "content": "Oct 6 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10062016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES- Temasek  Lloyds  Standard Life "
    },
    {
        "content": "* Hammond says no plan to sell RBS shares now   (Adds Hammond comment on RBS)",
        "date": "10072016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-UK to restart $4.5 bln Brexit-stalled sale of Lloyds stake "
    },
    {
        "content": "LONDON  Oct 12 State-backed Lloyds Banking Group  said on Wednesday it planned to axe 1 230 jobs as part of a three-year restructuring plan aimed at cutting costs and improving returns for shareholders.",
        "date": "10122016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds Banking Group cuts 1 230 jobs as part of strategic overhaul "
    },
    {
        "content": "Oct 7 The British government will restart selling down its 3.6 billion pound ($4.45 billion) stake in Lloyds Banking Group  the body set up to manage the process said on Friday  after it was delayed following the vote to leave the European Union.",
        "date": "10072016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK to restart selling down stake in Lloyds Banking Group "
    },
    {
        "content": "* Intention to sell shares in Lloyds Banking Group Plc through a trading plan",
        "date": "10072016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-UKFI says to sell shares in Lloyds Banking Group under trading plan "
    },
    {
        "content": "LONDON  Sept 5 Britain's top shares index dipped lower on Monday as a fall in the shares of Royal Bank of Scotland and its rival Lloyds weighed on the overall market.",
        "date": "09052016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain's FTSE underperforms as RBS and Lloyds lose ground "
    },
    {
        "content": "LONDON  Aug 24 Lloyds Banking Group  Chief Executive Antonio Horta-Osorio apologised to staff on Wednesday for damaging the bank's reputation but said he intended to continue running the British lender following press scrutiny of his private life.",
        "date": "08242016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Apologetic Lloyds CEO plans to stay amid private life scrutiny "
    },
    {
        "content": "LONDON  Aug 11 Top investors in Lloyds Banking Group are concerned that chief executive Antonio Horta-Osório might leave the bank sooner than anticipated following press scrutiny of his private life and want its board to start looking for his successor.",
        "date": "08112016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds investors fret over CEO's future and who could replace him "
    },
    {
        "content": "LONDON  Aug 11 Top investors in Lloyds Banking Group are concerned that chief executive Antonio Horta-Osório might leave the bank sooner than anticipated following press scrutiny of his private life and want its board to start looking for his successor.",
        "date": "08122016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "RPT-Lloyds investors fret over CEO's future and who could replace him "
    },
    {
        "content": "LONDON  Aug 10 Lloyds Banking Group  said on Wednesday its Chief Executive Antonio Horta-Osório had not breached company policy after a British newspaper accused him of running up a big hotel bill while on a business trip to Singapore.",
        "date": "08102016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds says CEO did not break expenses rules "
    },
    {
        "content": "* First-half pretax profit 2.45 bln stg (consensus 2.35 bln)   (Adds details on mortgage investigation)",
        "date": "07282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 3-Lloyds to cut 3 000 jobs  close more branches after Brexit shock "
    },
    {
        "content": "LONDON  July 28 Lloyds Banking Group  said on Thursday it would accelerate its cost cutting plan to help offset a more testing economic environment and a likely drop in demand for credit caused by Britain's vote to quit the European Union.",
        "date": "07282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds plans 3 000 jobs cull  fresh branch closures after Brexit shock "
    },
    {
        "content": "LONDON  July 28 Lloyds Banking Group  said on Thursday it would accelerate its cost cutting plan to help offset a more testing economic environment and a likely drop in demand for credit caused by Britain's vote to quit the European Union.",
        "date": "07282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds plans 3 000 jobs cull  fresh branch closures after Brexit shock "
    },
    {
        "content": "* Operating costs 3 per cent lower at £4.0 billion driven by acceleration of cost initiatives. Market-Leading cost:income ratio improved to 47.8 per cent",
        "date": "07282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds warns capital generation may be lower in future years "
    },
    {
        "content": "LONDON  June 29 Lloyds Banking Group  plans to axe about 640 jobs  sources close to the matter said on Wednesday  as Britain's largest mortgage lender continues to scale back its branch network and workforce.",
        "date": "06292016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds to axe 640 jobs in cost-cutting drive -sources "
    },
    {
        "content": "June 24 Chairman of Spain's Banco Sabadell  owner of British bank TSB:",
        "date": "06242016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Spain's Sabadell  owner of UK's TSB  says strategy unchanged after Brexit vote "
    },
    {
        "content": "LONDON Britain's government has scrapped plans to sell stakes in Royal Bank of Scotland  and Lloyds Banking Group  this year in the wake of the Brexit vote  sources said  a decision set to leave a multi-billion pound hole in its finances. The Treasury had planned to further reduce its exposure to the banks it took over during the financial crisis  by raising 9 billion pounds ($11.9 billion) via sales of stock to fund managers and a discounted offer to the p",
        "date": "06272016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "British government puts sale of RBS  Lloyds stakes on hold after Brexit vote: sources "
    },
    {
        "content": "LONDON The chief executives of Lloyds Banking Group  and Royal Bank of Scotland  moved to reassure thousands of workers that their state-backed companies would weather the turmoil sparked by Britain's decision to quit the European Union.",
        "date": "06282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds  RBS CEOs reassure staff on strength after Brexit vote "
    },
    {
        "content": "LONDON  June 27 Britain's government has scrapped plans to sell stakes in Royal Bank of Scotland  and Lloyds Banking Group this year in the wake of the Brexit vote  sources said  a decision set to leave a multi-billion pound hole in its finances.",
        "date": "06272016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "British government puts sale of RBS  Lloyds stakes on hold after Brexit vote -sources "
    },
    {
        "content": "LONDON  June 28 The chief executives of Lloyds Banking Group and Royal Bank of Scotland moved to reassure thousands of workers that their state-backed companies would weather the turmoil sparked by Britain's decision to quit the European Union.",
        "date": "06282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds  RBS CEOs reassure staff on strength after Brexit vote "
    },
    {
        "content": "* $629.8 million in aggregate principal notes were validly tendered; accepted all notes that were validly tendered  Source text for Eikon:  Further company coverage:",
        "date": "06232016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking Group says $629.8 million of notes tendered "
    },
    {
        "content": "LONDON  June 28 Lloyds Banking Group  Chief Executive Antonio Horta Osorio wrote to the bank's 75 000-strong workforce on Tuesday to give reassurances on strategy and group strength in the face of Britain's vote to leave the European Union  a memo seen by Reuters showed.",
        "date": "06282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds CEO reassures staff on bank's strategy  strength after Brexit vote "
    },
    {
        "content": "LONDON  June 28 British insurer Legal & General  has appointed John Kingman as its group chairman  the company said on Tuesday.",
        "date": "06282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Legal & General appoints Whitehall veteran John Kingman as group chairman "
    },
    {
        "content": "LONDON  June 27 Britain's government has scrapped plans to sell stakes in Royal Bank of Scotland  and Lloyds Banking Group this year in the wake of the Brexit vote  sources said  a decision set to leave a multi-billion pound hole in the country's public finances.",
        "date": "06282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "RPT-British government puts sale of RBS  Lloyds stakes on hold after Brexit vote -sources "
    },
    {
        "content": "LONDON  June 16 (IFR) - Lloyds Banking Group won a decisive UK court ruling on Thursday over whether it treated investors in high-interest bonds fairly  saving it from the threat of paying them hundreds of millions of pounds extra.",
        "date": "06162016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-UK court rules in favour of Lloyds in £3.3bn bond dispute "
    },
    {
        "content": "LONDON  June 16 (IFR) - Lloyds Banking Group won a decisive UK court ruling on Thursday over whether it treated investors in high-interest bonds fairly  saving it from the threat of paying them hundreds of millions of pounds extra.",
        "date": "06162016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK court rules in favour of Lloyds in £3.3bn bond dispute "
    },
    {
        "content": "LONDON  June 14 Lloyds Banking Group's  life insurance arm  Scottish Widows  has completed a 630 million pound ($892.40 million) pension buy-in deal for the ICI Pension Fund  it said on Tuesday.",
        "date": "06142016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Scottish Widows completes $892 mln pension buy-in deal for ICI "
    },
    {
        "content": "LONDON  May 25 Shares in Britain's state-backed Lloyds Banking Group rose above the level the government paid for them for the first time in 5 months on Wednesday  raising speculation the state will sell off stock to repay taxpayers who funded a bailout eight years ago.",
        "date": "05252016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds bank shares reach break-even point for UK government sale "
    },
    {
        "content": "LONDON  May 17 Britain's finance ministry said on Tuesday it will receive a dividend payment from Lloyds Banking Group of 130 million pounds ($187.97 million)  taking the total amount recovered from the part-nationalised bank to over 16.8 billion pounds.",
        "date": "05172016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UK Treasury says receives 130 mln stg dividend from Lloyds "
    },
    {
        "content": "EDINBURGH  May 12 Lloyds Banking Group  Chairman Norman Blackwell was forced to defend a branch closure programme on Thursday when angry investors accused management of deserting customers.",
        "date": "05122016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds Bank defends branch closures plan to angry investors "
    },
    {
        "content": "* Sale of government shares seen resuming this year   (Adds shares  analyst comment)",
        "date": "04282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-Retail focus helps to shield Lloyds from banking chill "
    },
    {
        "content": "LONDON  April 28 Lloyds Banking Group  reported underlying profits in line with expectations on Thursday  keeping first quarter revenues steady and cutting bad debts despite the challenging economic environment.",
        "date": "04282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds posts profit in line with hopes amid slowdown in UK economy "
    },
    {
        "content": "* There was a charge of £115 million to cover retail conduct matters. No further provision has been taken for PPI  where complaint levels over three months have been around 8 500 per week on average  broadly in line with expectations  Source text for Eikon:  Further company coverage:    (Reporting by Andrew MacAskill)",
        "date": "04282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds pays 790 million stg to buy back bonds "
    },
    {
        "content": "* CEO Jaime Guardiola says net interest income will remain stable and more \"flatish\" in 2016 during call with analysts",
        "date": "04222016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Spain's Sabadell  owner of UK's TSB  says not worried about Brexit "
    },
    {
        "content": "LONDON  April 21 State-backed Lloyds Banking Group is axing about 625 jobs  according to the Unite union  making a further round of job losses under an aggressive cost-cutting plan.",
        "date": "04212016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds planning to axe 625 UK jobs in cost-cutting plan - union "
    },
    {
        "content": "BARCELONA/MADRID  April 22 Banco Sabadell's purchase of British bank TSB helped the Spanish lender post a first-quarter net profit increase of 44 percent from the same period in 2015  beating analysts' forecasts.",
        "date": "04222016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Spain's Sabadell reaps rewards of TSB buy with 44 pct profit rise "
    },
    {
        "content": "LONDON  April 21 State-backed Lloyds Banking Group is axing almost 625 jobs in its UK retail bank  according to the Unite union  in the latest round of job cuts and branch closures at the lender.",
        "date": "04212016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds planning to axe about 600 UK jobs in cost-cutting plan - union "
    },
    {
        "content": "LONDON  April 14 The board of Lloyds Banking Group says a British vote to leave the European Union would likely cause economic uncertainty and potential volatility.",
        "date": "04142016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds says a British vote to leave EU likely to cause economic uncertainty "
    },
    {
        "content": "LONDON  April 13 Lloyds Banking Group  shareholders want the bank to consider some creative additions to its business to protect its generous dividend plans against an economic slump in Britain.",
        "date": "04132016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Investors weigh strategy tweaks at Lloyds to protect dividend plans "
    },
    {
        "content": "LONDON  April 14 The board of Lloyds Banking Group says a British vote to leave the European Union would likely cause economic uncertainty and potential volatility.",
        "date": "04142016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds says a British vote to leave EU likely to cause economic uncertainty "
    },
    {
        "content": "* Cost-income target delayed to 2019   (Adds details on CEO pay  investor comment  updates shares)",
        "date": "02252016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 3-Lloyds Bank's dividend surprise sweetens profit miss "
    },
    {
        "content": "LONDON  Feb 25 European shares rebounded on Thursday from losses earlier in the week  as some solid corporate results from the likes of Seadrill and British bank Lloyds lifted stock markets.",
        "date": "02252016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "European shares rebound as Lloyds and Seadrill rally "
    },
    {
        "content": "LONDON  Feb 25 Lloyds Banking Group on Thursday said its shareholders would get a special dividend of 0.5 pence a share  demonstrating its recovery from the financial crisis despite having to set aside an extra 2.1 billion pounds in the fourth quarter to compensate customers mis-sold loan insurance.",
        "date": "02252016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "RPT-UPDATE 1-Lloyds to pay special dividend as profits rise "
    },
    {
        "content": "LONDON  Feb 25 Lloyds will consider the impact of Britain's possible exit from the European Union at the bank's next board meeting  chief executive Antonio Horta-Osorio said on Thursday.",
        "date": "02252016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds' board to review Brexit referendum impact - CEO says "
    },
    {
        "content": "LONDON  Feb 25 Lloyds Banking Group on Thursday said its shareholders would get a special dividend of 0.5 pence a share  demonstrating its recovery from the financial crisis despite having to set aside an extra 2.1 billion pounds in the fourth quarter to compensate customers mis-sold loan insurance.",
        "date": "02252016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds to pay special dividend as profits rise "
    },
    {
        "content": "LONDON  Feb 25 European equity futures rose on Thursday  marking a recovery for the region's stock markets after two consecutive sessions of losses that pushed a benchmark equity index down to a one-week low.",
        "date": "02252016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "European Factors to Watch-Equity futures rise "
    },
    {
        "content": "* \u007fExecutive directors  George Culmer and Juan Colombás are each expected to be granted a deferred bonus award\u007f",
        "date": "02252016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds exepects CEO to be given deferred bonus of 723 977 shares "
    },
    {
        "content": "* FY net interest income of £11.5 billion  up 5 per cent  driven by further margin improvement to 2.63 per cent\u007f",
        "date": "02252016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds FY net interest income up 5 pct to 11.5 bln stg "
    },
    {
        "content": "LONDON  Feb 25 Lloyds Banking Group on Thursday set aside another 2.1 billion pounds in the fourth quarter of 2015 to cover compensation for customers mis-sold loan insurance after reporting a 5 percent rise in its underlying full-year profit.",
        "date": "02252016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds makes new 2.1 bln pound mis-selling provision "
    },
    {
        "content": "LONDON  Feb 19 Lloyds Banking Group  said on Friday it expected to pay around 60 million pounds ($85.68 million) in insurance claims to households hit by flooding in Britain in December.",
        "date": "02192016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds Bank to pay out $86 mln in UK December flood claims "
    },
    {
        "content": "* 6 000 investors allege they were misled by Lloyds over HBOS",
        "date": "02242016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds lawyer says \"no value left in HBOS\" comment taken out of context "
    },
    {
        "content": "LONDON  Feb 24 Banks accused of mis-selling of interest rate swaps may escape having to pay out more in redress to clients after a High Court in London on Wednesday dismissed an application to review the handling of the compensation process.",
        "date": "02242016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-UK court dismisses attempt to re-open swaps mis-selling case "
    },
    {
        "content": "* \u007fFurther to announcement dated January 29  2016 released by Lloyds Banking Group Plc in respect of enhanced capital notes issued by LBG Capital No. 1 plc and LBG Capital No. 2 Plc  group has been notified that Supreme Court has granted ECN Trustee leave to appeal court of appeal's decision of 10 December 2015\u007f",
        "date": "02092016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds reviewing ECN exposure pending trustee appeal "
    },
    {
        "content": "LONDON  Feb 5 Britain has hired Barclays Plc  to manage a planned sale of shares in Lloyds Banking Group to the general public  two sources with direct knowledge of the matter said on Friday.",
        "date": "02052016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Barclays hired to manage Britain's Lloyds share sales "
    },
    {
        "content": "LONDON  Feb 10 Britain's government could rapidly restart sales of state-held shares in Lloyds Banking Group if market conditions normalise and the share price rises  the finance ministry's top civil servant  Nicholas Macpherson  said on Wednesday.",
        "date": "02102016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UK could restart Lloyds sale soon if price rises  official says "
    },
    {
        "content": "LONDON  Feb 3 Lloyds Banking Group Plc  said it would axe about 1 585 jobs and close 29 branches as part of sweeping cuts it announced more than a year ago  aimed at reducing Europe's second-biggest lender's workforce by 9 000.",
        "date": "02032016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UK's Lloyds bank to cut 1 585 more jobs  close branches "
    },
    {
        "content": "* \u007fHas received permission from Prudential Regulatory Authority (PRA) for redemption of all series of ECNS outstanding\u007f",
        "date": "01292016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking Group updates on enhanced capital notes "
    },
    {
        "content": "* Lloyds shares currently below break-even for government   (Adds analyst  Lloyds comments  detail  background)",
        "date": "01282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-UK to postpone Lloyds share sales until markets calmer "
    },
    {
        "content": "LONDON  Jan 28 British finance minister George Osborne said on Thursday that the government would postpone the sale of shares in bailed-out lender Lloyds Banking Group  due to the turmoil in the global financial markets.",
        "date": "01282016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK's Osborne says to postpone Lloyds share sales until markets calmer "
    },
    {
        "content": "LONDON  Jan 15 (IFR) - Investors in high-interest Lloyds Banking Group bonds that the bank wants to cancel have lodged an appeal with London's Supreme Court in a final attempt to stop the move.",
        "date": "01152016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds bond investors take fight to Supreme Court "
    },
    {
        "content": "LONDON  Jan 4 (IFR) - Lloyds Bank has appointed Keval Shah as head of bond syndicate within its capital markets division  according to a source with knowledge of the matter.",
        "date": "01042016",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds appoints new head of bond syndicate "
    },
    {
        "content": "* Most of the shortfall at the biggest lenders   (Adds lawmaker  consultant comment)",
        "date": "12112015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Bank of England gives banks until 2020 to build crisis funds "
    },
    {
        "content": "LONDON  Dec 10 Lloyds Banking Group  will be able to buy back bonds early  potentially saving it about 1 billion pounds ($1.5 billion) in interest payments as a result of a court ruling.",
        "date": "12102015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds wins right to buy bonds back early to save 1 bln stg "
    },
    {
        "content": "* Civil unit of court of appeal to decide regarding 26-27 Aug proceedings about interpretation of certain terms of enhanced capital notes\u007f",
        "date": "12102015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds seeks temporary suspension of ECNs until after court decision "
    },
    {
        "content": "* Bank was bailed out during financial crisis   (Adds background to the offer  shares)",
        "date": "12042015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-UK extends sale of Lloyds shares to institutions "
    },
    {
        "content": "LONDON  Dec 4 Britain has extended the trading plan to exit its stake in bailed-out lender Lloyds Banking Group   the body set up to manage the process said on Friday.",
        "date": "12042015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UKFI extends Lloyds Banking Group trading plan "
    },
    {
        "content": "* Further increases in capital will only be incremental   (Adds more reaction)",
        "date": "12012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Bank of England's Carney says UK banks' job almost done on capital "
    },
    {
        "content": "* Announces appointments of Deborah McWhinney and Stuart Sinclair as independent non-executive directors of group",
        "date": "11272015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking names two new independent non-executive directors "
    },
    {
        "content": "LONDON  Nov 26 Taxpayer-backed Lloyds Banking Group said on Thursday it was cutting around 945 jobs in a restructuring plan first outlined a year ago with the aim of reducing the bank's workforce by 9 000.",
        "date": "11262015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds to cut 945 jobs as part of 3-year restructuring plan "
    },
    {
        "content": "LONDON  Nov 26 Taxpayer-backed Lloyds Banking Group said on Thursday it was cutting around 945 jobs in a restructuring plan first outlined a year ago with the aim of reducing the bank's workforce by 9 000.",
        "date": "11262015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds to cut 945 jobs as part of three-year restructuring strategy "
    },
    {
        "content": "Nov 11 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "11112015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES- Lloyds Banking  State Street Global  Barnett Waddingham "
    },
    {
        "content": "Nov 11 The commercial banking division of Lloyds Banking Group Plc appointed Michael Bond as a mid-markets relationship director for its technology  media and telecommunications team in London.",
        "date": "11112015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "MOVES-Lloyds commercial banking promotes Michael Bond as relationship director "
    },
    {
        "content": "Nov 6 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "11062015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES- Deutsche Bank  Marsh  Towry "
    },
    {
        "content": "Nov 10 The commercial banking division of Lloyds Banking Group Plc has named Corne Maljaars as relationship director for its global corporates team in Amsterdam.",
        "date": "11102015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES-Lloyds Bank hires Corne Maljaars as relationship director "
    },
    {
        "content": "* Share of sale proceeds will comprise upfront consideration of cash and preferred stock",
        "date": "11022015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds sees 300 mln stg pre-tax gain on upfront payment of Visa deal "
    },
    {
        "content": "LONDON  Oct 27 Lloyds Banking Group is expected to set aside hundreds of millions of pounds more to compensate customers mis-sold loan insurance  adding to the 13.4 billion pound ($20.5 billion) bill it already anticipates  according to estimates from analysts and banking industry sources.",
        "date": "10272015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds' bill for mis-sold loan insurance set to increase again "
    },
    {
        "content": "LONDON  Oct 29 Britain's government has sold off another 1 percent of its stake in Lloyds Banking Group  trimming its total interest to below 10 percent just months before a final sell-off aimed at returning the lender to full private ownership.",
        "date": "10292015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UK govt trims Lloyds stake to single-digits as retail offer looms "
    },
    {
        "content": "* Q3 underlying pretax falls to 2 bln stg pounds from 2.2 bln",
        "date": "10282015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 3-Lloyds hit by weak third quarter ahead of UK share sale plan "
    },
    {
        "content": "* Uk government reduces stake in lloyds banking group plc to below 10% percent  Source text for Eikon:  Further company coverage:    (Reporting By Sinead Cruise)",
        "date": "10292015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-UK government reduces stake in Lloyds to below 10 pct "
    },
    {
        "content": "** Lloyds shares down c.5 pct  one of the top FTSE-100 fallers as bank takes another charge for insurance mis-selling",
        "date": "10282015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BUZZ-Lloyds: double trouble "
    },
    {
        "content": "LONDON  Oct 28 Lloyds Banking Group has taken another 500 million pounds ($765 million) charge to compensate customers mis-sold loan insurance  taking its total bill to 13.9 billion pounds  more than double any other bank.",
        "date": "10282015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds Banking Group's bill for insurance mis-selling rises "
    },
    {
        "content": "LONDON  Oct 23 Britain's Lloyds Banking Group  has failed in an attempt to strike out a key allegation by a group of investors  suing it for allegedly misleading them in the run-up to its acquisition of Halifax Bank of Scotland (HBOS) in January 2009.",
        "date": "10232015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds fails to remove key allegation in HBOS pre-trial hearing "
    },
    {
        "content": "MADRID  Oct 23 Spain's Sabadell said on Friday its net profit for the first nine months of the year rose over 59 percent to 580 million euros ($649 million)  helped by growing income from lending and its acquisition of British bank TSB.",
        "date": "10232015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Spain's Sabadell nine-month profit up 59 percent "
    },
    {
        "content": "LONDON A whistleblower has written to a group of investors suing British bank Lloyds  alleging that senior managers were aware they were over-paying for failing rival HBOS in 2008  lawyers for the investors say in a court document.",
        "date": "10212015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Whistleblower letter backs Lloyds investor claims over HBOS purchase: lawyers "
    },
    {
        "content": "* Lloyds seeks dismissal of some allegations in High Court hearing",
        "date": "10212015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Whistleblower letter backs Lloyds investor claims over HBOS purchase - lawyers "
    },
    {
        "content": "LONDON  Oct 15 Britain's banks should be required to tell customers how much they've paid for their banking services each month  the chief executive of TSB said on Thursday.",
        "date": "10152015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "TSB boss calls for UK banks to make charges clearer "
    },
    {
        "content": "LONDON The chairman of Lloyds Banking Group has said that there was no \"compelling economic argument\" for Britain to stay in the European Union without a significant change in its relationship with the bloc.",
        "date": "10142015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Without deep change  case for UK to stay in EU weak: Lloyds chairman "
    },
    {
        "content": "LONDON  Oct 14 The chairman of Lloyds Banking Group has said that there was no \"compelling economic argument\" for Britain to stay in the European Union without a significant change in its relationship with the bloc.",
        "date": "10142015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Without deep change  case for UK to stay in EU weak -Lloyds chairman "
    },
    {
        "content": "* UK government reduces stake in Lloyds Banking Group to below 11 percent.  Further company coverage:    (Reporting By Simon Jessop)",
        "date": "10092015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-UK government cuts Lloyds Banking Group stake below 11 pct "
    },
    {
        "content": "LONDON  Oct 8 More than 120 000 investors have registered an interest in buying shares in British bank Lloyds  with stockbroker Hargreaves Lansdown in the four days since the government put its remaining 2 billion pound ($3.1 billion) stake up for sale.",
        "date": "10082015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Broker Hargreaves says 120 000 sign up to get Lloyds shares "
    },
    {
        "content": "* Lloyds says sale decision 'up to the government'   (Adds reaction from Lloyds  investors  Breakingviews link)",
        "date": "10052015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 3-UK plans $3 bln Lloyds share sale to private investors "
    },
    {
        "content": "(Adds futures prices  company news items)     LONDON  Oct 5 European equity futures rose on Monday  helped by gains on Asian and U.S equity markets overnight while energy stocks could also be lifted by firmer oil prices.     Futures for the euro zone's blue-chip Euro STOXX 50 index were up by 2.2 percent  while futures on Germany's DAX  France's CAC and Britain's FTSE 100 were up by around 2 percent.     Portuguese shares could also come under the spotlight  after Portugal's Portu",
        "date": "10052015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "European Factors to Watch-European equity futures rise "
    },
    {
        "content": "LONDON  Oct 5 Britain's finance ministry will sell at least 2 billion pounds ($3.04 billion) in Lloyds Banking Group to retail investors in spring 2016 as part of plans to return the bank to full private ownership  it said on Monday.",
        "date": "10052015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK government plans $3 bln Lloyds retail share sale in spring 2016 "
    },
    {
        "content": "* HM Treasury announces today that a retail sale of Lloyds Banking Group shares will be launched next spring",
        "date": "10052015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-HM Treasury says retail sale of Lloyds' shares to be launched next spring "
    },
    {
        "content": "* On 1 October 2015  it redeemed all of outstanding 5.92% non-cumulative fixed to floating rate preference shares callable 2015",
        "date": "10022015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking says redeemed all 5.92% preference shares at par "
    },
    {
        "content": "LONDON  Sept 25 Britain's government said on Friday it had recouped almost three-quarters of the taxpayer cash used in the 20.5 billion pound rescue of Lloyds Banking Group in 2008  after a fresh share sale pushed its stake to below 12 percent.",
        "date": "09252015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-UK government sells more Lloyds shares  cuts stake to below 12 pct "
    },
    {
        "content": "LONDON  Sept 25 Britain's government has reduced its holding in Lloyds Banking Group to below 12 percent  taking the bank closer to full privatisation following a taxpayer bailout in the 2008/09 financial crisis.",
        "date": "09252015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK government sells more Lloyds shares  cuts stake to below 12 pct "
    },
    {
        "content": "** Lloyds Banking Group up 2.9 pct  among top FTSE 100 gainers & on track for sharpest gain in over 3.5 mnths after brokerage Investec says share price weakness triggers automatic buy",
        "date": "08252015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BUZZ-Lloyds: boosted as Investec pegs as \"buy\" opportunity "
    },
    {
        "content": "HELSINKI  Aug 24 British finance minister George Osborne said on Monday he hoped the sale of the government's shares in Lloyds Banking Group will be completed within a year.",
        "date": "08242015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UK's Osborne says hopes Lloyds sale to be done within a year "
    },
    {
        "content": "LONDON  Aug 24 Britain's government has reduced its holding in Lloyds Banking Group to below 13 percent  taking the bank closer to full privatisation after needing a state rescue in the 2008/09 financial crisis.",
        "date": "08242015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK cuts its stake in Lloyds to below 13 pct "
    },
    {
        "content": "* Uk government reduces stake in Lloyds Banking Group to below 13 percent   Further company coverage:    (Reporting By Sinead Cruise)",
        "date": "08242015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-UK government cuts Lloyds stake to below 13 pct "
    },
    {
        "content": "* Shareholders question if it offers best value for taxpayers",
        "date": "08022015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds shareholders question government's sale plan "
    },
    {
        "content": "* To acquire a commercial loan portfolio from Lloyds Banking Group Plc",
        "date": "07302015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Bank of Ireland acquires commercial loan portfolio from Lloyds Banking Group "
    },
    {
        "content": "* Bank will consider one-off dividends  buybacks   (Adds comments from chief executive  finance director)",
        "date": "07312015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds' profit below hopes after new mis-selling charge "
    },
    {
        "content": "* UK faces loss on 45 bln stg RBS bailout after profit on Lloyds",
        "date": "08032015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 4-Seven years after bailout  Britain starts RBS sell-off with $3 bln stake sale "
    },
    {
        "content": "LONDON  July 30 A British court ruling could pave the way for thousands of small firms mis-sold complex financial products by their banks and unhappy with an official compensation scheme to sue for redress.",
        "date": "07302015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK court paves way for small firms to appeal 'hedging' compensation "
    },
    {
        "content": "* Operating costs flat after increased investment; cost:income ratio improved by 0.7 percentage points to 48.3 per cent",
        "date": "07312015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds says improves net interest margin guidance for 2015 to 2.6 pct "
    },
    {
        "content": "* Shareholders question if it offers best value for taxpayers",
        "date": "08032015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "RPT-Lloyds shareholders question government's sale plan "
    },
    {
        "content": "LONDON  July 30 Lloyds Banking Group  said it sold a portfolio of Irish commercial loans with a face value of 2.6 billion pounds ($4.1 billion) to a consortium including Goldman Sachs and Bank of Ireland.",
        "date": "07302015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds sells 2.6 bln stg of Irish loans to Goldman  CarVal  BoI group "
    },
    {
        "content": "LONDON  Aug 3 Britain has reduced its stake in Lloyds Banking Group to below 14 percent  the finance ministry said in a stock market disclosure on Monday.",
        "date": "08032015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain cuts Lloyds banking group stake below 14 percent "
    },
    {
        "content": "* UK government reduces stake in lloyds banking group plc to 13.99% percent  Source text for Eikon:  Further company coverage:    (Reporting By Sinead Cruise)",
        "date": "08032015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-UK government reduces stake in Lloyds to below 14 percent "
    },
    {
        "content": "LONDON Lloyds Banking Group must release details of legal advice it received in the run-up to its takeover of Halifax Bank of Scotland (HBOS) during the banking crisis in 2008  a judge in London's High Court of Justice ruled on Wednesday.",
        "date": "07222015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds must release legal advice ahead of HBOS takeover hearing: judge "
    },
    {
        "content": "LONDON Lloyds  is expected to set out its dividend plans next week  including a potential return of surplus cash to shareholders  making its stock more attractive ahead of a possible sale to retail investors  industry sources said.",
        "date": "07212015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds to set out dividend plans ahead of share sale "
    },
    {
        "content": "* Shareholder group seeking 350 mln stg damages   (Adds detail on case and decision)",
        "date": "07222015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds must release legal advice ahead of HBOS takeover hearing - judge "
    },
    {
        "content": "LONDON  July 22 Lloyds Banking Group  must release details of legal advice it received in the run-up to its takeover of Halifax Bank of Scotland (HBOS) during the banking crisis in 2008  a judge in London's High Court of Justice ruled on Wednesday.",
        "date": "07222015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds must release details of HBOS takeover legal advice - judge "
    },
    {
        "content": "LONDON  July 21 Britain's government unveiled plans on Tuesday to centralise financial regulation further at the Bank of England and reinforce its own powers to shield taxpayers from having to prop up failing lenders in future.",
        "date": "07212015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK consolidates Bank of England's bank supervision role "
    },
    {
        "content": "* Lloyds expected to face new 1 bln pound PPI bill   (Adds details on dividend strategy)",
        "date": "07212015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds to set out dividend plans ahead of share sale-sources "
    },
    {
        "content": "* Anita Frew will succeed Anthony Watson as chairman of remuneration committee with effect from 1 October 2015",
        "date": "07172015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking names Anita Frew as chairman of remuneration committee "
    },
    {
        "content": "* Sale to retail investors expected next year   (Adds further details on sale of remaining stake)",
        "date": "07162015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 3-Britain cuts Lloyds stake as full privatisation looms "
    },
    {
        "content": "LONDON  July 16 Lloyds Banking Group  said on Thursday the UK government had reduced its stake in the bank below 15 percent as it moves closer to full privatisation.",
        "date": "07162015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "British government's stake in Lloyds falls below 15 percent "
    },
    {
        "content": "* Less than 10 billion pounds of stock still to sell   (Adds comment from UK finance minister)",
        "date": "07022015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-UK sells more of Lloyds bank stake  $19.5 bln raised so far "
    },
    {
        "content": "* Rules meant to stop need for bank bailouts   (Recasts  adds comments from HSBC  Lloyds executives)",
        "date": "06302015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-HSBC faces $2.4 billion bill for new ringfencing rules "
    },
    {
        "content": "* Carolyn Fairbairn  a non-executive director  has informed board of Lloyds Banking Group Plc of her intention to retire from board on 31 October 2015",
        "date": "06292015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds says Non-executive Director Carolyn Fairbairn to retire "
    },
    {
        "content": "LONDON  July 2 Lloyds Banking Group  said on Thursday that the government had reduced its stake in the bank to 15.9 percent from 16.87 percent previously  in a further step towards its full privatisation.",
        "date": "07022015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain reduces stake in Lloyds Banking Group to 15.9 percent "
    },
    {
        "content": "LONDON  June 30 Hsbc's uk bank chairman symonds says 'moot point' whether ringfencing is still required for uk banks Lloyds fd says bank ringfencing not redundent  complements other regulatory reforms Lloyds fd culmer says doesn't believe separate ringfenced bank board should be required for lloyds Hsbc's uk bank chairman says no decision yet on whether to put derivatives within ring-fenced bank Lloyds fd says full separation of banks would not have been economically viable   (Report",
        "date": "06302015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "HSBC UK bank chair says requirement for ringfencing a moot point "
    },
    {
        "content": "LONDON  June 30 Spain's Banco Sabadell  has received approval from Britain's financial regulators for its 1.7 billion pound ($2.7 billion) takeover of Britain's TSB   increasing competition for the UK's biggest banks.",
        "date": "06302015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK regulators give green light to Sabadell takeover of TSB "
    },
    {
        "content": "LONDON Lloyds Banking Group Chief Executive Antonio Horta-Osorio said a return of the company to full private ownership was \"within sight\" and praised a plan that allowed the government to sell shares in the open market.",
        "date": "06182015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds CEO says return to private ownership is in sight "
    },
    {
        "content": "LONDON Britain has cut its stake in Lloyds Banking Group  to below 17 percent  the finance ministry said in a stock market disclosure on Tuesday  taking the total sum recovered by the taxpayer to 11.5 billion pounds ($18.2 billion).",
        "date": "06232015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Britain cuts Lloyds Banking Group stake to below 17 percent "
    },
    {
        "content": "* Lloyds chief calls for banks to accept ringfencing   (Adds comment from Schroders analyst on RBS disposal process)",
        "date": "06182015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds CEO says return to private ownership is in sight "
    },
    {
        "content": "LONDON  June 23 Britain has cut its stake in Lloyds Banking Group to below 17 percent  the finance ministry said in a stock market disclosure on Tuesday  taking the total sum recovered by the taxpayer to 11.5 billion pounds ($18.2 billion).",
        "date": "06232015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Britain cuts Lloyds Banking Group stake to below 17 pct "
    },
    {
        "content": "LONDON  June 23 Britain has reduced its stake in Lloyds Banking Group to below 17 percent  the finance ministry said in a stock market disclosure on Tuesday.",
        "date": "06232015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain cuts Lloyds Banking Group stake to below 17 pct "
    },
    {
        "content": "LONDON  June 18 Lloyds Banking Group's  Chief Executive Antonio Horta-Osorio said a return of the bank to full private ownership was \"within sight\" and praised a plan that allowed the government to sell shares in the open market.",
        "date": "06182015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds CEO says return to private ownership 'within sight\" "
    },
    {
        "content": "June 23 Lloyds Banking Group Plc * Ukfi reduces stake below 17% * Taxpayer stake falls to 16.87%  Further company coverage: ",
        "date": "06232015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-UKFI reduces stake in Lloyds below 17 pct "
    },
    {
        "content": "* Regulator consulting with banks over ring-fencing proposals",
        "date": "06172015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds CEO to call for British banks to accept new ring-fencing rules "
    },
    {
        "content": "June 16 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06162015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES- Barclays  Lloyds  ThecityUK  Mizuho  CRUX "
    },
    {
        "content": "LONDON  June 9 Lloyds Banking Group  said it has appointed Gareth Oakley as Managing Director  SME Banking  with responsibility for growing its lending and services to small-and-medium-sized businesses (SMEs).",
        "date": "06092015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES-Lloyds appoints Gareth Oakley small business banking boss "
    },
    {
        "content": "LONDON Lloyds Banking Group will not be allowed to buy back bonds early from thousands of retail investors to save on expensive coupon payments worth 200 million pounds each year  a court ruled on Wednesday.",
        "date": "06032015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds loses attempt to buy back bonds and save $1.5 billion "
    },
    {
        "content": "* Shares in Lloyds down 0.1 percent   (Adds further details  share price  bond market reaction)",
        "date": "06032015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds loses attempt to buy back bonds and save $1.5 billion "
    },
    {
        "content": "LONDON  June 3 Lloyds Banking Group has been told by Britain's High Court that it will not be allowed to buy back some bonds sold to retail investors early ",
        "date": "06032015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds told it can't buy back bonds early  costing bank $305 mln "
    },
    {
        "content": "LONDON Britain could make an initial sale of shares in Royal Bank of Scotland  in September to avoid clashing with the full privatisation of Lloyds Banking Group  next March  banking and political sources said.",
        "date": "06052015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UK weighs September RBS sale to avoid Lloyds clash: sources "
    },
    {
        "content": "LONDON Britain's financial regulator will fine Lloyds Banking Group more than 100 million pounds ($154 million) for failings in the way it handled complaints about mis-sold loan insurance  sources familiar with the matter said.",
        "date": "06042015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Watchdog to fine Lloyds $154 million for PPI failings: sources "
    },
    {
        "content": "LONDON Lloyds Banking Group boss Antonio Horta-Osorio will forfeit 350 000 pounds ($536 000) in bonuses after the bank was fined 117 million pounds for failings in the way it handled complaints about mis-sold loan insurance. | Video ",
        "date": "06052015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds CEO bonus reduced after record fine by regulator "
    },
    {
        "content": "* Shares in Lloyds down 1.2 percent   (Adds comment from sources  data on latest payouts)",
        "date": "06042015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Watchdog to fine Lloyds $154 mln for PPI failings -sources "
    },
    {
        "content": "LONDON  June 4 Britain's financial regulator will fine Lloyds Banking Group over 100 million pounds ($154 million) for failings in the way it handled complaints about mis-sold loan insurance  Sky News reported on Thursday.",
        "date": "06042015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK regulator to fine Lloyds over 100 mln stg for PPI failings - Sky News "
    },
    {
        "content": "* UK has cut stake to under 19 percent from 41 percent   (Adds further details on plans)",
        "date": "06012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 3-UK plans 1980s-style sale of Lloyds shares to Britons "
    },
    {
        "content": "LONDON  June 5 Britain may accelerate plans to start selling shares in Royal Bank of Scotland to avoid a sale clashing with the full privatisation of Lloyds Banking Group in March next year  banking and political sources said.",
        "date": "06052015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK may speed up RBS sale to avoid clash with Lloyds exit-sources "
    },
    {
        "content": "* CEO will forfeit 350 000 pounds - sources   (Adds comment from Lloyds  regulator)",
        "date": "06052015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds CEO bonus reduced after record fine by regulator "
    },
    {
        "content": "LONDON  June 1 Britain's finance ministry said on Monday that it would launch a sale of shares in Lloyds Banking Group to private retail investors in the next 12 months.",
        "date": "06012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain to launch Lloyds retail share offer in next 12 months "
    },
    {
        "content": "LONDON  June 5 Lloyds Banking Group has been fined 117 million pounds  ($180 million) for failings in its handling of complaints about the mis-selling of loan insurance between March 2012 and May 2013.",
        "date": "06052015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds fined $180 million for PPI complaints failings "
    },
    {
        "content": "* Appointment raises questions over Costa MD's future   (Writes through  adds comment  shares)",
        "date": "05222015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-Whitbread names Lloyds' Alison Brittain as new CEO "
    },
    {
        "content": "Notes                   Launched under issuer's EMTN programme",
        "date": "05212015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "New Issue- Lloyds prices 250 mln stg 2022 bond "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 19 (Fitch) Fitch Ratings has upgraded Lloyds Banking Group plc's  (LBG)  Lloyds Bank plc's (LB)  HBOS's and of Bank of Scotland's (BoS) Long-term  IDRs to 'A+' from 'A' and their Viability Ratings (VR) to 'a' from 'a-'. The  Outlook on the IDRs is Stable.  The rating actions are in conjunction with Fitch's review of sovereign support  for banks globally  which the agency announced in March 2014. In line with its  expectation",
        "date": "05192015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Fitch Upgrades Lloyds Banking Group's IDR to 'A+' and VR to 'a' "
    },
    {
        "content": "LONDON  May 22 Whitbread  the owner of Premier Inn hotels and Costa Coffee  on Friday named Lloyds Banking Group executive Alison Brittain as its new boss  succeeding Andy Harrison.",
        "date": "05222015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Whitbread names Lloyds' Alison Brittain as new CEO "
    },
    {
        "content": "LONDON Britain is considering selling more shares in Lloyds Banking Group  by extending a trading facility beyond the current deadline at the end of June  people with knowledge of the matter said.",
        "date": "05152015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Exclusive: UK may extend trading plan to sell more Lloyds shares "
    },
    {
        "content": "BRUSSELS Spanish lender Banco Sabadell  secured European Union regulatory clearance on Monday for its 1.7-billion-pound  ($2.66 billion) acquisition of British peer TSB  to reinforce its presence in the British market.",
        "date": "05182015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Sabadell gains EU approval to acquire British lender TSB "
    },
    {
        "content": "* 97.67 percent of shareholders back pay plan   (Recasts  adds chairman's comment on government stake)",
        "date": "05142015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 3-Lloyds eyes return to private hands in next 12 months "
    },
    {
        "content": "The bank has given notice of the redemption of all of outstanding 6.0884% non-cumulative fixed to floating rate preference shares callable in 2015",
        "date": "05132015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds redeems all outstanding 6.09% 2015 preference shares at par "
    },
    {
        "content": "* Government planning retail sale later this year   (Adds further details on plans for Lloyds/RBS sales)",
        "date": "05122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-UK sells more Lloyds shares  has raised over 10 bln pounds "
    },
    {
        "content": "EDINBURGH  May 14 State-backed Lloyds Banking Group could be returned  to full private ownership in the next 12 months  its Chairman Norman Blackwell told reporters.",
        "date": "05142015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds could return to full private ownership in next 12 months - chairman "
    },
    {
        "content": "LONDON  May 14 Lloyds banking group says 97.67 percent of shareholders vote in favour of remuneration report at agm   (Reporting by Matt Scuffham)",
        "date": "05142015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds says 97.67 percent of shareholders approve pay plan "
    },
    {
        "content": "EDINBURGH  May 14 Lloyds Banking Group  plans to pay an interim and final dividend for 2015  having announced its first payout for over six years in February  Chairman Norman Blackwell told the bank's annual meeting.",
        "date": "05142015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds plans to pay half-year and full-year dividend in 2015 "
    },
    {
        "content": "LONDON  May 11 Lloyds Banking Group's  shareholders should reject the British bank's remuneration policy as pay for Chief Executive Antonio Horta-Osorio is \"highly excessive\"  a shareholder advisory group said on Monday.",
        "date": "05112015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds shareholders urged to reject remuneration report "
    },
    {
        "content": "* Offer for entire issued and to be issued share capital of TSB has become unconditional as to acceptances  Source text for Eikon:  Further company coverage:",
        "date": "05082015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Sabadell says offer for TSB Banking now unconditional as to acceptances "
    },
    {
        "content": "LONDON  May 7 UK state-backed bank Lloyds  has sold offshore life insurer Clerical Medical to investment manager RL360 for an undisclosed sum  Lloyds and RL360 said on Thursday.",
        "date": "05072015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds sells offshore insurer Clerical Medical to RL360 "
    },
    {
        "content": "LONDON Shares in British banks jumped on Friday as the Conservative party looked set to form the next government  removing fears of a break-up of the biggest banks and further hikes in a tax on banks' assets.",
        "date": "05082015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Shares in UK banks jump as Conservatives stay in power "
    },
    {
        "content": "LONDON  May 1 Britain's top equity index gained ground on Friday as a surge in the shares of Lloyds bank  and miners boosted the market  although caution before next week's national election kept a lid on the progress.",
        "date": "05012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Britain's FTSE lifted by Lloyds and miners but election nerves start to show "
    },
    {
        "content": "LONDON  May 1 Britain's top equity index edged higher on Friday  with Lloyds surging after reporting profits at the top end of analysts' forecasts and miners advancing on expectations of further stimulus in China  the world's top metals consumer.",
        "date": "05012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK's FTSE edges higher  Lloyds rallies after results "
    },
    {
        "content": "LONDON Lloyds Banking Group  is confident next week's British national election will not derail healthy UK economic growth  it said on Friday after posting first-quarter profit up by a fifth  thanks to sharply lower losses on bad loans and wider margins.",
        "date": "05012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds upbeat on UK growth as profits lifted by drop in bad debts "
    },
    {
        "content": "* CEO sees UK economy up 2.5-3 pct in 2015  little election risk",
        "date": "05012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds upbeat on UK growth as profits lifted by drop in bad debts "
    },
    {
        "content": "* Conservatives have promised sale to retail investors   (Adds details on sale process  political backdrop)",
        "date": "04242015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-Britain cuts stake in Lloyds Banking Group to below 21 pct "
    },
    {
        "content": "* Lloyds ceo says expects uk economy to grow 2.5 to 3 percent this year  doesn't see election hurting economy  Further company coverage:    (Reporting By Steve Slater)",
        "date": "05012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds CEO expects UK economy to grow 2.5-3 pct this year "
    },
    {
        "content": "LONDON  April 24 The size of the stake owned by British taxpayers in Lloyds Banking Group has fallen by a further 1 percent to below 21 percent  the government agency in charge of managing the interest said on Friday.",
        "date": "04242015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "British government stake in Lloyds Banking Group falls below 21 pct "
    },
    {
        "content": "* Full year asset quality ratio for 2015 now expected to be around 25 basis points (previously around 30 basis points",
        "date": "05012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds lifts guidance on asset quality for 2015 "
    },
    {
        "content": "LONDON  May 1 Britain's biggest retail bank Lloyds Banking Group reported a 21 percent rise in underlying pretax profit for the first quarter  reflecting an improved margin and lower losses for bad debts.",
        "date": "05012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds Q1 profits up 21 pct as bad debt losses fall  margins rise "
    },
    {
        "content": "* Main parties neck-and-neck before election   (Adds Business Secretary comment to Sky News  background)",
        "date": "04192015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-UK Conservatives aim to sell Lloyds shares to small investors "
    },
    {
        "content": "LONDON Lloyds Banking Group  said it would support plans by Britain's Conservative Party to sell some of the government's remaining 22 percent stake in the bank to retail investors.",
        "date": "04202015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds says would support Britain's share sale plan "
    },
    {
        "content": "* Shares in Lloyds up 0.6 percent in early trading   (Adds Lloyds share price)",
        "date": "04202015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 2-Lloyds says would support Conservative's share sale plan "
    },
    {
        "content": "LONDON  April 20 Britain's FTSE 100 index is seen opening up 35 to 36 points  or 0.5 percent higher on Monday  according to financial bookmakers  with futures up 0.4 percent at 0645 GMT. For more on the factors affecting European stocks  please click on",
        "date": "04202015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK Stocks-Factors to watch on Monday April 20 "
    },
    {
        "content": "LONDON  April 20 Lloyds Banking Group  said it would support plans by Britain's Conservative party to sell shares in the bank to private retail investors if they win May's general election.",
        "date": "04202015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds Bank says it would support Conservative share sale plan "
    },
    {
        "content": "LONDON  April 19 British finance minister George Osborne said on Sunday that he intends to sell billions of pounds of government shares in Lloyds Banking Group to small investors if his Conservative Party wins the May 7 election.",
        "date": "04182015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 1-UK Conservatives aim to sell Lloyds shares to small investors "
    },
    {
        "content": "LONDON  April 18 British finance minister George Osborne plans to sell government shares in Lloyds Banking Group  to small investors at a discount of at least 5 percent if his Conservative Party win the May 7 election  The Sunday Telegraph reported on Saturday.",
        "date": "04182015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UK Conservatives plan to sell Lloyds shares to small investors - Sunday Telegraph "
    },
    {
        "content": "LONDON  April 1 (IFR) - Some of Lloyds Banking Group's Enhanced Capital Notes (ECNs) have jumped in the secondary market  suggesting investors hope that a ruling on the legality of the bonds' proposed early redemption will go against the bank.",
        "date": "04012015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds ECNs gain ground as market awaits judgment "
    },
    {
        "content": "* Lloyds banking group has received permission from prudential regulatory authority (pra) for redemption of certain series of ecns",
        "date": "03312015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "BRIEF-Regulator grants Lloyds permission to redeem series of ECNs "
    },
    {
        "content": "LONDON  March 26 The United Kingdom has raised a further 500 million pounds from the sale of shares in Lloyds Banking Group  finance minister George Osborne said on Thursday.",
        "date": "03262015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UK raises further 500 million pounds from Lloyds share sale -finance minister "
    },
    {
        "content": "MADRID Spain's Banco Sabadell  sees little chance of a rival bidder for TSB  emerging as it closes in on a takeover of the British bank  Chairman Josep Oliu said on Tuesday  adding he did not expect major regulatory obstacles for the purchase.",
        "date": "03242015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Sabadell chairman sees little chance of rival bids for TSB "
    },
    {
        "content": "LONDON/MADRID Spain's Banco Sabadell  could look to expand further in Britain after agreeing a 1.7 billion pound ($2.5 billion) takeover of TSB   one of the biggest cross-border banking deals since the financial crisis of 2007-09.",
        "date": "03202015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Sabadell eyes more UK deals after $2.5 billion TSB takeover "
    },
    {
        "content": "MADRID  March 17 The boards of Sabadell  and TSB will meet on Thursday  with the Spanish bank set to formalise its takeover offer for its British peer  a source familiar with the matter said on Tuesday.",
        "date": "03172015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Boards of Sabadell  TSB to approve takeover approach Thursday-source "
    },
    {
        "content": "* Sabadell CEO says in a position to grow in UK market   (Adds comments on timing of approach  growth strategy)",
        "date": "03202015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 4-Sabadell eyes more UK deals after $2.5 bln TSB takeover "
    },
    {
        "content": "LONDON/MADRID  March 20 British bank TSB  said it had agreed to be taken over by Spanish lender Banco Sabadell in a deal which values the business at 1.7 billion pounds ($2.5 billion).",
        "date": "03202015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "TSB agrees to $2.5 billion takeover by Spain's Sabadell "
    },
    {
        "content": "LONDON Britain will raise at least 9 billion pounds ($13 billion) selling shares in Lloyds Banking Group  in the coming year as it looks to recover 66 billion pounds of taxpayers' money spent bailing out banks in the financial crisis.",
        "date": "03182015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UK to raise $13 billion through Lloyds share sales in coming year "
    },
    {
        "content": "* Has agreed to sell a 9.99 per cent interest in TSB to Sabadell  Source text for Eikon:  Further company coverage:",
        "date": "03202015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking agrees to sell 9.99 pct TSB stake to Sabadell "
    },
    {
        "content": "MADRID  March 19 Spanish lender Sabadell  is set to make a firm offer to buy TSB on Friday  a source with knowledge of the matter said  after it made a 340 pence-per-share preliminary approach for the British bank last week.",
        "date": "03192015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Sabadell to formalise offer for Britain's TSB on Friday - source "
    },
    {
        "content": "* UKFI says options to sell shares in different ways   (Adds comments from UKFI  British Bankers' Association)",
        "date": "03182015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 3-UK to raise $13 bln through Lloyds share sales in coming year "
    },
    {
        "content": "DUBAI Lloyds Banking Group and Natixis have sold their holdings in debt of Dubai World   the state-owned conglomerate nearing a $14.6 billion debt restructuring  according to sources familiar with the matter.",
        "date": "03192015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds  Natixis and RBS sell Dubai World debt before $14.6 billion deal-sources "
    },
    {
        "content": "DUBAI  March 19 Lloyds Banking Group  and Natixis have sold their holdings in debt of Dubai World  the state-owned conglomerate nearing a $14.6 billion debt restructuring  according to sources familiar with the matter.",
        "date": "03192015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "UPDATE 1-Lloyds  Natixis and RBS sell Dubai World debt before $14.6 bln deal-sources "
    },
    {
        "content": "DUBAI  March 19 Lloyds Banking Group  and Natixis have sold their exposures to Dubai World   the state-owned conglomerate nearing a $14.6 billion debt restructuring  according to sources familiar with the matter.",
        "date": "03192015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds  Natixis and RBS sell Dubai World debt before $14.6 bln deal-sources "
    },
    {
        "content": "March 19 Stelrox Capital Management LLP appointed former Lloyds Banking Group Plc executive Richard Garlick as chief financial officer.",
        "date": "03192015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "MOVES-Stelrox names former Lloyds Bank executive Garlick as CFO "
    },
    {
        "content": "LONDON  March 13 Banco Sabadell's  plans to buy TSB could be scuppered by Britain's financial services regulator  analysts said on Friday.",
        "date": "03132015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Sabadell bid for TSB could be blocked by UK regulator - analysts "
    },
    {
        "content": "NEW YORK - U.S. stocks rose in a broad rally on Thursday  bouncing back from two days of losses  helped by weaker retail sales that paused the dollar's recent rally and tempered the outlook for interest rates.",
        "date": "03132015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "India Morning Call-Global Markets "
    },
    {
        "content": "LONDON  March 11 State-backed Lloyds Banking Group warned on Wednesday that it continues to face regulatory \"challenges\" relating to the attempted manipulation of fees for a government lending scheme to help banks.",
        "date": "03112015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds warns of further 'challenges' on past BoE lending scheme "
    },
    {
        "content": "* Sabadell mulls 1.5 bln euro capital hike -source   (Adds Sabadell considering 1.5 bln euros capital hike)",
        "date": "03122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 6-TSB shares soar as Spain's Sabadell proposes $2.6 billion bid "
    },
    {
        "content": "MADRID  March 12 Spain's Sabadell is considering a 1.5 billion euros  ($1.6 billion) capital hike via a share issue to fund a possible bid for British bank TSB   a banking source with knowledge of the matter said on Thursday.",
        "date": "03122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Spain's Sabadell considers 1.5 bln euros share issue -source "
    },
    {
        "content": "LONDON  March 12 UK shares rose on Thursday as a rebound in commodity prices boosted mining and energy stocks and domestic bank TSB surged on the back of a takeover offer.",
        "date": "03122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "TSB leads rise in UK stocks as Sabadell makes takeover bid "
    },
    {
        "content": "LONDON  March 12 Hedge funds that took \"short\" positions betting on a drop in British bank TSB face possible losses as the stock surged more than 20 percent after a takeover bid from Spain's Banco Sabadell on Thursday.",
        "date": "03122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Hedge funds face losses after TSB shares soar on Sabadell bid "
    },
    {
        "content": "LONDON/MADRID British challenger bank TSB  has received a takeover approach from Banco Sabadell   valuing the business at about $2.6 billion and sending its shares soaring by nearly a quarter.",
        "date": "03122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "TSB shares soar as Spain's Sabadell proposes $2.6 billion bid "
    },
    {
        "content": "* European corporate results better than U.S. earnings   (Adds detail and quotes)",
        "date": "03122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Earnings help European shares extend rally; Sabadell slumps on TSB bid "
    },
    {
        "content": "LONDON Financial data company Markit will acquire the Halifax House Price Index  a closely watched gauge of British house prices  from Lloyds Banking Group  the companies said in a statement on Tuesday.",
        "date": "03102015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Markit to acquire Halifax House Price index from Lloyds "
    },
    {
        "content": "LONDON  March 5 New British bank TSB  paid Chief Executive Paul Pester 1.89 million pounds ($2.9 million) for 2014  a year in which the business listed on the London Stock Exchange.",
        "date": "03052015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "TSB CEO Pester paid $2.9 million last year "
    },
    {
        "content": "* Group also notes that board of TSB Banking Group Plc would be willing to recommend an offer at this price",
        "date": "03122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Lloyds Banking notes possible offer for TSB Banking from Spain's Sabadell "
    },
    {
        "content": "* Shares reopen  down 8.2 percent after TSB offer and extend losses further.  Source text for Eikon:  Further company coverage:    (Reporting By Elisabeth O'Leary)",
        "date": "03122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "BRIEF-Spain's Sabadell shares extend losses after TSB offer news "
    },
    {
        "content": "LONDON Lloyds Banking Group  is paying its first dividend in more than six years after reporting a rise in profit and improvements in its capital strength  a milestone in the bank's recovery after it was bailed out during the financial crisis. | Video ",
        "date": "02272015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Britain's Lloyds to pay first dividend since rescue "
    },
    {
        "content": "LONDON  Feb 27 Lloyds Banking Group is paying its first dividend in more than six years after reporting a rise in profit and improvements in its capital strength  a milestone in the bank's recovery after it was bailed out during the financial crisis.",
        "date": "02272015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "REFILE-UPDATE 4-Britain's Lloyds to pay first dividend since rescue "
    },
    {
        "content": "* Sale a step towards full return to private ownership   (Adds details on method of sale  future sale prospects)",
        "date": "02232015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "UPDATE 2-UK raises $769 million through sale of Lloyds shares "
    },
    {
        "content": "LONDON  Feb 27 Strong results from British Airways-owner International Airlines Group and Lloyds Banking Group helped Britain's top share index cling on to record highs on Friday.",
        "date": "02272015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "IAG  Lloyds help FTSE 100 cling on to record peak "
    },
    {
        "content": "LONDON  Feb 27 Lloyds Banking Group has reported its first dividend since its bailout during the financial crisis of 2007 to 2009 at a cost of 20 billion pounds ($31 billion) to taxpayers.",
        "date": "02272015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Britain's Lloyds to pay first dividend since financial crisis "
    },
    {
        "content": "* Lloyds set to announce first dividend since financial crisis",
        "date": "02232015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "RPT-Lloyds' expected dividend paves way for government shares sale "
    },
    {
        "content": "* Lloyds set to announce first dividend since financial crisis",
        "date": "02202015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds' expected dividend paves way for government shares sale "
    },
    {
        "content": "Feb 12 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "02122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES-Bain Capital  JPMorgan  Lloyds  HSBC  RHB Capital "
    },
    {
        "content": "Feb 12 Lloyds Banking Group Plc's  commercial banking unit appointed Lucy Barton as a director in its financial markets business.",
        "date": "02122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "MOVES-Lloyds Bank names Lucy Barton director in financial markets "
    },
    {
        "content": "LONDON  Feb 10 The head of Lloyds Banking Group  has called for greater competition in providing banking services to small firms  including making it easier to switch accounts.",
        "date": "02102015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds CEO calls for greater banking choice for small businesses "
    },
    {
        "content": "LONDON  Feb 3 Lloyds Banking Group is expected to set aside hundreds of million pounds more to compensate customers mis-sold loan insurance  potentially taking its overall bill for Britain's costliest consumer scandal to 12 billion pounds ($18 billion).",
        "date": "02032015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds braced for insurance mis-selling bill rising to 12 bln pounds "
    },
    {
        "content": "Jan 28 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01282015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "MOVES- JP Morgan Chase  Oppenheimer  Wells Fargo  Fortress Investment "
    },
    {
        "content": "Jan 28 Lloyds Bank Commercial Banking  part of UK-based retail and commercial bank Lloyds Banking Group Plc   hired Bob Sullivan as senior vice president of credit sales.",
        "date": "01282015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "MOVES-Lloyds Banking unit names Bob Sullivan as senior VP  credit sales "
    },
    {
        "content": "Lead Manager(s)         Lloyds Bank  Barclays  Nomura & Standrad Chartered Bank",
        "date": "01122015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "New Issue- Lloyds prices 1.0 bln stg 2018 FRN "
    },
    {
        "content": "LONDON Lloyds Banking Group wants Britain's financial regulator to grant it a waiver from new rules requiring banks to have separate boards of directors for their retail and investment operations  sources said.",
        "date": "01062015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "topStory",
        "symbol": "LYG",
        "title": "Lloyds hopes for waiver from ring-fenced board demand: sources "
    },
    {
        "content": "* Document sets scene for battle in parliament  EU states",
        "date": "01062015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "EU lawmaker seeks to dilute bank trading reform "
    },
    {
        "content": "* Rules to shield ordinary customers from riskier activities",
        "date": "01062015",
        "name": "Lloyds Banking Group Plc",
        "news_type": "normal",
        "symbol": "LYG",
        "title": "Lloyds hopes for waiver from ring-fenced board demand -sources "
    }
]