[
    {
        "content": "CHICAGO Macy's Inc  shares climbed more than 11 percent on Thursday after the department store chain forecast a jump in online sales in the crucial holiday quarter and said it would maintain its tight grip on inventory. | Video ",
        "date": "11092017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's shares surge on holiday quarter outlook "
    },
    {
        "content": "CHICAGO  Nov 9 Macy's Inc shares climbed more than 11 percent on Thursday after the department store chain forecast a jump in online sales in the crucial holiday quarter and said it would maintain its tight grip on inventory.",
        "date": "11092017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 2-Macy's shares surge on holiday quarter outlook "
    },
    {
        "content": "* Macy's  Inc. reports third quarter 2017 earnings above prior year and re-affirms full-year guidance",
        "date": "11092017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's Inc Q3 EPS $0.23 excluding items "
    },
    {
        "content": "CHICAGO  Nov 9 Macy's Inc reported a bigger-than-expected drop in third-quarter comparable sales on Thursday as the department store operator struggled with lower foot traffic and stiff competition from online rivals.",
        "date": "11092017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's posts bigger-than-expected comparable sales drop "
    },
    {
        "content": "* Macy's Inc - ‍beginning Nov. 1  customers shopping at Macy's Herald Square will be able to explore and purchase a range of Samsung products​ Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Samsung Experience to launch at Macy's Herald Square "
    },
    {
        "content": "CHICAGO  Oct 30 Shares in Macy's Inc tumbled more than 5 percent on Monday to a seven-year low after Citi analysts said the department store operator may cut its dividend to help pay down debt as it grapples with weak margins and foot traffic.",
        "date": "10302017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Citi analysts flag 'real risk' of Macy's dividend cut  shares tumble "
    },
    {
        "content": "* BOARD ‍DECLARED REGULAR QUARTERLY DIVIDEND OF 37.75 CENTS PER SHARE ON MACY'S COMMON STOCK  PAYABLE JAN. 2  2018​ Source text for Eikon: Further company coverage:",
        "date": "10272017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-MACY'S INC ‍DECLARES REGULAR QUARTERLY DIVIDEND OF 37.75 CENTS/SHARE "
    },
    {
        "content": "* Danielle Kirgan named chief human resources officer of Macy's Inc",
        "date": "10172017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy’s names Danielle kirgan as chief human resources officer "
    },
    {
        "content": "* Announced partnership today with Macy's to make individual Sprezzaboxes available in all Macy's locations for holiday season Source text for Eikon: Further company coverage:",
        "date": "09192017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Sprezzabox announces partnership with Macy's for holiday season "
    },
    {
        "content": " (In Sept. 14 story  corrects paragraph 6 to say Radial  not retailers  will hire more workers. Also clarifies Radial's description) | Video ",
        "date": "09152017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's to hire 80 000 workers for holidays  fewer than last year "
    },
    {
        "content": "* Macy's Inc to hire 80 000 seasonal associates in 2017  expand national hiring event on September 28-29 Source text for Eikon: Further company coverage:",
        "date": "09182017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's to hire 80 000 seasonal associates in 2017 "
    },
    {
        "content": "Sept 14 This holiday season Macy's Inc will employ more workers at its distribution and warehouses to support its online business as it operates 70 fewer stores compared to last year.",
        "date": "09142017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's to hire more temp workers for online ops this holiday season "
    },
    {
        "content": "* Macy's to hire 80 000 temporary employees this holiday season - Macy's spokesperson",
        "date": "09142017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's to hire 80 000 temporary employees this holiday season - spokesperson "
    },
    {
        "content": "* Macy’s Inc expands same-day delivery service to cover 33 markets",
        "date": "08312017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy’s Inc expands same-day delivery service to cover 33 markets "
    },
    {
        "content": "* Macy's Inc - ‍ Board of directors approved annual base salary of $1.0 million for Harry A. Lawton III - SEC filing​",
        "date": "08212017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's board approves annual base salary of $1.0 million for Harry Lawton III "
    },
    {
        "content": "Aug 21 U.S. department store chain Macy's Inc said on Monday it would restructure its merchandising operations  which could result in about 100 job cuts.",
        "date": "08212017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's to restructure merchandising unit  cut 100 jobs "
    },
    {
        "content": "* Macy's Inc - ‍Restructuring includes consolidation of three functions - Merchandising  Planning and private brands​",
        "date": "08212017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's names \tHal Lawton president "
    },
    {
        "content": "Aug 21 Department store chain Macy's Inc said on Monday it would restructure its merchandising operations  which could result in about 100 job cuts.",
        "date": "08212017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Macy's to restructure merchandising unit  cut 100 jobs "
    },
    {
        "content": " (This version of the Aug. 10 story corrects the quote in paragraph 5 to say \"disruptive\" not \"destructive\") | Video ",
        "date": "08112017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's  Kohl's sales declines raise turnaround concerns "
    },
    {
        "content": "* \"Environment of intense  destructive competition\"- Macy's CEO",
        "date": "08112017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "CORRECTED-UPDATE 4-Macy's  Kohl's sales declines raise turnaround concerns "
    },
    {
        "content": "Aug 10 Department store operator Macy's Inc joined rival Kohl's Corp in reporting a smaller-than-expected decline in quarterly comparable sales.",
        "date": "08102017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's quarterly comparable sales top estimates "
    },
    {
        "content": "Aug 10 Nordstrom Inc reported better-than-expected quarterly same-store sales on Thursday as more people shopped at the apparel retailer's online stores  sending shares up 2.5 percent after the bell.",
        "date": "08102017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Nordstrom websites boost same-store sales  shares jump "
    },
    {
        "content": "NEW YORK  July 17 When consumers have trouble making ends meet  bills from retailers that have gone bankrupt or closed tend to go toward the bottom of the pile.",
        "date": "07172017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Didn't pay your Macy's bill? Expect a text from Citigroup "
    },
    {
        "content": "July 13 Department store operator J.C. Penney Co Inc said it was opening toy shops in all its stores and was planning to have a bigger assortment of toys available in time for the holiday season  as it seeks new avenues of growth amid weak sales.",
        "date": "07132017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-J.C. Penney pushes into toy sales in move away from apparel "
    },
    {
        "content": "June 20 Amazon.com Inc wants to turn your living room into a fitting room.",
        "date": "06202017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Amazon launches 'try-before-you-buy' fashion service "
    },
    {
        "content": "The U.S. Supreme Court on Monday declined to review an appellate court ruling that upheld a bargaining unit of cosmetics and fragrance department workers at a Macy's Inc store  further confirming the legal viability of so-called micro units - at least for the time being.",
        "date": "06192017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "High court rejects Macy's bid for review of 'micro unit' ruling "
    },
    {
        "content": "* Macy's Inc - Director William Lenehan reports purchase of 4 390 shares of co's common stock on June 15 at $22.72 per share - SEC filing Source text: (http://bit.ly/2sBdEjW) Further company coverage:",
        "date": "06162017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's director William Lenehan buys 4 390 shares of co's common stock on June 15 "
    },
    {
        "content": "June 8 Department store operator Nordstrom Inc said on Thursday that some members of the Nordstrom family were considering taking the company private as it struggles with an industry-wide sales slowdown.",
        "date": "06092017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 7-Nordstrom family explores taking retailer private  shares surge "
    },
    {
        "content": "CHICAGO Macy's Inc  margins could end the year as much as 80 basis points lower than in 2016  Chief Financial Officer Karen Hoguet warned on Tuesday in comments that sent shares of the department store chain sliding to five-year lows  and also pressured other retail stocks.",
        "date": "06062017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's warning on margins hits department store shares "
    },
    {
        "content": "* Macy's promotes Yasir Anwar to executive vice president  Chief Technology Pfficer",
        "date": "06012017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy’s names Yasir Anwar as Chief Technology Officer "
    },
    {
        "content": "CHICAGO  June 6 Macy's Inc margins could end the year as much as 80 basis points lower than in 2016  Chief Financial Officer Karen Hoguet warned on Tuesday in comments that sent shares of the department store chain sliding to five-year lows  and also pressured other retail stocks.",
        "date": "06062017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Macy's warning on margins hits department store shares "
    },
    {
        "content": "CHICAGO  June 6 Macy's Inc could report a full-year gross margin below the department store chain's forecast in February  Chief Financial Officer Karen Hoguet said on Tuesday.",
        "date": "06062017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's warns on gross margin outlook  shares tumble "
    },
    {
        "content": "* Macy's CFO warns gross margin could be below forecast given in february  60-80 basis points below last year - CNBC reporter tweet",
        "date": "06062017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's CFO warns gross margin could be below forecast given in February  60-80 basis points below last year - CNBC reporter tweet "
    },
    {
        "content": "* Shares fall as much as 5 pct in early trading (Adds details  analyst comment; Updates shares)",
        "date": "05162017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 2-TJX's slow comparable-sales growth adds to retail gloom "
    },
    {
        "content": "* Shares hit record high at $160.83 (Adds details from conference call  updates shares)",
        "date": "05162017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-Home Depot's profit tops on higher sales of big-ticket items "
    },
    {
        "content": "Nordstrom Inc on Thursday became the latest department store operator after Macy's and Kohl's to report weaker-than-expected quarterly same-store sales  underscoring the industry's struggle to attract customers amid a slump in demand for apparel and a shift to shopping online.",
        "date": "05122017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Nordstrom's comparable sales miss deepens department-store gloom "
    },
    {
        "content": "* Macy's shares hit 6-yr low in regular trade  weigh on rivals (Adds Nordstrom's earnings; updates shares)",
        "date": "05112017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "UPDATE 4-Nordstrom's comparable sales miss deepens department-store gloom "
    },
    {
        "content": "* CFO on conf call-  international tourists sales declined at about the same rate as Q1 comp sales",
        "date": "05112017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's CFO - Expect improvement in trend to start in Q2 "
    },
    {
        "content": "* Futures down: Dow 49 pts  S&P 6.75 pts  Nasdaq 19.25 pts (Adds details  comments  updates prices)",
        "date": "05112017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS-Wall St to open lower on dismal Macy's results "
    },
    {
        "content": "* Q1 earnings per share view $0.35 -- Thomson Reuters I/B/E/S",
        "date": "05112017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's reports Q1 adjusted earnings per share $0.24 "
    },
    {
        "content": "May 11 Department store operator Macy's Inc reported a 39 percent drop in quarterly profit  hurt by a decline in sales and as higher inventory weighed on margins.",
        "date": "05112017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's quarterly profit tumbles 39 pct "
    },
    {
        "content": "NEW YORK  May 5 A glance at the U.S. stock market's main measure for the health of retailers suggests all is well among those companies in the business of peddling stuff directly to consumers.",
        "date": "05072017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "RPT-Wall St Weekahead-Old-guard retail back in the cross hairs "
    },
    {
        "content": "Department store operator Macy's Inc  and Tailored Brands Inc  have agreed to wind down operations of a tuxedo rental license agreement  the companies said on Wednesday.",
        "date": "05032017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's  Tailored Brands to end tuxedo rental partnership "
    },
    {
        "content": "* Macy's Inc- company   Tailored Brands announced their joint plan to wind down operations under Tuxedo rental license agreement",
        "date": "05032017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy’s  Tailored Brands to wind down partnership on Tuxedo shops "
    },
    {
        "content": "* Adcare appoints BRIAN M. SZAMES  former treasurer of Macy's  to board of directors Source text for Eikon: Further company coverage:",
        "date": "05022017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-AdCare appoints former treasurer of Macy's Brian Szames to board of directors "
    },
    {
        "content": "April 26 Amazon.com Inc wants to help you choose what to wear.",
        "date": "04262017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 2-Not sure what to wear? Amazon's algorithms may help "
    },
    {
        "content": "* Signed deals with U.S. department stores Macy's and Bloomingdale's",
        "date": "04052017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Italy's Giglio signs deals with Macy's  Bloomingdale's "
    },
    {
        "content": "TORONTO  April 5 Canadian department store operator Hudson's Bay Co said on Wednesday it was looking at a \"major reinvention\" of its business operations and gave its strongest signal yet of a possible initial public offering of its real estate assets.",
        "date": "04052017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-Hudson's Bay explores 'major reinvention ' considers real estate IPO "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.3775 per share Source text for Eikon: Further company coverage:",
        "date": "08252017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's sets regular quarterly dividend of $0.3775 per share "
    },
    {
        "content": "* Macy's and G-III sign exclusive agreement for DKNY Women's apparel and accessories",
        "date": "03272017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's and G-III sign exclusive agreement for DKNY women's apparel and accessories "
    },
    {
        "content": "* Macy's Inc - CEO Gennette's annual base salary will be $1.25 million - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "03242017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's CEO Gennette's annual base salary will be $1.25 mln - SEC filing "
    },
    {
        "content": "* Macy's  Inc. board of directors elects Jeff Gennette chief executive officer",
        "date": "03232017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's board elects Jeff Gennette chief executive officer "
    },
    {
        "content": "Starboard Value LP  the activist hedge fund that had pressured Macy's Inc  to separate its real estate from its retail business  has sold its stake in the U.S. department store operator  people familiar with the matter said on Wednesday.",
        "date": "03162017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Exclusive: Activist investor Starboard exits Macy's stock - sources "
    },
    {
        "content": "Canada's Hudson's Bay Co  is in talks to buy U.S. luxury fashion retailer Neiman Marcus Group LLC [NMRCUS.UL]  turning its focus away from Macy's Inc   the Wall Street Journal reported on Tuesday.",
        "date": "03142017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Canada's Hudson's Bay in talks to buy Neiman Marcus: WSJ "
    },
    {
        "content": "March 14 Luxury fashion retailer Neiman Marcus Group Ltd LLC said on Tuesday that it was exploring strategic alternatives  including changes to its capital structure or a sale of the company  as it seeks relief from its swelling debt pile.",
        "date": "03142017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 2-Neiman Marcus says it is exploring options  including a sale "
    },
    {
        "content": "March 14 Canada's Hudson's Bay Co is in talks to buy U.S. luxury fashion retailer Neiman Marcus Group LLC  turning its focus away from Macy's Inc  the Wall Street Journal reported on Tuesday.",
        "date": "03142017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Canada's Hudson's Bay in talks to buy Neiman Marcus - WSJ "
    },
    {
        "content": "* Q4 earnings per share view $-0.12 -- Thomson Reuters I/B/E/S",
        "date": "03082017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Tailored Brands reports Q4 loss per share of $0.62 "
    },
    {
        "content": "Canada's Hudson's Bay Co   owner of the Lord & Taylor and Saks Fifth Avenue retail chains  has yet to line up equity financing for a bid for Macy's Inc   over a month after approaching its U.S. peer  people familiar with the matter said.",
        "date": "03032017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Exclusive: Lord & Taylor owner Hudson's Bay's bid for Macy's stumbles - sources "
    },
    {
        "content": "* Macy's  Inc. completes sale of downtown Minneapolis property",
        "date": "03012017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's completes sale of downtown Minneapolis property "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.3775per share  Source text for Eikon:  Further company coverage:",
        "date": "02242017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's sets regular quarterly dividend of $0.3775per share "
    },
    {
        "content": "* Raises qtrly dividend by 20 pct to 3.25 cents/shr   (Adds analysts' comments  Q4 details; updates shares)",
        "date": "02222017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-TJX trumps estimates as shoppers lap up its holiday offerings "
    },
    {
        "content": "* CEO on conf call- \"physical stores will play an exceedingly important role in the future of shopping for us and others\"",
        "date": "02212017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's CEO on conf call- Anticipate the challenging environment in 2016 to continue "
    },
    {
        "content": "Feb 23 Department store operators Kohl's Corp  and rival Macy's Inc are betting on a potential money-spinner - carving out prime space within their sprawling stores and leasing them to other retailers.",
        "date": "02232017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Kohl's  Macy's turn landlords in bid to unlock real estate value "
    },
    {
        "content": "Department store operator Macy's Inc  reported a higher-than-expected quarterly profit  helped by the sale of some of its stores and lower costs and taxes  sending its shares up 3.3 percent in morning trading on Tuesday.",
        "date": "02212017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's profit tops estimates  but sales decline to continue "
    },
    {
        "content": "TORONTO  Feb 23 Canadian department store operator Hudson's Bay Co on Thursday reported lower sales in the fourth quarter  hurt by weaker results at its European  Saks OFF 5th and Gilt operations.",
        "date": "02232017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Canada's Hudson's Bay posts lower quarterly sales "
    },
    {
        "content": "* Shares down 3.3 pct   (Adds details from conference call  updates shares)",
        "date": "02212017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-Macy's profit tops estimates  but sales decline to continue "
    },
    {
        "content": "* Q4 earnings per share view $1.96 -- Thomson Reuters I/B/E/S",
        "date": "02212017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's posts Q4 adjusted earnings per share $2.02 "
    },
    {
        "content": "Feb 21 Department store operator Macy's Inc  reported a bigger-than-expected drop in quarterly sales as low demand for apparel and competition from online rivals hurt traffic in its stores.",
        "date": "02212017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's reports bigger-than-expected drop in quarterly sales "
    },
    {
        "content": "NEW YORK  Feb 13 Mick McGuire  founder of activist hedge fund Marcato Capital Management  told CNBC on Monday that Deckers Outdoor Corp had erred by investing significantly in physical retail stores.",
        "date": "02132017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Marcato's McGuire criticizes Deckers' retail expansion -CNBC "
    },
    {
        "content": "NEW YORK Macy's Inc  could see its shares rise by 50 percent in a potential sale  as the struggling retailer looks to turn around its business by downsizing its physical-store operations and reinvesting in its online presence  Barron's said on Sunday.",
        "date": "02122017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's could have 50 percent upside in a sale: Barron's "
    },
    {
        "content": "* Says Garrett Brands will develop  create  sell and distribute Frango products consistent with brand's legacy",
        "date": "01302017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's Inc sells ownership of Frango to Garrett Brands "
    },
    {
        "content": "Jan 25 EBay Inc reported a 3.1 percent rise in revenue for the fourth-quarter holiday period  offering signs of improvement at the company's traditional marketplace business and sending shares up more than 8 percent in extended trading on Wednesday.",
        "date": "01262017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-EBay holiday-quarter revenue up 3.1 pct  shares jump "
    },
    {
        "content": "Hudson's Bay Co has made a takeover approach for struggling retailer Macy's Inc  people familiar with the matter said  trying to push further into the U.S. market where it already owns the Lord & Taylor and Saks Fifth Avenue chains.",
        "date": "02032017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Canada's Hudson's Bay makes takeover approach for Macy's: sources "
    },
    {
        "content": "NEW YORK  Feb 2 Macy's Inc has settled its lawsuit accusing J.C. Penney Co of interfering improperly with its exclusive merchandising agreement with Martha Stewart Living Omnimedia Inc.",
        "date": "02022017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's  J.C. Penney settle Martha Stewart litigation "
    },
    {
        "content": "* Macy's expands fitness brand to men with ID ideology  Source text for Eikon:  Further company coverage:",
        "date": "01252017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's expands fitness brand to men with ID ideology "
    },
    {
        "content": "Feb 3 Hudson's Bay Co has made a takeover approach for struggling retailer Macy's Inc  people familiar with the matter said  trying to push further into the U.S. market where it already owns the Lord & Taylor and Saks Fifth Avenue chains.",
        "date": "02032017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 5-Canada's Hudson's Bay makes takeover approach for Macy's - sources "
    },
    {
        "content": "Feb 3 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "02032017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "TORONTO  Feb 3 Canada's main stock index rose on Friday  led by heavyweight financial and energy shares as oil rose and investors weighed a much stronger-than-expected increase in U.S. nonfarm payrolls.",
        "date": "02032017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "CANADA STOCKS-TSX rises as heavyweight financial shares climb "
    },
    {
        "content": "Feb 3 Canadian department store operator Hudson's Bay Co has made a takeover approach to U.S. department store chain Macy's Inc  the Wall Street Journal reported  citing sources.",
        "date": "02032017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Hudson's Bay makes takeover approach to Macy's - WSJ "
    },
    {
        "content": "CHICAGO  Jan 20 U.S. department store chains  hit by slowing sales for more than two years  have used layoffs  store closings and cutbacks to maintain one aspect of stability: profit margins.",
        "date": "01202017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "U.S. department stores steady profitability boat even as sales slide "
    },
    {
        "content": "Jan 13 An improving economy and attractive deals from retailers powered a better-than-expected 4 percent increase in U.S. holiday sales to $658.3 billion  retail industry group National Retail Federation said.",
        "date": "01132017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Strong economy  deals help holiday sales top forecast - NRF "
    },
    {
        "content": "Disappointing holiday-season sales at Macy's Inc  and Kohl's Corp  underscored the uphill task facing department stores to win back shoppers  who are increasingly turning to online retailers and spending less on apparel. | Video ",
        "date": "01052017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Dismal holiday sales at Macy's and Kohl's cast gloom over sector "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 06 (Fitch) Fitch Ratings has affirmed the long-term Issuer  Default Rating (IDR) on Macy's  Inc. (Macy's) and Macy's Retail Holdings  Inc.  (MRHI) at 'BBB' and affirmed the short-term IDR at 'F2'. The Rating Outlook has  been revised to Negative from Stable. A full list of rating actions follows at  the end of this release. The Negative Outlook reflects Fitch's reduced confidence in Macy's ability to  stabilize compara",
        "date": "01062017",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Fitch Affirms Macy's  Inc. at 'BBB'; Outlook Revised to Negative "
    },
    {
        "content": "Department store chains Macy's Inc  and Kohl's Corp  both cut their 2016 profit forecasts on Wednesday  after holiday season sales fell more than expected  pushing down shares in the retail sector in extended trading.",
        "date": "01052017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's  Kohl's slash 2016 profit forecasts citing weak holiday sales "
    },
    {
        "content": "* Asian shares hit 4-week high  world shares at 1-1/2-year high",
        "date": "01062017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "GLOBAL MARKETS-Asian shares rise as US interest rates ease  China steps up yuan defence "
    },
    {
        "content": "Sears Holdings Corp  said it would sell its Craftsman tools business to Stanley Black & Decker Inc  for $900 million  sending its shares up and taking some of the focus away from the company's dismal holiday season performance.",
        "date": "01052017",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Sears' Craftsman deal deflects focus from dismal holiday sales "
    },
    {
        "content": "* Macy's inc - \"currently experiencing high volume on our site  which has slowed traffic\"",
        "date": "11252016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's says currently experiencing high volume on site  which has slowed traffic "
    },
    {
        "content": "* Macy's CEO Terry Lundgren on CNBC - Seeing apparel sales picking up on Thanksgiving Day   Black Friday",
        "date": "11252016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's CEO Terry Lundgren on CNBC - Apparel sales picking up on Thanksgiving Day   Black Friday "
    },
    {
        "content": "A divided U.S. appeals court on Friday declined to reconsider its recent decision upholding a bargaining unit of cosmetics and fragrance department workers at a Macy's Inc store  the latest victory for unions and the National Labor Relations Board over so-called micro units.",
        "date": "11212016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Divided 5th Circuit won't review Macy's 'micro unit' ruling "
    },
    {
        "content": "* Jana Partners Llc dissolves common share stake in Ferrari NV  - SEC Filing",
        "date": "11142016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Jana Partners dissolves stake in Ferrari  Macy's "
    },
    {
        "content": "Macy's Inc  and Kohl's Corp  struck an optimistic note going into the holiday shopping season  giving a rare boost to shares of department store operators  which have struggled to grow in the face of intense competition from online retailers.",
        "date": "11102016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Department store shares get a boost from upbeat Macy's and Kohl's "
    },
    {
        "content": "Nov 10 Macy's Inc and Kohl's Corp  struck an optimistic note going into the holiday shopping season and rival Nordstrom Inc raised its annual profit outlook  giving a rare boost to shares of department store operators.",
        "date": "11102016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 2-U.S. department stores strike upbeat note  shares rise "
    },
    {
        "content": "* Macy's Inc-  Expecting comps sales on an owned plus license basis to be down about 0.5 percent to down 2 percent in Q4 -conf call",
        "date": "11102016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's expects comp sales to be down about 0.5 - down 2 pct in Q4 on an owned plus license basis "
    },
    {
        "content": "* Macy's formed a strategic alliance with brookfield asset management  to further explore value creation opportunities in its real estate portfolio",
        "date": "11102016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's reports Q3 EPS $0.05 "
    },
    {
        "content": "Nov 10 Department store operator Macy's Inc  reported a 4.2 percent fall in third-quarter sales  and said it had formed a partnership with asset manager Brookfield Asset Management to enhance the value of its real estate.",
        "date": "11102016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's quarterly sales fall 4.2 pct "
    },
    {
        "content": "* Macy's forms strategic alliance with Brookfield Asset Management to expand opportunities to enhance real estate portfolio value  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's forms strategic alliance with Brookfield Asset Management "
    },
    {
        "content": "* Expects to realize a gain of $32 million from store sales in Q3 of fiscal year 2016  Source text for Eikon:  Further company coverage:",
        "date": "10312016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's sells five stores to General Growth Properties "
    },
    {
        "content": "* Board has reduced size of board from fourteen (14) to thirteen (13) members - SEC filing  Source text:[http://bit.ly/2foldnu] Further company coverage:",
        "date": "10282016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's reduces size of its board "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.3775 per share  Source text for Eikon:  Further company coverage:",
        "date": "10282016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's Inc sets regular quarterly dividend of $0.3775 per share "
    },
    {
        "content": "* Board amended Macy's by-laws to provide clarity on notice provision for proxy access  Source text for Eikon:  Further company coverage:",
        "date": "09302016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's Inc board amended and restated Macy's by-laws "
    },
    {
        "content": "Sept 22 Macy's Inc will partner with beauty services provider beGlammed to provide at-home grooming and makeup services  as the department store operator focuses on beauty to help arrest a slide in sales.",
        "date": "09222016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's teams up with grooming services provider in beauty push "
    },
    {
        "content": "U.S. retailers are taking a cautious view of the holiday selling season this year - if their temporary hiring plans are anything to go by.",
        "date": "09202016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's joins Kohl's  Target in hiring cautiously for holiday season "
    },
    {
        "content": "Sept 20 Macy's Inc said it would hire about 83 000 temporary workers for the holiday quarter  the third major retailer after Kohl's and Target to keep seasonal hiring largely unchanged from last year.",
        "date": "09202016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's joins Kohl's  Target in keeping holiday season hiring flat "
    },
    {
        "content": "* Company's 2016 seasonal hiring plan is essentially flat to last year  Source text for Eikon:  Further company coverage:",
        "date": "09202016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's inc to hire 83 000 seasonal associates in 2016 "
    },
    {
        "content": "* Sets regular quarterly dividend of $0.3775 per share  Source text for Eikon:  Further company coverage:",
        "date": "08262016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's sets regular quarterly dividend of $0.3775/shr "
    },
    {
        "content": "* Lennox has served as Senior Vice President and Chief Marketing Officer of Toys \"R\" Us since 2014  Source text for Eikon:  Further company coverage:",
        "date": "08182016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Richard A. Lennox named Macy's Chief Marketing Officer "
    },
    {
        "content": "* CFO on conf call - sales trend in the major tourist stores improved for both Macy's and Bloomingdale's in Q2",
        "date": "08112016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's CFO on conf call - FY comparable sales forecast looks achievable "
    },
    {
        "content": "* Sees FY 2016 earnings per share $3.15 to $3.40 excluding items",
        "date": "08112016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's Q2 EPS $0.54 excluding items "
    },
    {
        "content": "* Macy's  Inc. Outlines moves to drive profitable growth and enhance shareholder value",
        "date": "08112016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's to close about 100 of its full-line stores "
    },
    {
        "content": "BOSTON Hedge fund manager David Einhorn told investors on Tuesday that his Greenlight Capital lost money on battered retailer Macy's Inc  and exited the position roughly six months after getting in.",
        "date": "07262016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Greenlight's Einhorn exits Macy's at a loss: letter "
    },
    {
        "content": "BOSTON  July 26 Hedge fund manager David Einhorn told investors on Tuesday that his Greenlight Capital lost money on battered retailer Macy's Inc and exited the position roughly six months after getting in.",
        "date": "07262016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Greenlight's Einhorn exits Macy's at a loss -letter "
    },
    {
        "content": "July 12 An Amazon.com Inc shopping event that the online retailer billed as its largest ever had a bumpy start on Tuesday  with some customers unable to add discounted items to their shopping carts and rival retailers aiming for a cut of the buying frenzy.",
        "date": "07122016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 4-Amazon's Prime Day shoppers encounter checkout snafus "
    },
    {
        "content": "By David Randall     NEW YORK  July 12 Amazon's long shadow is falling on retailers previously thought immune to the threat of e-commerce  forcing U.S. fund managers to rethink their approach to consumer stocks by focusing on companies whose businesses cannot be upended by the online giant.     At the core of the problem: Amazon.com Inc  once thought of as a place to buy books and household goods  is on track to become the largest apparel retailer in the United States by 2017  accord",
        "date": "07122016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "U.S. fund managers on hunt for companies that won't be 'Amazon'ed' away "
    },
    {
        "content": "WASHINGTON  June 22 Macy's Inc will provide additional employee training and pay an $8 700 civil penalty under a settlement of allegations it discriminated against non-U.S. citizens who were authorized to work  the U.S. Justice Department said on Wednesday.",
        "date": "06222016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "U.S. says reaches settlement on discrimination claim against Macy's "
    },
    {
        "content": "Macy's Inc  said Terry Lundgren will step down as CEO next year and be succeeded by former chief merchandising officer  Jeff Gennette  as the department store operator tries to revive sales hit by competition from online and off-price retailers. | Video ",
        "date": "06232016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Longtime Macy's CEO Lundgren to step down next year "
    },
    {
        "content": "* Shares rise as much as 5 pct   (Adds comments from CEO and President)",
        "date": "06232016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 6-Longtime Macy's CEO Lundgren to step down next year "
    },
    {
        "content": "* Jeff Gennette - \"going to reduce (customer) pain points  going to focus on our stores at a greater level than we have over the past year\"",
        "date": "06232016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's Inc's Jeff Gennette - going to focus on our stores at a greater level than we have over the past year\" "
    },
    {
        "content": "June 23 Macy's Inc said Chief Executive Terry Lundgren will be stepping down in the first quarter of 2017  and will be succeeded by Jeff Gennette  the department store operator's president.",
        "date": "06232016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's CEO Lundgren to step down in 2017 "
    },
    {
        "content": "* Says Lundgren will continue as executive chairman of company and work side-by-side with Gennette as president and CEO",
        "date": "06232016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's Inc says Jeff Gennette appointed CEO "
    },
    {
        "content": "June 16 The largest local association representing workers of Macy's Inc said it reached a tentative agreement with the department store operator for a new four-year contract  averting a strike that was set to begin on Thursday.",
        "date": "06162016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's reaches tentative deal with workers to avert strike "
    },
    {
        "content": "June 15 Macy's Inc is preparing for a possible strike over healthcare and pay by 5 000 workers at four New York locations  including its flagship store on Manhattan's Herald Square.",
        "date": "06152016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "New York Macy's workers threaten strike over health plan  pay "
    },
    {
        "content": "June 16 A union representing workers of Macy's Inc in New York said it reached a tentative agreement with the department store operator for a new four-year contract  averting a strike that was set to begin on Thursday.",
        "date": "06162016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Macy's reaches tentative deal with workers to avert strike "
    },
    {
        "content": "* Local 1-S Macy's workers union says Local 1-S and Macys have reached a tentative agreement on a new 4 year contract - Facebook Post  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06162016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Local 1-S Macy's Workers union and Macys reach tentative agreement on new 4 year contract - Facebook Post "
    },
    {
        "content": "A New York state judge ruled that department store chain Macy's Inc should be awarded roughly $3.5 million in damages from rival J.C. Penney Co for improperly interfering with Macy's exclusive contract with the company of lifestyle guru Martha Stewart.",
        "date": "06092016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Judge confirms Macy's $3.5 mln damage award in Martha Stewart case "
    },
    {
        "content": "One of the most conservative federal appeals courts has handed a significant victory to unions that represent retail workers  ruling that the National Labor Relations Board was right to approve a so-called micro union of Macy's Inc employees in Massachusetts.",
        "date": "06032016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "5th Circuit upholds 'micro union' of Macy's workers "
    },
    {
        "content": "NEW YORK  June 2 In their great hunt for the consumer dollar  mutual fund managers are leaving the mall.",
        "date": "06022016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US fund managers focus on niche retailers as consumer spending jumps "
    },
    {
        "content": "* Moody's revises Macy's rating outlook to negative  affirms baa2 senior unsecured rating",
        "date": "05192016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Moody's revises Macy's rating outlook to negative "
    },
    {
        "content": "* Shares recover after steep premarket fall   (Adds details from conference call  analyst comment; updates shares)",
        "date": "05132016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 5-J.C. Penney sales drop adds to department store blues "
    },
    {
        "content": "* Shares rise as much as 4.2 pct   (Adds Marmaxx sales  analyst comment; updates shares)",
        "date": "05172016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-T.J. Maxx owner raises forecast as shoppers hunt for bargains "
    },
    {
        "content": "* 1st-qtr U.S. comparable sales rise 7.4 pct vs. est. 4.9 pct",
        "date": "05172016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "CORRECTED-UPDATE 4-Home Depot raises forecasts after strong start to the year "
    },
    {
        "content": "Macy's Inc  reported a much bigger-than-expected drop in quarterly sales and slashed its full-year forecast  underscoring U.S. department stores' uphill struggle against slumping demand for apparel. | Video ",
        "date": "05112016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's forecast cut adds to apparel gloom; shares dive "
    },
    {
        "content": "NEW YORK Investors heavily discounted U.S. retailers on Wednesday after a series of disappointments in the sector  including a weak forecast from Macy's Inc .",
        "date": "05112016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's forecast helps trigger sell-off in U.S. retailers "
    },
    {
        "content": "NEW YORK  May 11 Investors heavily discounted U.S. retailers on Wednesday after a series of disappointments in the sector  including a weak forecast from Macy's Inc.",
        "date": "05112016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Macy's forecast helps trigger sell-off in U.S. retailers "
    },
    {
        "content": "* Indexes end down: Dow 1.21 pct  S&P 0.96 pct  Nasdaq 1.02 pct   (Updates to close)",
        "date": "05112016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS-Wall St slumps as Disney and Macy's slam consumer shares "
    },
    {
        "content": "NEW YORK  May 11 Investors heavily discounted U.S. retailers on Wednesday after a series of disappointments in the sector  including a weak forecast from Macy's Inc.",
        "date": "05112016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's forecast drives sell-off in U.S. retailer shares "
    },
    {
        "content": "* Shares of rivals also fall   (Adds analysts' comments  graphic; updates shares)",
        "date": "05112016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 4-Macy's forecast cut adds to apparel gloom; shares dive "
    },
    {
        "content": "* Indexes down: Dow 0.66 pct  S&P 0.47 pct  Nasdaq 0.43 pct   (Adds details  changes comment  updates shares)",
        "date": "05112016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS-Wall St drops as Disney  Macy's lead rout in consumer stocks "
    },
    {
        "content": "* CFO on conf call- no longer confident international tourist spending will improve anytime soon",
        "date": "05112016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's CFO on conf call - Don't expect Q2 comp sales to be significantly better than Q1 "
    },
    {
        "content": "May 11 U.S. stocks opened lower on Wednesday as oil prices surrendered early gains and poor results from Walt Disney and Macy's weighed on investor sentiment.",
        "date": "05112016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS SNAPSHOT-U.S. stocks open lower as Disney  Macy's drag "
    },
    {
        "content": "* Fitch SAYS expects recent weakness in mid-market apparel sector and online migration of sales will continue",
        "date": "04152016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Fitch downgrades Macy's  Inc. to 'BBB'; outlook stable "
    },
    {
        "content": "* Macy's CEO Terry Lundgren says consumer spending same as it was in January; spending on homes  autos rather than apparel -CNBC",
        "date": "04152016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macy's CEO says consumer spending same as in January - CNBC "
    },
    {
        "content": "* Sees 2016 adjusted diluted earnings per share of $3.80 to $3.90 - SEC filing",
        "date": "03302016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "BRIEF-Macy's sees 2016 adjusted diluted earnings per share $3.80 - $3.90 "
    },
    {
        "content": "* Says CEO Terry J. Lundgren FY 2015 total compensation $11.7 million versus $16.5 million in FY 2014",
        "date": "03302016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "BRIEF-Macys CEO Terry Lundgren FY 2015 total compensation $11.7 mln "
    },
    {
        "content": "March 22 Macy's Inc appointed William Lenehan  an expert in real estate investments  to its board amid investor pressure to monetize its real estate assets.",
        "date": "03222016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's appoints real estate expert to board "
    },
    {
        "content": "* Shares rise as much as 4 pct   (Adds details from conference call  analyst comment; updates shares)",
        "date": "03182016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-Luxury jeweler Tiffany's profit beats estimates as costs fall "
    },
    {
        "content": "Macy's Inc  plans to open Backstage off-price stores within some existing Macy's  betting that the benefit of bringing new customers into stores outweighs the risk of diluting the company brand and undercutting sales of full-price items.",
        "date": "02232016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's bets off-price stores within stores will drive traffic "
    },
    {
        "content": "Macy's Inc's  sales fell less than expected for the first time in four quarters  helped by a last-minute blast of cold weather in January  and the department store operator said there was a \"high degree\" of interest among parties it approached for real estate deals.",
        "date": "02232016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's in talks for real estate deals  sales fall less than feared "
    },
    {
        "content": "* Shares rise 5 percent amid broader market decline   (Adds details from conference call  graphic; updates shares)",
        "date": "02232016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-Macy's in talks for real estate deals  sales fall less than feared "
    },
    {
        "content": "Feb 23 Macy's Inc reported a 4.3 percent decline in quarterly comparable sales  slightly better than the 4.7 percent decline the department store operator had estimated  helped by improving sales due to colder weather in January.",
        "date": "02232016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's comparable sales falls less than it had expected "
    },
    {
        "content": "BOSTON  Jan 19 David Einhorn  whose Greenlight Capital hedge fund ranked among last year's worst performers  told investors on Tuesday that he has made new bets on stocks including battered retailer Macy's and is currently concentrating on delivering better returns.",
        "date": "01192016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Einhorn  after terrible 2015  takes new stake in Macy's -letter "
    },
    {
        "content": "Hedge fund Starboard Value LP urged department store chain Macy's Inc  to enter into joint ventures for its stores  including its flagship Herald Square store in New York  to realize greater value from its real estate assets. | Video ",
        "date": "01112016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Starboard urges Macy's to strike real-estate deals "
    },
    {
        "content": "Macy's Inc  said it will eliminate more than 2 000 jobs and consolidate operations after reporting weak holiday sales  highlighting a downturn in apparel demand that has likely taken a similar toll on other department stores and clothing chains.    Macy's said comparable sales at stores open for more than a year tumbled by 4.7 percent in November and December  far worse than what it had estimated in November  and it cut its earnings outlook for the second time in two month",
        "date": "01072016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's to cut jobs  shut stores amid weak holiday sales "
    },
    {
        "content": "* Shares up 2.8 pct after market   (Recasts with number of jobs to be cut  adds analyst comments)",
        "date": "01072016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-Macy's to cut jobs  shut stores amid weak holiday sales "
    },
    {
        "content": "* Shares up 4.6 pct after market   (Adds details  background; updates shares)",
        "date": "01062016",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "UPDATE 2-Macy's to cut jobs  shut stores amid weak holiday sales "
    },
    {
        "content": "Department store chain Macy's Inc  which lowered its full-year earnings expectations for the second time  said it would cut jobs and consolidate its operations  starting early 2016.",
        "date": "01062016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's lowers earnings forecast; to cut jobs "
    },
    {
        "content": "Jan 6 Department store chain Macy's Inc  said it would shut some stores and cut jobs  starting early 2016.",
        "date": "01062016",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's to shut stores  cut jobs "
    },
    {
        "content": "* Cuts full-year same-store sales growth forecast   (Adds details from conference call  analysts comments; updates shares)",
        "date": "12032015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-Dollar General profit beats despite sluggish consumer spending "
    },
    {
        "content": "SAN FRANCISCO  Dec 2 Short sellers shopping for overpriced stocks snapped up shares of beleaguered department store Macys heading into Black Friday.",
        "date": "12022015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Short sellers shopped for Macy's stock ahead of Black Friday "
    },
    {
        "content": "Department store operator Nordstrom Inc  on Thursday followed Macy's Inc  in cutting its full-year forecast  bringing back into sharp focus concerns of a slowdown in the retail sector.",
        "date": "11122015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Nordstrom's forecast cut renews concerns about retail slowdown "
    },
    {
        "content": "* Shares fall 20.5 pct to $50.46 after market   (Adds analyst comment; updates shares)",
        "date": "11122015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 2-Nordstrom's forecast cut renews concerns about retail slowdown "
    },
    {
        "content": " (In Nov. 11 story  corrects spelling of Michael in paragraph 4) | Video ",
        "date": "11122015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's cuts full-year forecast  sends shivers through retail "
    },
    {
        "content": "* Seeks partnerships or joint ventures for flagship properties",
        "date": "11122015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "REFILE-UPDATE 5-Macy's cuts full-year forecast  sends shivers through retail (Nov 11) "
    },
    {
        "content": "Mounting inventory at Macy's Inc  portends a tough holiday quarter for U.S. department store operators as they compete with home improvement and electronics retailers for the attention of thrifty customers.",
        "date": "11122015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's rising inventory rings warning bells for dept stores "
    },
    {
        "content": "Warm weather  low spending by tourists and a pileup of unsold inventory prompted Macy's Inc  to cut its full-year forecast on Wednesday  raising wide concerns about the retail sector's financial health. | Video ",
        "date": "11112015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's cuts full-year forecast  sends shivers through retail "
    },
    {
        "content": "* Seeks partnerships or joint ventures for flagship properties",
        "date": "11112015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 5-Macy's cuts full-year forecast  sends shivers through retail "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 11 (Fitch) An unseasonably warm autumn is leading out credit  default swap (CDS) spreads for Macy's  Inc. to levels not seen since 2012   according to Fitch Solutions in its latest CDS case study snapshot. Five-year CDS on Macy's widened out 16% over the past week and are now trading  140% wider than they were at the start of the year. As a result  the cost of  credit protection on Macy's debt is at its widest levels ",
        "date": "11112015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Fitch Solutions: Macy's CDS at Widest Level in Three Years "
    },
    {
        "content": "* Indexes up: Dow 0.12 pct  S&P 0.13 pct  Nasdaq 0.06 pct   (Updates to open)",
        "date": "11112015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS-Wall St little changed in choppy trade  retailers fall "
    },
    {
        "content": "* Futures up: Dow 59 pts  S&P 6.5 pts  Nasdaq 13.5 pts   (Adds details  comment  updates prices)",
        "date": "11112015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS-Futures rise as weak Chinese factory data raises stimulus hopes "
    },
    {
        "content": "MILAN  Nov 11 Ray-Ban maker Luxottica  is set to open concessions of its LensCrafters optical retail brand in as many as 500 Macy's shops over the next three years after signing an accord with the U.S. department store chain  it said on Wednesday.",
        "date": "11112015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Luxottica to open LensCrafters concessions at Macy's "
    },
    {
        "content": "* Shares up 8.5 pct after-hours   (Adds details and comments from conference call)",
        "date": "10212015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-EBay's profit beat shows there's life after PayPal "
    },
    {
        "content": "Macy's Inc  under pressure from activist investors to spin off its prized real estate assets  said it sold four floors of its downtown Seattle store to private investment firm Starwood Capital Group for $65 million.",
        "date": "10092015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's sells four floors of downtown Seattle store for $65 million "
    },
    {
        "content": "Oct 9 Macy's Inc  under pressure from activist investors to spin off its prized real estate assets  said it sold four floors of its downtown Seattle store to private investment firm Starwood Capital Group for $65 million.",
        "date": "10092015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's sells four floors of downtown Seattle store for $65 mln "
    },
    {
        "content": "Sept 21 Department store chain Macy's Inc  plans to hire 85 000 temporary workers in the United States for the holiday shopping season  down from 86 000 last year.",
        "date": "09212015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's to hire 85 000 workers for holiday shopping season "
    },
    {
        "content": "Macy's Inc  said it would shut 35-40 underperforming stores  accounting for about 1 percent of the department store operator's sales  as more and more customers shop online.",
        "date": "09082015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's to close 35-40 underperforming stores in early 2016 "
    },
    {
        "content": "Sept 8 Macy's Inc said it would shut 35-40 underperforming stores  accounting for about 1 percent of the department store operator's sales  as more and more customers shop online.",
        "date": "09082015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Macy's to close 35-40 underperforming stores in early 2016 "
    },
    {
        "content": "Sept 8 Department store operator Macy's Inc  said it would shut 35-40 underperforming stores early next year as more and more customers move their shopping online.",
        "date": "09082015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "CORRECTED-Macy's to close 35-40 underperforming stores in early 2016 "
    },
    {
        "content": "Sept 8 Macy's Inc said on Tuesday that consumer electronics retailer Best Buy Co Inc will set up outlets in 10 Macy's stores from November on a test basis.",
        "date": "09082015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's to test Best Buy outlets in its stores "
    },
    {
        "content": "Macy's Inc's  plan to open a virtual store on Alibaba offers a cheap way into China  but as the latest in a long list of initiatives to spur growth it could spread management thin.",
        "date": "08132015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "As Macy's eyes China  some see need for more focus at home "
    },
    {
        "content": "Macy's Inc  lowered its full-year sales forecast and said it formed an ecommerce joint venture in China to sell products on Alibaba Group Holdings Ltd's  Tmall marketplace as the department store operator looks to grow beyond the sluggish U.S. market. | Video ",
        "date": "08122015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's cuts full-year sales forecast  forms China venture "
    },
    {
        "content": "* Macy's expects $50 mln in sales from China in 2016   (Adds comments from CEO  analyst; updates shares)",
        "date": "08122015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 4-Macy's cuts full-year sales forecast  forms China venture "
    },
    {
        "content": "Aug 12 Alibaba Group Holding Ltd said it had signed an agreement with the Chinese joint venture of Macy's Inc to set up the U.S. retailer's online store on its online marketplace  Tmall Global.",
        "date": "08122015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's to set up China online store on Alibaba's Tmall Global "
    },
    {
        "content": "Aug 12 Alibaba Group Holding Ltd said it signed an agreement with the Chinese joint venture of Macy's Inc to set up the U.S. retailer's store on its online marketplace  Tmall Global.",
        "date": "08122015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Macy's to set up China online store on Alibaba's Tmall Global "
    },
    {
        "content": "Aug 12 Macy's Inc reported a 2.6 percent fall in quarterly sales  the fourth drop in six quarters  as spending by foreign tourists declined \"significantly\" due to a strong dollar.",
        "date": "08122015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's reports fall in sales  forms e-commerce JV in China "
    },
    {
        "content": "CHICAGO/SAN FRANCISCO  July 22 Macy's Inc  is expanding same-day delivery to several new U.S. markets this summer  one of the most aggressive pushes by a brick-and-mortar retailer in an area dominated by e-commerce giant Amazon   according to a Macy's official.",
        "date": "07222015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's to expand same-day delivery to new U.S. markets  challenging Amazon "
    },
    {
        "content": "July 22 The National Retail Federation  the biggest U.S. retail association  cut its forecast for retail sales growth in the country this year  citing an unexpected slowdown in growth in the first half of the year.",
        "date": "07222015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-NRF cuts 2015 U.S. retail sales forecast after weak first half "
    },
    {
        "content": "* Indexes off: Dow 0.02 pct  S&P 0.07 pct  Nasdaq 0.12 pct   (Updates to market close)",
        "date": "07152015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS-Wall Street edges lower as energy weighs "
    },
    {
        "content": "* Indexes off: Dow 0.18 pct  S&P 0.23 pct  Nasdaq 0.24 pct   (Updates to late afternoon  changes byline  adds Beige Book)",
        "date": "07152015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS-Wall Street dips after Fed's Yellen as energy weighs "
    },
    {
        "content": "U.S. retail chain Macy's is a cheap stock trading more than 70 percent below value  and its highly-prized real estate assets could be spun off  investment firm Starboard Value said on Wednesday after announcing it had taken a stake in the company.",
        "date": "07152015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's underpriced  real estate assets could be spun off: Starboard "
    },
    {
        "content": "* Indexes up: Dow 0.07 pct  S&P 0.09 pct  Nasdaq 0.16 pct   (Updates to early afternoon)",
        "date": "07152015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS-Wall St higher; financial stocks lead "
    },
    {
        "content": "July 7 PVH Corp said it would wind down the production of Donald Trump's menswear after exclusive retail partner Macy's Inc decided to stop selling his products in protest against racist remarks made by the real estate tycoon.",
        "date": "07072015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "PVH's apparel deal with Trump ends as Macy's cuts ties with tycoon "
    },
    {
        "content": "Macy's Inc said on Wednesday it would end its business relationship with Donald Trump  and New York City said it was reviewing its contracts with the billionaire developer and U.S. presidential hopeful because of his comments insulting Mexicans. | Video ",
        "date": "07012015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's cuts ties with Trump  New York City reviews contracts "
    },
    {
        "content": "July 1 Macy's Inc said on Wednesday it would end its business relationship with Donald Trump  and New York City said it was reviewing its contracts with the billionaire developer and U.S. presidential hopeful because of his comments insulting Mexicans.",
        "date": "07012015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-Macy's cuts ties with Trump  New York City reviews contracts "
    },
    {
        "content": "July 1 Department store Macy's Inc said on Wednesday that it would end its business relationship with real estate developer and TV personality Donald Trump after his comments insulting Mexicans  including phasing out the Trump line of menswear.",
        "date": "07012015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's cuts ties with Donald Trump after Mexico insults "
    },
    {
        "content": "NEW YORK Several hedge funds have asked U.S. department store company Macy's Inc  to consider options for its real estate  including selling some major sites and then leasing them back   according to several sources close to the matter.",
        "date": "06022015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Exclusive: Hedge funds to Macy's: Sell your real estate "
    },
    {
        "content": "* Indexes up: Dow 0.03 pct  S&P 0.1 pct  Nasdaq 0.2 pct   (Adds details  changes comment  updates prices)",
        "date": "05132015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "US STOCKS-Wall St pares early gains on weak data  bond market swings "
    },
    {
        "content": "Macy's Inc  forecast a lower second-quarter profit as it marks down merchandise received late due to a strike at West Coast ports and foreign tourists spend less as the dollar stays strong. | Video ",
        "date": "05132015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Markdowns on delayed merchandise to hurt Macy's profit "
    },
    {
        "content": "* First-qtr comp sales down 0.1 pct vs est 1 pct rise   (Adds forecast and graphic  updates share move)",
        "date": "05132015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 3-Markdowns on delayed merchandise to hurt Macy's profit "
    },
    {
        "content": "* Indexes up: Dow 0.1 pct  S&P 0.3 pct  Nasdaq 0.5 pct   (Updates to open)",
        "date": "05132015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS-Wall St opens higher after two days of losses "
    },
    {
        "content": "* Futures: Dow down 6 pts  S&P up 2.50 pts  Nasdaq up 11 pts   (Adds details  comment  updates prices)",
        "date": "05132015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "US STOCKS-Wall St set to open mixed on tepid data "
    },
    {
        "content": "May 13 Macy's Inc reported a 14 percent drop in quarterly profit  hurt by lower foreign tourist spending in the United States  colder-than-usual weather in February and disruptions at West Coast ports.",
        "date": "05132015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's quarterly profit falls 14 pct "
    },
    {
        "content": "American Express Co  said it will team up with seven U.S. companies  including Macy's Inc   AT&T Inc  and Exxon Mobil Corp   to launch a cross-brand loyalty program for the first time in the United States.",
        "date": "03182015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "AmEx to launch its first cross-brand loyalty program in U.S. "
    },
    {
        "content": "March 18 American Express Co said it will team up with seven U.S. companies  including Macy's Inc   AT&T Inc and Exxon Mobil Corp  to launch a cross-brand loyalty program for the first time in the United States.",
        "date": "03182015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-AmEx to launch its first cross-brand loyalty program in U.S. "
    },
    {
        "content": "March 18 American Express Co will team up with seven companies  including Macy's Inc  AT&T Inc  and Exxon Mobil Corp  to launch a loyalty program this spring  the Wall Street Journal reported.",
        "date": "03182015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "AmEx to launch cross-brand loyalty program - WSJ "
    },
    {
        "content": "NEW YORK A New York state appeals court on Thursday revived most of Macy's Inc's lawsuit accusing J.C. Penney Co of interfering improperly with its exclusive merchandising contract with Martha Stewart Living Omnimedia Inc.",
        "date": "02262015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "U.S. court revives Macy's claims vs JC Penney over Martha Stewart "
    },
    {
        "content": "NEW YORK  Feb 26 A New York state appeals court on Thursday revived most of Macy's Inc's lawsuit accusing J.C. Penney Co of interfering improperly with its exclusive merchandising contract with Martha Stewart Living Omnimedia Inc.",
        "date": "02262015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 2-U.S. court revives Macy's claims vs JC Penney over Martha Stewart "
    },
    {
        "content": "Feb 26 Macy's Inc's planned push into the off-price retailing sector  dominated by chains such as TJX Cos Inc's TJ Maxx  shows the venerable department store chain has faced up to new realities of retailing in the United States.",
        "date": "02262015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "For Macy's  going downmarket looks like the way ahead "
    },
    {
        "content": "NEW YORK  Feb 26 A New York state appeals court has revived two claims accusing JC Penney Co Inc of interfering improperly with a merchandising contract between Macy's Inc and Martha Stewart Living Omnimedia Inc .",
        "date": "02262015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "NY court revives Macy's claims vs JC Penney on Martha Stewart deal "
    },
    {
        "content": "Macy's Inc  said sales and margins in the current quarter would be hurt by disruptions at U.S. West Coast ports  and the retailer forecast full-year profit and revenue that fell short of analysts' expectations.",
        "date": "02242015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "West Coast port disruptions to hit Macy's first quarter sales  margins "
    },
    {
        "content": "* Shares fall as much as 4.8 pct   (Adds CFO comment from conference call; updates shares)",
        "date": "02242015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 4-West Coast port disruptions to hit Macy's Q1 sales  margins "
    },
    {
        "content": "Feb 24 Department store chain Macy's Inc  reported a less-than 2 percent rise in sales in the holiday shopping quarter  falling short of analysts' estimates.",
        "date": "02242015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's holiday-quarter sales miss analysts' estimates "
    },
    {
        "content": "Department store chain Macy's Inc  estimated full-year 2014 profit to be higher than its previous forecast and said it would buy luxury beauty and spa services retailer Bluemercury Inc for $210 million.",
        "date": "02032015",
        "name": "Macy&#39;s Inc",
        "news_type": "topStory",
        "symbol": "M",
        "title": "Macy's 2014 profit estimate tops forecast "
    },
    {
        "content": "Feb 3 Department store chain Macy's Inc  estimated full-year 2014 profit to be higher than its previous forecast and said it would buy luxury beauty and spa services retailer Bluemercury Inc for $210 million.",
        "date": "02032015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Macy's 2014 profit estimate tops forecast "
    },
    {
        "content": "Feb 3 Department store chain Macy's Inc  estimated full-year 2014 profit of $4.35-$4.37 per share  higher than its previous forecast of $4.25-$4.35 per share.",
        "date": "02032015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's full-year profit estimate tops forecast "
    },
    {
        "content": "Jan 8 Macy's Inc said it would close 14 stores in early spring 2015 and cut some jobs to boost its investment in technology and offset higher expense expected in healthcare and retirement plans.",
        "date": "01082015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "Macy's to cut jobs  close 14 stores "
    },
    {
        "content": "Jan 8 Department store operator Macy's Inc  said it would close 14 stores in early spring 2015 and cut some jobs to focus on its popular services such as in-store pickups for online orders and \"ship-from-store\".",
        "date": "01082015",
        "name": "Macy&#39;s Inc",
        "news_type": "normal",
        "symbol": "M",
        "title": "UPDATE 1-Macy's to cut jobs  close 14 stores "
    }
]