[
    {
        "content": "* Mid-America Apartment Communities Inc - qtrly ‍net income available for MAA common shareholders was $113.8 million  or $1.00 per diluted common share​",
        "date": "10252017",
        "name": "Mid-America Apartment Communities Inc",
        "news_type": "topStory",
        "symbol": "MAA",
        "title": "BRIEF-MAA reports Q3 adjusted FFO per share $1.32 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 28 (Fitch) Fitch Ratings has affirmed the Issuer Default Ratings (IDRs) of Mid-America Apartment Communities  Inc. and its operating partnership  Mid-America Apartments LP. (collectively MAA) at 'BBB+'. Fitch has also assigned a 'BBB-' rating to the Series I preferred stock MAA assumed in the recent acquisition of Post Properties. The Rating Outlook is Stable. KEY RATING DRIVERS Leverage Strong for Rating: Fitch expe",
        "date": "09282017",
        "name": "Mid-America Apartment Communities Inc",
        "news_type": "topStory",
        "symbol": "MAA",
        "title": "Fitch Affirms Mid-America Apartment Communities at 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Mid-America Apartment Communities Inc - notes were priced at 99.580% of principal amount",
        "date": "05022017",
        "name": "Mid-America Apartment Communities Inc",
        "news_type": "topStory",
        "symbol": "MAA",
        "title": "BRIEF-Mid-America Apartment announces pricing of senior unsecured notes offering "
    },
    {
        "content": "* Mid-America Apartment Communities Inc - combined adjusted same store noi for q1 increased 3.6% as compared to same period in prior year",
        "date": "04262017",
        "name": "Mid-America Apartment Communities Inc",
        "news_type": "topStory",
        "symbol": "MAA",
        "title": "BRIEF-Mid-America Apartment Communities reports Q1 adjusted FFO per share $1.36 "
    },
    {
        "content": "* Sets quarterly dividend of $0.87per share  Source text for Eikon:  Further company coverage:",
        "date": "03232017",
        "name": "Mid-America Apartment Communities Inc",
        "news_type": "topStory",
        "symbol": "MAA",
        "title": "BRIEF-Mid-America Apartment Communities sets quarterly dividend of $0.87per share "
    },
    {
        "content": "* Mid-America Apartment Communities Inc - same store noi for q4 increased 4.2% as compared to same period in prior year",
        "date": "02012017",
        "name": "Mid-America Apartment Communities Inc",
        "news_type": "topStory",
        "symbol": "MAA",
        "title": "BRIEF-MAA Q4 core FFO per share $1.50 "
    },
    {
        "content": "* Mid-America Apartment Communities Inc - Same store NOI for Q3 increased 3.7% as compared to same period in prior year",
        "date": "10272016",
        "name": "Mid-America Apartment Communities Inc",
        "news_type": "topStory",
        "symbol": "MAA",
        "title": "BRIEF-MAA reports third quarter results "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  August 15 (Fitch) Fitch Ratings has upgraded the Issuer Default  Ratings (IDRs) of Mid-America Apartment Communities  Inc. and its operating  partnership  Mid-America Apartments LP to 'BBB+' from 'BBB'. The Rating Outlook  is Stable.  KEY RATING DRIVERS The rating upgrade reflects the sustained improvement in MAA's key credit  metrics in recent years  including leverage and unencumbered asset coverage of  unsecured debt (UA/UD",
        "date": "08152016",
        "name": "Mid-America Apartment Communities Inc",
        "news_type": "topStory",
        "symbol": "MAA",
        "title": "Fitch Upgrades Mid-America Apartment's IDR to 'BBB+'; Outlook Stable "
    },
    {
        "content": "Mid-America Apartment Communities Inc  said it would buy Post Properties Inc  for about $3.88 billion to create the largest publicly traded multifamily apartment real estate investment trust by units.",
        "date": "08152016",
        "name": "Mid-America Apartment Communities Inc",
        "news_type": "normal",
        "symbol": "MAA",
        "title": "Mid-America Apartment to buy Post Properties for $3.88 billion "
    },
    {
        "content": "Aug 15 Mid-America Apartment Communities Inc  said it would buy Post Properties Inc for about $3.88 billion to create the largest publicly traded multifamily apartment real estate investment trust by units.",
        "date": "08152016",
        "name": "Mid-America Apartment Communities Inc",
        "news_type": "normal",
        "symbol": "MAA",
        "title": "UPDATE 3-Mid-America Apartment to buy Post Properties for $3.88 bln "
    }
]