[
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 16 (Fitch) Fitch Ratings has affirmed Marriott International's (NYSE: MAR) Long-Term Issuer Default Rating (IDR) at 'BBB' and Short-Term IDR at 'F2'. The Rating Outlook remains Positive. Fitch has also affirmed Starwood Hotels & Resorts Worldwide  Inc.'s IDR at 'BBB' and maintained the Positive Rating Outlook. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS The Positive Outlook con",
        "date": "11162017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Fitch Affirms Marriott at 'BBB'; Maintains Positive Outlook "
    },
    {
        "content": "* ‍MARRIOTT INTERNATIONAL SAYS ANNOUNCED GLOBAL PARTNERSHIP WITH UNIVERSAL MUSIC GROUP​ Source text for Eikon: Further company coverage:",
        "date": "11132017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-‍MARRIOTT INTERNATIONAL ANNOUNCES GLOBAL PARTNERSHIP WITH UNIVERSAL MUSIC GROUP​ "
    },
    {
        "content": "* Marriott International declares cash dividend and increases share buyback authorization",
        "date": "11092017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott increases share buyback authorization  declares dividend "
    },
    {
        "content": "Marriott International Inc   the world's largest hotel chain  raised its full-year profit forecast for the third time this year and also increased the lower end of a key revenue measure  amid robust demand from business travelers.",
        "date": "11072017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott raises full-year profit forecast amid strong demand "
    },
    {
        "content": "Nov 7 Marriott International Inc  the world's largest hotel chain  raised its full-year profit forecast for the third time this year and also increased the lower end of a key revenue measure  amid robust demand from business travelers.",
        "date": "11072017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "UPDATE 1-Marriott raises full-year profit forecast amid strong demand "
    },
    {
        "content": "* Marriott International reports third quarter 2017 results highlights",
        "date": "11072017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International reports Q3 earnings per share $1.04 "
    },
    {
        "content": "Nov 7 Marriott International Inc  the world's largest hotel chain  reported a 43.7 percent rise in third-quarter revenue as more people booked its rooms.",
        "date": "11072017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott's revenue jumps 43.7 percent "
    },
    {
        "content": "* Ashford Hospitality Prime Inc announces finalization of strategy for non-core hotels",
        "date": "11012017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Ashford Hospitality Prime announces finalization of strategy for non-core hotels "
    },
    {
        "content": "* Apple Hospitality REIT acquires two Residence Inn by Marriott Hotels",
        "date": "10232017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Apple Hospitality REIT acquires two Residence Inn by Marriott Hotels "
    },
    {
        "content": "* MARRIOTT INTERNATIONAL APPOINTS RENA REISS EXECUTIVE VICE PRESIDENT AND GENERAL COUNSEL Source text for Eikon: Further company coverage:",
        "date": "10192017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-MARRIOTT INTERNATIONAL APPOINTS RENA REISS EXECUTIVE VICE PRESIDENT AND GENERAL COUNSEL "
    },
    {
        "content": "* Says on October 17  a unit of co sold The Sheraton Centre Toronto Hotel  owned on a long-term ground lease  for approximately C$335 million‍​ ‍​",
        "date": "10182017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott's unit sells The Sheraton Centre Toronto Hotel "
    },
    {
        "content": "* Announces Ed Ryan to retire as general counsel Source text for Eikon: Further company coverage:",
        "date": "10172017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott announces Ed Ryan to retire as general counsel "
    },
    {
        "content": "Food services company Aramark  said on Monday it would buy Avendra LLC  majority owned by Marriott International Inc   and uniform and linen supplier AmeriPride Services Inc for a total of $2.35 billion  before tax benefit adjustments.",
        "date": "10162017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Food services firm Aramark to buy Avendra  AmeriPride in $2.35 billion deal "
    },
    {
        "content": "Oct 16 Food services company Aramark said on Monday it would buy Avendra LLC  majority owned by Marriott International Inc  and uniform and linen supplier AmeriPride Services Inc for a total of $2.35 billion  before tax benefit adjustments.",
        "date": "10162017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Food services firm Aramark to buy Avendra  AmeriPride in $2.35 bln deal "
    },
    {
        "content": "* ‍owners of Avendra  LLC have reached a binding agreement to sell avendra to aramark for $1 350 million​",
        "date": "10162017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott to receive about $650 mln for 55 pct interest in Avendra "
    },
    {
        "content": "* Marriott International Chairman Jw Marriott  Jr. reports sale of 26 362 shares of co at average price of $101.78/share on Sept 6  2017 - SEC filing Source text : [ID:http://bit.ly/2gPjVUz] Further company coverage:",
        "date": "09072017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International Chairman Jw Marriott  Jr. reports sale of 26 362 shares of co "
    },
    {
        "content": "* Marriott international declares quarterly cash dividend Source text for Eikon: Further company coverage:",
        "date": "08102017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott international sets quarterly cash dividend of $0.33 per share "
    },
    {
        "content": "Marriott International Inc   the world's largest hotel chain  narrowed its forecast for the revenue it expects to earn this year from its rooms in North America  sending the company's shares down more than 2 percent in extended trading on Monday.",
        "date": "08072017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott narrows key North America revenue forecast  shares slip "
    },
    {
        "content": "Aug 7 Marriott International Inc  the world's largest hotel chain  narrowed its forecast for the revenue it expects to earn this year from its rooms in North America  sending the company's shares down more than 2 percent in extended trading on Monday.",
        "date": "08072017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "UPDATE 1-Marriott narrows key North America revenue forecast  shares slip "
    },
    {
        "content": "* Marriott International reports second quarter 2017 results highlights",
        "date": "08072017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International Q2 earnings per share $1.08 "
    },
    {
        "content": "Aug 7 Marriott International Inc  the world's largest hotel chain  reported a 67.6 percent rise in second-quarter profit as more people booked its rooms at higher rates.",
        "date": "08072017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott profit soars 68 pct on higher bookings  room rates "
    },
    {
        "content": " (In the fourth paragraph  corrects to show that Alibaba will run Marriott's Chinese-language websites and apps  not that it will run Marriott's websites and apps) | Video ",
        "date": "08082017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott set to woo Chinese tourists with Alibaba deal "
    },
    {
        "content": "Aug 7 Marriott International Inc said on Monday it would partner with China's Alibaba Group Holding Ltd to tap into the growing number of Chinese consumers traveling abroad.",
        "date": "08072017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott looks to woo Chinese travelers with Alibaba deal "
    },
    {
        "content": "* Alibaba Group and Marriott International announce innovative joint venture to redefine travel experience",
        "date": "08072017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Alibaba  Marriott International announce joint venture "
    },
    {
        "content": "Aug 7 Marriott International Inc said on Monday it would partner with China's Alibaba Group Holding Ltd to tap into the growing number of Chinese citizens who travel abroad.",
        "date": "08082017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "CORRECTED-UPDATE 2-Marriott set to woo Chinese tourists with Alibaba deal "
    },
    {
        "content": "July 18 Hotel loyalty programs have helped U.S. chains such as Hyatt  Hilton and Marriott score more bookings on their own websites  luring customers from online travel agents that had seen commissions balloon to an estimated $3.5 billion a year.",
        "date": "07192017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "CORRECTED-U.S. hotels bank on loyalty programs in push for direct booking "
    },
    {
        "content": "* SIGNS A FRANCHISE AGREEMENT WITH MARRIOTT INTERNATIONAL FOR CITY HOTEL THAT PANGAEA OWNS IN PATRA",
        "date": "07112017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-NBG Pangaea signs a franchise agreement with Marriott International "
    },
    {
        "content": "Marriott International Inc  Chief Executive Arne Sorenson on Thursday urged the Trump administration to improve relations with post-Castro Cuba and recognize tourism as a strategic tool in the effort.",
        "date": "06152017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott CEO urges Trump to improve ties with Cuba "
    },
    {
        "content": "* Marriott's CEO Arne Sorenson says \"urge the trump administration to recognize and utilize travel as a strategic tool in its efforts to improve relations with cuba\"",
        "date": "06152017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott issues statement on Cuba "
    },
    {
        "content": "June 11 Abdulmohsen Al Hokair Group for Tourism and Development",
        "date": "06112017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Abdulmohsen Al Hokair signs lease contract with Jabal Omar Development "
    },
    {
        "content": "* Marriott's new mobile app to feature big review TV video content",
        "date": "06072017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Big Un Ltd says Big Review TV partners with Marriott International "
    },
    {
        "content": "* Marriott - ‍expects to grow its collection brands by nearly 50% by 2019.​ Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott says expects to grow its collection brands by nearly 50 pct by 2019​ "
    },
    {
        "content": "* Marriott - on June 1  Carey Watermark Investors 2 Incorporated acquired Charlotte Marriott City Center Hotel for about $170 million from co's unit",
        "date": "06022017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott  on June 1  Carey Watermark Investors 2 acquired Charlotte Marriott City Center hotel for about $170 mln from Co's unit "
    },
    {
        "content": "* Marriott says stronger demand in north america  europe and asia was one of the factors that drove 2017 revpar forecast raise - conf call",
        "date": "05092017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott says stronger demand in North America  Europe  Asia drive 2017 RevPAR forecast raise - Conf call "
    },
    {
        "content": "* Marriott - declared quarterly dividend of 33 cents per share of common stock  which represents a 10 percent increase over previous quarterly dividend Source text for Eikon: Further company coverage:",
        "date": "05052017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International sets quarterly cash dividend of 33 cents/shr "
    },
    {
        "content": "Marriott International Inc   the world's largest hotel chain  reported a higher-than-expected quarterly profit  driven by higher room rates and occupancy.",
        "date": "05082017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott profit beats on higher occupancy "
    },
    {
        "content": "May 8 Marriott International Inc  the world's largest hotel chain  reported a higher-than-expected quarterly profit  driven by higher room rates and occupancy.",
        "date": "05082017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "UPDATE 1-Marriott profit beats on higher occupancy "
    },
    {
        "content": "* Soroban Capital GP reports 5.4 pct passive stake in Marriott International as of April 20 - sec filing Source text: (http://bit.ly/2qx7lIX) Further company coverage:",
        "date": "05012017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Soroban Capital reports 5.4 pct passive stake in Marriott "
    },
    {
        "content": "May 8 Marriott International Inc  the world's largest hotel chain  reported a nearly 67 percent rise in its quarterly profit as more people booked its rooms at higher rates.",
        "date": "05082017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott quarterly profit jumps about 67 pct "
    },
    {
        "content": "* Marriott - unveiled a comprehensive expansion to its initiative to drive adoption of modular construction of hotels in North America",
        "date": "05012017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott unveiled a comprehensive expansion to its initiative to drive adoption of modular construction "
    },
    {
        "content": "* Marriott international sells the 759-room Westin Maui Resort & Spa and retains long-term management agreement",
        "date": "04032017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International sells 759-room Westin Maui Resort & Spa for about $317 mln "
    },
    {
        "content": "March 28 Milestone Apartments Real Estate Investment Trust said on Tuesday that its unitholders approved the company's takeover by U.S. private investment firm Starwood Capital Group for about $1.3 billion.",
        "date": "03282017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "CORRECTED-UPDATE 1-Milestone Apartments REIT unitholders approve takeover "
    },
    {
        "content": "March 21 Marriott International Inc said on Tuesday it planned to add up to 300 000 rooms worldwide by 2019  as part of a three-year growth plan  ahead of the No. 1 hotel chain's investor day.",
        "date": "03212017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott to add up to 300 000 rooms by 2019 "
    },
    {
        "content": "* Marriott - will outline plans to accelerate its growth  adding 285 000 to 300 000 rooms worldwide by 2019",
        "date": "03212017",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott sees diluted earnings per share of $5.25 to $5.80 by 2019 "
    },
    {
        "content": "* Marriott international announces 2020 growth vision in europe post starwood acquisition",
        "date": "03072017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International says expects to increase size of its portfolio in Europe across all segments of industry "
    },
    {
        "content": "BERLIN Hotels group Marriott International  is planning to speed up the expansion of brands acquired in the takeover of rival Starwood  and is not ruling out further additions to its portfolio  its chief executive said on Monday.",
        "date": "03062017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott to speed up expansion of Starwood brands: CEO "
    },
    {
        "content": "* Q4 earnings per share view $0.84 -- Thomson Reuters I/B/E/S",
        "date": "02152017",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International posts Q4 adj. earnings $0.85/shr "
    },
    {
        "content": "* Says continues expansion in Latin America with signing of four new hotels in Mexico  Source text for Eikon:  Further company coverage:",
        "date": "11232016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International Continues Expansion in Latin America with four New Hotels in Mexico "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.30 per share  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International sets quarterly dividend of $0.30/share "
    },
    {
        "content": "* Marriott International Inc says for combined company  Marriott anticipates pro forma gross room additions of 6 percent  or 5 percent  net  for fy 2016",
        "date": "11072016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International Q3 adjusted EPS $0.91 "
    },
    {
        "content": "Nov 8 TripAdvisor Inc reported lower-than-expected quarterly revenue as the travel review website operator earned less from referrals to third-party hotel websites.",
        "date": "11082016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "UPDATE 1-TripAdvisor revenue misses estimates as referral income falls "
    },
    {
        "content": "Marriott International Inc  reported a 10.2 percent rise in quarterly revenue  as the hotel chain gained from the acquisition of Starwood Hotels and Resorts Worldwide Inc.",
        "date": "11072016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Hotel chain Marriott's quarterly revenue rises 10.2 percent "
    },
    {
        "content": "Nov 7 Marriott International Inc  reported a 10.2 percent rise in quarterly revenue  as the hotel chain gained from the acquisition of Starwood Hotels and Resorts Worldwide Inc.",
        "date": "11072016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Hotel chain Marriott's quarterly revenue rises 10.2 pct "
    },
    {
        "content": "* Marriott International's signature brand  Marriott Hotels  signs agreement to return to Athens in 2018",
        "date": "10192016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International's Marriott Hotels  signs agreement to return to Athens in 2018 "
    },
    {
        "content": "JOHANNESBURG Marriott International said on Thursday that Amdec Group plans to spend 3 billion rand ($218 million) on five new hotels in South Africa for the world's leading hotel company as it looks to tap into Africa's growing middle class.",
        "date": "10062016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott expands in South Africa with five new hotels "
    },
    {
        "content": "JOHANNESBURG  Oct 6 Marriott International  said on Thursday that Amdec Group plans to spend 3 billion rand ($218 million) on five new hotels in South Africa for the world's leading hotel company as it looks to tap into Africa's growing middle class.",
        "date": "10062016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "CORRECTED-UPDATE 1-Marriott expands in South Africa with five new hotels "
    },
    {
        "content": "JOHANNESBURG  Oct 5 Marriott International  plans to spend 3 billion rand  ($218.14 million) on hotels in South Africa  it said on Wednesday.",
        "date": "10052016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott to spend $218 mln on hotels in South Africa "
    },
    {
        "content": "JOHANNESBURG  Oct 6 Marriott International  confirmed on Thursday that its property development partner  Amdec Group  would spend 3 billion rand ($218 million) on five new hotels in South Africa as the company looks to tap Africa's growing middle class.",
        "date": "10062016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "CORRECTED-Marriott International confirms plans for five new South African hotels "
    },
    {
        "content": "* Marriott announces cash change of control repurchase offer for Starwood 7.150% senior notes due 2019 and Starwood 3.125% senior notes due 2023",
        "date": "09232016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott announces cash change of control repurchase offer "
    },
    {
        "content": "* Says completed its acquisition of starwood hotels & resorts worldwide inc  Source text for Eikon:  Further company coverage:",
        "date": "09232016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International completes acquisition of Starwood Hotels & Resorts "
    },
    {
        "content": "Chinese antitrust regulators approved Marriott International Inc's  deal to buy Starwood Hotels & Resorts Worldwide Inc   clearing the way for the combined company to become the world's largest hotel chain.",
        "date": "09202016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "China's OK clears last hurdle for Marriott's deal to buy Starwood "
    },
    {
        "content": "Sept 20 Chinese antitrust regulators approved Marriott International Inc's deal to buy Starwood Hotels & Resorts Worldwide Inc  clearing the way for the combined company to become the world's largest hotel chain.",
        "date": "09202016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "UPDATE 1-China's OK clears last hurdle for Marriott's deal to buy Starwood "
    },
    {
        "content": "Sept 20 Chinese antitrust regulators approved Marriott International Inc's deal to buy Starwood Hotels & Resorts Worldwide Inc  clearing the way for the combined company to become the world's largest hotel group.",
        "date": "09202016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "China approves Marriott's deal to buy Starwood "
    },
    {
        "content": "* Marriott's acquisition of Starwood receives antitrust approval in China",
        "date": "09202016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott's acquisition of Starwood receives antitrust approval in China "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.30 per share  Source text for Eikon:  Further company coverage:",
        "date": "09132016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International sets quarterly dividend of $0.30/share "
    },
    {
        "content": "* Update on china's ministry of commerce review of Marriott and Starwood merger",
        "date": "08082016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International updates on China's Ministry Of Commerce review "
    },
    {
        "content": "* For FY sees standalone comparable systemwide REVPAR on constant dollar basis will grow 3 percent in N. America  outside n. America and worldwide",
        "date": "07272016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International Q2 earnings per share $0.96 "
    },
    {
        "content": "* Co and National Basketball Association (NBA) announced a partnership extension",
        "date": "07212016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International and NBA announce partnership extension "
    },
    {
        "content": "* Marriott receives antitrust clearance from the European Union to acquire Starwood",
        "date": "06272016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott gets antitrust clearance from European Union to buy Starwood "
    },
    {
        "content": "BRUSSELS  June 27 U.S. hotel chain Marriott International secured EU antitrust approval on Monday for its cash and share purchase of Starwood Hotels and Resorts Worldwide Inc.",
        "date": "06272016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "EU clears Marriott's purchase of Starwood Hotels "
    },
    {
        "content": "BRUSSELS U.S. hotel chain Marriott International  is on track to win unconditional EU antitrust approval for its cash and share purchase of Starwood Hotels and Resorts Worldwide Inc   a person familiar with the matter said on Tuesday.",
        "date": "06142016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Exclusive: EU set to clear unconditionally Marriott  Starwood deal - source "
    },
    {
        "content": "* Amended agreement amends and restates Marriott's $2.00 billion multicurrency revolving credit agreement",
        "date": "06132016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International entered fourth amended credit agreement "
    },
    {
        "content": "BRUSSELS  June 13 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "06132016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "EU mergers and takeovers (June 13) "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 07 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Marriott  International Inc.'s (Marriott; MAR) planned $1.5 billion  multi-tranche  unsecured notes issuance.  The Rating Outlook is Positive. A full list of rating actions follows at the end  of the release. On June 7  2016  Marriott announced two tranches (series Q and R) of senior  unsecured notes with anticipated gross proceeds totaling $1.5 billion. One  series ",
        "date": "06072016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Fitch Rates Marriott's $1.5B Unsecured Notes 'BBB' "
    },
    {
        "content": "* Noble acquires 1 396-room Marriott Hotel portfolio  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06022016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Noble acquires 1 396-room marriott hotel portfolio "
    },
    {
        "content": "* Marriott international announces 20 percent increase in cash dividend",
        "date": "05062016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International increases quarterly cash dividend by 20 pct to $0.30 per share "
    },
    {
        "content": "* Q1 earnings per share view $0.84 -- Thomson Reuters I/B/E/S",
        "date": "04272016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International reports Q1 adjusted earnings per share $0.87 "
    },
    {
        "content": "Marriott International Inc's revenue rose 7.4 percent in the first quarter  helped by higher room rates and occupancy at its hotels.",
        "date": "04272016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Hotel chain Marriott's quarterly revenue rises 7.4 percent "
    },
    {
        "content": "April 27 Marriott International Inc's  revenue rose 7.4 percent in the first quarter  helped by higher room rates and occupancy at its hotels.",
        "date": "04272016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Hotel chain Marriott's quarterly revenue rises 7.4 pct "
    },
    {
        "content": "April 8 Starwood Hotels & Resorts Worldwide Inc  and Marriott International Inc said on Friday the stockholders of the companies voted to approve Marriott's acquisition of Starwood to create the world's largest hotel company.",
        "date": "04082016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott  Starwood Hotels stockholders approve deal "
    },
    {
        "content": "April 8 Starwood Hotels & Resorts Worldwide Inc  and Marriott International Inc said on Friday the stockholders of the companies voted to approve Marriott's acquisition of Starwood to create the world's largest hotel company.",
        "date": "04082016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "UPDATE 1-Marriott  Starwood Hotels stockholders approve deal "
    },
    {
        "content": "* Transaction remains on track to close mid-2016 pending completion of Starwood's planned divestiture of its timeshare business",
        "date": "04082016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott and Starwood stockholders vote to approve merger "
    },
    {
        "content": "* CEO Arne M. Sorenson fy 2015 compensation was $11 million versus $14.9 million in fy 2014 - sec filing",
        "date": "04052016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International says CEO Arne M. Sorenson FY 2015 compensation was $11 mln "
    },
    {
        "content": "* Paulson & Co says will vote all its shares in favor of the Marriott offer for Starwood  Further company coverage:     (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04012016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Paulson & Co says will vote its shares in favor of Marriott offer for Starwood "
    },
    {
        "content": "* Marriott Internatuional CEO - No one at Marriott has had any communication with Anbang - Conf call",
        "date": "04012016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott CEO says shareholders voting against Starwood deal would be an \"odd result\" - Conf call "
    },
    {
        "content": "China's Anbang Insurance Group Co raised its offer for Starwood Hotels & Resorts Worldwide Inc  to almost $14 billion  Starwood said on Monday  in the latest challenge to the U.S. hotel operator's merger with Marriott International Inc . | Video ",
        "date": "03292016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "China's Anbang raises offer for Starwood to $14 billion "
    },
    {
        "content": "April 1 Marriott International Inc Chief Executive Arne Sorenson said the hotel group would have loved to have agreed on a lower price for Starwood Hotel & Resorts Worldwide Inc.",
        "date": "04012016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott CEO says would have loved to have won Starwood for less "
    },
    {
        "content": "* Marriott CEO to CNBC: \"We would love to have Starwood for a billion dollars less\"  Further company coverage:    (Bengaluru Newsroom)",
        "date": "04012016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott CEO to CNBC: \"We would love to have Starwood for a billion dollars less\" "
    },
    {
        "content": "* Marriott and Starwood both support and encourage shareholders to vote for merger on April 8  2016",
        "date": "04012016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott and Starwood to host shareholder meetings on april 8  2016 "
    },
    {
        "content": "* Marriott International's statement on terrorist attacks in Brussels",
        "date": "03222016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Marriott's statement on terrorist attacks in Brussels "
    },
    {
        "content": "BEIJING China's insurance regulator would likely reject a bid by Anbang Insurance Group to buy Starwood Hotels and Resorts Worldwide Inc  since it would put the insurer's offshore assets above a threshold for overseas investments  Caixin said on Tuesday.",
        "date": "03222016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "China regulator would reject Anbang's Starwood deal: Caixin "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 21 (Fitch) Fitch Ratings continues to see positive ratings  momentum for Marriott International stemming from its planned merger with  Starwood Hotels & Resorts. However  less creditor friendly financial terms  associated with Marriott's revised offer for Starwood increases execution risk  and will likely delay the conclusion of our Positive Outlook towards the latter  part of the one- to two-year Rating Outlook horizon.",
        "date": "03212016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Fitch: Revised Starwood Offer Likely Delays Marriott's Ratings Momentum "
    },
    {
        "content": "March 18 When Anbang Insurance Group acquired New York's Waldorf Astoria Hotel last year  the Chinese company gained more than one of the city's most iconic buildings. It got a base on Park Avenue across from the office of veteran dealmaker Paul Taubman.",
        "date": "03192016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Anbang's Starwood bid is major Chinese prize for Taubman's PJT "
    },
    {
        "content": "* Dow up 0.16 pct  S&P up 0.13 pct  Nasdaq up 0.27 pct   (Updates to afternoon)",
        "date": "03212016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "US STOCKS-Wall St flat as Fed still dominates investor sentiment "
    },
    {
        "content": "* Dow up 0.08 pct  S&P down 0.05 pct  Nasdaq up 0.05 pct   (Updates to early afternoon)",
        "date": "03212016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "US STOCKS-Wall St flat as investors pause after 5-week rally "
    },
    {
        "content": "* Indexes up: Dow 0.15 pct  S&P 0.05 pct  Nasdaq 0.19 pct   (Adds details  changes comment  updates prices)",
        "date": "03212016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "US STOCKS-Wall St flat as fall in energy offset by health stocks "
    },
    {
        "content": "* Dow down 0.06 pct  S&P down 0.07 pct  Nasdaq up 0.03 pct   (Updates to open)",
        "date": "03212016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "US STOCKS-Wall St flat as investors seek growth catalysts "
    },
    {
        "content": "* Expect $250 million synergies from Starwood deal to be realized by 2018  if not before - Conf call",
        "date": "03212016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott expects Starwood deal to be \"slightly dilutive\" in 2016 - Conf call "
    },
    {
        "content": "March 18 Starwood Hotels & Resorts Inc  said it planned to terminate a deal to be acquired by Marriott International Inc after it received a superior proposal from a group led by China's Anbang Insurance Group.",
        "date": "03182016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Starwood Hotels to end Marriott deal as China's Anbang hikes bid "
    },
    {
        "content": "* Futures down: Dow 14 pts  S&P 2 pts  Nasdaq 5 pts   (Adds details  comment  updates prices)",
        "date": "03212016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "US STOCKS-Wall St set to open little changed as investors pause "
    },
    {
        "content": "March 18 The following bids  mergers  acquisitions and disposals were reported by 1950 GMT on Friday:",
        "date": "03182016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Co Starwood agreed to convene stockholder meeting for deal on march 28;to immediately adjourn such meeting until april 8  Source text - http://1.usa.gov/25ff4vd Further company coverage:     (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "03212016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International and Starwood to adjourn respective stockholder meeting for deal until April 8 "
    },
    {
        "content": "March 15 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "03152016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "PRESS DIGEST -Wall Street Journal - March 15 "
    },
    {
        "content": "* Starwood merger termination would temper Marriott's ratings momentum",
        "date": "03142016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "BRIEF-Fitch says Starwood merger termination would temper Marriott's ratings momentum "
    },
    {
        "content": "* Revised terms value Starwood at $79.53 per share or $13.6 billion",
        "date": "03212016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott international and Starwood Hotels & Resorts Worldwide sign amended merger agreement "
    },
    {
        "content": "* Will monitor development as it and Starwood continue to work toward closing of its transaction\u007f",
        "date": "03142016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "BRIEF-Marriott International says reaffirms commitment to merge with Starwood Hotels "
    },
    {
        "content": "March 21 Marriott International Inc said it made a higher offer for Starwood Hotels and Resorts Worldwide Inc that was accepted by the owner of the Sheraton and Westin hotel brands.",
        "date": "03212016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Sheraton-owner Starwood accepts higher offer from Marriott "
    },
    {
        "content": "BERLIN Hotel group Marriott International is concerned about tourist bookings in Paris this summer after November's attacks on the French capital  an executive at the firm said on Tuesday.",
        "date": "03082016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott concerned about Paris summer bookings after attacks "
    },
    {
        "content": "BERLIN  March 8 Hotel group Marriott International is concerned about tourist bookings in Paris this summer after November's attacks on the French capital  an executive at the firm said on Tuesday.",
        "date": "03082016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "REFILE-Marriott concerned about Paris summer bookings after attacks "
    },
    {
        "content": "BANGKOK  Feb 29 TCC Group  which is controlled by Thai billionaire Charoen Sirivadhanabhakdi  said on Monday it planned to invest more than 23 billion baht ($644 million) through 2020 to build and renovate seven hotels in Thailand under the Marriott brand.",
        "date": "02292016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Thailand's TCC joins with Marriott to open 7 hotels by 2020 "
    },
    {
        "content": "NASHVILLE  Tenn. Attorneys for sportscaster Erin Andrews said on Tuesday a Marriott hotel was negligent in enabling a guest to shoot a nude video of her that went viral on the Internet  while the Tennessee hotel put the blame entirely on the stalker. | Video ",
        "date": "02242016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Sportscaster Erin Andrews' lawyer blames hotel in stalking case "
    },
    {
        "content": "NASHVILLE  Tenn.  Feb 23 Attorneys for sportscaster Erin Andrews said on Tuesday a Marriott hotel was negligent in enabling a guest to shoot a nude video of her that went viral on the Internet  while the Tennessee hotel put the blame entirely on the stalker.",
        "date": "02232016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Sportscaster Erin Andrews' lawyer blames hotel in stalking case "
    },
    {
        "content": "Feb 18 U.S. hotel operators Starwood Hotels & Resorts Worldwide and Marriott International cut their 2016 forecast for a key revenue metric amid fears of slowing global economic growth.",
        "date": "02182016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Starwood Hotels  Marriott cut key revenue metric forecast "
    },
    {
        "content": "Feb 17 Hotel chain Marriott International Inc  reported a 4 percent rise in quarterly revenue  boosted by higher room rates in North America.",
        "date": "02172016",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott revenue rises 4 pct "
    },
    {
        "content": "Hotel chain Marriott International Inc  reported a 4 percent rise in quarterly revenue  boosted by higher room rates in North America.",
        "date": "02182016",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott revenue rises 4 percent "
    },
    {
        "content": "Marriott International Inc  will buy Starwood Hotels & Resorts Worldwide Inc  for $12.2 billion to create the world's largest hotel chain with top brands including Sheraton  Ritz Carlton and the Autograph Collection. | Video ",
        "date": "11162015",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott to buy Starwood to create world's biggest hotel chain "
    },
    {
        "content": "* Starwood shares fall as much as 8 pct   (Adds comments by sources on sale process  Hyatt declined to comment)",
        "date": "11162015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "UPDATE 5-Marriott to buy Starwood to create world's biggest hotel chain "
    },
    {
        "content": "* Indexes close up: Dow 1.38 pct  S&P 1.49 pct  Nasdaq 1.15 pct   (Updates to close)",
        "date": "11162015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "US STOCKS-Wall St surges over 1 pct  looks past Paris attacks "
    },
    {
        "content": "* Indexes up: Dow 1.11 pct  S&P 1.11 pct  Nasdaq 0.80 pct   (Updates to afternoon trade)",
        "date": "11162015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "US STOCKS-Wall Street jumps 1 pct  looks beyond Paris attacks "
    },
    {
        "content": "Nov 16 U.S. stock index futures were slightly higher on Monday  recovering from losses over the weekend after Friday's deadly attacks in Paris that killed about 130 people.",
        "date": "11162015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "US STOCKS-Futures inch up  reversing losses after Paris attacks "
    },
    {
        "content": "Nov 16 Marriott International Inc will buy Starwood Hotels & Resorts Worldwide Inc in a cash and stock deal valued at $12.2 billion to create the world's largest hotel chain.",
        "date": "11162015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott to buy Starwood Hotels in $12.2 bln deal "
    },
    {
        "content": "HONG KONG U.S.-based hotel chain Marriott International Inc and Alibaba Group's online travel booking platform announced a tie-up on Monday  joining a flurry of rivals expanding their presence in China to cater to the country's growing upper-middle class.",
        "date": "11092015",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott  Alitrip tie-up to let Chinese travellers book online "
    },
    {
        "content": "Nov 8 Marriott International Inc and Alibaba Group's online travel booking platform  Alitrip  have tied up to let Chinese travelers book hotel rooms online and on their mobile phones through a directly operated online flagship store.",
        "date": "11092015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott  Alipay tie up to let Chinese travelers book online "
    },
    {
        "content": "SAO PAULO  Oct 6 U.S. hotel chain Marriott International Inc plans to almost triple the number of its hotels in Brazil  in a bet that the nation's worst recession in a quarter century will be short-lived.",
        "date": "10062015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Marriott to triple Brazil hotels on hopes of short-lived recession "
    },
    {
        "content": "BERLIN  March 3 Hotels group Marriott  plans to double the number of hotels it has in Europe by 2020  with growth led by its new Moxy brand aimed at travellers on a budget.",
        "date": "03032015",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Marriott eyes European expansion led by Moxy budget brand "
    },
    {
        "content": "NEW DELHI/MUMBAI London's landmark Grosvenor House hotel has been put up for sale after its owner  part of troubled Indian conglomerate Sahara which has been trying to raise funds for its jailed boss Subrata Roy  was placed into administration by creditors.",
        "date": "03032015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "Sahara's Grosvenor House hotel in London put up for sale "
    },
    {
        "content": "NEW DELHI/MUMBAI  March 3 London's landmark Grosvenor House hotel has been put up for sale after its owner  part of troubled Indian conglomerate Sahara which has been trying to raise funds for its jailed boss Subrata Roy  was placed into administration by creditors.",
        "date": "03032015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "UPDATE 1-Sahara's Grosvenor House hotel in London put up for sale "
    },
    {
        "content": "Hilton Worldwide Holdings Inc   owner of the Waldorf Astoria hotel brand  forecast lower-than-expected earnings for the first quarter as a strong dollar makes it more expensive for foreigners to travel to the United States. | Video ",
        "date": "02182015",
        "name": "Marriott International",
        "news_type": "topStory",
        "symbol": "MAR",
        "title": "Hilton forecast disappoints  Marriott profit beats "
    },
    {
        "content": "* Hilton expects 1st-qtr earnings/shr $0.10-$0.12 vs est. $0.15",
        "date": "02182015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "UPDATE 5-Hilton forecast disappoints  Marriott profit beats "
    },
    {
        "content": "WASHINGTON  Jan 27 The U.S. Federal Communications Commission on Tuesday warned hotels and other entities against blocking personal Wi-Fi access  or hot spots  saying it was illegal and could incur heavy fines.",
        "date": "01282015",
        "name": "Marriott International",
        "news_type": "normal",
        "symbol": "MAR",
        "title": "U.S. FCC warns against blocking personal Wi-Fi access "
    }
]