[
    {
        "content": "Mattel Inc has rebuffed Hasbro Inc's latest takeover approach  people familiar with the matter said on Wednesday  casting uncertainty over the potential combination of the world's two largest toy companies.",
        "date": "11162017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Exclusive: Mattel snubs Hasbro's latest acquisition approach - sources "
    },
    {
        "content": "Hasbro Inc  has made an approach to acquire rival Mattel Inc   a source familiar with the matter said on Friday  the latest attempt to combine the two biggest U.S. toymakers in more than two decades.",
        "date": "11112017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "U.S. toymaker Hasbro makes new approach to buy Mattel: source "
    },
    {
        "content": "* Hasbro makes takeover approach to Mattel - CNBC citing   Dow Jones Source: http://cnb.cx/2hpJf46 Further company coverage:",
        "date": "11102017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Hasbro makes takeover approach to Mattel - CNBC citing   Dow Jones "
    },
    {
        "content": "Nov 10 Hasbro Inc has made an approach to acquire rival Mattel Inc  a source familiar with the matter said on Friday  the latest attempt to combine the two biggest U.S. toymakers in more than two decades.",
        "date": "11112017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 3-U.S. toymaker Hasbro makes new approach to buy Mattel -source "
    },
    {
        "content": "Nov 10 Toymaker Hasbro Inc has made a takeover approach for rival Mattel Inc  the Wall Street Journal reported on Friday.",
        "date": "11102017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Hasbro makes takeover offer for Mattel - WSJ "
    },
    {
        "content": "* Southeastern Asset Management Inc​ reports 10.2 percent passive stake in Mattel Inc as of Oct 30 - SEC filing Source text: (http://bit.ly/2hqpJ45) Further company coverage:",
        "date": "10312017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Southeastern Asset Management reports 10.2 pct passive stake in Mattel "
    },
    {
        "content": "Shares of Mattel Inc  fell to their lowest since the 2008 financial crisis on Friday after the Barbie maker suspended its dividend and warned it would miss forecasts for revenue this year.",
        "date": "10272017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Toys'R'Us collapse  scrapped dividend crush Mattel shares "
    },
    {
        "content": "Toymaker Mattel Inc  said on Thursday it would miss its full-year revenue forecast and decided to stop dividend from the fourth quarter to beef up its faltering business that has been hurt by the bankruptcy of its largest customer Toys'R'Us.",
        "date": "10272017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Toymaker Mattel to miss FY revenue forecast  halts dividend "
    },
    {
        "content": "* Q3 loss per share $1.75; Q3 adjusted earnings per share $0.09",
        "date": "10262017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel Q3 loss per share $1.75 "
    },
    {
        "content": "Oct 26 Toymaker Mattel Inc said on Thursday it would miss its full-year revenue forecast and decided to stop dividend from the fourth quarter to beef up its faltering business that has been hurt by the bankruptcy of its largest customer Toys'R'Us.",
        "date": "10272017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 3-Toymaker Mattel to miss FY revenue forecast  halts dividend "
    },
    {
        "content": "Oct 26 Toymaker Mattel Inc said it would suspend its quarterly dividend from the fourth quarter and use the money to beef up its faltering business after a hit from the bankruptcy of its largest retailer Toys'R'Us.",
        "date": "10262017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Toymaker Mattel suspends quarterly dividend "
    },
    {
        "content": "* In connection with becoming CFO  co entered into offer letter with Joseph Euteneuer on Sept 25  which provides annual base salary of $900 000​ Source text for Eikon: (http://bit.ly/2fI7xSq) Further company coverage:",
        "date": "10032017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel enters into offer letter with Joseph Euteneuer "
    },
    {
        "content": "Oct 3 Barbie doll maker Mattel Inc on Tuesday said it appointed Joseph Euteneuer as chief financial officer  effective Sept. 25  replacing Kevin Farr.",
        "date": "10032017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Barbie doll maker Mattel appoints new CFO "
    },
    {
        "content": "Oct 3 Barbie doll maker Mattel Inc on Tuesday said Joseph Euteneuer replaced Kevin Farr as chief financial officer  effective Sept. 25.",
        "date": "10032017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 1-Barbie doll maker Mattel appoints new CFO "
    },
    {
        "content": "* Mattel Inc - ‍appointment of Joseph J. Euteneuer as chief financial officer (CFO)  effective September 25  2017​",
        "date": "10032017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel appoints Joe Euteneuer as chief financial officer "
    },
    {
        "content": "Sept 28 Mattel and tech company Osmo will launch an augmented reality version of Hotwheels toy cars on Thursday that seeks to duplicate the worldwide success of smartphone app Pokemon Go.",
        "date": "09282017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel seeks Pokemon-style boost from new HotWheels game "
    },
    {
        "content": "Sept 18 Shares of Mattel Inc and Hasbro Inc  the two largest U.S. toy makers  fell on Monday on concerns that retailer Toys \"R\" Us  a major customer  could be filing for bankruptcy protection before the holiday sales season.",
        "date": "09182017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "UPDATE 2-Toy companies' shares tumble on concerns of Toys 'R' Us bankruptcy "
    },
    {
        "content": "Sept 18 Shares of U.S. toy companies Mattel Inc and Hasbro Inc fell on Monday on concerns that retailer Toys \"R\" Us  a major customer  could be filing for bankruptcy before the holiday sales season.",
        "date": "09182017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Toy companies' shares fall on concerns of Toys \"R\" Us bankruptcy "
    },
    {
        "content": "CHICAGO  Sept 6 Wal-Mart Stores Inc has begun its holiday layaway program as it hopes to cash-in early on demand for gifts like toys  which saw slower sales growth industry-wide last December and has struggled to pick up so far this year.",
        "date": "09062017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Wal-Mart starts holiday layaway program amid slow toy sales "
    },
    {
        "content": "Mattel Inc  posted quarterly sales and profit that fell short of estimates as higher sales of toys based on the \"Cars 3\" movie failed to offset weak demand for its main brands such as American Girl  Barbie and Fisher-Price.",
        "date": "07272017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Barbie maker Mattel's profit  sales miss estimates "
    },
    {
        "content": "* Mattel and Babytree to launch child-focused learning centers in China Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel and Babytree to launch child-focused learning centers in China "
    },
    {
        "content": "July 27 Mattel Inc posted quarterly sales and profit that fell short of estimates as higher sales of toys based on the \"Cars 3\" movie failed to offset weak demand for its main brands such as American Girl  Barbie and Fisher-Price.",
        "date": "07272017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 2-Barbie maker Mattel's profit  sales miss estimates "
    },
    {
        "content": "July 27 Mattel Inc's quarterly sales missed analysts' estimates on Thursday as higher sales of Cars 3 toys failed to offset weak demand for the company's main brands such as Barbie and Fisher-Price in the United States.",
        "date": "07272017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel posts lower-than-expected quarterly sales "
    },
    {
        "content": "* Mattel opens east coast distribution center in pennsylvania Source text for Eikon: Further company coverage:",
        "date": "07212017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel opens east coast distribution center in Pennsylvania "
    },
    {
        "content": "* Mattel launches new franchise Enchantimals Source text for Eikon: Further company coverage:",
        "date": "07182017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel launches new franchise Enchantimals "
    },
    {
        "content": "July 17 Mattel Inc  the world's largest toymaker  said on Monday Kevin Farr will step down after a 17-year stint as chief financial officer.",
        "date": "07172017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel's longtime finance chief Kevin Farr to step down "
    },
    {
        "content": "July 17 Mattel Inc  the world's largest toymaker  said on Monday Kevin Farr will step down after a 17-year stint as its chief financial officer.",
        "date": "07172017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 1-Mattel's longtime finance chief Kevin Farr to step down "
    },
    {
        "content": "* Mattel Inc - on July 11  Mattel determined that Kevin M. Farr  company's chief financial officer  will separate from company - SEC filing",
        "date": "07172017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel says CFO Kevin Farr will separate from company "
    },
    {
        "content": "Toymaker Mattel Inc  is looking to replace its chief financial officer  Kevin Farr  the Wall Street Journal reported on Thursday.",
        "date": "07132017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel seeks to replace veteran finance chief Kevin Farr: WSJ "
    },
    {
        "content": "July 13 Toymaker Mattel Inc is looking to replace its chief financial officer  Kevin Farr  the Wall Street Journal reported on Thursday.",
        "date": "07132017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel seeks to replace veteran finance chief Kevin Farr-WSJ "
    },
    {
        "content": "* Mattel Inc Looking to replace its long-serving CFO; co retained an executive-search firm to replace Chief Financial Officer Kevin Farr - WSJ  citing sources Source text - http://on.wsj.com/2tLCCfI Further company coverage:",
        "date": "07132017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel looking to replace its long-serving CFO Kevin Farr - WSJ "
    },
    {
        "content": "* Primecap Management Company reports 5.75 percent passive stake in Mattel Inc as of June 30 - sec filing Source text : http://bit.ly/2uOA8uY Further company coverage:",
        "date": "07062017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Primecap management company reports 5.75 percent passive stake in mattel inc as of june 30 - sec filing "
    },
    {
        "content": "* MATTEL  STARTAPP AND ATARI ANNOUNCE PARTNERSHIP TO DEVELOP MATTEL BRANDS IN THE GAME ROLLERCOASTER TYCOON TOUCH SOURCE TEXT FOR EIKON: FURTHER COMPANY COVERAGE: (Gdynia Newsroom:)",
        "date": "06272017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Atari  Mattel and Startapp announce partnership "
    },
    {
        "content": "* Mattel Inc - On June 15  co entered into amendment to seventh amended and restated credit agreement - SEC filing",
        "date": "06162017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel Inc on June 15 signed amendment deal "
    },
    {
        "content": "June 14 Mattel Inc expects to grow three to four times in the more than $31 billion toys and games market in China by 2020 through digitally connected toys  as it intensifies its efforts to take on LEGO Group and Hasbro Inc in the country.",
        "date": "06142017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel plays with digital toys to triple China business "
    },
    {
        "content": "* Mattel inc - election of Kreiz by board action brings total number of directors to 12 Source text for Eikon: Further company coverage:",
        "date": "06132017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel elects Ynon Kreiz to its board of directors "
    },
    {
        "content": "* AGREEMENT IS FOR THE SCRABBLE BRAND AND THE OFFICIAL DICTIONARY FOR THE GAME Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "05192017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Lexibook Linguistic Electronic System signs licensing agreement with Larousse and Mattel "
    },
    {
        "content": "Mattel Inc  reported a far bigger-than-expected quarterly loss and drop in sales on Thursday  hurt by poor demand by retailers for key brands Barbie and Fisher-Price and due to big discounts to move inventory left after weak holiday sales. | Video ",
        "date": "04212017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel cuts sales forecast after inventory overhang slams results "
    },
    {
        "content": "* Mattel Inc director Dean Scarborough reports purchase of 47 000 shares of co's common stock on April 24 at $21.95 per share - SEC filing Source text: (http://bit.ly/2pmwBEs) Further company coverage:",
        "date": "04262017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel director Scarborough reports purchase of 47 000 shares of co's common stock on April 24 "
    },
    {
        "content": "* Mattel shares drop 6 pct  Hasbro down 2 pct (Adds forecast  updates share prices)",
        "date": "04202017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "UPDATE 2-Mattel cuts sales forecast after inventory overhang slams results "
    },
    {
        "content": "April 20 Mattel Inc  the world's biggest toymaker  reported a bigger-than-expected drop in quarterly sales on Thursday  hurt by weak demand for key brands Barbie and Fisher-Price and due to big discounts to move inventory left after weak holiday sales.",
        "date": "04202017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Barbie maker Mattel reports bigger-than-expected drop in sales "
    },
    {
        "content": "March 10 Mattel Inc is doubling down to corner a bigger share of China's fragmented yet lucrative toy market  but the success of its efforts hinges on its ability to navigate strict regulation and adapt to local preferences.",
        "date": "03102017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel reworks China strategy amid elusive growth "
    },
    {
        "content": "COPENHAGEN  March 9 Growth at Denmark's Lego slowed to just six percent in 2016 from more than 25 percent the previous year  preventing it from overtaking Barbie doll maker Mattel as the world's biggest toymaker.",
        "date": "03092017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Toymaker Lego's sales growth slowed to 6 pct in 2016 "
    },
    {
        "content": "Barbie maker Mattel Inc  said it would partner with Chinese parenting website Babytree to create an online learning platform for early childhood development  the latest in the No. 1 U.S. toymaker's push into China.",
        "date": "02172017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel partners with parenting website to expand China presence "
    },
    {
        "content": "Feb 16 Barbie maker Mattel Inc said it would partner with Chinese parenting website Babytree to create an online learning platform for early childhood development  the latest in the No. 1 U.S. toymaker's push into China.",
        "date": "02162017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel partners with parenting website to expand China presence "
    },
    {
        "content": "LOS ANGELES  Feb 16 Walt Disney Co and major retailers will release the galaxy's newest \"Star Wars\" toys at a Sept. 1 midnight event ahead of the holiday debut of the next film in the saga  \"The Last Jedi \" company executives told Reuters.",
        "date": "02172017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 1-Disney plans midnight 'Star Wars' event to unveil 'Last Jedi' toys "
    },
    {
        "content": "* Mattel Inc - Co  Babytree will co-create online platform  Source text for Eikon:  Further company coverage:",
        "date": "02162017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel and Babytree form strategic partnership in China "
    },
    {
        "content": "Barbie maker Mattel Inc became the latest U.S. company to sell products on Chinese e-commerce giant Alibaba Group Holding Ltd's online marketplace Tmall to expand its reach in China.",
        "date": "02142017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel to sell toys on Alibaba's Tmall "
    },
    {
        "content": "LOS ANGELES  Feb 16 Walt Disney Co and major retailers will release the galaxy's newest \"Star Wars\" toys at a Sept. 1 midnight event ahead of the holiday debut of the next film in the saga  \"The Last Jedi \" company executives told Reuters.",
        "date": "02162017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Disney plans midnight 'Star Wars' event to unveil 'Last Jedi' toys "
    },
    {
        "content": "Feb 14 Barbie maker Mattel Inc became the latest U.S. company to sell products on Chinese e-commerce giant Alibaba Group Holding Ltd's online marketplace Tmall to expand its reach in China.",
        "date": "02142017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 1-Mattel to sell toys on Alibaba's Tmall "
    },
    {
        "content": "Feb 14 Barbie maker Mattel Inc said it entered into a partnership with Alibaba Group Holding Ltd  to sell its products through the Chinese e-commerce giant's online marketplace Tmall to expand its reach in China.",
        "date": "02142017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel to sell on Alibaba's Tmall "
    },
    {
        "content": "* Genius Brands International signs Mattel Inc.'s Fisher-Price Toys as worldwide master toy partner for new animated series  rainbow rangers  Source text for Eikon:  Further company coverage:",
        "date": "02092017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Genius Brands International signs Mattel's Fisher-Price Toys as partner for new animated series "
    },
    {
        "content": "* Mattel will be marketing and selling to China via Alibaba's B2C marketplace Tmall.com",
        "date": "02142017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel and Alibaba Group form global strategic partnership "
    },
    {
        "content": "* Shares rise 16.6 pct to record high of $96.34   (Adds CEO comment)",
        "date": "02062017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 4-Hasbro's record holiday quarter lifts shares to all-time high "
    },
    {
        "content": "* Mattel - on Jan 24  2017  board amended and restated co's amended and restated bylaws to implement proxy access - SEC filing",
        "date": "01302017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel's board amends and restates its amended and restated bylaws "
    },
    {
        "content": "* Quarterly worldwide net sales down 8% as reported  and down 6% in constant currency",
        "date": "01252017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel reports Q4 earnings per share $0.50 "
    },
    {
        "content": "Mattel Inc   the largest U.S. toymaker  reported holiday-quarter sales and profit that fell far short of analysts' estimates  hurt by increased competition and weak demand in North America.",
        "date": "01262017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel's holiday quarter sales miss to hit current quarter "
    },
    {
        "content": "* Mattel reports full year and fourth quarter 2016 financial results and declares quarterly dividend",
        "date": "01262017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel Q4 adjusted earnings $0.52 per share "
    },
    {
        "content": "Jan 25 Mattel Inc  the largest U.S. toymaker  reported holiday quarter sales and profit that fell far short of analysts' estimates  hurt by weak demand for its Barbie dolls and Fisher Price toys.",
        "date": "01262017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "CORRECTED-UPDATE 2-Barbie maker Mattel's holiday quarter sales miss estimates "
    },
    {
        "content": "Jan 25 Mattel Inc  the largest U.S. toymaker  reported lower-than-expected quarterly sales  hurt by weak demand for its girls and boys toys and its Fisher Price brands.",
        "date": "01262017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "CORRECTED-Barbie maker Mattel's holiday quarter sales miss estimates "
    },
    {
        "content": "* Mattel Inc - Effective as of February 8  2017  size of board of directors was increased from ten to eleven members-SEC filing",
        "date": "01172017",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel says size of board increased from 10 to 11 members "
    },
    {
        "content": "Mattel Inc   the largest U.S. toymaker  said on Tuesday that Google Inc's Americas president  Margaret Georgiadis  will become its chief executive  replacing Christopher Sinclair.",
        "date": "01172017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Toymaker Mattel names Google's Americas president as CEO "
    },
    {
        "content": "Jan 17 Mattel Inc  the largest U.S. toymaker  said on Tuesday that Google Inc's Americas president  Margaret Georgiadis  will become its chief executive  replacing Christopher Sinclair.",
        "date": "01172017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 1-Toymaker Mattel names Google's Americas president as CEO "
    },
    {
        "content": "Jan 17 Mattel Inc  the largest U.S. toymaker  named Margaret Georgiadis  Google Inc's Americas President  its chief executive  replacing Christopher Sinclair  who will remain chairman.",
        "date": "01172017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Toymaker Mattel names Google's Americas President CEO "
    },
    {
        "content": "* Mattel Inc - Georgiadis will succeed Christopher A. Sinclair",
        "date": "01172017",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel names Margaret Georgiadis as CEO  effective Feb. 8  2017 "
    },
    {
        "content": "* Mattel Creations and Tongal form strategic multi-year partnership to develop cross-platform content",
        "date": "10262016",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel Creations and Tongal form strategic multi-year partnership "
    },
    {
        "content": "Oct 19 Mattel Inc  the largest U.S. toymaker  reported better-than-expected quarterly revenue  driven by strong demand for its flagship Barbie and Fisher-Price brands.",
        "date": "10192016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel sales beat estimates as Barbie shines "
    },
    {
        "content": "Oct 19 Mattel Inc  the largest U.S. toymaker  reported better-than-expected quarterly revenue  driven by strong demand for its flagship Barbie and Fisher-Price brands.",
        "date": "10192016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 1-Mattel sales beat estimates as Barbie shines "
    },
    {
        "content": "* Has finalized strategic relationships with Choirock Contents Factory Co Ltd and Sonokong Co Ltd",
        "date": "10112016",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel expands presence in South Korea "
    },
    {
        "content": "* Files for potential notes offering; size not disclosed - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08022016",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "BRIEF-Mattel files for potential notes offering "
    },
    {
        "content": "July 20 Mattel Inc  the largest U.S. toymaker  reported better-than-expected quarterly sales  driven by strong demand for its flagship Barbie dolls.",
        "date": "07202016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel beats sales estimates as Barbie makes a comeback "
    },
    {
        "content": "* Shares up 5.4 pct after hours   (Adds background  executive comments)",
        "date": "07202016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 2-Mattel beats sales estimates as Barbie makes a comeback "
    },
    {
        "content": "Mattel Inc  said it won the license to make merchandise based on \"Jurassic World\" films  a day after rival Hasbro Inc  announced the termination of the contract with Comcast Corp's  NBCUniversal due to disagreement over terms.",
        "date": "07192016",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Hasbro loses license for 'Jurassic World' toys to Mattel "
    },
    {
        "content": "* Q2 loss per share $0.06  Q2 adjusted loss per share $0.02  Q2 net sales $957.3 million versus $988.2 million last year",
        "date": "07202016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel Inc Q2 loss per share $0.06 "
    },
    {
        "content": "* Mattel will design  produce and bring to market a wide variety of toys and consumer products inspired by franchise",
        "date": "07192016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel awarded Jurassic World license "
    },
    {
        "content": "Mattel Inc reported a bigger-than-expected quarterly loss due to weak sales of its toys such as Barbie  Monster High and American Girl that are aimed at young girls  and the loss of a lucrative Disney license.",
        "date": "04202016",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel struggles as Barbie sales slip again "
    },
    {
        "content": "* Shares fall 6.2 in extended trading   (Adds CEO comment  background)",
        "date": "04202016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 2-Mattel struggles as Barbie sales slip again "
    },
    {
        "content": "* Q1 earnings per share view $-0.07 -- Thomson Reuters I/B/E/S",
        "date": "04202016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel reports Q1 adjusted loss per share $0.13 "
    },
    {
        "content": "* Q1 gross margin down 410 basis points  driven mainly by negative impact from changes in currency exchange rates",
        "date": "04202016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel Q1 loss per share $0.21 "
    },
    {
        "content": "April 20 Toymaker Mattel Inc reported a smaller-than-expected drop in quarterly net sales  as strong demand for its Hot Wheels and Fisher-Price toys helped offset the loss of a lucrative Disney license.",
        "date": "04202016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Fisher-Price  Hot Wheels help Mattel beat sales estimates "
    },
    {
        "content": "U.S. toymakers Mattel Inc  and Hasbro Inc  have held talks about a possible merger  Bloomberg reported on Thursday  citing people familiar with the matter. | Video ",
        "date": "02052016",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Toymakers Mattel  Hasbro held talks on possible merger: Bloomberg "
    },
    {
        "content": "Feb 4 U.S. toymakers Mattel Inc and Hasbro Inc have held talks about a possible merger  Bloomberg reported on Thursday  citing people familiar with the matter.",
        "date": "02042016",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "UPDATE 2-Toymakers Mattel  Hasbro held talks on possible merger-Bbg "
    },
    {
        "content": "Mattel Inc  reported a surprise rise in quarterly net sales  its first increase in over two years  as sales of its Barbie dolls recovered and demand rose for its Hot Wheels toys.",
        "date": "02012016",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel surprises with sales rise as Barbie gets makeover "
    },
    {
        "content": "* Shares rise 6 pct after market   (Adds CEO comment  background; updates shares)",
        "date": "02012016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 2-Mattel surprises with sales rise as Barbie gets makeover "
    },
    {
        "content": "* Q4 earnings per share $0.63; Q4 adjusted earnings per share $0.67 including items; Q4 net sales of $2 billion versus. $1.99 billion",
        "date": "02012016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "BRIEF-Mattel reports Q4 earnings per share $0.63 "
    },
    {
        "content": "Feb 1 Mattel Inc posted a surprise increase in quarterly net sales  its first rise in more than two years  as sales of its Barbie dolls recovered and demand rose for its Hot Wheels toys.",
        "date": "02012016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Toymaker Mattel's quarterly sales rise after 2 years of fall "
    },
    {
        "content": "* Chinese factory activity contracts at fastest pace since 2012",
        "date": "02012016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "US STOCKS-Wall St lower on weak China data  fall in oil prices "
    },
    {
        "content": "COPENHAGEN  Jan 13 Dissident Chinese artist Ai Weiwei published photos of himself with Lego hanging off his moustache and beard on Wednesday  celebrating the toymaker's decision to back down on rules that blocked his bulk order of bricks.",
        "date": "01132016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 2-China's Ai Weiwei bedecks beard with Lego bricks after firm backs down "
    },
    {
        "content": "COPENHAGEN  Jan 13 Lego has dropped restrictions on bulk orders of its toy bricks after facing a storm of criticism for refusing to sell thousands of them to dissident Chinese artist Ai Weiwei.",
        "date": "01132016",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Lego changes rules to calm storm over Ai Weiwei brick order "
    },
    {
        "content": "COPENHAGEN  Oct 20 Some children may not get their Christmas wishes fulfilled this year as LEGO's factories  although running at full speed  may not be able to make enough plastic bricks to keep up with demand from toy stores in Europe.",
        "date": "10202015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "LEGO may run short of bricks before Christmas "
    },
    {
        "content": "* Shares fall as much as 8.2 pct   (Adds analysts comments  details from conference call; updates shares)",
        "date": "10192015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 2-Hasbro revenue misses as sales of games  girls' toys fall further "
    },
    {
        "content": "Mattel Inc  reported quarterly revenue and profit that missed analysts' estimates as sales of Barbie dolls fell again and a strong dollar ate into revenue from overseas markets.",
        "date": "10152015",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel sales miss estimates as Barbie slips  dollar weighs "
    },
    {
        "content": "Oct 15 Toymaker Mattel Inc's net sales fell for the eighth straight quarter  highlighting the company's challenges in boosting sales of its Barbie dolls.",
        "date": "10152015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Toymaker Mattel's sales fall for eighth straight quarter "
    },
    {
        "content": "COPENHAGEN  Sept 2 Toymaker LEGO scored two publicity victories on Wednesday  sending 20 of its plastic figures into space alongside Denmark's first astronaut and surpassing the first-half earnings of Barbie maker Mattel   a top rival for children's pocket money.",
        "date": "09022015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "LEGO goes into space as first-half sales surpass Mattel "
    },
    {
        "content": "Toymaker Mattel Inc  on Thursday posted a surprise profit in its first full quarter under new chief executive Christopher Sinclair  helped by a rise in demand for its Fisher-Price toys and lower costs.",
        "date": "07162015",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "New CEO guides Mattel to surprise quarterly profit "
    },
    {
        "content": "* Barbie sales down 11 pct   (Adds analyst comments  details)",
        "date": "07162015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 2-New CEO guides Mattel to surprise quarterly profit "
    },
    {
        "content": "July 16 Toymaker Mattel Inc's sales fell for the seventh straight quarter as international demand for its Barbie dolls failed to recover.",
        "date": "07162015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel's quarterly sales fall for seventh straight quarter "
    },
    {
        "content": "July 17 Mattel Inc's turnaround plan is off to a crawling start.",
        "date": "07172015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel takes baby steps to recovery with Fisher-Price "
    },
    {
        "content": "LOS ANGELES  April 24 Mattel Inc said on Friday it has ended production of its SeaWorld Trainer Barbie doll  a move cheered by an animal rights group that has been a leading critic of SeaWorld for its treatment of killer whales.",
        "date": "04242015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "PETA claims victory for animal rights in demise of SeaWorld Trainer Barbie "
    },
    {
        "content": "Mattel Inc's quarterly net sales topped analysts' estimates for the first time in six quarters as new Chief Executive Christopher Sinclair focuses on turning around the business in the face of flagging sales of Barbie dolls.",
        "date": "04162015",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel's sales beat estimates  shares rise "
    },
    {
        "content": "April 16 Mattel Inc's quarterly net sales topped analysts' estimates for the first time in six quarters as new Chief Executive Christopher Sinclair focuses on turning around the business in the face of flagging sales of Barbie dolls.",
        "date": "04162015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 3-Mattel's sales beat estimates  shares rise "
    },
    {
        "content": "NEW YORK  April 8 Striding confidently through Matty's Toy Stop in Manhasset  New York  Catie Tepedino  7  is the sort of consumer who may hold the fate of the U.S. toy business in her own little fists.",
        "date": "04082015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "INSIGHT-Toy business attracts private equity as kids go green and retro "
    },
    {
        "content": "April 2 Barbie doll maker Mattel Inc  appointed Christopher Sinclair its Chief Executive  two months after the former PepsiCo Inc executive was named interim CEO.",
        "date": "04022015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel appoints Christopher Sinclair as CEO "
    },
    {
        "content": "* Shares fall as much as 3.3. pct   (Adds analyst comment  details  background; updates shares)",
        "date": "04022015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 2-Mattel appoints Christopher Sinclair as CEO "
    },
    {
        "content": "* Indexes up: Dow 1.5 pct  S&P 1.3 pct  Nasdaq 0.9 pct   (Updates close with latest volume  Disney  Mattel shares up)",
        "date": "03122015",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "US STOCKS-Wall St bounces back in broad rally; bank shares gain "
    },
    {
        "content": "COPENHAGEN  Feb 25 Denmark's Lego said it expected to keep outperforming rivals after it further narrowed the gap on market leader Mattel last year  aided by strong growth in Asia  a successful movie launch and increased sales of toys targeted at girls.",
        "date": "02252015",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Lego says expects to keep outperforming toy market "
    },
    {
        "content": "Sequels to \"Star Wars\"  \"The Avengers\" and \"Jurassic Park\" movies are expected to boost Hasbro Inc's  sales this year  helping the toymaker to further narrow the lead of Mattel Inc   its bigger rival.",
        "date": "02102015",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Toymaker Hasbro to further close gap with Mattel in 2015 "
    },
    {
        "content": "Feb 9 Sequels to \"Star Wars\"  \"The Avengers\" and \"Jurassic Park\" movies are expected to boost Hasbro Inc's  sales this year  helping the toymaker further narrow the gap with Mattel Inc  its bigger but struggling rival.",
        "date": "02092015",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "UPDATE 4-Toymaker Hasbro to further close gap with Mattel in 2015 "
    },
    {
        "content": "Feb 9 Sequels to \"Star Wars\"  \"The Avengers\" and \"Jurassic Park\" movies are expected to boost Hasbro Inc's  sales this year  helping the toymaker to further narrow the lead of Mattel Inc  its bigger rival.",
        "date": "02102015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 5-Toymaker Hasbro to further close gap with Mattel in 2015 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 29 (Fitch) Continued struggles and a change at the top have  sent credit default swap (CDS) spreads for Mattel Inc. to levels not seen in  four years  according to Fitch Solutions in its latest CDS Case Study Snapshot. Five-year CDS on Mattel widened out 49% over the past month. After pricing  consistently in-line with 'BBB' levels for much of the past year  the cost of  credit protection on Mattel's debt has now moved",
        "date": "01292015",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Fitch Solutions: CEO Exit Sends Mattel's CDS to Widest Level Since 2011 "
    },
    {
        "content": "Mattel Inc  needs to move with a \"sense of urgency\" to create toys that connect with young customers  its interim CEO said  as dolls based on Disney's blockbuster film \"Frozen\" stole the show from its Barbie dolls in the holiday quarter.",
        "date": "01302015",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "Mattel CEO feels 'sense of urgency' for new toys as Barbie ages "
    },
    {
        "content": " (This January 26 story was corrected to fix spelling in paragraph 1 to \"Bryan\" from \"Brian\"))",
        "date": "01302015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel removes CEO  warns of fifth straight fall in quarterly sales "
    },
    {
        "content": "Jan 30 Mattel Inc needs to move with a \"sense of urgency\" to create toys that connect with young customers  its interim CEO said  as dolls based on Disney's blockbuster film \"Frozen\" stole the show from its Barbie dolls in the holiday quarter.",
        "date": "01302015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "UPDATE 3-Mattel CEO feels \"sense of urgency\" for new toys as Barbie ages "
    },
    {
        "content": "Jan 26 Mattel Inc removed Chief Executive Bryan Stockton after another disappointing holiday shopping season for the maker of the aging Barbie doll.",
        "date": "01302015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "CORRECTED-UPDATE 3-Mattel removes CEO  warns of 5th straight fall in quarterly sales (Jan 26) "
    },
    {
        "content": "Jan 30 Mattel Inc will evaluate its business and move with a \"heightened sense of urgency \" interim CEO Christopher Sinclair said  as the maker of Barbie dolls posted its fifth straight fall in worldwide quarterly sales.",
        "date": "01302015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "CORRECTED-UPDATE 2-Barbie doll maker Mattel to move with \"urgency\" as sales fall again "
    },
    {
        "content": "Jan 26 Mattel Inc removed Chief Executive Brian Stockton after another disappointing holiday shopping season for the maker of the aging Barbie doll.",
        "date": "01262015",
        "name": "Mattel Inc",
        "news_type": "topStory",
        "symbol": "MAT",
        "title": "UPDATE 3-Mattel removes CEO  warns of 5th straight fall in quarterly sales "
    },
    {
        "content": "Jan 30 Mattel Inc said worldwide sales of its Barbie dolls fell 12 percent in the all-important holiday quarter  while those of Fisher-Price preschool toys declined 11 percent.",
        "date": "01302015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "CORRECTED-Mattel's Barbie sales fall 12 pct in holiday quarter "
    },
    {
        "content": "Jan 26 Toymaker Mattel Inc said Bryan Stockton had resigned as chief executive and chairman.",
        "date": "01262015",
        "name": "Mattel Inc",
        "news_type": "normal",
        "symbol": "MAT",
        "title": "Mattel says Bryan Stockton resigns as CEO "
    }
]