[
    {
        "content": "MOSCOW  Nov 14 Russia's top mobile phone operator MTS  said on Tuesday its third quarter net profit was up 43 percent to 18 billion roubles ($301.4 million)  year-on-year.",
        "date": "11142017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "Russia's MTS Q3 net profit up 43 pct to 18 bln rbls  y/y "
    },
    {
        "content": "MOSCOW  Oct 23 Russia's largest telecoms operator MTS said on Monday it would purchase equipment from Sweden's Ericsson for 400 million euros  ($470.16 million) to modernise its network.",
        "date": "10232017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "RPT-Russia's MTS to purchase Ericsson equipment for 400 mln euros "
    },
    {
        "content": "* Russia's MTS announces acquisition of 50.82 pct stake in the Russian retail software developer Oblachny Retail LLC  operating under Litebox - SEC Filing",
        "date": "10032017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-MTS announces acquisition of 50.82 pct stake in Oblachny Retail LLC "
    },
    {
        "content": "* It recently acquired 2 319 050 MTS shares of Common Stock  including shares of Common Stock represented by ADSs;",
        "date": "09272017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-Russia's MTS says buys back 0.12 pct of its total share capital "
    },
    {
        "content": "MOSCOW  Sept 29 Russia's top mobile phone operator MTS said on Friday it had been forced to suspend services in the Central Asian republic of Turkmenistan after the state telecoms provider cut it off from its network.",
        "date": "09292017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "Russia's MTS cut off in Turkmenistan  suspends mobile service "
    },
    {
        "content": "* SAYS ‍LAUNCHES NEW CLOUD SERVICE FOR BIG DATA PROCESSING​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "09192017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-MTS ‍launches new cloud service for big data processing​ "
    },
    {
        "content": "MOSCOW  Sept 13 MTS  the leading telecommunications provider in Russia  says Stream Digital  LLC  the company's wholly-owned subsidiary  purchased a total 1 197 430 MTS shares of common stock  representing 0.06 percent of share capital issued by MTS.",
        "date": "09132017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-Russia's MTS says subsidiary buys 0.06 pct of its share capital "
    },
    {
        "content": "MOSCOW  Sept 5 A Russian court has turned down business conglomerate Sistema's appeal against the \"arrest\" of its shares in mobile operator MTS and Medsi chain of medical clinics  the Interfax news agency reported on Tuesday.",
        "date": "09052017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "Russian court turns down Sistema's appeal to lift 'arrest' of shares in MTS  Medsi -Ifx "
    },
    {
        "content": "Sept 6 Russian industrial conglomerate Sistema says:",
        "date": "09062017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-Russia's Sistema ‍to retain stake in MTS after share buyback​ "
    },
    {
        "content": "MOSCOW Russian conglomerate Sistema  said on Wednesday it had no plans to reduce its stake in mobile phone operator MTS  to pay oil giant Rosneft  a $2 billion settlement and would be able to raise the funds from banks.",
        "date": "08302017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "Russia's Sistema says no plans to cut stake in MTS to pay Rosneft "
    },
    {
        "content": "MOSCOW  Aug 28 Russia's biggest mobile operator MTS raised its full-year profit forecast on Monday and confirmed plans to pay 52 billion roubles ($890 million) in dividends during 2017.",
        "date": "08282017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "Russia's MTS raises profit guidance  sticks to dividend promise "
    },
    {
        "content": "* Seeking a partial lifting of asset freeze (Recasts with CEO saying no plans to sell assets  adds share price)",
        "date": "08302017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "normal",
        "symbol": "MBT",
        "title": "UPDATE 2-Russia's Sistema says no plans to cut stake in MTS to pay Rosneft "
    },
    {
        "content": "MOSCOW  Aug 30 Russian business conglomerate Sistema said on Wednesday it has no plans to sell shares in mobile operator MTS  the Interfax news agency reported.",
        "date": "08302017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "normal",
        "symbol": "MBT",
        "title": "Russia's Sistema plans no sale of MTS stake after row with Rosneft -Ifax "
    },
    {
        "content": "July 31 Russia's biggest mobile operator MTS   said on Monday:",
        "date": "07312017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-Russia's MTS recommends H1 dividend payment of 10.4 roubles/share "
    },
    {
        "content": "June 29 Russia's biggest mobile operator MTS said on Thursday:",
        "date": "06292017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-Russia's MTS could pay 20 billion roubles in H1 dividends- Ifax "
    },
    {
        "content": "* Court to resume hearing on July 12 (Releads  adds value of frozen assets  date of next court hearing)",
        "date": "06272017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "normal",
        "symbol": "MBT",
        "title": "UPDATE 2-Russian court freezes $3 bln of Sistema assets in Rosneft case "
    },
    {
        "content": "MOSCOW Russian conglomerate Sistema   said on Monday a Russian court had \"arrested\" some shares it owns  including in the country's biggest mobile operator MTS   in a legal dispute with oil company Rosneft .",
        "date": "06262017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "Sistema says court 'arrests' stake in its largest asset over Rosneft dispute "
    },
    {
        "content": "* Rosneft says value of shares equals claims (Adds details  quotes  background)",
        "date": "06262017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "normal",
        "symbol": "MBT",
        "title": "UPDATE 2-Sistema says court \"arrests\" stake in its largest asset over Rosneft dispute "
    },
    {
        "content": "MOSCOW Russian business conglomerate Sistema   said on Monday a court had \"arrested\" its stakes in a number of companies  including mobile operator MTS   as part of a legal dispute with oil major Rosneft .",
        "date": "06262017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "normal",
        "symbol": "MBT",
        "title": "Russian court 'arrests' Sistema stakes in MTS  other companies "
    },
    {
        "content": "MOSCOW  June 26 Russian business conglomerate Sistema  said on Monday a court had \"arrested\" its stakes in a number of companies  including mobile operator MTS  as part of a legal dispute with oil major Rosneft .",
        "date": "06262017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "normal",
        "symbol": "MBT",
        "title": "Russian court \"arrests\" Sistema stakes in MTS  other companies "
    },
    {
        "content": "April 12 Russia's biggest mobile phone operator Mobile TeleSystems (MTS) :",
        "date": "04122017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-Russia's MTS recommends 2016 dividend payment of 15.6 roubles/share "
    },
    {
        "content": "MOSCOW  March 21 Russia's biggest mobile phone operator Mobile TeleSystems (MTS)  said its revenue and core profit could rise or fall by 2 percent in 2017  citing uncertainty over competitive pressures and sentiment among its clients.",
        "date": "03212017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "Russia's MTS says revenue equally likely to rise or fall in 2017 "
    },
    {
        "content": "March 7 Russian business conglomerate Sistema  said:",
        "date": "03072017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-Russia's Sistema to sell 0.8 pct of MTS to MTS subsidiary "
    },
    {
        "content": "MOSCOW Russian conglomerate Sistema   plans to list shares in Steppe  its agricultural business  later this year or early in 2018  Chairman Vladimir Yevtushenkov said on Thursday.",
        "date": "01192017",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "Russia's Sistema says plans to list agricultural business "
    },
    {
        "content": "* Q3 net profit fell 12.8 percent year on year to 12.6 billion roubles ($195.87 million);",
        "date": "11172016",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "UPDATE 1-Russia's MTS says Q3 net profit falls 13 pct yr/yr "
    },
    {
        "content": "* Could repurchase around 50 mln own shares from market  parent",
        "date": "10312016",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "Russia's MTS launches up to 10 bln rouble share buyback "
    },
    {
        "content": "* Sells 1.27 percent of MTS in the form of American Depositary Shares (ADS)",
        "date": "09232016",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-Russia's Sistema sells 1.27% of MTS in form of ADS for $100.4 mln "
    },
    {
        "content": "* Announces the reduction of its authorized capital to 199.8 million roubles  which consists of 1 998 381 575 ordinary registered shares  from 206.6 million roubles  or 2 066 413 562 shares.",
        "date": "08192016",
        "name": "Mobile TeleSystems OJSC",
        "news_type": "topStory",
        "symbol": "MBT",
        "title": "BRIEF-Russia's MTS retires 68 mln treasury shares "
    }
]