[
    {
        "content": "Nov 2 Starbucks Corp trimmed its profit forecast and posted disappointing quarterly sales on Thursday  squeezed by competitors ranging from boutique coffee sellers like Intelligentsia and lower-price rivals including McDonald's.",
        "date": "11032017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-UPDATE 5-Starbucks cuts profit outlook as competitors close in "
    },
    {
        "content": "TORONTO  Nov 1 A jump in maple bond issuance this year is improving chances the instruments will be added to a key benchmark debt index  with more foreign companies expected to tap the Canadian dollar debt market as investor interest in diversifying holdings drives demand  some fund managers said.",
        "date": "11012017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Investor demand boosts Canada maple bond outlook  case for index inclusion "
    },
    {
        "content": "SHANGHAI U.S. fast food giant McDonald's Corp  is getting a name change in China - at least on paper. | Video ",
        "date": "10312017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "'Golden Arches': McDonald's gets new China name following unit sale "
    },
    {
        "content": "SHANGHAI  Oct 26 U.S. fast food giant McDonald's Corp is getting a name change in China - at least on paper.",
        "date": "10262017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "\"Golden Arches\": McDonald's gets new China name following unit sale "
    },
    {
        "content": "McDonald's Corp  reported strong restaurant sales on Tuesday  as $1 sodas and build-your-own burgers helped it draw in more customers and beat back rivals in an intense battle for market share. | Video ",
        "date": "10242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's sales strong as cheap drinks  new burgers lure back diners "
    },
    {
        "content": "Oct 24 McDonald's Corp reported strong restaurant sales on Tuesday  as $1 sodas and build-your-own burgers helped it draw in more customers and beat back rivals in an intense battle for market share.",
        "date": "10242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 5-McDonald's sales strong as cheap drinks  new burgers lure back diners "
    },
    {
        "content": "* On conf call- beginning in 2019  once we've lapped completion of major refranchising transactions  expect to return to revenue growth ‍​",
        "date": "10242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's on conf call- Beginning in 2019  expect to return to revenue growth ‍​ "
    },
    {
        "content": "Oct 24 McDonald's Corp reported strong restaurant sales on Tuesday  as $1 soda deals and build-your-own burgers helped it lure more customers for the third straight quarter and beat back rivals in an intense battle for market share.",
        "date": "10242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-UPDATE 3-McDonald's sales strong as deals  new burgers lure back diners "
    },
    {
        "content": "* McDonald's - Expects net restaurant additions to add about 1 percent point to 2017 systemwide sales growth (in constant currencies) - SEC filing‍​",
        "date": "10242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's expects net restaurant additions to add about 1 pct point to 2017 systemwide sales growth "
    },
    {
        "content": "* Q3 earnings per share view $1.77 -- Thomson Reuters I/B/E/S",
        "date": "10242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's reports Q3 earnings per share $2.32 "
    },
    {
        "content": "Oct 24 McDonald's Corp reported better-than-expected quarterly sales at established U.S. restaurants on Tuesday  as it attracted more customers with its $1 and $2 beverages and premium customizable sandwiches such as Sriracha artisan chicken.",
        "date": "10242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's quarterly U.S. comp sales beat estimates "
    },
    {
        "content": "SEOUL South Korean investigators raided the Seoul office of McDonald's Corp on Wednesday following a series of complaints that  children fell ill after eating hamburger patties alleged to have been undercooked  Yonhap News Agency and other media said.",
        "date": "10182017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's South Korea office raided in burger probe: reports "
    },
    {
        "content": " (Adds McDonald's comment in 4th paragraph)     SEOUL  Oct 18 South Korean investigators raided the Seoul office of McDonald's Corp         on Wednesday following a series of complaints that  children fell ill after eating hamburger patties alleged to have been undercooked  Yonhap News Agency and other media said.       The Seoul central district prosecutors' office confiscated some documents and evidence at the office and three other companies  including an ingredient supplier  the ",
        "date": "10182017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's S.Korea office raided in burger probe -reports "
    },
    {
        "content": "    SEOUL  Oct 18 South Korean investigators raided the Seoul office of McDonald's Corp         on Wednesday  following a series of complaints that  children fell ill after eating hamburger patties alleged to have been undercooked  Yonhap News Agency and other media said.       The Seoul central district prosecutors' office confiscated some documents and evidence at the office and three other companies  including an ingredient supplier  the reports said.     A spokeswoman at the offi",
        "date": "10182017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's S.Korea office raided in burger probe - reports "
    },
    {
        "content": "* Oil prices slip  pulling back from recent gains (Updates with U.S. afternoon trading)",
        "date": "09282017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "GLOBAL MARKETS-Dollar stalls  stocks edge up with U.S. tax plan in focus "
    },
    {
        "content": "LONDON Jill McDonald picks up something of a poisoned chalice when she starts as boss of clothing at Marks & Spencer  on Monday  with little room to maneuver as she tackles one of the biggest jobs in British retailing on her first foray into fashion.",
        "date": "09282017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald faces tough task to look good in M&S fashion "
    },
    {
        "content": "* Increases quarterly cash dividend by 7 percent to $1.01 per share",
        "date": "09212017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's raises quarterly cash dividend by 7 pct "
    },
    {
        "content": "* Westlife development clarifies on news item in relation to 18 McDonald's outlets in Delhi being reopened",
        "date": "09202017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Westlife Development says not connected to developments related to McDonald's outlets in Delhi "
    },
    {
        "content": "* Speciality Restaurants clarifies on news item regarding co being keen on a partnership with McDonalds",
        "date": "09182017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Speciality Restaurants says no negotiations taking place in relation to partnership with McDonalds "
    },
    {
        "content": "LOS ANGELES  Sept 13 Sanderson Farms Inc shareholders have filed another proposal aimed at convincing the third-largest U.S. poultry producer to stop giving medically important antibiotics to healthy chickens for disease prevention.",
        "date": "09132017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Investors renew push to get Sanderson Farms to cut antibiotic use "
    },
    {
        "content": "NEW YORK McDonald's Corp said Monday its Korea unit is cooperating with an investigation by the South Korean government into a possible food contamination case that led to the company halting sales of its bulgogi burger.",
        "date": "09042017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's cooperates with South Korea probe; halts bulgogi burger "
    },
    {
        "content": "LONDON  Sept 4 Workers at two McDonald’s restaurants staged the first strike to hit the company in Britain in a protest over pay and other issues on Monday.",
        "date": "09042017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's workers stage company's first strike in Britain "
    },
    {
        "content": "* SIGNED A MULTI-YEAR IT STRATEGIC PROVIDER AGREEMENT WITH MCDONALD’S CORPORATION",
        "date": "08282017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-CapGemini signs multi-year IT strategic provider agreement with McDonald's Corp "
    },
    {
        "content": "LOS ANGELES McDonald's Corp  on Wednesday said that it would begin curbing the use of the high value human antibiotics in its global chicken supply in 2018  as the fast-food giant joins a broad effort to battle dangerous superbugs.",
        "date": "08232017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's to cut global antibiotic use in chickens "
    },
    {
        "content": "LOS ANGELES  Aug 23 McDonald's Corp on Wednesday said that it would begin curbing the use of the high value human antibiotics in its global chicken supply in 2018  as the fast-food giant joins a broad effort to battle dangerous superbugs.",
        "date": "08232017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's to cut global antibiotic use in chickens "
    },
    {
        "content": "LOS ANGELES  Aug 23 McDonald's Corp on Wednesday said that it would begin curbing the use of important human antibiotics in its global chicken supply in 2018  as the fast-food giant joins a broad effort to battle dangerous superbugs.",
        "date": "08232017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to start cutting global antibiotic use in chickens "
    },
    {
        "content": "* Consumers Union on McDonald's plan to limit antibiotics used by its global chicken and beef suppliers",
        "date": "08232017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-Consumers Union comments on McDonald's global pledge to limit antibiotics in chicken and beef "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Herbalife Ltd - sec filing",
        "date": "08142017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Herbalife  Mcdonalds "
    },
    {
        "content": "SHANGHAI McDonald's Corp said it would almost double the number of stores in mainland China by 2022  slightly more than was expected  as part of its strategic partnership with state-backed conglomerate CITIC Ltd and Carlyle Group. | Video ",
        "date": "08092017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's bumps up estimate for stores in China by 2022 "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - McDonald's is going large in China. It will have to ensure that breakneck growth does not bring indigestion.",
        "date": "08092017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald’s boldly supersizes its China strategy "
    },
    {
        "content": "SHANGHAI  Aug 8 McDonald's Corp said it would almost double the number of stores in mainland China by 2022  slightly more than was expected  as part of its strategic partnership with state-backed conglomerate CITIC Ltd and Carlyle Group.",
        "date": "08082017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's bumps up estimate for stores in China by 2022 "
    },
    {
        "content": "SHANGHAI  Aug 8 McDonald's Corp will increase its number of stores in mainland China to 4 500 by the end of 2022  up from 2 500 currently  as part of a strategic partnership with Citic Ltd and the Carlyle Group   it said on Tuesday.",
        "date": "08082017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to open 2 000 more China stores by end-2022 "
    },
    {
        "content": "* Completion of acquiring a controlling interest in McDonald's mainland China and Hong Kong businesses",
        "date": "08042017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Citic completes acquisition of interest in McDonald's mainland China & Hong Kong businesses "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.94per share Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's sets quarterly cash dividend of $0.94 per share "
    },
    {
        "content": "Dunkin' Donuts will not match McDonald's $1 coffee specials in the United States  where fast-food restaurants are brawling for every sale amid intense competition from direct rivals   convenience stores and other food sellers.",
        "date": "07272017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Dunkin' Donuts will not sell $1 coffee in U.S. market share war "
    },
    {
        "content": "July 27 Dunkin' Donuts will not match McDonald's $1 coffee specials in the United States  where fast-food restaurants are brawling for every sale amid intense competition from direct rivals   convenience stores and other food sellers.",
        "date": "07272017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-Dunkin' Donuts will not sell $1 coffee in U.S. market share war "
    },
    {
        "content": "SHANGHAI Viral photos and news reports in the United States allegedly showing a moldy ice cream maker at a U.S. outlet of McDonald's Corp have prompted swift action from the fast-food giant thousands of miles away: in China.",
        "date": "07272017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's swift to respond in China after moldy ice cream maker pictures go viral in U.S. "
    },
    {
        "content": "SHANGHAI  July 27 Viral photos and news reports in the United States allegedly showing a mouldy ice cream maker at a U.S. outlet of McDonald's Corp have prompted swift action from the fast-food giant thousands of miles away: in China.",
        "date": "07272017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's swift to respond in China after mouldy ice cream maker pictures go viral in U.S. "
    },
    {
        "content": "* McDonald's has expanded McDelivery with UberEats to 13 countries  including 3 500 restaurants in U.S. in past three months Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's says has expanded McDelivery with UberEats to 13 countries in past three months "
    },
    {
        "content": "McDonald's Corp  on Tuesday posted its biggest jump in global sales at established restaurants in five years  helped by stronger traffic worldwide and U.S. initiatives including drink specials and custom sandwiches. | Video ",
        "date": "07252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Custom burgers  $1 drinks boost McDonald's sales; shares jump "
    },
    {
        "content": "* Indexes up: Dow 0.59 pct  S&P 0.39 pct  Nasdaq 0.07 pct (Updates to early afternoon)",
        "date": "07252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-S&P hits record on strong earnings; Alphabet drags Nasdaq "
    },
    {
        "content": "July 25 McDonald's Corp on Tuesday posted its biggest jump in global sales at established restaurants in five years  helped by stronger traffic worldwide and U.S. initiatives including drink specials and custom sandwiches.",
        "date": "07252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 4-Custom burgers  $1 drinks boost McDonald's sales; shares jump "
    },
    {
        "content": "* Dow up 0.46 pct  S&P up 0.28 pct  Nasdaq down 0.21 pct (Updates to open)",
        "date": "07252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-McDonald's  Caterpillar power S&P to record "
    },
    {
        "content": "July 25 The S&P hit a record high  while the Dow opened higher on Tuesday  helped by strong earnings from Caterpillar and McDonald's  but Google-parent Alphabet weighed on the tech-heavy Nasdaq.",
        "date": "07252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS SNAPSHOT-S&P hits record; Alphabet weighs on Nasdaq "
    },
    {
        "content": "* Says company expects net restaurant additions to add approximately 1 percentage point to 2017 systemwide sales growth‍​",
        "date": "07252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's sees 2017 capex of about $1.7 billion "
    },
    {
        "content": "* Q2 earnings per share view $1.62 -- Thomson Reuters I/B/E/S",
        "date": "07252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's reports Q2 earnings per share $1.70 "
    },
    {
        "content": "July 25 McDonald's Corp on Tuesday reported a better-than-expected increase in quarterly sales at established U.S. restaurants  helped by promotions on beverages as well as the launch of signature crafted sandwiches.",
        "date": "07252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's U.S. same-restaurant sales beat estimates "
    },
    {
        "content": "NEW YORK  July 17 The text message came as Flavia Cabral walked to a McDonald's restaurant in Manhattan for her 6 p.m. shift on a May evening. It was from her manager. Business was slow and she was not needed.",
        "date": "07172017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Not so fast: U.S. restaurant workers seek ban on surprise scheduling "
    },
    {
        "content": "LOS ANGELES/DALLAS Tracy Moore grew impatient as she waited for a Quarter Pounder recently in the parking lot of a McDonald's restaurant in central Dallas. | Video ",
        "date": "06202017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Will McDonald's customers wait for the new Quarter Pounder? "
    },
    {
        "content": "ZURICH  June 21 The International Olympic Committee will partner with Intel through 2024  the IOC said on Wednesday  bringing in the U.S. technology group after McDonald's last week ended a tie-up three years early.",
        "date": "06212017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "After McDonald's exit  IOC and Intel forge Olympic tie-up to 2024 "
    },
    {
        "content": "SAN FRANCISCO  June 21 Intel Corp said on Wednesday it would become a major sponsor of the International Olympic Committee  making the chipmaker the latest technology company to put marketing dollars behind the global sporting event.",
        "date": "06212017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-OLYMPICS-Intel signs Olympics sponsorship deal through 2024 "
    },
    {
        "content": "SAN FRANCISCO  June 21 Intel Corp said on Wednesday that it would become a major sponsor of the International Olympic Committee  making the chipmaker the latest technology company to put marketing dollars behind the global sporting event.",
        "date": "06212017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "OLYMPICS-Intel signs Olympics sponsorship deal "
    },
    {
        "content": "NEW YORK/BERLIN McDonald's Corp  ended its 41-year-old sponsorship of the Olympic Games three years early  the International Olympic Committee said on Friday  reflecting the U.S. fast-food giant's focus on its core business as well as rising Olympics sponsorship costs and declining TV ratings. | Video ",
        "date": "06172017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's ends Olympics sponsorship deal early "
    },
    {
        "content": "NEW YORK/BERLIN June 16 McDonald's Corp ended its 41-year-old sponsorship of the Olympic Games three years early  the International Olympic Committee said on Friday  reflecting the U.S. fast-food giant's focus on its core business as well as rising Olympics sponsorship costs and declining TV ratings.",
        "date": "06162017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 4-Olympics-McDonald's ends Olympics sponsorship deal early "
    },
    {
        "content": "* International Olympic Committee (IOC) and McDonald's mutually agree to end worldwide top partnership",
        "date": "06162017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-IOC and McDonald's mutually agree to end worldwide TOP partnership "
    },
    {
        "content": "BERLIN  June 16 McDonald's and the International Olympic Committee have agreed to end the company's long-standing Olympic sponsorship three years early  the IOC said on Friday.",
        "date": "06162017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Olympics-McDonald's ends Olympic sponsor deal with IOC early "
    },
    {
        "content": "* Mcdonald's-Shareholder proposal requesting board to update policy regarding use of antibiotics by meat suppliers not approved by shareholders‍​ at meeting",
        "date": "05302017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's shareholder proposal to update policy regarding use of antibiotics by meat suppliers not approved by shareholders "
    },
    {
        "content": "LOS ANGELES  May 30 Maryland has become the second U.S. state to pass a law banning the routine use of antibiotics in healthy livestock and poultry  a move aimed at battling the rise of dangerous antibiotic-resistant bacteria known as \"superbugs.\"",
        "date": "05302017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Maryland joins California in battling antibiotic overuse on farms "
    },
    {
        "content": "LOS ANGELES  May 25 Nearly three dozen consumer  environmental and public health groups on Thursday pressed privately held In-N-Out Burger to make good on its vow to set time lines for phasing out the use of beef raised with antibiotics vital to human health.",
        "date": "05252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Activists call on In-N-Out Burger to join the superbug fight "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.94per share Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's sets quarterly cash dividend "
    },
    {
        "content": "OAK BROOK  Ill.  May 24 Hundreds of fast-food workers demanding wage increases marched on Wednesday outside of the McDonald's Corp  headquarters in a Chicago suburb during the company's annual shareholder meeting.",
        "date": "05242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "'Fight for 15' targets McDonald's shareholder meeting "
    },
    {
        "content": "OAK BROOK  Ill. Hundreds of fast-food workers demanded wage increases as they marched outside McDonald's Corp  headquarters during the company's annual shareholder meeting on Wednesday.",
        "date": "05242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Hundreds protest over minimum wage at McDonald's stockholder meeting "
    },
    {
        "content": "* Soros Fund Management takes share stake of 109 800 shares in Citigroup Inc - sec filing",
        "date": "05152017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Soros Fund Management takes share stake in Citigroup  McDonalds "
    },
    {
        "content": "* Says McDonald's is now available for delivery on ubereats in Los Angeles county  Orange county and Riverside county Source text for Eikon: Further company coverage:",
        "date": "05172017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's says now available for delivery on Ubereats in Los Angeles county  among others "
    },
    {
        "content": "* Shares hit near 10-yr high at $16.12 (Adds details from conference call  updates shares)",
        "date": "05102017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 2-Value meals drive Wendy's profit  sales beat; shares soar "
    },
    {
        "content": "LONDON Marks & Spencer has hired Jill McDonald to run its clothing division  betting that the boss of bike shop Halfords can bring her focus on improving stores and customer service to fix the struggling business.",
        "date": "05032017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Halfords boss swaps bikes for bras with M&S move "
    },
    {
        "content": "LOS ANGELES The Service Employees International Union  backer of a five-year campaign to improve pay and job conditions for fast-food workers  on Tuesday asked Illinois and California officials to investigate how McDonald's Corp calculates restaurant rents  which generate about one-fourth of its revenue.",
        "date": "05022017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Service workers' union calls for investigations of McDonald's rent policies "
    },
    {
        "content": "LOS ANGELES  May 2 The Service Employees International Union  backer of a five-year campaign to improve pay and job conditions for fast-food workers  on Tuesday asked Illinois and California officials to investigate how McDonald's Corp calculates restaurant rents  which generate about one-fourth of its revenue.",
        "date": "05022017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Union calls for investigations of McDonald's rent policies "
    },
    {
        "content": "NEW YORK Global stock markets rallied for a second straight day on Tuesday  as solid U.S. earnings  speculation about U.S. tax reform and reduced chances of a U.S. government shutdown this weekend boosted investor optimism.",
        "date": "04252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Earnings  tax announcement hopes boost equities "
    },
    {
        "content": "McDonald's Corp  reported a better-than-expected rise in quarterly profit and U.S. same-restaurant sales on lower costs  all-day breakfast  $1 drinks and promotions on its popular Big Macs  signaling the company's plan to keep customers coming back to its restaurants has gained traction. | Video ",
        "date": "04252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's profit beats as turnaround gains steam  shares at record high "
    },
    {
        "content": "* Markets await Trump tax announcement on Wednesday (Adds close of European markets)",
        "date": "04252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "GLOBAL MARKETS-Earnings boost equities with U.S. tax announcement eyed "
    },
    {
        "content": "April 25 McDonald's Corp reported a better-than-expected rise in quarterly profit and U.S. same-restaurant sales on lower costs  all-day breakfast  $1 drinks and promotions on its popular Big Macs  signaling the company's plan to keep customers coming back to its restaurants has gained traction.",
        "date": "04252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 4-McDonald's profit beats as turnaround gains steam  shares at record high "
    },
    {
        "content": "TOKYO  April 26 McDonald's Corp has put on hold plans to sell shares in its Japan unit  which recently returned to profit for the first time in three years after a series of food scandals shook consumer confidence in the chain. The fast food giant has \"made the decision to not proceed with the transaction at this time \" Chief Finance Officer Kevin M. Ozan told investors on a conference call on Tuesday.",
        "date": "04262017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's drops plan to sell shares in Japan unit "
    },
    {
        "content": "* Mcdonald's - expects net restaurant additions to add approximately 1 percentage point to 2017 systemwide sales growth (in constant currencies)",
        "date": "04252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's says expects net restaurant additions to add approximately 1 pct point to 2017 systemwide sales growth "
    },
    {
        "content": "April 25 McDonald's Corp reported a better-than-expected increase in quarterly sales at established U.S. restaurants  boosted by the expansion of all-day breakfast  and Big Mac and beverage value promotions.",
        "date": "04252017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's U.S. comparable sales rise 1.7 pct "
    },
    {
        "content": "* CEO Stephen Easterbrook's 2016 total compensation was $15.4 million versus $7.9 million in 2015 - SEC filing",
        "date": "04132017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's says CEO Stephen Easterbrook's 2016 total compensation was $15.4 million "
    },
    {
        "content": "Workers for McDonald’s franchises in California will ask a federal appeals court to revive their proposed class action seeking to hold McDonald’s Corp liable for wage-and-hour violations because they believed the fast food giant was their employer.",
        "date": "04102017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's franchise workers to attempt reboot of wage class action "
    },
    {
        "content": "April 5 McDonald's Corp's U.S. unit said it appointed Morgan Flatley as U.S. chief marketing officer  Farhan Siddiqi to head U.S. Digital and Linda VanGosen as the head of U.S. Menu.",
        "date": "04052017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's U.S. appoints three to senior roles "
    },
    {
        "content": "McDonald's Corp's  Canadian unit said on Friday personal information of about 95 000 restaurant job applicants was compromised in a cyber attack on its careers website.",
        "date": "03312017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's Canada says 95 000 affected in careers website hack "
    },
    {
        "content": "March 31 McDonald's Corp's Canadian unit said on Friday personal information of about 95 000 restaurant job applicants was compromised in a cyber attack on its careers website.",
        "date": "03312017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's Canada says 95 000 affected in careers website hack "
    },
    {
        "content": "March 30 Fast food giant McDonald's Corp said on Thursday it would make its Quarter Pounder burgers with fresh beef  prepared when ordered  by mid-2018 in most of its restaurants.",
        "date": "03302017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Quarter Pounders to be made with fresh beef "
    },
    {
        "content": "March 31 McDonald's Corp said on Friday the personal information of about 95 000 restaurant job applicants was compromised after the company's Canadian careers website was the target of a cyber attack.",
        "date": "03312017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Canada says careers website hacked "
    },
    {
        "content": "March 30 Fast food chain McDonald's Corp said on Thursday it would make its popular \"Quarter Pounder\" hamburgers with fresh beef  prepared when ordered  by mid-2018 in most of its U.S. restaurants.",
        "date": "03302017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's Quarter Pounders to be made with fresh beef "
    },
    {
        "content": "* By mid-2018  it will serve fresh beef  prepared when ordered  in all quarter pounder burgers across majority of its restaurants Source text for Eikon: Further company coverage:",
        "date": "03302017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's to serve fresh beef in all Quarter Pounder burgers "
    },
    {
        "content": "* Mcdonald's - Director John Mulligan reports open market purchase of 1 600 shares of co's common stock at average price of $128.94/share on March 22  Source text: [http://bit.ly/2n0iv6Y] Further company coverage:",
        "date": "03242017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's director John Mulligan reports open market purchase of 1 600 shares of co's common stock at average price of $128.94/share on March 22 "
    },
    {
        "content": "LOS ANGELES  March 17 McDonald's Corp investors will vote soon on whether to give the franchisees who operate most of the fast-food chain's restaurants the opportunity to elect a board member  the proponent of a shareholder proposal said on Friday.",
        "date": "03172017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's shareholders to weigh giving franchisees board seat "
    },
    {
        "content": "LOS ANGELES McDonald's Corp quickly deleted a tweet sent from the company's handle slamming President Donald Trump on Thursday and said its official Twitter account had been compromised.",
        "date": "03172017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's deletes Trump tweet  says Twitter account compromised "
    },
    {
        "content": "CHICAGO McDonald's Corp has begun testing its long-awaited U.S. mobile ordering app  with the goal of avoiding the kinds of service hiccups that have haunted digital debuts by companies such as Starbucks Corp.",
        "date": "03152017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's  late to mobile ordering  seeks to avoid pitfalls "
    },
    {
        "content": "CHICAGO  March 15 McDonald's Corp has begun testing its long-awaited U.S. mobile ordering app  with the goal of avoiding the kinds of service hiccups that have haunted digital debuts by companies such as Starbucks Corp .",
        "date": "03152017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's  late to mobile ordering  seeks to avoid pitfalls "
    },
    {
        "content": "CHICAGO  March 14 McDonald's Corp this month will begin testing its long-awaited U.S. mobile ordering app with the goal of avoiding the kinds of service hiccups that have haunted digital debuts by companies such as Starbucks Corp .",
        "date": "03142017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's  late to mobile ordering  seeks to avoid pitfalls "
    },
    {
        "content": "LOS ANGELES  March 16 McDonald's Corp quickly deleted a tweet sent from the company's handle slamming U.S. President Donald Trump on Thursday and said its official Twitter account had been compromised.",
        "date": "03162017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 5-McDonald's deletes Trump tweet  says Twitter account compromised "
    },
    {
        "content": "* McDonald's tweet: \"Twitter notified us that our account was compromised. We deleted the tweet  secured our account and are now investigating this\"  Further company coverage:   (Bengaluru Newsroom)",
        "date": "03162017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's tweet says \"Twitter notified us that our account was compromised. We deleted the tweet  secured our account and are now investigating this\" "
    },
    {
        "content": "March 16 A tweet from McDonald's Corp official Twitter handle said President Donald Trump was a \"disgusting excuse of a president.\"",
        "date": "03162017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-McDonald's removes tweet criticizing Donald Trump "
    },
    {
        "content": "CHICAGO McDonald's Corp  on Wednesday announced a push to embrace apps aimed at speeding up service at drive-thrus  which account for about 70 percent of its U.S. business  as the fast-food chain looks to woo back diners.",
        "date": "03012017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's U.S. turnaround shifts to technology  speedier service "
    },
    {
        "content": "CHICAGO  March 1 McDonald's Corp on Wednesday announced a push to embrace apps aimed at speeding up service at drive-thrus  which account for about 70 percent of its U.S. business  as the fast-food chain looks to woo back diners.",
        "date": "03012017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 4-McDonald's U.S. turnaround shifts to technology  speedier service "
    },
    {
        "content": "CHICAGO  March 1 McDonald's Corp later this year will give U.S. customers the opportunity to order and pay via their cell phones as it fights to win back customers lost to other fast-food rivals.",
        "date": "03012017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's turns to technology  value to win back lost customers "
    },
    {
        "content": "* Mcdonald's - expects capital expenditures for 2017 to be approximately $1.7 billion  about one-third of which will be used to open new restaurants",
        "date": "03012017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's expects capital expenditures for 2017 to be about $1.7 bln "
    },
    {
        "content": "* Ardcastle restaurants has received intimation from Mcdonald’s Corp that royalty payable  continues at 4 pct until March 31  2018  Source text: (http://bit.ly/2lco5TC) Further company coverage:",
        "date": "02232017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Westlife Development says unit receives intimation from Mcdonald’s Corp about royalty payment "
    },
    {
        "content": "HONG KONG  Feb 20 The Hong Kong Confederation of Trade Unions (HKCTU) warned that McDonald's Corp's up-to-$2.1 billion sale of its Hong Kong and China operations could hit workers' pay  adding to growing criticism of the deal on the mainland and elsewhere.",
        "date": "02202017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Hong Kong union joins critics of McDonald's HK  China sale  sees pay squeeze "
    },
    {
        "content": "HONG KONG  Feb 20 The Hong Kong Confederation of Trade Unions (HKCTU) warned that McDonald's Corp's up-to-$2.1 billion sale of its Hong Kong and China operations could hit workers' pay  adding to growing criticism of the deal on the mainland and elsewhere.",
        "date": "02202017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-Hong Kong union joins critics of McDonald's HK  China sale  sees pay squeeze "
    },
    {
        "content": "HONG KONG A Chinese consultancy that has previously helped to win antitrust battles against Coca-Cola and Apple has taken aim at McDonald's Corp  arguing in a complaint to regulators that the American fast food giant's China sale may hurt workers and consumers.",
        "date": "02162017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Chinese firm files complaints with Chinese government over McDonald's China sale "
    },
    {
        "content": "* McDonald's says it has filed deal for MOFCOM review   (Adding pix)",
        "date": "02162017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-Chinese firm files complaints with Chinese government over McDonald's China sale "
    },
    {
        "content": "HONG KONG  Feb 16 A Chinese consultancy that has previously helped to win antitrust battles against Coca-Cola  and Apple has taken aim at McDonald's Corp   arguing in a complaint to regulators that the American fast food giant's China sale may hurt workers and consumers.",
        "date": "02162017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Consultancy files complaints with Chinese government over McDonald's China sale "
    },
    {
        "content": "MOSCOW  Jan 31 McDonald's plans to open more than 50 restaurants in Russia this year and hopes to sign more franchising deals to expand in existing and new regions  the local unit's chief executive said on Tuesday.",
        "date": "01312017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to open at least 50 new restaurants in Russia in 2017 "
    },
    {
        "content": "BOSTON  Feb 2 McDonald's Corp Chief Executive Steve Easterbrook said on Thursday that President Donald Trump's pick to head the U.S. Labor Department has a good understanding of entry-level jobs and how big changes in labor costs can affect small businesses.",
        "date": "02022017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's CEO sounds positive note on Trump's Labor nominee "
    },
    {
        "content": "A federal judge has given preliminary approval to a $3.75 million settlement between McDonald's Corp and about 800 employees of a California franchisee who said the company was jointly liable for wage-and-hour violations.",
        "date": "01302017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Judge signs off on $3.75 mln deal for McDonald's franchise workers "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.94 per share  Source text for Eikon:  Further company coverage:",
        "date": "01262017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's announces quarterly cash dividend "
    },
    {
        "content": "Jan 27 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "01272017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "McDonald's Corp's  sales at established U.S. restaurants fell for the first time in six quarters as the novelty of all-day breakfast failed to overcome competition from supermarkets and other food sellers.",
        "date": "01232017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's U.S. restaurant sales fall after five quarters of gains "
    },
    {
        "content": "Jan 27 The world's largest fast-food retailer McDonald's Corp said it would sell its Nordic restaurants to British equity firm Terra Firma Capital Partners Ltd's founder and chairman Guy Hands as part of a turnaround plan it had previously announced.",
        "date": "01272017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to sell Nordic restaurants to Terra Firma founder "
    },
    {
        "content": "Jan 23 McDonald's Corp's sales at established U.S. restaurants fell for the first time in six quarters as the novelty of all-day breakfast failed to overcome competition from supermarkets and other food sellers.",
        "date": "01232017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 4-McDonald's U.S. restaurant sales fall after five quarters of gains "
    },
    {
        "content": "Jan 23 McDonald's Corp's sales at established U.S. restaurants fell for the first time in six quarters as the novelty of all-day breakfast failed to overcome competition from supermarkets and other retailers.",
        "date": "01232017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-UPDATE 3-McDonald's U.S. sales drop for first time in six quarters "
    },
    {
        "content": "Jan 23 McDonald's Corp's U.S. comparable restaurant sales fell less than analysts had expected in the fourth quarter as strong demand for its all-day breakfast brought more people to its restaurants.",
        "date": "01232017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-UPDATE 1-McDonald's Q4 U.S. comparable sales fall less than expected "
    },
    {
        "content": "* McDonald's sells its Nordic restaurants to Guy Hands  chairman of Terra Firma - NYT  Source text - http://nyti.ms/2jwugnj Further company coverage:",
        "date": "01272017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's sells its Nordic restaurants to chairman of Terra Firma - NYT "
    },
    {
        "content": "Jan 23 McDonald's Corp's U.S. comparable restaurant sales fell less than analysts had expected in the fourth quarter as strong demand for its all-day breakfast brought more people to its restaurants.",
        "date": "01232017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Q4 U.S. comparable store sales fall less than expected "
    },
    {
        "content": "McDonald's Corp  is inviting bids for the sale of a 33 percent stake in its Japan unit McDonald's Holdings Co Japan Ltd   the Wall Street Journal reported  citing people familiar with the situation. | Video ",
        "date": "01122017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's inviting bids for part of Japan unit: WSJ "
    },
    {
        "content": "Jan 12 McDonald's Corp is inviting bids for the sale of a 33 percent stake in its Japan unit McDonald's Holdings Co Japan Ltd  the Wall Street Journal reported  citing people familiar with the situation.",
        "date": "01122017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's inviting bids for part of Japan unit - WSJ "
    },
    {
        "content": "Jan 12 McDonald's Corp is inviting bids for a significant stake in its Japan unit McDonald's Holdings Co Japan Ltd  the Wall Street Journal reported  citing people familiar with the situation.",
        "date": "01122017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's inviting bids for 33 pct stake in Japan unit - WSJ "
    },
    {
        "content": "Jan 9 Citic Ltd and Carlyle Group LP  would buy a majority interest in McDonald's Corp's  mainland China and Hong Kong businesses for $2.08 billion  the companies said.",
        "date": "01092017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "CORRECTED-Citic  Carlyle to buy stake in McDonald's China  HK businesses for $2.08 bln "
    },
    {
        "content": " ",
        "date": "01092017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's sells China stake to Citic  Carlyle Group for about $2 bln "
    },
    {
        "content": "* deal for at a total consideration of up to us$2.080 billion",
        "date": "01092017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-Citic updates on acquisition of controlling interest in McDonald's Mainland China and HK businesses "
    },
    {
        "content": "VATICAN CITY McDonald's has opened a franchise just steps away from the gleaming white marble dome of St. Peter's Basilica  giving indigestion to some cardinals and local business owners.",
        "date": "01042017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's opens near Vatican  upsetting some purists "
    },
    {
        "content": "A federal judge has declined to certify a wage-and-hour class of more than 1 200 current and former McDonald's franchise workers in California  saying they could not prove on a classwide basis that they believed McDonald's Corp was their employer.",
        "date": "01062017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Judge denies class cert to McDonald's franchise workers "
    },
    {
        "content": "VATICAN CITY McDonald's has opened a franchise just steps away from the gleaming white marble dome of St. Peter's Basilica  giving indigestion to some cardinals and local business owners.",
        "date": "01032017",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's opens near Vatican  upsetting some purists "
    },
    {
        "content": " (Story corrects paragraph 10 to replace U.S. drugmaker Allegion with U.S. lock maker Allegion)",
        "date": "12092016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's to move international tax base to UK amid EU scrutiny "
    },
    {
        "content": "HONG KONG China will still be on the menu for McDonald's. The $100 billion U.S. burger giant is poised to sell its outlets in mainland China and Hong Kong for up to $2 billion. Seeing this as a simple retreat from the Middle Kingdom is tempting  but wrong. As elsewhere  franchising is a better business than owning and operating stores. There are other benefits to having a Chinese partner too.",
        "date": "12082016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "China is still firmly on the menu for McDonald's "
    },
    {
        "content": "HONG KONG McDonald's Corp  is looking to raise $1 billion to $2 billion with the sale of its China and Hong Kong stores after the U.S. fast-food chain decided to keep \"a significant minority stake in the business \" a person with direct knowledge of the plans said on Tuesday.",
        "date": "12062016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Exclusive: McDonald's to keep up to 25 percent stake in China  HK stores - source "
    },
    {
        "content": "SAO PAULO Brazilian labor authorities on Friday called local McDonald's Corp  representatives to a hearing on Dec. 13 over alleged violations of the country's labor laws  and said they  could impose fines of up to 103 million reais ($30 million).",
        "date": "12022016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Brazil court calls McDonald's to hearing for alleged labor violations "
    },
    {
        "content": "A consortium led by private-equity firm Carlyle Group  and Chinese conglomerate Citic Group Corp has neared a deal to buy McDonald's Corp's  stores in China and Hong Kong for up to $3 billion  a source with direct knowledge of the matter said. | Video ",
        "date": "12022016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Citic-Carlyle near deal to buy McDonald's China assets: source "
    },
    {
        "content": "KUALA LUMPUR (Thomson Reuters Foundation) - Fast food giant McDonald's said it has dropped a labor supply agency in Malaysia after claims emerged that it was underpaying its migrant workers and housing them in appalling conditions.",
        "date": "12012016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's drops supplier in Malaysia over worker exploitation claims "
    },
    {
        "content": "The man behind one of the most recognizable fast-food sandwiches  McDonald's Big Mac  died this week at age 98.",
        "date": "12012016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Big Mac creator dies at 98 "
    },
    {
        "content": "McDonald's Corp has asked a federal judge to throw out a proposed class action filed by workers at a California franchise  arguing that it cannot be held liable for state law violations just because workers believed the company rather than the local franchisee was their employer.",
        "date": "11222016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's fights a second class action brought by franchise workers "
    },
    {
        "content": "NEW YORK/LOS ANGELESMcDonald's  aiming to become more modern and nimble  is updating U.S. restaurants with self-service kiosk ordering  mobile payments  \"smart\" menu boards  custom sandwiches and table service  executives said on Thursday.",
        "date": "11172016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's USA in tech push plans self-serve kiosks  mobile ordering "
    },
    {
        "content": "Nov 17 A McDonald's Corp shareholder is redoubling efforts to convince the fast-food chain to stop all of its global restaurants from serving the meat of animals raised with antibiotics that are vital for fighting human infections.",
        "date": "11172016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's investor renews push for antibiotic reduction in all meat "
    },
    {
        "content": "Nov 17 A McDonald's Corp shareholder is redoubling efforts to convince the fast-food chain to stop all of its global restaurants from serving the meat of animals raised with antibiotics that are vital for fighting human infections.",
        "date": "11172016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's investor renews push for antibiotic reduction in all meat "
    },
    {
        "content": "NEW YORK/LOS ANGELES  Nov 17McDonald's Corp  will debut mobile ordering in the United States and 10 major markets in 2017  as part of the fast-food chain's effort to win back customers by becoming a \"modern  progressive burger company \" executives said on Thursday.",
        "date": "11172016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to debut mobile ordering in U.S. in 2017 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 07 (Fitch) Fitch Ratings has downgraded the Long-Term Issuer  Default Rating (IDR) of McDonald's Corporation (NYSE: MCD) to 'BBB' from 'BBB+'.  The Short-Term IDR has been affirmed at 'F2'. The Rating Outlook is Stable.  McDonald's has approximately $26 billion of total debt.  The downgrade reflects Fitch's expectation that total adjusted debt/EBITDAR will  be sustained in the mid-to-high 3.0x range through 2018  with ",
        "date": "11072016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Fitch Downgrades McDonald's IDR to 'BBB'; Outlook Stable "
    },
    {
        "content": "Oct 31 McDonald's Corp has agreed to pay $3.75 million to settle a lawsuit claiming it was liable for labor law violations by a California franchisee  marking what lawyers said was the first time the company has settled legal claims by a group of U.S. workers at one of its franchises.",
        "date": "10312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to pay $3.75 mln in 1st settlement with franchise workers "
    },
    {
        "content": "McDonald's Corp has agreed to pay $3.75 million to settle a lawsuit claiming it was liable for labor law violations by a California franchisee  marking what lawyers said was the first time the company has settled legal claims by a group of U.S. workers at one of its franchises.",
        "date": "10312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to pay $3.75 million in first settlement with franchise workers "
    },
    {
        "content": "HONG KONG Carlyle Group LP  and Bain Capital LLC are the only major global buyout firms left bidding for McDonald's Corp's  restaurants in China and Hong Kong after TPG Capital Management LP [TPG.UL] pulled out  people close to the matter said on Thursday.",
        "date": "10272016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Carlyle  Bain to battle for McDonald's China assets as TPG pulls out "
    },
    {
        "content": "SEOUL KG Chemical Corporation  said in a regulatory filing on Tuesday that its parent group has ended talks to acquire McDonald's Corp's  South Korean business due to what it called \"a large difference of opinion.\"",
        "date": "10242016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "KG Group drops bid for McDonald's South Korea business "
    },
    {
        "content": "Oct 24 Restaurant Brands International Inc    owner of Burger King and Tim Hortons  reported a second straight quarter of decline in comparable sales at Burger King in the United States and Canada.",
        "date": "10242016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-UPDATE 2-Slowing sales at Burger King push parent's shares down "
    },
    {
        "content": "Restaurant Brands International Inc  owner of Burger King and Tim Hortons  reported a second straight quarter of decline in comparable sales at Burger King in the United States and Canada.",
        "date": "10242016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Slowing sales at Burger King push parent's shares down "
    },
    {
        "content": "McDonald's Corp's  turnaround remained on track in the latest quarter despite intense competition in the United States  helped by all-day breakfast  \"McPick\" value promotions and chicken McNuggets with simpler ingredients  the company said on Friday.",
        "date": "10212016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's U.S. sales revive amid stiff competition "
    },
    {
        "content": "Oct 21 McDonald's Corp's turnaround remained on track in the latest quarter despite intense competition in the United States  helped by all-day breakfast  \"McPick\" value promotions and chicken McNuggets with simpler ingredients  the company said on Friday.",
        "date": "10212016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 3-McDonald's U.S. sales revive amid stiff competition "
    },
    {
        "content": "* Expects net restaurant additions to add approximately 1 percentage point to 2016 systemwide sales growth (in constant currencies)",
        "date": "10212016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's expects net restaurant additions to add about 1 pct point to FY systemwide sales growth on constant currency basis "
    },
    {
        "content": "* Q3 earnings per share view $1.48 -- Thomson Reuters I/B/E/S",
        "date": "10212016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's Q3 earnings per share $1.50 "
    },
    {
        "content": "Oct 21 McDonald's Corp's turnaround gained momentum in the latest quarter as sales at established restaurants beat analysts' estimates  sending the company's shares up 3.6 percent in premarket trading on Friday.",
        "date": "10212016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's global same-restaurant sales beat estimates "
    },
    {
        "content": "LOS ANGELES  Oct 17 Two of America's biggest commercial brands - discount retailer Target and fast-food chain McDonald's - have taken steps to tamp down hysteria stemming from a recent spate of creepy clown sightings in the run-up to Halloween at the end of this month.",
        "date": "10172016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Target  McDonald's react to U.S. creepy clown sightings "
    },
    {
        "content": "* Mcdonald's Corp - Going forward  company expects to incur additional strategic charges in connection with ongoing initiatives",
        "date": "10132016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's expects to incur $130 mln pretax charge in Q3 "
    },
    {
        "content": "A union-backed group said it had filed complaints on behalf of 15 U.S. McDonald's workers who say they were sexually harassed on the job  in the latest challenge to how the fast-food company and its franchisees treat employees.",
        "date": "10052016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's  franchisees hit with sexual harassment complaints "
    },
    {
        "content": "HONG KONG/SINGAPORE McDonald's Corp  is set to agree a deal to sell 20-year franchise rights for its Singapore and Malaysia outlets to Saudi Arabia's Reza group for up to $400 million  as part of a re-jig of its Asian business  people familiar with the matter said.",
        "date": "10062016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Exclusive: McDonald's nears deal to sell Singapore  Malaysian franchise to Saudi group - sources "
    },
    {
        "content": "* Declared a quarterly cash dividend of $0.94 per share of common stock payable on December 15  2016",
        "date": "09292016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's raises quarterly cash dividend by 6% "
    },
    {
        "content": "SEOUL South Korea conglomerate KG Group said its consortium with NHN Entertainment Corp  was not chosen as the preferred bidder to buy McDonald's Corp  South Korean business  a South Korean online publication said on Monday  citing KG Group.",
        "date": "09262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "KG Group not preferred bidder to buy McDonald's South Korea unit: Money Today "
    },
    {
        "content": "SEOUL  Sept 26 South Korea conglomerate KG Group said its consortium with NHN Entertainment Corp was not chosen as the preferred bidder to buy McDonald's Corp  South Korean business  a South Korean online publication said on Monday  citing KG Group.",
        "date": "09262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "S.Korea KG Group says not chosen to buy McDonald's S.Korea unit -Money Today "
    },
    {
        "content": "Sept 22 Dunkin' Brands Group Inc on Thursday said it hired David Hoffmann  the McDonald's Corp  executive in charge of high-growth markets  including China and Russia  to lead its U.S. and Canadian business.",
        "date": "09222016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Dunkin' Brands hires McDonald's international executive "
    },
    {
        "content": "JOHANNESBURG  Sept 20 The Shanduka Group  founded by South African Deputy President Cyril Ramaphosa  has sold the local operations of McDonald's Corp. to a Middle Eastern company for an undisclosed amount  authorities said on Tuesday.",
        "date": "09202016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "South African McDonald's Corp franchise sold to Middle Eastern company "
    },
    {
        "content": "SEOUL  Sept 20 South Korean food-to-entertainment conglomerate CJ Group on Tuesday said it did not enter the latest round of bidding for McDonald's Corp's South Korean operations.",
        "date": "09202016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CJ Group pulls out of race for McDonald's S.Korea operations "
    },
    {
        "content": "HONG KONG  Sept 15 Fast-food giant McDonald's Corp has received final offers from at least three bidding groups for its China and Hong Kong outlets  with global private equity firms Carlyle Group and TPG Capital teaming up with Chinese partners for the business worth up to $3 billion  sources told Reuters.",
        "date": "09152016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's gets final bids for N.Asia stores -sources "
    },
    {
        "content": "Sept 15 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "09152016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "HONG KONG Private equity firms Carlyle Group  and TPG Capital have teamed up with two separate Chinese state companies to bid for McDonald's  outlets in China and Hong Kong in a deal worth between $2 billion and $3 billion  four people familiar with the matter said.",
        "date": "09022016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Carlyle  TPG form separate teams to bid for McDonald's North Asia stores: sources "
    },
    {
        "content": "LOS ANGELES McDonald's Corp  on Wednesday said Michael Andres will retire as president of McDonald's USA at the end of the year as the fast-food chain fights to maintain the momentum of its turnaround plan amid intense competition from industry rivals and low grocery prices.",
        "date": "08312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's names new head of U.S. unit "
    },
    {
        "content": "HONG KONG  Sept 2 Private equity firms Carlyle Group and TPG Capital have teamed up with two separate Chinese state companies to bid for McDonald's outlets in China and Hong Kong in a deal worth between $2 billion and $3 billion  four people familiar with the matter said.",
        "date": "09022016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-Carlyle  TPG form separate teams to bid for McDonald's N.Asia stores -sources "
    },
    {
        "content": "SEOUL  Sept 2 South Korea's Maeil Dairy Industry Co Ltd is considering whether to bid for McDonald's Corp's South Korean operations  a Maeil spokesman said on Friday.",
        "date": "09022016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "S.Korea Maeil Dairy says it's considering whether to bid for McDonald's S.Korean operations "
    },
    {
        "content": "LOS ANGELES  Aug 31 McDonald's Corp on Wednesday said Michael Andres will retire as president of McDonald's USA at the end of the year as the fast-food chain fights to maintain the momentum of its turnaround plan amid intense competition from industry rivals and low grocery prices.",
        "date": "08312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's names new head of U.S. unit "
    },
    {
        "content": "LOS ANGELES  Aug 31 McDonald's Corp on Wednesday said Michael Andres will retire as president of McDonald's USA at the end of the year as the fast-food chain works to boost domestic sales  which have been under pressure from low prices at grocery stores.",
        "date": "08312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's names new U.S. president "
    },
    {
        "content": "* McDonald's USA president Mike Andres to retire at end of 2016; Chris Kempczinski named new USA president",
        "date": "08312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's to appoint Chris Kempczinski as new USA president "
    },
    {
        "content": "* Washington warns $14.5 billion Irish bill may hurt relations",
        "date": "08302016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "U.S. slams EU  but Apple tax demand first issued in Washington "
    },
    {
        "content": "* Washington warns $14.5 billion Irish bill may hurt relations",
        "date": "08312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "RPT-U.S. slams EU  but Apple tax demand first issued in Washington "
    },
    {
        "content": "BRUSSELS/DUBLIN The European Commission ordered Apple Inc to pay Ireland unpaid taxes of up to 13 billion euros ($14.5 billion) on Tuesday as it ruled the firm had received illegal state aid. | Video ",
        "date": "08312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "EU hits Apple with $14.5 billion Irish tax demand "
    },
    {
        "content": "* GRAPHIC - Apple's tax structure http://tmsnrt.rs/2bxS7Sd   (Adds Apple warning of issue and establishing escrow account)",
        "date": "08312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 7-EU hits Apple with 13 billion euro Irish tax demand "
    },
    {
        "content": "LOS ANGELES  Aug 11 A charity looking to fight the rise of dangerous  drug-resistant bacteria on Thursday asked the public to help convince McDonald's restaurants around the world to stop serving meat and milk from animals raised with routine use of medically important antibiotics.",
        "date": "08112016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Email campaign asks McDonald's to take U.S. antibiotic curbs global "
    },
    {
        "content": "LOS ANGELES A charity looking to fight the rise of dangerous  drug-resistant bacteria on Thursday asked the public to help convince McDonald's restaurants around the world to stop serving meat and milk from animals raised with routine use of medically important antibiotics.",
        "date": "08122016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Email campaign asks McDonald's to take U.S. antibiotic curbs global "
    },
    {
        "content": "A wage-and-hour class action against McDonald's Corp that seeks to hold the fast food giant liable for alleged wage law violations at five California franchises is headed for a possible trial at the end of the year.",
        "date": "08102016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's wage-and-hour class action set for December trial "
    },
    {
        "content": "LOS ANGELES Wendy's Co  the fifth-largest U.S. fast-food chain by revenue  will quit using chickens raised with antibiotics important to human health by 2017  the company told Reuters on Thursday.",
        "date": "08042016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Exclusive : Wendy's to ban chickens with human antibiotics by 2017 "
    },
    {
        "content": "* Retirement of chief administrative officer Pete Bensen on September 2  2016",
        "date": "08022016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's Chief Administrative Officer Pete Bensen to retire "
    },
    {
        "content": "OAK BROOK  Ill.  Aug 1 McDonald's Corp  will replace corn syrup in hamburger buns with sugar this month and has removed antibiotics that are important to human medicine from its chicken months ahead of schedule  it said on Monday  moves that are part of its drive to target increasingly health-conscious consumers.",
        "date": "08012016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's to remove corn syrup from buns  curbs antibiotics in chicken "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.89per share  Source text for Eikon:  Further company coverage:",
        "date": "07282016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's announces quarterly cash dividend "
    },
    {
        "content": "McDonald's Corp  said the U.S. restaurant industry will raise prices far more than supermarkets this year  sending a chill through a sector that is searching for ways to protect itself from higher worker wages. | Video ",
        "date": "07262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's  U.S. restaurants losing food fight with grocers "
    },
    {
        "content": "July 26 McDonald's Corp said the U.S. restaurant industry will raise prices far more than supermarkets this year  sending a chill through a sector that is searching for ways to protect itself from higher worker wages.",
        "date": "07262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 6-McDonald's  U.S. restaurants losing food fight with grocers "
    },
    {
        "content": "July 26 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "07262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "HONG KONG/SINGAPORE  July 26 McDonald's Corp  said it is seeking franchise partners for its restaurants in Malaysia and Singapore as part of its move to away from direct ownership and operation in Asia.",
        "date": "07262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's seeks franchise partners for Singapore  Malaysia stores "
    },
    {
        "content": "* Indexes down: Dow 0.42 pct  S&P 0.24 pct  Nasdaq 0.1 pct   (Adds details  comments  updates prices)",
        "date": "07262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Weak earnings weigh on Wall Street; Fed awaited "
    },
    {
        "content": "* McDonald's corp sees net restaurant additions to add approximately 1 percentage point to 2016 systemwide sales growth (in constant currencies)",
        "date": "07262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's sees net restaurant additions to add 1 pct to 2016 systemwide sales growth "
    },
    {
        "content": "July 26 McDonald's Corp reported a 3.6 percent fall in quarterly revenue as fewer customers visited its restaurants  mainly in the United States.",
        "date": "07262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's quarterly revenue falls 3.6 pct "
    },
    {
        "content": "SEOUL  July 26 South Korea's NHN Entertainment Corp said on Tuesday it was in talks with KG Group  parent of electronic payment service provider KG Chemical Corp   about potentially acquiring the South Korean unit of McDonald's Corp.",
        "date": "07262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "S.Korea's NHN Entertainment in talks over potential purchase of McDonald's unit "
    },
    {
        "content": "* McDonald's planning sale of 20-year franchise rights in Malaysia  Singapore that could collectively fetch at least $400 mln - Bloomberg  citing sources",
        "date": "07262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's planning sale of franchise rights in Malaysia Singapore-Bloomberg  citing sources "
    },
    {
        "content": "A federal judge has certified a class of at least 400 workers at five McDonald's franchises in California who say the fast food giant is liable for wage-and-hour violations by the Bay Area company that owns the restaurants.",
        "date": "07112016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Judge certifies class of McDonald's franchise workers in wage-and-hour lawsuit "
    },
    {
        "content": "* Company expects to incur additional strategic charges in connection with these ongoing initiatives",
        "date": "07072016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's plans to refranchise 4 000 restaurants by end of 2018 "
    },
    {
        "content": "July 5 The U.S. Equal Employment Opportunity Commission said on Tuesday it has filed a lawsuit accusing the operators of a McDonald's restaurant in Bentonville  Arkansas  of firing a worker because he was HIV-positive.",
        "date": "07052016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "U.S. lawsuit: A McDonald's worker was fired for being HIV-positive "
    },
    {
        "content": "STRASBOURG  July 5 - McDonald's won a trademark dispute with a Singapore rival on Tuesday as Europe's second highest court backed its claim to have exclusive rights to the use of 'Mc' or 'Mac' in trademark names for foodstuffs and beverages.",
        "date": "07052016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's wins EU 'MacCoffee' trademark dispute "
    },
    {
        "content": "SEOUL South Korea's CJ Group  a food-to-entertainment conglomerate  said on Wednesday it has submitted a letter of intent to buy McDonald's Corp's  South Korean unit  adding that details have not been decided.",
        "date": "06292016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "CJ Group says submitted letter of intent to buy McDonald's South Korean unit "
    },
    {
        "content": "SEOUL  June 29 South Korea's CJ Group  a food-to-entertainment conglomerate  said on Wednesday it has submitted a letter of intent to buy McDonald's Corp's  South Korean unit  adding that details have not been decided.",
        "date": "06292016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-CJ Group says submitted letter of intent to buy McDonald's S.Korean unit "
    },
    {
        "content": "SEOUL  June 29 South Korea's CJ Group  a food-to-entertainment conglomerate  said on Wednesday it has submitted a letter of intent to buy McDonald's Corp's  South Korean unit  adding that details have not been decided.",
        "date": "06292016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CJ Group says submitted letter of intent to buy McDonald's S.Korean unit "
    },
    {
        "content": "HONG KONG  June 23 China's Sanpower Group said it has submitted a joint bid with Beijing Tourism Group for McDonald's Hong Kong and China businesses  confirming information provided by people familiar with the matter a day earlier.",
        "date": "06232016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "China's Sanpower confirms joint bid for McDonald's HK  China assets "
    },
    {
        "content": "LOS ANGELES  June 20 The union backing a high-profile campaign to raise pay and improve working conditions for low-wage U.S. workers on Monday warned potential buyers of roughly 3 000 McDonald's Corp restaurants in Asia that such deals could saddle them with operational risks  including significant costs and liabilities.",
        "date": "06202016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "U.S. union takes aim at potential McDonald's deals in Asia "
    },
    {
        "content": "McDonald's Corp  working to remake itself as a \"modern  progressive burger company \" will move its corporate headquarters from an Illinois suburb to the former home of Oprah Winfrey's Harpo Studios in downtown Chicago by the spring of 2018.",
        "date": "06132016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's moving headquarters to Chicago "
    },
    {
        "content": "June 13 McDonald's Corp  working to remake itself as a \"modern  progressive burger company \" will move its corporate headquarters from an Illinois suburb to the former home of Oprah Winfrey's Harpo Studios in downtown Chicago by the spring of 2018.",
        "date": "06132016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's moving headquarters to Chicago "
    },
    {
        "content": "June 13 McDonald's Corp will move its corporate headquarters to the former campus of Oprah Winfrey's Harpo Studios in downtown Chicago by the spring of 2018.",
        "date": "06132016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to shift headquarters to downtown Chicago "
    },
    {
        "content": "* Mcdonald's Corp says move of its corporate headquarters to downtown Chicago by spring of 2018",
        "date": "06132016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's Corp says move of its corporate headquarters to downtown Chicago by spring of 2018 "
    },
    {
        "content": "* Says Enrique Hernandez  Jr. has been elected non-executive chairman ; succeeds Andrew J. Mckenna- SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06012016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's says Enrique Hernandez Jr. elected non-executive chairman - SEC filing "
    },
    {
        "content": "June 1 McDonald's Corp is nearing a deal to shift its headquarters to the former Harpo Studios campus in Chicago from Oak Brook  Illinois  Crain's Chicago Business reported.",
        "date": "06022016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's nears deal to shift headquarters to Chicago - report "
    },
    {
        "content": "McDonald's Corp  is nearing a deal to shift its headquarters to the former Harpo Studios campus in Chicago from Oak Brook  Illinois  Crain's Chicago Business reported.",
        "date": "06022016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's nears deal to shift headquarters to Chicago: report "
    },
    {
        "content": "June 1 McDonald's Corp is nearing a deal to shift its headquarters to the former Harpo Studios campus in Chicago from Oak Brook  Illinois  Crain's Chicago Business reported.",
        "date": "06022016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's nears deal to shift headquarters to Chicago - report "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.89per share    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's sets quarterly cash dividend of $0.89 per share "
    },
    {
        "content": "OAK BROOK  Ill./LOS ANGELES U.S. restaurant operators would probably not replace workers with robots if they had to pay the $15 hourly wage demanded by protesters  McDonald's Corp Chief Executive Officer Steve Easterbrook told shareholders at the company's annual meeting on Thursday.",
        "date": "05262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's CEO says $15 hourly wage  robots won't kill jobs "
    },
    {
        "content": "* McDonald's Board of Directors names Enrique Hernandez  Jr. Non-Executive Chairman",
        "date": "05262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's Board of Directors names Enrique Hernandez  Jr. Non-Executive Chairman "
    },
    {
        "content": "CHICAGO/LOS ANGELES McDonald's Corp said on Wednesday it temporarily closed its suburban Chicago headquarters for a third year in a row as fast-food workers plan to protest at the company's annual shareholders meeting with calls for wages of at least $15 an hour and union rights.",
        "date": "05252016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's closes headquarters due to expected worker protests "
    },
    {
        "content": "OAK BROOK  Ill./LOS ANGELES  May 26 U.S. restaurant operators would probably not replace workers with robots if they had to pay the $15 hourly wage demanded by protesters  McDonald's Corp Chief Executive Officer Steve Easterbrook told shareholders at the company's annual meeting on Thursday.",
        "date": "05262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's CEO says $15 hourly wage  robots won't kill jobs "
    },
    {
        "content": "PARIS French investigators searched McDonald's  French headquarters on May 18  targeting the U.S. fast food chain in a tax probe  sources with knowledge of the matter told Reuters on Thursday.",
        "date": "05262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's French HQ searched in tax probe: sources "
    },
    {
        "content": "OAK BROOK  Ill.  May 26 Hundreds of protesters rallied outside McDonald's Corp headquarters as shareholders on Thursday approved executive compensation and voted down a slate of shareholder resolutions  including those involving political contributions and antibiotic use in meat production.",
        "date": "05262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Workers protest at McDonald's shareholder meeting for second day "
    },
    {
        "content": "LOS ANGELES  May 25 McDonald's Corp has temporarily closed its headquarters for the third year in a row as worker wage protests targeted the fast-food company's annual meeting  it said on Wednesday.",
        "date": "05252016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "REFILE-McDonald's headquarters closed due to worker wage protests "
    },
    {
        "content": "PARIS  May 26 French investigators searched McDonald's French headquarters on May 18  a source with knowledge of the matter told Reuters on Thursday.",
        "date": "05262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's French HQ searched in tax probe - source "
    },
    {
        "content": "OAK BROOK  Ill. Hundreds of protesters marched through pouring rain to call for higher wages and union rights at McDonald's Corp on Wednesday  leading the hamburger chain to shut down its headquarters a day before its annual meeting. | Video ",
        "date": "05262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Hundreds protest in downpour at shut McDonald's headquarters "
    },
    {
        "content": "OAK BROOK  Ill.  May 25 Hundreds of protesters marched through pouring rain to call for higher wages and union rights at McDonald's Corp on Wednesday  leading the hamburger chain to shut down its headquarters a day before its annual meeting.",
        "date": "05262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-Hundreds protest in downpour at shut McDonald's headquarters "
    },
    {
        "content": "LOS ANGELES  May 19 Spurred by recent successes  U.S. low-wage workers next week plan to make McDonald's Corp  and its annual shareholder meeting the target of major protests calling for $15 per hour and the right to unionize.",
        "date": "05192016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Workers plan major round of protests for McDonald's annual meeting "
    },
    {
        "content": "* Yum shares have jumped 9.7 pct this year   (Adds China performance  comment  Temasek consumer deals)",
        "date": "05192016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-Temasek  CIC-KKR advance to 2nd round of Yum China stake sale -sources "
    },
    {
        "content": "LOS ANGELES The former Iowa science teacher and McDonald's Corp \"brand ambassador \" who preached the virtues of walking and near-daily french fries in presentations to youth  is no longer visiting U.S. schools  the fast-food chain said on Friday.",
        "date": "05162016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "'McDonald's Diet' brand ambassador dropped from schools: company "
    },
    {
        "content": "LOS ANGELES  May 13 The former Iowa science teacher and McDonald's Corp \"brand ambassador \" who preached the virtues of walking and near-daily french fries in presentations to youth  is no longer visiting U.S. schools  the fast-food chain said on Friday.",
        "date": "05132016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "'McDonald's Diet' brand ambassador dropped from schools -company "
    },
    {
        "content": "STOCKHOLM Soundtrack Your Brand  a music streaming service for businesses backed by Spotify  launched in the United States on Thursday and announced a global deal with fast food chain McDonald's.",
        "date": "05052016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Spotify-backed 'Soundtrack Your Brand' launches in U.S.  signs McDonald's "
    },
    {
        "content": "McDonald's Corp  said it is testing new recipes for its staple Chicken McNuggets snack in some U.S. markets to cater to growing consumer demand for healthier food.",
        "date": "04272016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's testing new Chicken McNuggets in two U.S. markets "
    },
    {
        "content": "April 27 McDonald's Corp said it is testing new recipes for its staple Chicken McNuggets snack in some U.S. markets to cater to growing consumer demand for healthier food.",
        "date": "04272016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's testing new Chicken McNuggets in two U.S. markets "
    },
    {
        "content": "April 27 McDonald's Corp said it is testing new recipes for its staple Chicken McNuggets snack in some U.S. markets to cater to growing consumer demand for less-processed food.",
        "date": "04272016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's testing new Chicken McNuggets recipe in some U.S. markets "
    },
    {
        "content": "* Started testing a new Chicken McNuggets recipe in early March  at about 140 McDonald's restaurants in Oregon and Southwest Washington",
        "date": "04272016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's says testing preservative-free McNuggets recipe "
    },
    {
        "content": "* Mcdonald's ratings balance company's aggressive financial strategy with its substantial cash flow",
        "date": "04262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Fitch rates Mcdonald's EUR2.5b debt issuance 'BBB+' "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 26 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to  McDonald's Corporation (NYSE:MCD) multi-tranche debt issuance. The Rating  Outlook is Negative. The EUR2.5 billion issuance includes four-year  seven-year   and twelve-year fixed-rate senior unsecured notes. At Dec. 31  2015  McDonald's  had $24 billion of total debt. A full list of ratings follows at the end of this  release. The notes  which rank pari passu with ",
        "date": "04262016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Fitch Rates McDonald's EUR2.5B Debt Issuance 'BBB+' "
    },
    {
        "content": "MOSCOW The McDonald's  fast food chain said its lawyers were investigating after entrepreneurs in separatist-controlled eastern Ukraine started selling McDonald's-style hamburgers out of a restaurant that the company shut down two years ago.",
        "date": "04292016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's probes copycat burger joint in separatist east Ukraine "
    },
    {
        "content": "McDonald's Corp's  quarterly earnings jumped more than expected in the latest quarter  as all-day breakfasts and new meal deals lured more diners to its U.S. restaurants which contribute about 40 percent of overall profit. | Video ",
        "date": "04222016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "All-day breakfast  promotions drive McDonald's profit beat "
    },
    {
        "content": "* Shares rise about 2 pct premarket   (Adds executive comment  market commentary  link to graphic)",
        "date": "04222016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 4-All-day breakfast  promotions drive McDonald's profit beat "
    },
    {
        "content": "* Says expects to refranchise about 4 000 restaurants through 2018 with a long-term goal to become 95% franchised",
        "date": "04222016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's says expects to refranchise about 4 000 restaurants through 2018 "
    },
    {
        "content": "* Q1 earnings per share view $1.16 -- Thomson Reuters I/B/E/S",
        "date": "04222016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's reports Q1 earnings per share $1.23 "
    },
    {
        "content": "HONG KONG/SINGAPORE  April 20 A group of investors comprising sovereign wealth fund China Investment Corp (CIC)  KKR & Co and Baring Private Equity Asia is in talks to buy a controlling stake in Yum Brands Inc's  China unit  people familiar with the matter said.",
        "date": "04202016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "REFILE-China's CIC  KKR consortium in talks to buy control of Yum China unit -sources "
    },
    {
        "content": "April 22 McDonald's Corp reported a higher-than-expected rise in comparable sales at its U.S. restaurants as its all-day breakfast offerings brought in more customers.",
        "date": "04222016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's U.S. comparable sales growth beats estimates "
    },
    {
        "content": "* CEO Stephen Easterbrook's 2015 total comensation was $7.9 million  including $3 million in stock awards - SEC filing",
        "date": "04152016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-Mcdonald's CEO Easterbrook's 2015 comensation was $7.9 mln - SEC filing "
    },
    {
        "content": "HONG KONG McDonald's Corp  is targeting private equity firms  including Bain Capital  MBK Partners  TPG Capital Management and Chinese state-backed conglomerate China Resources (Holdings) for its planned sale of 2 800 restaurants in North Asia  people familiar with the matter told Reuters.",
        "date": "04142016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's targeting buyout firms as it seeks to sell North Asia stores "
    },
    {
        "content": "HONG KONG  April 14 McDonald's Corp is targeting private equity firms  including Bain Capital  MBK Partners  TPG Capital Management and Chinese state-backed conglomerate China Resources (Holdings) for its planned sale of 2 800 restaurants in North Asia  people familiar with the matter told Reuters.",
        "date": "04132016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "DEALTALK-McDonald's targeting buyout firms as it seeks to sell North Asia stores "
    },
    {
        "content": "April 6 McDonald's Corp said its chairman of 12 years  Andrew McKenna  had decided he would not stand for re-election as a member of the company's board.",
        "date": "04062016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Chairman Andrew McKenna to retire "
    },
    {
        "content": "* Andrew J. Mckenna to retire from Mcdonald's board of directors",
        "date": "04062016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-Andrew Mckenna to retire from Mcdonald's board of directors "
    },
    {
        "content": "McDonald's Corp  plans to add more than 1 000 restaurants in China over the next five years  which would make it the company's second-largest market after the United States.",
        "date": "03312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's to add more than 1 000 outlets in China "
    },
    {
        "content": "* Stock touches record high   (Adds analyst quote  details; updates shares)",
        "date": "03312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 3-McDonald's to add more than 1 000 outlets in China "
    },
    {
        "content": "March 31 McDonald's Corp said on Thursday it plans to add more than 1 500 restaurants in China  Hong Kong and South Korea over the next five years.",
        "date": "03312016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to add over 1 500 outlets in China  Hong Kong  Korea "
    },
    {
        "content": "A federal prosecutor in Brazil has launched a civil inquiry into McDonald's Corp   franchisee Arcos Dorados Holdings Inc  and other franchise groups over alleged violations of franchise law  antitrust provisions and tax avoidance  the prosecutor's office said on Friday.",
        "date": "03052016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Brazil opens probe into McDonald's  Arcos Dorados franchisee "
    },
    {
        "content": "March 4 A federal prosecutor in Brazil has launched a civil inquiry into McDonald's Corp  franchisee Arcos Dorados Holdings Inc and other franchise groups over alleged violations of franchise law  antitrust provisions and tax avoidance  the prosecutor's office said on Friday.",
        "date": "03042016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Brazil opens probe into McDonald's  Arcos Dorados franchisee "
    },
    {
        "content": "MOSCOW  Feb 25 McDonald's will open its first restaurant in Kazakhstan in March and another 15 soon afterward in a belated foray into Central Asia's largest economy  a company executive and its Kazakh licencee said on Thursday.",
        "date": "02252016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's announces belated foray into Kazakhstan market next month "
    },
    {
        "content": "SHANGHAI Yum Brands Inc   the home of KFC and Pizza Hut  is falling behind rival McDonald's Corp  as the pair battle to revive flagging sales in China - a headache for Yum as it looks to spin off operations in its biggest market. | Video ",
        "date": "02052016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Beefed up: McDonald's edging out KFC  Pizza Hut in China revival battle "
    },
    {
        "content": "* Headache for Yum with China unit spin-off due this year   (Adds Yum comment paragraph 13  TV link)",
        "date": "02052016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-Beefed up: McDonald's edging out KFC  Pizza Hut in China revival battle "
    },
    {
        "content": "Dunkin' Brands Group Inc  reported a surprise drop in quarterly sales at established U.S. Dunkin' Donuts restaurants as the launch of all-day breakfast by McDonald's Corp  and value-meal offers by rivals lured customers away.",
        "date": "02042016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Dunkin' Donuts U.S. store sales fall as competition heats up "
    },
    {
        "content": "SHANGHAI  Feb 4 Yum Brands Inc  the home of KFC and Pizza Hut  is falling behind rival McDonald's Corp  as the pair battle to revive flagging sales in China - a headache for Yum as it looks to spin off operations in its biggest market.",
        "date": "02042016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Beefed up: McDonald's edging out KFC  Pizza Hut in China revival battle "
    },
    {
        "content": "HONG KONG McDonald's Corp  plans to launch in China this year 150 outlets where clients can customize burgers to suit their tastes  as the world's top restaurant chain aims to grow sales in the country after being hit by a fast-food scandal in 2014.",
        "date": "01292016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's to launch 150 customized burger stores in China in 2016 "
    },
    {
        "content": "HONG KONG  Jan 29 McDonald's Corp plans to launch in China this year 150 outlets where clients can customise burgers to suit their tastes  as the world's top restaurant chain aims to grow sales in the country after being hit by a fast-food scandal in 2014.",
        "date": "01292016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to launch 150 customised burger stores in China in 2016 "
    },
    {
        "content": "MOSCOW McDonald's  plans to increase investment in Russia and open more restaurants this year after a focus on local suppliers and affordable menus helped it to weather an economic crisis.",
        "date": "01252016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's to invest more in Russia  boost local supply "
    },
    {
        "content": "Jan 25 McDonald's Corp is exploring a sale of a portion of its stake in its Japan business  Chief Financial Officer Kevin Ozan said in a post earnings conference call on Monday.",
        "date": "01252016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's exploring sale of stake in Japanese arm "
    },
    {
        "content": "* Plans to open more than 60 restaurants this year   (Adds CEO's comments on investment allocation  pricing  supply chain)",
        "date": "01252016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's to invest more in Russia  boost local supply "
    },
    {
        "content": "Jan 25 McDonald's Corp reported better-than-expected quarterly same-restaurant sales  helped by the launch of all-day breakfasts in the United States and recovering demand in China.",
        "date": "01252016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's same-restaurant sales rise 5 pct "
    },
    {
        "content": "MOSCOW  Jan 25 McDonald's plans to open more than 60 restaurants in Russia in 2016  increasing the pace of expansion from last year  after its focus on local suppliers and affordable menus has proved successful in an economic crisis.",
        "date": "01252016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to open more than 60 restaurants in Russia in 2016 "
    },
    {
        "content": "Jan 22 Diary of U.S. corporate earnings for the week ahead.    ** This Diary does not provide the EPS estimate figures. EPS figures can be retrieved from Eikon.      Steps in Eikon to retrieve the EPS estimate:-     Eikon Indicator-> Equities Guide-> Top Indices-> S&P 500-> Events-> Select Event types-> Select the company-> Estimates              ** Please Note - All times given are in U.S. EST unless otherwise stated **            U.S. EARNINGS    -   Start Date",
        "date": "01222016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "DIARY-U.S. EARNINGS WEEK AHEAD "
    },
    {
        "content": "BRUSSELS - Three Italian consumer organizations have urged EU antitrust regulators to investigate McDonald's  franchise system in Europe  a month after the opening of an EU inquiry into the U.S. fast food company's tax deals with Luxembourg.",
        "date": "01122016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Italian groups seek EU antitrust probe into McDonald's "
    },
    {
        "content": "* EU already looking into McDonald's tax deal with Luxembourg",
        "date": "01122016",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 3-Italian groups seek EU antitrust probe into McDonald's "
    },
    {
        "content": "McDonald's Corp  is reaching out to investors about selling a part of the fast-food company's stake in its Japanese arm for about 100 billion yen ($826.2 million)  the Nikkei business daily reported  without citing sources.",
        "date": "12212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's exploring sale of stake in Japanese arm: Nikkei "
    },
    {
        "content": "Dec 21 McDonald's Corp is reaching out to investors about selling a part of the fast-food company's stake in its Japanese arm for about 100 billion yen ($826.2 million)  the Nikkei business daily reported  without citing sources.",
        "date": "12212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's exploring sale of stake in Japanese arm - Nikkei "
    },
    {
        "content": "Dunkin' Donuts  owned by Dunkin' Brands Group Inc   said it will switch to using cage-free eggs in the United States by 2025  becoming the latest restaurant company to announce plans to move away from eggs sourced from cage-confined chickens.",
        "date": "12072015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Dunkin' Donuts says will switch to cage-free eggs by 2025 "
    },
    {
        "content": "NEW YORK  Dec 4 (IFR) - A conservative bookbuild worked well for McDonald's this week  as it drew almost US$40bn of orders for a US$6bn five-tranche bond despite worries about leverage under a new turnaround plan.",
        "date": "12042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's makes happy meal out of jumbo bond "
    },
    {
        "content": "BRUSSELS EU regulators are to investigate tax deals between McDonald's  and Luxembourg which enabled the U.S. chain to escape paying taxes on European franchise royalties from 2009  a move which could lead to hefty back taxes for the company.",
        "date": "12032015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's under EU investigation over Luxembourg tax deals "
    },
    {
        "content": "BRUSSELS  Dec 3 EU antitrust regulators opened an investigation on Thursday into McDonald's tax deals with Luxembourg  saying these enabled the U.S. fastfood chain to escape paying taxes on its European royalties both in Luxembourg and in the United States.",
        "date": "12032015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "EU regulators to investigate McDonald's tax deals with Luxembourg "
    },
    {
        "content": "BRUSSELS EU antitrust regulators are likely to launch a formal investigation into McDonald's tax deal with Luxembourg  two people with knowledge of the matter said on Wednesday  widening the bloc's crackdown on corporate tax avoidance.",
        "date": "12022015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "EU set to investigate McDonald's tax deal with Luxembourg: sources "
    },
    {
        "content": "BRUSSELS  Dec 2 EU antitrust regulators are likely to launch a formal investigation into McDonald's  tax deal with Luxembourg  two people with knowledge of the matter said on Wednesday  widening the bloc's crackdown on corporate tax avoidance.",
        "date": "12022015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-EU set to investigate McDonald's tax deal with Luxembourg -sources "
    },
    {
        "content": "WASHINGTON McDonald's Corp will pay $355 000 in civil penalties  undergo 20 months of monitoring and train its employees as part of a settlement of an immigration-related discrimination claim  the U.S. Justice Department said on Thursday.",
        "date": "11192015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's hit with $355 000 in civil penalties in discrimination case "
    },
    {
        "content": "LOS ANGELES  Nov 17 McDonald's Corp said it would debut a \"McPick\" U.S. value menu in January as turnaround efforts continue at the world's largest restaurant chain by revenue.",
        "date": "11172015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to debut new value menu in January amid turnaround "
    },
    {
        "content": "WASHINGTON  Nov 19 McDonald's Corp will pay $355 000 in civil penalties  undergo 20 months of monitoring and train its employees as part of a settlement of an immigration-related discrimination claim  the U.S. Justice Department said on Thursday.",
        "date": "11192015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's hit with $355 000 in civil penalties in discrimination case "
    },
    {
        "content": "WASHINGTON  Nov 19 McDonald's Corp will pay $355 000 in civil penalties  undergo 20 months of monitoring and train its employees as part of a settlement of an immigration-related discrimination claim  the U.S. Justice Department said on Thursday.",
        "date": "11192015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to pay $355 000 civil penalties to settle immigration case - U.S. "
    },
    {
        "content": "LOS ANGELES  Nov 18 A customer sued the operator of a McDonald's restaurant in Waterloo  New York  on Wednesday after diners were exposed to food and drinks prepared by a worker with hepatitis A  the virus that causes contagious liver infections.",
        "date": "11182015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's operator sued after diners exposed to hepatitis A "
    },
    {
        "content": "A U.S. judge has ordered 10 McDonald's franchisees in New York City to comply with subpoenas from the National Labor Relations Board seeking information on their relationship with McDonald's Corp  as the agency tries to prove that the fast food giant is a joint employer of franchise workers.",
        "date": "11162015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's franchises must comply with NLRB subpoenas  judge says "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 12 (Fitch) Fitch Ratings has affirmed the Issuer Default  Ratings (IDRs) of McDonald's Corporation (NYSE: MCD) at 'BBB+/F2'.  The Rating  Outlook has been revised to Negative from Stable. At Sept. 30  2015  McDonald's  had approximately $18 billion of total debt. A full list of ratings is provided at the end of this release. KEY RATING DRIVERS Aggressive Financial Strategy The Negative Outlook reflects McDonald's aggre",
        "date": "11122015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Fitch Affirms McDonald's IDR at 'BBB+'; Outlook Revised to Negative "
    },
    {
        "content": "McDonald's Corp  will not spin off its properties into a real estate investment trust (REIT)  Chief Executive Steve Easterbrook said at the company's investor meeting on Tuesday.",
        "date": "11102015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's will not put properties into REIT  CEO says "
    },
    {
        "content": "Nov 10 McDonald's Corp will not spin off its properties into a real estate investment trust (REIT)  Chief Executive Steve Easterbrook said at the company's investor meeting on Tuesday.",
        "date": "11102015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 3-McDonald's will not put properties into REIT  CEO says "
    },
    {
        "content": "NEW YORK  Nov 10 (IFR) - S&P downgraded the credit rating of McDonald's one notch on Tuesday after the burger giant said it would increase debt to return US$10bn of cash to shareholders by the end of next year.",
        "date": "11102015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "S&P downgrades McDonald's over shareholder plan "
    },
    {
        "content": "Nov 10 McDonald's Corp is expected to announce early results from its domestic all-day breakfast push  give a verdict on whether it will spin off its U.S. real estate and announce a dividend increase at its investor meeting on Tuesday.",
        "date": "11102015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's investors hungry for news on breakfast  REIT  dividend "
    },
    {
        "content": "Nov 5 Bakery-cafe chain Panera Bread Co  will stop using eggs laid by caged hens by 2020  following similar moves from McDonald's Corp and other large U.S. restaurant chains.",
        "date": "11052015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Panera moving to cage-free eggs by 2020 "
    },
    {
        "content": "NEW YORK  Oct 30 A U.S. judge on Friday gave McDonald's Corp 30 days to hand over thousands of employee emails to a federal labor agency that says the company should be held liable for labor violations by franchisees.",
        "date": "10302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Judge says McDonald's must give employee emails to U.S. labor board "
    },
    {
        "content": "BOSTON  Oct 26 JPMorgan Chase & Co said on Monday its board will consider a bylaw amendment to make it easier for small groups of investors to run candidates for the New York bank's board of directors.",
        "date": "10262015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 1-JPMorgan joins proxy access trend  adopts clawback disclosure "
    },
    {
        "content": "McDonald's Corp has asked a U.S. judge to reject a subpoena from the National Labor Relations Board in its case claiming the company is a \"joint employer\" of franchise workers  saying the requests are unfair and costly.",
        "date": "10272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's asks judge to toss out U.S. labor board's 'massive' subpoena "
    },
    {
        "content": "NEW YORK - The S&P 500 closed at its highest in two months on Thursday as stronger-than-expected earnings from several top companies  including McDonald's  relieved investors' concerns about the profit outlook.",
        "date": "10232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "India Morning Call-Global Markets "
    },
    {
        "content": "Oct 27 McDonald's Corp has asked a U.S. judge to reject a subpoena from the National Labor Relations Board in its case claiming the company is a \"joint employer\" of franchise workers  saying the requests are unfair and costly.",
        "date": "10272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's asks judge to toss out U.S. labor board's 'massive' subpoena "
    },
    {
        "content": "McDonald's Corp  has asked a U.S. judge to reject a subpoena from the National Labor Relations Board in its case claiming the company is a \"joint employer\" of franchise workers  saying the requests are unfair and costly.",
        "date": "10272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's asks judge to toss out U.S. labor board's 'massive'' subpoena "
    },
    {
        "content": "The S&P 500 closed at its highest in two months on Thursday as stronger-than-expected earnings from several top companies  including McDonald's  relieved investors' concerns about the profit outlook. | Video ",
        "date": "10232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "S&P 500 ends at highest in two months; Alphabet up after hours "
    },
    {
        "content": "McDonald's Corp  shares hit an all-time high on Thursday after Chief Executive Steve Easterbrook said a rebound in quarterly restaurant sales showed that his turnaround plan is starting to work. | Video ",
        "date": "10222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's stock hits record high as turnaround takes hold "
    },
    {
        "content": "Oct 27 McDonald's Corp has asked a U.S. judge to reject a subpoena from the National Labor Relations Board in its case claiming the company is a \"joint employer\" of franchise workers  saying the requests are unfair and costly.",
        "date": "10272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's asks judge to toss out U.S. labor board's \"massive\" subpoena "
    },
    {
        "content": "The S&P 500 closed at its highest in two months on Thursday as stronger-than-expected earnings from several top companies  including McDonald's  relieved investors' concerns about the profit outlook. | Video ",
        "date": "10222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "S&P 500 ends at highest in two months; Alphabet up after hours "
    },
    {
        "content": "* U.S. same-restaurant sales rise for first time in two years",
        "date": "10222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 4-McDonald's stock hits record high as turnaround takes hold "
    },
    {
        "content": "* Indexes up: Dow 0.9 pct  S&P 0.97 pct  Nasdaq 1.14 pct   (Updates to open)",
        "date": "10222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall St opens higher after McDonald's results  job data "
    },
    {
        "content": "* Futures up: Dow 82 pts  S&P 7.5 pts  Nasdaq 23.5 pts   (Adds details  comment  updates prices)",
        "date": "10222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall St set for higher open after McDonald's beat "
    },
    {
        "content": "NEW YORK  Oct 21 When McDonald's Corp  reports its third quarter earnings on Thursday  it will have to make good on its promise of global same-store sales growth and aim for a smaller decline in revenue if it is to hold investors who have already bid up shares to record levels this year.",
        "date": "10212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "At luxury price  McDonald's needs double-decker good news "
    },
    {
        "content": "Oct 22 McDonald's Corp reported its first rise in quarterly global same-restaurant sales in more than a year as demand recovered in China  where it had struggled after a food safety scandal  and menu changes boosted sales in the United States.",
        "date": "10222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's global same-restaurant sales rise "
    },
    {
        "content": "McDonald's Corp  is close to deciding what  if anything  to do with its massive U.S. real estate holdings  the Wall Street Journal reported on Thursday.",
        "date": "10152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's close to decision on structure of U.S. real estate: WSJ "
    },
    {
        "content": "Oct 15 McDonald's Corp is close to deciding what  if anything  to do with its massive U.S. real estate holdings  the Wall Street Journal reported on Thursday.",
        "date": "10152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's close to decision on structure of U.S. real estate-WSJ "
    },
    {
        "content": "Oct 15 McDonald's Corp is close to deciding what  if anything  to do with its massive U.S. real estate holdings  the Wall Street Journal reported on Thursday.",
        "date": "10152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's close to decision on structure of U.S. real estate-WSJ "
    },
    {
        "content": "Plaintiffs in a wage-and-hour case against McDonald's Corp and a franchisee on Friday challenged the fast food giant's bid to argue that a recent ruling that said the case hinged on workers' perceptions of who their employer was undermined class certification.",
        "date": "10092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Workers fight McDonald's bid to kill California class action "
    },
    {
        "content": "A recent ruling that McDonald's Corp could be liable for wage-and-hour violations by a franchisee if workers believed the fast food giant was their employer precludes them from bringing claims as a class  the company's lawyers said.",
        "date": "10072015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's says 'agency' ruling undermines California class action "
    },
    {
        "content": "Oct 5 U.S. burger chain Wendy's Co said on Monday its Chief Executive Emil Brolick would retire in May and named Chief Financial Officer Todd Penegor as his successor.",
        "date": "10052015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-Wendy's CEO Brolick to retire  to be succeeded by CFO Penegor "
    },
    {
        "content": "NEW YORK/ZURICH Major soccer sponsors on Friday issued coordinated calls for the immediate resignation of FIFA president Sepp Blatter in the most significant move by companies supporting the sport since a bribery and corruption scandal erupted at world football's governing body last May.",
        "date": "10022015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "FIFA sponsors Coca-Cola  McDonald's call on Blatter to resign "
    },
    {
        "content": "A federal judge allowed McDonald's workers in Northern California to bring a putative class action on Friday claiming the fast food giant is liable for state wage law violations because the workers believed the company - and not the local franchisee - was its employer.",
        "date": "09292015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's can have joint employer liability based on worker perceptions - judge "
    },
    {
        "content": "NEW YORK  Oct 2 McDonald's joined calls on Friday for FIFA President Sepp Blatter to resign immediately after Swiss authorities said they had opened a criminal investigation into the head of the world soccer body.",
        "date": "10022015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's calls for FIFA's Sepp Blatter to step down immediately "
    },
    {
        "content": "LONDON  Sept 28 Burger King France's majority shareholder Groupe Bertrand has started exclusive negotiations to buy French chain Quick  a deal that would make it the second biggest fast food restaurant in France  behind market leader McDonald's.",
        "date": "09282015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Burger King France in talks to buy Quick "
    },
    {
        "content": "Sept 25 McDonald's Corp will offer its first-ever 100 percent organic beef hamburger for a limited time in Germany  as a growing number of global diners demand food that is more natural and less processed.",
        "date": "09252015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to offer first-ever organic burger  in Germany "
    },
    {
        "content": "Sept 25 McDonald's Corp will offer its first-ever 100 percent organic beef hamburger for a limited time in Germany  as a growing number of global diners demand food that is more natural and less processed.",
        "date": "09252015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's to offer first-ever organic burger  in Germany "
    },
    {
        "content": "A sanitation company at the center of a major U.S. labor board ruling that could force companies like McDonald's Corp to negotiate directly with franchise and contract workers has refused to bargain with workers hired by a staffing agency.",
        "date": "09252015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "U.S. labor case on franchise  contract workers inches closer to courts "
    },
    {
        "content": "LOS ANGELES  Sept 24 McDonald's Corp is beefing up its ranks with political and food company alumni as it works to turn around lackluster sales and recreate the fast-food chain as a \"modern  progressive burger company.\"",
        "date": "09242015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's hires White House  Kraft alums "
    },
    {
        "content": "LOS ANGELES A McDonald's Corp shareholder group is renewing its call for the fast-food chain to stop buying any meat from animals raised with antibiotics vital to fighting human infections.",
        "date": "09182015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's investor wants it to cut antibiotics in all meats "
    },
    {
        "content": "LOS ANGELES  Sept 17 A McDonald's Corp  shareholder group is renewing its call for the fast-food chain to stop buying any meat from animals raised with antibiotics vital to fighting human infections.",
        "date": "09182015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "OFFICIAL CORRECTION-McDonald's investor wants it to cut antibiotics in all meats "
    },
    {
        "content": "Sept 9 McDonald's Corp said all eggs it uses in its 16 000 restaurants in the United States and Canada will come from chickens that are not confined to cages within 10 years.",
        "date": "09092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's moving to 'cage-free' eggs in US  Canada over 10 years "
    },
    {
        "content": "TOKYO The Japanese unit of McDonald's Corp  said on Wednesday its same-store sales in August rose for the first time since January 2014 helped by easy comparisons with the year before  when revelations of food-safety violations drove customers away.",
        "date": "09092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Japan posts first monthly sales rise since January 2014 "
    },
    {
        "content": "TOKYO  Sept 9 The Japanese unit of McDonald's Corp said on Wednesday its same-store sales in August rose for the first time since January 2014 helped by easy comparisons with the year before  when revelations of food-safety violations drove customers away.",
        "date": "09092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Japan posts first monthly sales rise since Jan 2014 "
    },
    {
        "content": "LOS ANGELES McDonald's Corp's U.S. franchisees have voted to begin offering all-day breakfast on Oct. 6  a widely expected move that the company and investors hope will help reverse slumping sales and traffic at the world's biggest fast-food chain.",
        "date": "09012015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's U.S. to add all-day breakfast on October 6 "
    },
    {
        "content": "LOS ANGELES  Sept 1 McDonald's Corp's  U.S. franchisees have voted to begin offering all-day breakfast on Oct. 6  a widely expected move that the company and investors hope will help reverse slumping sales and traffic at the world's biggest fast-food chain.",
        "date": "09012015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's U.S. to add all-day breakfast on Oct. 6 "
    },
    {
        "content": "LOS ANGELES  Sept 1 McDonald's Corp will begin offering all-day breakfast on Oct. 6  a widely expected move that the company and investors hope will help reverse slumping sales and traffic at the world's biggest fast-food chain.",
        "date": "09012015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to start all-day breakfast in the U.S. on Oct. 6 "
    },
    {
        "content": "LOS ANGELES  Aug 27 McDonald's Corp and Tyson Foods both severed ties on Thursday with a Tennessee farm where workers were seen stabbing  beating and stomping on chickens in an undercover video shot by animal rights activists.",
        "date": "08272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's  Tyson Foods drop farm after videotape shows animal cruelty "
    },
    {
        "content": "LOS ANGELES  Aug 27 McDonald's Corp and Tyson Foods both severed ties on Thursday with a Tennessee farm where workers were seen stabbing  clubbing and stomping on chickens in an undercover video shot by animal rights activists.",
        "date": "08272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's  Tyson Foods drop farm after videotape shows animal cruelty "
    },
    {
        "content": "LOS ANGELES McDonald's Corp and Tyson Foods both severed ties on Thursday with a Tennessee farm where workers were seen stabbing  clubbing and stomping on chickens in an undercover video shot by animal rights activists.",
        "date": "08282015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's  Tyson Foods drop farm after videotape shows animal cruelty "
    },
    {
        "content": "Aug 28 U.S. union leaders said on Friday that a landmark U.S. labor board ruling on companies' obligations toward contract and franchise workers would help them organize manufacturers and e-commerce companies as well as fast food chains.",
        "date": "08282015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Big labor sees organizing boon for autos  warehouses  more from U.S. ruling "
    },
    {
        "content": "Aug 28 U.S. union leaders said on Friday that a landmark U.S. labor board ruling on companies' obligations toward contract and franchise workers would help them organize manufacturers and e-commerce companies as well as fast food chains.",
        "date": "08282015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-Big labor sees organizing boon for autos  warehouses  more from U.S. ruling "
    },
    {
        "content": "LOS ANGELES  Aug 27 McDonald's Corp and Tyson Foods both severed ties on Thursday with a Tennessee farm where workers were seen stabbing  clubbing and stomping on chickens in an undercover video shot by animal rights activists.",
        "date": "08282015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's  Tyson Foods drop farm after videotape shows animal cruelty "
    },
    {
        "content": "BRASILIA  Aug 20 McDonald's Corp  the world's biggest fast-food chain  was accused of mistreating its employees and dodging taxes on Thursday during a Senate hearing in Brazil  where politicians  union leaders and workers from five continents voiced allegations.",
        "date": "08212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "REFILE-McDonald's grilled over labor  tax practices at Brazil hearing "
    },
    {
        "content": "MOSCOW  Aug 21 McDonald's Corp. said on Friday it had signed its second deal with a Russian franchisee which will help it to expand in remote Siberian regions.",
        "date": "08212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's signs second franchising deal in Russia "
    },
    {
        "content": "BRASILIA McDonald's Corp   the world's biggest fast-food chain  was accused of mistreating its employees and dodging taxes on Thursday during a Senate hearing in Brazil  where politicians  union leaders and workers from five continents voiced allegations.",
        "date": "08212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's grilled over labor  tax practices at Brazil hearing "
    },
    {
        "content": "McDonald's Corp  which is expected to offer all-day breakfasts starting this fall to turn around slumping U.S. sales  is the top choice for \"Breakfastarians \" who crave breakfast food at any hour  according to a new survey obtained by Reuters on Monday.",
        "date": "08172015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's No. 1 choice for 'Breakfastarians': poll "
    },
    {
        "content": "Aug 17 McDonald's Corp  which is expected to offer all-day breakfasts starting this fall to turn around slumping U.S. sales  is the top choice for \"Breakfastarians \" who crave breakfast food at any hour  according to a new survey obtained by Reuters on Monday.",
        "date": "08172015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's No. 1 choice for 'Breakfastarians' -poll "
    },
    {
        "content": "TOKYO The Japan unit of McDonald's Corp's  said it slid deep into losses in the first six months of the year  as customers stayed away after a string of safety scandals and the fast-food chain booked store closure and other restructuring costs.",
        "date": "08122015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's Japan slides to first half loss as food scandals weigh "
    },
    {
        "content": "TOKYO  Aug 12 The Japan unit of McDonald's Corp's said it slid deep into losses in the first six months of the year  as customers stayed away after a string of safety scandals and the fast-food chain booked store closure and other restructuring costs.",
        "date": "08122015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Japan slides to H1 loss as food scandals weigh "
    },
    {
        "content": "SHANGHAI  Aug 6 On birthdays and for special treats  Lu Yuanli would take her son to their local KFC for his favourite meal  fried chicken wings  but the Chinese mother hasn't been back since a safety scare battered KFC-parent Yum Brands Inc and rival McDonald's Corp last year.",
        "date": "08052015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Food scares strip McDonald's  KFC of treat status in China "
    },
    {
        "content": "* Says laid off 135 employees at corporate center in Oak Brook  Illinois  in July as part of broad restructuring plan",
        "date": "08062015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's lays off 135 employees in Oak Brook in July "
    },
    {
        "content": "ZURICH World Cup sponsor McDonald’s has joined Coca-Cola and Visa in urging FIFA to adopt an independent reform commission in response to the scandals that have plagued world soccer’s governing body.",
        "date": "08062015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "FIFA sponsor McDonald's backs independent reform body: group "
    },
    {
        "content": "ZURICH  Aug 6 World Cup sponsor McDonald's  has joined Coca-Cola and Visa in urging FIFA to adopt an independent reform commission in response to the scandals that have plagued world football's governing body.",
        "date": "08062015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Soccer-FIFA sponsor McDonald's backs independent reform body-group "
    },
    {
        "content": "ST PETERSBURG FIFA will meet its leading commercial partners next month after three of them increased pressure for major reforms to soccer's governing body following a series of corruption scandals.",
        "date": "07242015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "FIFA to meet sponsors after reproaches from Coke  Visa  McDonald's "
    },
    {
        "content": "McDonald's Corp's  new chief executive expects global sales at established restaurants to grow in the current quarter  reversing more than a year of declines  and said his turnaround plan is showing early signs of taking hold.",
        "date": "07232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's CEO says momentum is building  sees sales turnaround "
    },
    {
        "content": "ST PETERSBURG  July 24 FIFA will meet its leading commercial partners next month after three of them increased pressure for major reforms to soccer's governing body following a series of corruption scandals.",
        "date": "07242015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-FIFA to meet sponsors after reproaches from Coke  Visa  McDonald's "
    },
    {
        "content": "July 23 McDonald's Corp's new chief executive expects global sales at established restaurants to grow in the current quarter  reversing more than a year of declines  and said his turnaround plan is showing early signs of taking hold.",
        "date": "07232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 3-McDonald's CEO says momentum is building  sees sales turnaround "
    },
    {
        "content": "July 23 McDonald's Corp's new chief executive expects global sales at established restaurants to grow in the current quarter  reversing more than a year of declines  and said his turnaround plan was showing early signs of taking hold.",
        "date": "07232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "RPT-UPDATE 2-McDonald's expects same-restaurant sales to improve in quarter "
    },
    {
        "content": "McDonald's Corp  could start offering all-day breakfast in its U.S. restaurants as early as October  the Wall Street Journal reported  citing an internal company memo.",
        "date": "07222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's may offer all-day breakfast in U.S. from Oct: WSJ "
    },
    {
        "content": "July 23 McDonald's Corp's second-quarter profit fell 13 percent  hurt by a decline in global same-store sales as fewer customers ate at its restaurants.",
        "date": "07232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's quarterly profit falls 13 percent "
    },
    {
        "content": "Visa Inc  the world's largest credit and debit card company  is expected to report a third-quarter profit  helped by higher U.S. consumer spending boosted by lower gasoline prices and a strong labor market. U.S. consumer spending recorded its largest increase in nearly six years in May on strong demand for automobiles and other big-ticket items. EU antitrust regulators are probing Visa International's inter-regional card fees  after accusing MasterCard of levying excessive fees  earlier in July.",
        "date": "07222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "What to Watch in the Day Ahead - Thursday  July 23 "
    },
    {
        "content": "July 21 McDonald's Corp could start offering all-day breakfast in its U.S. restaurants as early as October  the Wall Street Journal reported  citing an internal company memo.",
        "date": "07222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's may offer all-day breakfast in U.S. from Oct -WSJ "
    },
    {
        "content": "McDonald's Corp  could start offering all-day breakfast in its U.S. restaurants as early as October  the Wall Street Journal reported  citing an internal company memo.",
        "date": "07212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's may offer all-day breakfast in U.S. from October: WSJ "
    },
    {
        "content": "MIAMI Two top sponsors of FIFA and its World Cup tournaments on Friday ratcheted up pressure on the global soccer body for major reforms as a corruption scandal casts a lengthening shadow over the sport.",
        "date": "07172015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Major sponsors  Coca-Cola  McDonald's  demand reforms at FIFA "
    },
    {
        "content": "July 21 McDonald's Corp could start offering all-day breakfast in its U.S. restaurants as early as October  the Wall Street Journal reported  citing an internal company memo.",
        "date": "07212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's may offer all-day breakfast in U.S. from Oct - WSJ "
    },
    {
        "content": "MIAMI  July 17 Two top sponsors of FIFA and its World Cup tournaments on Friday ratcheted up pressure on the global soccer body for major reforms as a corruption scandal casts a lengthening shadow over the sport.",
        "date": "07172015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-Soccer-Major sponsors  Coca-Cola  McDonald's  demand reforms at FIFA "
    },
    {
        "content": "July 10 McDonald's Corp is standing by its latest Happy Meal toy  denying that its Minions are the foul-mouthed playthings that some of its fast-food customers say they are.",
        "date": "07102015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Dear customers: That Minion isn't cursing. Sincerely  McDonald's "
    },
    {
        "content": "SHANGHAI McDonald's Corp  said it is aiming to sell all of its 413 Taiwan-based stores to a franchise operator  as the U.S. fast-food chain looks to cut costs globally and turn around its flagging China business.",
        "date": "06252015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's plans to sell Taiwan stores to franchise operator "
    },
    {
        "content": "* McDonald's wants single entity to oversee Taiwan stores   (Adds spokeswoman comment  context)",
        "date": "06252015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's plans to sell Taiwan stores to franchise operator "
    },
    {
        "content": "SHANGHAI  June 25 U.S. fast-food chain McDonald's Corp is planning to sell all of its 413 Taiwan-based stores to a franchise operator  the company said in a statement on Thursday.",
        "date": "06252015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's says looking to sell Taiwan stores to a franchise operator "
    },
    {
        "content": "NEW YORK  June 18 McDonald's Corp said Thursday that it will have fewer restaurants in the United States in 2015 than it did last year.",
        "date": "06182015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's says number of U.S. restaurants will shrink this year "
    },
    {
        "content": "McDonald's Corp said it hired Robert Gibbs  U.S. President Barack Obama's press secretary during his first term  as its chief communications officer.",
        "date": "06092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's hires ex-Obama press secretary as communications head "
    },
    {
        "content": "June 9 McDonald's Corp said it hired Robert Gibbs  U.S. President Barack Obama's press secretary during his first term  as its chief communications officer.",
        "date": "06092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's hires ex-Obama press secretary as communications head "
    },
    {
        "content": "June 9 McDonald's Corp named Bacardi Ltd's Silvia Lagnado as its chief marketing officer  a position vacant since 2010.",
        "date": "06092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's names marketing  communications chiefs "
    },
    {
        "content": "McDonald's Corp  posted a smaller-than-expected drop in worldwide sales at established restaurants in May after a lift from value meal deals in Europe helped offset continued weakness in the United States  its top market for profit.",
        "date": "06082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's European meal deals help offset weak U.S. May sales "
    },
    {
        "content": "June 8 McDonald's Corp posted a smaller-than-expected drop in worldwide sales at established restaurants in May after a lift from value meal deals in Europe helped offset continued weakness in the United States  its top market for profit.",
        "date": "06082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 3-McDonald's European meal deals help offset weak U.S. May sales "
    },
    {
        "content": "* Futures down: Dow 14 pts  S&P 3.25 pts  Nasdaq 7 pts   (Adds details  comment  updates prices)",
        "date": "06082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall St set to open modestly lower as rate hike timing weighs "
    },
    {
        "content": "June 8 McDonald's Corp posted a smaller-than-expected decline in worldwide sales at established restaurants in May as strong sales in Europe more than offset a decline in the United States.",
        "date": "06082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's May comparable sales decline smaller than expected "
    },
    {
        "content": "June 1 Foster Farms  one of the top U.S. chicken producers  plans to largely eliminate antibiotics used to treat humans from its poultry production  it said on Monday.",
        "date": "06012015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Foster Farms backs away from using human antibiotics in poultry "
    },
    {
        "content": "* Adidas  Coca-Cola Hyundai  McDonald's  Anheuser-Busch concerned",
        "date": "05282015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 4-Visa threatens to ditch FIFA as sponsor dismay mounts "
    },
    {
        "content": "NEW YORK  May 27 McDonald's Corp  a World Cup sponsor  said on Wednesday that it found the U.S. Department of Justice's indictment of senior officials at soccer's governing body FIFA \"extremely concerning.\"",
        "date": "05272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's calls FIFA situation 'extremely concerning' "
    },
    {
        "content": "McDonald's Corp  said it will stop reporting monthly same-store sales after June  becoming the latest major U.S. retailer to stop reporting the closely watched indicator to gauge overall spending trends and a company's financial health.",
        "date": "05272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to stop reporting monthly same-store sales after June "
    },
    {
        "content": "* Shares off 0.4 pct in morning trading   (Adds background  updates shares)",
        "date": "05272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's to stop reporting monthly same-store sales after June "
    },
    {
        "content": "May 27 McDonald's Corp will stop reporting monthly same-store sales after June  Bloomberg reported  citing an email from the retailer.",
        "date": "05272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to stop reporting monthly same-store sales-Bloomberg "
    },
    {
        "content": "LOS ANGELES The Los Angeles City Council voted on Tuesday to increase the minimum wage in the nation's second-largest city to $15 an hour by 2020 from the current $9  in a victory for labor and community groups that have pushed for similar pay hikes in several U.S. municipalities.",
        "date": "05192015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Los Angeles gives preliminary approval to $15 minimum wage "
    },
    {
        "content": "LOS ANGELES  May 18 The Service Employees International Union  backer of a three-year campaign to improve the plight of low-wage fast-food and retail workers  on Monday petitioned the Federal Trade Commission to investigate alleged abusive practices by major franchisors  including McDonald's Corp and 7-Eleven Inc.",
        "date": "05182015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 1-SEIU seeks FTC probe of McDonald's and other franchisors "
    },
    {
        "content": "LOS ANGELES/BOSTON McDonald's Corp  shareholders defied executives at its annual meeting on Thursday  approving a proposal to make it easier to nominate directors to the board of the fast-food chain and taking its new CEO to task over wages  advertising and its food.",
        "date": "05212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's CEO gets grilled at first annual meeting "
    },
    {
        "content": "CHICAGO  May 20 Thousands of McDonald's workers seeking a minimum wage of $15 per hour and the right to unionize are expected to swarm the fast-food giant's headquarters for two days of protests that will coincide with the fast-food chain's annual meeting on Thursday.",
        "date": "05202015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's  other fast-food workers  protest ahead of annual meeting "
    },
    {
        "content": "LONDON  May 19 (IFR) - McDonald's bit off more than it could chew in the euro corporate bond market on Monday  forcing it to pull the 20-year tranche of a jumbo bond sale after investors failed to show up.",
        "date": "05192015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Investors have no stomach for long-dated Big Mac "
    },
    {
        "content": "where assigned  and hit the newskey (F9 on Reuters terminals)",
        "date": "05182015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "New Issue- McDonald's prices a multi tranche deal "
    },
    {
        "content": "LOS ANGELES  May 18 The Service Employees International Union  backer of a three-year campaign to improve the plight of low-wage retail and fast-food workers  on Monday said it would petition the Federal Trade Commission to investigate alleged abusive practices by major franchisors  including McDonald's Corp and 7-Eleven Inc.",
        "date": "05182015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "SEIU to ask FTC to probe alleged abusive practices by franchisors "
    },
    {
        "content": "LOS ANGELES/BOSTON  May 21 McDonald's Corp  shareholders defied executives at its annual meeting on Thursday  approving a proposal to make it easier to nominate directors to the board of the fast-food chain and taking its new CEO to task over wages  advertising and its food.",
        "date": "05212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 3-McDonald's CEO gets grilled at first annual meeting "
    },
    {
        "content": "SHANGHAI  May 22 Apple Inc is planting trees  Mars may move to 'zero carbon' and Foxconn Technology Co Ltd is spending millions of dollars to give its factories a 'green' makeover  as companies operating in China face tighter rules on pollution.",
        "date": "05212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "In China  firms flash green credentials as regulators loom "
    },
    {
        "content": "CHICAGO  May 20 Thousands of McDonald's workers seeking a minimum wage of $15 per hour swarmed the fast-food giant's headquarters for the first of two days of protests to coincide with the fast-food chain's annual meeting on Thursday.",
        "date": "05202015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's  other fast-food workers  protest ahead of annual meeting "
    },
    {
        "content": "NEW YORK Sanderson Farms Inc  the third largest U.S. poultry producer  plans to continue using antibiotics on its birds partly because there are no alternatives on the horizon for treating a deadly but common gut disease  Chief Executive Officer Joe Sanderson said on Wednesday.",
        "date": "05202015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Sanderson sees no alternatives to antibiotic use in chicken production "
    },
    {
        "content": "BOSTON/LOS ANGELES  May 20 Four U.S. public pension fund officials on Wednesday warned that McDonald's Corp  and other companies may be jeopardizing their own futures by returning excessive amounts of cash to investors via share buybacks.",
        "date": "05202015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Pension fund leaders challenge McDonald's and others on buybacks "
    },
    {
        "content": "Some of the top U.S. hedge fund investors and activists  including Jana Partners LLC  took new positions or raised their equity stakes in fast food chain McDonald's Corp  during the first quarter  according to regulatory filings on Friday.",
        "date": "05162015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Hedge fund activists buy McDonald's  but are they lovin' it? "
    },
    {
        "content": "Weak euro zone  Asia pin hopes on U.S. economy for global bounce",
        "date": "05212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Reuters Business News Schedule at 1230 GMT/0830 AM ET "
    },
    {
        "content": "Thomson Reuters May 20  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05202015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "May 15 Some of the top U.S. hedge fund investors and activists  including Jana Partners LLC  took new positions or raised their equity stakes in fast food chain McDonald's Corp  during the first quarter  according to regulatory filings on Friday.",
        "date": "05162015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "REFILE-Hedge fund activists buy McDonald's  but are they lovin' it? "
    },
    {
        "content": "Thomson Reuters May 21  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "LOS ANGELES/BOSTON  May 21 McDonald's Corp  shareholders will vote Thursday on a proposal that would make it easier to nominate directors to the board of the fast-food chain  which is in turnaround mode after losing customers and sales to competition and after internal missteps.",
        "date": "05212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "RPT-McDonald's shareholders to weigh director-nomination rules "
    },
    {
        "content": "LOS ANGELES The Los Angeles City Council voted on Tuesday to increase the minimum wage in the nation's second-largest city to $15 an hour by 2020 from the current $9  in a victory for labor and community groups that have pushed for similar pay hikes in several U.S. municipalities.",
        "date": "05202015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Los Angeles gives preliminary approval to $15 minimum wage "
    },
    {
        "content": "May 15 Some of the top U.S. hedge fund investors and activists  including Jana Partners LLC took new positions or raised their equity stakes in fast food chain McDonald's Corp  during the first quarter  according to regulatory filings on Friday.",
        "date": "05152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Hedge fund activists buy McDonald's  but are they lovin' it? "
    },
    {
        "content": "LOS ANGELES/BOSTON  May 21 McDonald's Corp  shareholders will vote Thursday on a proposal that would make it easier to nominate directors to the board of the fast-food chain  which is in turnaround mode after losing customers and sales to competition and after internal missteps.",
        "date": "05212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's shareholders to weigh director-nomination rules "
    },
    {
        "content": "BOSTON/LOS ANGELES  May 20 Four U.S. public pension fund officials on Wednesday warned that McDonald's Corp  and other companies may be jeopardizing their own futures by returning excessive amounts of cash to investors via share buybacks.",
        "date": "05212015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-Pension fund leaders challenge McDonald's and others on buybacks "
    },
    {
        "content": "Labor expenses will be a key focus during retailers' earnings conference calls in the coming weeks  with many companies under pressure to boost workers' wages at a time when low U.S. unemployment levels have given workers more leverage.",
        "date": "05092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Wage increases in focus ahead of retail earnings "
    },
    {
        "content": "NEW YORK  May 15 Top U.S. hedge fund management firms  including Dan Loeb's Third Point LLC and Farallon Capital Management  trimmed some of their equity exposure in eBay Inc   but kept high positions in the e-commerce company's shares during the first quarter  according to regulatory filings.",
        "date": "05152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "HIGHLIGHTS-Hedge funds cut eBay  Leonard Green hot on Shake Shack "
    },
    {
        "content": "SHANGHAI  May 15 Chinese newspapers available in Beijing and Shanghai carried the following stories on Friday. Reuters has not checked the stories and does not vouch for their accuracy.",
        "date": "05152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "PRESS DIGEST - China - May 15 "
    },
    {
        "content": "Labor expenses will be a key focus during retailers' earnings conference calls in the coming weeks  with many companies under pressure to boost workers' wages at a time when low U.S. unemployment levels have given workers more leverage.",
        "date": "05082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Wage increases in focus ahead of retail earnings "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 08 (Fitch) Fitch Ratings has downgraded the Issuer Default Ratings  (IDRs) of McDonald's Corporation (NYSE: MCD) to 'BBB+/F2' from 'A/F1'. The  Rating Outlook is Stable. At March 31  2015  McDonald's had $14.3 billion of  total debt. A full list of ratings is provided at the end of this release. KEY RATINGS DRIVERS Materially Higher Leverage Anticipated The downgrade reflects Fitch's view that McDonald's has become more agg",
        "date": "05082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Fitch Downgrades McDonald's IDRs to 'BBB+/F2'; Outlook Stable "
    },
    {
        "content": "LOS ANGELES  May 6 McDonald's Corp  which is testing a variety of new food products as part of a major turnaround effort  on Wednesday said nine southern California restaurants are trying out breakfast bowls made with what is becoming a state dietary staple: kale.",
        "date": "05062015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Southern California restaurants testing kale "
    },
    {
        "content": "McDonald's Corp  reported a smaller-than-expected fall in worldwide sales at its established restaurants in April  thanks to a stronger performance in Europe  sending shares of the company higher in morning trading.",
        "date": "05082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's April global restaurant sales dip less than expected "
    },
    {
        "content": "LOS ANGELES  May 6 McDonald's Corp  which is testing a variety of new food products as part of its turnaround effort  on Wednesday said nine southern California restaurants are trying out breakfast bowls made with what is becoming a state dietary staple: kale.",
        "date": "05062015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's Southern California restaurants testing kale "
    },
    {
        "content": "May 8 McDonald's Corp reported a smaller-than-expected fall in worldwide sales at its established restaurants in April  thanks to a stronger performance in Europe  sending shares of the company higher in morning trading.",
        "date": "05082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's April global restaurant sales dip less than expected "
    },
    {
        "content": "May 8 McDonald's Corp's worldwide sales at established restaurants fell 0.6 percent in April as the fast-food giant fights to lure back customers and boost sales.",
        "date": "05082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-McDonald's April restaurant sales fall 0.6 pct "
    },
    {
        "content": "LOS ANGELES McDonald's new Chief Executive Steve Easterbrook is set to unveil his plan on Monday to revive growth as the world's largest hamburger chain struggles to win back consumers and investors.",
        "date": "05032015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's faces 'show me' moment with new CEO strategy "
    },
    {
        "content": "NEW YORK  May 1 Options traders appear poised for a big move in McDonald's Corp's shares as the world's biggest restaurant chain is set to unveil a much-awaited turnaround plan on Monday  and bullish bets have picked up in recent days.",
        "date": "05012015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's shares poised for big move; bullish bets rise "
    },
    {
        "content": "SHANGHAI Beijing authorities have fined U.S.-based J.R. Simplot's China processing unit  which supplies frozen french fries to McDonald's Corp  3.92 million yuan ($632 370) for water pollution  state media and Simplot said.",
        "date": "04302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's fries supplier fined in China for water pollution "
    },
    {
        "content": "SHANGHAI  April 30 Beijing authorities have fined U.S.-based J.R. Simplot's China processing unit  which supplies frozen french fries to McDonald's Corp  3.92 million yuan ($632 370) for water pollution  state media and Simplot said.",
        "date": "04302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's fries supplier fined in China for water pollution "
    },
    {
        "content": "LOS ANGELES  April 29 McDonald's Corp  working to revive sales in an era of mounting fast-food competition  is testing \"TasteCrafted \" a more modest version of a new custom sandwich program that will cost franchisees less to install and can be offered through drive-thru windows  an analyst said on Wednesday.",
        "date": "04292015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's tests custom burger program with drive-thru option "
    },
    {
        "content": "CHICAGO  April 28 Tyson Foods Inc  the largest U.S. poultry producer  plans to eliminate the use of human antibiotics in its chicken flocks by September 2017 - one of the most aggressive timelines yet set by an American poultry company.",
        "date": "04282015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-Tyson Foods plans to cut human antibiotics in U.S. chicken flocks by 2017 "
    },
    {
        "content": " ",
        "date": "05042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 4-McDonald's reset to change structure  cut costs  boost franchises "
    },
    {
        "content": "SHANGHAI U.S. food firm OSI Group LLC [OSIGP.UL] has cut 340 jobs at its embattled Shanghai plant  which supplied McDonald's Corp and Yum Brands Inc  bringing the facility close to shutdown  the firm said in a statement on its website on Monday.",
        "date": "04302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "OSI cuts 340 workers from embattled Shanghai plant  shutdown looms "
    },
    {
        "content": "LOS ANGELES  April 29 McDonald's Corp  working to revive U.S. sales amid fierce competition  is testing \"TasteCrafted \" a more modest version of its custom sandwich program that will cost franchisees less to install and can be offered through drive-thru windows.",
        "date": "04292015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's tests custom burger program with drive-thru option "
    },
    {
        "content": "CHICAGO Tyson Foods Inc  the largest U.S. poultry producer  plans to eliminate the use of human antibiotics in its chicken flocks by September 2017 - one of the most aggressive timelines yet set by an American poultry company.",
        "date": "04282015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Tyson Foods plans to cut human antibiotics in U.S. chicken flocks by 2017 "
    },
    {
        "content": "McDonald's Corp's  new chief executive officer said on Monday he would reorganize business units  sell restaurants to franchisees and cut costs in a bid to turn the fast-food chain into a \"modern  progressive burger company.\" | Video ",
        "date": "05042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's reset to change structure  cut costs  boost franchises "
    },
    {
        "content": "SHANGHAI  Sept 22 U.S. food firm OSI Group LLC  has cut 340 jobs at its embattled Shanghai plant  which supplied McDonald's Corp and Yum Brands Inc   bringing the facility close to shutdown  the firm said in a statement on its website on Monday.",
        "date": "04302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-OSI cuts 340 workers from embattled Shanghai plant  shutdown looms "
    },
    {
        "content": "May 4 McDonald's new chief executive's turnaround plan for the fast-food chain included specific financial fixes  but left investors and analysts craving a clear strategy to win back diners and boost sales.",
        "date": "05042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's CEO turnaround plan's missing link: customers "
    },
    {
        "content": "* Indexes end higher: Dow 0.26 pct  S&P 0.29 pct  Nasdaq 0.23 pct   (Updates to close)",
        "date": "05042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall Street ends on upbeat earnings from Berkshire  Cognizant "
    },
    {
        "content": "* Indexes up: Dow 0.4 pct  S&P 0.4 pct  Nasdaq 0.4 pct   (Updates to mid-afternoon)",
        "date": "05042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall St higher as Berkshire leads finance stocks "
    },
    {
        "content": "* Indexes up: Dow 0.3 pct  S&P 0.3 pct  Nasdaq 0.3 pct   (Updates to early afternoon)",
        "date": "05042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall St higher led by health  finance stocks "
    },
    {
        "content": " ",
        "date": "05042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "REUTERS BUSINESS NEWS SCHEDULE AT 1500 GMT/11 AM ET "
    },
    {
        "content": "* Indexes up: Dow 0.4 pct  S&P 0.4 pct  Nasdaq 0.5 pct   (Adds details  changes comment  updates prices)",
        "date": "05042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall St higher as healthcare rebound continues "
    },
    {
        "content": "* Indexes up: Dow 0.5 pct  S&P 0.5 pct  Nasdaq 0.5 pct   (Updates to open)",
        "date": "05042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall St opens higher ahead of U.S. factory data "
    },
    {
        "content": "LOS ANGELES  April 22 As McDonald's Corp  prepares yet another plan to revive its business  company watchers have the following advice: reconnect with lower income consumers who remain faithful to the brand  improve wages and ease the financial burden on operators.",
        "date": "04232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "RPT-McDonald's recipe for success may need focus on consumers  workers "
    },
    {
        "content": "LOS ANGELES  April 22 As McDonald's Corp  prepares yet another plan to revive its business  company watchers have the following advice: reconnect with lower income consumers who remain faithful to the brand  improve wages and ease the financial burden on operators.",
        "date": "04222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's recipe for success may need focus on consumers  workers "
    },
    {
        "content": "U.S. stocks ended stronger on Wednesday as Visa's potential expansion into China and talk of a turnaround at McDonald's helped investors look beyond a mixed bag of quarterly earnings.",
        "date": "04222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Stocks end stronger as investors look beyond mixed earnings "
    },
    {
        "content": "* Indexes close up: Dow 0.49 pct  S&P 0.51 pct  Nasdaq 0.42 pct",
        "date": "04222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Stocks end stronger as investors look beyond mixed earnings "
    },
    {
        "content": "April 22 U.S. stocks ended stronger on Wednesday as Visa Inc's potential expansion into China and talk of a turnaround at McDonald's Corp helped investors see the bright side of mixed quarterly earnings.",
        "date": "04222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS SNAPSHOT-Wall St finishes higher  helped by Visa and McDonald's "
    },
    {
        "content": "April 22 U.S. stocks rose in afternoon trading on Wednesday as Visa's potential expansion into China and talk of a turnaround at McDonald's helped investors see the bright side of mixed quarterly earnings.",
        "date": "04222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-US STOCKS-Stocks gain as investors eye bright side of mixed earnings "
    },
    {
        "content": "McDonald's Corp's  new chief executive officer  who is charged with reinvigorating world's biggest restaurant chain  on Wednesday said he would deliver his turnaround plan next month. | Video ",
        "date": "04222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to develop new turnaround plan as sales fall again "
    },
    {
        "content": "April 22 McDonald's Corp's new chief executive officer  who is charged with reinvigorating world's biggest restaurant chain  on Wednesday said he would deliver his turnaround plan next month.",
        "date": "04222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 3-McDonald's to develop new turnaround plan as sales fall again "
    },
    {
        "content": "A slew of Dow 30 companies report results in the week: Chemicals conglomerate DuPont  industrial conglomerate United Technologies Corp  property and casualty insurer Travelers Companies Inc and wireless carrier Verizon Communications Inc on Tuesday; McDonald's Corp  AT&T Inc  Boeing Co and Coca-Cola Co on Wednesday; and diversified manufacturer 3M Co  Procter & Gamble and Microsoft Corp on Thursday. While DuPont is expected to report lower first-quarter results  Travelers Companies Inc's first-q",
        "date": "04172015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 1-What to Watch in the Week Ahead and on Monday  April 20 "
    },
    {
        "content": "* Indexes up: Dow 0.3 pct  S&P 0.3 pct  Nasdaq 0.2 pct   (Updates to early afternoon)",
        "date": "04222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall St up in afternoon trading; Visa  MasterCard jump "
    },
    {
        "content": "TOKYO The Japanese unit of McDonald's Corp  forecast deeper losses this year and said it would renovate 2 000 stores while closing underperforming outlets  as it struggles to bring back customers after a series of food safety scandals.",
        "date": "04162015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's Japan sees wider losses this year  plans restructuring "
    },
    {
        "content": "* Plans store renovations and closures to aid business recovery",
        "date": "04162015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's Japan sees wider losses this year  plans restructuring "
    },
    {
        "content": "TOKYO  April 16 The Japanese unit of McDonald's Corp said on Thursday it expects its losses to widen this year as it struggles to bring back customers after a series of food safety scandals.",
        "date": "04162015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Japan sees wider losses this year after food scandals "
    },
    {
        "content": "LOS ANGELES McDonald's Corp's  relations with its U.S. franchisees have hit a fresh low as the fast-food giant's new chief executive fights to turn around its domestic business amid fierce competition  according to a survey released Wednesday.",
        "date": "04152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's relations with franchisees hit new low: survey "
    },
    {
        "content": "LOS ANGELES Carolin Wood  an artist and graduate student from Brooklyn's trendy Greenpoint neighborhood  has a secret that she keeps from her husband and some foodie friends. Once a month  she takes her two young children to McDonald's for inexpensive breakfasts or ice cream.",
        "date": "04132015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Mom sneaks kids to Mickey D’s amid fast-food backlash  won’t tell Dad "
    },
    {
        "content": "LOS ANGELES  April 15 McDonald's Corp's  relations with its U.S. franchisees have hit a fresh low as the fast-food giant's new chief executive fights to turn around its domestic business amid fierce competition  according to a survey released Wednesday.",
        "date": "04152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's relations with franchisees hit new low-survey "
    },
    {
        "content": "April 15 Tens of millions of dollars and counting. That's how much the Service Employees International Union (SEIU) has spent so far on a three-year campaign to improve the plight of low-wage retail and fast-food workers  an analysis of public filings shows.",
        "date": "04152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "RPT-INSIGHT-Union spends big on low-wage campaign  endgame unclear "
    },
    {
        "content": "SHANGHAI  April 11 Dimmed lights and colonial-style balconies give little indication that trendy Shanghai eatery Atto Primo is part of global fast-food giant Yum Brands Inc  owner of the KFC and Pizza Hut brands.",
        "date": "04132015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-Yum's upmarket China diner seeks recipe for revival "
    },
    {
        "content": "Tens of millions of dollars and counting. That's how much the Service Employees International Union (SEIU) has spent so far on a three-year campaign to improve the plight of low-wage retail and fast-food workers  an analysis of public filings shows.",
        "date": "04152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Union spends big on low-wage campaign  endgame unclear "
    },
    {
        "content": "April 15 Tens of millions of dollars and counting. That's how much the Service Employees International Union (SEIU) has spent so far on a three-year campaign to improve the plight of low-wage retail and fast-food workers  an analysis of public filings shows.",
        "date": "04152015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "INSIGHT-Union spends big on low-wage campaign  endgame unclear "
    },
    {
        "content": "LOS ANGELES Carolin Wood  an artist and graduate student from Brooklyn's trendy Greenpoint neighborhood  has a secret that she keeps from her husband and some foodie friends. Once a month  she takes her two young children to McDonald's for inexpensive breakfasts or ice cream.",
        "date": "04102015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Mom sneaks kids to Mickey D’s amid fast-food backlash  won’t tell Dad "
    },
    {
        "content": "April 6 Domino's Pizza Inc will need to raise the minimum wage to get the \"right people\" to stay competitive  the pizza chain's chief executive said on Monday  less than a week after McDonald's Corp said it plans to raise the minimum wage for its U.S. workers.",
        "date": "04062015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Domino's Pizza will have to raise wages to stay competitive - CEO "
    },
    {
        "content": "NEW YORK/LOS ANGELES  April 2 McDonald's Corp's  announcement that it will raise the average pay at its company-operated U.S. restaurants threatens to complicate an ongoing labor dispute that turns on whether McDonald's can be held responsible for the labor violations of  its franchisees.",
        "date": "04022015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's wage plan renews debate on independence of franchisees "
    },
    {
        "content": "BRUSSELS European Union antitrust regulators have asked Luxembourg for information on its tax rulings for McDonald's after labor unions accused the U.S. fast food chain of avoiding taxes  a person involved in the issue said on Tuesday.",
        "date": "03312015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "EU regulators query Luxembourg on McDonald's tax deals: source "
    },
    {
        "content": "LOS ANGELES McDonald's Corp  plans to raise the average pay of about 90 000 U.S. workers to around $10 an hour  but the increase will not benefit workers at the vast majority of the restaurants  because they are operated by franchisees  who make their own wage decisions.",
        "date": "04012015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's raising average worker wage to about $10 an hour "
    },
    {
        "content": "LOS ANGELES McDonald's Corp  plans to raise the average pay of about 90 000 U.S. workers to around $10 an hour  but the increase will not benefit workers at the vast majority of the restaurants  because they are operated by franchisees  who make their own wage decisions.",
        "date": "04022015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's raising average worker wage to about $10 an hour "
    },
    {
        "content": "A series of National Labor Relations Board cases that seek to hold McDonald's Corp liable for alleged labor violations by its franchisees began Monday  the start of a long process that will likely signal a profound shift for U.S. businesses.",
        "date": "03312015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "NLRB joint employer cases against McDonald's set to begin "
    },
    {
        "content": "LOS ANGELES  April 1 McDonald's Corp  plans to raise the average pay of about 90 000 U.S. workers to around $10 an hour  but the increase will not benefit workers at the vast majority of the restaurants  because they are operated by franchisees  who make their own wage decisions.",
        "date": "04012015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 4-McDonald's raising average worker wage to about $10 an hour "
    },
    {
        "content": "LOS ANGELES  April 1 McDonald's Corp  plans to raise the average pay of about  90 000 U.S. workers to around $10  the fast-food giant said on Wednesday  but the move will not affect workers at the vast majority of the restaurants  which are operated by franchisees.",
        "date": "04012015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Corp raising average worker wage to around $10 "
    },
    {
        "content": "FRANKFURT  March 30 McDonald's Corp is introducing table service in Germany as it reinvents itself as a \"modern  progressive burger company\" under new Chief Executive Steve Easterbrook  it said on Monday.",
        "date": "03302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's starts table service in Germany "
    },
    {
        "content": "SAN FRANCISCO  April 1 McDonald's Corp  plans to raise U.S. restaurant workers' pay by more than 10 percent and tack on benefits such as paid vacations  the Wall Street Journal cited a senior executive as saying on Wednesday.",
        "date": "04012015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to hike restaurant workers' salaries by over 10 pct -WSJ "
    },
    {
        "content": "April 1 McDonald's Corp :  * Raising hourly pay to $10 by end of 2016 - CNBC citing DJ  * Source: (http://on.wsj.com/19Gquj3)  * For more news  please click here",
        "date": "04012015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "BRIEF-McDonald's raising hourly pay to $10 by end of 2016 - CNBC citing DJ "
    },
    {
        "content": "FRANKFURT  March 30 McDonald's Corp is introducing table service in Germany as it reinvents itself as a \"modern  progressive burger company\" under new Chief Executive Steve Easterbrook.",
        "date": "03302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's starts table service in Germany "
    },
    {
        "content": "TOKYO  March 25 The Japanese unit of McDonald's Corp said it will announce its full-year outlook in mid-April after postponing its usual annual forecast amid a series of food safety scandals  according to people who attended an annual general meeting of shareholders on Wednesday.",
        "date": "03252015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Japan to announce outlook in mid-April "
    },
    {
        "content": "LONDON British bikes-to-car parts retailer Halfords  said on Monday it had appointed an executive of burger firm McDonald's  to be its new boss.",
        "date": "03232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "New Halfords boss swaps burgers for bikes and car parts "
    },
    {
        "content": "LONDON  March 23 British bikes-to-car parts retailer Halfords said on Monday it had appointed an executive of burger firm McDonald's to be its new boss.",
        "date": "03232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-New Halfords boss swaps burgers for bikes and car parts "
    },
    {
        "content": "LONDON  March 23 Halfords  the bikes-to-car parts retailer  said on Monday it had appointed Jill McDonald as its new chief executive with effect from May 11.",
        "date": "03232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UK retailer Halfords names McDonald's executive as new boss "
    },
    {
        "content": "SAO PAULO  March 18 Brazilian unions on Wednesday filed another lawsuit against the largest operator of McDonald's restaurants in Latin America  alleging that the firm violates the country's labor laws.",
        "date": "03182015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Brazilian unions file 2nd lawsuit against McDonald's operator "
    },
    {
        "content": "March 16 McDonald's restaurant workers from 19 U.S. cities said on Monday they have filed 28 health and safety complaints with federal and state regulators  alleging hazardous working conditions that led to severe burns from hot grills and fryer oil.",
        "date": "03162015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's workers claim hazardous conditions in 19 U.S. cities "
    },
    {
        "content": "SHANGHAI From cut-price apple pies to free iPads  companies in China are transforming Sunday's dreaded consumer rights day into a shopping frenzy  to blunt the impact of being named and shamed in state broadcaster CCTV's annual expose. | Video ",
        "date": "03132015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Apple pies and iPads sweeten China's dreaded TV expose "
    },
    {
        "content": "March 16 McDonald's Corp restaurant workers from 19 U.S. cities complained to regulators on Monday that their working conditions are hazardous and have led to severe burns from hot grills and fryer oil.",
        "date": "03162015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's workers claim hazardous conditions in 19 U.S. cities "
    },
    {
        "content": "LOS ANGELES/CHICAGO KFC  the world's largest chain of fried chicken restaurants  may face pressure from consumer and environmental groups to change how its poultry are raised after McDonald's Corp said it would switch to chicken raised without human antibiotics. | Video ",
        "date": "03122015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "KFC faces pressure after McDonald's says no antibiotics in chicken "
    },
    {
        "content": "LOS ANGELES/CHICAGO  March 12 KFC  the world's largest chain of fried chicken restaurants  may face pressure from consumer and environmental groups to change how its poultry are raised after McDonald's Corp said it would switch to chicken raised without human antibiotics.",
        "date": "03122015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "RPT - INSIGHT-KFC faces pressure after McDonald's says no antibiotics in chicken "
    },
    {
        "content": "CHICAGO/LOS ANGELES McDonald's Corp's decision last week to phase out human antibiotics from its U.S. chicken supply will add to costs of production in a tight-margin business that are likely to be borne mostly by poultry companies.",
        "date": "03082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Chicken growers set to pay price for no-antibiotic McNugget "
    },
    {
        "content": "CHICAGO/LOS ANGELES  March 8 McDonald's Corp's  decision last week to phase out human antibiotics from its U.S. chicken supply will add to costs of production in a tight-margin business that are likely to be borne mostly by poultry companies.",
        "date": "03082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "INSIGHT-Chicken growers set to pay price for no-antibiotic McNugget "
    },
    {
        "content": "McDonald's Corp  on Monday vowed to remake itself as a \"modern  progressive burger company\" after aggressive competition from Chipotle Mexican Grill Inc   Chick-fil-A and myriad \"better burger\" chains bit into U.S. restaurant sales last month. | Video ",
        "date": "03092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's vows 'modern' makeover amid U.S. sales struggle "
    },
    {
        "content": "CHICAGO/LOS ANGELES McDonald's Corp's decision last week to phase out human antibiotics from its U.S. chicken supply will add to costs of production in a tight-margin business that are likely to be borne mostly by poultry companies. | Video ",
        "date": "03092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Chicken growers set to pay price for no-antibiotic McNugget "
    },
    {
        "content": "March  9 McDonald's Corp on Monday vowed to remake itself as a \"modern  progressive burger company\" after aggressive competition from Chipotle Mexican Grill Inc  Chick-fil-A and myriad \"better burger\" chains bit into U.S. restaurant sales last month.",
        "date": "03092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's vows 'modern' makeover amid U.S. sales struggle "
    },
    {
        "content": "* Indexes up: Dow 0.4 pct  S&P 500 0.2 pct  Nasdaq 0.1 pct   (Updates to market open)",
        "date": "03092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall St gains  M&A provides a lift "
    },
    {
        "content": "* Futures up: Dow 12 pts  S&P 3 pts  Nasdaq 8.5 pts   (Updates trading  adds McDonald's sales)",
        "date": "03092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Futures point to flat open after recent decline "
    },
    {
        "content": "March  9 McDonald's Corp's worldwide sales at established restaurants fell 1.7 percent in February as sales in the United States were hurt by \"aggressive competitive activity\".",
        "date": "03092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's February restaurant sales down 1.7 pct "
    },
    {
        "content": "CHICAGO/LOS ANGELES  March 9 McDonald's Corp's  decision last week to phase out human antibiotics from its U.S. chicken supply will add to costs of production in a tight-margin business that are likely to be borne mostly by poultry companies.",
        "date": "03092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "RPT - INSIGHT-Chicken growers set to pay price for no-antibiotic McNugget "
    },
    {
        "content": "A plan by McDonald's Corp to phase out chicken raised with certain kinds of antibiotics at its 14 000 U.S. restaurants will put additional pressure on an already-stressed supply chain.",
        "date": "03052015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's antibiotic-free move could prompt U.S. chicken squeeze "
    },
    {
        "content": "LOS ANGELES/CHICAGO March 4 McDonald's Corp's  U.S. restaurants will gradually stop buying chicken raised with antibiotics vital to fighting human infections  the most aggressive step by a major food company to change chicken producers' practices in the fight against dangerous 'superbugs.'",
        "date": "03042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's USA to phase out human antibiotics from chicken supply "
    },
    {
        "content": "March 4 A plan by McDonald's Corp to phase out chicken raised with certain kinds of antibiotics at its 14 000 U.S. restaurants will put additional pressure on an already-stressed supply chain.",
        "date": "03052015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "REFILE-McDonald's antibiotic-free move could prompt U.S. chicken squeeze "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 04 (Fitch) Fitch Ratings has affirmed the Issuer Default Ratings  (IDRs) of McDonald's Corporation (NYSE: MCD) at 'A/F1'. The Rating Outlook has  been revised to Negative from Stable.  At Dec. 31  2014  McDonald's had approximately $15 billion of total debt. A full  list of ratings is provided at the end of this release. Negative Outlook: The Outlook revision is due to persistently weak global same-store sales (SSS)   dec",
        "date": "03042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Fitch Affirms McDonald's IDRs at 'A/F1'; Outlook Revised to Negative "
    },
    {
        "content": "MUMBAI  Feb 27 The firm behind Cafe Coffee Day  India's biggest homegrown coffee chain  is set for a market debut that could value it at almost $1 billion  even as the country's burgeoning cafe culture draws global giants Starbucks  and McDonald's.",
        "date": "02272015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Coffee's hot as IPO could value India's Cafe Coffee Day at $1 bln "
    },
    {
        "content": "LONDON Labor unions and a charity accused fast food chain McDonald's  of avoiding around 1 billion euros ($1.1 billion) in tax between 2009 and 2013 by routing revenues through a Luxembourg unit and called on the European Commission to investigate.",
        "date": "02252015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Unions  charity accuse McDonald's of avoiding $1.1 billion in tax "
    },
    {
        "content": "LONDON  Feb 25 Labour unions and a charity accused fast food chain McDonald's of avoiding around 1 billion euros ($1.1 billion) in tax between 2009 and 2013 by routing revenues through a Luxembourg unit and called on the European Commission to investigate.",
        "date": "02252015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-Unions  charity accuse McDonald's of avoiding 1 bln euros in tax "
    },
    {
        "content": "LONDON  Feb 25 Labour unions and a charity accused fast food chain McDonald's of avoiding around 1 billion euros ($1.1 billion) in tax between 2009 and 2013 by routing revenues through a Luxembourg unit and called on the European Commission to investigate.",
        "date": "02252015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Unions  charity accuse McDonald's of avoiding 1 bln euros in tax "
    },
    {
        "content": "RIO DE JANEIRO Brazilian unions have filed a lawsuit alleging that the largest operator of McDonald's restaurants in Latin America violates Brazil's labor laws  a case that could lead to fines of up to 30 percent of annual sales.",
        "date": "02242015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Brazil unions sue McDonald's operator on pay  rules "
    },
    {
        "content": "RIO DE JANEIRO  Feb 24 Brazilian unions have filed a lawsuit alleging that the largest operator of McDonald's restaurants in Latin America violates Brazil's labor laws  a case that could lead to fines of up to 30 percent of annual sales.",
        "date": "02242015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-Brazil unions sue McDonald's operator on pay  rules "
    },
    {
        "content": "RIO DE JANEIRO  Feb 24 Brazilian unions have filed suit alleging that the largest operator of McDonald's restaurants in Latin America violates Brazil's labor laws  a case that could lead to fines of up to 30 percent of annual sales.",
        "date": "02242015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-Brazil unions sue McDonald's operator on pay  rules "
    },
    {
        "content": "TORONTO  Feb 17 Restaurant Brands International Inc  the parent of Burger King and Canadian coffee and doughnut chain Tim Hortons  reported robust quarterly sales growth on Tuesday  crediting new menu items for driving traffic.",
        "date": "02172015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "UPDATE 4-New menu items help drive Burger King  Tim Hortons sales jump "
    },
    {
        "content": "Feb 13 Union pension fund adviser CtW Investment Group on Friday demanded in a letter to key McDonald's Corp  directors that the struggling fast-food chain follow up its recent chief executive officer replacement with a turnover of its board.",
        "date": "02142015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's needs to shake up board  union fund adviser says "
    },
    {
        "content": "-- Note: Reuters has not verified this story and does not vouch for its accuracy",
        "date": "02142015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "MEDIA-McDonald's shareholder group calls for changes to Board of Directors - WSJ "
    },
    {
        "content": "NEW YORK  Feb 12 Hedge fund manager Larry Robbins on Thursday called fast food restaurant McDonald's Corp  a \"uniquely interesting opportunity\" thanks to a new chief executive and a board that he expects will become more focused over the coming months.",
        "date": "02122015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Hedge fund Glenview's Robbins lists McDonald's as a favorite pick "
    },
    {
        "content": "McDonald's Corp  on Monday reported a steeper-than-expected drop in January sales at established restaurants and pinned a big portion of the blame on the after-effects of food safety scandals in China and Japan.",
        "date": "02092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's January sales dragged down by China  Japan "
    },
    {
        "content": "MUMBAI McDonald's Corp is cutting the amount of calories and salt on its Indian menu as it fights to hold on to customers in a rapidly growing developing market where newer  healthier fast-food options are just starting to catch on.",
        "date": "02102015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's India cuts salt  calories in burgers and fries "
    },
    {
        "content": "Feb 9 McDonald's Corp on Monday reported a steeper-than-expected drop in January sales at established restaurants and pinned a big portion of the blame on the after-effects of food safety scandals in China and Japan.",
        "date": "02092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's January sales dragged down by China  Japan "
    },
    {
        "content": "MUMBAI  Feb 10 McDonald's Corp is cutting the amount of calories and salt on its Indian menu as it fights to hold on to customers in a rapidly growing developing market where newer  healthier fast-food options are just starting to catch on.",
        "date": "02102015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED-McDonald's India cuts salt  calories in burgers and fries "
    },
    {
        "content": "Feb 9 McDonald's Corp's worldwide same-restaurant sales fell a steeper-than-expected 1.8 percent in January  as the company fights to win back diners around the world and shake off the after-effects of a supplier scandal in China.",
        "date": "02092015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's January worldwide sales fall more than expected "
    },
    {
        "content": "TOKYO The Japanese unit of McDonald's Corp  booked its first annual operating loss since going public in 2001 and its January sales plunged by a record 39 percent as food safety scandals drove customers away.",
        "date": "02052015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's Japan pushed into loss by food safety woes "
    },
    {
        "content": "* Food safety scandals mean tough task to recover reputation   (Add Chief Executive Casanova quote)",
        "date": "02052015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's Japan pushed into loss by food safety woes "
    },
    {
        "content": "TOKYO  Feb 5 The Japanese unit of McDonald's Corp posted its first annual operating loss since since going public in 2001  battered by a string of food safety scandals and a shortage of french fries.",
        "date": "02052015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Japan posts first operating loss since 2001 listing "
    },
    {
        "content": "TOKYO  Feb 5 The Japanese unit of McDonald's Corp is likely to post a second straight year of losses in 2015 as it grapples with the fallout from food safety scandals and a french fry shortage  exacerbating headaches for a global brand struggling to appeal to consumers.",
        "date": "02042015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's Japan set for more earnings pain after food safety scandals "
    },
    {
        "content": "MOSCOW McDonald's Corp.  will open fewer new restaurants in Russia this year than last because a fall in the ruble has increased expansion costs and is hurting consumers  its Russian chief executive Khamzat Khasbulatov told Reuters.",
        "date": "02022015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's to slow Russia expansion due to fall in ruble "
    },
    {
        "content": "MOSCOW  Jan 31 McDonald's Corp. will open fewer new restaurants in Russia this year than last because a fall in the rouble has increased expansion costs and is hurting consumers  its Russian chief executive Khamzat Khasbulatov told Reuters.",
        "date": "01312015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to slow Russia expansion due to fall in rouble "
    },
    {
        "content": "LOS ANGELES McDonald's Corp  franchisees have an urgent order for the fast-food giant's new CEO - get back-to-basics. In interviews  franchisees and advisors to restaurant owners say they hope the new chief will shrink its huge menu to concentrate on burgers and fries. ",
        "date": "01302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's franchisees to new CEO: back-to-basics  fast "
    },
    {
        "content": "LOS ANGELES  Jan 30 McDonald's Corp  franchisees have an urgent order for the fast-food giant's new CEO - get back-to-basics. In interviews  franchisees and advisors to restaurant owners say they hope the new chief will shrink its huge menu to concentrate on burgers and fries.",
        "date": "01302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's franchisees to new CEO: back-to-basics  fast "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 29 (Fitch) Trending much wider since last year  credit default  swap (CDS) spreads for McDonald's Corporation could actually reverse course in  light of some surprising news today  according to Fitch Solutions in its latest  CDS Case Study Snapshot. Five-year CDS on McDonald's have been trending wider since September 2014 and  are now 142% wider compared levels seen this time last year.  After pricing  historically in-",
        "date": "01292015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "Fitch Solutions: CEO Exit Could Aid McDonald's Much Wider CDS "
    },
    {
        "content": "Jan 28 McDonald's Corp said Don Thompson would retire as its chief executive and be replaced by Steve Easterbrook  effective March 1.",
        "date": "01282015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's CEO Don Thompson to retire "
    },
    {
        "content": "LOS ANGELES  Jan 30 McDonald's franchisees have a fast order for the fast food giant's new CEO - get back to basics. In interviews franchisees and advisors to restaurant owners say they hope the new chief will clean up a huge menu to focus on burgers and fries.",
        "date": "01302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED (OFFICIAL)-RPT-McDonald's franchisees to new CEO: back-to-basics  fast "
    },
    {
        "content": "LOS ANGELES  Jan 30 McDonald's franchisees have a fast order for the fast food giant's new CEO - get back to basics. In interviews franchisees and advisors to restaurant owners say they hope the new chief will clean up a huge menu to focus on burgers and fries.",
        "date": "01302015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "CORRECTED (OFFICIAL)-McDonald's franchisees to new CEO: back-to-basics  fast "
    },
    {
        "content": "McDonald's Corp   fresh off one of its worst financial years in decades  on Wednesday said Chief Executive Officer Don Thompson would leave at the end of February and be succeeded by Chief Brand Officer Steve Easterbrook. | Video ",
        "date": "01292015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's CEO Don Thompson leaving after tumultuous run "
    },
    {
        "content": "Jan 28 McDonald's Corp said Chief Executive Don Thompson would retire at the end of February and be succeeded by Steve Easterbrook  the company's chief brand officer.",
        "date": "01282015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 1-McDonald's CEO Don Thompson to retire "
    },
    {
        "content": "Jan 28 McDonald's Corp  fresh off one of its worst financial years in decades  on Wednesday said Chief Executive Officer Don Thompson would leave at the end of February and be succeeded by Chief Brand Officer Steve Easterbrook.",
        "date": "01292015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 3-McDonald's CEO Don Thompson leaving after tumultuous run "
    },
    {
        "content": "Jan 28 McDonald's Corp  fresh off one of its worst financial years in decades  on Wednesday said Chief Executive Officer Don Thompson would leave at the end of February and be succeeded by Chief Brand Officer Steve Easterbrook.",
        "date": "01292015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-McDonald's CEO Don Thompson leaving after tumultuous run "
    },
    {
        "content": "Former McDonald's Corp workers in Virginia filed a civil rights lawsuit Thursday against the world's largest fast-food chain and owner of restaurants where they worked in the latest bid to hold it legally responsible for the actions of its franchisees.",
        "date": "01222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Former McDonald's workers in Virginia file civil rights lawsuit "
    },
    {
        "content": "Jan 22 Former McDonald's Corp workers in Virginia filed a civil rights lawsuit Thursday against the world's largest fast-food chain and owner of restaurants where they worked in the latest bid to hold it legally responsible for the actions of its franchisees.",
        "date": "01222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 2-Former McDonald's workers in Virginia file civil rights lawsuit "
    },
    {
        "content": "Jan 22 Former McDonald's Corp workers in Virginia on Thursday filed a civil rights lawsuit against the world's largest fast-food chain and the owner of restaurants where they worked in the latest bid to hold the chain legally responsible for the actions of its franchisees.",
        "date": "01222015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's workers in Virginia file civil rights lawsuit "
    },
    {
        "content": "McDonald's Corp  warned on Friday that business will be weak in the first half of 2015 and it is cutting its annual construction budget to the lowest in more than five years as it opens fewer restaurants in struggling markets.",
        "date": "01232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's says rough ride to continue into 2015 "
    },
    {
        "content": "* Dow  S&P 500 down 0.3 pct  Nasdaq up 0.1 pct   (Updates to market open)",
        "date": "01232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Wall St dips on earnings  but set to end week strong "
    },
    {
        "content": "Jan 23 McDonald's Corp warned on Friday that business will be weak in the first half of 2015 and it is cutting its annual construction budget to the lowest in more than five years as it opens fewer restaurants in struggling markets.",
        "date": "01232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "UPDATE 3-McDonald's says rough ride to continue into 2015 "
    },
    {
        "content": "Jan 23 McDonald's Corp  the world's biggest restaurant chain  reported a 7.3 percent fall in quarterly sales as it struggled to recover from a food scandal in China and battled tough competition in the United States.",
        "date": "01232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's quarterly sales fall 7 pct "
    },
    {
        "content": "* Futures up: Dow 38 pts  S&P 4 pts  Nasdaq 5.75 pts   (Updates prices  adds McDonald's)",
        "date": "01232015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "US STOCKS-Futures gain after rally  indexes set for strong week "
    },
    {
        "content": "Jan 8 McDonald's Corp will cut 63 jobs at its corporate headquarters as part of a plan to reduce costs by $100 million as it looks to increase sales and reverse traffic declines in its major markets.",
        "date": "01082015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "McDonald's to cut 63 headquarters jobs in cost reduction "
    },
    {
        "content": "TOKYO McDonald's Japan  has apologized to customers and vowed to ensure product safety after objects including a tooth and plastic were found in its food  the latest trouble for a fast-food chain hit by sliding sales and a shortage of french fries.",
        "date": "01072015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCD",
        "title": "McDonald's Japan apologizes after tooth  plastic found in food "
    },
    {
        "content": "SHANGHAI  Jan 7 U.S. food supplier OSI Group LLC  which came under fire in China last year over allegations it used out-of-date meat  has criticised the handling of the case by the local food regulator  a rare act in China where firms are usually careful not to openly challenge the authorities.",
        "date": "01072015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "U.S. supplier in China food scare takes aim at Shanghai regulator "
    },
    {
        "content": "SHANGHAI Food and drug safety in China is \"grim\" and will get stronger oversight  the food and drug regulator said on Wednesday  after a series of scares last year hit the reputations of global firms such as McDonald's Corp and Wal-Mart Stores Inc.",
        "date": "01072015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "China regulator to strengthen 'grim' food  drug safety control "
    },
    {
        "content": "SHANGHAI  Jan 7 Food and drug safety in China is \"grim\" and will get stronger oversight  the food and drug regulator said on Wednesday  after a series of scares last year hit the reputations of global firms such as McDonald's Corp  and Wal-Mart Stores Inc.",
        "date": "01072015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "China regulator to strengthen \"grim\" food  drug safety control "
    },
    {
        "content": "CARACAS  Jan 6 Venezuelan fast-food lovers are mourning the disappearance of McDonald's golden staple: the french fry.",
        "date": "01062015",
        "name": "McDonald&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCD",
        "title": "Venezuelans not 'lovin' it' as McDonald's fries go scarce "
    }
]