[
    {
        "content": "LONDON  June 1 The European Union's markets regulator has fined Moody's 1.24 million euros ($1.4 million) for failing to give investors sufficient information about how ratings on major institutions such as the EU were compiled.",
        "date": "06012017",
        "name": "Moody&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCO",
        "title": "UPDATE 1-EU watchdog fines Moody's for credit ratings breaches "
    },
    {
        "content": "NEW YORK Moody's Corp  has agreed to pay nearly $864 million to settle with U.S. federal and state authorities over its ratings of risky mortgage securities in the run-up to the 2008 financial crisis  the U.S. Department of Justice said on Friday.",
        "date": "01142017",
        "name": "Moody&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCO",
        "title": "Moody's pays $864 million to U.S.  states over pre-crisis ratings "
    },
    {
        "content": "NEW YORK  Jan 13 Moody's Corp has agreed to pay nearly $864 million to settle with U.S. federal and state authorities over its ratings of risky mortgage securities in the run-up to the 2008 financial crisis  the U.S. Department of Justice said on Friday.",
        "date": "01142017",
        "name": "Moody&#39;s Corporation",
        "news_type": "normal",
        "symbol": "MCO",
        "title": "UPDATE 1-Moody's pays $864 million to U.S.  states over pre-crisis ratings "
    },
    {
        "content": "* Petrobras Strategy Director Nelson Silva says Moodys upgrade reflects improving risk perception about the Brazilian oil producer",
        "date": "10212016",
        "name": "Moody&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCO",
        "title": "BRIEF-Petrobras says Moodys upgrade reflects improved risk perception "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  August 03 (Fitch) Fitch Ratings has published Moody's Corporation's  (MCO) Long-Term Issuer Default Rating (LT IDR) and specific senior unsecured  issue ratings of 'BBB+'  and its Short-Term (ST) IDR of 'F2'. In addition  Fitch  has published a first-time 'F2' rating of MCO's commercial paper (CP) program.  The Rating Outlook is Stable. See the complete list of ratings at the end of  this release. As of June 30  2016  Moody's ",
        "date": "08032016",
        "name": "Moody&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCO",
        "title": "Fitch Publishes Moody's 'F2' CP Rating  'BBB+' LT IDR and 'F2' ST IDR "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  April 28 (Fitch) Fitch Ratings has revised the Rating Outlook on Dun &  Bradstreet Corporation (DNB) to Negative from Stable and affirmed the Issuer  Default Rating (IDR) at 'BBB'. A full list of ratings follows at the end of this  release.  Fitch's action follows DNB's announcement that it intends to acquire Dun &  Bradstreet Credibility Corporation (DBCC) for approximately $320 million in  cash.  The transaction is expected ",
        "date": "04282015",
        "name": "Moody&#39;s Corporation",
        "news_type": "topStory",
        "symbol": "MCO",
        "title": "Fitch Revises Dun & Bradstreet's Outlook to Negative; Affirms IDR at 'BBB' "
    }
]