[
    {
        "content": "* Indexes up: Dow 0.03 pct  S&P 0.10 pct  Nasdaq 0.23 pct (Updates to open)",
        "date": "10312017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "US STOCKS-Mondelez  tech stocks lift S&P  Nasdaq "
    },
    {
        "content": "Mondelez International Inc  beat Wall Street's profit and revenue estimates in the third quarter as demand for its key brands such as Oreo cookies and Trident gum rose in Europe and Latin America and the company cut costs.",
        "date": "10302017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Oreo maker Mondelez's results beat on gains from Europe  Latin America "
    },
    {
        "content": "* Mondelēz International names Glen Walter EVP and President  North America",
        "date": "10252017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelēz International names Glen Walter EVP And President  North America "
    },
    {
        "content": "Oct 30 Mondelez International Inc beat Wall Street's profit and revenue estimates in the third quarter as demand for its key brands such as Oreo cookies and Trident gum rose in Europe and Latin America and the company cut costs.",
        "date": "10302017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Oreo maker Mondelez's results beat on gains from Europe  L.America "
    },
    {
        "content": "* Q3 earnings per share view $0.54 -- Thomson Reuters I/B/E/S",
        "date": "10302017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelēz International reports Q3 earnings per share of $0.65 "
    },
    {
        "content": "Oct 30 Mondelez International Inc on Monday reported a 2.1 pct rise in net revenue in the third quarter as demand for key brands such as Oreos and Trident gum rose in Latin America and Europe.",
        "date": "10302017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Oreo maker Mondelez's revenue rises 2 pct "
    },
    {
        "content": "* Pershing Square Capital Management​ files amended 13-D ownership filing to say it owns about 5.6 pct stake in Mondelez as of Sept 25 - SEC filing",
        "date": "09272017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Pershing Square says it owns about 5.6 pct stake in Mondelez as of Sept 25 "
    },
    {
        "content": "* Mondelez -  the size of board of directors will be increased from 13 to 14 members and Van De Put will fill the resulting vacancy‍​ Source text: (http://bit.ly/2fvbhqj) Further company coverage:",
        "date": "09282017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez says board size will be increased from 13 to 14 members "
    },
    {
        "content": "LONDON  Sept 22 Pladis  the Turkish company that owns Godiva chocolate and McVitie's biscuits  is considering making an offer for Nestle's U.S. confectionery assets  which could be valued at around $2 billion  as part of its international expansion plans.",
        "date": "09222017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Turkey's Pladis eyeing Nestle's US candy amid expansion plan "
    },
    {
        "content": "A federal appeals court on Thursday upheld the dismissal of a patent infringement case Mondelez International Inc brought against rival food company Kellogg Co.",
        "date": "09082017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Kellogg defeats Mondelez in cookie-packaging patent fight "
    },
    {
        "content": "NEW YORK Trian Partners cut its stake in snack maker Mondelez International Inc. during the last quarter  and boosted its shares in conglomerate General Electric  according to the activist fund's latest securities filing.",
        "date": "08112017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Trian cuts Mondelez stake  ups GE holding: SEC filing "
    },
    {
        "content": "NEW YORK  Aug 11 Trian Partners cut its stake in snack maker Mondelez International Inc. during the last quarter  and boosted its shares in conglomerate General Electric   according to the activist fund's latest securities filing.",
        "date": "08112017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Trian cuts Mondelez stake  ups GE holding -SEC filing "
    },
    {
        "content": "* Trian Fund Management cuts share stake in Mondelez International Inc by 3.9 percent to 42.5 million shares - SEC filing",
        "date": "08112017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Trian Fund Management cuts share stake in Mondelez International "
    },
    {
        "content": "Mondelez International Inc  on Wednesday named the head of Canadian frozen foods maker McCain Foods to succeed its long-time chief as the snack firm battles declining profits and activist investors.",
        "date": "08022017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Outsider replaces long-time CEO at Oreo cookie maker Mondelez "
    },
    {
        "content": "Aug 2 Mondelez International Inc on Wednesday named the head of Canadian frozen foods maker McCain Foods to succeed its long-time chief as the snack firm battles declining profits and activist investors.",
        "date": "08022017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "REFILE-UPDATE 3-Outsider replaces long-time CEO at Oreo cookie maker Mondelez "
    },
    {
        "content": "* Mondelēz International reports Q2 results and increases quarterly dividend",
        "date": "08022017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelēz International Q2 earnings per share $0.32 "
    },
    {
        "content": "* Dirk Van de Put to become CEO of Mondelēz International as long-time CEO Irene Rosenfeld retires",
        "date": "08022017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Dirk Van de Put to become CEO of Mondelēz International "
    },
    {
        "content": "Aug 2 Oreo cookies maker Mondelez International Inc said it appointed Dirk Van de Put  the current chief executive of Canadian frozen food maker McCain Foods  to succeed Irene Rosenfeld as the company's chief executive from November 2017.",
        "date": "08022017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez appoints Dirk Van de Put to succeed Irene Rosenfeld as CEO "
    },
    {
        "content": "July 6 Mondelez International Inc  the world's second-largest confectionary company  said its second-quarter revenue growth would be reduced by 3 percent due to the recent global cyber attack  sending its shares down slightly in extended trading.",
        "date": "07062017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "UPDATE 1-Mondelez 2nd-qtr revenue growth hit by global cyber attack "
    },
    {
        "content": "Mondelez International Inc   the world's second-largest confectionary company  said its second-quarter revenue growth would be reduced by 3 percent due to the recent global cyber attack  sending its shares down slightly in extended trading.",
        "date": "07072017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez 2nd-qtr revenue growth hit by global cyber attack "
    },
    {
        "content": "ZURICH  June 27 Food group Mondelez International said employees in different regions were experiencing technical problems but it was unclear whether this was due to a cyberattack.",
        "date": "06272017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez says has tech problems  unclear if from cyberattack "
    },
    {
        "content": "* Port terminals operated by Maersk disrupted (Adds Breakingviews  Insider links)",
        "date": "06282017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 1-New computer virus spreads from Ukraine to disrupt world business "
    },
    {
        "content": "FRANKFURT/MOSCOW/KIEV A new cyber virus spread from Ukraine to wreak havoc around the globe on Wednesday  crippling thousands of computers  disrupting ports from Mumbai to Los Angeles and halting production at a chocolate factory in Australia.",
        "date": "06282017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "New computer virus spreads from Ukraine to disrupt world business "
    },
    {
        "content": "* Port terminals operated by Maersk disrupted (Adds details on source of virus  Kremlin comment)",
        "date": "06282017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "WRAPUP 3-New computer virus spreads from Ukraine to disrupt world business "
    },
    {
        "content": "FRANKFURT/MOSCOW/KIEV  June 28 A cyber attack wreaked havoc around the globe on Wednesday  crippling thousands of computers  disrupting operations at ports from Mumbai to Los Angeles and halting production at a chocolate factory in Australia.",
        "date": "06282017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "WRAPUP 2-Major cyber attack disrupts businesses around world "
    },
    {
        "content": "CHICAGO/NEW YORK  June 16 Amazon.com Inc's proposed purchase of high-end food retailer Whole Foods Market Inc for $13.7 billion hammered share prices of food and retail companies on Friday as the proven retail disruptor stepped boldly into another consumer space.",
        "date": "06162017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Amazon-Whole Foods deal hits shares across the food chain "
    },
    {
        "content": "* Mondelēz International opens newest research and development hub in Poland",
        "date": "06072017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelēz International opens new R&D hub in Poland "
    },
    {
        "content": "* Pershing Square Capital Management cuts sole share stake in Mondelez to 19.9 million share from 22.9 million shares - SEC filing",
        "date": "05152017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Pershing Square Capital Management cuts sole share stake in Mondelez "
    },
    {
        "content": "* Agrees renewed relationship with Mondelēz International for strategic global partnership for Cadbury cake",
        "date": "05082017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Premier Foods says renews partnership with Mondelez International "
    },
    {
        "content": "* Mondelez International - Company's biscuits business posted slight revenue decline in Q1 as strong growth in the U.K.  Japan  Italy was offset by weakness in the U.S.",
        "date": "05022017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez expects weakness in North American business to continue in Q2 "
    },
    {
        "content": "Mondelez International Inc  reported higher-than-expected quarterly profit and sales  helped by cost cuts  strong sales of its chocolate brands such as Cadbury Dairy Milk and Milka  and better product pricing mainly in Latin America.",
        "date": "05022017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez's results beat on better pricing  cost cuts "
    },
    {
        "content": "* Q1 Latin America revenue rises 11.4 pct (Adds details  background  updates shares)",
        "date": "05022017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Mondelez's results beat on better pricing  cost cuts "
    },
    {
        "content": "May 2 Mondelez International Inc  the world's second-largest confectionary company  reported a higher-than-expected quarterly profit  helped by its cost-saving programs and stronger sales in Latin America.",
        "date": "05022017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez profit beats on lower costs; higher Latin America sales "
    },
    {
        "content": "* Q1 earnings per share view $0.50 -- Thomson Reuters I/B/E/S",
        "date": "05022017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelēz International Q1 adjusted earnings per share $0.53 "
    },
    {
        "content": "* Dean Foods Co says co  Kraft Macaroni & Cheese announced strategic collaboration Source text for Eikon: Further company coverage:",
        "date": "04172017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Dean foods Co and Kraft Macaroni & Cheese announce strategic collaboration "
    },
    {
        "content": "Mondelez International Inc  is preparing to look for a successor to Chief Executive Officer Irene Rosenfeld as the snack maker faces shareholder pressure and a broad shift to healthier eating habits  the Wall Street Journal reported  citing sources.",
        "date": "04092017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez lays groundwork to replace its CEO: WSJ "
    },
    {
        "content": "April 9 Mondelez International Inc is preparing to look for a successor to Chief Executive Officer Irene Rosenfeld as the snack maker faces shareholder pressure and a broad shift to healthier eating habits  the Wall Street Journal reported  citing sources.",
        "date": "04092017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez lays groundwork to replace its CEO -WSJ "
    },
    {
        "content": "LONDON Unilever  promised shareholders a multi-billion euro rewards package on Thursday after February's $143 billion takeover offer from Kraft Heinz jolted it into a corporate makeover aimed at proving it can go it alone.",
        "date": "04062017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Galvanised by Kraft  Unilever keeps shareholders sweet with cash "
    },
    {
        "content": "* Mondelez International is preparing to look for a successor to its CEO Irene Rosenfeld- WSJ citing sources",
        "date": "04092017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez is preparing to look for a successor to its CEO Rosenfeld- WSJ citing sources "
    },
    {
        "content": "* Combining foods/refreshment businesses into one organization (Adds comments  background)",
        "date": "04062017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 5-Galvanised by Kraft  Unilever keeps shareholders sweet with cash "
    },
    {
        "content": "* CEO Irene Rosenfeld's total compensation for 2016 was $16.7 million versus $19.7 million in 2015 - SEC filing",
        "date": "03282017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez CEO Irene Rosenfeld's total compensation for 2016 was $16.7 mln "
    },
    {
        "content": "March 23 Hershey Co and the trust that control it disclosed on Thursday they would fill positions on their respective boards following a year marked by an acquisition overture from Mondelez International Inc and a series of resignations.",
        "date": "03232017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Hershey and its trust tap new board members "
    },
    {
        "content": "* Mondelez files for mixed shelf offering; amount not disclosed - SEC filing  Source text: (http://bit.ly/2ljzEN8) Further company coverage:",
        "date": "03022017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez files for mixed shelf offering "
    },
    {
        "content": "LONDON  Feb 27 U.S. food company Kraft Heinz  is not targeting any other large deals for now after being snubbed by Unilever because valuations in the sector are too high  major shareholder Warren Buffett told CNBC news on Monday.",
        "date": "02272017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Buffett says no backup deal for Kraft after Unilever snub - CNBC "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 01 (Fitch) Fitch Ratings has assigned a 'BBB' rating to the new  $1.5 billion 364-day facility being issued by Mondelez International  Inc.  (Mondelez).  The Rating Outlook is Stable. Fitch also affirmed its Long-Term Issuer Default  Rating Rating and Short-Term IDR at 'BBB'/F2'. A full list of rating actions  follows at the end of this release. Mondelez has secured a new $1.5 billion 364-day credit facility due February ",
        "date": "03012017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Fitch Rates Mondelez's $1.5B 364-Day Facility 'BBB' "
    },
    {
        "content": "* On March 1  entered into revolving credit agreement for 364-day senior unsecured revolving credit facility in amount of $1.5 billion",
        "date": "03012017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez enter into revolving credit agreement "
    },
    {
        "content": "* Sees no strategic rationale to combine with Kraft   (Adds share price and valuation details)",
        "date": "02242017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Kraft's shock bid triggers Unilever focus on short-term value "
    },
    {
        "content": "Feb 24 Kraft Heinz's bid has jolted Unilever into focusing more on delivering on its strategy in the short-term  the Anglo-Dutch company's finance chief said on Friday.",
        "date": "02242017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "CORRECTED-UPDATE 1-Kraft's shock bid triggers Unilever focus on short-term value "
    },
    {
        "content": "LONDON  Feb 24 Unilever said the shock of Kraft Heinz's opportunistic approach had jolted it to re-examine its strategy  and all aspects of the consumer goods giant's business were up for review to increase shareholder value.",
        "date": "02242017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Unilever says Kraft's shock bid to spur focus on short-term value "
    },
    {
        "content": "* Follows rejection of $143 bln Kraft takeover bid   (Adds detail from statements  banker quote  investor quote  background  adds bullet points  updates shares)",
        "date": "02222017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Unilever spurred into speedy value review by Kraft bid "
    },
    {
        "content": "LONDON  Feb 22 Anglo-Dutch consumer goods group Unilever said it was reviewing its options to increase shareholder value  just days after it swiftly rejected a surprise $143 billion takeover bid from Kraft Heinz.",
        "date": "02222017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Fresh from fending off Kraft  Unilever to review strategy "
    },
    {
        "content": "LONDON  Feb 20 Kraft Heinz's dropped bid to buy Unilever is the third-largest M&A deal to collapse  according to Thomson Reuters data  adding to a recent run of failures that highlights the appetite for the pursuit of audacious mega-mergers.",
        "date": "02212017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "RPT-Collapse of Kraft-Unilever tie-up extends run of failed mega-deals "
    },
    {
        "content": "LONDON  Feb 20 Kraft Heinz's dropped bid to buy Unilever is the third-largest M&A deal to collapse  according to Thomson Reuters data  adding to a recent run of failures that highlights the appetite for the pursuit of audacious mega-mergers.",
        "date": "02202017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Collapse of Kraft-Unilever tie-up extends run of failed mega-deals "
    },
    {
        "content": "LONDON  Feb 19 British Prime Minister Theresa May has asked top officials to examine U.S. food company Kraft Heinz's proposed takeover of Unilever Plc  the Financial Times reported on Sunday without citing any sources.",
        "date": "02192017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "UK PM May orders officials to examine Kraft Heinz bid for Unilever -FT "
    },
    {
        "content": "MILAN  Feb 20 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "02202017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "European shares seen up; eyes on Unilever as Kraft walks away. For more see the LiveMarkets blog "
    },
    {
        "content": "* Dow down 0.27 pct  S&P down 0.15 pct  Nasdaq up 0.08 pct   (Updates to early afternoon)",
        "date": "02172017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "US STOCKS-Wall St rally cools as banks  energy stocks weigh "
    },
    {
        "content": "WELLINGTON  Feb 16 International food giant Mondelez International Inc said on Thursday it plans to shut its Dunedin Cadbury factory and shift production to neighbouring Australia  which takes most of New Zealand's chocolate output.",
        "date": "02162017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez International to close NZ Cadbury factory "
    },
    {
        "content": "* Mondelez - Imports from Mexico represent minority of U.S.  revenue  profit. Will not adjust operations until concrete policies on border tax are in place - conf call",
        "date": "02072017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez says it will not adjust Mexico operations until concrete border tax policies are in place "
    },
    {
        "content": "Mondelez International Inc   the maker of Oreo cookies and Cadbury chocolates  reported lower-than-expected holiday-quarter sales and profit due to a strong dollar that eroded the value of sales outside the United States.",
        "date": "02072017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Oreo maker Mondelez's sales  profit miss estimates "
    },
    {
        "content": "Feb 7 Mondelez International Inc  the maker of Oreo cookies and Cadbury chocolates  reported lower-than-expected holiday-quarter sales and profit due to a strong dollar that eroded the value of sales outside the United States.",
        "date": "02072017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Oreo maker Mondelez's sales  profit miss estimates "
    },
    {
        "content": "Feb 7 Mondelez International Inc  the maker of Oreo cookies and Cadbury chocolates  reported an 8.1 percent fall in its holiday-quarter sales as a strong dollar eroded the value of sales from markets outside the United States.",
        "date": "02072017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Oreo maker Mondelez reports 8.1 pct fall in quarterly sales "
    },
    {
        "content": "* Expects organic net revenue to increase at least 1 percent in 2017 and adjusted operating income margin in mid-16 percent range",
        "date": "02072017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondel\u007fz International Q4 adjusted EPS $0.47 "
    },
    {
        "content": "Jan 30 Billionaire investor William Ackman's Pershing Square Capital Management has raised its stake in snack maker Mondelez to 6.4 percent.",
        "date": "01302017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Ackman's Pershing Square raises Mondelez stake "
    },
    {
        "content": "* Pershing Square Capital Management Lp reports 6.4 percent stake in Mondelez International Inc as of Jan 27 - SEC filing",
        "date": "01302017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Pershing Square Capital Management reports 6.4 pct stake in Mondelez International "
    },
    {
        "content": "SYDNEY Canadian dairy company Saputo Inc said on Monday it will make an all-cash takeover offer for the 12 percent of Australia's Warrnambool Cheese and Butter it does not already own  valuing the company at A$682 million ($515 million).",
        "date": "01302017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Canada's Saputo seeks to mop up Australia's Warrnambool Cheese and Butter "
    },
    {
        "content": "SYDNEY After more than 90 years  the popular Australian Vegemite brand is coming home.",
        "date": "01192017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Vegemite comes home to Australia under Bega-Mondelez deal "
    },
    {
        "content": "* Vegemite returns to local ownership for first time since 1926",
        "date": "01192017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Vegemite comes home to Australia under Bega-Mondelez deal "
    },
    {
        "content": "Jan 19 CSL Ltd drove gains in the Australian benchmark on Thursday  surging after it upgraded its annual profit guidance  while materials and financials also added to the uptrend.",
        "date": "01192017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Australia shares rise as CSL surges  materials gain; NZ flat "
    },
    {
        "content": "Jan 18 Mondelez International Inc said it will sell its most of its grocery business in Australia and New Zealand  including the Vegemite brand  to Australian dairy manufacturer Bega Cheese Ltd for A$460 million ($345.28 million).",
        "date": "01182017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "CORRECTED-Mondelez to sell Vegemite brand to Bega Cheese "
    },
    {
        "content": "The federal judge in charge of a patent dispute over water flavorings between Kraft Foods and TC Heartland refused on Thursday to put the case on hold while the U.S. Supreme Court considers whether it was filed in the wrong jurisdiction.",
        "date": "01172017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Judge proceeds with Kraft patent case while Supreme Court weighs venue "
    },
    {
        "content": "Mondelez International Inc  agreed to pay $13 million to settle U.S. Securities and Exchange Commission charges that its Cadbury unit violated a federal anti-bribery law through efforts to expand a chocolate plant in Baddi  India.",
        "date": "01092017",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez in $13 million SEC settlement tied to India payments "
    },
    {
        "content": "Jan 9 Candy and pet food conglomerate Mars Inc is buying veterinary hospital operator VCA Inc for $7.7 billion in a deal that will give the maker of Pedigree pet food an even bigger share of the $4 billion global pet healthcare market.",
        "date": "01092017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 3-Mars to buy pet healthcare provider VCA for $7.7 bln "
    },
    {
        "content": "Jan 9 Mondelez International Inc agreed to pay $13 million to settle U.S. Securities and Exchange Commission charges that its Cadbury unit violated a federal anti-bribery law through efforts to expand a chocolate plant in Baddi  India.",
        "date": "01092017",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "REFILE-Mondelez in $13 mln SEC settlement tied to India payments "
    },
    {
        "content": "Mondelez International Inc  has not heard from Kraft Heinz Co  about any potential acquisition  people familiar with the matter said on Wednesday  after Swiss magazine Bilanz reported that the latter was planning a bid.",
        "date": "12142016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez unaware of any Kraft Heinz approach: sources "
    },
    {
        "content": "BRUSSELS Nestle  has lost a tussle with rival Mondelez International  over the validity of its EU trade mark for the shape of the Kit Kat chocolate biscuit bar in an EU court which said it should be re-examined.",
        "date": "12152016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Nestle loses EU Kit Kat trade mark tussle with Cadbury "
    },
    {
        "content": "CHICAGO (Reuters Breakingviews) - The Brazilian billionaires at 3G Capital that turned Kraft Heinz and Anheuser-Busch InBev into mega-acquisition machines will dive back into the buying business in the coming year. Their next target should be Mondelez  the $66 billion food conglomerate that failed to coax chocolate-maker Hershey into a sale in 2016. A deal will require some unusual ingredients.    3G - co-founded by banker-turned-beer-magnate Jorge Paulo Lemann - gobbled up Heinz for $28 billion",
        "date": "12152016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "3G will take another bite of Corporate America "
    },
    {
        "content": "* Mondel\u007fz international calls for redemption of 2.250% notes due 2019",
        "date": "11162016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondel\u007fz International says calls for redemption of 2.250% notes due 2019 "
    },
    {
        "content": "* Jana Partners LLC takes sole share stake of 111 127 shares in Sage Therapeutics Inc",
        "date": "11142016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Jana Partners cuts sole share stake in Alphabet  takes sole share stake in Mondelez International "
    },
    {
        "content": "* Mondel\u007fz International updates its sustainable palm oil action plan",
        "date": "11102016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondel\u007fz International updates its sustainable palm oil action plan "
    },
    {
        "content": "SAO PAULO  Nov 8 3G Capital Inc  the buyout firm controlled by Brazilian billionaire financier Jorge Paulo Lemann  is raising between $8 billion and $10 billion to finance an acquisition of a global consumer goods firm  a Brazil-based blog said on Tuesday.",
        "date": "11082016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 1-3G Capital raising up to $10 bln for takeover  blog says "
    },
    {
        "content": "* Mondel\u007fz International announces early participation results of its cash tender offer; increases the maximum amount",
        "date": "10312016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondel\u007fz International announces early participation results of its cash tender offer "
    },
    {
        "content": "Oct 28 Mondelez International Inc said on Friday it is recalling certain batches of two varieties of Oreo Fudge Cremes sold in the United States as their ingredient lists do not mention milk allergen.",
        "date": "10282016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez recalls two flavors of Oreo Fudge Cremes in U.S. "
    },
    {
        "content": "* Expects full-yr capex to be at low end of $265 mln-$275 mln",
        "date": "10282016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 3-Hershey profit beats estimates on U.S. demand  lower ad spending "
    },
    {
        "content": "* S2g Biochem announces collaboration with Mondelez International for new sweetener process",
        "date": "10272016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-S2G Biochem to collaborate with Mondelez for new sweetener process "
    },
    {
        "content": "* Mondelez - EMEA market dynamics down in Q3  especially in  Middle East as Gulf states  Saudi Arabia deal with pressures due to persistent low oil prices - conf call",
        "date": "10262016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez sees continued weak demand from Middle East markets over next few qtrs - conf call "
    },
    {
        "content": "* Mondelez International announces  pricing of notes offering",
        "date": "10202016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez International announces  pricing of notes offering "
    },
    {
        "content": "Mondelez International Inc's  quarterly profit handily beat estimates  helped by cost cuts  and the Cadbury chocolate maker raised its profit forecast for the year  sending its shares up as much as 4.6 percent on Wednesday.",
        "date": "10262016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Oreo maker Mondelez reins in costs  raises profit forecast "
    },
    {
        "content": "Oct 26 Mondelez International Inc's  quarterly profit handily beat estimates  helped by cost cuts  and the Cadbury chocolate maker raised its profit forecast for the year  sending its shares up as much as 4.6 percent on Wednesday.",
        "date": "10262016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Oreo maker Mondelez reins in costs  raises profit forecast "
    },
    {
        "content": "* Q3 earnings per share view $0.43 -- Thomson Reuters I/B/E/S",
        "date": "10262016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondel\u007fz International posts Q3 earnings of $0.35/share "
    },
    {
        "content": "Oct 26 Mondelez International Inc  the maker of Oreo cookies and Cadbury chocolates  reported a 6.6 percent drop in quarterly revenue  largely due to deconsolidation of its Venezuelan operations.",
        "date": "10262016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Oreo maker Mondelez's revenue drops on Venezuela deconsolidation "
    },
    {
        "content": "* Mondelez - on Oct 14  entered into amended and restated revolving credit agreement for a five-year senior unsecured revolving credit facility for $4.5 billion",
        "date": "10172016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez - enters into five-year credit facility for $4.5 bln "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 28 (Fitch) Fitch Ratings has affirmed the Long-Term Issuer  Default Rating (IDR) for Mondelez International  Inc. (Mondelez) at 'BBB'. The  Rating Outlook has been revised to Stable from Negative. A full list of ratings  follows at the end of this release.  KEY RATING DRIVERS Increased Confidence in 2018 EBIT Margin Target of 17%-18%: The revision of the Outlook to Stable reflects Fitch's increased confidence in  Mon",
        "date": "09282016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Fitch Affirms Mondelez's IDR at 'BBB'; Outlook Revised to Stable "
    },
    {
        "content": "LONDON  Sept 26 A group of 40 investors managing $1.25 trillion in assets have launched a campaign to encourage 16 global food companies to change the way they source protein for their products to help to reduce environmental and health risks.",
        "date": "09262016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Investors urge food companies to shift from meat to plants "
    },
    {
        "content": "* Says to extend strategic supply partnership with Mondel\u007fz International in Belgium",
        "date": "09152016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Barry Callebaut to buy Mondelez chocolate plant in Belgium "
    },
    {
        "content": "* Mondelez international to invest $65 million in Global Research & Development hubs",
        "date": "09142016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez international to invest $65 million in Global Research & Development hubs "
    },
    {
        "content": "Sept 7 Mondelez International Inc  the maker of Oreo cookies and Cadbury chocolates  outlined on Wednesday its plans to expand in the United States  a week after abandoning its pursuit of U.S. confectioner Hershey Co.",
        "date": "09072016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez outlines U.S. growth plans after Hershey snub "
    },
    {
        "content": "* Completed  first phase of new partnerships with swisscontact  cargill and wahana visi indonesia to expand its cocoa life  in  indonesia  Source text for Eikon:  Further company coverage:",
        "date": "08302016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez International expands Cocoa Life in Indonesia "
    },
    {
        "content": "Mondelez International Inc   the maker of Oreo cookies and Cadbury chocolates  said it was no longer pursuing the acquisition of Hershey Co   two months after the U.S. chocolate company turned down its $23 billion cash-and-stock bid.",
        "date": "08292016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez abandons pursuit of U.S. chocolate maker Hershey "
    },
    {
        "content": "* Fed Vice Chairman Fischer says job market nearing full strength",
        "date": "08302016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "US STOCKS-Wall St set to open little changed "
    },
    {
        "content": "Aug 29 Mondelez International Inc said it was \"no longer pursuing\" the acquisition of Hershey Co   a month after the Pennsylvania Attorney General's office unveiled the terms of a reform deal with the trust that controls Hershey.",
        "date": "08292016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "CORRECTED-UPDATE 1-Oreo cookie maker Mondelez abandons bid for Hershey "
    },
    {
        "content": "Aug 12 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Friday:",
        "date": "08122016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON Mondelez International  is to buy the rights to sell Cadbury-branded biscuits from Britain's Burton's Biscuit Co in a bid to sell more and combine chocolate and biscuits in new products.",
        "date": "08122016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez to mix Cadbury chocolate and biscuits with Burton's deal "
    },
    {
        "content": "LONDON  Aug 12 Mondelez International  is to buy the rights to sell Cadbury-branded biscuits from Britain's Burton's Biscuit Co in a bid to sell more and combine chocolate and biscuits in new products.",
        "date": "08122016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 1-Mondelez to mix Cadbury chocolate and biscuits with Burton's deal "
    },
    {
        "content": "LONDON  Aug 12 Cadbury chocolate owner Mondelez International is to buy the licence to sell Cadbury branded biscuits around the world from Burton's Biscuit Co  the U.S. company said on Friday.",
        "date": "08122016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez to buy Cadbury biscuits licence from Burton's "
    },
    {
        "content": "* On conf call - have intensified focus on analysis of global cost structure and business model",
        "date": "07282016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Hershey on conf call- Know there's a lot of chatter about Mondelez offer  not going to comment further on the matter "
    },
    {
        "content": "CHICAGO Oreo maker Mondelez International Inc  is fighting back against aggressive rivals in North America after its share of the biscuit market there declined in the second quarter  the company said on Wednesday.",
        "date": "07272016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Oreo maker Mondelez fights North America biscuit rivals "
    },
    {
        "content": "CHICAGO  July 27 Oreo maker Mondelez International Inc is fighting back against aggressive rivals in North America after its share of the biscuit market there declined in the second quarter  the company said on Wednesday.",
        "date": "07272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 3-Oreo maker Mondelez fights North America biscuit rivals "
    },
    {
        "content": "July 27 Mondelez International Inc's  quarterly net revenue slumped nearly 18 percent  the 11th straight quarter of decline  as sales fell in markets outside North America.",
        "date": "07272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "CORRECTED-UPDATE 1-Oreo maker Mondelez's revenue falls for 11th straight quarter "
    },
    {
        "content": "LOS ANGELES  July 27 Mondelez International Inc  Chief Executive Irene Rosenfeld on Wednesday confirmed that the company made an offer to purchase Hershey Co.",
        "date": "07272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez CEO confirms made offer to purchase Hershey "
    },
    {
        "content": "* Q2 earnings per share view $0.40 -- Thomson Reuters I/B/E/S",
        "date": "07272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez Q2 adjusted earnings per share $0.44 "
    },
    {
        "content": "* Co and Mondelez International today announced they have finalized a partnership",
        "date": "07252016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Fox Networks Group and Mondelez International finalize a partnership "
    },
    {
        "content": "* With this addition  Mondel\u007fz International board will have 14 directors  13 of whom are independent",
        "date": "07222016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez International names Charles Bunch to board "
    },
    {
        "content": "July 27 Oreo cookie maker Mondelez International Inc's quarterly net revenue fell nearly 18 percent  the 11th straight quarter of decline  as a strong dollar eroded the value of sales from markets outside the United States.",
        "date": "07272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Oreo maker Mondelez's revenue falls for 11th straight quarter "
    },
    {
        "content": "* Mondelez International Inc says it will enter China's $2.8 bln chocolate market",
        "date": "07272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez to enter China's chocolate market "
    },
    {
        "content": "Oreo cookie maker Mondelez International Inc  is in talks to buy the license to make Cadbury biscuits from UK-based biscuit maker Burton's Biscuits Co  Sky News reported.",
        "date": "07202016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez in talks to buy Cadbury biscuits license from Burton's: Sky News "
    },
    {
        "content": "* Declared a regular quarterly dividend of $0.19 per share of class a common stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07192016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez International declares qtrly dividend of $0.19 per share "
    },
    {
        "content": "July 11 A member of the board of the charitable trust that controls Hershey Co has resigned  in a sign of turmoil at a time when the U.S. chocolate company has become an acquisition target for Mondelez International Inc.",
        "date": "07112016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Board member of trust that controls takeover target Hershey resigns "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "UPDATE 6-Hershey rejects $23 billion Mondelez takeover offer "
    },
    {
        "content": "A federal judge in Chicago on Monday refused to dismiss a lawsuit in which wheat futures and options traders accused Kraft Heinz Co and Mondelez International Inc  of illegally manipulating the grain's price at their expense.",
        "date": "06272016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Kraft  Mondelez must face wheat price-rigging lawsuit - U.S. judge "
    },
    {
        "content": "* Says Mondelez's interest in acquiring Hershey is credit negative",
        "date": "07012016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Moody's says Mondelez's interest in acquiring Hershey is credit negative "
    },
    {
        "content": "* Board of directors of the Hershey Company unanimously rejected preliminary  non-binding indication of interest from Mondelez Company",
        "date": "06302016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Hershey says board rejected preliminary  non-binding indication of interest from Mondelez "
    },
    {
        "content": "A federal judge in Chicago on Monday refused to dismiss a lawsuit in which wheat futures and options traders accused Kraft Heinz Co and Mondelez International Inc of illegally manipulating the grain's price at their expense.",
        "date": "06272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Kraft  Mondelez must face wheat price-rigging lawsuit: U.S. judge "
    },
    {
        "content": "* Mondelez-Hershey merger would be world's largest cocoa consumer",
        "date": "07012016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "RPT-Mondelez's move on Hershey sends shivers through cocoa market "
    },
    {
        "content": "Hershey Co  said on Thursday it had rejected a $23 billion takeover bid by Mondelez International Inc  that would seek to expand the latter's limited U.S. footprint and create the world's largest confectioner.",
        "date": "07012016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Hershey rejects $23 billion Mondelez takeover offer "
    },
    {
        "content": "* Mondelez bid $107 per share for Hershey in cash plus stock offer - CNBC  citing sources    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06302016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez bid $107 per share for Hershey in cash plus stock offer - CNBC "
    },
    {
        "content": "June 27 A federal judge in Chicago on Monday refused to dismiss a lawsuit in which wheat futures and options traders accused Kraft Heinz Co and Mondelez International Inc of illegally manipulating the grain's price at their expense.",
        "date": "06272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Kraft  Mondelez must face wheat price-rigging lawsuit - U.S. judge "
    },
    {
        "content": "June 27 A federal judge in Chicago on Monday rejected Kraft Heinz Co's and Mondelez International Inc's effort to dismiss a lawsuit in which wheat futures and options traders accused them of illegally manipulating the grain's price.",
        "date": "06272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "U.S. Judge says Kraft  Mondelez must face wheat price rigging lawsuit "
    },
    {
        "content": "* Mondelez-Hershey merger would be world's largest cocoa consumer",
        "date": "07012016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez's move on Hershey sends shivers through cocoa market "
    },
    {
        "content": "June 30 Mondelez International Inc  the maker of Oreo cookies and Cadbury chocolates  has made a takeover bid for Hershey Co  the Wall Street Journal reported. (http://on.wsj.com/297J3lL)",
        "date": "06302016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez makes takeover bid for Hershey-WSJ "
    },
    {
        "content": "* Breaks ground for new research & development center in Poland",
        "date": "06082016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez International to open research & development center in Poland "
    },
    {
        "content": "May 31 Oreo cookie maker Mondelez International Inc's \"Twist  Lick  Dunk\" mobile application has been such a success that the snack company plans to roll out similar games in a move away from traditional advertising to create its own content.",
        "date": "05312016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez to create more apps  online videos in advertising shift "
    },
    {
        "content": "* Mondelez International says \"we are aware of FDA's new nutrition labeling regulations and will be reviewing them in detail\"",
        "date": "05202016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez comments on FDA's new nutrition labeling regulations "
    },
    {
        "content": "* Mondelez International declares regular quarterly dividend of $0.17 per share  Source text for Eikon:  Further company coverage:",
        "date": "05182016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez declares regular qtrly dividend of $0.17/share "
    },
    {
        "content": "* CEO-  Brazil sales down in Q1 due to political and economic environment",
        "date": "04272016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez International CFO- There could be more opportunities like Eurazeo deal- conf call "
    },
    {
        "content": "Oreo cookies and Cadbury chocolate maker Mondelez International Inc  reported better-than-expected revenue and profit  as a mix of higher volumes and prices in certain markets  helped offset the impact of a strong dollar.",
        "date": "04272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Oreo maker Mondelez's earnings jump on higher volumes  prices "
    },
    {
        "content": "* Volumes up in Europe  N. America  Asia Pacific   (Adds details  updates shares)",
        "date": "04272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Oreo maker Mondelez's earnings jump on higher volumes  prices "
    },
    {
        "content": "* Mondelez International reports Q1 results and reaffirms 2016 outlook",
        "date": "04272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez International reports Q1 earnings $0.35/shr "
    },
    {
        "content": "April 27 Pinnacle Foods Inc appointed Mondelez International Inc's executive Mark Clouse as its chief executive officer.",
        "date": "04272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Pinnacle names Mondelez executive as CEO "
    },
    {
        "content": "April 27 Oreo cookies and Cadbury chocolate maker Mondelez International Inc's first-quarter net revenue fell slightly less than expected  as higher prices in certain markets helped offset the impact of a strong dollar.",
        "date": "04272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Oreo maker Mondelez's revenue falls less than expected "
    },
    {
        "content": "April 7 Oreo maker Mondelez International Inc  said it had entered into a partnership with Alibaba Group Holding Ltd to sell its products through the Chinese e-commerce giant's online marketplace to expand its reach in China.",
        "date": "04072016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez to sell Oreo  Cadbury products on Alibaba's Tmall "
    },
    {
        "content": "* Mondelez International launches strategic e-commerce partnership with Alibaba group",
        "date": "04072016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez International launches strategic e-commerce partnership with Alibaba "
    },
    {
        "content": "* Mondelez international inc says ceo irene rosenfeld's 2015 total compensation was $19.7 million versus $21 million in 2014",
        "date": "03282016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "BRIEF-Mondelez CEO Irene Rosenfeld's 2015 total compensation was $19.7 mln "
    },
    {
        "content": "BOSTON Billionaire investor William Ackman adjusted his battered hedge fund portfolio on Wednesday when he sold 20 million shares of snack maker Mondelez International   one day after another key holding  Valeant Pharmaceuticals   lost half of its value.",
        "date": "03172016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Ackman sells part of Mondelez stake  has no plans for other sales "
    },
    {
        "content": "BOSTON  March 16 Billionaire investor William Ackman told clients on Wednesday that his Pershing Square Capital Management has sold 20 million shares of Mondelez   a key holding  but has no plans to sell any other investments at this time  an investor in the fund said.",
        "date": "03162016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Ackman sells part of Mondelez stake  has no plans for other sales "
    },
    {
        "content": "Warren Buffett on Saturday used his annual letter to Berkshire Hathaway Inc  shareholders to launch vigorous defenses of an aggressive private equity partner and a maligned mobile home unit  as his conglomerate recorded robust profits.",
        "date": "02272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Warren Buffett defends 3G  touts economy in record year for Berkshire "
    },
    {
        "content": "Feb 27 Warren Buffett on Saturday used his annual letter to Berkshire Hathaway Inc shareholders to launch vigorous defenses of an aggressive private equity partner and a maligned mobile home unit  as his conglomerate recorded robust profits.",
        "date": "02272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Warren Buffett defends 3G  touts economy in record year for Berkshire "
    },
    {
        "content": "Feb 27 Warren Buffett on Saturday launched vigorous defenses of a private equity firm and a mobile home unit that critics say employ controversial business practices antithetical to Buffett's own at Berkshire Hathaway Inc .",
        "date": "02272016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Warren Buffett defends 3G  Clayton Homes as Berkshire profit grows "
    },
    {
        "content": "Mondelez International Inc  the maker of Oreo cookies  said it had received a Wells notice from the SEC in connection with a long-running investigation related to a factory in India that the company acquired when it bought Cadbury.",
        "date": "02192016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez served with Wells notice from SEC "
    },
    {
        "content": "Feb 19 Mondelez International Inc  the maker of Oreo cookies  said it had received a Wells notice from the SEC in connection with a long-running investigation related to a factory in India that the company acquired when it bought Cadbury.",
        "date": "02192016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 1-Mondelez served with Wells notice from SEC "
    },
    {
        "content": "Feb 19 Mondelez International Inc  the maker of Oreo cookies  said it had received a \"Wells\" notice from the SEC in connection with an investigation related to a facility in India that the company acquired when it bought Cadbury.",
        "date": "02192016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez served with \"Wells\" notice from SEC "
    },
    {
        "content": "NEW YORK/BOSTON  Feb 16 Top U.S. hedge fund management firms  including Visium Asset Management  took stakes in embattled renewable energy company SunEdison Inc  during the fourth quarter.",
        "date": "02162016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "HIGHLIGHTS-Hedge funds pile into SunEdison shares ahead of plunge "
    },
    {
        "content": "Oreo cookie maker Mondelez International Inc  forecast 2016 revenue growth below analysts' expectations  raising concerns about the company's ability to reverse a two-year slide in sales in a tough economic environment.",
        "date": "02032016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Oreo cookie maker Mondelez sales forecast disappoints "
    },
    {
        "content": "* Shares down as much as 9 pct   (Adds conference call  analyst comments  updates shares)",
        "date": "02032016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 3-Oreo cookie maker Mondelez sales forecast disappoints "
    },
    {
        "content": "Feb 3 Mondelez International Inc  the maker of Cadbury chocolates and Oreo cookies  reported a 16.6 percent fall in quarterly sales due to a strong dollar and the sale of a majority of its coffee business.",
        "date": "02032016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Cadbury maker Mondelez's 4th-qtr sales down 16.6 pct "
    },
    {
        "content": "Mondelez International Inc has agreed to pay $750 000  improve its product sourcing and testing  and hire a food quality auditor after failing to warn California shoppers that its Nabisco Ginger Snaps contained excessive levels of lead.",
        "date": "01232016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez settles with California over lead in Nabisco Ginger Snaps "
    },
    {
        "content": "Jan 22 Mondelez International Inc has agreed to pay $750 000  improve its product sourcing and testing  and hire a food quality auditor after failing to warn California shoppers that its Nabisco Ginger Snaps contained excessive levels of lead.",
        "date": "01232016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 1-Mondelez settles with California over lead in Nabisco Ginger Snaps "
    },
    {
        "content": "Jan 22 Mondelez International Inc has agreed to pay $750 000  improve its product sourcing and testing  and hire a food quality auditor after failing to warn California shoppers that its Nabisco Ginger Snaps contained excessive levels of lead.",
        "date": "01222016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez settles with California over lead in Nabisco Ginger Snaps "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 13 (Fitch) Fitch Ratings has assigned a 'BBB' rating to  Mondelez International  Inc.'s (Mondelez) issuance of EUR700 million 1.625%  senior unsecured notes due 2023. Proceeds will be used for general corporate  purposes  including refinancing a $1.75 billion 4.125% note due on Feb. 9  2016.  The customary change of control provision at 101% of face value is in place. The  Rating Outlook is Negative. KEY RATING DRIVERS",
        "date": "01132016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Fitch Rates Mondelez's EUR700MM Senior Unsecured Notes 'BBB' "
    },
    {
        "content": "Mondelez International Inc   the maker of Cadbury chocolates and Oreo cookies  said it would stop using eggs laid by caged hens for its products sold in the United States and Canada by 2020.",
        "date": "01152016",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Cadbury maker Mondelez to switch to cage-free eggs by 2020 in U.S. "
    },
    {
        "content": "Jan 15 Mondelez International Inc  the maker of Cadbury chocolates and Oreo cookies  said it would stop using eggs laid by caged hens for its products sold in the United States and Canada by 2020.",
        "date": "01152016",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Cadbury maker Mondelez to switch to cage-free eggs by 2020 in US "
    },
    {
        "content": "CARACAS The managers of Kraft Heinz's Venezuelan operations may be imprisoned if found committing \"sabotage\"  President Nicolas Maduro said on state television Tuesday night.",
        "date": "12022015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Venezuela President says may jail Heinz managers for 'sabotage' "
    },
    {
        "content": "CARACAS  Dec 1 The managers of Kraft Heinz's  Venezuelan operations may be imprisoned if found committing \"sabotage\"  President Nicolas Maduro said on state television Tuesday night.",
        "date": "12022015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Venezuela President says may jail Heinz managers for \"sabotage\" "
    },
    {
        "content": "Mondelez International Inc   the owner of the Cadbury chocolate brand  has hired bankers to explore the sale of a number of confectionery products including Terry's Chocolate Orange and Terry's All Gold  Sky News reported.",
        "date": "12012015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Cadbury owner looking to sell Terry's brand: Sky News "
    },
    {
        "content": "Dec 1 Mondelez International Inc  the owner of the Cadbury chocolate brand  has hired bankers to explore the sale of a number of confectionery products including Terry's Chocolate Orange and Terry's All Gold  Sky News reported.",
        "date": "12012015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 3-Cadbury owner looking to sell Terry's brand - Sky News "
    },
    {
        "content": "Dec 1 Mondelez International Inc  the owner of the Cadbury chocolate brand  has hired bankers to explore a sale of a number of confectionery products and assets in United Kingdom  France  Spain and the Netherlands  Sky News reported.",
        "date": "12012015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Cadbury owner looking to sell brands in Europe-Sky News "
    },
    {
        "content": "Mondelez International Inc   the maker of Cadbury chocolates and Oreo cookies  reported better-than-expected quarterly profit and revenue  helped by lower costs and higher organic sales in emerging markets.",
        "date": "10282015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Oreo cookies maker Mondelez's results beats estimates "
    },
    {
        "content": "Oct 28 Mondelez International Inc  the maker of Cadbury chocolates and Oreo cookies  reported better-than-expected quarterly profit and revenue  helped by lower costs and higher organic sales in emerging markets.",
        "date": "10282015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 1-Oreo cookies maker Mondelez's results beats estimates "
    },
    {
        "content": "Oct 28 Mondelez International Inc  the maker of Cadbury chocolates and Oreo cookies  reported an 18 percent fall in quarterly revenue  hurt by a strong dollar and lower sales in Europe  its largest market.",
        "date": "10282015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Cadbury maker Mondelez's net revenue falls 18 pct "
    },
    {
        "content": "The Securities and Exchange Commission is preparing to file civil charges against Oreo cookies maker Mondelez International Inc in connection with a long-running investigation of payments its Cadbury unit made in India  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "10132015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "SEC prepares civil charges against Mondelez in Cadbury probe: WSJ "
    },
    {
        "content": "Oct 13 The Securities and Exchange Commission is preparing to file civil charges against Oreo cookies maker Mondelez International Inc in connection with a long-running investigation of payments its Cadbury unit made in India  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "10132015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 1-SEC prepares civil charges against Mondelez in Cadbury probe-WSJ "
    },
    {
        "content": "Oct 13 The Securities and Exchange Commission is preparing to file civil charges against Oreo cookies maker Mondelez International Inc in connection with a long-running investigation of payments its Cadbury unit made in India  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "10132015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "SEC prepares civil charges against Mondelez in Cadbury probe-WSJ "
    },
    {
        "content": "LONDON/NEW YORK Mondelez International Inc  is exploring a sale of its European cheese and grocery business  which could be valued at around $3 billion  according to people familiar with the matter  as it sharpens its focus on snack foods and refreshments.",
        "date": "10012015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Exclusive - Mondelez seeks European cheese and grocery asset sale: sources "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 22 (Fitch) Fitch Ratings has assigned a 'BBB' rating to  Mondelez International  Inc.'s (Mondelez) issuance of CHF400 million in senior  unsecured fixed-rate notes in two tranches: a 98.5- month  CHF265 million note  with a 1.125% coupon maturing on Dec. 21  2023  and a 60-month CHF135 million  note with a 0.625% coupon maturing on Oct. 6  2020. Closing is expected in  October and proceeds will be used for general co",
        "date": "09222015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Fitch Rates Mondelez's CHF 400MM Sr. Unsec. Notes 'BBB' "
    },
    {
        "content": "* AB InBev will have to pay up to $130 bln including debt-analysts",
        "date": "09172015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 5-Brewer AB InBev seeks $275 bln tie-up with SABMiller "
    },
    {
        "content": "* AB InBev will have to pay up to $130 bln including debt-analysts",
        "date": "09162015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 4-Brewer AB InBev seeks $275 bln tie-up with SABMiller "
    },
    {
        "content": "ZURICH  Sept 15 Mondelez International  maker of candy including Cadbury and Matterhorn-shaped Toblerone  is looking to Indonesia and \"select countries\" in Latin America for future cocoa supply  the head of its European business said on Tuesday.",
        "date": "09152015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez is looking to Indonesia  Latin America for future cocoa supply "
    },
    {
        "content": "NEW YORK William Ackman  head of hedge fund firm Pershing Square Capital Management  said on Friday that stocks were cheap at current levels and that Mondelez International Inc  could be an acquisition target.",
        "date": "09112015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Pershing Square's Ackman tells CNBC Mondelez could be takeover target "
    },
    {
        "content": "NEW YORK  Sept 11 William Ackman  head of hedge fund firm Pershing Square Capital Management  said on Friday that stocks were cheap at current levels and that Mondelez International Inc could be an acquisition target.",
        "date": "09112015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Pershing Square's Ackman tells CNBC Mondelez could be takeover target "
    },
    {
        "content": "NEW YORK Snack maker Mondelez International Inc  will spend more on advertising its brands  increase healthier offerings and expand its e-commerce business to boost sales as consumers eat less processed food  an executive overseeing the company's growth strategy said.",
        "date": "09102015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez to boost ad spending  healthier offerings "
    },
    {
        "content": "Aug 12 Kraft Heinz Co said it will cut 2 500 jobs in the United States and Canada as part of its cost cutting initiatives following the creation of the company through the $46-billion merger of ketchup maker H.J. Heinz with Kraft Foods.",
        "date": "08122015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Kraft Heinz to cut 2 500 jobs in U.S.  Canada "
    },
    {
        "content": "Activist investor William Ackman has built a stake worth about $5.5 billion in Mondelez International Inc   the maker of Cadbury chocolate and Oreo cookies  in what is seen as an attempt to push the company to boost earnings or sell itself. | Video ",
        "date": "08062015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Investor Ackman takes $5.5 billion stake in Cadbury owner Mondelez "
    },
    {
        "content": "Aug 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "08072015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Aug 6 Activist investor William Ackman has built a stake worth about $5.5 billion in Mondelez International Inc   the maker of Cadbury chocolate and Oreo cookies  in what is seen as an attempt to push the company to boost earnings or sell itself.",
        "date": "08062015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 6-Investor Ackman takes $5.5 bln stake in Cadbury owner Mondelez "
    },
    {
        "content": "* Futures up: Dow 8 pts  S&P 1.25 pts  Nasdaq 6 pts   (Adds details  comment  updates prices)",
        "date": "08062015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "US STOCKS-Futures point to lackluster opening; jobs data awaited "
    },
    {
        "content": "Activist investor William Ackman has built a stake worth about $5.5 billion in Mondelez International Inc   the maker of Cadbury chocolate and Oreo cookies  in what is seen as an attempt to push the company to boost earnings or sell itself. | Video ",
        "date": "08072015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Investor Ackman takes $5.5 billion stake in Cadbury owner Mondelez "
    },
    {
        "content": "BOSTON/NEW YORK Billionaire investor William Ackman's success at Mondelez International Inc  may depend largely on a calculation that nimbler rival Kraft Heinz Co  will soon snap up the maker of Cadbury chocolate and Oreo cookies  sources familiar with Ackman's approach said.",
        "date": "08072015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Billionaire Ackman eyeing Mondelez reunion with Kraft: sources "
    },
    {
        "content": "BOSTON/NEW YORK  Aug 6 Billionaire investor William Ackman's success at Mondelez International Inc  may depend largely on a calculation that nimbler rival Kraft Heinz Co will soon snap up the maker of Cadbury chocolate and Oreo cookies  sources familiar with Ackman's approach said.",
        "date": "08072015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Billionaire Ackman eyeing Mondelez reunion with Kraft -sources "
    },
    {
        "content": "* Dow up 0.02 pct  S&P unchanged  Nasdaq up 0.38 pct   (Updates to early afternoon)",
        "date": "07302015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "US STOCKS-Wall St recovers as data points to growing economy "
    },
    {
        "content": "Mondelez International Inc   the maker of Cadbury chocolate and Oreo cookies  reported a better-than-expected quarterly profit  helped by lower costs and raised its share buyback plan by $6 billion.",
        "date": "07302015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez profit beats on lower costs  boosts buyback "
    },
    {
        "content": "* Shares hit record high of $45.22   (Adds details from conference call  updates shares)",
        "date": "07302015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Mondelez profit beats on lower costs  boosts buyback "
    },
    {
        "content": "July 2 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07022015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "July 2 Mondelez International Inc said it was in talks with multiple parties for the sale of French coffee brand Carte Noire to address European antitrust concerns as it closed a deal with D.E Master Blenders to create the world's biggest standalone coffee company.",
        "date": "07022015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez in talks with multiple parties to sell Carte Noire "
    },
    {
        "content": "* Thorntons shares jump over 40 percent to bid price   (Adds analysts  details  background  shares)",
        "date": "06222015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Ferrero to buy UK chocolate maker Thorntons for $178 mln "
    },
    {
        "content": "LONDON  June 19 (IFR) - HJ Heinz and Kraft Foods could be forced to rethink the currency composition of a jumbo bond financing as a combination of time pressure  rates and Greek volatility narrows its options.",
        "date": "06192015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Rough market could prompt Kraft Heinz rejig "
    },
    {
        "content": "MILAN  June 12 Italy's Lavazza has reached agreement to buy a Danish coffee brand from D.E. Master Blenders  the Dutch group which is seeking to comply with conditions set by the European competition authorities for approving its merger with Mondelez's coffee business.",
        "date": "06122015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Italy's Lavazza to buy D.E. Master Blenders' coffee brand Merrild "
    },
    {
        "content": "June 2 Kraft Foods Group Inc and Mondelez International Inc petitioned a judge to dismiss two counts in a case filed by the U.S. Commodity Futures Trading Commission that alleged the companies manipulated wheat prices.",
        "date": "06022015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Kraft seeks dismissal of two counts in wheat price manipulation case "
    },
    {
        "content": "NEW YORK  June 1 Scott Amoye  who ran Mondelez International Inc's cocoa business for five years  has joined Ecom in London  where the Switzerland-based commodity trader houses its cocoa and sugar trading operations  a spokesman confirmed to Reuters on Monday.",
        "date": "06012015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "MOVES-Amoye joins Ecom as global trading director from Mondelez "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 11 (Fitch) Fitch Ratings has affirmed the long-term Issuer Default  Rating (IDR) for Mondelez International  Inc. (Mondelez) at 'BBB' and removed it  from Rating Watch Negative.  Fitch has also affirmed the short-term IDR at 'F2'.  The Rating Outlook is Negative. A full list of ratings affirmed follows at the  end of this release. The removal from Rating Watch indicates Fitch's view that Mondelez's coffee  joint venture wit",
        "date": "05112015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Fitch Affirms Mondelez's IDRs at 'BBB/F2'; Outlook Negative "
    },
    {
        "content": "BRUSSELS The European Commission has approved a joint venture between Mondelez International  and D.E Master Blenders to create the world's biggest standalone coffee company on condition they sell some businesses first.",
        "date": "05052015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez  D.E Master Blenders coffee venture gets EU nod "
    },
    {
        "content": "BRUSSELS  May 5 The European Commission has approved a joint venture between Mondelez International  and D.E Master Blenders to create the world's biggest standalone coffee company on condition they sell some businesses first.",
        "date": "05052015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Mondelez  D.E Master Blenders coffee venture gets EU nod "
    },
    {
        "content": "BRUSSELS  May 5 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05052015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "EU mergers and takeovers (May 5) "
    },
    {
        "content": "April 29 Mondelez International Inc  reported a better-than-expected quarterly profit helped by cost cutting and price increases  as the maker of Cadbury chocolate and Oreo cookies seeks to boost margins amid slow growth in demand for packaged foods.",
        "date": "04292015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "UPDATE 3-Mondelez beat profit estimates  increases margins "
    },
    {
        "content": "Kraft Foods Group Inc   which is merging with ketchup maker H.J. Heinz Co [HJHC.UL]  on Tuesday reported profit that topped analyst estimates  driven by reduced advertising spending and overhead.",
        "date": "04282015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Kraft Foods quarterly profit falls 16 percent  but tops expectations "
    },
    {
        "content": "April 29 Cadbury chocolate and Oreo cookies maker Mondelez International Inc reported a 10.2 percent drop in quarterly net revenue as net revenue in Europe  its biggest market  fell for the third straight quarter.",
        "date": "04292015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez quarterly revenue drops 10.2 pct  Europe weak again "
    },
    {
        "content": "Kraft Foods Group Inc on Monday said it is revamping its family-friendly macaroni and cheese meal  removing synthetic colors and preservatives from the popular boxed dinner.",
        "date": "04202015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Kraft removing synthetic colors from iconic macaroni & cheese "
    },
    {
        "content": "NEW YORK  April 13 (IFR) - Allegations of fraud and manipulative trading by Kraft Foods in derivatives markets are garnering attention beyond the fact that a household food and beverage-maker has been thrust into a regulatory doghouse normally reserved for the world's largest banks.",
        "date": "04132015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "REFILE-Kraft case to test Dodd-Frank muscle "
    },
    {
        "content": "Kraft Foods Group Inc and Mondelēz International Inc are being sued in a proposed class action on behalf of wheat futures and options traders for allegedly manipulating the grain's price.",
        "date": "04102015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Kraft  Mondelēz wheat price manipulation hurt traders: U.S. lawsuit "
    },
    {
        "content": "MILAN Italy's Lavazza expects a decision on whether it will buy the Carte Noire coffee brand from Mondelez International  by the end of June  the coffee maker's Vice President Giuseppe Lavazza said on Thursday.",
        "date": "04092015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Lavazza sees decision on Carte Noire purchase by end-June "
    },
    {
        "content": "April 10 Kraft Foods Group Inc and Mondel\u007fz International Inc are being sued in a proposed class action on behalf of wheat futures and options traders for allegedly manipulating the grain's price.",
        "date": "04102015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Kraft  Mondel\u007fz wheat price manipulation hurt traders-U.S. lawsuit "
    },
    {
        "content": "MILAN  April 9 Italy's Lavazza expects a decision on whether it will buy the Carte Noire coffee brand from Mondelez International by the end of June  the coffee maker's Vice President Giuseppe Lavazza said on Thursday.",
        "date": "04092015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 1-Lavazza sees decision on Carte Noire purchase by end-June "
    },
    {
        "content": "MILAN  April 9 Italy's Lavazza expects a decision on who will end up buying Carte Noire coffee brand from Mondelez International by the end of June  the coffee maker's Vice President Giuseppe Lavazza said on Thursday.",
        "date": "04092015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Italy's Lavazza sees decision on Carte Noire buyer by end-June "
    },
    {
        "content": "MUMBAI  April 6 India's tax office has demanded about 5.5 billion rupees ($88 million) from the local arm of chocolate maker Cadbury  now Mondelez International Inc   in a dispute over a factory in the foothills of the Himalayas  government officials said.",
        "date": "04062015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Indian taxman demands $88 million from Cadbury in tax dispute "
    },
    {
        "content": "CHICAGO Emails between former senior executives at Kraft Foods  including its chief financial officer and a top procurement director  are among the evidence in a U.S. lawsuit accusing the company and Mondelez International of manipulating wheat prices.",
        "date": "04022015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Kraft Foods emails lay out plan to depress U.S. wheat prices: CFTC "
    },
    {
        "content": "WASHINGTON The U.S. Commodity Futures Trading Commission on Wednesday charged Kraft Foods Group Inc and Mondelez International Inc with manipulation of prices of wheat used in products such as Oreo and Chips Ahoy cookies.",
        "date": "04012015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "U.S. CFTC sues Kraft  Mondelez over alleged wheat price manipulation "
    },
    {
        "content": "Billionaire activist investor Nelson Peltz said on Thursday he is not pushing Mondelez International Inc to do a big deal.",
        "date": "04022015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Trian's Peltz says 'not pushing' Mondelez for a big deal "
    },
    {
        "content": "WASHINGTON  April 1 The U.S. Commodity Futures Trading Commission on Wednesday charged Kraft Foods Group Inc  and Mondelez International Inc with manipulation of prices of wheat used in products such as Oreo and Chips Ahoy cookies.",
        "date": "04012015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-U.S. CFTC sues Kraft  Mondelez over alleged wheat price manipulation "
    },
    {
        "content": "CHICAGO  April 2 Emails between former senior executives at Kraft Foods  including its chief financial officer and a top procurement director  are among the evidence in a U.S. lawsuit accusing the company and Mondelez International of manipulating wheat prices.",
        "date": "04022015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Kraft Foods emails lay out plan to depress U.S. wheat prices -CFTC "
    },
    {
        "content": "NEW YORK  March 2 Scott Amoye  who ran Mondelez International Inc's cocoa business  has left after five year years with one of the world's largest chocolate companies and the maker of Cadbury chocolates and Oreo cookies  he confirmed to Reuters on Monday.",
        "date": "03032015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "MOVES-Mondelez's cocoa chief Amoye leaves after 5 years "
    },
    {
        "content": "MILAN Italy's Lavazza has exclusive rights to consider buying the European Carte Noire business of U.S.–based Mondelez International   the two companies said on Tuesday.",
        "date": "02242015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Italy's Lavazza has exclusive rights to consider Carte Noire buy "
    },
    {
        "content": "BRUSSELS/MILAN  Feb 23 Mondelez International  and DE Master Blenders 1753 proposed on Monday selling the Carte Noir coffee brand instead of two smaller marques to soothe European competition concerns about their merger.",
        "date": "02232015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "UPDATE 1-Mondelez  DE Master Blenders propose Carte Noir sale "
    },
    {
        "content": "BRUSSELS/MILAN  Feb 23 Mondelez International  and D.E. Master Blenders 1753 proposed on Monday selling the Carte Noire coffee brand instead of two smaller marques to soothe European competition concerns about their merger.",
        "date": "02242015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "CORRECTED-UPDATE 1-Mondelez  DE Master Blenders propose Carte Noire sale "
    },
    {
        "content": "BRUSSELS  Feb 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02232015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "EU mergers and takeovers (Feb 23) "
    },
    {
        "content": "Kraft Foods Group Inc said on Thursday that its chief financial officer would leave her role and two other senior executives would depart from the company  marking the first major changes at the maker of Velveeta cheese and Oscar Mayer meats since its board chairman took over as chief executive in December.",
        "date": "02132015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Kraft Foods shakes up leadership  reports quarterly loss "
    },
    {
        "content": "Kraft Foods Group Inc said its chief financial officer and two other senior executives would leave the company  and the maker of Velveeta cheese and Oscar Mayer meats reported a quarterly loss due to a charge related to its pension plan.",
        "date": "02122015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Kraft Foods shakes up leadership  reports quarterly loss "
    },
    {
        "content": "Mondelez International Inc   the maker of Cadbury chocolate and Oreo cookies  reported a better-than-expected adjusted quarterly profit and said it expects cost cuts to boost its full-year adjusted operating margin in 2015.",
        "date": "02112015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Mondelez beats profit forecast  sees higher margin in 2015 "
    },
    {
        "content": "Feb 11 Mondelez International Inc  the maker of Cadbury chocolate and Oreo cookies  reported a better-than-expected adjusted quarterly profit and said it expects cost cuts to boost its full-year adjusted operating margin in 2015.",
        "date": "02112015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "UPDATE 2-Mondelez beats profit forecast  sees higher margin in 2015 "
    },
    {
        "content": "Feb 11 Mondelez International Inc  the maker of Cadbury chocolate and Oreo cookies  reported a near 72 percent fall in quarterly profit as sales across all key markets fell.",
        "date": "02112015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Mondelez profit falls 72 pct as sales fall in all regions "
    },
    {
        "content": "NEW YORK Anielle Troyan  a call center worker in New York  shops at discount retailers such as Family Dollar for items like soap and detergent as well as groceries like Kraft macaroni and cheese and small-sized condiments. | Video ",
        "date": "02052015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "Velveeta revives as young and poor shop dollar stores for groceries "
    },
    {
        "content": "BRUSSELS  Jan 22 European Union antitrust regulators have extended by one week a review of a plan by Mondelez International and D.E. Master Blenders 1753 to merge their coffee businesses.",
        "date": "01222015",
        "name": "Mondelez International Inc",
        "news_type": "topStory",
        "symbol": "MDLZ",
        "title": "EU extends coffee merger deal review deadline to May 13 "
    },
    {
        "content": "BRUSSELS  Jan 22 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01222015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "EU mergers and takeovers (Jan 22) "
    },
    {
        "content": "LONDON  Jan 12 Mondelez International  maker of Cadbury Creme Eggs  has tweaked the recipe of the chocolate shell of its gooey treats ahead of their main Easter selling season  sparking an angry response in Cadbury's home market of Britain.",
        "date": "01122015",
        "name": "Mondelez International Inc",
        "news_type": "normal",
        "symbol": "MDLZ",
        "title": "Outrage in Britain as Cadbury owner tweaks Creme Egg recipe "
    }
]