[
    {
        "content": "MetLife Inc  reported a 13.8 percent fall in quarterly operating income on Wednesday  hurt by a charge related to the spin off of its U.S. retail business  Brighthouse Financial  and the insurer authorized a $2 billion share buyback plan.",
        "date": "11012017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife operating income falls  authorizes $2 billion buyback "
    },
    {
        "content": "Nov 1 MetLife Inc reported a 13.8 percent fall in quarterly operating income on Wednesday  hurt by a charge related to the spin off of its U.S. retail business  Brighthouse Financial  and the insurer authorized a $2 billion share buyback plan.",
        "date": "11012017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "CORRECTED-UPDATE 1-MetLife operating income falls  authorizes $2 bln buyback "
    },
    {
        "content": "* MetLife announces new $2 billion share repurchase authorization and brighthouse financial exchange offer",
        "date": "11012017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-MetLife announces new $2 billion share repurchase authorization "
    },
    {
        "content": "* Qtrly premiums  fees & other revenues were $12.6 billion  up 9 percent over third quarter of 2016",
        "date": "11012017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife Inc Q3 Shr Loss $0.08 "
    },
    {
        "content": "* And u.s. Are set to file court motions on nov 17 related to findings in anticipated u.s. Treasury report about \"systemically risky\" designation process- metlife ceo",
        "date": "11022017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife says searching for internal and external candidates to replace townsend "
    },
    {
        "content": "* Metlife Inc - ‍company's shareholders approved changes to dividend payment tests in company's charter​",
        "date": "10192017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife shareholders approve proposal at special meeting "
    },
    {
        "content": "A federal appeals court on Wednesday reversed a verdict for Metropolitan Life Insurance Co  ruling that the company owed a California nurse the full amount of a life insurance policy she took out on her husband.",
        "date": "09202017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife owes nurse full insurance amount despite missing info - 9th Circuit "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 06 (Fitch) Fitch Ratings has affirmed all existing ratings assigned to MetLife  Inc. (MetLife) and its subsidiaries  including the Very Strong 'AA-' Insurer Financial Strength (IFS) ratings assigned to certain domestic life insurance companies and the 'A' Issuer Default Rating (IDR) assigned to MetLife. The Rating Outlook for MetLife and its subsidiaries is Stable. A full list of rating actions is shown at the end of ",
        "date": "09062017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Fitch Affirms MetLife  Inc.'s Ratings; Outlook Stable "
    },
    {
        "content": "EAST RUTHERFORD  N.J. -- Bryce Petty and Christian Hackenberg engineered four second-half touchdown drives to help the New York Jets overcome a 29-3 first-half deficit  but fell one point short in the New York Giants' 32-31 victory in the annual MetLife Bowl.",
        "date": "08272017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Giants hold off Jets' second-half rally to pull out win "
    },
    {
        "content": "* Metlife Inc - declared quarterly dividend of $0.25555555 per share on co's floating rate non-cumulative preferred stock  series A Source text for Eikon: Further company coverage:",
        "date": "08152017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife Inc declares quarterly dividend of $0.25555555 per share "
    },
    {
        "content": "Aug 10 MetLife Inc is asking some bond investors and shareholders to approve changes that are necessary for the insurer to make interest payments as usual  and continue returning capital to common shareholders  following its recent Brighthouse Financial Inc spinoff.",
        "date": "08102017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife seeks changes to protect interest payments  dividends "
    },
    {
        "content": "* Ares Commercial Real Estate Corp - ‍on August 4  unit entered into an amendment to its $180.0 million Master Repurchase Agreement - SEC filing​",
        "date": "08092017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Ares Commercial Real Estate entered into an amendment to its $180 mln Master Repurchase Agreement on Aug 4​ "
    },
    {
        "content": "Shares of Brighthouse Financial Inc fell as much as 6 percent in its market debut on Monday  as the U.S. retail insurer spun off from MetLife Inc goes solo in an industry that has been hurt by low interest rates.",
        "date": "08072017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Brighthouse Financial shares slip in market debut "
    },
    {
        "content": "WASHINGTON Any legal decision on whether the largest U.S. life insurer MetLife Inc  should be labeled \"too big to fail\" will probably come after the Trump administration defines its stance on the designation.",
        "date": "08022017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "U.S. court puts MetLife 'too big to fail' case on indefinite pause "
    },
    {
        "content": "* MetLife Inc - expects to distribute 96.8 million of 119.8 million shares of common stock of its unit  Brighthouse Financial Inc to MetLife common shareholders",
        "date": "08032017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-MetLife to distribute to its common shareholders 96.8 mln of 119.8 mln Brighthouse Financial shares "
    },
    {
        "content": "Aug 7 Shares of Brighthouse Financial Inc fell as much as 6 percent in its market debut on Monday  as the U.S. retail insurer spun off from MetLife Inc goes solo in an industry that has been hurt by low interest rates.",
        "date": "08072017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 2-Brighthouse Financial shares slip in market debut "
    },
    {
        "content": "WASHINGTON  Aug 2 Any legal decision on whether the largest U.S. life insurer MetLife Inc should be labeled \"too big to fail\" will probably come after the Trump administration defines its stance on the designation.",
        "date": "08022017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-U.S. court puts MetLife 'too big to fail' case on indefinite pause "
    },
    {
        "content": "MetLife Inc   the largest U.S. life insurer  posted a better-than-expected quarterly operating profit  helped by stronger underwriting in all its businesses.",
        "date": "08022017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife beats profit estimates on strong underwriting "
    },
    {
        "content": "* Brighthouse financial says ‍on August 2  2017  co disclosed that amount of assets to be distributed to Metlife - SEC filing",
        "date": "08032017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Brighthouse Financial discloses amount of assets to be distributed to Metlife - SEC filing "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  August 07 (Fitch) Fitch Ratings has assigned a Long-Term Issuer Default rating of 'BBB+' to Brighthouse Financial  Inc. (Brighthouse)  reflecting completion of the legal transfer of Brighthouse Holdings  LLC and its insurance operating subsidiaries Brighthouse Life Insurance  New England Life Insurance Company (NELICO)  and Brighthouse Life Insurance Company of NY from MetLife  Inc. (MetLIfe) to Brighthouse  and completion of ",
        "date": "08072017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Fitch Assigns 'BBB+' IDR to Brighthouse Financial; Outlook Stable "
    },
    {
        "content": "Aug 7 Shares of Brighthouse Financial Inc   the U.S. retail insurer spun off from MetLife Inc  fell 4 percent in market debut on Monday as it goes solo in an industry struggling with low interest rates.",
        "date": "08072017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Brighthouse Financial falls 4 pct in debut "
    },
    {
        "content": "Aug 2 MetLife Inc  the largest U.S. life insurer  posted a better-than-expected quarterly operating profit  helped by stronger underwriting in all its businesses.",
        "date": "08022017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-MetLife beats profit estimates on strong underwriting "
    },
    {
        "content": "* Q2 earnings per share view $1.28 -- Thomson Reuters I/B/E/S",
        "date": "08022017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife Q2 earnings per share $0.77 "
    },
    {
        "content": "Aug 2 MetLife Inc's quarterly profit surged compared with a year earlier  when the largest U.S. life insurer booked $1.4 billion in net derivative losses.",
        "date": "08022017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife profit rises on smaller derivative losses "
    },
    {
        "content": "WASHINGTON The top U.S. financial regulators ventured into uncharted legal territory on Friday  as they weighed the future of their appeal in a long-running case over their labeling of MetLife Inc as \"too big to fail.\"",
        "date": "07312017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "U.S. regulators weigh future of appeal in MetLife case "
    },
    {
        "content": "WASHINGTON  Aug 1 The public may soon be able to delve into how a U.S. District Court judge came to rule that MetLife Inc is not \"too big to fail \" after three appeals judges on Tuesday decided many records in the case should be unsealed.",
        "date": "08012017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. judges allow public to see records in MetLife 'too big to fail' case "
    },
    {
        "content": "WASHINGTON The top U.S. financial regulators ventured into uncharted legal territory on Friday  as they weighed the future of their appeal in a long-running case over their labeling of MetLife Inc  as \"too big to fail.\"",
        "date": "07282017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "U.S. regulators weigh future of appeal in MetLife case "
    },
    {
        "content": "WASHINGTON  July 28 The top U.S. financial regulators ventured into uncharted legal territory on Friday  as they weighed the future of their appeal in a long-running case over their labeling of MetLife Inc as \"too big to fail.\"",
        "date": "07282017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "CORRECTED-U.S. regulators weigh future of appeal in MetLife case "
    },
    {
        "content": "WASHINGTON Heads of the U.S. financial regulatory agencies will meet behind closed doors next Friday to discuss MetLife Inc's lawsuit against them  according to a notice from Treasury  as the Trump administration wrestles with reforms put in place in response to the financial crisis.",
        "date": "07212017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. financial regulators to discuss MetLife lawsuit next week "
    },
    {
        "content": "WASHINGTON  July 21 Heads of the U.S. financial regulatory agencies will meet behind closed doors next Friday to discuss MetLife Inc's lawsuit against them  according to a notice from Treasury  as the Trump administration wrestles with reforms put in place in response to the financial crisis.",
        "date": "07212017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-U.S. financial regulators to discuss MetLife lawsuit next week "
    },
    {
        "content": "WASHINGTON  July 21 Heads of the U.S. financial regulatory agencies will meet behind closed doors next Friday to discuss MetLife Inc's lawsuit against them  according to a notice from Treasury  as the Trump administration wrestles with reforms arising from the financial crisis.",
        "date": "07212017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. financial regulators to discuss Metlife lawsuit on July 28 -Treasury "
    },
    {
        "content": "A U.S. appeals court on Wednesday said the potential conflict of interest posed when Metropolitan Life Insurance Co denied a claim for employee disability benefits that it also would have had to pay out was not enough to revive a Missouri woman's lawsuit against the insurance giant.",
        "date": "07052017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife's potential conflict not enough to revive benefits claim   - 8th Circuit "
    },
    {
        "content": "NEW YORK MetLife Inc  has agreed to buy bond fund manager Logan Circle Partners from Fortress Investment Group LLC  for $250 million  a statement from the insurer said on Friday.",
        "date": "07072017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife says to buy bond fund manager Logan Circle for $250 million "
    },
    {
        "content": "WASHINGTON MetLife Inc  on Thursday asked for another delay in the long-running case over whether the U.S. government should have labeled it as \"too big to fail \" warning that the Trump administration may want to withdraw the government's appeal.",
        "date": "07062017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife seeks new delay in 'too big to fail' case to wait for Trump "
    },
    {
        "content": "* Buying fixed-income focused manager for $250 mln - statement",
        "date": "07072017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife says to buy bond fund manager Logan Circle for $250 mln "
    },
    {
        "content": "* Metlife Inc says under terms of agreement  Metlife will acquire 100 percent of fortress' ownership stake in Logan circle partners",
        "date": "07072017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife to acquire Logan Circle Partners for $250 million "
    },
    {
        "content": "* Metlife Inc - u.s. Securities and exchange commission (sec) has declared Brighthouse Financial  Inc.'s registration statement on form 10 effective",
        "date": "07062017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife says U.S. SEC has declared Brighthouse Financial's registration statement on form 10 effective "
    },
    {
        "content": "June 29 MetLife Inc on Thursday came a step closer to spinning off its U.S. retail life insurance and annuity business after the company's board of directors approved the plan  it said on Thursday.",
        "date": "06302017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "CORRECTED-UPDATE 1-MetLife board approves Brighthouse spinoff "
    },
    {
        "content": "MetLife Inc  on Thursday came a step closer to spinning off its U.S. retail life insurance and annuity business after the company's board of directors approved the plan  it said on Thursday.",
        "date": "06292017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife board approves Brighthouse spinoff  sets effective date "
    },
    {
        "content": "June 29 MetLife Inc on Thursday came a step closer to spinning off its U.S. retail life insurance business after the company's board of directors approved the plan  it said on Thursday.",
        "date": "06292017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife board OKs Brighthouse spinoff  sets effective date "
    },
    {
        "content": "* Metlife-Unit issued $1.5 billion aggregate amount of 3.700% senior notes due 2027  $1.5 billion aggregate amount of 4.700% senior notes due 2047 in private offering",
        "date": "06222017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife issues $1.5 bln aggregate amount of 3.700 pct senior notes "
    },
    {
        "content": "* Sanjeev Kapur joins Metlife as chief marketing officer for Asia Source text for Eikon: Further company coverage:",
        "date": "06202017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Sanjeev Kapur joins Metlife as chief marketing officer for Asia "
    },
    {
        "content": "* Named Susan Podlogar as Executive Vice President and Chief Human Resources Officer",
        "date": "06122017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife names Susan Podlogar Chief Human Resources Officer "
    },
    {
        "content": "June 15 MetLife Inc shareholders have approved the company's compensation for executives and sided with directors in rejecting a proposal that would make it easier for shareholders to call special meetings  the company said in a filing on Thursday.",
        "date": "06152017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife shareholders approve 2016 executive pay "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 15 (Fitch) Fitch Ratings has assigned an expected rating of 'BBB(EXP)' to Brighthouse Financial  Inc.'s (Brighthouse) proposed issuance of up to $3 billion new senior unsecured notes. The expected rating reflects standard notching based on Fitch's rating criteria. Fitch expects proceeds from the debt issuance to be used to pay a dividend to MetLife  Inc. (MetLife) and for general corporate purposes  including potential cap",
        "date": "06152017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Fitch Rates Brighthouse Financial's Senior Notes 'BBB(EXP)' "
    },
    {
        "content": "June 15 Metlife Inc  the largest U.S. life insurer  announced added responsibilities for some of its senior executives  adding to the pool of potential successors to its chief executive.",
        "date": "06152017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Metlife adds to CEO succession pool with new appointments "
    },
    {
        "content": "* Metlife inc - announced a series of changes to its senior leadership ranks​",
        "date": "06152017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife Inc announces management changes "
    },
    {
        "content": "June 8 MetLife Inc General Counsel Ricardo Anzaldua will retire at the end of the year after five years with the insurer  according to an internal memo seen by Reuters.",
        "date": "06082017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife General Counsel Ricardo Anzaldua to retire - memo "
    },
    {
        "content": "MetLife Inc General Counsel Ricardo Anzaldua will retire at the end of the year after five years with the insurer  according to an internal memo seen by Reuters.",
        "date": "06082017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife General Counsel Ricardo Anzaldua to retire: memo "
    },
    {
        "content": "May 31 Fitch Ratings Inc downgraded MetLife Inc.'s Brighthouse Financial Inc unit on Wednesday  citing a \"deterioration in the company's projected capitalization metrics.\"",
        "date": "05312017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Fitch Ratings downgrades MetLife's Brighthouse Financial unit "
    },
    {
        "content": "May 31 Fitch Ratings Inc downgraded MetLife Inc's Brighthouse Financial Inc unit on Wednesday  citing the unit's lowering of its capitalization and financial targets from last year.",
        "date": "05312017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 2-Fitch Ratings downgrades MetLife's Brighthouse Financial unit "
    },
    {
        "content": "WASHINGTON A U.S. appeals court on Friday granted a 60-day pause in the long-running case in which the country's largest life insurer  MetLife Inc  has challenged the federal government's labeling of it as \"too big to fail \" as the Trump administration wrestles with reforms arising from the financial crisis.",
        "date": "05122017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "U.S. court puts hold on 'too big to fail' case involving MetLife "
    },
    {
        "content": "WASHINGTON  May 12 A U.S. appeals court on Friday granted a 60-day pause in the long-running case in which the country's largest life insurer  MetLife Inc  has challenged the federal government's labeling of it as \"too big to fail \" as the Trump administration wrestles with reforms arising from the financial crisis.",
        "date": "05122017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 2-U.S. court puts hold on 'too big to fail' case involving MetLife "
    },
    {
        "content": "May 15 Brighthouse Financial  the consumer life insurance and annuity unit created by MetLife  Inc  on Monday unveiled its first new product  a deferred annuity whose performance is tied to one of three investment indexes.",
        "date": "05152017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife's Brighthouse unit unveils new annuity; Wells Fargo to distribute "
    },
    {
        "content": "May 15 Brighthouse Financial  the consumer life insurance and annuity unit created by MetLife Inc  on Monday unveiled its first new product  a deferred annuity whose performance is tied to one of three investment indexes.",
        "date": "05152017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-MetLife's Brighthouse unit unveils new annuity; Wells Fargo to distribute "
    },
    {
        "content": "WASHINGTON The U.S. government on Thursday requested a 60-day pause in a case involving MetLife Inc   the country's largest life insurer  and how regulators designate certain companies as \"too big to fail \" a major reform arising from the 2007-09 financial crisis.",
        "date": "05042017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "U.S. government says it needs more time in MetLife 'too-big-to-fail\" case "
    },
    {
        "content": "NEW YORK  May 4 MetLife Inc said it has changed its derivatives trading strategy after two consecutive quarters where losses from wrong-way bets hurt the insurer's profits.",
        "date": "05042017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife changes hedging strategy after billions in losses "
    },
    {
        "content": "NEW YORK  May 4 MetLife Inc has changed its derivatives trading strategy after two consecutive quarters in which losses from wrong-way trades hurt the insurer's profit.",
        "date": "05042017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-MetLife changes hedging strategy after billions in losses "
    },
    {
        "content": "MetLife Inc   the largest U.S. life insurer  reported a better-than-expected operating profit on Wednesday  driven by higher net investment income and a tighter leash on costs.",
        "date": "05032017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife's profit beats estimates as investment income rises "
    },
    {
        "content": "* Metlife - during Q1  began restructuring some derivative hedges to partially stabilize volatility from nonqualified interest rate derivatives",
        "date": "05052017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife began restructuring derivative hedges "
    },
    {
        "content": "* Refreshed hedging strategy to prevent free cash flow from falling interest rates - call",
        "date": "05042017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-MetLife will not have approvals for Brighthouse spinoff in 2017 first half "
    },
    {
        "content": "May 3 MetLife Inc  the largest U.S. life insurer  reported a better-than-expected operating profit on Wednesday  driven by higher net investment income and a tighter leash on costs.",
        "date": "05032017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-MetLife's profit beats estimates as investment income rises "
    },
    {
        "content": "* Q1 earnings per share $0.75; q1 operating earnings per share $1.41; q1 total operating revenue $16.88 billion  up 2 percent",
        "date": "05032017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife Q1 shr $0.75; Q1 oper shr $1.41 "
    },
    {
        "content": "May 3 MetLife Inc  the largest U.S. life insurer  reported a 62.6 percent fall in quarterly profit  hurt by derivative losses.",
        "date": "05032017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife's profit drops 62.6 pct on derivative losses "
    },
    {
        "content": "NEW YORK MetLife Inc  plans to invest $1 billion in an efficiency program through 2019 that will eventually reduce annual operating costs by around $800 million  the insurer said on Thursday.",
        "date": "04272017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife to invest $1 billion in tech to reach cost-savings goals "
    },
    {
        "content": "* Sets quarterly dividend of $0.40 per share Source text for Eikon: Further company coverage:",
        "date": "04252017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife sets quarterly dividend of $0.40 per share "
    },
    {
        "content": "WASHINGTON MetLife Inc  is asking a U.S. court to put on pause a case over how the government deems certain companies \"too big to fail \" one of the most significant reforms to come out of the financial crisis  while President Donald Trump's administration finishes reviewing the current regulatory approach.",
        "date": "04242017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife asks court to halt 'too big to fail' case during Trump review "
    },
    {
        "content": "NEW YORK  April 27 MetLife Inc plans to invest $1 billion in an efficiency program through 2019 that will eventually reduce annual operating costs by around $800 million  the insurer said on Thursday.",
        "date": "04272017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife to invest $1 bln in tech to reach cost-savings goals "
    },
    {
        "content": "* Metlife chairman in shareholder letter says in U.S. and abroad  will continue to allow \"older  more capital intensive\" liabilities to run off in 2017",
        "date": "04272017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife chairman says from 2016 through 2019  company plans to invest $1 bln in efficiency enhancements - shareholder letter "
    },
    {
        "content": "* MetLife Inc files proxy statement with U.S. SEC - SEC filing",
        "date": "04272017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-MetLife Inc CEO Kandarian's 2016 total compensation $15.3 mln "
    },
    {
        "content": "* Metlife invests $10.2 billion in private placements in 2016  including originating $3.3 billion in infrastructure debt Source text for Eikon: Further company coverage:",
        "date": "04042017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife invests $10.2 bln in private placements in 2016 "
    },
    {
        "content": "WASHINGTON  March 28 Republican lawmakers on Tuesday asked the U.S. Treasury secretary to review the process a government council uses to label non-bank institutions \"too big to fail \" saying the additional capital requirements and regulations are too onerous.",
        "date": "03282017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. Republican senators want review of 'too big to fail' process "
    },
    {
        "content": "WASHINGTON  March 2 The Financial Stability Oversight Council  made up of all major U.S. financial regulators  met late on Thursday afternoon and reviewed its designation of a nonbank firm as \"too big to fail \" according to a statement from the Treasury Department.",
        "date": "03032017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "UPDATE 1-U.S. financial regulators discuss firm's 'too big to fail' label "
    },
    {
        "content": "A former MetLife Inc employee filed a proposed class action on Tuesday claiming the Manhattan-based insurance giant failed to pay its long term disability claim specialists more than $50 million for overtime during the past three years.",
        "date": "02082017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Former claim specialist hits MetLife with $50 mln overtime class action "
    },
    {
        "content": "Insurer MetLife Inc's  fourth-quarter operating profit  which excludes a $3.2 billion derivative loss  fell short of analysts' estimates due to a drop in income in its U.S. retail unit and in Latin America.",
        "date": "02012017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife results hurt by weakness in U.S. retail unit  Latin America "
    },
    {
        "content": "Feb 1 Insurer MetLife Inc's  fourth-quarter operating profit  which excludes a $3.2 billion derivative loss  fell short of analysts' estimates due to a drop in income in its U.S. retail unit and in Latin America.",
        "date": "02012017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-MetLife results hurt by weakness in U.S. retail unit  Latin America "
    },
    {
        "content": "Feb 1 MetLife Inc  the largest U.S. life insurer  reported a quarterly net loss  compared with a profit a year earlier  dragged down by a derivative loss of $3.2 billion.",
        "date": "02012017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife's results weighed down by derivatives loss "
    },
    {
        "content": "* Q4 earnings per share view $1.34 -- Thomson Reuters I/B/E/S",
        "date": "02012017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife reports Q4 operating EPS $1.28 "
    },
    {
        "content": "Florida's insurance commissioner is allowing MetLife Inc and Unum Group boost long-term care premiums  alleviating financial stress the insurers have been facing from rising medical costs and policyholders living longer.",
        "date": "01132017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Florida lets MetLife  Unum boost premiums for long-term care "
    },
    {
        "content": "Jan 12 Florida's insurance commissioner is allowing MetLife Inc and Unum Group to boost long-term care premiums  alleviating some financial stress the insurers have been facing from rising medical costs and policyholders living longer.",
        "date": "01122017",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "CORRECTED-Florida lets MetLife  Unum boost premiums for long-term care "
    },
    {
        "content": "Jan 12 Florida's insurance commissioner is allowing MetLife Inc and Unum Group boost long-term care premiums  alleviating financial stress the insurers have been facing from rising medical costs and policyholders living longer.",
        "date": "01132017",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-Florida lets MetLife  Unum boost premiums for long-term care "
    },
    {
        "content": "NEW YORK MetLife Inc  expects higher U.S. interest rates to add $300 million to operating profits through 2019  the insurer said in a filing on Thursday.",
        "date": "12152016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife expects $300 million boost to operating profit from interest rates "
    },
    {
        "content": "* David J. Rothenberg joins Metlife Investment management as managing director in the Institutional Client Group  Source text for Eikon:  Further company coverage:",
        "date": "11142016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife Investment names David J. Rothenberg as Managing Director in Institutional Client Group "
    },
    {
        "content": "MetLife Inc  said on Thursday its board had approved a new $3 billion share buyback program  its largest ever.",
        "date": "11102016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife board approves $3 billion buyback program  its biggest ever "
    },
    {
        "content": "* Qtrly premiums  fees & other revenues were $13.1 billion  down 1 percent over Q3 of 2015",
        "date": "11022016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife Q3 earnings per share $0.51 "
    },
    {
        "content": "Nov 10 MetLife Inc said on Thursday its board had approved a new $3 billion share buyback program  its largest ever.",
        "date": "11102016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife board approves $3 bln buyback program  its biggest ever "
    },
    {
        "content": "* MetLife announces new $3 billion share repurchase authorization  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-MetLife announces new $3 bln share repurchase authorization "
    },
    {
        "content": "* Sets quarterly dividend of $0.40 per share  Source text for Eikon:  Further company coverage:",
        "date": "10252016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife sets quarterly dividend of $0.40 per share "
    },
    {
        "content": "Oct 21 MetLife Inc said it named David Herzog  former chief financial officer of American International Group Inc  to its board  effective immediately.",
        "date": "10212016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MOVES-MetLife names AIG's former CFO to its board "
    },
    {
        "content": "WASHINGTON  Oct 24 The U.S. government and the country's largest life insurer are set for a rematch in a U.S. appeals court on Monday over how federal regulators decide a company is \"too big to fail \" one of the most significant reforms to come out of the financial crisis.",
        "date": "10242016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. government  MetLife set for rematch over 'too big to fail' "
    },
    {
        "content": "* Metlife launches new global brand platform driven by customer insights",
        "date": "10202016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife launches new global brand platform "
    },
    {
        "content": "* Metlife Inc - Herzog most recently served as executive vice president and chief financial officer of American International Group",
        "date": "10212016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Herzog named to Metlife's board of directors "
    },
    {
        "content": "WASHINGTON  Oct 24 The U.S. government and the country's largest life insurer are set for a rematch in a U.S. appeals court on Monday over how federal regulators decide a company is \"too big to fail \" one of the most significant reforms to come out of the financial crisis.",
        "date": "10242016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "RPT-U.S. government  MetLife set for rematch over 'too big to fail' "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 06 (Fitch) Fitch Ratings has downgraded the Insurer Financial  Strength (IFS) ratings of MetLife Insurance Company USA (MetLife USA) and New  England Life Insurance Company (NELIC) to 'A+' from 'AA-' and removed the  ratings from Rating Watch Negative. At the same time  Fitch has affirmed the  existing ratings assigned to MetLife  Inc. (MetLife) and its other subsidiaries.  The Outlook on all ratings is Stable. A full l",
        "date": "10062016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Fitch Downgrades Two MetLife Subsidiaries Related to Planned Brighthouse Financial Separation "
    },
    {
        "content": "* On september 27  adopted amendments to company's by-laws - sec filing",
        "date": "09292016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife adopt amendments to company's by-laws - sec filing "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 13 (Fitch) Fitch Ratings has affirmed the existing ratings  and Stable Outlook assigned to MetLife  Inc. (MetLife). At the same time  Fitch  has placed the Insurer Financial Strength (IFS) rating of New England Life  Insurance Company (NELIC) on Rating Watch Negative  and affirmed and removed  from Rating Watch Negative the IFS rating of General American Life Insurance  Company (GALIC). The Outlook is now Stable. Met",
        "date": "09132016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Fitch Affirms MetLife  Inc. and Most Subsidiaries "
    },
    {
        "content": "EAST RUTHERFORD  N.J. -- Quarterback Ryan Nassib connected with wide receiver Tavarres King on two touchdown passes  including the 11-yard game-winner to give the New York Giants a 21-20 victory over the New York Jets on Saturday in the annual MetLife Bowl at MetLife Stadium in East Rutherford  N.J.",
        "date": "08282016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Nassib throw winning TD pass for Giants against Jets "
    },
    {
        "content": "WASHINGTON  Aug 23 State insurance regulators in a court brief on Monday said a powerful U.S. council made up of the heads of all the federal financial regulatory agencies disregarded their work when it designated of MetLife Inc.  as \"too big to fail.\"",
        "date": "08232016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "State insurance regulators say U.S. government ignored them in MetLife case "
    },
    {
        "content": "MetLife Inc   the largest U.S. life insurer  reported a quarterly profit that widely missed analysts' estimates  largely due to weaker underwriting and tax-related adjustment in two of its largest markets.",
        "date": "08032016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife profit falls short of estimates on weaker underwriting "
    },
    {
        "content": "Aug 3 MetLife Inc  the largest U.S. life insurer  reported a quarterly profit that widely missed analysts' estimates  largely due to weaker underwriting and tax-related adjustment in two of its largest markets.",
        "date": "08032016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-MetLife profit falls short of estimates on weaker underwriting "
    },
    {
        "content": "* Q2 earnings per share view $1.35 -- Thomson Reuters I/B/E/S",
        "date": "08032016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife posts Q2 operating earnings per share $0.83 "
    },
    {
        "content": "Aug 3 MetLife Inc  the largest U.S. life insurer  reported a 94 percent fall in quarterly profit as the company booked higher derivative losses.",
        "date": "08032016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife profit falls 94 pct on higher derivative losses "
    },
    {
        "content": "* Metlife U.S. Retail business to re-brand as Brighthouse Financial  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07212016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife U.S. Retail business to rebrand as Brighthouse Financial "
    },
    {
        "content": "* Sees announced that its board of directors has declared a Q3 2016 common stock dividend of $0.40 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07072016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife declared Q3 2016 common stock dividend of $0.40/shr "
    },
    {
        "content": "* PPG will purchase group annuity contracts from Metlife and Massmutual",
        "date": "06282016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife signs pension buyout agreement with PPG "
    },
    {
        "content": "June 23 A federal court's striking down of the government's designation of insurer MetLife Inc as \"too-big-to-fail\" could undermine efforts to head off another financial crisis  authors of the landmark Dodd-Frank Wall Street reform law said.",
        "date": "06232016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Dodd  Frank blast ruling that MetLife not too big to fail "
    },
    {
        "content": "June 23 A federal court's striking down of the government's designation of insurer MetLife Inc as \"too-big-to-fail\" could undermine efforts to head off another financial crisis  authors of the landmark Dodd-Frank Wall Street reform law said.",
        "date": "06232016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "REFILE-UPDATE 1-Dodd  Frank blast ruling that MetLife not too big to fail "
    },
    {
        "content": "WASHINGTON The U.S. government laid out its arguments against a federal judge's decision to strike down the designation of life insurer MetLife Inc as \"too big to fail\" in a brief filed late on Thursday  showing how it intends to defend a key provision of the Dodd-Frank Wall Street reform law.",
        "date": "06172016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "U.S. strikes back at judge's decision that MetLife not 'too big to fail' "
    },
    {
        "content": "* Metlife board of directors waives age-65 retirement policy for Chairman  President and CEO Steven A. Kandarian",
        "date": "06142016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife board waives age-65 retirement policy for CEO Kandarian "
    },
    {
        "content": "* Said on Tuesday MetLife OFE raised its stake in the company to 8.23 percent from 4.87 percent via purchase of shares on May 17",
        "date": "05252016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-MetLife OFE raises stake in iAlbatros Group "
    },
    {
        "content": "* Regulators seek expedited schedule in MetLife appeal over \"systemically important\" label due to uncertainty about designating firms - CNBC  citing DJ  Source text: (http://bit.ly/20gf9uq)   (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "05202016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Regulators seek expedited schedule in MetLife appeal - CNBC "
    },
    {
        "content": "* Hall will join company effective june 1  and succeeds Ed Spehar",
        "date": "05112016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife appoints new head of investor relations "
    },
    {
        "content": "* Marlene Debel  executive vice president and treasurer  has been named executive vice president and CFO U.S",
        "date": "05052016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife appoints Marlene Debel as chief financial officer for United States "
    },
    {
        "content": "MetLife Inc   the largest U.S. life insurer  reported a quarterly operating profit that fell far short of expectations as income from investments in hedge funds and bonds declined.",
        "date": "05042016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife profit misses on weak returns from hedge funds  bonds "
    },
    {
        "content": "* Q1 total operating revenue $16.61 billion versus $17.03 billion last year",
        "date": "05042016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife Q1 GAAP earnings per share $1.98 "
    },
    {
        "content": "* Will hold its investor conference on Thursday  Nov. 10  2016  in New York City  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05022016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife will hold its investor conference on Thursday  Nov. 10 "
    },
    {
        "content": "* Metlife increases second quarter 2016 common stock dividend by approximately 7 percent for second consecutive year",
        "date": "04262016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife increases Q2 common stock dividend by about 7 pct "
    },
    {
        "content": "* CEO Steven A. Kandarian  2015 total compensation $15.7 million versus $15.2 million in 2014",
        "date": "04262016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife CEO's 2015 total compensation was $15.7 mln vs $15.2 mln in 2014 - SEC Filing "
    },
    {
        "content": "WASHINGTON  April 8 The U.S. government on Friday appealed a court decision that major insurer MetLife cannot be considered \"too big to fail\" in the United States Court of Appeals for the District of Columbia  according to a filing.",
        "date": "04082016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. government appeals court decision in MetLife 'too big to fail' case "
    },
    {
        "content": "WASHINGTON  April 7 Federal regulators' decision to designate insurer MetLife Inc as \"too big to fail\" was \"arbitrary and capricious \" the U.S. judge who struck down the determination last month wrote in an opinion that was unsealed on Thursday.",
        "date": "04072016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "UPDATE 4-MetLife's 'too big to fail' tag is 'arbitrary  capricious' -U.S. judge "
    },
    {
        "content": "WASHINGTON  April 7 The U.S. government will appeal a district court's decision to rescind the designation by a government regulator of insurer MetLife Inc as \"too big to fail \" a Treasury Department spokesman said on Thursday.   (Reporting by Eric Walsh)",
        "date": "04072016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. to appeal court decision to rescind Metlife's 'too big to fail' tag "
    },
    {
        "content": "WASHINGTON  April 7 Obama administration sources familiar with the lawsuit over the designation of MetLife as \"too big to fail\" said on Thursday they believe that a U.S. government appeal of the decision in the case is likely.",
        "date": "04072016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. seen appealing MetLife exemption from 'too big to fail' "
    },
    {
        "content": "WASHINGTON  April 8 The U.S. government on Friday appealed a court decision that major insurer MetLife cannot be considered \"too big to fail\" in the United States Court of Appeals for the District of Columbia  according to a filing.",
        "date": "04082016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-U.S. government appeals court decision in MetLife 'too big to fail' case "
    },
    {
        "content": "WASHINGTON  April 7 U.S. Treasury Secretary Jack Lew on Thursday criticized a federal court for striking down as \"arbitrary and capricious\" a decision by regulators to subject MetLife to toughened regulation as a \"systemically important\" financial firm.",
        "date": "04072016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. Treasury chief assails court opinion on Metlife "
    },
    {
        "content": "Federal regulators' decision to designate major insurer Metlife as \"too big to fail\" was \"arbitrary and capricious \" the U.S. judge who struck down the determination last month wrote in an opinion that was unsealed on Thursday.",
        "date": "04072016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. judge: designating Metlife systemically important 'arbitrary and capricious' "
    },
    {
        "content": "WASHINGTON Federal regulators' decision to designate insurer MetLife Inc as \"too big to fail\" was \"arbitrary and capricious \" the U.S. judge who struck down the determination last month wrote in an opinion that was unsealed on Thursday.",
        "date": "04082016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife's 'too big to fail' tag is 'arbitrary  capricious' -U.S. judge "
    },
    {
        "content": "WASHINGTON  April 7 Federal regulators' decision to designate major insurer Metlife as \"too big to fail\" was \"arbitrary and capricious \" the U.S. judge who struck down the determination last month wrote in an opinion that was unsealed on Thursday.",
        "date": "04072016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. judge: designating Metlife systemically important \"arbitrary and capricious\" "
    },
    {
        "content": "WASHINGTON Federal regulators' decision to designate insurer MetLife Inc  as \"too big to fail\" was \"arbitrary and capricious \" the U.S. judge who struck down the determination last month wrote in an opinion that was unsealed on Thursday.",
        "date": "04082016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife's 'too big to fail' tag is 'arbitrary  capricious': U.S. judge "
    },
    {
        "content": "* On March 29  2016  five units of co's operating partnership entered loan agreement with Metlife  provides $127 million of term loans",
        "date": "03312016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Farmland Partners units enter loan agreement with Metlife "
    },
    {
        "content": "* Says views federal court decision to strike down MetLife's designation as a non-bank SIFI as having no impact on ratings assigned to MetLife",
        "date": "03302016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Fitch says Court Decision on MetLife's SIFI Designation a Credit Neutral "
    },
    {
        "content": "* Says CEO Steven Kandarian 2015 total compensation was $15.7 million versus $15.2 million in 2014 - SEC filing",
        "date": "03312016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-Metlife CEO Steven Kandarian 2015 total compensation $15.7 million "
    },
    {
        "content": "WASHINGTON Insurer MetLife Inc won a major regulatory and legal battle on Wednesday when a federal judge struck down the U.S. government's determination that it is \"too big to fail.\"",
        "date": "03302016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. judge strikes down MetLife designation of 'too big to fail' "
    },
    {
        "content": "NEW YORK  March 31 A federal judge's ruling that MetLife Inc is not important enough to warrant special regulatory scrutiny has opened the door for other non-bank financial firms to try and unshackle themselves from the designation of \"too big to fail.\"",
        "date": "03312016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife ruling bolsters other firms arguing systemic unimportance "
    },
    {
        "content": "WASHINGTON  March 30 Insurer MetLife Inc  won a major regulatory and legal battle on Wednesday when a federal judge struck down the U.S. government's determination that it is \"too big to fail.\"",
        "date": "03302016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 3-U.S. judge strikes down MetLife designation of 'too big to fail' "
    },
    {
        "content": "WASHINGTON Insurer MetLife Inc  won a major regulatory and legal battle on Wednesday when a federal judge struck down the U.S. government's determination that it is \"too big to fail.\" | Video ",
        "date": "03312016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. judge strikes down MetLife designation of 'too big to fail' "
    },
    {
        "content": "A judge's ruling that MetLife Inc  is not \"too big to fail\" opens up an opportunity for insurer American International Group Inc  to seek an exemption from the tag  AIG Chief Executive Peter Hancock said on CNBC on Thursday.",
        "date": "03312016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "AIG CEO says MetLife 'too big to fail' ruling an opportunity "
    },
    {
        "content": "March 31 A judge's ruling that MetLife Inc  is not \"too big to fail\" opens up an opportunity for insurer American International Group Inc to seek an exemption from the tag  AIG Chief Executive Peter Hancock said on CNBC on Thursday.",
        "date": "03312016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 2-AIG CEO says MetLife \"too big to fail\" ruling an opportunity "
    },
    {
        "content": "* Indexes up: Dow 0.42 pct  S&P 0.44 pct  Nasdaq 0.49 pct   (Updates with afternoon trading)",
        "date": "03302016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "US STOCKS-Interest rate optimism pushes Wall Street higher "
    },
    {
        "content": "March 31 A judge's ruling that MetLife Inc  is not a \"too big to fail\" opens up an opportunity for American International Group Inc to also apply for exemption  AIG Chief Executive Peter Hancock said in an interview on CNBC on Thursday.",
        "date": "03312016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "AIG CEO says MetLife ruling an opportunity for AIG "
    },
    {
        "content": "* U.S. Treasury spokesperson says \"strongly disagree\" with court's decision on Metlife",
        "date": "03302016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-U.S. Treasury spokesperson says \"strongly disagree\" with court's decision on Metlife "
    },
    {
        "content": "* Indexes up: Dow 0.48 pct  S&P 0.48 pct  Nasdaq 0.46 pct   (Adds details  updates prices)",
        "date": "03302016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "US STOCKS-Wall St pares some gains as oil retreats "
    },
    {
        "content": "* AIG CEO Peter Hancock on Metlife ruling-i think the whole world was somewhat surprised- CNBC",
        "date": "03312016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "BRIEF-AIG CEO Peter Hancock on Metlife ruling-i think the whole world was somewhat surprised- CNBC "
    },
    {
        "content": "WASHINGTON  March 30 U.S. District Judge Rosemary Collyer on Wednesday struck down the designation made by the heads of the country's financial regulatory agencies that major insurer Metlife Inc. is systemically important to the U.S. financial system.",
        "date": "03302016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. district judge strikes down designation of MetLife as 'too big to fail' "
    },
    {
        "content": "* Board of directors has adopted an amendment to company's bylaws",
        "date": "03212016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "BRIEF-Metlife board has adopted an amendment to company's bylaws "
    },
    {
        "content": "WASHINGTON  March 2 The U.S. Financial Stability Oversight Council voted on Wednesday not to rescind insurance company MetLife's designation for tougher oversight by the Federal Reserve.",
        "date": "03022016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. regulators vote to keep MetLife's high-risk tag "
    },
    {
        "content": "Feb 25 MetLife Inc  which is in the process of trimming down its businesses  said it was in talks with MassMutual Financial Group regarding a possible sale of MetLife Premier Client Group  its U.S. retail adviser group.",
        "date": "02252016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife in talks to sell U.S. retail adviser group to MassMutual "
    },
    {
        "content": "Feb 1 MetLife Inc's agricultural loans totalled $3.2 billion in 2015  down from a record $3.6 billion in 2014 as commodity prices hit a five-year low and a drought gripped California  the company said in a statement on Monday.",
        "date": "02012016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife's agricultural loans fall to $3.2 billion in 2015 "
    },
    {
        "content": "Jan 19 MetLife Inc  the largest U.S. life insurer  said it has formed a real estate investment venture with New York State Common Retirement Fund  the third-largest U.S. public pension fund.",
        "date": "01192016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife  New York State Common Retirement Fund form real estate JV "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 13 (Fitch) MetLife's proposed restructuring announced Tuesday  has important implications for the life insurance industry  which faces  significant competitive and regulatory pressures in the U.S. and globally  says  Fitch Ratings. The move demonstrates how the evolving regulatory environment  affects the industry's capital management and operating strategies. The prospect  of increasing regulatory capital requirements ",
        "date": "01132016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Fitch: MetLife Move Has Implications for Global Insurers "
    },
    {
        "content": "Jan 13 The following are the top stories in The Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "01132016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "PRESS DIGEST - Wall Street Journal - Jan 13 "
    },
    {
        "content": "Jan 12 MetLife Inc  the largest U.S. life insurer  plans to separate a substantial portion of its U.S. retail business from the core company  saying on Tuesday that the \"regulatory environment\" helped drive its decision.",
        "date": "01122016",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "UPDATE 2-MetLife plans to split off U.S. retail business; shares rise "
    },
    {
        "content": "MetLife Inc   the largest U.S. life insurer  plans to separate a substantial portion of its U.S. retail business from the core company  saying on Tuesday that the \"regulatory environment\" helped drive its decision.",
        "date": "01132016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife plans to split off U.S. retail business; shares rise "
    },
    {
        "content": "Metlife Inc   the largest U.S. life insurer  said it plans to separate a substantial portion of its U.S. retail business.",
        "date": "01122016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Metlife plans to separate U.S. retail business; shares rise "
    },
    {
        "content": "Jan 12 Metlife Inc  the largest U.S. life insurer  plans to separate a substantial portion of its U.S. retail segment.",
        "date": "01122016",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Metlife plans to separate U.S. retail business "
    },
    {
        "content": "A federal appeals court has revived a discrimination lawsuit  alleging Metropolitan Life Insurance Co. fired an executive as part a plan to purge older employees and replace them with younger ones.",
        "date": "12222015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "11th Circuit gives age discrimination suit against MetLife new life "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  December 17 (Fitch) Fitch Ratings has affirmed all existing ratings  assigned to MetLife  Inc. (MetLife) and its subsidiaries  including the 'AA-'  Insurer Financial Strength (IFS) ratings assigned to certain domestic life  insurance companies and the 'A' Issuer Default Rating (IDR) assigned to MetLife.  The Rating Outlook for MetLife and its subsidiaries is Stable.  KEY RATING DRIVERS The affirmation of MetLife's ratings refle",
        "date": "12172015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Fitch Affirms MetLife's Ratings; Outlook Stable "
    },
    {
        "content": "Metlife Inc   the largest U.S. life insurer  said it has increased its share repurchase program to $1 billion.",
        "date": "09222015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Metlife boosts share buyback program to $1 billion "
    },
    {
        "content": "Sept 22 Metlife Inc  the largest U.S. life insurer  said it has increased its share repurchase program to $1 billion.",
        "date": "09222015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Metlife boosts share buyback program to $1 bln "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 11 (Fitch) Fitch Ratings has affirmed all existing ratings  assigned to MetLife  Inc. (MetLife) and its subsidiaries  including the 'AA-'  Insurer Financial Strength (IFS) ratings assigned to certain domestic life  insurance companies and the 'A' Issuer Default Rating (IDR) assigned to MetLife.  The Rating Outlook for MetLife and its subsidiaries is Stable. KEY RATING DRIVERS The affirmation of MetLife's ratings refle",
        "date": "09112015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Fitch Affirms MetLife's Ratings; Outlook Stable "
    },
    {
        "content": "Sept 1 Life insurance provider Metlife Inc  appointed Bharat Kannan  head of employee benefits Asia  as chief distribution officer for Asia.",
        "date": "09012015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MOVES-Metlife names Bharat Kannan as chief distribution officer "
    },
    {
        "content": "July 29 MetLife Inc  the biggest U.S. life insurer  reported a 21 percent fall in quarterly profit due to $593 million in derivatives losses from rising interest rates and the weakening of the dollar against certain currencies.",
        "date": "07292015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife profit falls on derivatives losses "
    },
    {
        "content": "* Operating profit rises 12 pct   (Adds analyst comment  background)",
        "date": "07292015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 2-MetLife profit falls on derivatives losses "
    },
    {
        "content": "WASHINGTON  June 29 MetLife asked a federal judge on Monday to force the U.S. government to hand over 500 pages of confidential records that relate to financial regulators' decision to designate the insurance giant as systemically important.",
        "date": "06292015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife accuses U.S. risk panel of secrecy; demands access to records "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 28 (Fitch) Fitch Ratings has assigned a 'BBB' rating to MetLife   Inc.'s (MetLife) issuance of $1.5 billion in series C fixed-to-floating rate  non-cumulative perpetual preferred stock. KEY RATING DRIVERS Fitch expects proceeds from the issuance to be used to redeem approximately $1.5  billion of 6.50% series B non-cumulative perpetual preferred stock. Accordingly   Fitch does not expect today's issuance to have a significa",
        "date": "05282015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Fitch Rates MetLife's Preferred Stock Issuance 'BBB' "
    },
    {
        "content": "May 11 The U.S. government on Monday said MetLife Inc's lawsuit fighting its designation as being systemically important to the economy  often referred to as \"too big to fail\"  should be dismissed.",
        "date": "05122015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. says MetLife too-big-to-fail lawsuit should be dismissed "
    },
    {
        "content": "MetLife Inc   the largest U.S. life insurer   reported a better-than-expected quarterly profit due to gains from investments and derivatives.",
        "date": "05062015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Life insurer MetLife profit beats estimates on investment gains "
    },
    {
        "content": "May 6 MetLife Inc  the largest U.S. life insurer  reported a 64 percent jump in quarterly profit  helped by investment and derivative gains.",
        "date": "05062015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. life insurer MetLife profit jumps 64 pct "
    },
    {
        "content": "WASHINGTON  May 8 The U.S. government is delaying its public response to a legal challenge by insurance firm MetLife Inc by a few days  court documents showed  to give the company time to redact any commercially sensitive information.",
        "date": "05082015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. regulators to respond in MetLife lawsuit next week "
    },
    {
        "content": "March 4 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03042015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MOVES- NYSE  MetLife  JPMorgan  Legal & General  AXA Investment "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 02 (Fitch) Fitch Ratings has assigned an 'A-' rating to MetLife   Inc.'s (MetLife) issuance of $500 million of senior unsecured notes due 2025 and  $1 billion of senior unsecured notes due 2045. KEY RATING DRIVERS Fitch expects that the proceeds from the issuance will be used to repay $1  billion of 5.00% senior notes that mature on June 15  2015 and for general  corporate purposes. MetLife's ratings reflect Fitch's view ",
        "date": "03022015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Fitch Rates MetLife's Debt Issuance 'A-' "
    },
    {
        "content": "United State's largest life insurer MetLife Inc  reported a better-than-expected quarterly profit due to gains from investments and derivatives  reflecting falling interest rates and a rising dollar.",
        "date": "02112015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "MetLife's profit beats estimates on investment gains "
    },
    {
        "content": "Feb 11 United State's largest life insurer MetLife Inc reported a better-than-expected quarterly profit due to gains from investments and derivatives  reflecting falling interest rates and a rising dollar.",
        "date": "02112015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 1-MetLife's profit beats estimates on investment gains "
    },
    {
        "content": "Feb 11 Largest U.S. life insurer MetLife Inc's  quarterly profit jumped about 70 percent  helped by gains from investments and derivatives.",
        "date": "02112015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife's quarterly profit rises 70 percent "
    },
    {
        "content": "NEW YORK Major mortgage bond investors including BlackRock  MetLife and Pimco on Friday took a first step toward suing Ocwen Financial Corp   accusing it of having failed to properly collect payments on $82 billion of home loans  according to documents seen by Reuters and a person familiar with the matter.",
        "date": "01232015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Exclusive: Big mortgage investors take first step toward suing Ocwen "
    },
    {
        "content": "NEW YORK Major mortgage bond investors including BlackRock  MetLife and Pimco on Friday took a first step toward suing Ocwen Financial Corp  accusing it of having failed to properly collect payments on $82 billion of home loans  according to documents seen by Reuters and a person familiar with the matter.",
        "date": "01232015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Big mortgage investors take first step toward suing Ocwen "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - MetLife is giving harried financial watchdogs yet another risk to ponder. U.S. courts have squelched a slew of securities and commodities rules. Designations of systemically important financial institutions  known as SIFIs  may be next  as the insurer with $900 billion of assets challenges its big-and-risky status.",
        "date": "01142015",
        "name": "MetLife Inc",
        "news_type": "topStory",
        "symbol": "MET",
        "title": "Breakingviews: MetLife SIFI suit is risk for harried watchdogs "
    },
    {
        "content": "WASHINGTON MetLife Inc on Tuesday sued U.S. regulators over a decision to subject the insurer to tougher oversight because it harbors enough risk to endanger the financial system if the next crisis hits.",
        "date": "01132015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. insurer MetLife to sue regulators over high-risk tag "
    },
    {
        "content": "WASHINGTON  Jan 13 MetLife Inc on Tuesday sued U.S. regulators over a decision to subject the insurer to tougher oversight because it harbors enough risk to endanger the financial system if the next crisis hits.",
        "date": "01132015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "UPDATE 3-U.S. insurer MetLife to sue regulators over high-risk tag "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Challenging regulators can often come back to bite you in the rear. JPMorgan  proved this by publicly questioning the reforms of the Dodd-Frank Act and then privately failing to rein in some particularly naughty behavior by some of its traders. That's what makes MetLife's decision to take its watchdogs to court so surprising.",
        "date": "01132015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "Breakingviews: MetLife's Snoopy takes on the regulatory Red Baron "
    },
    {
        "content": "WASHINGTON  Jan 13 MetLife said it would file on Tuesday a lawsuit against regulators subjecting it to tougher oversight  challenging their verdict the firm harbors enough risk to bring down the financial system in a crisis.",
        "date": "01132015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "U.S. insurer MetLife says to sue regulators over tougher rules "
    },
    {
        "content": "WASHINGTON  Jan 12 The Federal Reserve's new role as the top U.S. insurance regulator will be in the spotlight this week as MetLife decides whether to challenge tougher oversight by the central bank in court.",
        "date": "01132015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "RPT-MetLife could further complicate Fed's new role as insurance cop "
    },
    {
        "content": "WASHINGTON  Jan 12 The Federal Reserve's new role as the top U.S. insurance regulator will be in the spotlight this week as MetLife decides whether to challenge tougher oversight by the central bank in court.",
        "date": "01132015",
        "name": "MetLife Inc",
        "news_type": "normal",
        "symbol": "MET",
        "title": "MetLife could further complicate Fed's new role as insurance cop "
    }
]