[
    {
        "content": "* Manulife Financial Corp - ‍priced offering in Singapore of 500 million Singapore dollars principal amount of 3.00% subordinated notes due november 21  2029​",
        "date": "11142017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial ‍prices offering in Singapore of 500 mln Singapore dollars "
    },
    {
        "content": "TORONTO Two of Canada's biggest insurance companies reported third-quarter earnings on Wednesday that beat market expectations  benefiting in part from strong growth in Asia.",
        "date": "11082017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Canadian insurers Manulife  Sun Life beat earnings forecasts "
    },
    {
        "content": "* Sun Life looking for more Asian acquisitions (Adds comments from Manulife  Sun Life CEOs)",
        "date": "11082017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 2-Canadian insurers Manulife  Sun Life beat earnings forecasts "
    },
    {
        "content": "TORONTO  Nov 8 Canada's biggest insurer Manulife Financial Corp on Wednesday reported third quarter results which were ahead of expectations  driven in part by strong growth from its Asian business.",
        "date": "11082017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Canadian insurer Manulife's 3rd qtr earnings beat market view "
    },
    {
        "content": "* Manulife reports 3q17 net income of $1 105 million  core earnings of $1 085 million  double-digit sales and new business value growth in asia and the 31st consecutive quarter of positive net flows",
        "date": "11082017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife reports Q3 core earnings per share of $0.53 "
    },
    {
        "content": "* Manulife could sell underperforming parts of business -CEO (Adds comments from CEO  stock prices)",
        "date": "11092017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 2-Manulife 'looking at all options' for John Hancock  CEO says "
    },
    {
        "content": "TORONTO  Nov 9 Canadian insurer Manulife is \"looking at all options\" in relation to the future of its U.S. unit John Hancock  new Chief Executive Roy Gori said in an interview on Thursday.",
        "date": "11092017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife \"looking at all options\" for John Hancock -CEO "
    },
    {
        "content": "TORONTO  Sept 12 Manulife  Canada's biggest insurer  said on Tuesday that it planned to promote the head of its Asian business  Philip Witherington  to be chief financial officer from the start of 2018.",
        "date": "09122017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 1-Manulife promotes Asia head to chief financial officer "
    },
    {
        "content": "TORONTO  Sept 12 Manulife  Canada's biggest insurer  said on Tuesday that it planned to promote the head of its Asian business  Philip Witherington  to be chief financial officer from the start of 2018.",
        "date": "09122017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife promotes Asia head to chief financial officer "
    },
    {
        "content": "* Says bringing all wealth and asset management businesses together into primary reporting segment  global wealth and asset management​",
        "date": "09122017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife announces structural and leadership changes "
    },
    {
        "content": "* Manulife Financial Corp - ‍debentures mature on August 20  2029​",
        "date": "08152017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife announces subordinated debenture issue "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 17 (Fitch) Fitch Ratings assigns a 'BBB+' rating to Manulife Financial Corporation's (MFC) C$750 million 3.049% rate-reset subordinated notes due 2029. KEY RATING DRIVERS The rating for the new offering is equivalent to the rating on MFC's existing subordinated debt. Proceeds from the issuance will be used for general corporate purposes  including funding the redemption of MFC's 7.768% medium-term notes due April 8  2019",
        "date": "08172017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Fitch Rates Manulife Financial's Subordinated Notes 'BBB+' "
    },
    {
        "content": "* Manulife announces intention to redeem 7.768 pct medium term notes",
        "date": "08152017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife announces intention to redeem 7.768 pct medium term notes "
    },
    {
        "content": "* Sun Life CEO says Asian business growing rapidly (Adds comment from Sun Life CEO  analyst  paragraphs 5-13)",
        "date": "08092017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 2-Canadian insurers Manulife  Sun Life beat earnings forecasts "
    },
    {
        "content": "* ‍Ambrose is former leader of Canada's official opposition in house of commons and former leader of conservative party of Canada​ Source text for Eikon: Further company coverage:",
        "date": "08092017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Rona Ambrose appointed to Manulife's board of directors "
    },
    {
        "content": "TORONTO  Aug 9 Canadian insurer Manulife Financial Corp on Wednesday reported second-quarter results that were ahead of market expectations  driven in part by strong growth from its Asian business.",
        "date": "08092017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Canada's Manulife's 2nd-quarter earnings beat market forecasts "
    },
    {
        "content": "TORONTO Manulife Financial Corp   Canada's biggest life insurer  on Thursday played down reports that it is exploring an initial public offering of U.S. unit John Hancock.",
        "date": "08102017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Canada's Manulife plays down John Hancock spinoff talk "
    },
    {
        "content": "* Spinoff would depend on if it created shareholder value -CEO",
        "date": "08102017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 2-Canada's Manulife plays down John Hancock spinoff talk "
    },
    {
        "content": "* Manulife's outgoing ceo (not new ceo) says ultimate determination on possible john hancock spin-off would be if it created shareholder value",
        "date": "08102017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife says John Hancock spin-off would depend on whether it created shareholder value "
    },
    {
        "content": "TORONTO  Aug 10 Manulife Financial Corp's Chief Financial Officer Steve Roder on Thursday played down reports the insurer is exploring an initial public offering of its U.S. unit John Hancock.",
        "date": "08102017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife CFO plays down talk of John Hancock spin-off "
    },
    {
        "content": "TORONTO Two of Canada's biggest insurance companies on Wednesday reported second-quarter earnings that beat market expectations  benefiting in part from strong growth in Asia.",
        "date": "08102017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Canadian insurers Manulife  Sun Life beat earnings forecasts "
    },
    {
        "content": "* Manulife Financial Corporation announces conversion privilege of non-cumulative rate reset class 1 shares series 9",
        "date": "07272017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial Corp announces conversion privilege of non-cumulative rate reset class 1 shares series 9 "
    },
    {
        "content": "* Manulife announces intention to redeem 3.938% fixed/floating Series A subordinated debentures",
        "date": "07272017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife announces intention to redeem 3.938% fixed/floating Series A subordinated debentures "
    },
    {
        "content": "July 13 Two units of Canadian insurer Manulife Financial Corp settled with the Ontario Securities Commission (OSC) to resolve allegations that there were inadequacies in their controls and supervision that led to some clients paying excess fees.",
        "date": "07132017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Manulife settles excess fee allegations with regulators "
    },
    {
        "content": "TORONTO  July 13 Canada's main stock index finished little changed on Thursday as gains by Manulife Financial Corp offset declines in  interest-rate sensitive shares one day after the Bank of Canada raised rates.",
        "date": "07132017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "CANADA STOCKS-TSX ends little changed as losses offset by Manulife gains "
    },
    {
        "content": "* Ontario Securities Commission approves no-contest settlement agreement with Manulife Securities Incorporated and Manulife Securities Investment Services Inc",
        "date": "07132017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Ontario Securities Commission approves no-contest settlement agreement with Manulife Securities Inc and Manulife Securities Investment Services Inc "
    },
    {
        "content": "July 13 Canada's biggest life insurer Manulife Financial Corp is looking to list or spin off its U.S. unit John Hancock Financial Services  the Wall Street Journal reported on Thursday  citing people familiar with the matter.",
        "date": "07132017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife exploring IPO or spin off for John Hancock unit - WSJ "
    },
    {
        "content": "* Manulife exploring IPO or spinoff for John Hancock unit - WSJ Source text: http://on.wsj.com/2tiRM8R Further company coverage:",
        "date": "07132017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife exploring IPO or spinoff of its John Hancock unit - WSJ "
    },
    {
        "content": "May 25 Manulife Financial Corp  Canada's biggest life insurer  said Roy Gori  head of its Asia division  would succeed company veteran Donald Guloien as its chief executive officer.",
        "date": "05252017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 1-Canadian insurer Manulife names Asia head Roy Gori CEO "
    },
    {
        "content": "May 25 Manulife Financial Corp  Canada's biggest life insurer  said on Thursday that Roy Gori would replace Donald Guloien as chief executive officer.",
        "date": "05252017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Canadian insurer Manulife names Roy Gori CEO "
    },
    {
        "content": "* Manulife CEO Donald Guloien announces his intention to retire as of Sept. 30; Roy Gori to succeed Guloien as CEO on Oct. 1",
        "date": "05252017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife CEO Donald Guloien to retire as of Sept. 30 "
    },
    {
        "content": "TORONTO  May 3 Manulife Financial Corp  Canada's biggest life insurer  on Wednesday reported a rise in first-quarter earnings  slightly beating market forecasts with help from strong sales in Asia.",
        "date": "05032017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 1-Manulife quarterly earnings rise  helped by strong sales in Asia "
    },
    {
        "content": "* Manulife reports 1Q17 net income of $1 350 million and core earnings of $1 101 million  and $1 trillion in assets under management and administration",
        "date": "05032017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial Corp Q1 net income $1 350 million "
    },
    {
        "content": "TORONTO  May 3 Manulife Financial Corp  Canada's biggest life insurer  on Wednesday reported a rise in first quarter earnings  marginally beating market forecasts with help from strong sales in Asia.",
        "date": "05032017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife lifts quarterly earnings helped by strong sales in Asia "
    },
    {
        "content": "* Manulife announces intention to redeem 4.165 pct fixed/floating subordinated debentures",
        "date": "04282017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife reports intention to redeem subordinated debentures "
    },
    {
        "content": "April 11 Manulife Real Estate  the global real estate arm of Manulife Financial Corp  said on Tuesday it acquired 8 Cross Street  a 28-storey office tower in Singapore  for $526 million.",
        "date": "04112017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Manulife Real Estate buys Singapore property for $526 mln "
    },
    {
        "content": "* Manulife Real Estate acquired 355 000 square foot  class A office tower in Singapore for about US$526 million Source text for Eikon: Further company coverage:",
        "date": "04112017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife acquires 8 cross street in Singapore "
    },
    {
        "content": "* Says Gori will have responsibility for Manulife's global operating businesses Source text for Eikon: Further company coverage:",
        "date": "03292017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife appoints Roy Gori as president "
    },
    {
        "content": "HONG KONG Manulife Financial Corp  has been granted a license that will allow it to launch investment products in China through a wholly-owned local subsidiary  as Beijing further liberalizes its capital markets.",
        "date": "03152017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Manulife granted license to launch products from new Shanghai unit "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 17 (Fitch) Fitch Ratings has affirmed Manulife Financial  Corporation (MFC) and its primary insurance related operating subsidiaries'  ratings  including The Manufacturers Life Insurance Company (MLI) and John  Hancock Life Insurance Company (U.S.A.) (JHUSA). A full list of rating actions  follows at the end of this release. The Rating Outlook is Stable. KEY RATING DRIVERS MFC's ratings reflect very strong capitalization ",
        "date": "03172017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Fitch Affirms Manulife Financial; Outlook Stable "
    },
    {
        "content": "HONG KONG  March 15 Manulife Financial Corp  has been granted a licence that will allow it to launch investment products in China through a wholly-owned local subsidiary  as Beijing further liberalises its capital markets.",
        "date": "03152017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife granted licence to launch products from new Shanghai unit "
    },
    {
        "content": "TORONTO (Thomson Reuters Regulatory Intelligence) - Canada's anti-money laundering (AML) regulator will pursue a legislative review targeting its penalty program  following sustained public scrutiny over the agency's 2016 decision to withhold the identity of a bank it sanctioned with a record fine  Gérald Cossette  director of the Financial Transactions and Reports Analysis Centre (FINTRAC)  said in a statement February 27 (http://www.fintrac-canafe.gc.ca/about-apropos/message-eng.asp).",
        "date": "03072017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Canadian AML regulator to seek penalty program review after shielding Manulife in record fine "
    },
    {
        "content": "* Manulife Financial Corp - Manulife Investments will make changes to its platform terminating certain funds  Source text for Eikon:  Further company coverage:",
        "date": "03062017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Investments terminates certain funds "
    },
    {
        "content": "TORONTO  Feb 27 Manulife Financial Corp said on Monday its banking subsidiary was fined by Canada's financial intelligence agency last year for what Manulife described as administrative lapses in reporting financial transactions.",
        "date": "02272017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 1-Manulife says was unnamed bank fined by Canadian watchdog "
    },
    {
        "content": "TORONTO  Feb 27 Manulife Financial Corp said on Monday its banking subsidiary was fined by Canada's financial intelligence agency last year for what Manulife described as administrative lapses in reporting financial transactions.",
        "date": "02272017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife says was unnamed bank fined by watchdog "
    },
    {
        "content": "* Manulife issues statement regarding FINTRAC administrative penalty",
        "date": "02272017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife issues statement regarding FINTRAC administrative penalty "
    },
    {
        "content": "* Manulife Financial Corporation prices U.S. public offering of subordinated notes",
        "date": "02212017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial Corp prices U.S. public offering of subordinated notes "
    },
    {
        "content": "* Manulife investments announces changes to the canadian fundamental equity team",
        "date": "02132017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Investments says head of canadian fundamental equity team Skiba to retire  effective Dec.  2017 "
    },
    {
        "content": "TORONTO  Feb 9 Canada's main stock index rose on Thursday as higher oil prices supported energy shares  while Manulife Financial Corp also climbed after meeting a long-held target to achieve an annual profit of C$4 billion in 2016.",
        "date": "02092017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "CANADA STOCKS-TSX rises  led by energy and Manulife "
    },
    {
        "content": "* Earnings per share C$1.96 vs C$1.85 average forecast   (Adds comment from CFO  background on target)",
        "date": "02092017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 3-Canada's Manulife hits C$4 billion profit milestone "
    },
    {
        "content": "* Manulife reports 2016 net income of $2.9 billion and core earnings of $4.0 billion (up 34% and 17%  respectively  compared with 2015)  strong top line growth and a dividend increase of 11%",
        "date": "02092017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife qtrly diluted core earnings per common share $0.63 "
    },
    {
        "content": "TORONTO  Feb 9 Manulife Financial Corp  met its target to achieve earnings of C$4 billion in 2016  reporting results which beat market expectations  benefiting from a strong performance in Asia.",
        "date": "02092017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife hits 2016 earnings target  beats market expectations "
    },
    {
        "content": "* Manulife announces agreement to settle related securities class action litigation",
        "date": "01312017",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife to settle related securities class action litigation "
    },
    {
        "content": "SINGAPORE  Jan 23 Siam Commercial Bank Pcl (SCB)  has begun to formally seek bids for its life insurance business in a sale that could raise about $3 billion for Thailand's third-biggest lender  said people with knowledge of the process.",
        "date": "01232017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 1-Thailand's Siam Commercial Bank seeks bids for insurance business -sources "
    },
    {
        "content": "SINGAPORE  Jan 23 Siam Commercial Bank Pcl (SCB)  has begun to formally seek bids for its life insurance business in a sale that could raise about $3 billion for Thailand's third-biggest lender  said people with knowledge of the process.",
        "date": "01232017",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Thailand's Siam Commercial Bank seeks bids for insurance business-sources "
    },
    {
        "content": "* Manulife Financial Corp - entered into an agreement to privately place U.S.$270 million principal amount of 3.527% senior notes due December 2  2026",
        "date": "11282016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial announces USD senior notes private placement "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 21 (Fitch) Fitch Ratings expects to assign a 'BBB-' rating to  Manulife Financial Corporation (MFC) CAD475 million 4.85% Non-cumulative Rate  Reset Class 1 Series 23 preferred shares.  KEY RATING DRIVERS The rating for the new offering is equivalent to the rating on MFC's existing  preferred shares. Under Fitch's notching methodology  a baseline recovery  assumption of Poor and a nonperformance risk assessment of Moder",
        "date": "11212016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Fitch Expects to Rate Manulife Financial's Preferred Stock 'BBB-' "
    },
    {
        "content": "* Manulife Financial Corporation announces preferred share issue",
        "date": "11142016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial says to issue 14 mln series 23 preferred shares $25/share "
    },
    {
        "content": "* Sun Life CEO says Asia can be 20 percent of business   (Recasts  adds comment from Sun Life CEO)",
        "date": "11102016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 4-Shares in Canadian insurers surge as profits beat view "
    },
    {
        "content": "* Sets quarterly dividend of C$0.185 per share  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife financial sets quarterly dividend of C$0.185 per share "
    },
    {
        "content": "* Manulife reports 3Q16 net income of $1.1 billion and core earnings of $1 billion  strong growth in Asia  and positive net flows in wealth and asset management",
        "date": "11102016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial Corp reports 3Q16 results "
    },
    {
        "content": "Nov 10 Manulife Financial Corp  Canada's biggest life insurer  reported a 79.6 percent rise in quarterly profit  mainly due to gains from its diverse investments.",
        "date": "11102016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Canada's Manulife posts 79.6 pct rise in profit "
    },
    {
        "content": "* Announced intention to redeem at par on Dec 15 all outstanding $550 million principal amount of 4.448% senior debentures",
        "date": "11012016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife announces intention to redeem senior debentures "
    },
    {
        "content": "* Does not intend to exercise right to redeem any outstanding 8 million non-cumulative rate reset class 1 shares series 5 on dec. 19  2016",
        "date": "10202016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial says conversion privilege of non-cumulative rate reset Class 1 shares Series 5 "
    },
    {
        "content": "* Debentures are redeemable at MLI's option on or after November 18  2016 at a redemption price per debenture equal to par",
        "date": "09192016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife announces intention to redeem 4.21 pct fixed/floating subordinated debentures "
    },
    {
        "content": "TORONTO  Sept 8 Manulife Financial Corp   Canada's biggest life insurer  would consider share buy-backs and expects a \"pause\" in acquisition activity  Chief Executive Donald Guloien said on Thursday.",
        "date": "09082016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Manulife CEO says considering share buy-backs "
    },
    {
        "content": "* MANULIFE CEO SAYS GIVEN DONE MOST OF WHAT WANTS TO DO ON ACQUISITION FRONT WILL TAKE A LOOK AT STOCK BUY-BACKS  Further company coverage:    (Reporting by Matt Scuffham)",
        "date": "09082016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife CEO says will look at share buy-backs "
    },
    {
        "content": "* Gretchen Garrigues appointed global chief marketing officer at Manulife  Source text for Eikon:  Further company coverage:",
        "date": "08082016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife appoints Gretchen Garrigues as global chief marketing officer "
    },
    {
        "content": "Aug 5 Stock futures pointed to a higher opening for Canada's main stock index on Friday as investors keenly await employment figures for July as well as U.S. payroll data.",
        "date": "08052016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "CANADA STOCKS-TSX futures rise ahead of July employment figures "
    },
    {
        "content": "* Manulife partners with nervana systems on artificial intelligence and deep learning technologies to enhance investment research  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "08022016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife partners with Nervana Systems to enhance investment research "
    },
    {
        "content": "TORONTO Manulife Financial Corp   Canada's biggest life insurer  said it could buy back shares after reporting lower-than-expected quarterly earnings and warning of a future C$500 million ($380 million) charge.",
        "date": "08042016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Manulife mulls buybacks after disappointing quarter "
    },
    {
        "content": "* Shares down 5.4 percent   (Recasts  adds CEO comments from conference call)",
        "date": "08042016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 4-Manulife mulls buybacks after disappointing quarter "
    },
    {
        "content": "TORONTO  Aug 4 Canada's main stock index inched to a higher close on Thursday as a bounce in oil prices boosted energy shares  while an earnings miss from Manulife Financial Corp weighed on the insurer.",
        "date": "08042016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "CANADA STOCKS-TSX ends barely higher as oil bounces; Manulife weighs "
    },
    {
        "content": "* Manulife CEO says giving consideration to buying back shares in company",
        "date": "08042016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife CEO says considering share buy-backs "
    },
    {
        "content": "TORONTO  Aug 4 Canada's main stock index fell on Thursday as shares of insurer Manulife Financial Corp  plunged after poor earnings and the exit of a major investor hurt Canadian Pacific Railway stock.",
        "date": "08042016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "CANADA STOCKS-TSX falls as Manulife  CP Rail weigh "
    },
    {
        "content": "TORONTO  Aug 4 Canada's main stock index moved barely higher in early trade on Thursday  as energy stock gains offset losses for Manulife Financial Corp after its earnings missed estimates.",
        "date": "08042016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "CANADA STOCKS-TSX slightly higher; Manulife weighs "
    },
    {
        "content": "* CEO says core earnings  net income 'disappointing'   (Adds analyst comment  dividend  cost savings)",
        "date": "08042016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 2-Manulife profit below expectations  warns of C$500 mln charge "
    },
    {
        "content": "* Sets quarterly dividend of C$0.185 per share  Source text for Eikon:  Further company coverage:",
        "date": "08042016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial sets quarterly dividend of C$0.185/shr "
    },
    {
        "content": "* Manulife Financial Corporation announces results of conversion privilege of non-cumulative Rate Reset Class 1 shares series 3",
        "date": "06072016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife announces results of conversion privilege of Non-cumulative Rate Reset Class 1 Shares Series 3 "
    },
    {
        "content": "* Priced an offering in taiwan of U.S. $1 billion principal amount of 4.70% senior notes due June 23  2046",
        "date": "06072016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife announces USD senior notes issue in Taiwan "
    },
    {
        "content": "June 2 Manulife Asset Management Private Markets:",
        "date": "06022016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife acquires 49 pct equity interest in QMLP "
    },
    {
        "content": "* Insurer eyes further partnerships in region   (Adds comments from CFO interview)",
        "date": "05052016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 2-Canada's Manulife seeks new Asia deals to boost growth "
    },
    {
        "content": "May 5 Manulife Financial Corp  Canada's biggest life insurer  reported a 45 percent jump in first-quarter earnings  boosted by strong insurance sales in Asia and gains from interest rate movements.",
        "date": "05052016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "REFILE-UPDATE 1-Canada's Manulife profit jumps 45 pct on Asia sales "
    },
    {
        "content": "* Manulife reports 1Q16 core earnings of $905 million and net income of $1 045 million  strong top line growth  and continued positive net flows in its wealth and asset management businesses",
        "date": "05052016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife reports Q1 core earnings of 44 cents per share "
    },
    {
        "content": "May 5 Manulife Financial Corp  Canada's biggest life insurer  reported a 45 percent jump in first-quarter earnings  boosted by strong insurance sales in Asia and gains from interest rate movements.",
        "date": "05052016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "CORRECTED-UPDATE 1-Canada's Manulife profit jumps 45 pct jump on Asia sales "
    },
    {
        "content": "* Sets quarterly dividend of c$0.185per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05052016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial sets quarterly dividend of c$0.185 per share "
    },
    {
        "content": "May 5 Manulife Financial Corp  Canada's biggest life insurer  reported a 45 percent jump in first-quarter earnings  boosted by strong sales in Asia and gains from interest rate movements.",
        "date": "05052016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Canada's Manulife posts 45 pct rise in profit "
    },
    {
        "content": "April 25 Canadian insurer Manulife Financial Corp said Charles Guay would relinquish his role as president and chief executive of Manulife Quebec at the end of 2016.",
        "date": "04252016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "MOVES-Manulife Quebec CEO to step down at 2016-end "
    },
    {
        "content": "* Will accept life insurance applications from persons who have tested positive for human immunodeficiency virus",
        "date": "04222016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial to accept life insurance applications from Canadians who test HIV-positive "
    },
    {
        "content": "* Announces passing of former chairman and chief executive officer  edwin sydney jackson   Source text for Eikon:   Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04122016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife Financial announces passing of former Chairman and CEO  Edwin Sydney Jackson "
    },
    {
        "content": "* Cindy Forbes has been appointed chief analytics officer  effective april 1  2016",
        "date": "03222016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "BRIEF-Manulife appoints chief analytics officer "
    },
    {
        "content": "TORONTO  Feb 11 Canada's main stock index ended lower on Thursday  weighed down by its heavyweight financials sector and especially insurer Manulife Financial after it missed earnings expectations and said it would have trouble reaching its 2016 targets.",
        "date": "02112016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "CANADA STOCKS-TSX falls as Manulife  other financials weigh "
    },
    {
        "content": "TORONTO Canadian insurer Manulife Financial Corp  reported fourth-quarter earnings that missed market estimates on Thursday  hit by the impact of weak oil prices on its investments.",
        "date": "02112016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife profit misses estimates on energy investments "
    },
    {
        "content": "TORONTO  Feb 11 Canadian insurer Manulife Financial Corp reported fourth-quarter earnings that missed market estimates on Thursday  hit by the impact of weak oil prices on its investments.",
        "date": "02112016",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 2-Manulife profit misses estimates on energy investments "
    },
    {
        "content": "SINGAPORE  Jan 5 Canada's Manulife Financial Corp is looking to revive a plan to list a real estate investment trust in Singapore this year after an initial public offering (IPO) was shelved last year due to poor market conditions.",
        "date": "01052016",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Canada's Manulife seeks to revive Singapore REIT IPO this year -exec "
    },
    {
        "content": "TORONTO  Nov 12 Manulife Financial Corp   Canada's biggest insurer  is interested in a range of insurance and asset management acquisition opportunities across several markets in Asia  a top executive said on Thursday.",
        "date": "11132015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "RPT-UPDATE 1-Manulife eyes insurance  asset management deals in Asia "
    },
    {
        "content": "TORONTO  Nov 12 Manulife Financial Corp   Canada's biggest insurer  is interested in a range of insurance and asset management acquisition opportunities across several markets in Asia  a top executive said on Thursday.",
        "date": "11132015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife sees insurance  asset management deals in Asia "
    },
    {
        "content": "TORONTO Manulife Financial Corp   Canada's biggest insurer  reported a lower-than-expected quarterly profit on Thursday  hurt by losses on oil and gas investments.",
        "date": "11122015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Manulife profit misses expectations  hurt by energy losses "
    },
    {
        "content": "TORONTO  Nov 12 Manulife Financial Corp   Canada's biggest insurer  reported a lower-than-expected quarterly profit on Thursday  hurt by losses on oil and gas investments.",
        "date": "11122015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 3-Manulife profit misses expectations  hurt by energy losses "
    },
    {
        "content": "TORONTO Nov 12 Canada's main stock index opened lower on Thursday  pressured by fresh weakness in commodity markets  including a two-month low for crude oil  as well lower than expected profit from Manulife.",
        "date": "11122015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "CORRECTED-CANADA STOCKS-TSX falls  pressured by lower oil  Manulife miss "
    },
    {
        "content": "TORONTO  Nov 12 Manulife Financial Corp   Canada's biggest insurer  reported a lower quarterly profit for the third quarter on Thursday  with losses in its oil-and-gas investments weighing on the results.",
        "date": "11122015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife posts lower quarterly profit on energy investment losses "
    },
    {
        "content": "TORONTO  Oct 19 Given there is a good chance that Monday's Canadian federal election will not give one party control of the country's parliament  investors may want to brace for a period of political instability that could dent Canadian financial markets. The already weakened Canadian dollar could be most vulnerable to a further drop  market participants warned.",
        "date": "10192015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Investors may face rough ride if Canadian election leads to political instability "
    },
    {
        "content": "* Retirement savings is big business opportunity in Hong Kong   (Adds details of potential deal and background on Hong Kong's pension market)",
        "date": "09092015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 1-Manulife nears $400 mln deal to buy StanChart's HK pension business-sources "
    },
    {
        "content": "HONG KONG/SINGAPORE  Sept 9 Canadian insurer Manulife Financial Corp is nearing a deal to buy British bank Standard Chartered's Hong Kong pension business for about $400 million  people familiar with the matter told Reuters.",
        "date": "09092015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife nears $400 mln deal to buy StanChart's HK pension business-sources "
    },
    {
        "content": "TORONTO  Aug 6 Manulife Financial Corp  reported a higher adjusted quarterly profit that was in line with market expectations on Thursday  boosted by growth in its wealth management and life insurance operations.",
        "date": "08062015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 1-Manulife core profit rises on wealth management  insurance gains "
    },
    {
        "content": "TORONTO  July 6 Manulife Financial Corp's  banking unit is planning to install about 830 automated banking machines across Canada  as it attempts to take a bigger share of the nation's retail banking market.",
        "date": "07062015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Manulife Bank to install 830 automated banking machines across Canada "
    },
    {
        "content": "* First big Asian IPO outside China shelved on market volatility",
        "date": "07062015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 1-Manulife shelves $420 mln Singapore REIT IPO as markets swoon "
    },
    {
        "content": "SINGAPORE  July 6 Canada's Manulife Financial Corp said on Monday it was delaying a plan to raise $421 million through a Singapore listing of a real estate investment trust (REIT)  citing unfavourable market conditions.",
        "date": "07062015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Canada's Manulife to delay Singapore REIT listing due to market conditions "
    },
    {
        "content": "SINGAPORE Canada's Manulife Financial Corp has shelved its plan to raise $421 million through a Singapore listing of a real estate investment trust (REIT) backed by three U.S. office properties  IFR reported on Monday.",
        "date": "07062015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Canada's Manulife shelves Singapore REIT IPO: IFR "
    },
    {
        "content": "SINGAPORE  July 6 Canada's Manulife Financial Corp has shelved its plan to raise $421 million through a Singapore listing of a real estate investment trust (REIT) backed by three U.S. office properties  IFR reported on Monday.",
        "date": "07062015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Canada's Manulife shelves Singapore REIT IPO - IFR "
    },
    {
        "content": "SINGAPORE  June 29 Canada's Manulife Financial Corp seeks to raise $421 million through a Singapore listing of a real estate investment trust (REIT)  backed by three U.S. office properties  showed a prospectus filed with the city-state's central bank.",
        "date": "06292015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Canada's Manulife seeks to raise $421 mln in Singapore IPO of U.S. assets "
    },
    {
        "content": "Suzann Pettersen paid tribute to new coach Butch Harmon after winning the Manulife LPGA Classic by a stroke in Ontario on Sunday.",
        "date": "06072015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Pettersen birdies 16 and 17 to win Manulife LPGA Classic "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 05 (Fitch) Fitch Ratings has assigned an 'A-' rating to The  Manufacturers Life Insurance Company's (MLI) previously issued CAD350 million  2.389% fixed/floating subordinated debentures due 2026 (Manulife Financial  Corporation (MFC) guarantor).  KEY RATING DRIVERS Proceeds from the issuances will be used for general corporate purposes   including future refinancing requirements. Fitch expects June 30  2015 pro forma  fina",
        "date": "06052015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Fitch Rates Manulife's Sub Debt 'A-' "
    },
    {
        "content": "SINGAPORE  May 21 Canada's Manulife Financial Corp is seeking to list some of its U.S. property assets in Singapore in the second half of the year in an initial public offering worth $450 million  two people familiar with the deal said.",
        "date": "05212015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Manulife plans $450 mln IPO of U.S assets in Singapore -sources "
    },
    {
        "content": "* Second sale of HK business by StanC in less than six months",
        "date": "05142015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 1-StanChart seeking buyers for $350 mln HK pension business-sources "
    },
    {
        "content": "Canadian Brooke Henderson seized her second consecutive 36-hole lead after shooting a six-under 65 at the LPGA North Texas Shootout on Friday.",
        "date": "05022015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Canadian Henderson leads by one at Texas shootout "
    },
    {
        "content": "TORONTO  May 7 Manulife Financial Corp  reported a lower first-quarter profit on Thursday due to the impact of its energy holdings on its investment business  but the insurer raised its quarterly dividend.",
        "date": "05072015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 3-Manulife first-quarter profit falls; dividend raised "
    },
    {
        "content": "TORONTO  May 7 Manulife Financial Corp  Canada's largest insurer  reported a lower first-quarter profit on Thursday  hurt by weakness in U.S. wealth management sales and the impact of energy holdings on its investment business.",
        "date": "05072015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife posts lower first-quarter profit  increases dividend "
    },
    {
        "content": "TORONTO  April 20 Canada's main stock index rose on Monday as oil price gains helped oil and gas companies offset weakness in other sectors  while financials  another index heavyweight  also provided support.",
        "date": "04202015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "CANADA STOCKS-TSX rises as oil gains lift energy "
    },
    {
        "content": "HONG KONG/SINGAPORE Canadian insurer Manulife Financial Corp  is paying $1.2 billion to Singapore's DBS Group Holdings Ltd  for a 15-year partnership that will allow the insurer to sell products through the lender's Asian branch network.",
        "date": "04082015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "Manulife  DBS in $1.2 billion insurance deal for Asia "
    },
    {
        "content": "LONDON  April 8 Aviva said its attempts to extend its bancassurance agreement with Singapore's DBS Bank Ltd were hamstrung by high renewal costs that were neither \"economically viable or justifiable\" to shareholders.",
        "date": "04082015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 1-Aviva cites high renewal costs in the end of DBS bancassurance relationship "
    },
    {
        "content": "TORONTO  April 8 Canada's main stock index extended a rally into a fifth session on Wednesday as Manulife Financial Corp led major financial stocks higher after signing an Asian distribution deal  while consumer names also rose.",
        "date": "04082015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "CANADA STOCKS-Manulife deal helps TSX rise  but oil shares drop "
    },
    {
        "content": "LONDON  April 8 Aviva is quitting its bancassurance agreement with Singapore's DBS Bank Ltd  at the end of 2015  citing high renewal costs that it said were neither \"economically viable or justifiable\" to shareholders.",
        "date": "04082015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "RPT-Aviva to end DBS bancassurance relationship from end-2015 "
    },
    {
        "content": "LONDON  April 8 Aviva is quitting its bancassurance agreement with Singapore's DBS Bank Ltd  at the end of 2015  citing high renewal costs that it said were neither \"economically viable or justifiable\" to shareholders.",
        "date": "04082015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Aviva to end DBS bancassurance relationship from end-2015 "
    },
    {
        "content": "* Last major Asia \"bancassurance\" deal until HSBC renews in 2022",
        "date": "04082015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 1-Manulife  DBS in $1.2 bln insurance deal for Asia "
    },
    {
        "content": "HONG KONG  April 8 Canadian insurer Manulife Financial Corp is close to an about $1 billion deal to sell products through Singapore lender DBS Group Holdings Ltd's  branch network across Asia  a person with direct knowledge of the matter said.",
        "date": "04082015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife  DBS near $1 bln insurance deal for Asia - source "
    },
    {
        "content": "April 8 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04082015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "PRESS DIGEST - Wall Street Journal - April 8 "
    },
    {
        "content": "* Bombardier tumbles after posting loss  shuffling management",
        "date": "02122015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "CANADA STOCKS-TSX shrugs off insurer gloom; banks and energy lead "
    },
    {
        "content": "TORONTO  Feb 12 Canadian insurer Manulife Financial Corp reported a weaker-than-expected fourth-quarter profit on Thursday  hurt by a jump in some types of claims  and warned macroeconomic factors like low interest rates would produce \"headwinds\" in 2015.",
        "date": "02122015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "UPDATE 2-Manulife reports weaker fourth-quarter profit  stock falls "
    },
    {
        "content": "* Bombardier tumbles after posting loss  shuffling management",
        "date": "02122015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "CANADA STOCKS-TSX steady as insurers slip on results  energy gains "
    },
    {
        "content": "TORONTO  Feb 12 Manulife Financial Corp  reported a weaker-than-expected fourth-quarter profit on Thursday and warned macroeconomic factors like low interest rates would produce \"headwinds\" in 2015.",
        "date": "02122015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "Manulife reports weaker fourth-quarter profit "
    },
    {
        "content": "* Deal allows insurers to sell through DBS branches   (Adds details of other bidders  background on bancassurance)",
        "date": "02042015",
        "name": "Manulife Financial Corp",
        "news_type": "topStory",
        "symbol": "MFC",
        "title": "UPDATE 1-AIA  Pru among bidders for DBS's $1.5 bln distribution deal-sources "
    },
    {
        "content": "HONG KONG  Feb 4 AIA Group Ltd  Prudential plc and Manulife Financial Corp have been shortlisted to become the insurance partner of Singapore's DBS in a bank distribution deal worth around $1.5 billion  people familiar with the matter said.",
        "date": "02042015",
        "name": "Manulife Financial Corp",
        "news_type": "normal",
        "symbol": "MFC",
        "title": "AIA  Pru bidding for DBS's $1.5 bln distribution deal-sources "
    }
]