[
    {
        "content": "TOKYO  Nov 14 Japan's Nikkei share average edged up on Tuesday morning in choppy trade  with semiconductor equipment makers attracting buyers  while Mizuho Financial Group fell on dismal earnings.",
        "date": "11142017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Nikkei edges up in choppy trade; tech shares gain "
    },
    {
        "content": "Nov 13 Mizuho Financial Group Inc Chief Executive Yasuhiro Sato said:",
        "date": "11132017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "BRIEF-Mizuho CEO: Sees no need to change stance as main lender to support Kobe Steel "
    },
    {
        "content": "* Smaller bad loan costs  gains from selling stocks are positive (Changes to quarterly figures)",
        "date": "11132017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "UPDATE 1-Mizuho Q2 profit falls 12 pct on weak lending business "
    },
    {
        "content": "TOKYO  Nov 13 Mizuho Financial Group said on Monday net profit fell 11.5 percent for the six months ended September  as it struggles to reverse declining income at its core banking business.",
        "date": "11132017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Mizuho H1 profit falls 11.5 pct on weak lending business "
    },
    {
        "content": "TOKYO  Oct 28 Mizuho Financial Group Inc is considering cutting its global workforce by a third in the next decade to stem a decline in profitability due to prolonged low interest rates in Japan  a person with knowledge of the issue told Reuters on Saturday.",
        "date": "10282017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "As profitability sags  Mizuho considers 30 pct cut to workforce -source "
    },
    {
        "content": "* Says Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"A+\" -R&I",
        "date": "10272017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "BRIEF-R&I affirms Mizuho Financial Group's rating at \"A+\" and says stable outlook - R&I "
    },
    {
        "content": "TOKYO  Oct 19 The chief executive of Japan's largest bank expects new business opportunities to appear as digital currencies allow collection of data on how people use their money.",
        "date": "10192017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Japan finance sector to reap digital currency benefits  says MUFG chief "
    },
    {
        "content": "July 31 Charter Communications Inc's shares surged to a record high on Monday after a source said Japan's SoftBank Group Corp was considering an acquisition offer  even as Charter shot down the possibility of it being the acquirer in any merger with SoftBank's U.S. wireless carrier  Sprint Corp.",
        "date": "08012017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "UPDATE 3-Charter surges as Japan's SoftBank considers bid "
    },
    {
        "content": "* Mizuho Q1 net profit 118.3 bln yen vs 132.6 bln yen a year ago",
        "date": "07312017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "UPDATE 2-Japan banks book gains from stock holdings  but bleak lending persists "
    },
    {
        "content": "TOKYO  July 31 Mizuho Financial Group on Monday reported a 10.8 percent fall in net profit for the first quarter  as lending business remains tepid amid ultra-low interest rates.",
        "date": "07312017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Mizuho Q1 profit falls 11 pct y/y  hurt by low interest rates "
    },
    {
        "content": "TOKYO  July 25 Japan's Mizuho Financial Group said it would set up a subsidiary in Frankfurt  the latest Japanese bank to choose the German city as its new base in the European Union as Britain prepares to leave the bloc  termed Brexit.",
        "date": "07252017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Japan's Mizuho chooses Frankfurt for post-Brexit EU hub "
    },
    {
        "content": "TOKYO Japan's Mizuho Financial Group will start a venture next month to create new businesses using \"fintech \" an executive said  joining a global race in financial technology that threatens to unsettle traditional players.",
        "date": "05262017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Japan lender Mizuho to launch fintech venture "
    },
    {
        "content": "TOKYO  May 26 Japan's Mizuho Financial Group will start a venture next month to create new businesses using \"fintech \" an executive said  joining a global race in financial technology that threatens to unsettle traditional players.",
        "date": "05252017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Japan lender Mizuho to launch fintech venture "
    },
    {
        "content": "TOKYO  May 15 Mizuho Financial Group said on Monday net profit fell 10 percent for the year ended in March  hurt by a weak domestic lending business.",
        "date": "05152017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Japan lender Mizuho's annual profit falls 10 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  May 02 (Fitch) Fitch Ratings has today revised the rating Outlooks for Mitsubishi UFJ Financial Group  Inc. (MUFG) and its subsidiaries  Sumitomo Mitsui Financial Group  Inc. (SMFG) and its subsidiaries  and Mizuho Financial Group  Inc. (MHFG) and its subsidiaries to Stable from Negative. All the IDRs of these banking groups were affirmed. In addition Fitch has affirmed the IDRs on Sumitomo Mitsui Trust Bank  Limited (SMTB) and i",
        "date": "05022017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Fitch Revises Outlooks for Japanese Major Banks to Stable; Upgrades VR of MHFG "
    },
    {
        "content": "TOKYO  March 14 Toyota Motor Corp signed a memorandum of understanding (MOU) on Tuesday with a Saudi Arabian government agency to conduct a feasibility study into producing vehicles and parts in the Middle Eastern nation.",
        "date": "03142017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Japan's Toyota to look at Saudi production as the countries seek closer ties "
    },
    {
        "content": "* Profit rise helped by one-time gain from asset management unit",
        "date": "01312017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "UPDATE 2-Mizuho's Q3 profit rises on one-time gain  but lending still weak "
    },
    {
        "content": "TOKYO  Jan 31 Mizuho Financial Group on Tuesday reported an almost 3 percent drop in its net profit for the nine months ended in December  as Japanese banks continued to struggle to reverse a downward trend in lending income amid ultra-low interest rates.",
        "date": "01312017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Japan's Mizuho posts slightly smaller 9-month profit  weak lending hurts "
    },
    {
        "content": "* Mizuho Financial Group and Sumitomo Mitsui Trust Holdings have entered talks to combine their custody services operations - Nikkei",
        "date": "01172017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "BRIEF-Mizuho Financial Group  Sumitomo Mitsui Trust enter talks to combine custody services operations - Nikkei "
    },
    {
        "content": "Jan 12 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01122017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "MOVES-Mizuho  RWC Partners  BMO "
    },
    {
        "content": "Jan 12 The London-based securities and investment banking arm of Mizuho Financial Group Inc  named Borja Rivas as managing director  head of derivatives risk solutions EMEA.",
        "date": "01122017",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "MOVES-Mizuho International names new head of derivatives risk solutions EMEA "
    },
    {
        "content": "* Keeps annual net profit forecast at 600 bln yen   (Adds net interest income and domestic loans figures)",
        "date": "11142016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "UPDATE 1-Mizuho H1 profit slips 7 pct  hurt by central bank's negative rate policy "
    },
    {
        "content": "TOKYO  Nov 14 Mizuho Financial Group  said first-half profit slipped 6.7 percent  hurt by the central bank's introduction of negative interest rates this year which has further squeezed already low returns on loans.",
        "date": "11142016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Mizuho H1 profit falls  hurt by BOJ negative rate policy "
    },
    {
        "content": "* Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"A+\" -R&I",
        "date": "11042016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "BRIEF-R&I affirms Mizuho Financial Group Inc's rating at \"A+\" and announces stable outlook -R&I "
    },
    {
        "content": "* Blockchain set to revolutionise finance industry  save billions",
        "date": "08172016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Expert shortage hampers Japanese financials in blockchain race "
    },
    {
        "content": "* Mizuho Financial Group looking to partner with Softbank Group in new personal loan business that leverages big data in screening process - Nikkei",
        "date": "08112016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "BRIEF-Mizuho Financial Group looking to partner with Softbank Group in new personal loan business -Nikkei "
    },
    {
        "content": "* Keeps full-year net profit forecast at 600 bln yen   (Adds stock-related gains  share price rises)",
        "date": "07292016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "UPDATE 2-Japan bank Mizuho's Q1 profit slides 16 percent; negative interest rates weigh "
    },
    {
        "content": "TOKYO  July 29 Mizuho Financial Group  Japan's second-largest lender   said its first-quarter profit dropped 16 percent  as the country's negative interest rates hit income from loans and investments while failing to stoke broader borrowing.",
        "date": "07292016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Japan bank Mizuho says Q1 net profit fell 16 percent "
    },
    {
        "content": "July 27 Mizuho Americas  a unit of Japan's Mizuho Financial Group Inc  named Timothy Rezvan managing director on its equity research team  covering oil and gas exploration and production companies.",
        "date": "07272016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "MOVES-Mizuho Americas hires Timothy Rezvan from Sterne Agee CRT "
    },
    {
        "content": "* Mizuho Financial Group and Mitsubishi UFJ Financial Group are reshuffling operations in Europe - Nikkei",
        "date": "07222016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "BRIEF-Mizuho Financial Group  Mitsubishi UFJ Financial reshuffling operations in Europe - Nikkei "
    },
    {
        "content": "* Says it to issue its second series and third series unsecured permanent bonds (with debt relief authorized and subordinated) worth 230 billion yen respectively",
        "date": "07152016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "BRIEF-Mizuho Financial Group to issue unsecured permanent bonds worth 460 bln yen in total "
    },
    {
        "content": "TOKYO  May 30 Mizuho Financial Group's  $1.8 trillion of assets are set to shrink over the next three years as the lender plans to reduce holdings of mortgage loans and bonds to counter higher regulatory costs and ultra-low returns  its CEO said.",
        "date": "05292016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Japan's Mizuho sees assets shrinking on planned portfolio reshuffle "
    },
    {
        "content": "* SMFG sees 8.2 pct profit rise  below estimates   (Recasts with SMFG results  executive comments)",
        "date": "05132016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "UPDATE 2-Japan's Mizuho expects sharp profit fall this year "
    },
    {
        "content": "March 31 Mizuho Bank Americas  part of Japan-based Mizuho Financial Group Inc  appointed Andrew Dewing as managing executive officer and head of North American banking.",
        "date": "03312016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "MOVES-Mizuho promotes Andrew Dewing to North America banking head "
    },
    {
        "content": "* Mizuho Financial Group aims to issue $1 billion or more of a new type of bond as early as April - Nikkei",
        "date": "03152016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "BRIEF-Mizuho Financial Group aims to issue $1 bln or more of new type of bond - Nikkei "
    },
    {
        "content": "March 3 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03032016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "MOVES-Citigroup  Mizuho Bank Americas  Carver Bancorp "
    },
    {
        "content": "March 3 Mizuho Bank Americas  part of Japan-based Mizuho Financial Group Inc  appointed Eric Yoss as chief risk officer.",
        "date": "03032016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "MOVES-Mizuho Bank Americas hires chief risk officer from Barclays "
    },
    {
        "content": "TOKYO  Feb 18 The head of Japanese lender Mizuho Financial Group Inc said on Thursday his bank was studying cases of deposit fees charged on large accounts in the euro zone  after the Bank of Japan introduced negative interest rates last month.",
        "date": "02182016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Mizuho chief: studying European cases of fees charged on big deposits "
    },
    {
        "content": "TOKYO  Jan 29 Japan's Mizuho Financial Group Inc  on Friday reported an almost flat year-on-year growth in profit for the nine months ended in December  as falls in market operations were offset by gains from selling stocks of corporate clients held for business relations purposes.",
        "date": "01292016",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Japan's Mizuho 9-mth profit flat  stock sale offsets market slump "
    },
    {
        "content": "Nov 30 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "11302015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "MOVES- Mizuho International  AXA IM  Prime Partners "
    },
    {
        "content": "Nov 30 Mizuho Financial Group Inc's  UK-based securities and investment banking arm  Mizuho International Plc  named A.J. Davidson as managing director  head of EMEA financial institutions and risk solutions.",
        "date": "11302015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "MOVES-Mizuho International names A.J. Davidson managing director "
    },
    {
        "content": "TOKYO  Nov 11 Banks under Mitsubishi UFJ Financial Group Inc and Mizuho Financial Group Inc  sold a total 160 billion yen ($1.3 billion) of shares to individual investors in the Japan Post triple IPO  sources with knowledge of the matter said.",
        "date": "11112015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "MUFG  Mizuho banks sell 160 bln yen worth of Japan Post shares to individuals "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO/HONG KONG  October 14 (Fitch) Fitch Ratings has assigned a final rating of  'BBB' to the USD 750m Basel III-compliant Tier 2 10-year subordinated notes  issued by Mizuho Financial Group  Inc. (Mizuho; A-/Stable). The notes will constitute unsecured and subordinated obligations of Mizuho and  rank pari passu among themselves  and equally with all other present and future  unsecured  unconditional and dated subordinated obligations.",
        "date": "10142015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Fitch Rates Mizuho's USD Basel III Subordinated Notes Final 'BBB' "
    },
    {
        "content": "* Over half of Japan households' $14 trln assets in cash  deposits   (Adds details of deal and context)",
        "date": "09302015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "UPDATE 1-Japan's Mizuho  Dai-ichi Life to combine asset management operations "
    },
    {
        "content": "TOKYO  Sept 30 Mizuho Financial Group Inc  will merge its asset management units under a new company to be set up with Dai-Ichi Life Insurance Co  the companies said on Wednesday.",
        "date": "09302015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Mizuho  Dai-ichi Life to set up new asset management company "
    },
    {
        "content": "TOKYO  Sept 30 Mizuho Financial Group Inc  said on Wednesday it will buy a 16 percent stake in Asia-focused asset manager Matthews International Capital Management LLC.",
        "date": "09302015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Japan's Mizuho takes 16 percent stake in Matthews Asia "
    },
    {
        "content": "LONDON  Aug 18 (IFR) - Sameer Patel has joined Mizuho Financial Group as a director in the European syndicate team.",
        "date": "08182015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "MOVES-Sameer Patel joins Mizuho's corporate debt syndicate desk "
    },
    {
        "content": "June 16 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06162015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "MOVES- Barclays  Lloyds  ThecityUK  Mizuho  CRUX "
    },
    {
        "content": "June 16 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06162015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "MOVES- Barclays  ThecityUK  Mizuho  CRUX "
    },
    {
        "content": "Japan's Mizuho Financial Group Inc  has probably sold the bulk of its shares in Bank of America Corp   capital markets sources said on Friday.",
        "date": "11132015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Mizuho has probably sold out of BofA: sources "
    },
    {
        "content": " ",
        "date": "11132015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "UPDATE 1-Mizuho has probably sold out of BofA - sources "
    },
    {
        "content": "Nov 13 Japan's Mizuho Financial Group Inc  has probably sold its remaining shares in Bank of America Corp  capital markets sources said on Friday.",
        "date": "11132015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Mizuho has probably sold remaining BofA stake - sources "
    },
    {
        "content": "* MUFG  Mizuho  SMFG focus on reducing stock holdings of clients",
        "date": "11132015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "UPDATE 1-Japan's top banks to accelerate cutting client equity holdings "
    },
    {
        "content": "TOKYO  Nov 13 Mizuho Financial Group Inc  said on Friday net profit rose 8.1 percent for the six months ended in September  helped by gains from selling corporate clients' stocks held for business relations purposes.",
        "date": "11132015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Japan lender Mizuho's H1 profit up 8.1 pct on stock sale gains "
    },
    {
        "content": "* Net profit 611.9 bln Y vs 607.3 bln avg estimate of analysts",
        "date": "05152015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "UPDATE 1-Mizuho posts better-than-forecast profit  raises dividend "
    },
    {
        "content": "TOKYO  May 15 Mizuho Financial Group Inc  reported on Friday a smaller than forecast 11 percent drop in annual profit  helped by a strong stock market and overseas expansion.",
        "date": "05152015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Japan lender Mizuho's annual profit falls but better than expected "
    },
    {
        "content": "TOKYO  March 27 Mizuho Financial Group Inc  said on Friday it plans to merge its asset management operations  as part of efforts by Japan's second-largest bank to boost profits from its non-lending businesses.",
        "date": "03272015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Mizuho says to merge asset management operations "
    },
    {
        "content": "TOKYO  March 13 Mizuho Financial Group Inc  plans to merge its three asset management operations  which between then control publicly offered trusts worth more than 6 trillion yen ($50 billion)  people with direct knowledge of the matter said.",
        "date": "03132015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Japan's Mizuho to merge 3 asset-management operations -sources "
    },
    {
        "content": "TOKYO Mizuho Financial Group Inc  has agreed to buy Royal Bank of Scotland Group PLC's  (RBS) U.S. and Canadian loan commitments in a deal worth $3 billion  marking the latest move overseas by one of Japan's top banks.",
        "date": "02262015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "Japan's Mizuho buys RBS's U.S.  Canadian loan portfolio for $3 billion "
    },
    {
        "content": "TOKYO  Feb 26 Mizuho Financial Group Inc  has agreed to buy Royal Bank of Scotland Group PLC's  (RBS) U.S. and Canadian loan commitments in a deal worth $3 billion  marking the latest move overseas by one of Japan's top banks.",
        "date": "02262015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Japan's Mizuho buys RBS's U.S.  Canadian loan portfolio for $3 bln "
    },
    {
        "content": "TOKYO  Feb 26 Japan's Mizuho Financial Group Inc  is in talks to buy Royal Bank of Scotland Group PLC's  North American loan assets  a source with knowledge of the deal told Reuters on Thursday.",
        "date": "02262015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Mizuho in talks to buy RBS' North America loan assets - source "
    },
    {
        "content": "* Bank of Commerce is Philippines' 15th largest in asset terms   (Adds San Miguel comments  comments from Bank of Commerce official)",
        "date": "02182015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "UPDATE 1-San Miguel says gets offer from Mizuho for Philippine bank stake "
    },
    {
        "content": "MANILA  Feb 18 Philippine conglomerate San Miguel Corp is evaluating an offer from Japan's Mizuho Financial Group Inc to buy its stake in unlisted Bank of Commerce  local ANC television reported  quoting a top San Miguel official.",
        "date": "02182015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Philippines' San Miguel gets offer from Japan's Mizuho for bank stake-TV "
    },
    {
        "content": "MANILA  Feb 18 Japan's Mizuho Financial Group Inc is in talks to buy Philippine conglomerate San Miguel Corp's stake of around 60 percent in unlisted Bank of Commerce  a source with knowledge of the negotiations said on Wednesday.",
        "date": "02182015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Mizuho in talks to buy San Miguel stake in Philippines' Bank of Commerce-source "
    },
    {
        "content": "* Is in talks to buy stake worth over $500 million in Philippine lender Bank of Commerce - Wall Street Journal",
        "date": "02182015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "BRIEF-Mizuho in talks to buy stake in Philippines Bank of Commerce -WSJ "
    },
    {
        "content": "* Sticks to 20 pct annual profit drop forecast   (Recasts to focus on quarterly numbers)",
        "date": "01302015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "UPDATE 1-Japan bank Mizuho's Q3 profit up 26 pct as BOJ move boosts markets "
    },
    {
        "content": "* MUFG  Mizuho  SMFG post better than expected Oct-Dec profit",
        "date": "02032015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MFG",
        "title": "UPDATE 1-As MUFG posts strong Q3  prospects grow for buybacks by Japan banks "
    },
    {
        "content": "TOKYO  Jan 30 Japan's Mizuho Financial Group Inc  reported on Friday a 7 percent drop in nine-month net profit but gains from bond trading make it likely the bank will avoid the big annual profit fall it has forecast.",
        "date": "01302015",
        "name": "Mizuho Financial Group Inc",
        "news_type": "normal",
        "symbol": "MFG",
        "title": "Japan bank Mizuho's 9-month profit dips  set to beat annual forecast "
    }
]