[
    {
        "content": "WASHINGTON  Oct 9 British tech firm Micro Focus International Plc  the new owner of ArcSight security software  said it would restrict reviews of the core operating instructions in its products by \"high-risk\" governments  after Reuters reported that the application had been scrutinized by Russia.",
        "date": "10092017",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "UK tech firm Micro Focus to curb code reviews by 'high risk' governments "
    },
    {
        "content": "* Q3 reported revenue was us$718m  down 3% year over year  down 2% when adjusted for divestitures and currency",
        "date": "09062017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "CORRECTED-BRIEF-Micro Focus says HPE Software Q3 revenue falls 3 percent "
    },
    {
        "content": "* Micro Focus completes merger with HPE software business  announces formation of Micro Focus Government Solutions Source text for Eikon: Further company coverage:",
        "date": "09012017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus completes merger with HPE software business "
    },
    {
        "content": "* $500 000 000 RETURN OF VALUE WILL BE CONVERTED TO POUNDS STERLING AT EXCHANGE RATE OF $1.29490 TO £1.00 Source text for Eikon: Further company coverage:",
        "date": "08302017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus Int'l updates on share capital consolidation  return of value "
    },
    {
        "content": "* Lonza acquires Micro-Macinazione to create the global leader in micronization capacity and capabilities",
        "date": "08042017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Lonza says acquires Micro-Macinazione "
    },
    {
        "content": "* Fy pretax profit 196.3 million usd versus 195.4 million usd year ago",
        "date": "07122017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus Intl full-year core earnings rise 4.2 pct "
    },
    {
        "content": "* Carestream receives FDA 510(K) approval for Nano Source text for Eikon: Further company coverage:",
        "date": "06262017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro-X says Carestream receives FDA 510(K) approval for Nano "
    },
    {
        "content": "LONDON  June 12 British shares fell on Monday as a technology sell-off spread  across Europe  while contractor Mitie jumped after forecasting a recovery in its fortunes.",
        "date": "06122017",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "Technology sell-off weighs on Britain's FTSE "
    },
    {
        "content": "* ‍All of resolutions proposed at meeting were duly passed on a poll vote​",
        "date": "05262017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus investors back deal to buy HPE software business "
    },
    {
        "content": "LONDON  May 22 The pound's retreat below $1.30 helped Britain's main share index outperform European benchmarks on Monday  while individual broker updates sent some stocks lower.",
        "date": "05222017",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "Weaker sterling gives FTSE edge over Europe  Micro Focus dips "
    },
    {
        "content": "LONDON Shares in British tech firm Micro Focus plunged on Tuesday after revenues at Hewlett-Packard Enterprise's software business  which it is buying  fell in the last quarter.",
        "date": "05092017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "Micro Focus shares hit by weak update at software business it is buying "
    },
    {
        "content": "* Centrica  SSE dip as investors eye Conservative campaign vow",
        "date": "05092017",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "Britain's FTSE at one-month high  Tory energy pledge hits Centrica  SSE "
    },
    {
        "content": "LONDON  May 9 Shares in British tech firm Micro Focus plunged on Tuesday after revenues at Hewlett-Packard Enterprise's software business  which it is buying  fell in the last quarter.",
        "date": "05092017",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "UPDATE 1-Micro Focus shares hit by weak update at software business it is buying "
    },
    {
        "content": "LONDON  May 9 A raft of well-received updates and a recovery in resources stocks helped European shares rebound early on Tuesday from the previous session's slight losses  although shares in Micro Focus dropped.",
        "date": "05092017",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "European shares hold at 21-month highs  Micro Focus slides "
    },
    {
        "content": "May 9 Britain's FTSE 100 index is seen opening 1 point higher on Tuesday  according to financial bookmakers  with futures up 0.2 percent ahead of the cash market open.",
        "date": "05092017",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "UPDATE 1-UK Stocks-Factors to watch on May 9 "
    },
    {
        "content": "* Effective May 15  Silke Scheiber and Darren Roos will join board as two of three independent non-executive directors nominated by HPE",
        "date": "04252017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro focus announces board changes "
    },
    {
        "content": "* Has approved  without conditions  proposed intermediate merger whereby Micro Focus International intends to acquire Entco Spinco Inc (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "04182017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-S.Africa's Competition Commission approves Micro Focus-Entco deal "
    },
    {
        "content": "LONDON  March 30 A highly anticipated US$5.5bn–equivalent leveraged loan backing UK software company Micro Focus International’s acquisition of Hewlett Packard Enterprises’(HPE) software business is set to launch to syndication on Friday  banking sources said.",
        "date": "03302017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "LPC- Micro Focus US$5.5bn acquisition loan to launch Friday "
    },
    {
        "content": "* Syndication in relation to proposed merger with software business segment of Hewlett Packard Enterprise Source text for Eikon: Further company coverage: (London Newsroom)",
        "date": "03312017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus in $5.5 bln syndication of new facilities "
    },
    {
        "content": "BRUSSELS  Feb 2 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02022017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "EU mergers and takeovers (Feb 2) "
    },
    {
        "content": "* Announcement regarding proposed CEO of enlarged Micro Focus Group post completion of Micro Focus/HPE Software merger",
        "date": "01172017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus says HPE COO Hsu to be enlarged firm's CEO after HPE deal completes "
    },
    {
        "content": "LONDON  Jan 11 Banks are preparing to launch a US$5.5bn-equivalent leveraged loan backing UK software company Micro Focus International's acquisition of Hewlett Packard Enterprises'(HPE) software business  banking sources said.",
        "date": "01112017",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "LPC-Banks set to launch US$5.5bn-equiv Micro Focus loan "
    },
    {
        "content": "LONDON Micro Focus International   the British IT firm buying Hewlett Packard Enterprise Co's  software business  said it had made good progress in its first half-year  with better-than-expected revenue and earnings growth.",
        "date": "12142016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "Micro Focus shares lifted by surprise first-half revenue rise "
    },
    {
        "content": "LONDON  Nov 29 Around US$5bn-equivalent of leveraged loans backing UK software company Micro Focus International's acquisition of Hewlett Packard Enterprises'(HPE) software business is due to launch to syndication in January  banking sources said.",
        "date": "11292016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "LPC-Banks to launch US$5bn-equiv Micro Focus loan in Jan "
    },
    {
        "content": "* Trading in current financial year to date has been consistent with previous management guidance  Source text for Eikon:  Further company coverage:",
        "date": "09222016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus says trading YTD consistent with previous guidance "
    },
    {
        "content": "LONDON  Sept 8 European stock markets gained ground on Thursday  leaving a leading index near eight-month highs  with software company Micro Focus surging after a deal with Hewlett Packard Enterprise.",
        "date": "09082016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "European shares near eight-month highs as Micro Focus surges "
    },
    {
        "content": "* Accelerates strategy with spin-off and merger of non-core software assets with Micro Focus",
        "date": "09072016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-HPE to spin-off  merge non-core software assets with Micro Focus "
    },
    {
        "content": "* Micro Focus surges after Hewlett Packard deal   (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon  see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "09082016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "European shares drop as ECB's Draghi cools stimulus talk "
    },
    {
        "content": "Sept 7 Hewlett Packard Enterprise Co (HPE)  is nearing a deal to sell its software division to British software group Micro Focus International Plc  according to a person familiar with the matter on Wednesday  as the company focuses on networking  storage and data centers.",
        "date": "09072016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "HP Enterprise nears deal to sell software division -source "
    },
    {
        "content": "* UK tech company Micro Focus will buy Hewlett Packard's software unit in a deal worth around £7 bln - Sky News  citing sources",
        "date": "09072016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus will buy Hewlett Packard's software unit in deal worth around £7 bln - Sky News "
    },
    {
        "content": "Sept 8 Britain's FTSE 100 index is seen opening down 3 to 5 points on Thursday  according to financial bookmakers  with futures  trading up 0.2 percent ahead of the cash market open.",
        "date": "09082016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "UPDATE 3-UK Stocks-Factors to watch on Sept. 8 "
    },
    {
        "content": "* Proposed return of value to existing Micro Focus shareholders",
        "date": "09082016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus to return $400 mln to shareholders before HP deal concludes "
    },
    {
        "content": "Sept 8 Britain's FTSE 100 index is seen opening down 3 to 5 points on Thursday  according to financial bookmakers.          * The UK blue chip index closed 0.3 percent higher on Wednesday at 6 846.58   supported by stronger precious metals and oil company shares as well as by gains at equipment rentals company Ashtead.      * MICRO FOCUS: Hewlett Packard Enterprise Co will spin off and merge its non-core software assets with Britain's Micro Focus International Plc  in a deal worth $8",
        "date": "09082016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "UK Stocks-Factors to watch on Sept. 8 "
    },
    {
        "content": "* Fy pretax profit 195.4 million usd versus 91.4 million usd year ago",
        "date": "07142016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus Intl ups dividend after full-year profit rise "
    },
    {
        "content": "* Revenues and underlying adjusted ebitda at top end of management expectations",
        "date": "05242016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus Intl says full-year earnings to be at top end of expectations "
    },
    {
        "content": "* Wizard to sell about 24.1 Mln existing ordinary in Micro Focus representing about 10.5 pct of company's issued share capital - Bookrunner",
        "date": "05122016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Bookrunner says Wizard to sell 24.1 mln shares of Micro Focus Intl "
    },
    {
        "content": "* Micro focus announces intent to acquire serena software  inc.  Source text for Eikon:  Further company coverage:",
        "date": "03222016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus announces intent to buy Serena software  inc. "
    },
    {
        "content": "* Total of 10.9 million shares have been placed by Numis Securities at a price of 1455 pence per placing share",
        "date": "03222016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus says raises gross proceeds of about 158.2 mln stg via placing "
    },
    {
        "content": "LONDON British software group Micro Focus International has agreed to buy U.S. firm Serena Software [SILAKS.UL] for an enterprise value of $540 million and will raise $216 million in a placing to part finance the cash deal  it said on Tuesday.",
        "date": "03222016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "Micro Focus buys Serena Software for $540 million "
    },
    {
        "content": "LONDON  March 22 British software group Micro Focus International has agreed to buy U.S. firm Serena Software for an enterprise value of $540 million and will raise $216 million in a placing to part finance the cash deal  it said on Tuesday.",
        "date": "03222016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "Micro Focus buys Serena Software for $540 mln "
    },
    {
        "content": "* \u007fTransaction is being funded through existing cash resources together with additional debt and equity finance\u007f\u007f",
        "date": "03222016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus buys Serena Software for $540 mln\u007f "
    },
    {
        "content": "* \u007fmicro focus international plc today announces its intention to conduct a placing with institutional investors to raise approximately £150 million in order to partially fund acquisition of serena software inc\u007f",
        "date": "03222016",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus International launches 150 mln stg placing "
    },
    {
        "content": "* Wizard announces its intention to sell approximately 22 mln existing shares in micro focus\u007f - bookrunner",
        "date": "02042016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-\u007fWizard to sell about 22 mln shares in Micro Focus\u007f - bookrunner "
    },
    {
        "content": "* \u007fStephen Murdoch and Nils Brauckmann join board as CEO of Micro Focus and CEO of SUSE respectively\u007f",
        "date": "02012016",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus says Stephen Murdoch joins board as CEO "
    },
    {
        "content": "* H1 adjusted underlying ebitda rose 190.2 percent to 263.8 million usd",
        "date": "12102015",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus Intl posts jump in first-half earnings\u007f "
    },
    {
        "content": "* \u007fkevin loosemore will continue as executive chairman until at least april 2018\u007f",
        "date": "12102015",
        "name": "Micro Focus Intl PLC",
        "news_type": "normal",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus \u007fIntl's exec chairman Loosemore to stay until 2018 at least "
    },
    {
        "content": "* Wizard announces its intention to sell approximately 8.5 mln ordinary shares in Micro Focus",
        "date": "10222015",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Wizard to sell about 8.5 mln shares in Micro Focus - bookrunner "
    },
    {
        "content": "* Wizard announces its intention to sell approximately 8.5 million ordinary shares ( \"placing shares\") in micro focus",
        "date": "10232015",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus Intl says shareholder Wizard to sell 4 pct stake "
    },
    {
        "content": "* Trading in current financial year to date has been consistent with previous management guidance  Source text for Eikon:  Further company coverage:    (Reporting By London Bureau)",
        "date": "09242015",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus Intl says trading in line with expectations "
    },
    {
        "content": "* Fy pretax profit 91.4 million usd versus 147.8 million usd year ago",
        "date": "07082015",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus Intl raises dividend "
    },
    {
        "content": "* Expects to report revenues and underlying adjusted ebitda comfortably in line with guidance on a constant currency basis  Source text for Eikon:  Further company coverage:",
        "date": "05262015",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "BRIEF-Micro Focus Intl sees year 'comfortably within guidance' "
    },
    {
        "content": "* Concern over board independence at Afren   (Adds detail on Sports Direct  Afren  Micro Focus stakes)",
        "date": "02272015",
        "name": "Micro Focus Intl PLC",
        "news_type": "topStory",
        "symbol": "MFGP",
        "title": "UPDATE 1-Standard Life fund arm still unhappy with governance at Sports Direct  Afren "
    }
]