[
    {
        "content": "* ‍TSX accepts notice of intention to make normal course issuer bid​",
        "date": "11132017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-‍TSX accepts Magna International's notice of intention to make normal course issuer bid​ "
    },
    {
        "content": "Canadian auto parts maker Magna International Inc's  chief executive said on Thursday that uncertainty over NAFTA and proposed U.S. corporate tax cuts could prompt companies to suspend investment or pour capital into the United States.",
        "date": "11092017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "NAFTA uncertainty could delay corporate investment: Magna CEO "
    },
    {
        "content": "Nov 9 Canadian auto parts maker Magna International Inc's  profit topped analysts' estimates  helped by strong demand in Europe and Asia  and the company raised its full-year sales forecast.",
        "date": "11092017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "CORRECTED-UPDATE 1-Canadian auto parts maker Magna beats profit estimate "
    },
    {
        "content": "* Q3 earnings per share view $1.32 -- Thomson Reuters I/B/E/S",
        "date": "11092017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna reports Q3 earnings per share $1.36 "
    },
    {
        "content": "Nov 9 Canadian auto parts maker Magna International Inc on Thursday reported a 7.3 percent rise in quarterly sales  helped by strong demand in North America.",
        "date": "11092017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Magna International Q3 sales rise 7.3 pct "
    },
    {
        "content": "* Magna to build new paint line in Slovenia to support Graz Vehicle production",
        "date": "10172017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna International to build new paint line in Slovenia "
    },
    {
        "content": "* Magna International - ‍has entered into a JV agreement with Huayu Automotive Systems Co  a subsidiary of Saic Motor​",
        "date": "10182017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna forms E-Powertrain joint venture in China "
    },
    {
        "content": "* Says it  Magna International's unit plan to set up jv with registered capital at 200 million yuan  ($30.20 million)",
        "date": "10182017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Huayu Automotive Systems  Magna's unit to set up JV "
    },
    {
        "content": "Oct 10 Canadian auto parts producer Magna International Inc said on Tuesday it has joined a consortium including BMW and Intel Corp to develop a self-driving vehicle platform for the use of auto makers by 2020.",
        "date": "10102017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Canada's Magna joins BMW  Intel self-driving car project "
    },
    {
        "content": "* Magna joins The BMW Group  Intel and Mobileye platform as an integrator to bring autonomous driving technology to the market Source text - () Further company coverage:",
        "date": "10102017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna joins The BMW Group  Intel  Mobileye for autonomous driving technology "
    },
    {
        "content": "LJUBLJANA  Oct 5 Slovenia has granted Canadian car parts maker Magna International a construction permit to build a paint factory in northeastern Slovenia  the Environment Ministry and Magna said on Thursday.",
        "date": "10052017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Canadian car parts maker Magna wins Slovenia construction permit "
    },
    {
        "content": "* Magna International Inc - ‍ reached a settlement agreement with plaintiffs in KS Centoco Ltd legal proceedings​",
        "date": "09292017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna International says‍ reached a settlement agreement with plaintiffs in KS Centoco legal proceedings​ "
    },
    {
        "content": "* Magna International Inc - ‍Notes will bear interest at an annual rate of 1.500% and will mature on September 25  2027​",
        "date": "09182017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna announces senior notes offering "
    },
    {
        "content": "* Magna International Inc - ‍expanding operations to add aluminum casting capabilities at its Kamtek facility in Birmingham  Alabama​",
        "date": "09082017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna expands in Alabama with aluminum casting facility "
    },
    {
        "content": "SAN FRANCISCO  Sept 7 Two makers of laser-based sensor technology announced new funding rounds on Thursday  with top automotive suppliers Delphi Automotive  Magna International and Magneti Marelli investing in the competitive technology considered key to self-driving cars.",
        "date": "09072017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "UPDATE 1-Auto suppliers join funding for self-driving laser sensor firms "
    },
    {
        "content": "SAN FRANCISCO  Sept 7 Top automotive suppliers Delphi Automotive and Magna International Inc have joined a $65 million funding round for Innoviz Technologies  the maker of laser-based sensor technology for autonomous vehicles  the Israeli company said on Thursday.",
        "date": "09072017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Auto suppliers Delphi  Magna join funding round for Lidar company Innoviz "
    },
    {
        "content": "DETROIT  Aug 31 Auto supplier Magna International Inc on Thursday said it is developing a system automakers can use to enable vehicles to drive themselves without requiring bulky rooftop sensors or other compromises to vehicle styling.",
        "date": "08312017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Magna pitches new self-driving vehicle system "
    },
    {
        "content": "LJUBLJANA Magna International  has won approval to build a factory in western Hungary which could result in the Canadian car parts maker choosing Hungary over Slovenia for its new paint facility  Radio Slovenia reported on Tuesday.",
        "date": "08222017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Magna gets construction permit in Hungary: report "
    },
    {
        "content": "* Files for debt shelf of up to $2 billion - SEC filing‍​ Source text: (http://bit.ly/2uMDhvz) Further company coverage:",
        "date": "08152017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna International files for debt shelf of up to $2 bln "
    },
    {
        "content": "TORONTO  Aug 11 Canada's main stock index posted its lowest close in five weeks on Friday  weighed by a move lower in financials and a fall in shares of auto parts maker Magna International Inc despite reporting better-than-forecast quarterly profit.",
        "date": "08112017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "CANADA STOCKS-TSX hits five-week low as financials  Magna weigh "
    },
    {
        "content": "Magna International Inc   reported a higher quarterly profit on increased demand in Europe and Asia  and the Canadian auto parts maker raised its full-year sales forecast for the second time in three months.",
        "date": "08112017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Canada's Magna posts higher profit  raises sales forecast "
    },
    {
        "content": "* Fiscal-year sales forecast raised for 2nd time in 3 months (Adds another supplier's shares down  context on Delphi spinoff)",
        "date": "08112017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "UPDATE 4-Canada's Magna posts higher profit  raises sales forecast "
    },
    {
        "content": "SARAJEVO  Aug 11 Canadian car parts maker Magna International has been given the green light by the Slovenian Environment Agency to start building a paint factory  the first phase of a potential 1.24 billion euro ($1.5 billion) investment.",
        "date": "08112017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Slovenia approves Magna International project "
    },
    {
        "content": "* Magna International CEO says expects to be at capacity in Graz with complete vehicle assembly sales of over $6 billion in 2019 - conf call",
        "date": "08112017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna International CEO says still expecting a fairly strong 2nd half in North America - conf call "
    },
    {
        "content": "Aug 11 Canadian auto parts maker Magna International Inc  reported a 2.5 percent rise in quarterly sales  helped by higher demand.",
        "date": "08112017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Canadian auto parts maker Magna posts 2.5 pct rise in sales "
    },
    {
        "content": "* Q2 earnings per share view $1.47 -- Thomson Reuters I/B/E/S",
        "date": "08112017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna Q2 earnings per share $1.48 "
    },
    {
        "content": "TORONTO  July 28 Canada's main stock index pulled back on Friday  weighed by slips in heavyweight financial stocks and most of its consumer names despite strong domestic data  while plane and train maker Bombardier Inc surged after reporting a surprise profit.",
        "date": "07282017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "CANADA STOCKS-TSX falls as banks  consumer names weigh; Bombardier jumps "
    },
    {
        "content": "LJUBLJANA  July 26 Slovenia hopes to give Canadian car parts maker Magna International a green light to start construction of its planned paint factory by September  Economy Minister Zdravko Pocivalsek said on Wednesday.",
        "date": "07262017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Slovenia aims to approve Magna Int'l project by September "
    },
    {
        "content": "LONDON  July 13 Britain's biggest carmaker Jaguar Land Rover (JLR) said on Thursday it is to build its new E-PACE compact sport utility vehicle in Austria and China  the first of its cars only to be manufactured outside of its home market.",
        "date": "07132017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Jaguar Land Rover to produce first car entirely outside of Britain "
    },
    {
        "content": "LJUBLJANA  July 7 Car parts maker Magna International said it will invest elsewhere in Europe if Slovenia does not soon approve the first phase of a planned 1.2 billion euro ($1.4 bln) production site.",
        "date": "07072017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Magna has plan B in case Slovenia auto investment falls through "
    },
    {
        "content": "* Established a pre-defined automatic securities purchase plan with a designated broker",
        "date": "06292017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna establishes automatic share purchase plan "
    },
    {
        "content": "TORONTO  June 27 Canada's main stock index slipped early on Tuesday  as losses for stocks including car parts maker Magna International Inc and Burger King owner Restaurant Brands International Inc offset gains for energy and materials stocks.",
        "date": "06272017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "CANADA STOCKS-TSX slips as Magna  others offset resource stock gains "
    },
    {
        "content": "SAN FRANCISCO  June 19 Canadian auto supplier Magna International Inc will produce BMW's new 5-series plug-in hybrid at its Austrian factory  the company said on Monday  part of a strategy to produce electric cars on a contract basis for global automakers.",
        "date": "06192017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Auto supplier Magna to manufacture BMW 5-series plug-in hybrids "
    },
    {
        "content": "May 11 Canadian auto parts maker Magna International Inc  on Thursday posted a bigger-than-expected profit for the first quarter  helped by higher demand  and the company also raised its full-year sales forecast.",
        "date": "05112017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 1-Canadian auto parts maker Magna's profit beats estimates "
    },
    {
        "content": "* Q1 earnings per share view $1.34 -- Thomson Reuters I/B/E/S",
        "date": "05112017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna Q1 earnings per share $1.53 "
    },
    {
        "content": "May 11 Canadian auto parts maker Magna International Inc  posted a 19 percent jump in quarterly profit  helped by higher demand.",
        "date": "05112017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Canada's Magna International posts 19 pct rise in profit "
    },
    {
        "content": "* Says magna enters joint venture with chinese seating supplier",
        "date": "04282017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna International enters into JV with Chinese seating supplier "
    },
    {
        "content": "* Magna announces specific share repurchase program as part of normal course issuer bid",
        "date": "03172017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna announces specific share repurchase program as part of normal course issuer bid "
    },
    {
        "content": "LJUBLJANA Car parts maker Magna International  has submitted a plan to potentially invest up to 1.24 billion euros ($1.3 billion) in Slovenia and create around 6 000 jobs  the government said on Thursday.",
        "date": "03162017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Slovenia says car parts firm Magna may invest up to $1.3 billion "
    },
    {
        "content": "LJUBLJANA  March 16 Car parts maker Magna International has submitted a plan to potentially invest up to 1.24 billion euros ($1.3 billion) in Slovenia and create around 6 000 jobs  the government said on Thursday.",
        "date": "03162017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Slovenia says car parts firm Magna may invest up to $1.3 bln "
    },
    {
        "content": "DETROIT  March 6 General Motors Co’s deal on Monday to sell its European operations to France's PSA Group  doubles down on a bet that the company can win by being less global but more profitable in an auto industry increasingly dependent on software and services.",
        "date": "03062017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "UPDATE 1-GM shifts from bigger is better to less global  more profitable "
    },
    {
        "content": "DETROIT  March 6 General Motors Co’s decision to sell its European operations doubles down on a bet that the company can win by being less global  but more profitable  in an auto industry increasingly driven by software.",
        "date": "03062017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "GM shifts from bigger is better to less global  more profitable "
    },
    {
        "content": "Feb 24 Auto parts maker Magna International Inc's  profit missed estimates for the first time in five quarters  and the Canadian company warned that a proposed border tax by the United States could hurt the automobile industry.",
        "date": "02242017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 2-Magna International misses profit estimates  warns on border tax "
    },
    {
        "content": "Feb 24 Canadian auto parts maker Magna International Inc  posted an 8 percent rise in fourth-quarter sales due to higher demand.",
        "date": "02242017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Canada's Magna International posts 8 pct rise in sales "
    },
    {
        "content": "* Sees 2017 total production sales of $30.4 billion- $31.7 billion",
        "date": "02242017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna qtrly diluted EPS from continuing operations $1.24 "
    },
    {
        "content": "* Expects continued sales growth - over $43 billion in total sales by 2019",
        "date": "01112017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna sees 2019 total sales $43.5-$46.2 billion "
    },
    {
        "content": "LJUBLJANA  Jan 12 Canadian car parts maker Magna International Inc. is to build a new paint shop in Slovenia  expecting to create about 400 jobs  the company said on Thursday.",
        "date": "01122017",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 1-Magna to build car paint shop in Slovenia  create 400 jobs "
    },
    {
        "content": "LJUBLJANA  Jan 12 Canadian car parts maker Magna International Inc. will invest in a new paint shop in Slovenia  expecting to create about 400 jobs  Magna told Reuters on Thursday.",
        "date": "01122017",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Magna to build car paint plant in Slovenia  create 400 jobs "
    },
    {
        "content": "TORONTO  Nov 7 The union representing workers at Magna International Inc's Integram vehicle seat plant in Windsor  Ontario  reached a new agreement with the parts maker  the union said on Monday  ending a short strike.",
        "date": "11082016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 2-Workers at Magna plant in Canada end strike after contract deal "
    },
    {
        "content": "Nov 3 Canadian automotive supplier Magna International Inc  reported a better-than-expected quarterly profit on Thursday  helped by strong demand from Asia and Europe.",
        "date": "11032016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 2-Canadian auto parts maker Magna's profit tops estimates "
    },
    {
        "content": "TORONTO  Nov 6 Workers at Magna International's  Integram vehicle seat plant in Windsor  Ontario will strike after voting against a tentative labor contract  their union  Unifor  said on Sunday.",
        "date": "11062016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 1-Some Magna workers to strike in Canada after rejecting contract -union "
    },
    {
        "content": "Nov 3 Canadian auto parts maker Magna International Inc  reported a 15.5 percent rise in quarterly sales on Thursday  helped by strong demand from Asia and Europe.",
        "date": "11032016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "REFILE-Canada's Magna International posts 15.5 pct jump in sales "
    },
    {
        "content": "TORONTO  Nov 6 Workers at Magna International's  Integram vehicle seat plant in Windsor  Ontario will strike after voting to reject a new tentative labor contract  their union  Unifor  said on Sunday.",
        "date": "11062016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Some Magna workers to strike in Canada after rejecting contract -union "
    },
    {
        "content": "TORONTO  Nov 7 The union representing workers at Magna International Inc's Integram vehicle seat plant in Windsor  Ontario has reached a new tentative agreement  a Magna spokeswoman said on Monday  ending a short strike.",
        "date": "11072016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Magna workers in Canada reach new contract deal  end strike "
    },
    {
        "content": "* Magna International Inc sees 2016 total sales $35.8 - $37.0 billion",
        "date": "11032016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna Qtrly diluted EPS from continuing operations $1.29 "
    },
    {
        "content": "* Granite Real Estate Investment Trust and Magna agree to renew and extend leases for 15 properties including seven special purpose properties",
        "date": "10032016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Granite REIT  Magna agree to renew and extend leases for 15 properties "
    },
    {
        "content": "* Magna International signs agreement to acquire automotive closure systems supplier",
        "date": "09262016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna to acquire automotive closure systems supplier "
    },
    {
        "content": "* Says will manufacture new 5 Series sedan for BMW Group at its contract vehicle assembly facility in Graz  Austria",
        "date": "09152016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna says will build new BMW 5 series "
    },
    {
        "content": "Aug 5 Canadian auto parts maker Magna International Inc  reported a better-than expected rise in quarterly profit on Friday  helped by strong vehicle sales in North America and Europe  sending shares higher.",
        "date": "08052016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 2-Magna profit grows more than expected on robust auto sales; stock up "
    },
    {
        "content": "* Magna announces record second quarter and year to date results",
        "date": "08052016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna Q2 diluted EPS from continuing operations $1.41 "
    },
    {
        "content": "Aug 5 Canadian auto parts maker Magna International Inc  reported a 3.7 percent rise in quarterly profit  helped by strong vehicle sales in North America and Europe.",
        "date": "08052016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Canada's Magna Int'l quarterly profit rises "
    },
    {
        "content": "* Received notice of an unsolicited \"mini-tender\" offer made by TRC Capital Corporation",
        "date": "07152016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna recommends rejection of \"mini-tender\" offer "
    },
    {
        "content": "* May issue  from time to time  commercial paper notes up to a maximum aggregate amount of U.S. $500 million",
        "date": "07152016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna establishes U.S.$500 mln commercial paper program "
    },
    {
        "content": "May 5 Canadian auto parts maker Magna International Inc  reported a higher-than-expected first-quarter profit and raised its full-year sales forecast for a second time  boosted by strong vehicle sales in North America and Europe.",
        "date": "05052016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 2-Auto parts maker Magna raises 2016 sales forecast  profit beats "
    },
    {
        "content": "May 5 Magna International Inc Sees 2016 Total Production Sales $30.7 Bln",
        "date": "05052016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna Q1 sales $8.9 billion "
    },
    {
        "content": "May 5 Canadian auto parts maker Magna International Inc  reported an 8 percent rise in first-quarter profit  helped by an higher vehicle sales in North America.",
        "date": "05052016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Auto parts maker Magna's profit rises on helped vehicle sales "
    },
    {
        "content": "* Magna joint venture begins production of dual-clutch transmissions in Wuhan  China  Source text for Eikon:  Further company coverage:",
        "date": "04272016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna joint venture begins production of dual-clutch transmissions in Wuhan  China "
    },
    {
        "content": "* Magna signs agreement to acquire automotive electronics engineering business",
        "date": "04252016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "BRIEF-Magna to acquire Telemotive AG "
    },
    {
        "content": "MONTREAL/TORONTO  March 9 Canadian auto parts maker Magna International is opening a new seat-making facility in China to supply Zhejiang Geely Holding Group Co's  Volvo car group.",
        "date": "03092016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 1-Magna says it is opening new seat-making facility in China "
    },
    {
        "content": "* To open new seating manufacturing facility in Taizhou  China  to supply Geely's Volvo car group",
        "date": "03092016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Magna International to open seating manufacturing facility in China "
    },
    {
        "content": "MONTREAL  March 9 Canadian auto parts maker Magna International Inc said on Wednesday it will open a new seat-making facility in China to supply Zhejiang Geely Holding Group Co's Volvo car group.",
        "date": "03092016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Magna says it will open new Chinese seat-making facility "
    },
    {
        "content": "Canadian auto parts maker Magna International Inc   reported a much higher-than-expected quarterly profit as low gasoline prices boosted demand for vehicles in Europe and North America.",
        "date": "02262016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Auto parts maker Magna gets boost from Europe  North America demand "
    },
    {
        "content": "Feb 26 Canadian auto parts maker Magna International Inc  reported a much higher-than-expected quarterly profit as low gasoline prices boosted demand for vehicles in Europe and North America.",
        "date": "02262016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "UPDATE 2-Auto parts maker Magna gets boost from Europe  N.America demand "
    },
    {
        "content": "TORONTO  Feb 26 Canada's main stock index rose on Friday as energy shares were boosted by oil hitting a seven-week high and car parts maker Magna International Inc  jumped after reporting healthy demand in Europe and North America.",
        "date": "02262016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "CANADA STOCKS-TSX up as oil boosts energy shares; Magna jumps "
    },
    {
        "content": "Feb 26 Canadian stock futures extended gains on Friday after data showed U.S. economic growth slowed less sharply than expected in the fourth quarter.",
        "date": "02262016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "CANADA STOCKS-Futures extend gains after U.S. economic data "
    },
    {
        "content": "Feb 26 Canada's main stock index looked set to follow global markets higher as oil prices rose and investors focused on a meeting of G-20 leaders that kicked off in Shanghai on Friday.",
        "date": "02262016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "CANADA STOCKS-Futures point to higher open as oil rises "
    },
    {
        "content": "Feb 26 Canadian auto parts maker Magna International Inc  reported a 6.4 percent fall in quarterly profit  hurt by the impact of a strong U.S. dollar.",
        "date": "02262016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Auto parts maker Magna's profit falls due to strong U.S. dollar "
    },
    {
        "content": "Jan 13 Canada's Magna International Inc   said Wednesday it expected total sales to rise an estimated 10 to 11 percent this year  helped by recent acquisitions including that of German transmission parts maker Getrag.",
        "date": "01132016",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 2-Canada's Magna expects total sales to rise 10-11 pct in 2016 "
    },
    {
        "content": "Jan 13 Canada's Magna International Inc   said it expects sales from its auto parts manufacturing business to rise about 15.7 percent this year.",
        "date": "01132016",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Magna forecasts production sales to rise 15.7 pct in 2016 "
    },
    {
        "content": "BRUSSELS  Dec 17 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "12172015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "EU mergers and takeovers (Dec 17) "
    },
    {
        "content": "BRUSSELS  Nov 19 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "11192015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "EU mergers and takeovers (Nov 19) "
    },
    {
        "content": "BRUSSELS  Nov 18 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "11182015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "EU mergers and takeovers (Nov 18) "
    },
    {
        "content": "Canadian auto parts maker Magna International Inc said operational glitches at three of its plants in North America would weigh on its earnings in the current quarter and spill over to the first half of next year.",
        "date": "11052015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Auto parts maker Magna says factory glitches to hurt profit "
    },
    {
        "content": "* Shares fall 12 pct in early trading   (Adds CEO comments  Q3 details  share activity)",
        "date": "11052015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "UPDATE 2-Auto parts maker Magna says factory glitches to hurt profit "
    },
    {
        "content": "TORONTO  Nov 5 Canada's main stock index fell early on Thursday  with auto parts maker Magna International Inc  shares down 12 percent after reporting a slip in sales  and as weakness in oil and other commodity prices weighed on resource stocks.",
        "date": "11052015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "CANADA STOCKS-TSX opens lower  weighed by Magna  resource stocks "
    },
    {
        "content": "Nov 5 Canadian auto parts maker Magna International Inc  reported a 7 percent drop in quarterly sales  hurt by a strong dollar.",
        "date": "11052015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Auto parts maker Magna's sales fall 7 pct  hurt by strong dollar "
    },
    {
        "content": "FRANKFURT The falling cost of intelligent robots may help repatriate some car manufacturing work away from low-cost locations like China back to factories in Germany and North America  Donald Walker  Chief Executive of auto supplier Magna told Reuters.",
        "date": "09202015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Cheap robots may shift car making from China to U.S.: Magna CEO "
    },
    {
        "content": "TORONTO  Sept 24 Canada's main stock index fell 1 percent on Thursday  extending its losses for a third straight session and tracking foreign markets increasingly nervous about global growth.",
        "date": "09242015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "CANADA STOCKS-TSX slides as Magna  global growth worries cast pall "
    },
    {
        "content": "FRANKFURT  Sept 20 The falling cost of intelligent robots may help repatriate some car manufacturing work away from low-cost locations like China back to factories in Germany and North America  Donald Walker  Chief Executive of auto supplier Magna told Reuters.",
        "date": "09202015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Magna CEO: cheap robots may shift car making from China to U.S. "
    },
    {
        "content": "JERUSALEM  Sept 10 U.S.-Israeli automotive cyber security start-up Argus Cyber Security said on Thursday it raised $26 million in a second round of funding aimed at rapidly expanding its development and customer teams as market demand rises.",
        "date": "09102015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Israeli anti-car hacking firm Argus raises $26 mln "
    },
    {
        "content": "Aug 7 Magna International Inc   the Canadian auto parts maker  reported slightly lower second-quarter earnings on Friday as the impact of a strong U.S. dollar offset increased vehicle production in North America  and raised its margin forecast.",
        "date": "08072015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 2-Magna earnings edge down  margin forecast up "
    },
    {
        "content": "Aug 7 Canadian auto parts maker Magna International Inc  reported higher-than-expected quarterly sales as increased vehicle production in North America offset the impact of a strong U.S. dollar.",
        "date": "08072015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "CORRECTED-UPDATE 1-Magna Int'l quarterly sales beat estimates "
    },
    {
        "content": "Aug 7 Canadian auto parts maker Magna International Inc  reported an 8.7 percent drop in quarterly sales  due to the impact of a strong U.S. dollar.",
        "date": "08072015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Magna quarterly sales fall on strong dollar "
    },
    {
        "content": "TORONTO/FRANKFURT Canadian automotive parts maker Magna International Inc  said on Thursday it would buy privately-owned German car parts maker Getrag for 1.75 billion euros ($1.9 billion)  in a bid to expand its automotive transmission systems business.",
        "date": "07162015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Canadian auto parts maker Magna to buy Germany's Getrag for $1.9 billion "
    },
    {
        "content": "TORONTO/FRANKFURT  July 16 Canadian automotive parts maker Magna International Inc said on Thursday it would buy privately-owned German car parts maker Getrag for 1.75 billion euros ($1.9 billion)  in a bid to expand its automotive transmission systems business.",
        "date": "07162015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "UPDATE 4-Canadian auto parts maker Magna to buy Germany's Getrag for $1.9 bln "
    },
    {
        "content": "TORONTO  July 16 Canada's main stock index gained on Thursday  with banking stocks leading the way a day after the central bank cut rates  while auto parts maker Magna International Inc rose after it said it would buy a German peer.",
        "date": "07162015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "CANADA STOCKS-TSX gains on boost to banks  Magna deal cheered "
    },
    {
        "content": "July 16 Canadian automotive parts maker Magna International Inc said it will buy German car parts maker Getrag for 1.75 billion euros ($2 billion).",
        "date": "07162015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Auto parts maker Magna to buy Germany's Getrag for about $2 bln "
    },
    {
        "content": "May 7 Canadian auto parts maker Magna International Inc  reported better-than-expected quarterly sales  helped by demand in the United States.",
        "date": "05072015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 1-U.S. demand drives Canadian auto parts maker Magna's sales beat "
    },
    {
        "content": "May 7 Canadian auto parts maker Magna International Inc  reported a 7 percent drop in quarterly sales  hurt by a stronger dollar.",
        "date": "05072015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Canadian auto parts maker Magna's sales drop 7 pct "
    },
    {
        "content": "April 16 Canadian auto-parts maker Magna International Inc  said on Thursday it will sell most of its vehicle-interiors operations to Spain's Grupo Antolin for about $525 million.",
        "date": "04162015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 1-Magna to sell most of vehicle-interiors business for $525 mln "
    },
    {
        "content": "April 16 Canadian auto parts maker Magna International Inc  said it would sell most of its interiors operations to Spain's Grupo Antolin for about $525 million.",
        "date": "04162015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Magna to sell majority of interior operations for $525 mln "
    },
    {
        "content": "* Antolin buys seating business from Canada's Magna  Source text for Eikon:  Further company coverage:    (Reporting By Robert Hetz)",
        "date": "04162015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "BRIEF-Spain's Grupo Antolin agrees to buy interiors operation from Canada's Magna Intl "
    },
    {
        "content": "SEOUL  Feb 23 South Korea's Samsung SDI Co  said on Monday that it has agreed to buy the battery pack business of Canadian car parts maker Magna International   marking a further push by the Samsung Electronics  affiliate into a key automotive parts business.",
        "date": "02232015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "S.Korea's Samsung SDI to buy Magna's car battery pack business "
    },
    {
        "content": "Feb 25 Auto parts maker Magna International Inc   reported stronger than expected quarterly earnings on Wednesday while announcing a higher dividend and a stock split  sparking a rally in its shares.",
        "date": "02252015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "UPDATE 2-Magna ups dividend  sets stock split as profit jumps "
    },
    {
        "content": "Feb 25 Canadian auto parts maker Magna International Inc  reported a 11 percent rise in quarterly profit  helped by strong demand in North America.",
        "date": "02252015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Canadian auto parts maker Magna's profit rises 11 pct "
    },
    {
        "content": "Canadian auto parts maker Magna International Inc   forecast a surprise fall in fiscal 2015 revenue on Wednesday  due to lagging sales at its production and contract manufacturing businesses  sending its shares lower.",
        "date": "01142015",
        "name": "Magna International Inc",
        "news_type": "topStory",
        "symbol": "MGA",
        "title": "Auto parts maker Magna's forecasts disappoint  shares drop "
    },
    {
        "content": "Jan 14 Canada's Magna International Inc    one of the world's largest auto parts suppliers  forecast a surprise fall in fiscal 2015 revenue  hurt by falling sales in its production and contract manufacturing businesses.",
        "date": "01142015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "UPDATE 1-Auto parts maker Magna forecast surprise fall in 2015 revenue "
    },
    {
        "content": "Jan 14 Canada's Magna International Inc    an auto parts maker and contract vehicle manufacturer  forecast lower-than-estimated revenue for fiscal 2015.",
        "date": "01142015",
        "name": "Magna International Inc",
        "news_type": "normal",
        "symbol": "MGA",
        "title": "Auto parts maker Magna's 2015 revenue forecast misses estimates "
    }
]