[
    {
        "content": "* Markel Corp - ‍Anne Waleski  plans to transition from her role as CFO of company by end of Q1 of 2019​",
        "date": "11162017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel announces CFO succession plan "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 30 (Fitch) Fitch Ratings assigns a senior unsecured debt rating of 'BBB+' to Markel Corporation's (NYSE: MKL) new issues of $300 million senior notes due 2027 and $300 million due 2047. In addition  Fitch affirms all of MKL's ratings with a Stable Outlook. The affirmations include the Insurer Financial Strength rating of its operating subsidiaries at 'A+' (Strong)  MKL's outstanding senior notes at 'BBB+' and Issuer Def",
        "date": "10302017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "Fitch Rates Markel Corporation's New Senior Debt 'BBB+'; Affirms Ratings "
    },
    {
        "content": "* Q3 earnings per share view $-16.17 -- Thomson Reuters I/B/E/S Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel reports Q3 loss per share $18.82 "
    },
    {
        "content": "* Markel-‍Expects Q3 pre-tax underwriting losses of $503 million  net of reinstatement premiums  from hurricanes Harvey  Irma & Maria & Mexico earthquakes​ Source text for Eikon: Further company coverage:",
        "date": "10112017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel estimates third quarter catastrophe losses "
    },
    {
        "content": "Oct 2 London-based specialist insurer Markel International has appointed Trevor McAuley as subsea equipment underwriter and Katie Costello as hull and war underwriter in its marine  energy and property business.",
        "date": "10022017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Markel appoints subsea equipment and hull and war underwriters "
    },
    {
        "content": "July 24 U.S.-based specialist insurer Markel Corp appointed Deepika Mathur to lead its Indian business on the Llyod's India platform  based in Mumbai.",
        "date": "07242017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Markel hires Deepika Mathur to lead Indian business "
    },
    {
        "content": "* Q2 earnings per share view $6.57 -- Thomson Reuters I/B/E/S",
        "date": "07262017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel Q2 earnings per share $10.31 "
    },
    {
        "content": "* Markel Corp - entered into a definitive agreement for markel to acquire a majority interest in Costa Farms and its related operating companies Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Markel Corporation",
        "news_type": "normal",
        "symbol": "MKL",
        "title": "BRIEF-Markel signs agreement to acquire majority interest in Costa Farms and its related operating companies "
    },
    {
        "content": "July 26 The following bids  mergers  acquisitions and disposals were reported by 1320 GMT on Wednesday:",
        "date": "07262017",
        "name": "Markel Corporation",
        "news_type": "normal",
        "symbol": "MKL",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* State National Cos-to pay termination fee of about $13.8 million to markel if Markel  co terminates merger deal due to stockholder approval not being obtained",
        "date": "07262017",
        "name": "Markel Corporation",
        "news_type": "normal",
        "symbol": "MKL",
        "title": "BRIEF-State National Cos to pay termination fee of about $13.8 million to Markel if Markel  co terminates merger deal "
    },
    {
        "content": "U.S. insurer Markel Corp  said on Wednesday it would buy property and casualty insurer State National Companies Inc  for about $919 million.",
        "date": "07262017",
        "name": "Markel Corporation",
        "news_type": "normal",
        "symbol": "MKL",
        "title": "U.S. insurer Markel to buy State National for $919 million "
    },
    {
        "content": "July 26 U.S. insurer Markel Corp said on Wednesday it would buy property and casualty insurer State National Companies Inc for about $919 million.",
        "date": "07262017",
        "name": "Markel Corporation",
        "news_type": "normal",
        "symbol": "MKL",
        "title": "U.S. insurer Markel to buy State National for $919 mln "
    },
    {
        "content": "June 12 Specialist insurer Markel International  a unit of U.S.-based Markel Corp  named Dillon Matthews as trade credit underwriter and senior risk analyst in Singapore.",
        "date": "06122017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Markel appoints new trade credit underwriter in Singapore "
    },
    {
        "content": "* New division is expected to be up and running by January 1  2018",
        "date": "06072017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel to create new insurance division "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 22 (Fitch) Fitch Ratings has affirmed the 'A+' (Strong) Insurer Financial Strength (IFS) ratings for Markel Corporation's (NYSE: MKL) principal property and casualty (P/C) insurance subsidiaries. Fitch has also affirmed MKL's senior unsecured notes at 'BBB+'. The Rating Outlook is Stable. A complete list of ratings follows at the end of this release. KEY RATING DRIVERS Fitch's rationale for the affirmation of MKL's ratings ",
        "date": "05222017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "Fitch Affirms Markel Corporation; Outlook Stable "
    },
    {
        "content": "May 10 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05102017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Markel International  Berenberg  JLT Re "
    },
    {
        "content": "May 10 Specialist insurer Markel International  a unit of U.S.-based Markel Corp  appointed Amer Ibrahim as marine underwriter in Dubai.",
        "date": "05102017",
        "name": "Markel Corporation",
        "news_type": "normal",
        "symbol": "MKL",
        "title": "MOVES-Markel International names new marine underwriter in Dubai "
    },
    {
        "content": "May 9 Specialist insurer Markel International Singapore  a unit of U.S.-based Markel Corp  named Gustaf Kristiansson as marine underwriter.",
        "date": "05092017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Insurer Markel International Singapore names new marine underwriter "
    },
    {
        "content": "April 18 Markel International Singapore  subsidiary of U.S.-based Markel Corp  appointed Colin Fordham as a senior marine liability underwriter.",
        "date": "04182017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Markel International Singapore names new marine liability underwriter "
    },
    {
        "content": "* Markel Canada has acquired 50% of Allsport Insurance Marketing Ltd that it did not already own Source text for Eikon: Further company coverage:",
        "date": "04062017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel acquires Allsport "
    },
    {
        "content": "March 21 Insurer Markel International Ltd  a unit of Markel Corp  appointed Monica Novella as assistant cargo underwriter in its marine  energy and property business.",
        "date": "03212017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Markel names Monica Novella assistant cargo underwriter "
    },
    {
        "content": "* Markel Corp says  during q1 of 2017  it expects to increase prior years' loss reserves for its run-off book of uk motor exposures",
        "date": "03082017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel estimates Ogden rate change impact "
    },
    {
        "content": "Feb 7 Insurer Markel International Ltd  a subsidiary of U.S.-based holding company Markel Corp  appointed Warren Towner as head of underwriting management and reinsurance placement.",
        "date": "02072017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Markel International names new head of underwriting management "
    },
    {
        "content": "* Markel Corp - book value per common share outstanding of $606.30 at December 31  2016  up 8pct from $561.23 at December 31  2015",
        "date": "02082017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel reports 2016 financial results "
    },
    {
        "content": "* Following acquisition  SureTec will operate as a separate business unit",
        "date": "02012017",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel to acquire SureTec Financial Corp "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO/LONDON  November 15 (Fitch) Fitch Ratings has affirmed the 'A+' Insurer  Financial Strength (IFS) ratings for Markel Corporation's (NYSE: MKL) principal  property and casualty insurance (P/C) subsidiaries.  Fitch has also affirmed the following ratings for MKL:  --Issuer Default Rating (IDR) at 'A-'; --Senior unsecured notes at 'BBB+'.  The Rating Outlook is Stable. A complete list of ratings follows at the end of  this release.",
        "date": "11152016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "Fitch Affirms Markel Corporation; Outlook Stable "
    },
    {
        "content": "* Markel - underwriting results for quarter adversely impacted by unfavorable development on medical malpractice and specified medical product lines",
        "date": "11012016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel reports Q3 earnings per share $5.60 "
    },
    {
        "content": "Oct 10 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10102016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Triple Point  Markel International  Neon Underwriting "
    },
    {
        "content": "Markel International  a subsidiary of Markel Corp  appointed Chris O'Shea as head of reinsurance claims.",
        "date": "10102016",
        "name": "Markel Corporation",
        "news_type": "normal",
        "symbol": "MKL",
        "title": "MOVES-Markel International names new head of reinsurance claims "
    },
    {
        "content": "Oct 4 Specialist insurer Markel International  a unit of Markel Corp  appointed Mike Wimbridge as a senior yacht underwriter to its marine  energy and property division.",
        "date": "10042016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Markel names Mike Wimbridge senior yacht underwriter "
    },
    {
        "content": "* Markel appoints Trade Credit Development Director in New York  Source text for Eikon:  Further company coverage:",
        "date": "09262016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel appoints Trade Credit Development Director in New York "
    },
    {
        "content": "Sept 2 Specialist insurer Markel International appointed Timothy Foister as energy underwriter  based in Singapore.",
        "date": "09022016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Markel International appoints Timothy Foister as energy underwriter "
    },
    {
        "content": "* Stephen Leeret joins Markel Specialty as head of its programs business  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06072016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Stephen Leeret joins Markel Specialty as head of its programs business "
    },
    {
        "content": "May 23 Markel International Ltd  a unit of Markel Corp  appointed James Leach managing director of its newly consolidated accident and health and contingency business.",
        "date": "05222016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Markel International appoints James Leach managing director "
    },
    {
        "content": "* On May 5  executed an underwriting agreement and related pricing agreement - SEC filing",
        "date": "05102016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel issuing $100 mln of 5% senior notes due 2046 - SEC filing "
    },
    {
        "content": "* Files for potential senior notes offering; size not disclosed - sec filing  Source text :http://1.usa.gov/1TLozvV Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "05052016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel files for potential senior notes offering size not disclosed "
    },
    {
        "content": "* Q1 earnings per share view $6.79 -- Thomson Reuters I/B/E/S",
        "date": "05032016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel reports Q1 earnings per share of $11.15 "
    },
    {
        "content": "* Pricing terms of previously announced cash tender offer for up to $250 million combined amount of 7.350% notes due 2034  7.125% notes due 2019  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04122016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel Corp announces pricing terms of notes tender offer "
    },
    {
        "content": "* Commenced a tender offer to purchase for cash up to $250 million of its 7.350 pct senior notes due 2034",
        "date": "03292016",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "BRIEF-Markel announces notes tender offer "
    },
    {
        "content": "Nov 4 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "11042015",
        "name": "Markel Corporation",
        "news_type": "topStory",
        "symbol": "MKL",
        "title": "MOVES-Wells Fargo  Societe Generale  Russell Investments  Markel Corp "
    },
    {
        "content": "Nov 4 Insurer Markel International Ltd  a unit of Markel Corp  appointed Helena Zhang as business development director of the Markel underwriting unit of Lloyd's China.",
        "date": "11042015",
        "name": "Markel Corporation",
        "news_type": "normal",
        "symbol": "MKL",
        "title": "MOVES-Markel International names new business development director "
    },
    {
        "content": "Thomson Reuters May 7  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For ",
        "date": "05072015",
        "name": "Markel Corporation",
        "news_type": "normal",
        "symbol": "MKL",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    }
]