[
    {
        "content": "* Altria holds investor day; reaffirms 2017 full-year earnings guidance",
        "date": "11022017",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria holds investor day reaffirms FY 2017 earnings guidance "
    },
    {
        "content": "* Altria Group Inc files for potential debt shelf offering; size not disclosed - sec filing Source text : http://bit.ly/2yNPEwF Further company coverage:",
        "date": "10262017",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria Group files for potential debt shelf offering size not disclosed "
    },
    {
        "content": "NEW YORK  Aug 24 Tobacco company Altria Group Inc raised its dividend by 8.2 percent on Thursday  signaling the company did not expect a U.S. government proposal to reduce nicotine in cigarettes to threaten its ability to make the payment to shareholders.",
        "date": "08242017",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Altria ups dividend despite U.S. nicotine proposal hit to shares "
    },
    {
        "content": "* ALTRIA INCREASES QUARTERLY DIVIDEND BY 8.2% TO $0.66 PER COMMON SHARE Source text for Eikon: Further company coverage:",
        "date": "08242017",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "BRIEF-ALTRIA INCREASES QUARTERLY DIVIDEND BY 8.2 PCT TO $0.66 PER COMMON SHARE "
    },
    {
        "content": "NEW YORK  Aug 9 A U.S. proposal to slash nicotine levels in cigarettes may have smoked some investors out of Altria Group Inc  whose Marlboro line is the top-selling U.S. brand  but long-term stockholders are staying put after decades of dividend hikes in August.",
        "date": "08092017",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Altria August dividend trade alive despite U.S. nicotine proposal "
    },
    {
        "content": "* Altria's statement on FDA'S filing of Philip Morris International's modified risk tobacco product application",
        "date": "05252017",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria \"pleased\" U.S. FDA filed Philip Morris' MRTP application for electronically-heated tobacco product "
    },
    {
        "content": "* Altria group inc says  declares regular quarterly dividend of $0.61 per share",
        "date": "05182017",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria reaffirms 2017 adj EPS guidance "
    },
    {
        "content": "* Altria reports 2017 first-quarter results and reaffirms full-year earnings guidance",
        "date": "05022017",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria Group Q1 revenue $6.1 bln "
    },
    {
        "content": "* CEO Martin Barrington's 2016 total compensation was $27.6 million versus $13.3 million in 2015 - sec filing",
        "date": "04062017",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria Group CEO's 2016 compensation was $27.6 mln "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 03 (Fitch) Fitch Ratings has upgraded Altria Group  Inc.'s (Altria) Long-term Issuer Default Rating (IDR) and long-term debt ratings to 'A-' from 'BBB+'. Altria's short-term ratings have been affirmed. Altria had approximately $14 billion of total outstanding debt as of Dec. 31  2016. The Rating Outlook is Stable.  A complete list of rating actions follows at the end of this release. The ratings upgrade reflects the funda",
        "date": "04032017",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "Fitch Upgrades Altria's Ratings to 'A-' Outlook Stable "
    },
    {
        "content": "Feb 3 Altria Group Inc said on Friday it was working with authorities to investigate if the smokeless tobacco products it recalled earlier this week were tampered with.",
        "date": "02032017",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Altria investigating if recalled tobacco products were tampered with "
    },
    {
        "content": "* Altria reports 2016 fourth-quarter and full-year results; provides 2017 full-year earnings guidance",
        "date": "02012017",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria reports Q4 EPS $5.27 "
    },
    {
        "content": "Jan 31 U.S. Smokeless Tobacco Co  a unit of Altria Group Inc   said on Tuesday it recalled some of its smokeless tobacco products after consumers found metal objects in some cans.",
        "date": "02012017",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Altria unit recalls some U.S. smokeless tobacco products "
    },
    {
        "content": "* working with federal authorities to investigate whether recalled tobacco products were tampered with",
        "date": "02032017",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "BRIEF-Altria working with authorities to investigate potential tampering of recalled products "
    },
    {
        "content": "Jan 18 As tobacco and vaping companies focus on new smoking products that are potentially less harmful  the industry sees an opening for rolling back rules on these products under the Trump administration.",
        "date": "01182017",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Vape companies try to galvanize Trump administration to ease FDA rules "
    },
    {
        "content": "* Reports 2016 third-quarter and nine-month results; reaffirms 2016 full-year earnings guidance",
        "date": "10272016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria reports Q3 adjusted earnings per share $0.82 "
    },
    {
        "content": "* Says Altria now has about 10.2 percent ownership of AB InBev",
        "date": "10212016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria announces increased ownership of Anheuser-Busch InBev "
    },
    {
        "content": "LONDON British American Tobacco  has offered to buy out U.S. cigarette maker Reynolds American Inc  in a $47 billion takeover that would create the world's biggest listed tobacco company with brands including Newport  Lucky Strike and Pall Mall. | Video ",
        "date": "10212016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "BAT offers to buy U.S. tobacco firm Reynolds in $47 billion deal "
    },
    {
        "content": "* Altria becomes significant shareholder in Anheuser-Busch InBev; revises 2016 full-year earnings guidance",
        "date": "10112016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria becomes significant shareholder in Anheuser-Busch InBev "
    },
    {
        "content": "* AB InBev targeting at least $1.4 bln in cost savings   (Adds comments from executives  shareholder)",
        "date": "09282016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UPDATE 2-SABMiller investors cheer $100 bln-plus AB InBev takeover "
    },
    {
        "content": "LONDON  Sept 28 SABMiller shareholders approved the brewer's takeover by rival Anheuser-Busch InBev  on Wednesday  paving the way for one of the biggest proposed mergers in history.",
        "date": "09282016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "SABMiller shareholders approve AB InBev takeover "
    },
    {
        "content": "* Will record a one-time  pre-tax charge against reported earnings in Q3 of 2016 of approximately $825 million  or $0.28 per share",
        "date": "09202016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria Group Inc records pre-tax charge against reported earnings in Q3 of 2016 "
    },
    {
        "content": "* On September 16  co issued aggregate principal amount of $1.5 billion of its 3.875% notes due 2046",
        "date": "09162016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria group issues $500 million aggregate principal amount of its 2.625% notes due 2026 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 13 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to  Altria Group  Inc.'s (Altria) senior notes offering. Fitch expects that the  proceeds of the issue will be used to pay down a portion of Altria's currently  outstanding $682 million of 9.95% notes due 2038 and $718 million of 10.20%  notes due 2039  through an \"any and all\" tender offer that is set to expire on  Sept. 16  unless extended. Any remaining proceed",
        "date": "09132016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "Fitch Rates Altria's Senior Notes Offering 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Presents at the Barclays Global Consumer Staples Conference; Reaffirms full-year earnings guidance",
        "date": "09072016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria reaffirms FY earnings guidance "
    },
    {
        "content": "* Altria increases quarterly dividend by 8.0% to $0.61 per common share  Source text for Eikon:  Further company coverage:",
        "date": "08252016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria Group increases qtrly dividend by 8% to $0.61/common share "
    },
    {
        "content": "* Result of this is that Altria and BEVCO will consent to UK scheme separately and will not vote with other SABMiller shareholders",
        "date": "08232016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-SAB says investors Altria  BEVCO to vote on AB InBev deal separately "
    },
    {
        "content": "LONDON  Aug 23 A UK court has ruled that SABMiller shareholders can be treated as two classes when they vote on the company's takeover by Anheuser Busch InBev   granting the request from the brewer for a split.",
        "date": "08232016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UK court says SABMiller shareholders can be split into two classes "
    },
    {
        "content": "* Deal completion expected Oct. 10  trading on Oct. 11   (Adds detail on timetable)",
        "date": "08012016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UPDATE 1-AB InBev and SABMiller expect megabrew merger to complete Oct. 10 "
    },
    {
        "content": "* Altria estimates total pre-tax restructuring charges in connection with initiative of approximately $140 million",
        "date": "07272016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-Altria Group Q2 adj earnings per share $0.81 excluding items "
    },
    {
        "content": "* CEO calls for immediate halt to contact with ABI  others - memo",
        "date": "07272016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UPDATE 2-SABMiller pauses AB InBev integration amid new offer "
    },
    {
        "content": "LONDON Fund manager Aberdeen Asset Management  reiterated on Friday it would vote against the takeover of SABMiller  by Belgian rival AB Inbev  after the company said it backed the revised terms.",
        "date": "07292016",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "Aberdeen Asset Management says will vote against SABMiller  AbInbev deal "
    },
    {
        "content": "* Request seen making approval more difficult   (Adds comments  bullet points)",
        "date": "07292016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UPDATE 3-SABMiller backs AB InBev offer for biggest-ever consumer takeover "
    },
    {
        "content": "The board of brewer SABMiller will recommend its shareholders approve a sweetened takeover offer by Anheuser Busch InBev  the company said on Friday  capping a week of high drama about the fate of the consumer industry's biggest-ever merger.",
        "date": "07292016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "SABMiller backs AB InBev offer for biggest-ever consumer merger "
    },
    {
        "content": "BRUSSELS/BEIJING Brewer Anheuser-Busch InBev  cleared a major hurdle toward its takeover of SABMiller  with regulatory approval from China on Friday  leaving the acquisition's future in the hands of the British company's board.",
        "date": "07292016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "AB InBev clears China hurdle in SABMiller takeover deal "
    },
    {
        "content": "* SABMiller board recommendation of AB Inbev revised and final offer",
        "date": "07292016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "BRIEF-SABMiller board to recommend final AB InBev offer "
    },
    {
        "content": "LONDON  July 29 The board of brewer SABMiller  will recommend shareholders approve the final takeover offer by Anheuser Busch InBev  the company said on Friday.",
        "date": "07292016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "SABMiller board to recommend final AB InBev offer "
    },
    {
        "content": "* Board has now met formally to consider revised and final offer for entire issued and to be issued share capital of SABMiller as announced by Anheuser-Busch Inbev SA/NV on July 26 2016",
        "date": "07292016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "BRIEF-SABMiller says board to recommend final AB InBev offer "
    },
    {
        "content": "* Brazil beer volume down 4.5 pct after 10 pct drop in Q1   (Updates after China commerce approval)",
        "date": "07292016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UPDATE 3-AB InBev clears China hurdle in SABMiller takeover deal "
    },
    {
        "content": "* SABMiller reviewing stance with shareholders   (Recasts with more on investor dissent)",
        "date": "07262016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UPDATE 3-Brewer AB InBev seeks to nail SABMiller bid with sweetened offer "
    },
    {
        "content": "LONDON  July 26 Aberdeen Asset Management   a top-10 shareholder in drinks firm SABMiller  said on Tuesday that a revised $100 billion-plus bid for the company from rival AB Inbev remained \"unacceptable\".",
        "date": "07262016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Top SABMiller shareholder says revised AB Inbev offer 'remains unacceptable' "
    },
    {
        "content": "LONDON  July 20 SABMiller has not ruled out asking Anheuser-Busch InBev to revamp its proposed $100 billion-plus takeover offer before formally recommending the bid  a source close to the London-listed brewer told Reuters  amid rising shareholder disquiet about the terms.",
        "date": "07202016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "SABMiller board to weigh AB InBev takeover terms as shareholder meeting looms -source "
    },
    {
        "content": "LONDON  July 18 The Children's Investment Fund Management (TCI) has taken a stake in SABMiller  the second activist to buy into the brewer in recent weeks  raising the prospect of a late push for improved takeover terms from AB InBev.",
        "date": "07182016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Activist TCI takes SABMiller stake  investors scent sweetened offer "
    },
    {
        "content": "NEW YORK  March 22 S&P Dow Jones Indices is negotiating with asset managers to license its new index  which it says represents companies that focus on the long term rather than the current quarter.",
        "date": "03222016",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Long-term thinking could become focus for a new index fund "
    },
    {
        "content": "Nov 3 Wall Street securities analysts revised their ratings and price targets on several U.S.-listed companies  including Hewlett Packard Enterprise and Valeant Pharmaceuticals  on Tuesday.           HIGHLIGHTS     * Goodrich Petroleum  Magnum Hunter : FBR cuts to market perform       * Eaton Vance Corp : Susquehanna cuts to negative from neutral           * Altria Group Inc : RBC cuts to sector perform from outperform       * Consol Energy Inc : Deutsche Bank cuts to sell from hold ",
        "date": "11032015",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "U.S. RESEARCH ROUNDUP-Eaton Vance  Consol Energy  Altria "
    },
    {
        "content": "Nov 4 The Illinois Supreme Court on Wednesday threw out a $10.1 billion verdict against Philip Morris USA in a long-running lawsuit accusing the Altria Group Inc unit of misleading smokers about the health risks of \"light\" cigarettes.",
        "date": "11042015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Illinois top court voids $10.1 bln Philip Morris 'light' verdict "
    },
    {
        "content": "The Illinois Supreme Court on Wednesday threw out a $10.1 billion verdict against Philip Morris USA in a long-running lawsuit accusing the Altria Group Inc unit of misleading smokers about the health risks of \"light\" cigarettes.",
        "date": "11042015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Illinois top court voids $10.1 billion Philip Morris 'light' verdict "
    },
    {
        "content": "* Plaintiffs can still pursue case in Illinois Supreme Court   (Adds statements from plaintiffs' lawyer  Philip Morris)",
        "date": "11042015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UPDATE 1-Illinois top court voids $10.1 bln Philip Morris 'light' verdict "
    },
    {
        "content": "BRUSSELS Brewer SABMiller Plc  has extended the deadline for rival Anheuser-Busch InBev  to make a formal $100 billion-plus takeover offer by a further week in order to finalize shareholder support for the deal.",
        "date": "11042015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "AB InBev  SABMiller extend takeover deadline to November 11 "
    },
    {
        "content": "Oct 13 SABMiller Plc shareholder Altria Group said it was pleased that the brewer was willing to accept larger rival Anheuser-Busch InBev's new offer worth more than $100 billion.",
        "date": "10132015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Altria welcomes SABMiller's willingness to accept AB InBev offer "
    },
    {
        "content": "* Improved proposal of gbp 43.50 per share in cash  with partial share alternative",
        "date": "10122015",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BRIEF-AB InBev confirms revised 43.50 stg/shr proposal for SABMiller "
    },
    {
        "content": "* CEO repeats frustration  says rival's view lacks credibility",
        "date": "10082015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UPDATE 2-AB InBev CEO appeals to SAB shareholders for second day "
    },
    {
        "content": "** SABMiller's London-listed shares rise as much as 4.4 pct in heavy volumes  before paring some gains  on Anheuser-Busch InBev  the world's largest brewer  raising its cash offer for SAB to £42.15/shr",
        "date": "10072015",
        "name": "Altria Group",
        "news_type": "topStory",
        "symbol": "MO",
        "title": "BUZZ-SABMiller: AB InBev raises takeover offer to 42.15 stg/shr "
    },
    {
        "content": "LONDON  Oct 7 Anheuser-Busch InBev  Chief Executive Carlos Brito does not want to talk about making a hostile bid for rival brewer SABMiller  saying he hopes shareholders will urge the board to engage concerning the existing offer.",
        "date": "10072015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "AB InBev CEO delays talk of hostile bid for SABMiller "
    },
    {
        "content": "BRUSSELS/LONDON  Sept 30 A $70 billion debt package being arranged to fund Anheuser-Busch InBev's  takeover of SABMiller still leaves the world's largest brewer with a tricky balancing act in satisfying a range of shareholder camps with different needs.",
        "date": "10012015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "RPT-AB InBev faces delicate balance in structuring SABMiller bid "
    },
    {
        "content": "BRUSSELS/LONDON  Sept 30 A $70 billion debt package being arranged to fund Anheuser-Busch InBev's  takeover of SABMiller still leaves the world's largest brewer with a tricky balancing act in satisfying a range of shareholder camps with different needs.",
        "date": "09302015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "AB InBev faces delicate balance in structuring SABMiller bid "
    },
    {
        "content": "Anheuser-Busch InBev SA  reached out to SABMiller Plc's  largest shareholder  Altria Group Inc   before making a takeover approach  Bloomberg reported.",
        "date": "09182015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "AB InBev talked to SABMiller investor Altria before approach: Bloomberg "
    },
    {
        "content": "Sept 18 Anheuser-Busch InBev SA reached out to SABMiller Plc's largest shareholder  Altria Group Inc  before making a takeover approach  Bloomberg reported.",
        "date": "09182015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UPDATE 1-AB InBev talked to SABMiller investor Altria before approach-Bbg "
    },
    {
        "content": "LONDON  July 16 Philip Morris International  and its American counterpart Altria Group  announced on Thursday an expansion of their agreement on e-cigarettes to include research and development  as the market for tobacco alternatives continues to evolve.",
        "date": "07162015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Philip Morris expands e-cigarette deal with Altria "
    },
    {
        "content": "NEW YORK  Feb 25 Three major U.S. tobacco companies including R.J. Reynolds Tobacco Co  Lorillard Inc  and Altria Group's Philip Morris USA will pay $100 million to settle hundreds of federal lawsuits over smoking  according to an announcement from plaintiffs' lawyers on Wednesday.",
        "date": "02252015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "Tobacco companies to settle smoking lawsuits for $100 million "
    },
    {
        "content": "NEW YORK  Feb 25 Three major U.S. tobacco companies - R.J. Reynolds Tobacco Co  Lorillard Inc and Altria Group's Philip Morris USA - will pay $100 million to settle hundreds of federal lawsuits over smoking  according to an announcement from plaintiffs' lawyers on Wednesday.",
        "date": "02252015",
        "name": "Altria Group",
        "news_type": "normal",
        "symbol": "MO",
        "title": "UPDATE 1-Tobacco companies to settle smoking lawsuits for $100 million "
    }
]