[
    {
        "content": "Monsanto Co. is urging a judge to grant it summary judgment on all pending lawsuits in a multidistrict litigation over its Roundup product  saying plaintiffs offered up unreliable \"junk science\" to support claims that the weedkiller causes cancer.",
        "date": "11132017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto urges federal judge to toss \"junk science\" Roundup claims "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd ups share stake in Mastercard to 923 068 class a shares from 267 006 class a shares",
        "date": "11142017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Temasek Holdings (Private) Ltd ups share stake in Mastercard  Visa and Monsanto "
    },
    {
        "content": "SAO PAULO  Nov 9 Soybean growers in Mato Grosso  Brazil's largest soy-producing state  have asked a court to cancel Monsanto Co's Intacta RR2 PRO patent claiming irregularities  including the company's alleged failure to prove it brings de facto technological innovation.",
        "date": "11092017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Brazil soy growers ask court to cancel Monsanto's Intacta patent "
    },
    {
        "content": "SAO PAULO  Nov 9 Soybean growers in Mato Grosso  Brazil's largest producing state  have asked a court to cancel Monsanto's Intacta RR2 PRO patent claiming irregularities  including the company's alleged failure to prove it brings de facto technological innovation.",
        "date": "11092017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Brazil soy growers ask court to cancel Monsanto's Intacta patent "
    },
    {
        "content": "CHICAGO  Nov 8 An Arkansas regulatory body voted on Wednesday to bar the use of a weed killer critical to Monsanto Co's seed sales for a second consecutive summer  ratcheting up a standoff after the company sued the state to prevent restrictions on the product.",
        "date": "11082017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Arkansas pushes ahead with summertime ban on Monsanto  BASF weed killers "
    },
    {
        "content": "Nov 9 Russia's Federal Anti-Monopoly Service (FAS) says:",
        "date": "11092017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Russian watchdog says Bayer-Monsanto deal poses risks to competition "
    },
    {
        "content": "CHICAGO  Nov 3 Monsanto Co has asked Arkansas to block a member of a state regulatory body from participating in a hearing next week that could ban a weed killer linked to crop damage  saying he is biased  the company's latest attempt to defend the product.",
        "date": "11032017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto asks Arkansas to ban herbicide critic from regulatory hearing "
    },
    {
        "content": "CHICAGO  Nov 1 Monsanto Co put on hold the launch of a chemical designed to be applied to crop seeds on Wednesday following reports it causes rashes on people  in the latest instance of complaints about a company product that was approved by U.S. environmental regulators.",
        "date": "11022017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto halts launch of chemical after users complain of rashes "
    },
    {
        "content": "FRANKFURT/BRUSSELS  Nov 6 The European Commission has resumed its antitrust review of Bayer's planned takeover of U.S. seed maker Monsanto after the companies were given time to provide more information.",
        "date": "11062017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU resumes Bayer-Monsanto deal review; new deadline March 5 "
    },
    {
        "content": "CHICAGO U.S. farmers have overwhelmed state governments with thousands of complaints about crop damage linked to new versions of weed killers  threatening future sales by manufacturers Monsanto Co  and BASF SE .",
        "date": "11012017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto  BASF weed killers strain U.S. states with damage complaints "
    },
    {
        "content": "Plaintiffs in the multidistrict litigation over Monsanto Co's herbicide Roundup on Friday said there was overwhelming evidence of the weed killer causing a certain type of cancer  urging a federal judge to deny the firm's request for summary judgment.",
        "date": "10302017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Plaintiffs hit back at Monsanto in Roundup weedkiller MDL "
    },
    {
        "content": "* Climate Corporation expands its industry-leading  global digital agriculture platform into Western Canada​ Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-‍Monsanto Co says Climate Corp expands digital agriculture platform into Western Canada​ "
    },
    {
        "content": "FRANKFURT  Oct 26 Bayer said it expected antitrust authorities to make the planned acquisition of Monsanto conditional on more asset sales after agreeing to sell seed and herbicide businesses for 5.9 billion euro ($7 billion) to BASF.",
        "date": "10262017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer: more antitrust asset sales on the cards after BASF deal "
    },
    {
        "content": "FRANKFURT German drugmaker Bayer has cut the value of its takeover of Monsanto by $2.5 billion  which combined with windfalls from asset sales means it may have to raise less than expected from shareholders.",
        "date": "10262017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer cuts Monsanto deal value to $63.5 billion on revised debt "
    },
    {
        "content": "FRANKFURT  Oct 26 German drugmaker Bayer on Thursday flagged it might reduce the size of its planned rights issue to fund the planned $66 billion takeover of Monsanto  citing proceeds from an antitrust-related asset sale to rival BASF",
        "date": "10262017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer hints at shrinking cash call for Monsanto takeover funding "
    },
    {
        "content": "* Shares drop 3 pct (Adds details on size  timing of cash call  industry background)",
        "date": "10262017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Bayer cuts Monsanto deal value to $63.5 bln on revised debt "
    },
    {
        "content": "* CFO says no capital increase this year  we first want sufficient certainty about regulatory approval of Monsanto deal Further company coverage:",
        "date": "10262017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Bayer says no capital increase this year "
    },
    {
        "content": "FRANKFURT  Oct 26 Germany's Bayer  which is buying U.S. seeds company Monsanto  posted a 4 percent gain in quarterly underlying core earnings on growth in pharmaceutical sales but held back by weak consumer healthcare and crop chemicals businesses.",
        "date": "10262017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer pharma growth tempered by weak agriculture  consumer units "
    },
    {
        "content": "NEW DELHI  Oct 14 India's Nuziveedu Seeds Ltd (NSL) said on Saturday it will not settle a long-standing intellectual property dispute with Monsanto Co over genetically modified (GM) cotton  despite some other Indian companies doing so in recent weeks.",
        "date": "10142017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "India's NSL to pursue intellectual property litigation with Monsanto "
    },
    {
        "content": "NEW YORK/CHICAGO U.S. weed specialists doubted on Friday that new federal restrictions on the use of a controversial weed killer  sold by Monsanto Co and BASF  will prevent recurrences next year of crop damage linked to the chemical.",
        "date": "10132017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "U.S. experts doubt EPA curbs on Monsanto  BASF herbicides will halt crop damage "
    },
    {
        "content": "NEW YORK/CHICAGO  Oct 13 U.S. weed specialists doubted on Friday that new federal restrictions on the use of a controversial weed killer  sold by Monsanto Co and BASF   will prevent recurrences next year of crop damage linked to the chemical.",
        "date": "10132017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 4-U.S. experts doubt EPA curbs on Monsanto  BASF herbicides will halt crop damage "
    },
    {
        "content": "BRUSSELS  Oct 13 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10132017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU mergers and takeovers (Oct 13) "
    },
    {
        "content": "FRANKFURT BASF  has agreed to buy seed and herbicide businesses from Bayer  for 5.9 billion euros ($7 billion) in cash  as Bayer tries to convince competition authorities to approve its planned acquisition of Monsanto .",
        "date": "10132017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BASF to buy seeds  herbicide businesses from Bayer for $7 billion "
    },
    {
        "content": "* Shares Bayer rise to top of DAX index (Adds BASF CEO comment  source  analyst comment on Bayer capital increase  further details)",
        "date": "10132017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 4-BASF to harvest seeds  herbicide businesses from Bayer for $7 bln "
    },
    {
        "content": "* ‍Says will use net proceeds from announced divestiture to partially refinance planned acquisition of Monsanto​",
        "date": "10132017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Bayer to use proceeds of BASF seeds deal to refinance Monsanto deal "
    },
    {
        "content": "CHICAGO  Sept 26 Monsanto Co invited dozens of weed scientists to a summit this week to win backing for a controversial herbicide but many have declined  threatening the company's  efforts to convince regulators the product is safe to use.",
        "date": "09272017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "RPT-U.S. scientists to skip Monsanto summit on controversial weed killer "
    },
    {
        "content": "SAO PAULO A unit of Brazil's competition regulator Cade has said Bayer AG's proposed takeover of Monsanto Co. could be detrimental to competition and urged conditions for Brazilian approval of the corporate tie-up  a document released on the agency's website shows.",
        "date": "10042017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Brazil agency says Bayer-Monsanto tie-up can hurt competition  urges conditions "
    },
    {
        "content": "BERLIN German drugs and pesticides group Bayer  said on Friday it had further reduced to just under 25 percent its holding in Covestro   the plastics producer which it demerged in 2015  by selling a 6.9 percent stake for 1 billion euros ($1.2 billion).",
        "date": "09292017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer sells further stake in Covestro for 1 billion euros "
    },
    {
        "content": "SAO PAULO  Oct 4 A unit of Brazil's competition regulator Cade has said Bayer AG's proposed takeover of Monsanto Co. could be detrimental to competition and urged conditions for Brazilian approval of the corporate tie-up  a document released on the agency's website shows.",
        "date": "10042017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Brazil agency says Bayer-Monsanto tie-up can hurt competition  urges conditions "
    },
    {
        "content": "SAO PAULO Monsanto Co  is set on keeping rights to its Intacta RR2 IPRO genetically modified soybean technology as the U.S. seeds company negotiates its takeover by Bayer AG  with global antitrust authorities  a senior executive said on Thursday.",
        "date": "09282017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto set on keeping Intacta after Bayer tie-up: executive "
    },
    {
        "content": "CHICAGO  Sept 26 Monsanto Co invited dozens of weed scientists to a summit this week to win backing for a controversial herbicide but many have declined  threatening the company's  efforts to convince regulators the product is safe to use.",
        "date": "09262017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "U.S. scientists to skip Monsanto summit on controversial weed killer "
    },
    {
        "content": "CHICAGO U.S. seeds and agrochemicals company Monsanto Co   which is being acquired by Bayer AG   reported a quarterly profit on Wednesday  compared with a year-ago loss  as seed licensing deals in the typically low-revenue fourth quarter lifted sales.",
        "date": "10042017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto fourth quarter profit up as corn  soy seed sales jump "
    },
    {
        "content": "CHICAGO  Oct 4 U.S. seeds and agrochemicals company Monsanto Co  which is being acquired by Bayer AG   reported a quarterly profit on Wednesday  compared with a year-ago loss  as seed licensing deals in the typically low-revenue fourth quarter lifted sales.",
        "date": "10042017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Monsanto 4th qtr profit up as corn  soy seed sales jump "
    },
    {
        "content": "SAO PAULO  Sept 28 Monsanto Co is set on keeping rights to its Intacta RR2 IPRO genetically modified soybean technology as the U.S. seeds company negotiates its takeover by Bayer AG with global antitrust authorities  a senior executive said on Thursday.",
        "date": "09282017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto set on keeping Intacta after Bayer tie-up -executive "
    },
    {
        "content": "* Monsanto CEO Hugh Grant says concerns by Brazil competition regulator Cade over Bayer merger a \"normal step\" in review process Source text for Eikon: Further company coverage: (Reporting by Karl Plume in Chicago)",
        "date": "10042017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Brazil regulator concern over Bayer merger a \"normal step\" in review process -Monsanto CEO "
    },
    {
        "content": "* ‍For Q4  company reported $0.05 eps on an as-reported basis​",
        "date": "10042017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto reports Q4 sales $2.7 bln "
    },
    {
        "content": "* Arkansas board votes to bar dicamba use after April 15  2018",
        "date": "09222017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "RPT-UPDATE 2-Arkansas one step from ban on controversial herbicide next summer "
    },
    {
        "content": "MONHEIM  Germany  Sept 19 German drugs and pesticides maker Bayer said it would likely take until early next year to complete the planned $66 billion takeover of U.S. seeds group Monsanto  which it had previously expected to be under wraps by the end of 2017.",
        "date": "09192017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer says needs more time for Monsanto deal approval "
    },
    {
        "content": "Oct 4 U.S. seeds and agrochemicals company Monsanto Co  which is being acquired by Germany's Bayer AG  reported a quarterly profit  compared with a year-ago loss  helped by higher demand for corn and soybean seeds.",
        "date": "10042017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto posts Q4 profit on demand for corn  soybean seeds "
    },
    {
        "content": "CHICAGO Arkansas on Thursday moved just one step away from barring sprayings next summer of an herbicide linked to widespread U.S. crop damage  setting the stage for a potential legal showdown between the state and chemical maker Monsanto Co.",
        "date": "09222017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Arkansas one step from ban on controversial herbicide next summer "
    },
    {
        "content": "BRUSSELS  Sept 19 The European Commission said on Tuesday it has approved German drugs and pesticides group Bayer's request for an extension of the investigation into the $66 billion deal to acquire U.S. group Monsanto .",
        "date": "09192017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU agrees to extend deadline for decision on Bayer  Monsanto deal "
    },
    {
        "content": "SAO PAULO  Oct 4 A unit of Brazil's competition regulator Cade has postponed a decision on whether to approve the $66 billion takeover of Monsanto Co. by German life sciences firm Bayer SA  a document released on the agency's website shows.",
        "date": "10042017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Brazil agency defers Bayer-Monsanto decision  cites anti-trust concerns "
    },
    {
        "content": "* Arkansas board votes to bar dicamba use after April 15  2018",
        "date": "09222017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Arkansas one step from ban on controversial herbicide next summer "
    },
    {
        "content": "MONHEIM  Germany Bayer  said it was unable to propose the sale of any digital farming assets to allay EU concerns about its planned $66 billion takeover of Monsanto .",
        "date": "09192017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer dismisses antitrust concerns about digital farming "
    },
    {
        "content": "* Crop Science unit says global market remain volatile in '17",
        "date": "09192017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Bayer says needs more time for Monsanto deal approval "
    },
    {
        "content": "* Bayer says fails to see how to address digital farming concerns",
        "date": "09192017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Bayer dismisses antitrust concerns about digital farming "
    },
    {
        "content": "* to decide shortly on Bayer request for Monsanto anti-trust review deadline extension Further company coverage: (Reporting By Georgina Prodhan)",
        "date": "09192017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-EU to decide \"shortly\" on Bayer request for Monsanto extension "
    },
    {
        "content": "FRANKFURT German drug and chemicals maker Bayer on Tuesday named Wolfgang Nickl  currently finance chief at Dutch semiconductor equipment maker ASML  to replace its CFO Johannes Dietsch when he leaves the group next year.",
        "date": "09122017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer names ASML's CFO as its new finance chief "
    },
    {
        "content": "CHICAGO Monsanto Co  filed a petition on Thursday asking Arkansas agricultural officials to reject a proposed date next year that would end sprayings of the herbicide dicamba  which has been linked to crop damage across the U.S. farm belt.",
        "date": "09082017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto fights to sell Arkansas farmers herbicide linked to crop damage "
    },
    {
        "content": "CHICAGO  Sept 7 Monsanto Co filed a petition on Thursday asking Arkansas agricultural officials to reject a proposed date next year that would end sprayings of the herbicide dicamba  which has been linked to crop damage across the U.S. farm belt.",
        "date": "09082017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Monsanto fights to sell Arkansas farmers herbicide linked to crop damage "
    },
    {
        "content": "BRUSSELS/FRANKFURT The European Commission has started an in-depth investigation of Bayer's planned $66 billion takeover of U.S. seeds group Monsanto  saying it was worried about competition in various pesticide and seeds markets. | Video ",
        "date": "08232017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "EU starts in-depth probe of Bayer  Monsanto deal "
    },
    {
        "content": "CHICAGO  Aug 21 With Monsanto Co's latest flagship weed killer  dicamba  banned in Arkansas and under review by U.S. regulators over concerns it can drift in the wind  farmers and weed scientists are also complaining that confusing directions on the label make the product hard to use safely.",
        "date": "08212017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "U.S. farmers confused by Monsanto weed killer's complex instructions "
    },
    {
        "content": "* Agrium Inc - ‍Frank comes to Agrium from Monsanto​ Source text for Eikon: Further company coverage:",
        "date": "08222017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Agrium names Mike Frank as president of Agrium Retail "
    },
    {
        "content": "Aug 22 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "08222017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "BRUSSELS  Aug 22 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08222017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU mergers and takeovers (Aug 22) "
    },
    {
        "content": "* Bayer reaffirms goal to wrap up deal by year-end (Adds details on EU commission's concerns  asset sale)",
        "date": "08222017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-EU starts in-depth probe of Bayer  Monsanto deal "
    },
    {
        "content": "BRUSSELS  Aug 16 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08162017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "EU mergers and takeovers (Aug 16) "
    },
    {
        "content": "BRUSSELS  Aug 11 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08112017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "EU mergers and takeovers (Aug 11) "
    },
    {
        "content": "BRUSSELS  Aug 22 The European Commission said on Tuesday it had started an in-depth investigation of Bayer's planned $66 billion takeover of U.S. seeds group Monsanto  saying it was worried about competition in pesticide and seeds markets.",
        "date": "08222017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU Commission starts in-depth probe of Bayer  Monsanto deal "
    },
    {
        "content": "* Monsanto and Toolgen announce global licensing agreement on CRISPR platform  underscore the benefits of innovation for farmers",
        "date": "08162017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto  ToolGen announce global licensing agreement on CRISPR platform "
    },
    {
        "content": "COPENHAGEN  Aug 11 Danish enzymes maker Novozymes undershot market expectations in the second quarter pressured by cost cuts at detergent makers and a changed sales pattern in its cooperation with Monsanto.",
        "date": "08112017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Novozymes shares fall as Q2 pressured by detergent makers  Monsanto alliance "
    },
    {
        "content": "* Paulson & Co dissolves share stake in Ebay inc - sec filing",
        "date": "08142017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Paulson & Co dissolves share stake in eBay  ups share stake in Monsanto "
    },
    {
        "content": "* Sets quarterly dividend of $0.54per share Source text for Eikon: Further company coverage:",
        "date": "08102017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto board approves dividend of 54 cents per share "
    },
    {
        "content": "Monsanto Co on Tuesday informed a federal court in California that it has reached a tentative nationwide settlement of a class action alleging a concentrate of its flagship weed killer Roundup was falsely advertised.",
        "date": "08092017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto settles false labeling suit over weed killer Roundup "
    },
    {
        "content": "* Monsanto and Valent U.S.A. LLC announce expanded partnership in Roundup Ready Plus® Crop Management Solutions",
        "date": "08072017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto and Valent U.S.A. announce partnership in roundup Ready Plus Crop Management Solutions "
    },
    {
        "content": "* New formulations of herbicide dicamba blamed for widespread crop damage",
        "date": "08092017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "INSIGHT-Scant oversight  corporate secrecy preceded U.S. weed killer crisis "
    },
    {
        "content": "   By Kate Kelland  Health and Science Correspondent",
        "date": "08092017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "U.S. lawmakers seek missing information in review of Monsanto weedkiller "
    },
    {
        "content": "* New formulations of herbicide dicamba blamed for widespread crop damage",
        "date": "08092017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "RPT-INSIGHT-Scant oversight  corporate secrecy preceded U.S. weed killer crisis "
    },
    {
        "content": "LONDON  Aug 9 The chairman of a congressional committee has asked the U.S. National Institutes of Health (NIH) to explain why its National Cancer Institute (NCI) failed to publish data that showed no links between glyphosate and cancer.",
        "date": "08092017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-U.S. lawmakers seek missing information in review of Monsanto weedkiller "
    },
    {
        "content": "BRUSSELS The European Commission said Germany's Bayer  had submitted commitments aimed at easing competition concerns over its $66 billion takeover of U.S. agrochemicals group Monsanto   suggesting the company aims to avoid a lengthy review.",
        "date": "08012017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer offers concessions to EU Commission for Monsanto deal "
    },
    {
        "content": "FRANKFURT  July 27 Bayer  which is taking over U.S. seeds group Monsanto  cut its outlook for operating profit growth this year to below 10 percent  as it grapples to cope with disappointing demand for crop chemicals in Brazil.",
        "date": "07272017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer crimps profit goal to below 10 pct growth on crop chemicals "
    },
    {
        "content": "BRUSSELS  Aug 1 The European Commission said Germany's Bayer had submitted commitments aimed at easing competition concerns over its $66 billion takeover of U.S. agrochemicals group Monsanto  suggesting the company aims to avoid a lengthy review.",
        "date": "08012017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Bayer offers concessions to EU Commission for Monsanto deal "
    },
    {
        "content": "BRUSSELS  Aug 1 The European Commission on Tuesday extended its review of Bayer's $66 billion takeover of agrochemicals group Monsanto by two weeks  adding the companies had submitted their proposed concessions on Monday.",
        "date": "08012017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU Commission extends review of Bayer-Monsanto deal until Aug 22 "
    },
    {
        "content": "* Tax rule anomalies make it difficult for firms to price products",
        "date": "07272017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Indian businesses blindsided by unclear sales tax rules "
    },
    {
        "content": "July 26 Agricultural equipment maker AGCO Corp said on Wednesday it would buy Monsanto Co's farm equipment business for an undisclosed amount.",
        "date": "07262017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "AGCO to buy Monsanto's farm equipment business "
    },
    {
        "content": "BRUSSELS  July 24 Online campaigns group Avaaz has called on European Union antitrust regulators to block Bayer's purchase of Monsanto  saying it would hurt innovation and competition and push up prices.",
        "date": "07242017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Campaign group Avaaz calls on EU to block Bayer's Monsanto deal "
    },
    {
        "content": "CHICAGO  July 19 Global grain trader Bunge Ltd's sweeping plans to overhaul its business and cut costs may not be enough to compensate for weak earnings and could still leave it vulnerable to a new bid from diversified rival Glencore PLC.",
        "date": "07202017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bunge overhaul is latest shake-up for struggling grain sector "
    },
    {
        "content": "BRUSSELS  July 24 Online campaigns group Avaaz has called on European Union antitrust regulators to block Bayer's purchase of Monsanto  saying it would hurt innovation and competition and push up prices.",
        "date": "07242017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Campaign group Avaaz calls on EU to block Bayer's Monsanto deal "
    },
    {
        "content": "BEIJING Global seeds giants have called for transparent  science-based approvals processes for new crop types after China approved two more genetically modified (GMO) crops for import  but left four others on the waiting list.",
        "date": "07182017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "DuPont  Monsanto urge transparent GMO crop reviews in China "
    },
    {
        "content": "* DuPont 'disappointed' its corn trait not included (Recasts  adds statement from Monsanto)",
        "date": "07182017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-DuPont  Monsanto urge transparent GMO crop reviews in China "
    },
    {
        "content": "CHICAGO Tennessee on Thursday imposed restrictions on the use of dicamba  a flagship pesticide for Monsanto Co  becoming the fourth state to take action as problems spread over damage the weed killer causes to crops not genetically modified to withstand it.",
        "date": "07142017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Tennessee restricts use of Monsanto pesticide as problems spread "
    },
    {
        "content": "CHICAGO  July 13 Tennessee on Thursday imposed restrictions on the use of dicamba  a flagship pesticide for Monsanto Co  to become  the fourth state to take action as problems spread over damage the weed killer causes to crops not genetically modified to withstand it.",
        "date": "07132017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Tennessee restricts use of Monsanto pesticide as problems spread "
    },
    {
        "content": "* Evogene Ltd- ‍company reached an important milestone in its crop disease collaboration with Monsanto Company​",
        "date": "07112017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Evogene Ltd reaches an important milestone in its crop disease collaboration with Monsanto Company​ "
    },
    {
        "content": "CHICAGO  July 13 Tennessee on Thursday imposed restrictions on the use of dicamba  a flagship pesticide for Monsanto Co  becoming the fourth state to take action as problems spread over damage the weed killer causes to crops not genetically modified to withstand it.",
        "date": "07132017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Tennessee restricts use of Monsanto pesticide as problems spread "
    },
    {
        "content": "CHICAGO  July 13 Tennessee on Thursday imposed restrictions on the use of dicamba  a flagship pesticide for Monsanto Co  becoming the fourth state to take action as problems spread over damage the weed killer causes to crops not genetically modified to withstand it.",
        "date": "07132017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "CORRECTED-UPDATE 1-Tennessee restricts use of Monsanto pesticide as problems spread "
    },
    {
        "content": "* EU Commission sets Aug 7 as provisional deadline for decision",
        "date": "06302017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 1-Bayer files for Monsanto takeover approval with EU regulators "
    },
    {
        "content": "FRANKFURT  June 30 Bayer has filed a request for approval of its planned $66 billion takeover of U.S. seeds company Monsanto with European Union regulators  a spokesman for the German pharmaceuticals and pesticides maker said on Friday.",
        "date": "06302017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer files for Monsanto takeover approval with EU regulators "
    },
    {
        "content": "U.S. seeds and agrochemicals company Monsanto Co   which is in the process of being bought by Germany's Bayer AG   reported a stronger-than-expected quarterly profit on Wednesday as record soybean plantings lifted seed sales. | Video ",
        "date": "06282017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto profit tops expectations as soybean sales surge "
    },
    {
        "content": "Glyphosate  an herbicide and the active ingredient in Monsanto Co's  popular Roundup weed killer  will be added to California's list of chemicals known to cause cancer effective July 7  the state's Office of Environmental Health Hazard Assessment (OEHHA) said on Monday. | Video ",
        "date": "06272017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "California to list herbicide as cancer-causing; Monsanto vows fight "
    },
    {
        "content": "June 26 Glyphosate  an herbicide and the active ingredient in Monsanto Co's popular Roundup weed killer  will be added to California's list of chemicals known to cause cancer effective July 7  the state's Office of Environmental Health Hazard Assessment (OEHHA) said on Monday.",
        "date": "06262017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 2-California to list glyphosate as cancer-causing; Monsanto vows fight "
    },
    {
        "content": "June 28 U.S. seeds and agrochemicals company Monsanto Co  which is in the process of being bought by Germany's Bayer AG  reported a stronger-than-expected quarterly profit on Wednesday as record soybean plantings lifted seed sales.",
        "date": "06282017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Monsanto profit tops expectations as soybean sales surge "
    },
    {
        "content": "BASEL Switzerland's Syngenta   the crop protection company acquired by ChemChina  has vowed to bulk up its seeds business and join the chase for assets rival Bayer  must sell to gain regulatory approval for its takeover of Monsanto.",
        "date": "06272017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Chinese-owned Syngenta eyes Bayer assets to bolster seeds "
    },
    {
        "content": "BASEL  June 27 Switzerland's Syngenta  the crop protection company acquired by ChemChina  has vowed to bulk up its seeds business and join the chase for assets rival Bayer must sell to gain regulatory approval for its takeover of Monsanto.",
        "date": "06272017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Chinese-owned Syngenta eyes Bayer assets to bolster seeds "
    },
    {
        "content": "Glyphosate  an herbicide and the active ingredient in Monsanto Co's popular Roundup weed killer  will be added to California's list of chemicals known to cause cancer effective July 7  the state's Office of Environmental Health Hazard Assessment said on Monday.",
        "date": "06262017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "California to list glyphosate as cancer-causing; Monsanto vows fight "
    },
    {
        "content": "June 28 U.S. seeds and agrochemicals company Monsanto Co  which is in the process of being bought by Germany's Bayer AG  reported a 17.6 percent rise in quarterly profit  helped by higher sales in its soybean seed business.",
        "date": "06282017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "CORRECTED-Monsanto reports 17.6 pct jump in quarterly profit "
    },
    {
        "content": "* Monsanto Company delivers solid third quarter as it looks to close out fiscal year 2017 with return to growth",
        "date": "06282017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto reports Q3 earnings per share $1.90 "
    },
    {
        "content": "DUESSELDORF  June 20 Bayer's chief executive said talks with the EU Commission over the antitrust scrutiny of the German drugmaker's planned takeover of U.S. seeds maker Monsanto were \"very good and constructive\"  confirming a target to wrap up the deal by year-end.",
        "date": "06202017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer CEO says talks with EU over Monsanto deal constructive "
    },
    {
        "content": "* Monsanto and Atomwise collaborate to discover new crop protection options using artificial intelligence technology",
        "date": "06142017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto and Atomwise collaborate to discover new crop protection options using AI technology "
    },
    {
        "content": "* Monsanto board approves dividend of 54 cents per share Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "06062017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto board approves dividend of 54 cents per share "
    },
    {
        "content": "FRANKFURT Bayer  has cut its stake in plastics and chemicals subsidiary Covestro  to 44.8 percent after selling an 8.5 percent stake to institutional investors as part of a plan to sever ownership ties completely in the medium term.",
        "date": "06072017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer cuts Covestro stake to under 45 percent after share sale "
    },
    {
        "content": "* Sells 8.5 pct stake  4 pct of Covestro goes into pension fund",
        "date": "06072017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Bayer cuts Covestro stake to under 45 pct after share sale "
    },
    {
        "content": "A lawsuit by two environmental groups accusing Monsanto of deceiving consumers about the pesticide Roundup should be dismissed because it is preempted by federal law  the company's lawyers told a Washington D.C. federal court.",
        "date": "05192017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto says lawsuit over Roundup preempted by federal law "
    },
    {
        "content": "* Paulson & Co Inc takes share stake of 3.5 million shares in Dish Network Corp",
        "date": "05152017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Paulson & Co Inc takes share stake in Dish Network  Monsanto "
    },
    {
        "content": "* Third Point LLC dissolves share stake in Apple Inc - sec filing",
        "date": "05122017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Third Point LLC dissolves share stake in Apple  Goldman Sachs "
    },
    {
        "content": "FRANKFURT Bayer  has agreed to sell its Liberty herbicide and LibertyLink-branded seeds businesses to win antitrust approval for its acquisition of Monsanto   it said on Monday.",
        "date": "05082017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer to sell Liberty crop protection brands to get Monsanto deal passed "
    },
    {
        "content": "* South African regulator triggers global sale of Liberty brands",
        "date": "05082017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Bayer to sell Liberty crop protection brands to get Monsanto deal passed "
    },
    {
        "content": "FRANKFURT  May 8 Bayer has agreed to divest its Liberty herbicide and Liberty Link-branded seeds businesses across the globe to win antitrust approval for its planned merger with Monsanto  it said on Monday.",
        "date": "05082017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer to sell Liberty crop protection brands to get merger nod "
    },
    {
        "content": "FRANKFURT  April 27 Bayer's 55-year-old Chief Financial Officer Johannes Dietsch will leave the company at his own request in May 2018 after helping the German drugs and pesticides maker conclude its planned acquisition of U.S. seeds giant Monsanto.",
        "date": "04272017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer CFO Dietsch to leave company in May 2018 "
    },
    {
        "content": "CHICAGO Monsanto Co  has terminated an agreement to sell its Precision Planting LLC farm equipment business to machinery maker Deere & Co   the companies said on Monday  ending a legal fight with antitrust authorities over the deal.",
        "date": "05012017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto scraps deal to sell Precision Planting to Deere "
    },
    {
        "content": "* Says assumes that there will still be considerable competition even after Monsanto deal is completed Further company coverage:",
        "date": "04282017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Bayer still sees competition after Monsanto takeover "
    },
    {
        "content": "FRANKFURT  April 27 German drugs and pesticides maker Bayer  which is seeking to to complete its $66 billion takeover U.S. seeds giant Monsanto  received another boost to quarterly earnings from its best-selling stroke-prevention pill Xarelto.",
        "date": "04272017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Strong pharma unit drives Bayer earnings beat "
    },
    {
        "content": "CHICAGO  May 1 Monsanto Co has terminated an agreement to sell its Precision Planting LLC farm equipment business to machinery maker Deere & Co  the companies said on Monday  ending a legal fight with antitrust authorities over the deal.",
        "date": "05012017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Monsanto scraps deal to sell Precision Planting to Deere "
    },
    {
        "content": "* Says Monsanto takeover has so far not had any visible effect on the development of our business Further company coverage:",
        "date": "04282017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto deal hasn't affected Bayer business - Bayer CEO "
    },
    {
        "content": "* Deere emphasizes importance of precision agriculture despite termination of acquisition",
        "date": "05012017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Deere says Monsanto terminates Precision Planting LLC acquisition agreement "
    },
    {
        "content": "BONN Bayer's chief executive acknowledged on Friday that he will face an uphill battle to improve Monsanto's reputation once Bayer completes the takeover of the U.S. seeds and agrochemicals company.",
        "date": "04282017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer CEO says Monsanto's reputation is a 'major challenge' "
    },
    {
        "content": "LONDON  April 28 A leading advisor to pension schemes and other investors on Friday called for a review of Germany's rules around takeovers  in light of a planned takeover of U.S. agrochemicals company Monsanto by Bayer .",
        "date": "04282017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Governance advisor Hermes EOS backs review of German takeover rules "
    },
    {
        "content": "* Monsanto terminates agreement for sale of precision planting equipment business",
        "date": "05012017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto terminates agreement for sale of precision planting equipment business "
    },
    {
        "content": "BONN  April 28 Bayer's chief executive acknowledged on Friday that he will face an uphill battle to improve Monsanto's reputation once Bayer completes the takeover of the U.S. seeds and agrochemicals company.",
        "date": "04282017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer CEO says Monsanto's reputation is a \"major challenge\" "
    },
    {
        "content": "* Monsanto co says  U.S. EPA issued registration for Tioxazafen  which is branded as Nemastriketechnology Source text for Eikon: Further company coverage:",
        "date": "05012017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto’S Nemastriketm Technology approved by EPA "
    },
    {
        "content": "A federal judge in Boston has thrown out a lawsuit by the Town of Westport  Massachusetts against Monsanto Co and two other companies seeking damages for chemical contamination at one of the town's middle schools.",
        "date": "04102017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Judge tosses Westport's lawsuit against Monsanto over PCBs "
    },
    {
        "content": "CHICAGO U.S. seeds and agrochemicals company Monsanto Co  which is in the process of being bought by Germany's Bayer AG for $66 billion  reported a better-than-expected quarterly profit on Wednesday  helped by strong demand for its soybean and corn seeds.",
        "date": "04052017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto second-quarter profit jumps on strong demand for seeds "
    },
    {
        "content": "CHICAGO  April 5 U.S. seeds and agrochemicals company Monsanto Co  which is in the process of being bought by Germany's Bayer AG for $66 billion  reported a better-than-expected quarterly profit on Wednesday  helped by strong demand for its soybean and corn seeds.",
        "date": "04052017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Monsanto Q2 profit jumps on strong demand for seeds "
    },
    {
        "content": "* Monsanto continues return to growth in fiscal year 2017 with strong second quarter and first half results; updates outlook for full year eps to high end of guidance range",
        "date": "04052017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto Q2 earnings per share $3.09 "
    },
    {
        "content": "April 5 U.S. seeds and agrochemicals company Monsanto Co  which is in the process of being bought by Germany's Bayer AG for $66 billion  reported a 28.7 percent rise in quarterly profit  helped by strong demand for soybean and corn seeds.",
        "date": "04052017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto's profit jumps 28.7 pct "
    },
    {
        "content": "* Opponents concerned about concentration of ownership   (Adds comments from American Antitrust Institute)",
        "date": "03272017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 5-Asset sales plan secures EU backing for $130 bln Dow  DuPont merger "
    },
    {
        "content": "NEW DELHI Tens of millions of dollars were within reach for M. Prabhakara Rao as he prepared in April 2015 to take his Indian cotton seed company public.",
        "date": "03292017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto meets its match as Hindu nationalists assert power in India "
    },
    {
        "content": "NEW DELHI  March 28 Monsanto lost a legal battle with one of India's biggest seed producers over a contract dispute on Tuesday  and was ordered to restore a licensing agreement and cut royalty charges.",
        "date": "03282017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto loses legal battle with Indian seed producer "
    },
    {
        "content": "NEW DELHI Monsanto  lost a legal battle with one of India's biggest seed producers over a contract dispute on Tuesday  and was ordered to restore a licensing agreement and cut royalty charges.",
        "date": "03292017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto loses legal battle with Indian seed producer "
    },
    {
        "content": "NEW DELHI  March 28 Tens of millions of dollars were within reach for M. Prabhakara Rao as he prepared in April 2015 to take his Indian cotton seed company public.",
        "date": "03292017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "RPT-SPECIAL REPORT-Monsanto meets its match as Hindu nationalists assert power in India "
    },
    {
        "content": "Dow Chemical and DuPont won the blessing of the European Union for their $130 billion merger on Monday by agreeing to sell substantial assets including key research and development activities.",
        "date": "03282017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Asset sales plan secures EU backing for $130 billion Dow  DuPont merger "
    },
    {
        "content": "* Monsanto unit Climate Corp and Koch Agronomic Services announce research agreement to provide data insights for farmers",
        "date": "03212017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto unit  Koch Agronomic Services announces deal to give data insights to farmers "
    },
    {
        "content": "* Farmlead says a $6.5 million USD series A raise led by Monsanto Growth Ventures  Source text for Eikon:",
        "date": "03202017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Farmlead says $6.5 mln USD series A raise led by Monsanto Growth Ventures "
    },
    {
        "content": "FRANKFURT  March 9 German drug and crop chemical maker Bayer and U.S. seeds company Monsanto are launching asset sales worth roughly $2.5 billion as they seek regulatory clearance for their $66 billion merger  people close to the matter said.",
        "date": "03092017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer  Monsanto start $2.5 bln asset sale to get merger clearance - sources "
    },
    {
        "content": "March 9 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "03092017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "FRANKFURT German drug and crop chemical maker Bayer and U.S. seeds company Monsanto are launching asset sales worth roughly $2.5 billion as they seek regulatory clearance for their $66 billion merger  people close to the matter said.",
        "date": "03092017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer  Monsanto start $2.5 billion asset sale to get merger clearance: sources "
    },
    {
        "content": "March 14 Employees of Monsanto Co ghostwrote scientific reports that U.S. regulators relied on to determine that a chemical in its Roundup weed killer does not cause cancer  farmers and others suing the company claimed in court filings.     The documents  which were made public on Tuesday  are part of a mass litigation in federal court in San Francisco claiming Monsanto failed to warn that exposure to Roundup could cause non-Hodgkin's lymphoma  a type of cancer.",
        "date": "03152017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Plaintiffs in U.S. lawsuit say Monsanto ghostwrote Roundup studies "
    },
    {
        "content": "BOBO-DIOULASSO  Burkina Faso Burkina Faso's cotton sector has settled a dispute with U.S. seed maker Monsanto over what it said were revenue losses caused by the introduction of genetically modified cotton  the head of the country's main cotton company told Reuters.",
        "date": "03082017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Burkina Faso settles dispute with Monsanto over GM cotton "
    },
    {
        "content": "FRANKFURT  Feb 28 Bayer said on Tuesday it was reducing its stake in separately listed chemicals subsidiary Covestro in an accelerated bookbuilding process as it seeks to secure funding for the $66 billion takeover of seeds maker Monsanto.",
        "date": "02282017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer cuts Covestro stake in open market transaction "
    },
    {
        "content": "LEVERKUSEN  Germany German drugs and pesticides maker Bayer  forecast a  year without earnings growth for its agricultural products business on Wednesday  as it seeks to complete its $66 billion deal to take over U.S. seeds giant Monsanto .",
        "date": "02222017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer sees pesticides profits stagnating before Monsanto takeover "
    },
    {
        "content": "FRANKFURT  Feb 22 Bayer  the German drugmaker that is buying U.S. seed maker Monsanto  said it expected a mid-single digit percentage increase in adjusted core earnings for 2017  helped by fast growing revenues from stroke prevention pill Xarelto.",
        "date": "02222017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer predicts mid-single digit EBITDA rise in 2017 "
    },
    {
        "content": "FRANKFURT  Feb 21 Germany's largest drugmaker Bayer said on Tuesday it would propose an annual dividend of 2.70 euros per share to investors  in line with analysts' expectations and up from 2.50 euros a year earlier.",
        "date": "02212017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer to pay out 2.70 eur/shr dividend  in line with market view "
    },
    {
        "content": "* Berkshire Hathaway Inc takes share stake of 8 million shares in Monsanto Co - SEC filing",
        "date": "02142017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Berkshire Hathaway takes share stake in Monsanto "
    },
    {
        "content": "California can force Monsanto Co to label its widely used weed killer Roundup as a possible cancer-causing substance  a state judge ruled on Friday.",
        "date": "02012017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "California can put Monsanto herbicide on carcinogen list -judge "
    },
    {
        "content": "MEXICO CITY A ban on planting genetically modified corn in Mexico is likely to continue for years as a slow-moving legal battle grinds on  said a top executive of U.S.-based seed and agrochemical company Monsanto Co.",
        "date": "01312017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto sees prolonged delay on GMO corn permits in Mexico "
    },
    {
        "content": "* Shareowners did not approve shareowner proposal presented at meeting requesting a Glyphosate report  Source text: [http://bit.ly/2jyfVa1] Further company coverage:",
        "date": "01272017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto says shareowners did not approve proposal requesting a Glyphosate report "
    },
    {
        "content": "MEXICO CITY  Jan 30 A ban on planting genetically modified corn in Mexico is likely to continue for years as a slow-moving legal battle grinds on  said a top executive of U.S.-based seed and agrochemical company Monsanto Co.",
        "date": "01302017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto sees prolonged delay on GMO corn permits in Mexico "
    },
    {
        "content": "* Monsanto board approves dividend of 54 cents per share  Source text for Eikon:  Further company coverage:",
        "date": "01272017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto board approves dividend of 54 cents per share "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 24 (Fitch) Fitch Ratings has maintained Monsanto Company's  (Monsanto) 'A-' Long-Term Issuer Default Rating (IDR) on Rating Watch Negative.  A full list of ratings follows at the end of this release.  On Sept. 14  2016  Bayer announced that it had signed a definitive agreement to  acquire Monsanto for a revised $66 billion acquisition price including assumed  debt ($8.6 billion as of Nov. 30  2016). The Negative Watch ",
        "date": "01242017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Fitch Maintains Monsanto Company's 'A-' IDR on Rating Watch Negative "
    },
    {
        "content": "COPENHAGEN Enzymes maker Novozymes will cut 198 jobs and invest more in emerging markets  it said on Wednesday  adding it could time take to recapture past growth rates amid uncertainty over U.S. renewable energy policy and the takeover of a key partner.",
        "date": "01182017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Novozymes cuts jobs  says U.S. policy  Monsanto deal pose risks "
    },
    {
        "content": "* Trump elicited spending pledges from several big companies   (Adds details on Bayer and Monsanto's previous R&D spending plans)",
        "date": "01172017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 1-Bayer  Monsanto confirm spending plans after meeting Trump "
    },
    {
        "content": "* Q4 earnings beat expectations  to buy back shares   (Adds CEO comments)",
        "date": "01182017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Novozymes cuts jobs  says U.S. policy  Monsanto deal pose risks "
    },
    {
        "content": "FRANKFURT  Jan 17 A future combined Bayer  and Monsanto expects to spend about $16 billion on research and development over the next six years with at least half of this investment made in the United States  the two companies said in a statement on Tuesday.",
        "date": "01172017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer  Monsanto pledge U.S. R&D spending  jobs after merger "
    },
    {
        "content": "FRANKFURT Bayer and Monsanto said on Tuesday they would spend at least half of their agriculture research and development budget in the United States over the next six years  following a meeting with President-elect Donald Trump last week.",
        "date": "01182017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer  Monsanto confirm spending plans after meeting Trump "
    },
    {
        "content": "WASHINGTON Bayer AG has pledged to boost its investments in the United States amid its deal to buy U.S. seeds giant Monsanto  investing $8 billion in research and development and adding American jobs  U.S. President-elect Donald Trump's spokesman said on Tuesday.",
        "date": "01172017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer to boost U.S. jobs  investments amid Monsanto deal: Trump spokesman "
    },
    {
        "content": "WASHINGTON  Jan 17 Bayer AG has pledged to boost its investments in the United States amid its deal to buy U.S. seeds giant Monsanto  investing$8 billion in research and development and adding American jobs  U.S. President-elect Donald Trump's spokesman said on Tuesday.",
        "date": "01172017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer to boost U.S. jobs  investments amid Monsanto deal -Trump spokesman "
    },
    {
        "content": "* Monsanto and NRgene announce global licensing agreement for big data genomic analysis technology  Source text for Eikon:  Further company coverage:",
        "date": "01122017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto and NRgene announce global licensing agreement "
    },
    {
        "content": "Jan 12 The following bids  mergers  acquisitions and disposals were reported by 1100 GMT on Thursday:",
        "date": "01122017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "FRANKFURT  Jan 12 German drugs and pesticides maker Bayer  which will need regulatory approval for its $66 billion deal to buy U.S. seeds giant Monsanto  said company chief executives had a productive meeting with U.S. president-elect Donald Trump.",
        "date": "01122017",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer says had productive meeting with Trump over Monsanto deal "
    },
    {
        "content": "Chicago U.S. seeds and agrochemicals company Monsanto Co   which is in the process of being bought by Germany's Bayer AG  for $66 billion  swung to a quarterly profit  helped by higher demand from South America.",
        "date": "01052017",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto swings to profit on higher South America demand "
    },
    {
        "content": "CHICAGO Shareholders of U.S. seeds and agrochemicals company Monsanto Co approved the company's $66 billion acquisition by Bayer AG on Tuesday  a deal that still requires regulatory approval to close as expected in late 2017.",
        "date": "12142016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto shareholders back Bayer deal  CEO hopeful of U.S. approval "
    },
    {
        "content": "Washington state filed an environmental lawsuit on Thursday against agricultural company Monsanto Co seeking damages and cleanup costs associated with the company's production of PCBs  the state's attorney general said.",
        "date": "12092016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Washington state sues Monsanto over PCB damages  cleanup costs "
    },
    {
        "content": "* The climate corporation acquires Vitalfields to expand digital agriculture innovation for european farmers  Source text for Eikon:  Further company coverage:",
        "date": "11212016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto subsidiary Climate Corporation acquires Vitalfields "
    },
    {
        "content": "* Monsanto co - in connection with merger with Bayer  a purported class action lawsuit  captioned ken gawrych  was filed on nov. 16  2016",
        "date": "11222016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto provides update on Bayer merger "
    },
    {
        "content": "LONDON/BERLIN German chemicals and healthcare group Bayer AG  is selling 4 billion euros ($4.3 billion) worth of mandatory convertible notes to help fund its proposed acquisition of U.S. seeds company Monsanto Co .",
        "date": "11152016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer to raise four billion euros via convertible notes for Monsanto deal "
    },
    {
        "content": "* Proceeds will be used for $66 bln Monsanto buy   (Adds comment by banker  background)",
        "date": "11152016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Bayer to raise 4 bln euros via convertible notes for Monsanto deal "
    },
    {
        "content": "BERLIN  Nov 15 German chemicals and healthcare group Bayer AG will issue 4 billion euros ($4.3 billion) in mandatory convertible notes as part of measures to fund its acquisition of U.S. seeds company Monsanto Co.",
        "date": "11152016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer to issue convertible notes for Monsanto buy "
    },
    {
        "content": "* Third Point LLC takes 2.5 million share stake in Apple Inc - SEC filing",
        "date": "11102016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Third Point LLC takes share stake in Apple  ups share stake in Monsanto - SEC filing "
    },
    {
        "content": "Nov 9 U.S. seeds and agrochemicals maker Monsanto Co has secured approval from the U.S. Environmental Protection Agency for a new dicamba-based weed killer designed for its next generation biotech soy and cotton varieties  the company said on Wednesday.",
        "date": "11102016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EPA approves Monsanto's dicamba weed killer "
    },
    {
        "content": "* Monsanto Co - on October 28  2016  company entered into a $1 billion delayed draw term loan agreement  primarily to refinance maturing long-term debt",
        "date": "11022016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto enters into $1 bln delayed draw term loan agreement "
    },
    {
        "content": "* Monsanto co - designated December 13  2016 as date for a special meeting of shareowners to vote upon proposal to adopt merger agreement with Bayer  Source text for Eikon:  Further company coverage:",
        "date": "11012016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto sets special shareholder meeting date to vote on merger proposal with Bayer "
    },
    {
        "content": "* Moody's - Combined portfolio of Bayer and Monsanto will be broad-based and well-balanced across indications and crops",
        "date": "10312016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Moody's- Bayer's acquisition of Monsanto will push leverage up sharply in the short term "
    },
    {
        "content": "* Shares flat   (Adds details on pharma selling costs  crop protection unit)",
        "date": "10262016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 1-Bayer Q3 profit beats forecasts on pharma  pesticides "
    },
    {
        "content": "FRANKFURT  Oct 26 Bayer  the German drugmaker that is buying U.S. seed company Monsanto  beat expectations for third-quarter earnings on gains in pharmaceuticals and forecast-beating farming pesticides.",
        "date": "10262016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer Q3 earnings beat expectations on pharma "
    },
    {
        "content": "FRANKFURT  Oct 13 Bayer has short-listed India's Lupin and  investor BC Partners as prospective buyers of medical skin cream assets in a potential 1 billion euro ($1.1 billion) deal  several people familiar with the sale told Reuters.",
        "date": "10132016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer's medical skin creams draw suitors Lupin  BC Partners -sources "
    },
    {
        "content": "SAO PAULO  Oct 10 Microsoft Corp and Brazilian lender Banco Votorantim are investing together in financial technology startups  executives said in a Monday interview  as the U.S. tech company adds a new specialty to its venture capital portfolio in Brazil.",
        "date": "10102016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Microsoft  Banco Votorantim partner on Brazil fintech investments "
    },
    {
        "content": "* Monsanto and Dow Agrosciences announce global licensing agreement on Exzact precision technology genome-editing platform",
        "date": "10032016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto  Dow Agrosciences enter global licensing agreement on Exzact Precision Technology Platform "
    },
    {
        "content": "BRUSSELS  Oct 3 EU antitrust regulators have resumed their investigation into the $130 billion merger of U.S. chemicals giants Dow Chemical and DuPont after the companies provided key data.",
        "date": "10032016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU resumes probe into DuPont  Dow mega deal  to rule by Feb 6 "
    },
    {
        "content": "U.S. seeds and agrochemicals company Monsanto Co   which agreed last month to be bought by Germany's Bayer AG  for $66 billion  reported a surprise adjusted profit  helped by a drop in expenses and higher corn seed volumes.",
        "date": "10052016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto surprises with adjusted profit as expenses drop "
    },
    {
        "content": "Oct 5 U.S. seeds and agrochemicals company Monsanto Co  which agreed last month to be bought by Germany's Bayer AG for $66 billion  reported a surprise adjusted profit  helped by a drop in expenses and higher corn seed volumes.",
        "date": "10052016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Monsanto surprises with adjusted profit as expenses drop "
    },
    {
        "content": "* Continued Soybean Technology Expansion And Cost Discipline Expected To Drive Return To EPS Growth In FY17",
        "date": "10052016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto Q4 Loss Per Share of $0.44 on an as-reported basis "
    },
    {
        "content": "Oct 5 U.S. seeds and agrochemicals company Monsanto Co  which agreed last month to be bought by Germany's Bayer AG for $66 billion  reported a smaller quarterly loss on Wednesday  helped by higher corn seed volumes and lower expenses.",
        "date": "10052016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto's quarterly loss narrows as expenses drop "
    },
    {
        "content": "LONDON Novozymes   already grappling with the consequences of low oil and crop prices  is watching anxiously to see what Bayer's  purchase of Monsanto  will mean for the Danish group's ties with its key agricultural partner.",
        "date": "09282016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto ally Novozymes sees opportunity  risk in Bayer merger "
    },
    {
        "content": "* Monsanto announces global licensing agreement with Broad Institute on key genome-editing application",
        "date": "09222016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto announces global licensing agreement with Broad Institute "
    },
    {
        "content": "* Bayer is committed to make divestitures if required up to $1.6 billion to obtain antitrust approvals for merger",
        "date": "09212016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto Co - Bayer is committed to make divestitures to obtain antitrust approvals "
    },
    {
        "content": "* Bayer not required to take any divestiture action that would likely result in 1-year loss of net sales to Bayer  co in excess of $1.6 billion",
        "date": "09202016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto Co - Bayer not required to take any material adverse divestiture action "
    },
    {
        "content": "FRANKFURT German drugmaker Bayer  said its two best-selling drugs had a higher annual peak sales potential than previously targeted  after the agreed $66 billion takeover of Monsanto  stirred criticism it might neglect its pharmaceuticals business.",
        "date": "09202016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer raises sales targets for top-selling drugs after Monsanto deal "
    },
    {
        "content": "FRANKFURT  Sept 20 German drugmaker Bayer  said its two best-selling drugs had a higher annual peak sales potential than previously targeted  after the agreed $66 billion takeover of Monsanto stirred criticism it might neglect its pharmaceuticals business.",
        "date": "09202016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer ups sales targets for top-selling drugs after Monsanto deal "
    },
    {
        "content": "* Bayer proposes improved Monsanto offer of $129 a share -Bloomberg  Source text - http://bloom.bg/2cpaVjJ Further company coverage: [BAYGn.DE MON.N]",
        "date": "09132016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Bayer proposes improved Monsanto offer of $129 a share - Bloomberg "
    },
    {
        "content": "Sept 12 Canadian fertilizer producers Potash Corp of Saskatchewan Inc and Agrium Inc agreed to combine to navigate a severe industry slump by boosting efficiency and cutting costs  but the new company's potential pricing power may attract tough regulatory scrutiny.",
        "date": "09122016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 5-Fertilizer majors Potash and Agrium to merge  face tough scrutiny "
    },
    {
        "content": "Monsanto's board is set to meet on Tuesday to decide whether to approve a sale to Germany's Bayer  for more than $65 billion after concluding more than four months of negotiations  people familiar with the matter said.",
        "date": "09132016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto board close to giving nod to Bayer deal on Tuesday -sources "
    },
    {
        "content": "* fitch: bayer  monsanto deal structure reflects financial risks",
        "date": "09152016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Fitch says Bayer  Monsanto deal structure reflects financial risks "
    },
    {
        "content": "* S&P - Monsanto Co. downgraded to 'BBB' on weak operations; Ratings on creditwatch positive on planned acquisition by Bayer AG",
        "date": "09152016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-S&P downgrades Monsanto to 'BBB' on weak operations "
    },
    {
        "content": "WASHINGTON D.C./NEW YORK As the global agricultural sector races to consolidate  Bayer AG's $66 billion all-cash deal to acquire Monsanto Co will test growing political and consumer unease in the United States and abroad over the future of food production. | Video ",
        "date": "09152016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer's Monsanto acquisition to face politically charged scrutiny "
    },
    {
        "content": "PARIS  Sept 15 European Union anti-trust chief Margrethe Vestager said on Thursday that farmers must continue to have a choice when buying seeds and pesticides after the merger between Bayer and Monsanto.",
        "date": "09152016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "RPT-Farmers must have choice post Bayer-Monsanto merger - EU's Vestager "
    },
    {
        "content": "PARIS European Union anti-trust chief Margrethe Vestager said on Thursday that farmers must continue to have a choice when buying seeds and pesticides after the merger between Bayer and Monsanto.",
        "date": "09152016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Farmers must have choice post Bayer-Monsanto merger: EU's Vestager "
    },
    {
        "content": "PARIS  Sept 15 European Union anti-trust chief Margrethe Vestager said on Thursday that farmers must continue to have a choice when buying seeds and pesticides after the merger between Bayer and Monsanto.",
        "date": "09152016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Farmers must have choice post Bayer-Monsanto merger - EU's Vestager "
    },
    {
        "content": "* Negative watch reflects potential downgrade of Bayer's IDR to below 'A-' as a result of merger with Monsanto  Source text for Eikon:",
        "date": "09142016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Fitch places Monsanto Co's ratings on negative watch "
    },
    {
        "content": "NEW YORK/FRANKFURT German drug and crop chemical maker Bayer clinched a $66 billion takeover of U.S. seeds company Monsanto on Wednesday  ending months of wrangling with a third sweetened offer that marks the largest all-cash deal on record.",
        "date": "09152016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer clinches Monsanto with improved $66 billion bid "
    },
    {
        "content": "SAO PAULO South American farmers are expected to sow 57 percent more area with Monsanto Co's second-generation  genetically modified soybean seed Intacta RR2 Pro in the new planting season which kicks off on Thursday  a company executive said on Wednesday.",
        "date": "09142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto's Intacta GMO soy to expand 57 percent in South America "
    },
    {
        "content": "NEW YORK/FRANKFURT  Sept 14 German drug and crop chemical maker Bayer clinched a $66 billion takeover of U.S. seeds company Monsanto on Wednesday  ending months of wrangling with a third sweetened offer that marks the largest all-cash deal on record.",
        "date": "09152016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "REFILE-UPDATE 6-Bayer clinches Monsanto with improved $66 billion bid "
    },
    {
        "content": "Sept 14 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "09142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "German chemicals and crop pesticides firm Bayer AG  is exploring the sale of its dermatology business to push forward its deal with Monsanto Co   Bloomberg reported  citing sources.",
        "date": "09082016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer exploring sale of dermatology business: Bloomberg "
    },
    {
        "content": "The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "09152016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "PRESS DIGEST- British Business - Sept 15 "
    },
    {
        "content": "WASHINGTON D.C./NEW YORK  Sept 14 As the global agricultural sector races to consolidate  Bayer AG's  $66 billion all-cash deal to acquire Monsanto Co will test growing political and consumer unease in the United States and abroad over the future of food production.",
        "date": "09142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer's Monsanto acquisition to face politically charged scrutiny "
    },
    {
        "content": "LONDON  Sept 14 Bayer investor Royal London Asset Management said on Wednesday it backed the agreed deal for U.S. rival Monsanto  calling it \"a great deal for Bayer shareholders\".",
        "date": "09142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer investor Royal London backs agreed $128/share Monsanto offer "
    },
    {
        "content": "Sept 8 German chemicals and crop pesticides firm Bayer AG is exploring the sale of its dermatology business to push forward its deal with Monsanto Co  Bloomberg reported  citing sources.",
        "date": "09082016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer exploring sale of dermatology business - Bloomberg "
    },
    {
        "content": "* Announced a research agreement to accelerate discovery of new microbiome-based solutions",
        "date": "09062016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto collaborates with Second Genome to use microbiome technology platform to accelerate protein discovery "
    },
    {
        "content": "* Bayer exec says co needs to seek anti trust approval from 30 jurisdictions",
        "date": "09142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Bayer to seek anti-trust approval for Monsanto deal from 30 jurisdictions "
    },
    {
        "content": "FRANKFURT/NEW YORK German pharmaceutical and crop chemicals manufacturer Bayer AG says talks with Monsanto Co have advanced and  it is now willing to offer more than $65 billion  a 2 percent increase on its previous offer for the world's largest seeds company. | Video ",
        "date": "09062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer sweetens Monsanto bid as talks enter final stretch "
    },
    {
        "content": "FRANKFURT/NEW YORK  Sept 5 German pharmaceutical and crop chemicals manufacturer Bayer AG says talks with Monsanto Co have advanced and  it is now willing to offer more than $65 billion  a 2 percent increase on its previous offer for the world's largest seeds company.",
        "date": "09062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "RPT-UPDATE 4-Bayer sweetens Monsanto bid as talks enter final stretch "
    },
    {
        "content": "LONDON  Sept 6 A shareholder in Bayer  said on Tuesday that the German chemical and crop pesticide firm's potential takeover of rival Monsanto represented significant risks for shareholders.",
        "date": "09062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Jupiter's Herbert says Bayer/Monsanto deal carries 'significant risks' "
    },
    {
        "content": "FRANKFURT Bayer's  supervisory board will discuss in a meeting on Sept. 14 whether to sweeten its offer for Monsanto  again or even pursue a hostile takeover  German daily Rheinische Post reported  citing company sources.",
        "date": "09042016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer board to discuss Monsanto bid on September 14: Rheinische Post "
    },
    {
        "content": "* CEO says there is no price adjustment mechanism in the agreement with monsanto  regulatory risks are under control",
        "date": "09142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Bayer CEO says has encouraging feedback from regulators on Monsanto deal "
    },
    {
        "content": "* Unit head says matching last year's profitability a stretch",
        "date": "09062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-BASF warns crop protection markets to remain challenging "
    },
    {
        "content": "FRANKFURT  Sept 4 Bayer's supervisory board will discuss in a meeting on Sept. 14 whether to sweeten its offer for Monsanto again or even pursue a hostile takeover  German daily Rheinische Post reported  citing company sources.",
        "date": "09042016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer board to discuss Monsanto bid on Sept. 14 - Rheinische Post "
    },
    {
        "content": "Sept 5 German drugmaker Bayer AG said on Monday it was in advanced talks to acquire Monsanto Co  and was raising its offer for the U.S. seed producer.",
        "date": "09052016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer in advanced talks with Monsanto for deal "
    },
    {
        "content": "* Credit Suisse acting with Bank Of America Merrill Lynch as lead financial advisors and structuring banks to Bayer in addition to providing committed financing for the Bayer/Monsanto deal    (Reporting by Zurich Newsroom)",
        "date": "09142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Credit Suisse  Bank Of America lead financial advisors to Bayer in Monsanto deal "
    },
    {
        "content": "FRANKFURT  Sept 6 German pharmaceutical and crops manufacturer Bayer is screening the books of takeover target Monsanto  sources familiar with the matter said  as Bayer agreed to sweeten its offer for the world's largest seeds company to more than $65 billion.",
        "date": "09062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer conducting due diligence at takeover target Monsanto - sources "
    },
    {
        "content": "* Says confirms advanced negotiations with monsanto  concerning a proposed transaction",
        "date": "09052016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Bayer says prepared to offer $127.50 per Monsanto share under an agreement "
    },
    {
        "content": "BOONE  Iowa Monsanto Co's digital agriculture platform should begin generating revenue for the seed and chemical company by 2020 as paid subscriptions for data-driven farm management and planting advice services expand  a top executive told Reuters.",
        "date": "08312016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto's Climate Corp seen profitable by 2020: CTO Fraley "
    },
    {
        "content": "A former Monsanto Co executive who tipped the U.S. Securities and Exchange Commission to accounting improprieties involving the company's top-selling Roundup product has been awarded more than $22 million from the agency's whistleblower program  the executive's lawyer said on Tuesday.",
        "date": "08302016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "U.S. SEC awards $22 mln to ex-Monsanto exec through whistleblower program "
    },
    {
        "content": "In muddying default message  China risks bond market ructions",
        "date": "09062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Reuters Business News Schedule at 0430 GMT/00.30AM ET "
    },
    {
        "content": "* Confirms advanced negotiations with Monsanto concerning a proposed transaction",
        "date": "09052016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Bayer confirms advanced negotiations with Monsanto concerning a proposed transaction "
    },
    {
        "content": "WINNIPEG/CHICAGO  Aug 31 North American farmers will pressure regulators to protect their negotiating leverage with fertilizer suppliers if Potash Corp of Saskatchewan  and Agrium Inc agree to merge  major farm groups said on Wednesday.",
        "date": "08312016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Canada fertilizer deal would send farmers to regulators "
    },
    {
        "content": "BOONE  Iowa  Aug 31 Monsanto Co's digital agriculture platform should begin generating revenue for the seed and chemical company by 2020 as paid subscriptions for data-driven farm management and planting advice services expand  a top executive told Reuters.",
        "date": "08312016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "INTERVIEW-Monsanto's Climate Corp seen profitable by 2020 -CTO Fraley "
    },
    {
        "content": "A former Monsanto Co  executive who tipped the U.S. Securities and Exchange Commission to accounting improprieties involving the company's top-selling Roundup product has been awarded more than $22 million from the agency's whistleblower program  the executive's lawyer said on Tuesday.",
        "date": "08302016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "SEC awards $22 million to ex-Monsanto executive through whistleblower program "
    },
    {
        "content": "* Monsanto Company - Confirmed it has been engaged in constructive negotiations with Bayer AG",
        "date": "09062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto confirms updated proposal from Bayer "
    },
    {
        "content": "Aug 31 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "08312016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Aug 30 A former Monsanto Co executive who tipped the U.S. Securities and Exchange Commission to accounting improprieties involving the company's top-selling Roundup product has been awarded more than $22 million from the agency's whistleblower program  the executive's lawyer said on Tuesday.",
        "date": "08302016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-U.S. SEC awards $22 mln to ex-Monsanto exec through whistleblower program "
    },
    {
        "content": "* On August 31  2016  William U. Parfet submitted his resignation from board of directors",
        "date": "08312016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto board member William Parfet submits resignation - SEC Filing "
    },
    {
        "content": "WINNIPEG  Manitoba/WASHINGTON Canada's Agrium Inc  and Potash Corp of Saskatchewan Inc  said on Tuesday they are in talks to merge  a deal that would create a fertilizer and farm retailing giant worth more than $25 billion but also trigger U.S. regulatory scrutiny.",
        "date": "08302016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Potash Corp  Agrium talk merger; competition scrutiny expected "
    },
    {
        "content": "WINNIPEG  Manitoba/WASHINGTON  Aug 30 Canada's Agrium Inc and Potash Corp of Saskatchewan Inc  said on Tuesday they are in talks to merge  a deal that would create a fertilizer and farm retailing giant worth more than $25 billion but also trigger U.S. regulatory scrutiny.",
        "date": "08302016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 6-Potash Corp  Agrium talk merger; competition scrutiny expected "
    },
    {
        "content": "* Deere & Co says it plans to contest legal action announced by U.S. Department of justice to block acquisition of Monsanto's precision planting",
        "date": "08312016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Deere & Co. plans to contest U.S. govt legal action to block acquisition "
    },
    {
        "content": "WASHINGTON  Aug 31 The U.S. Justice Department said on Wednesday it has filed a lawsuit to stop Deere & Co  from buying Monsanto's Precision Planting farm equipment business.",
        "date": "08312016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "U.S. sues to stop Deere from buying Precision Planting "
    },
    {
        "content": "Aug 30 A former Monsanto Co executive who tipped the U.S. Securities and Exchange Commission to accounting improprieties involving the company's top-selling Roundup product has been awarded more than $22 million from the agency's whistleblower program  the executive's lawyer said on Tuesday.",
        "date": "08302016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "U.S. SEC awards $22 mln to Monsanto whistleblower "
    },
    {
        "content": "BUENOS AIRES  Aug 25 Argentine soy farmers fear they will get shortchanged under a proposal they say would favor U.S. agricultural company Monsanto Co by forcing them to pay royalties on seeds grown on their own farms using the company's genetically modified technology.",
        "date": "08252016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Argentine soy growers fret seed royalties bill might favor Monsanto "
    },
    {
        "content": "* U.S. files antitrust suit against Deere and Monsanto - Bloomberg",
        "date": "08312016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-U.S. files antitrust suit against Deere and Monsanto - Bloomberg "
    },
    {
        "content": "NEW DELHI Monsanto Co  has withdrawn an application seeking approval for its next generation of genetically modified cotton seeds in India  a major escalation in a long-running dispute between New Delhi and the world's biggest seed maker.",
        "date": "08252016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Exclusive: Monsanto pulls new GM cotton seed from India in protest "
    },
    {
        "content": "NEW DELHI A government panel has cleared commercial use of what would be India's first genetically modified (GM) food crop  but politicians still have to give final approvals amid wide-spread public opposition.",
        "date": "08252016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "GM mustard clears hurdle in India but more remain "
    },
    {
        "content": "* Final decision needed by minister; opposition likely   (Adds environment ministry comment in paragraph 5)",
        "date": "08252016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-GM mustard clears hurdle in India but more remain "
    },
    {
        "content": "NEW DELHI  Aug 25 A government panel has cleared commercial use of what would be India's first genetically modified (GM) food crop  but the political establishment will still have to give final approvals amid wide-spread public opposition to the technology.",
        "date": "08252016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "India government panel clears GM mustard but hurdles remain -sources "
    },
    {
        "content": "* On Aug 12 Co's board approved and adopted an amendment to company's bylaws to add a new section 68 - sec filing",
        "date": "08182016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto board approved amendment to co's bylaws "
    },
    {
        "content": "Monsanto Co's Climate Corporation is building a network of in-field sensors to expand the scope of soil  weather and other data flowing into its digital agriculture tools that help farmers increase crop yields and reduce costs  the company said on Wednesday.",
        "date": "08172016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto's Climate Corp to expand digital farming platform "
    },
    {
        "content": "Aug 17 Monsanto Co's Climate Corporation is building a network of in-field sensors to expand the scope of soil  weather and other data flowing into its digital agriculture tools that help farmers increase crop yields and reduce costs  the company said on Wednesday.",
        "date": "08172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Monsanto's Climate Corp to expand digital farming platform "
    },
    {
        "content": "Aug 17 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "08172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "FRANKFURT U.S. seed company Monsanto has given German suitor Bayer AG limited access to its books after turning down a sweetened $64 billion takeover offer last month  two sources familiar with the situation told Reuters.",
        "date": "08172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto gives Bayer limited access to its books: sources "
    },
    {
        "content": "* Bayer has no appetite to go hostile but talks difficult -sources   (Adds Monsanto CEO comment)",
        "date": "08172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Monsanto gives Bayer limited access to its books -sources "
    },
    {
        "content": "Aug 17 Monsanto Co subsidiary the Climate Corporation is developing a network of in-field sensors to expand the scope of farming data flowing into its digital agriculture platform  the company said on Wednesday.",
        "date": "08172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto's Climate Corp building network of farm data sensors "
    },
    {
        "content": "* Sees restructuring expense of about $1.1 billion-1.2 billion for FY15-FY18 period",
        "date": "08172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto sees restructuring expense of $1.1-1.2 bln in FY15-18 period "
    },
    {
        "content": "* Accelerating the future of agriculture: Monsanto uniquely positioned to deliver integrated solutions to drive long-term growth",
        "date": "08172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto says reconfirms FY16 as-reported EPS guidance at low end of range of $3.36 to $4.14 "
    },
    {
        "content": "FRANKFURT  Aug 17 U.S. seed giant Monsanto  has given German suitor Bayer limited access to its books after turning down a sweetened $64-billion takeover offer last month  two sources familiar with the situation told Reuters.",
        "date": "08172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto gives Bayer limited access to information -sources "
    },
    {
        "content": "* Novozymes posts weaker than expected second-quarter results and downgrades the full-year sales guidance due to declining sales of its ethanol enzymes and in its agriculture product alliance with Monsanto",
        "date": "08102016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 1-Novozymes lowers 2016 guidance on weak ethanol  BioAg sales "
    },
    {
        "content": "FRANKFURT  Aug 5 The following are some of the factors that may move German stocks on Friday:",
        "date": "08052016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "German stocks - Factors to watch on August 5 "
    },
    {
        "content": "* Seneca foods and Monsanto announce long-term tolling agreement to drive efficiencies in vegetable large seed processing",
        "date": "08042016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Seneca Foods and Monsanto announce long-term tolling agreement "
    },
    {
        "content": "* Area planted with indigenous variety jumps in northern India",
        "date": "08032016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Indian farmers cotton on to new seed  in blow to Monsanto "
    },
    {
        "content": "FRANKFURT  July 27 BASF will not put its Agricultural Solutions unit up for sale as part of an ongoing consolidation wave in the crop protection and seeds industry  the chemical group's chief executive said on Wednesday.",
        "date": "07272016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BASF CEO says not parting with crop protection division "
    },
    {
        "content": "Genetically modified wheat developed by Monsanto Co  and never approved by federal regulators  has been found growing in a Washington state farm field  the U.S. Department of Agriculture (USDA) said on Friday.",
        "date": "07292016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "USDA confirms unapproved GMO wheat found in Washington state "
    },
    {
        "content": "FRANKFURT Bayer   the German drugmaker trying to acquire U.S. seed company Monsanto   surpassed second-quarter earnings expectations and raised its guidance for the year as strong gains in stroke prevention pill Xarelto offset sluggish farming pesticides markets.",
        "date": "07272016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer drugs secure earnings beat  offset weak crop chems "
    },
    {
        "content": "July 29 Genetically modified wheat developed by Monsanto Co  and never approved by federal regulators  has been found growing in a Washington state farm field  the U.S. Department of Agriculture (USDA) said on Friday.",
        "date": "07292016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-USDA confirms unapproved GMO wheat found in Washington state "
    },
    {
        "content": "CHICAGO The European Commission on Friday approved imports of Monsanto's Roundup Ready 2 Xtend genetically modified soybean variety  after months of delays that had derailed the U.S. seed giant's product launch this spring.",
        "date": "07222016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "EU approves Monsanto  Bayer genetically modified soybeans "
    },
    {
        "content": "* Authorisation for feed  food use but not cultivation   (Recasts throughout; adds ADM comment  analyst comment  Monsanto share prices)",
        "date": "07222016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-EU approves Monsanto  Bayer genetically modified soybeans "
    },
    {
        "content": "* European Commission has granted import approval for Roundup Ready 2 xtend soybeans",
        "date": "07222016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto gets European Commission import approval for Roundup Ready 2 xtend soybeans "
    },
    {
        "content": "Corvex Management LP  the activist fund run by former Carl Icahn protégé Keith Meister  has amassed small stakes in U.S. seeds company Monsanto Co  and its aspiring acquirer  Germany's Bayer AG   people familiar with the matter said on Monday.",
        "date": "07182016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Corvex builds small stakes in Monsanto  Bayer: sources "
    },
    {
        "content": "July 18 Corvex Management LP  the activist fund run by former Carl Icahn protégé Keith Meister  has amassed small stakes in U.S. seeds company Monsanto Co and its aspiring acquirer  Germany's Bayer AG  people familiar with the matter said on Monday.",
        "date": "07182016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Corvex builds small stakes in Monsanto  Bayer -sources "
    },
    {
        "content": "By Greg Roumeliotis  Ludwig Burger  Swetha Gopinath and Amrutha Gayathri",
        "date": "07192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto rejects Bayer's sweetened offer  open to talks "
    },
    {
        "content": "* Monsanto shares rise 0.3 pct; Bayer off 1.2 pct   (Adds Bayer statement  updates shares)",
        "date": "07192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 6-Monsanto rejects Bayer's sweetened offer  open to talks "
    },
    {
        "content": "BERLIN  July 19 Bayer said its sweetened $64 billion acquisition offer for Monsanto would not be subject to any financing conditions  responding to the U.S. seed company's rejection of its latest proposal on Tuesday.",
        "date": "07192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer says Monsanto offer not subject to any financing condition "
    },
    {
        "content": "* Monsanto views Bayer's revised proposal as financially inadequate and insufficient to ensure deal certainty",
        "date": "07192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto views Bayer's revised proposal as financially inadequate  insufficient to ensure deal certainty "
    },
    {
        "content": "LONDON Henderson Global Investors  a minority investor in Bayer has demanded a vote on the firm's $64 billion-plus proposed takeover of Monsanto  which it said threatened the long-term strength of the German chemicals group.",
        "date": "07192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Henderson calls for investor vote on Bayer's takeover of Monsanto "
    },
    {
        "content": "* Key investor says deal would threaten Bayer's long-term strength",
        "date": "07192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Henderson calls for investor vote on Bayer's takeover of Monsanto "
    },
    {
        "content": "LONDON  July 19 Henderson Global Investors   a key minority investor in Bayer has demanded a vote on the firm's $64 billion-plus proposed takeover of Monsanto  which it said threatened the long-term strength of the German chemicals group.",
        "date": "07192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Henderson calls for investor vote on Bayer-Monsanto takeover  says unconvinced by deal "
    },
    {
        "content": "U.S. seeds company Monsanto Co is negotiating the terms of a confidentiality agreement with Bayer AG that would allow extensive due diligence  after the German drug and crop chemical group raised its acquisition bid to more than $64 billion  a source familiar with the matter said on Monday.",
        "date": "07192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Exclusive: Monsanto in talks with Bayer over confidentiality pact - source "
    },
    {
        "content": "German drug and crop chemical group Bayer AG on Thursday announced details of a sweetened $64 billion bid for Monsanto Co as it tries to put the U.S. seed company under pressure to engage further.",
        "date": "07152016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer sweetens offer for hesitant Monsanto "
    },
    {
        "content": "Seed company Monsanto Co   which rejected Bayer AG's  buyout offer in May  is exploring various transactions  including the acquisition of BASF's agriculture-solutions unit  Bloomberg reported.",
        "date": "07132016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto exploring deals  including BASF agriculture unit buy: BBG "
    },
    {
        "content": "July 13 Seed company Monsanto Co  which rejected Bayer AG's buyout offer in May  is exploring various transactions  including the acquisition of BASF's agriculture-solutions unit  Bloomberg reported.",
        "date": "07132016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Monsanto exploring deals  including BASF agri unit buy -BBG "
    },
    {
        "content": "German drug and crop chemical group Bayer AG  on Thursday announced details of a sweetened $64 billion bid for Monsanto Co as it tries to put the U.S. seed company under pressure to engage further.",
        "date": "07142016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer sweetens offer for hesitant Monsanto "
    },
    {
        "content": "* Monsanto said to revive talks with BASF over Bayer alternative - Bloomberg  citing sources",
        "date": "07132016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto said to revive talks with BASF over Bayer alternative - Bloomberg  citing sources "
    },
    {
        "content": "July 14 German drug and crop chemical group Bayer AG on Thursday announced details of a sweetened $64 billion bid for Monsanto Co as it tries to put the U.S. seed company under pressure to engage further.",
        "date": "07142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 4-Bayer sweetens offer for hesitant Monsanto "
    },
    {
        "content": "* Board of directors of Monsanto will review proposal  in consultation with its financial and legal advisors",
        "date": "07142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto says has received revised proposal from Bayer "
    },
    {
        "content": "FRANKFURT  July 14 Bayer said on Thursday it had raised its offer for Monsanto to $125 per share from $122.",
        "date": "07142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer raises offer for Monsanto to $125/shr "
    },
    {
        "content": "BERLIN/FRANKFURT  July 14 The DAX top-30 index  looked set to open 0.3 percent higher on Thursday  according to premarket data from brokerage Lang & Schwarz at 0605 GMT.",
        "date": "07142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "German stocks - Factors to watch on July 14 "
    },
    {
        "content": "CHICAGO  July 7 U.S. seed and agrochemicals companies Monsanto Co and DuPont said on Thursday they have signed a multi-year supply agreement for the weed killer dicamba in the United States and Canada.",
        "date": "07072016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto  DuPont sign supply agreement for dicamba herbicide "
    },
    {
        "content": "SAO PAULO  July 4 U.S. biotech company Monsanto Co and Microsoft Corp announced on Monday a partnership to invest in agricultural technology startups in Brazil.",
        "date": "07042016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto  Microsoft to invest in agricultural technology in Brazil "
    },
    {
        "content": "* Dupont will sell its new herbicide as Dupont Fexapan Herbicide Plus Vaporgrip  Technology.",
        "date": "07072016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto and Dupont sign Dicamba supply agreement "
    },
    {
        "content": "* S&P - Monsanto Co. outlook revised to negative on weak earnings; 'BBB+' rating affirmed",
        "date": "06302016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-S&P - Monsanto Co. outlook revised to negative on weak earnings; 'BBB+' rating affirmed "
    },
    {
        "content": "BERLIN  June 30 The DAX top-30 index  looked set to open 0.3 percent lower on Thursday  according to premarket data from brokerage Lang & Schwarz at 0639 GMT.",
        "date": "06302016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "German stocks - Factors to watch on June 30 "
    },
    {
        "content": "* Monsanto and Nomad Bioscience announce collaboration on gene-editing research for next-generation agriculture solutions",
        "date": "06282016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto and Nomad Bioscience announce collaboration on gene-editing research "
    },
    {
        "content": "* Monsanto and targetgene announce agreement on gene-editing technology to advance global agriculture innovation",
        "date": "06282016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto and TargetGene announce agreement on Gene-Editing Technology "
    },
    {
        "content": "* Monsanto and Sumitomo Chemical enter new global crop protection collaboration for next generation PPO technologies",
        "date": "06272016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto and Sumitomo Chemical enter global crop protection collaboration for next generation PPO technologies "
    },
    {
        "content": "CHICAGO Monsanto Co is in talks with Bayer AG and other companies regarding \"alternative strategic options \" a month after it rejected the German company's $62-billion takeover offer  the U.S. seed producer said on Wednesday. | Video ",
        "date": "06292016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto in talks with Bayer  others about 'strategic options' "
    },
    {
        "content": "BRUSSELS  June 24 An impasse between EU nations on whether to allow Monsanto's Roundup and similar weed-killers to continue to be sold means that the European Commission  rather than national politicians  will decide the issue next week.",
        "date": "06242016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU officials to decide on Roundup herbicide after political impasse "
    },
    {
        "content": "* Monsanto & Bayer CEOs have met  but no progress made toward deal- CNBC  citing sources    (Bengaluru Newsroom)",
        "date": "06282016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto & Bayer CEOs have met  but no progress made toward deal - CNBC "
    },
    {
        "content": "* Dupont and Monsanto reach technology licensing agreement for Intacta RR2 Pro technology in Brazil",
        "date": "06272016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Dupont and Monsanto reach technology licensing agreement for Intacta RR2 Pro "
    },
    {
        "content": "June 29    ** The U.S. seed producer has demanded that Germany's Bayer increase its takeover offer by $10-15 per share  unnamed sources tell German business daily Handelsblatt.",
        "date": "06292016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto seeks up to $7 bln more from Bayer in takeover-Handelsblatt "
    },
    {
        "content": "CHICAGO  June 29 Monsanto Co is in talks with Bayer AG and other companies regarding \"alternative strategic options \" a month after it rejected the German company's $62-billion takeover offer  the U.S. seed producer said on Wednesday.",
        "date": "06292016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Monsanto in talks with Bayer  others about 'strategic options' "
    },
    {
        "content": "June 29 Seed company Monsanto Co  which rejected a $62 billion takeover offer from Germany's Bayer AG  last month  reported a 8.5 percent fall in quarterly sales as demand declined due to low commodity prices.",
        "date": "06292016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto's quarterly sales fall 8.5 pct "
    },
    {
        "content": "BUENOS AIRES  June 22 Argentina's Agriculture Ministry will announce on Thursday an agreement with seed company Monsanto Co over the inspection of shipments of genetically modified soybeans  a ministry spokeswoman said on Wednesday.",
        "date": "06222016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Argentina to announce deal with Monsanto on royalties inspections "
    },
    {
        "content": "BRUSSELS  June 20 France will vote on Friday against the continued use of weedkiller glyphosate  its environment minister said  adding to uncertainty over the future of widely-used products such as Monsanto's Roundup in the European Union.",
        "date": "06202016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "France to vote against continued EU use of weedkiller glyphosate "
    },
    {
        "content": "BUENOS AIRES  June 22 Argentina's Agriculture Ministry will announce on Thursday an agreement with seed company Monsanto Co over the inspection of shipments of genetically modified soybeans  a ministry spokeswoman said on Wednesday.",
        "date": "06222016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Argentina to announce deal with Monsanto on royalties inspections "
    },
    {
        "content": "U.S. seed and agrochemicals company Monsanto Co said on Thursday it is selling its U.S. sorghum production assets to Remington Holding Co LLC and will roll its sorghum breeding business into a joint venture with the privately held company  in transactions valued at about $169.5 million.",
        "date": "06162016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto to form sorghum joint venture with private company "
    },
    {
        "content": "NEW YORK/FRANKFURT Bayer AG   the German chemicals and healthcare company trying to acquire Monsanto Co   is exploring a sale of its radiology supplies unit that could be worth more than $3 billion  according to people familiar with the matter.",
        "date": "06172016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Exclusive: Bayer explores sale of radiology business - sources "
    },
    {
        "content": "June 16 U.S. seed and agrochemicals company Monsanto Co said on Thursday it is selling its U.S. sorghum production assets to Remington Holding Co LLC and will roll its sorghum breeding business into a joint venture with the privately held company  in transactions valued at about $169.5 million.",
        "date": "06162016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Monsanto to form sorghum joint venture with private company "
    },
    {
        "content": "June 16 Privately held Remington Holding Co LLC said a unit will buy seed company Monsanto Co's U.S. sorghum production assets  and the two companies will form a joint venture  in transactions valued at about $169.5 million.",
        "date": "06162016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto to form JV focused on sorghum with private company "
    },
    {
        "content": "* Joint venture partners have valued transactions at approximately $169.5 million with a total cash payment of $110.5 million by remington",
        "date": "06162016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto and Remington Holding Co form JV "
    },
    {
        "content": "BUENOS AIRES  June 13 Argentina's government is close to striking a deal with Monsanto Co over the inspection of shipments of genetically modified soybeans  an agriculture ministry official said on Monday.",
        "date": "06142016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Argentina says near deal with Monsanto on soy inspections "
    },
    {
        "content": "* Monsanto board approves dividend of 54 cents per share  Source text for Eikon:  Further company coverage:    )",
        "date": "06092016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto board approves dividend of 54 cents per share "
    },
    {
        "content": "Monsanto Co   the world's largest seed company  has still not opened its books more than two weeks after it rejected Bayer AG's  $62 billion acquisition offer but left the door open to a possible deal  according to people familiar with the matter.",
        "date": "06102016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer waiting for Monsanto to engage after spurned bid: sources "
    },
    {
        "content": "June 10 Monsanto Co  the world's largest seed company  has still not opened its books more than two weeks after it rejected Bayer AG's $62 billion acquisition offer but left the door open to a possible deal  according to people familiar with the matter.",
        "date": "06102016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer waiting for Monsanto to engage after spurned bid -sources "
    },
    {
        "content": "* Expects Monsanto to honour collaboration agreements   (Adds market data  BASF business model in agriculture)",
        "date": "06082016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 1-BASF says not backed into a corner by Bayer's Monsanto swoop "
    },
    {
        "content": "* Bayer makes new takeover approach to Monsanto at same price  Monsanto rebuffs new Bayer approach  seeking higher offer - CNBC  citing DJ  Further company coverage:    (Bengaluru Newsroom)",
        "date": "06102016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Bayer makes new takeover approach to Monsanto at same price Monsanto rebuffs new Bayer approach seeking higher offer-CNBC citing DJ "
    },
    {
        "content": "FRANKFURT  June 10 Bayer ex-chief executive Marijn Dekkers opposed the company's plans for a $62 billion takeover of U.S. seeds firm Monsanto  German magazine Der Spiegel reported.",
        "date": "06102016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer ex-CEO Dekkers opposed Monsanto deal -Spiegel "
    },
    {
        "content": "LUDWIGSHAFEN  Germany  June 8 BASF  which has so far stood on the sidelines of a consolidation wave among global seeds and pesticides groups  said its business model was not affected by rival Bayer's plans to buy Monsanto.",
        "date": "06082016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BASF says unfazed by Bayer's swoop on Monsanto "
    },
    {
        "content": "CHICAGO  June 7 Monsanto Co is developing plans to prevent a new variety of biotech U.S. soybeans from entering European markets where they are not approved  leaders of two agricultural trade groups said  in a sign of the growing impact of regulatory delays on the world's largest seed maker.",
        "date": "06082016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "RPT-Monsanto develops plan for GMO U.S. soy lacking EU import approval "
    },
    {
        "content": "CHICAGO  June 7 Monsanto Co is developing plans to prevent a new variety of biotech U.S. soybeans from entering European markets where they are not approved  leaders of two agricultural trade groups said  in a sign of the growing impact of regulatory delays on the world's largest seed maker.",
        "date": "06072016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto develops plan for GMO U.S. soy lacking EU import approval "
    },
    {
        "content": "BRUSSELS EU nations refused to back a limited extension of the herbicide glyphosate's use on Monday  threatening withdrawal of Monsanto's Roundup and other weed-killers from shelves if no decision is reached by the end of the month.",
        "date": "06062016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "EU countries refuse to back new license for glyphosate weed-killer "
    },
    {
        "content": "* EU executive may now appeal lack of decision   (Adds Monsanto comments and market impact from analyst)",
        "date": "06062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 4-EU countries refuse to back new licence for glyphosate weed-killer "
    },
    {
        "content": "German drugs and crop chemicals group Bayer AG   which has made a $62 billion bid for U.S. seeds company Monsanto Co   has added more banks to its acquisition financing package  according to a person familiar with the matter.",
        "date": "06022016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer expands financing group for Monsanto bid: source "
    },
    {
        "content": "BUENOS AIRES Monsanto Co  eager to get royalties from growers in Argentina on genetically modified soybeans  said on Wednesday it was still trying to resolve a dispute with the government over inspections  while an agricultural ministry source said a deal may be reached in the coming days.",
        "date": "06012016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Talks ongoing in Monsanto  Argentina government GMO soy dispute "
    },
    {
        "content": "June 2 German drugs and crop chemicals group Bayer AG  which has made a $62 billion bid for U.S. seeds company Monsanto Co  has added more banks to its acquisition financing package  according to a person familiar with the matter.",
        "date": "06022016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Bayer expands financing group for Monsanto bid-source "
    },
    {
        "content": "BUENOS AIRES  June 1 Monsanto Co  eager to get royalties from growers in Argentina on genetically modified soybeans  said on Wednesday it was still trying to resolve a dispute with the government over inspections  while an agricultural ministry source said a deal may be reached in the coming days.",
        "date": "06012016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Talks ongoing in Monsanto  Argentina gov't GMO soy dispute "
    },
    {
        "content": "BRUSSELS European Union states will meet next week in an effort to agree a far shorter license renewal for herbicide glyphosate before the current one expires  which would require the phasing out of products such as Monsanto's Roundup.",
        "date": "05302016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "EU to propose shorter glyphosate license renewal: sources "
    },
    {
        "content": "Monsanto Co President Brett Begemann uttered those words last week to a small group of investors and a Reuters reporter when asked how the world's largest seed company he helps lead might fit with German drugs and crop chemicals group Bayer AG.",
        "date": "05272016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "DEALTALK-How four words rewrote Bayer-Monsanto deal script "
    },
    {
        "content": "June 2 German drugs and crop chemicals group Bayer AG has secured a loan facility of 60 billion euros ($66.94 billion) to fund its $62 billion offer for U.S. seeds company Monsanto Co  Handelsblatt daily reported on Thursday.",
        "date": "06022016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer AG secures 60 bln euros loan facility to fund Monsanto offer - report "
    },
    {
        "content": "* Bayer  Monsanto have yet to engage in meaningful dialogue; Bayer meeting with investors in Boston & New York - CNBC citing sources     (Bengaluru Newsroom)",
        "date": "06012016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Bayer  Monsanto have yet to engage in meaningful dialogue - CNBC "
    },
    {
        "content": "* If no deal by June 30  product to be phased out   (Releads  adds more on decision process  Bayer bid)",
        "date": "05302016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-EU to propose shorter glyphosate licence renewal -sources "
    },
    {
        "content": "Monsanto Co President Brett Begemann uttered those words last week to a small group of investors and a Reuters reporter when asked how the world's largest seed company he helps lead might fit with German drugs and crop chemicals group Bayer AG.",
        "date": "05302016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "RPT-DEALTALK-How four words rewrote Bayer-Monsanto deal script "
    },
    {
        "content": "Monsanto Co President Brett Begemann uttered those words last week to a small group of investors and a Reuters reporter when asked how the world's largest seed company he helps lead might fit with German drugs and crop chemicals group Bayer AG.",
        "date": "05302016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "How four words rewrote Bayer-Monsanto deal script "
    },
    {
        "content": "* Germany-based life sciences group Bayer on Watch Negative following acquisition approach to Monsanto",
        "date": "05202016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-S&P places Bayer on Watch Negative after Monsanto acquisition approach "
    },
    {
        "content": "* Monsanto shares up after Bayer unveils bid   (Adds U.S. market closing levels)",
        "date": "05232016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "GLOBAL MARKETS-Stocks dip  yields inch up on Fed rate hike talk "
    },
    {
        "content": "NEW DELHI India has tightened rules for the sale of genetically-modified cotton seeds  a government order said  in a move that will cap royalties for any new variety that the market's sole supplier - U.S.-based Monsanto Co - decides to develop and sell.",
        "date": "05202016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "India tightens rules over sale of Monsanto's GM cotton seeds "
    },
    {
        "content": "LONDON  May 20 A top investor in German chemicals company Bayer has said on Friday he was \"furious\" at the company's refusal to engage with him over its recent bid for U.S. rival Monsanto.",
        "date": "05202016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Top Bayer investor says 'furious' at company over Monsanto bid "
    },
    {
        "content": "* Monsanto shares up after Bayer unveils bid   (Updates prices  adds European shares' close )",
        "date": "05232016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "GLOBAL MARKETS-Yields inch up on Fed rate hike talk; stocks flat "
    },
    {
        "content": "* Indexes: Dow up 0.07 pct  S&P down 0.05 pct  Nasdaq up 0.15 pct   (Updates to early afternoon)",
        "date": "05232016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "US STOCKS-S&P  Dow little changed  Apple props up Nasdaq "
    },
    {
        "content": "FRANKFURT  May 25 Bayer could receive financing from the European Central Bank that would help to fund a takeover of Monsanto  according to the terms of the ECB's bond-buying programme.",
        "date": "05252016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer could get ECB financing for Monsanto bid  rules show "
    },
    {
        "content": "Monsanto Co  the world's largest seed company  turned down Bayer AG's $62 billion acquisition bid as \"incomplete and financially inadequate\" on Tuesday  but said it was open to engage further in negotiations.",
        "date": "05242016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto rejects Bayer bid  but open to more talks "
    },
    {
        "content": "* Government to seek feedback over next 90 days before decision",
        "date": "05232016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "India puts off GM cotton seed order  easing pressure on Monsanto "
    },
    {
        "content": "LONDON Bayer  shareholder Royal London Asset Management said on Wednesday that the German company's bid for U.S. rival Monsanto  made sense strategically and that it would support a deal if it was priced at around $130-$135 a share.",
        "date": "05252016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Royal London says backs Bayer-Monsanto deal if priced at $130-$135 per share "
    },
    {
        "content": "May 24 Monsanto Co  the world's largest seed company  turned down Bayer AG's $62 billion acquisition bid as \"incomplete and financially inadequate\" on Tuesday  but said it was open to engage further in negotiations.",
        "date": "05242016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Monsanto rejects Bayer bid  but open to more talks "
    },
    {
        "content": "* Monsanto views Bayer's current proposal as incomplete and financially inadequate; company open to discussing potential path forward that would create appropriate value for Monsanto shareowners",
        "date": "05242016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto views Bayer's current proposal financially inadequate; says open to discussions "
    },
    {
        "content": "* Indexes up: Dow 0.16 pct  S&P 0.04 pct  Nasdaq 0.36 pct   (Adds details  changes comment  updates prices)",
        "date": "05232016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "US STOCKS-Apple boosts Nasdaq and Dow  S&P little changed "
    },
    {
        "content": "* Monsanto shares up after Bayer unveils bid   (Updates to U.S. markets openings; changes dateline  previous LONDON)",
        "date": "05232016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "GLOBAL MARKETS-Dollar up on rate hike talk; stocks flat "
    },
    {
        "content": "BUENOS AIRES  May 18 Argentine soy growers urged the country's government on Wednesday to strike a deal with Monsanto Co  a day after the U.S. seed company suspended the launch of a new variety of soybean seed that would help ensure the country's international competitiveness.",
        "date": "05182016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Argentine farmers urge gov't to clinch GMO deal with Monsanto "
    },
    {
        "content": "* Moody's: Bayer's bid is a credit negative for Monsanto's Bondholders",
        "date": "05192016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Moody's: Bayer's bid is a credit negative for Monsanto's Bondholders "
    },
    {
        "content": "LONDON  May 25 Bayer shareholder Royal London Asset Management said on Wednesday that the German company's bid for U.S. rival Monsanto made sense strategically and that it would support a deal if it was priced at around $130-$135 a share.",
        "date": "05252016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Royal London says backs Bayer-Monsanto deal if priced at $130-$135/share "
    },
    {
        "content": "BUENOS AIRES  May 17 Monsanto Co said on Tuesday it would suspend future soybean technologies in Argentina  a move that could limit output of the country's main cash crop  after a disagreement with the government over inspections of genetically modified soybeans.",
        "date": "05172016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 1-Monsanto suspends new soybean technologies in Argentina "
    },
    {
        "content": "* Moody's reviews Bayer's ratings for downgrade on Monsanto acquisition announcement",
        "date": "05242016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Moody's reviews Bayer's ratings for downgrade on Monsanto acquisition announcement "
    },
    {
        "content": "FRANKFURT  May 23 Bayer's chief executive on Monday said the German drugmaker' s proposed bid for U.S. seeds maker Monsanto reflected Monsanto's full value  when asked whether a sweetened bid could be on the cards.",
        "date": "05232016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer CEO seeks to quell expectations of higher Monsanto offer "
    },
    {
        "content": "NEW YORK Talk of a takeover of Monsanto Co  by rivals Bayer AG  or BASF SE  is \"wild speculation \" and Monsanto is staying focused on its own strategy  president and chief operating officer Brett Begemann said on Wednesday.",
        "date": "05182016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Takeover talk by rival 'wild speculation': Monsanto executive "
    },
    {
        "content": "* Tie-up could raise U.S. antitrust concerns   (Adds details on Bayer's offer  updates shares)",
        "date": "05192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 5-Bayer offers to buy Monsanto in global agrochemicals shakeout "
    },
    {
        "content": "* A potential combination of bayer ag and monsanto makes strategic sense given their complementary strengths",
        "date": "05192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Fitch: Bayer-Monsanto combination challenged "
    },
    {
        "content": "Monsanto Co  the world's largest seed company  turned down Bayer AG's $62 billion acquisition bid as \"incomplete and financially inadequate\" on Tuesday  but said it was open to engage further in negotiations. | Video ",
        "date": "05252016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto rejects Bayer bid  but open to more talks "
    },
    {
        "content": "* To engage soon in negotiations to determine if they can reach a deal- CNBC  citing sources  Source text for Eikon:  Further company coverage:",
        "date": "05252016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Bayer & Monsanto to engage soon in negotiations to see if they can reach a deal - CNBC  citing sources "
    },
    {
        "content": "* Forage Genetics International (FGI) and Monsanto announce alfalfa commercial and research agreements to support innovation for alfalfa growers",
        "date": "05172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Forage Genetics says licensed intellectual property for alfalfa traits and technology from Monsanto "
    },
    {
        "content": "BUENOS AIRES  May 17 Monsanto Co said on Tuesday it would suspend future soybean technologies in Argentina  a move that could limit output of the country's main cash crop  after a disagreement with the government over inspections of genetically modified soybeans.",
        "date": "05172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto suspends new soybean technologies in Argentina "
    },
    {
        "content": "FRANKFURT German drugs and pesticides group Bayer said it was confident that Monsanto would take a positive view of its $62 billion takeover proposal.",
        "date": "05232016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer CEO expects Monsanto to respond positively to deal proposal "
    },
    {
        "content": "* Temasek Holdings cuts share stake in Monsanto Co by 28.5 percent to 360 400 shares - SEC filing",
        "date": "05162016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Temasek Holdings cuts share stake in Monsanto by 28.5 pct "
    },
    {
        "content": "NEW YORK  May 18 Talk of a takeover of Monsanto Co by rivals Bayer AG or BASF SE  is \"wild speculation \" and Monsanto is staying focused on its own strategy  president and chief operating officer Brett Begemann said on Wednesday.",
        "date": "05182016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Takeover talk by rival 'wild speculation' -Monsanto executive "
    },
    {
        "content": "May 12 A year after Monsanto Co sparked a massive consolidation race in the agrochemical industry by bidding for a rival  the world's largest seed company now finds itself in the uncomfortable role of takeover target.",
        "date": "05122016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 4-Monsanto  once M&A instigator  now in awkward role as possible target "
    },
    {
        "content": "* Debate focuses on scientific evidence over health risks   (Adds reactions from industry  green groups)",
        "date": "05192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-EU delays vote on weed-killer glyphosate licence amid cancer row "
    },
    {
        "content": "BERLIN/BRUSSELS  May 19 The European Union on Thursday delayed a vote on renewing sales approval for the pesticide glyphosate  used in Monsanto's weed-killer Roundup  amid a transatlantic row over whether it may cause cancer.",
        "date": "05192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU delays vote on weed-killer glyphosate licence amid cancer row "
    },
    {
        "content": "* Monsanto Co - Disappointed that talks with Argentine agriculture ministry have yet to result in mutually agreeable solution for soybean growers  industry and government",
        "date": "05172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto Co - Disappointed in talks with Argentine agriculture ministry "
    },
    {
        "content": "FRANKFURT Bayer shareholder Union Investment  a German mutual fund company  said it was bracing for Bayer paying more for Monsanto than what the German drugmaker is currently proposing  stretching the limits of what is acceptable.",
        "date": "05232016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer shareholder warns against overpaying for Monsanto "
    },
    {
        "content": "CHICAGO  May 18 Monsanto Co expects farmers to plant its Xtend soybeans on more than 15 million acres in North America next year  the chief commercial officer said on Wednesday  as the seed maker waits for Europe to clear imports of the crop.",
        "date": "05182016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto sees Xtend soy on 15 mln acres in North America in 2017 "
    },
    {
        "content": "May 12 Germany's Bayer AG is exploring a bid for seed company Monsanto Co  Bloomberg reported.",
        "date": "05122016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Germany's Bayer mulling bid for Monsanto - Bloomberg "
    },
    {
        "content": "* Bayer said to explore bid for $40 billion seed company Monsanto - Bloomberg   Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05122016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Bayer said to explore bid for seed company Monsanto - Bloomberg "
    },
    {
        "content": "BERLIN/BRUSSELS  May 19 The European Union on Thursday delayed a vote on renewing sales approval for the pesticide glyphosate  used in Monsanto's weed-killer Roundup  amid a transatlantic row over whether it may cause cancer.",
        "date": "05192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "CORRECTED-EU delays vote on weed-killer glyphosate licence amid cancer row "
    },
    {
        "content": "CHICAGO  May 18 A day after Monsanto Co  said it would stop the launch of its latest soybean trait in Argentina due to concerns over royalty payments  company executives downplayed the impact and sought to turn the focus to business prospects in neighboring Brazil instead.",
        "date": "05192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "RPT-UPDATE 1-As Monsanto fights Argentina over soy  company eyes Brazil "
    },
    {
        "content": "A year after Monsanto Co sparked a massive consolidation race in the agrochemical industry by bidding for a rival  the world's largest seed company now finds itself in the uncomfortable role of takeover target.",
        "date": "05132016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto  once M&A instigator  now in awkward role as possible target "
    },
    {
        "content": "CHICAGO  May 10 U.S. seeds and agrochemicals company Monsanto Co on Tuesday cut its forecast for 2016 U.S. plantings of its newly launched Roundup Ready 2 Xtend soybeans as the European Union has not yet approved the genetically modified variety.",
        "date": "05102016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto cuts forecast for Roundup Ready 2 Xtend soy acres in US "
    },
    {
        "content": "LONDON  May 19 A top investor in German chemicals company Bayer said he was \"deeply concerned\" about a potential acquisition of U.S. rival Monsanto   and would prefer the firms to agree a joint venture or a nil-premium merger.",
        "date": "05192016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Major Bayer investor 'deeply concerned' about move for Monsanto "
    },
    {
        "content": "* Across Europe and South Africa  company also continues to expect to hold or grow share in a region of declining corn acres",
        "date": "05102016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Monsanto continues to expect to hold or grow corn share in U.S. in 2016 "
    },
    {
        "content": "A man suing Monsanto claiming that the company's blockbuster herbicide gave him cancer can proceed with a claim that the agrochemical giant failed to warn the public about Roundup's risks  but allegations about the sufficiency of its warnings to U.S. regulators are preempted  a federal judge in California has ruled.",
        "date": "05032016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto trims some claims but fails to toss Roundup cancer suit "
    },
    {
        "content": "CHICAGO The U.S. Environmental Protection Agency on Monday pulled a report offline that concluded glyphosate is not likely to be carcinogenic to humans  saying the document was inadvertently published and the agency had not finished its review of the chemical  which is the key ingredient in Monsanto's herbicides.",
        "date": "05032016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EPA takes offline report that says glyphosate not likely carcinogenic "
    },
    {
        "content": "* Files for mixed shelf offering of up to $6 billion - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04132016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "BRIEF-Monsanto files for mixed shelf offering of up to $6 bln "
    },
    {
        "content": "* Monsanto sees limited impact from French ban   (Adds analyst comment)",
        "date": "04082016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 2-France to ban some glyphosate weedkillers amid health concerns "
    },
    {
        "content": "CHICAGO Monsanto Co  on Wednesday effectively pulled itself out of the mergers-and-acquisitions flurry in the seeds and agrochemicals industry  nearly a year after making a bid for rival Syngenta AG .",
        "date": "04062016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto cools on large-scale M&A outlook  profit falls "
    },
    {
        "content": "* Reiterates 2016 ongoing shr guidance of $4.40-$5.10   (New throughout  adds comment from analyst  updates share price  adds byline)",
        "date": "04062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Monsanto cools on large-scale M&A outlook  profit falls "
    },
    {
        "content": "April 6 Monsanto Co  the world's largest seed company  reported a 12.8 percent fall in quarterly sales  hurt by steep discounting on its seeds and a stronger dollar.",
        "date": "04062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto sales fall on lower seed prices  strong dollar "
    },
    {
        "content": "OUAGADOUGOU Burkina Faso's cotton association is seeking 48.3 billion CFA francs ($83.91 million) in compensation from U.S. seed company Monsanto after it said genetically modified cotton led to a drop in quality  association members said on Monday.",
        "date": "04042016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Burkina Faso seeks $84 million from Monsanto over GM cotton strain "
    },
    {
        "content": "OUAGADOUGOU  April 4 Burkina Faso's cotton association is seeking 48.3 billion CFA francs ($83.91 million) in compensation from U.S. seed company Monsanto after it said genetically modified cotton led to a drop in quality  association members said on Monday.",
        "date": "04042016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Burkina Faso seeks $84 mln from Monsanto over GM cotton strain "
    },
    {
        "content": "FRANKFURT  March 21 Shares in German drugs and pesticides maker Bayer rose more than 5 percent on Monday after sources close to the matter told Reuters that Monsanto was interested in a deal with its crop science business.",
        "date": "03212016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer shares jump on Monsanto crop science interest "
    },
    {
        "content": "Monsanto Co   the world's largest seed producer  has approached Bayer AG  to express interest in its crop science unit  including a potential acquisition worth more than $30 billion  according to people familiar with the matter.",
        "date": "03192016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Exclusive: Monsanto shows interest in Bayer's crop science unit - sources "
    },
    {
        "content": "BRUSSELS The European Union will defer a decision on whether to extend approval for weed-killer ingredient glyphosate  used in herbicides including Monsanto's Roundup  following a dispute between EU and U.N. agencies over whether it causes cancer  EU sources said on Monday.",
        "date": "03072016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "EU to defer decision on safety of weed-killer ingredient: sources "
    },
    {
        "content": "BRUSSELS  March 7 The European Union will defer a decision on whether to extend approval for weed-killer ingredient glyphosate  used in herbicides including Monsanto's Roundup  following a dispute between EU and U.N. agencies over whether it causes cancer  EU sources said on Monday.",
        "date": "03072016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU to defer decision on safety of weed-killer ingredient - sources "
    },
    {
        "content": "BRUSSELS  March 8 The European Union on Tuesday put off a decision on whether to extend approval for weedkiller ingredient glyphosate  used in herbicides including Monsanto's Roundup  after a dispute between EU and U.N. agencies over whether it causes cancer.",
        "date": "03082016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "RPT-UPDATE 1-EU defers decision on safety of weedkiller ingredient "
    },
    {
        "content": "* Monsanto rejects U.N. body's finding on cancer risk   (Updates with confirmation  comment)",
        "date": "03082016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-EU defers decision on safety of weedkiller ingredient "
    },
    {
        "content": "BUENOS AIRES  March 4 About 100 sign-waving Argentine farmers protested in front the country's CNDC competitiveness authority on Friday  urging the government to back them in their fight with Monsanto Co over rights pertaining the company's Intacta soybeans.",
        "date": "03042016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Argentina farmers ask state to intervene in Monsanto soy fight "
    },
    {
        "content": "BRUSSELS  March 3 The European Union is expected to extend approval next week for weed-killer ingredient glyphosate  used in many herbicides including Monsanto's Roundup  despite a dispute between EU and U.N. agencies over whether it causes cancer.",
        "date": "03032016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "EU seen approving weed-killer ingredient glyphosate amid cancer row "
    },
    {
        "content": "NEW DELHI Monsanto Co  the world's biggest seed company  threatened to pull out of India on Friday if the government imposed a big cut in royalties that local firms pay for its genetically modified cotton seeds.",
        "date": "03042016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto threatens to exit India over GM royalty row "
    },
    {
        "content": "* Indexes up: Dow 0.05 pct  S&P 0.2 pct  Nasdaq 0.05 pct   (Updates to afternoon)",
        "date": "03022016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "US STOCKS-Wall St edges higher as energy and bank shares gain "
    },
    {
        "content": "CHICAGO Monsanto Co expects to face headwinds from weak commodity prices and currency fluctuations through 2016  its executives said on Wednesday  as the seed and agrochemical company slashed earnings guidance amid a slumping farm economy.",
        "date": "03022016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto sees currency  grain price headwinds through 2016 "
    },
    {
        "content": "CHICAGO  March 2 Monsanto Co expects to face headwinds from weak commodity prices and currency fluctuations through 2016  its executives said on Wednesday  as the seed and agrochemical company slashed earnings guidance amid a slumping farm economy.",
        "date": "03022016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Monsanto sees currency  grain price headwinds through 2016 "
    },
    {
        "content": "CHICAGO  March 2 Seeds and agrochemicals company Monsanto Co will face headwinds from weak commodities prices and currency fluctuations through 2016 before a \"bounce back\" in growth next year  company executives said on Wednesday.",
        "date": "03022016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto sees currency  commodity price headwinds through 2016 "
    },
    {
        "content": "Monsanto Co   the world's largest seed company  slashed its earnings forecast for the year  hurt by a strong dollar and low prices for its seeds as farmers curb spending.",
        "date": "03022016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto slashes forecast on strong dollar  pricing pressure "
    },
    {
        "content": "March 2 Monsanto Co  the world's largest seed company  slashed its earnings forecast for the year  hurt by a strong dollar and low prices for its seeds as farmers curb spending.",
        "date": "03022016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Monsanto slashes forecast on strong dollar  pricing pressure "
    },
    {
        "content": "March 2 Monsanto Co  the world's largest seed company  slashed its 2016 earnings forecast  citing a strong dollar and pricing pressure.",
        "date": "03022016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto slashes 2016 earnings forecast "
    },
    {
        "content": "NEW DELHI Competition Commission of India (CCI) has ordered an investigation into a Monsanto joint venture  saying it suspected the company had abused its dominant position as a supplier of genetically modified (GM) cotton seeds.",
        "date": "02172016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "CCI suspects Monsanto JV abused dominant position "
    },
    {
        "content": "NEW DELHI  Feb 17 India's antitrust regulator has ordered an investigation into a Monsanto joint venture  saying it suspected the company had abused its dominant position as a supplier of genetically modified (GM) cotton seeds.",
        "date": "02172016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-India antitrust body suspects Monsanto JV abused dominant position "
    },
    {
        "content": "BUENOS AIRES  Feb 12 Argentina's main farm group on Friday took complaints against Monsanto Co to local regulators  accusing the company of abusing its dominant position in the market by ordering exporters to inspect soy cargos for second-generation genetically modified seeds.",
        "date": "02122016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Argentine farmers take Monsanto seed complaint to regulators "
    },
    {
        "content": "BUENOS AIRES  Feb 12 Argentina's main farm group on Friday took complaints against Monsanto Co to local regulators  accusing the company of abusing its dominant position in the market by ordering exporters to inspect soy cargos for second-generation genetically modified seeds.",
        "date": "02122016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Argentine farmers take Monsanto seed complaint to regulators "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 09 (Fitch) Fitch Ratings has affirmed the Long-term Issuer  Default Rating (IDR)  revolving credit facility (RCF) rating  and senior  unsecured note ratings of Monsanto Company (Monsanto) at 'A-'. Fitch has also  affirmed Monsanto's Short-term IDR and commercial paper rating at 'F2'. Roughly  $11.6 billion of obligations  including the $3 billion RCF  are affected by  these actions. A complete list of rating actions fo",
        "date": "02092016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Fitch Affirms Monsanto's IDRs at 'A-'/'F2'; Outlook Stable "
    },
    {
        "content": "WASHINGTON  Feb 9 Monsanto Co will pay $80 million to settle civil accounting violations after it allegedly misstated its earnings in connection with its top-selling Roundup product  U.S. securities regulators said on Tuesday.",
        "date": "02092016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto to pay $80 mln in U.S. SEC settlement over Roundup earnings "
    },
    {
        "content": "WASHINGTON Monsanto Co  will pay $80 million to settle civil accounting violations after it allegedly misstated its earnings in connection with its top-selling Roundup product  U.S. securities regulators said on Tuesday.",
        "date": "02092016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto to pay $80 million in SEC settlement over Roundup earnings "
    },
    {
        "content": "WASHINGTON  Feb 9 Monsanto Co will pay $80 million to settle civil accounting violations after it allegedly misstated its earnings in connection with its top-selling Roundup product  U.S. securities regulators said on Tuesday.",
        "date": "02092016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Monsanto to pay $80 mln in U.S. SEC settlement over Roundup earnings "
    },
    {
        "content": "CHICAGO Monsanto Co said on Wednesday it received import approval from China for its new genetically modified Roundup Ready 2 Xtend soybeans and that it will begin selling the seeds in the United States and Canada.",
        "date": "02032016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "China approves Monsanto GMO soybean variety for import "
    },
    {
        "content": "CHICAGO  Feb 3 Monsanto Co said on Wednesday it received import approval from China for its new genetically modified Roundup Ready 2 Xtend soybeans and that it will begin selling the seeds in the United States and Canada.",
        "date": "02032016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-China approves Monsanto GMO soybean variety for import "
    },
    {
        "content": "CHICAGO  Feb 3 U.S. seed and agrochemicals company Monsanto Co said Wednesday that it has received import approval for its Roundup Ready 2 Xtend soybeans from China  the world's top soybean buyer.",
        "date": "02032016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto wins Chinese import approval for GMO soybeans "
    },
    {
        "content": "CHICAGO  Jan 21 Monsanto Co said it filed a lawsuit on Thursday seeking to prevent glyphosate  the main ingredient in its weed killer Roundup  from being added to California's list of known carcinogens  stepping up its defense of the widely used herbicide.",
        "date": "01212016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto sues to keep herbicide off California list of carcinogens "
    },
    {
        "content": "CHICAGO  Jan 21 Monsanto Co stepped up its defense of a widely used weed killer on Thursday by filing a lawsuit in California seeking to prevent glyphosate  the main ingredient in its Roundup herbicide  from being added to the state's list of known carcinogens.",
        "date": "01212016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Monsanto sues to keep herbicide off California list of carcinogens "
    },
    {
        "content": "CHICAGO With agricultural lenders fearing a tidal wave of farm bankruptcies as soon as this spring  lawyers in the Midwest say they want U.S. Senator Chuck Grassley of Iowa to raise the debt limit for so-called \"family farmer\" bankruptcies.",
        "date": "01162016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Fearing wave of bankruptcies  U.S. corn belt wants new debt cap "
    },
    {
        "content": "* Chairman says becoming Chinese company one of several options",
        "date": "01132016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 1-Agrichemicals group Syngenta looking at different tie-ups -chairman "
    },
    {
        "content": "Monsanto Co said a souring farm economy and currency woes will push its 2016 earnings to the lower end of expectations  while a cost-cutting drive will lead the world's largest seed company to slash more jobs.",
        "date": "01062016",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto increases job cuts as corn  chemical sales slump "
    },
    {
        "content": "Monsanto Co plans to slash another 1 000 jobs worldwide  bringing total planned cuts to 3 600  or about 16 percent of its global workforce  according to a filing Wednesday with the U.S. Securities and Exchange Commission.",
        "date": "01062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto to slash 1 000 more jobs  total planned cuts at 3 600 "
    },
    {
        "content": "Jan 6 Monsanto Co said a souring farm economy and currency woes will push its 2016 earnings to the lower end of expectations  while a cost-cutting drive will lead the world's largest seed company to slash more jobs.",
        "date": "01062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Monsanto increases job cuts as corn  chemical sales slump "
    },
    {
        "content": "Jan 6 Monsanto Co plans to slash another 1 000 jobs worldwide  bringing total planned cuts to 3 600  or about 16 percent of its global workforce  according to a filing Wednesday with the U.S. Securities and Exchange Commission.",
        "date": "01062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Monsanto to slash 1 000 more jobs  total planned cuts at 3 600 "
    },
    {
        "content": "* Says researchers from Monsanto and Novozymes see progress in U.S. field tests  plan to launch corn inoculant in 2017",
        "date": "01062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "BRIEF-Novozymes  Monsanto to launch corn inoculant in 2017 "
    },
    {
        "content": "CHICAGO  Jan 6 Monsanto Co plans to cut an additional 1 000 employees worldwide  bringing its total planned job cuts to 3 600 or about 16 percent of the company's global workforce  according to a filing Wednesday with the federal Securities and Exchange Commission.",
        "date": "01062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto to cut additional 1 000 jobs  bringing total planned job cuts to 3 600 "
    },
    {
        "content": "Jan 6 Monsanto Co  the world's largest seed company  reported a quarterly loss  compared with a profit a year earlier  hurt by lower corn prices and a strong dollar.",
        "date": "01062016",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto's profit falls on lower seed prices  strong dollar "
    },
    {
        "content": "NEW YORK  Dec 20 Monsanto Co shares  which are trading at a relatively low premium  are poised to rise 20 percent over the next year  according to an article in the latest edition of Barron's.",
        "date": "12212015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto shares set to rise 20 pct in next year - Barron's "
    },
    {
        "content": "ZURICH  Dec 22 Swiss agrichemicals group Syngenta is in talks with Monsanto  ChemChina  and others but has not received a concrete takeover offer and is keeping all options open  Chairman Michel Demare told a Swiss newspaper.",
        "date": "12222015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Syngenta in talks with Monsanto  ChemChina  others - chairman in FuW "
    },
    {
        "content": "* Beijing's reticence over GMO food keeps its market off limits",
        "date": "12062015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "With China's GMO sector in limbo  local seed firm targets U.S. "
    },
    {
        "content": "* Chairman says \"leave no stone unturned\"   (Adds CEO comment on Dupont  more chairman remarks on deals)",
        "date": "11252015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 1-Syngenta looking at takeovers  JVs  asset sales "
    },
    {
        "content": "ST. LOUIS Monsanto Co's  long-term growth plans  which include new crop-boosting technologies and expansion into new markets  relies heavily on data science  the \"glue that holds the pieces together \" Chief Executive Hugh Grant said on Wednesday.",
        "date": "11192015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto CEO: data science key part of long-term growth "
    },
    {
        "content": "ST. LOUIS Monsanto Co's  long-term growth plans  which include new crop-boosting technologies and expansion into new markets  relies heavily on data science  the \"glue that holds the pieces together \" Chief Executive Hugh Grant said on Wednesday.",
        "date": "11182015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto CEO: data science key part of long-term growth "
    },
    {
        "content": "ST. LOUIS Monsanto Co  expects corn prices to rise next year  which will help the seeds and agrochemical company reach its earnings forecast  executives said on Wednesday.",
        "date": "11192015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto sees higher corn prices as boost to business "
    },
    {
        "content": "ST. LOUIS  Nov 18 Monsanto Co executives said Wednesday that they expect corn prices to rise in the year ahead  which will help the company reach its earnings forecast  but the majority of its growth will come from new products and expanding its reach in new markets.",
        "date": "11182015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto sees higher corn in coming year as boost to business "
    },
    {
        "content": "ST. LOUIS  Nov 18 Monsanto Co expects corn prices to rise in the year ahead  which will help the seeds and agrochemical company reach its earnings forecast  executives said on Wednesday.",
        "date": "11182015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Monsanto sees higher corn in coming year as boost to business "
    },
    {
        "content": "ST. LOUIS Monsanto Co.  executives are discussing whether the world's largest seed company should acquire agrochemical rivals  including top pesticide maker Syngenta AG   Monsanto President Brett Begemann said on Tuesday.",
        "date": "11172015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Syngenta among options for Monsanto takeover bids: executives "
    },
    {
        "content": "ST. LOUIS  Nov 18 Monsanto Co expects corn prices to rise next year  which will help the seeds and agrochemical company reach its earnings forecast  executives said on Wednesday.",
        "date": "11192015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "CORRECTED-UPDATE 2-Monsanto sees higher corn prices as boost to business "
    },
    {
        "content": "ST. LOUIS  Nov 18 Monsanto Co's  long-term growth plans  which include new crop-boosting technologies and expansion into new markets  relies heavily on data science  the \"glue that holds the pieces together \" Chief Executive Hugh Grant said on Wednesday.",
        "date": "11182015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Monsanto CEO: data science key part of long-term growth "
    },
    {
        "content": "ST. LOUIS  Nov 17 Monsanto Co.  executives are discussing whether the world's largest seed company should acquire agrochemical rivals  including top pesticide maker Syngenta AG  Monsanto President Brett Begemann said on Tuesday.",
        "date": "11172015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Syngenta among options for Monsanto takeover bids -executives "
    },
    {
        "content": "ST. LOUIS Monsanto Co. executives are discussing whether the world's largest seed company should acquire agrochemical rivals  including top pesticide maker Syngenta AG  Monsanto President Brett Begemann said on Tuesday.",
        "date": "11172015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta among options for Monsanto takeover bids -executives "
    },
    {
        "content": "ST. LOUIS  Nov 18 Monsanto Co's  long-term growth plans  which include new crop-boosting technologies and expansion into new markets  relies heavily on data science  the \"glue that holds the pieces together \" Chief Executive Hugh Grant said on Wednesday.",
        "date": "11182015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Data science is key piece in Monsanto long-term growth plan -CEO "
    },
    {
        "content": "Nov 17 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "11172015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "CHICAGO Monsanto Co  expects to lose 23 to 33 cents a share in its fiscal first quarter of 2016  dragged by restructuring costs  pricing pressures on its herbicide glyphosate  slower-than-expected U.S. corn seed sales and a weak currency in Brazil  a top executive said on Tuesday.",
        "date": "11102015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto cuts quarterly earnings guidance  shares drop "
    },
    {
        "content": "ST. LOUIS Monsanto Co expects prices of glyphosate herbicide to rebound  but the world's largest seed company is not relying on increased prices to meet its forecasted long-term financial goals  Chief Financial Officer Pierre Courduroux said on Wednesday.",
        "date": "11182015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto not relying on glyphosate price rise to meet goals: CFO "
    },
    {
        "content": "ST. LOUIS  Nov 18 Monsanto Co expects prices of glyphosate herbicide to rebound  but the world's largest seed company is not relying on increased prices to meet its forecasted long-term financial goals  Chief Financial Officer Pierre Courduroux said on Wednesday.",
        "date": "11182015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto not relying on glyphosate price rise to meet goals -CFO "
    },
    {
        "content": "ST. LOUIS  Nov 17 Monsanto Co.  executives are discussing whether the world's largest seed company should try to acquire agrochemical rivals  including top pesticide maker Syngenta AG  Monsanto President Brett Begemann said on Tuesday.",
        "date": "11172015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta among possible targets as Monsanto mulls takeover push "
    },
    {
        "content": "CHICAGO  Nov 10 Monsanto Co expects to lose 23 to 33 cents a share in its fiscal first quarter of 2016  dragged by restructuring costs  pricing pressures on its herbicide glyphosate  slower-than-expected U.S. corn seed sales and a weak currency in Brazil  a top executive said on Tuesday.",
        "date": "11102015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Monsanto cuts quarterly earnings guidance  shares drop "
    },
    {
        "content": "FRANKFURT Syngenta  and other major seeds and crop chemicals companies are intensively discussing tie-ups  the Financial Times quoted the Swiss firm's chairman as saying on Wednesday  adding to a chorus of voices predicting a sector shake-up.",
        "date": "11182015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta ready to play role in sector shake-up "
    },
    {
        "content": "FRANKFURT Syngenta and other major players in the seeds and crop chemicals industry are in intense discussions about potential tie-ups  the Financial Times cited the Swiss company's Chairman as saying on Wednesday.",
        "date": "11182015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta ready to play role in sector shakeup: Chairman in FT "
    },
    {
        "content": "CHICAGO  Nov 17 Monsanto expects to see corn seed prices increase by low single digits in local currencies for its corn seeds sold for the 2016 planting season  company president Brett Begemman said Tuesday.",
        "date": "11172015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto expects to see low single-digit corn seed price increase in 2016 "
    },
    {
        "content": "CHICAGO/MEXICO CITY Monsanto Co on Friday denied that plantings of its genetically modified soybeans have impacted bees  led to deforestation or caused damage to the honey production industry in two Mexican states.",
        "date": "11092015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto to Mexico honey farmers: Our soya seeds not to blame for woes "
    },
    {
        "content": "CHICAGO/MEXICO CITY Monsanto Co on Friday denied that plantings of its genetically modified soybeans have impacted bees  led to deforestation or caused damage to the honey production industry in two Mexican states.",
        "date": "11072015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto to Mexico honey farmers: Our soya seeds not to blame for woes "
    },
    {
        "content": "CHICAGO/MEXICO CITY  Nov 6 Monsanto Co  on Friday denied that plantings of its genetically modified soybeans have impacted bees  led to deforestation or caused damage to the honey production industry in two Mexican states.",
        "date": "11062015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto to Mexico honey farmers: Our soya seeds not to blame for woes "
    },
    {
        "content": "CHICAGO Monsanto Co's  Climate Corp subsidiary on Tuesday announced a definitive agreement to sell its Precision Planting farm equipment business to Deere & Co  for an undisclosed sum.",
        "date": "11032015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Deere to buy Monsanto's Precision Planting equipment maker "
    },
    {
        "content": "CHICAGO  Nov 3 The Climate Corporation  a subsidiary of Monsanto Co.  said Tuesday that it has signed definitive agreements to allow leading farm equipment maker Deere & Co. to acquire Climate's planting equipment business for an undisclosed sum.",
        "date": "11032015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto and Deere strike deal over Climate Corp planting equipment unit "
    },
    {
        "content": "MEXICO CITY  Oct 27 Agricultural giant Monsanto hopes to double its sales in Mexico over the next five years  depending in part on whether permits for the cultivation of commercial-scale genetically modified corn are approved in the country  a company official said on Tuesday.",
        "date": "10282015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto seeks higher sales in Mexico  pending GMO corn decision "
    },
    {
        "content": "CHICAGO Agrichemical company Monsanto Co  plans to shutter three research and development centers in 2016 with a loss of about 90 jobs  it said on Monday  as it restructures operations to cut costs in a slumping agricultural commodity market.",
        "date": "10262015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto to shutter three R&D centers in 2016  cut 90 jobs "
    },
    {
        "content": "CHICAGO  Oct 26 Agrichemical company Monsanto Co  plans to shutter three research and development centers in 2016 with a loss of about 90 jobs  it said on Monday  as it restructures operations to cut costs in a slumping agricultural commodity market.",
        "date": "10262015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "CORRECTED-Monsanto to shutter three R&D centers in 2016  cut 90 jobs "
    },
    {
        "content": "ZURICH  Oct 26 Syngenta has responded to a series of complaints from a group of shareholders who have been pushing for change at the Swiss agricultural chemicals company.",
        "date": "10262015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta gives response to disgruntled shareholder group "
    },
    {
        "content": "CHICAGO The U.S. Department of Agriculture on Friday signed off on a new genetically modified type of corn developed by Monsanto Co after a review concluded it posed no significant threat to agricultural crops  other plants or the environment.",
        "date": "10232015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto clears USDA regulatory hurdle for new GMO corn "
    },
    {
        "content": "CHICAGO  Oct 23 The U.S. Department of Agriculture on Friday signed off on a new genetically modified type of corn developed by Monsanto Co after a review concluded it posed no significant threat to agricultural crops  other plants or the environment.",
        "date": "10232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "CORRECTED-Monsanto clears USDA regulatory hurdle for new GMO corn "
    },
    {
        "content": "ZURICH Syngenta  Chief Executive Mike Mack is stepping down as head of the Swiss agrochemicals group just two months after the company spurned a $47 billion takeover approach from U.S. rival Monsanto .",
        "date": "10212015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Syngenta CEO leaves in wake of Monsanto deal rejection "
    },
    {
        "content": "* Swiss company under pressure after rejecting Monsanto bid   (Adds no comment from Monsanto  link to graphic)",
        "date": "10212015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Syngenta CEO leaves in wake of Monsanto deal rejection "
    },
    {
        "content": "BRUSSELS - The European Commission rules that Starbucks and Fiat benefited from illegal tax deals with the Dutch and Luxembourg governments  in cases with major implications for the taxation of multinational companies. (EU-TAXAVOIDANCE/ (UPDATE 2  TV  PICTURE)  moved  by Foo Yun Chee and Philip Blenkinsop  690 words)",
        "date": "10212015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Reuters Business News Schedule at 1230 GMT/0830 AM ET "
    },
    {
        "content": "Oct 15 Personal injury law firms around the United States are lining up plaintiffs for what they say could be \"mass tort\" actions against agrichemical giant Monsanto Co  that claim the company's Roundup herbicide has caused cancer in farm workers and others exposed to the chemical.",
        "date": "10152015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "U.S. lawsuits build against Monsanto over alleged Roundup cancer link "
    },
    {
        "content": "Monsanto Co  one of the world's largest seed and agrichemical companies  said on Wednesday that it was slashing 2 600 jobs and restructuring operations to cut costs in a slumping commodity market.",
        "date": "10082015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto slashing 2 600 jobs  buying back shares as sales fall "
    },
    {
        "content": "Monsanto Co  one of the world's largest seed and agrichemical companies  said on Wednesday that it was slashing 2 600 jobs and restructuring operations to cut costs in a slumping commodity market.",
        "date": "10072015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto slashing 2 600 jobs  buying back shares as sales fall "
    },
    {
        "content": "(Adds background on rivals hurt by agricultural slump)     By Carey Gillam     Oct 7 Monsanto Co  one of the world's largest seed and agrichemical companies  said on Wednesday that it was slashing 2 600 jobs and restructuring operations to cut costs in a slumping commodity market.     The company  which said it expected low prices for agricultural products to squeeze results well into 2016  also reported a much wider quarterly loss and gave an outlook below many analysts' expectat",
        "date": "10072015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 4-Monsanto slashing 2 600 jobs  buying back shares as sales fall "
    },
    {
        "content": "SAO PAULO  Oct 7 Monsanto Co said on Wednesday it would close its sugar-cane operations in Brazil  where it had operated under the CanaVialis brand.",
        "date": "10072015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto says to close sugar-cane operations in Brazil "
    },
    {
        "content": "Oct 7 Monsanto Co  one of the world's largest seed and agrichemical companies  said on Wednesday that quarterly sales of its key products fell  leading to a bigger loss than the market expected and reflecting a tough commodity market that it expects to pinch results well into 2016.",
        "date": "10072015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto reports quarterly loss  sets new share buyback "
    },
    {
        "content": "Sept 29 A U.S. farm worker and a horticultural assistant have filed lawsuits claiming Monsanto Co.'s  Roundup herbicide caused their cancers and Monsanto intentionally misled the public and regulators about the dangers of the herbicide.",
        "date": "09292015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "U.S. workers sue Monsanto claiming herbicide caused cancer "
    },
    {
        "content": "CHICAGO/KANSAS CITY With its shares trading at three-year-lows since it abandoned a $46 billion bid to buy Syngenta AG  last month  Monsanto Co plans to offer its shareholders a new corporate vision: a future in big data.",
        "date": "09242015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Exclusive: Pivoting after failed Syngenta bid  Monsanto to build big data business "
    },
    {
        "content": "LYON/PARIS  France  Sept 10 A French court upheld on Thursday a 2012 ruling in which Monsanto was found to be liable in the chemical poisoning of a French farmer  who says he suffered neurological problems after inhaling the U.S. company's Lasso weedkiller.",
        "date": "09112015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "CORRECTED-UPDATE 1-French court confirms Monsanto liable in chemical poisoning case "
    },
    {
        "content": "LYON/PARIS  France  Sept 10 A French court upheld on Thursday a 2012 ruling in which Monsanto was found to be liable in the chemical poisoning of a French farmer  who says he suffered neurological problems after inhaling the U.S. biotech company's Lasso weedkiller.",
        "date": "09112015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "CORRECTED-French court confirms Monsanto liable in chemical poisoning case "
    },
    {
        "content": "Sept 3 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "09032015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* CFO signals vegetable seeds could fetch up to $3.9 bln   (Adds CFO comment  deal value estimates  analyst comment  background)",
        "date": "09032015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Syngenta to sell vegetable seeds  buy back shares "
    },
    {
        "content": "LONDON  Sept 3 European shares headed for a higher open on Thursday  tracking strong gains on Wall Street  with investors focusing on a meeting of the European Central Bank later in the day and U.S. jobs data on Friday for hints about the market's near-term direction.",
        "date": "09032015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "European Factors to Watch-Shares seen up  focus on central banks "
    },
    {
        "content": "ZURICH  Aug 31    The Swiss blue-chip SMI  was seen opening 0.7 percent lower at 8725 points on Monday  according to premarket indications by bank Julius Baer .",
        "date": "08312015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Swiss stocks - Factors to watch on Aug 31 "
    },
    {
        "content": "ZURICH  Sept 3 The Swiss blue-chip SMI  was seen opening up 0.4 percent at 8656 points on Thursday  according to premarket indications by bank Julius Baer .",
        "date": "09032015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Swiss stocks - Factors to watch on Sept 3 "
    },
    {
        "content": "ZURICH Syngenta AG  may seek partners to help improve its product lineup after a thorough review in the wake of a rebuffed takeover approach from Monsanto Co   the agrichemicals group's chairman told a Swiss newspaper.",
        "date": "08292015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Syngenta may seek partners  JVs after product review: chairman in paper "
    },
    {
        "content": "ZURICH  Aug 29 Syngenta AG may seek partners to help improve its product lineup after a thorough review in the wake of a rebuffed takeover approach from Monsanto Co  the agrichemicals group's chairman told a Swiss newspaper.",
        "date": "08292015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta may seek partners  JVs after product review -chairman in paper "
    },
    {
        "content": "* Monsanto says not seeking EU approval to grow other GM crops",
        "date": "08272015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Latvia  Greece win opt-out from Monsanto GM crop "
    },
    {
        "content": "FRANKFURT Syngenta  management faced pressure on Thursday to offer tangible rewards to shareholders after the Swiss pesticides company turned its back on a deal with unwanted American suitor Monsanto .",
        "date": "08272015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta management faces pressure to appease investors "
    },
    {
        "content": "Aug 26 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "08262015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "NEW YORK and CHICAGO U.S.-based Monsanto Co  sweetened its offer to buy Switzerland's Syngenta AG   valuing the company at around $47 billion as it tries to lure the Swiss firm to the negotiating table  a person familiar with the matter said on Monday.",
        "date": "08242015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto sweetens offer for Syngenta  values firm at $47 billion "
    },
    {
        "content": "* No rival bidder seen emerging   (Adds lack of rival bidders  investment bank comment  analyst comment)",
        "date": "08272015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Syngenta management faces pressure to appease investors "
    },
    {
        "content": "ZURICH  Aug 27 - The Swiss blue-chip SMI was seen opening 1.8 percent higher at 8705.91 points on Thursday  according to premarket indications by bank Julius Baer .",
        "date": "08272015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Swiss stocks - Factors to watch "
    },
    {
        "content": "U.S. agribusiness leader Monsanto Co.  on Wednesday abandoned pursuit of Swiss rival Syngenta AG   which had rejected a recently sweetened $47 billion offer.",
        "date": "08262015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto drops pursuit of Swiss agribusiness rival Syngenta "
    },
    {
        "content": "Aug 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "08242015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK and CHICAGO  Aug 24 U.S.-based Monsanto Co sweetened its offer to buy Switzerland's Syngenta AG   valuing the company at around $47 billion as it tries to lure the Swiss firm to the negotiating table  a person familiar with the matter said on Monday.",
        "date": "08242015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Monsanto sweetens offer for Syngenta  values firm at $47 bln -source "
    },
    {
        "content": "Aug 24 U.S.-based Monsanto Co has increased its offer to buy Switzerland's Syngenta AG  from CHF 449 per share to CHF 470 per share  a person familiar with the matter said on Monday.",
        "date": "08242015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto sweetens offer for Syngenta to CHF470 a share- source "
    },
    {
        "content": "CHICAGO  Aug 26 Monsanto Co  having ditched an audacious $46 billion offer for Syngenta AG   may downshift to a humbler strategy of beefing up its crop protection portfolio through other acquisitions  partnerships and licensing agreements.",
        "date": "08272015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto  rivals eye next step after Syngenta deal collapse "
    },
    {
        "content": "ZURICH Syngenta AG  the Swiss agricultural chemicals maker  was seen opening up more than 7 percent after a source said Monsanto Co. had sweetened its takeover offer  according to premarket indicators in Zurich.",
        "date": "08252015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Syngenta seen opening up after source says Monsanto boosts offer "
    },
    {
        "content": "ZURICH  Aug 26 Swiss agrichemicals group Syngenta said its board  unanimously rejected a revised offer from suitor Monsanto  which then dropped its takeover approach.",
        "date": "08262015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta says board unanimously rejected Monsanto offer "
    },
    {
        "content": "Aug 26 U.S. agribusiness leader Monsanto Co.  on Wednesday abandoned pursuit of Swiss rival Syngenta AG  which had rejected a recently sweetened $47 billion offer.",
        "date": "08262015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 4-Monsanto drops pursuit of Swiss agribusiness rival Syngenta "
    },
    {
        "content": "ZURICH A Monsanto offer of 470 Swiss francs per share in Swiss agricultural chemicals maker Syngenta would be a good price for the company  a fund manager for Oddo Asset management said on Tuesday  suggesting Syngenta open talks with its suitor.",
        "date": "08252015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta investor Oddo says 470 Swiss francs good price "
    },
    {
        "content": "ZURICH  Aug 26 Swiss agrichemicals group Syngenta AG said its board  unanimously rejected a revised offer from suitor Monsanto Co.  which then dropped its takeover approach.",
        "date": "08262015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Syngenta says board unanimously rejected Monsanto offer "
    },
    {
        "content": "ZURICH  Aug 25 A Monsanto offer of 470 Swiss francs per share in Swiss agricultural chemicals maker Syngenta would be a good price for the company  a fund manager for Oddo Asset management said on Tuesday  suggesting Syngenta open talks with its suitor.",
        "date": "08252015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta investor Oddo says 470 Sfr good price "
    },
    {
        "content": "LONDON  Aug 25 European shares rose on Tuesday  recovering some poise after a sharp sell-off the previous day on concerns about China's economy that saw around 450 billion euros ($520 billion) wiped off the value of leading stocks.",
        "date": "08252015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "European shares climb back up after sharp sell-off "
    },
    {
        "content": "LONDON Syngenta shareholders  called on the company's board to clarify how it intends to make up billions of dollars of lost shareholder value after Monsanto Co  ditched its $47 billion bid for the Swiss group.",
        "date": "08262015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta must explain 'Plan B' after Monsanto scraps $47 billion bid: investors "
    },
    {
        "content": "LONDON  Aug 25 European shares rose on Tuesday  recovering some poise after a sharp sell-off the previous day on concerns about China's economy that saw around 450 billion euros ($520 billion) wiped off the value of leading stocks.",
        "date": "08252015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "European shares claw back some ground after sell-off "
    },
    {
        "content": "LONDON  Aug 26 Syngenta shareholders  called on the board to clarify how it intends to make up billions of dollars of lost shareholder value after Monsanto Co.  ditched its $47 billion bid for the Swiss company.",
        "date": "08262015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta must explain 'Plan B' after Monsanto scraps $47 bln bid -investors "
    },
    {
        "content": "NEW YORK and CHICAGO U.S.-based Monsanto Co  sweetened its offer to buy Switzerland's Syngenta AG   valuing the company at around $47 billion as it tries to lure the Swiss firm to the negotiating table  a person familiar with the matter said on Monday.",
        "date": "08252015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto sweetens offer for Syngenta  values firm at $47 billion "
    },
    {
        "content": "CHICAGO Monsanto Co and Syngenta AG are not holding any deal negotiations at this time  let alone discussions about a price for Monsanto’s proposed takeover of its Swiss rival  sources familiar with both companies told Reuters on Tuesday.",
        "date": "08052015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Syngenta and Monsanto not in deal talks: sources "
    },
    {
        "content": "Aug 3 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "08032015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "PARIS  July 29 French seeds group Vilmorin  would consider taking over part of Syngenta's  seed activities if these were put up for sale as part of the proposed takeover by U.S. rival Monsanto  the company said on Wednesday.",
        "date": "07292015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Vilmorin would consider Syngenta seed assets bid "
    },
    {
        "content": "CHICAGO  Aug 4 Monsanto Co and Syngenta AG are not holding any deal negotiations at this time  let alone discussions about a price for Monsanto's proposed takeover of its Swiss rival  sources familiar with both companies told Reuters on Tuesday.",
        "date": "08042015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Syngenta and Monsanto not in deal talks - sources "
    },
    {
        "content": "SEATTLE  Aug 4 Seed and agrochemical giant Monsanto should pay for the cleanup of a Washington state river polluted with a dangerous chemical contaminant the company manufactured decades ago  the city of Spokane said in a lawsuit.",
        "date": "08042015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Spokane  Washington  sues Monsanto over PCBs in polluted state river "
    },
    {
        "content": "SAO PAULO  Aug 4 Seed giant Monsanto Co.'s  unwanted takeover bid with Switzerland's Syngenta AG  would face strong resistance in Brazil should it go forward  farmers and lawyers said  a hurdle that could delay or force major concessions to the $45 billion deal.",
        "date": "08042015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Brazil presents another hurdle in Monsanto's bid for Syngenta "
    },
    {
        "content": "Aug. 4 Several U.S. farm and consumer groups are working on strategies to derail a proposed tie-up of Monsanto Co and agricultural seeds and chemicals rival Syngenta AG  saying a combination of the market leaders would spell fewer and higher-priced products.",
        "date": "08042015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "U.S. farm  consumer groups aim to block Monsanto bid for Syngenta "
    },
    {
        "content": "SAO PAULO  Aug 4 Seed giant Monsanto Co.'s  unwanted takeover bid with Switzerland's Syngenta AG  would face strong resistance in Brazil should it go forward  farmers and lawyers said  a hurdle that could delay or force major concessions to the $45 billion deal.",
        "date": "08042015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "RPT-Brazil presents another hurdle in Monsanto's bid for Syngenta "
    },
    {
        "content": "FRANKFURT Syngenta  has said a $2 billion break-up fee that unwanted U.S. suitor Monsanto  has pledged to pay if its proposed $45 billion merger failed would only apply in limited cases  leaving its shareholders exposed to the bulk of regulatory risks.",
        "date": "07272015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Syngenta says Monsanto's $2 billion break-up fee comes with caveat "
    },
    {
        "content": "* Syngenta: shareholders exposed to non-horizontal antitrust risk",
        "date": "07272015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta says Monsanto's $2 bln break-up fee comes with caveat "
    },
    {
        "content": "ZURICH Syngenta  and unwanted U.S. suitor Monsanto  squabbled over an earnings report from the Swiss pesticides maker on Thursday  with both sides claiming it strengthened their case in a $45 billion takeover battle.",
        "date": "07232015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Syngenta spars with suitor Monsanto over takeover "
    },
    {
        "content": "GM earnings more than doubles on U.S. truck demand; shares jump",
        "date": "07232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Reuters Business News Schedule at 1230 GMT/0830 AM ET "
    },
    {
        "content": "* Syngenta H1 earnings and sales lower but beat expectations   (Adds challenging margin target  CEO comment)",
        "date": "07232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Syngenta spars with suitor Monsanto over takeover "
    },
    {
        "content": "As Monsanto Co struggles to convince rival Syngenta AG to discuss a potential merger  the seed and agrochemical giant is also wooing U.S. farmers  aiming to ease concerns about the proposed tie-up that could prompt regulatory challenges.",
        "date": "07182015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "In bid for Syngenta  Monsanto woos U.S. farmer support "
    },
    {
        "content": "ZURICH  July 23 Syngenta  which has rebuffed a $45 billion takeover proposal from rival Monsanto  has support from key sharholders for a stand-alone strategy and does not need a strategic partner  its chief executive said.",
        "date": "07232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta says investors are supportive of standalone strategy "
    },
    {
        "content": "BASEL  July 23 U.S. seed company Monsanto  on Thursday renewed its efforts to woo Syngenta AG  after the Swiss agrochemicals maker reported better-than-expected second-quarter results.",
        "date": "07232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto renews efforts to woo Syngenta after Swiss firms's results "
    },
    {
        "content": "July 17 As Monsanto Co struggles to convince rival Syngenta AG to discuss a potential merger  the seed and agrochemical giant is also wooing U.S. farmers  aiming to ease concerns about the proposed tie-up that could prompt regulatory challenges.",
        "date": "07172015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "In bid for Syngenta  Monsanto woos U.S. farmer support "
    },
    {
        "content": "LONDON A leading Syngenta  investor has criticized the board for excluding all but \"a very small group\" of shareholders from talks that could determine the fate of a $45 billion takeover bid by Monsanto   a letter seen by Reuters showed.",
        "date": "07152015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Exclusive: Syngenta investor rebukes board for YouTube engagement on Monsanto bid "
    },
    {
        "content": "ST. LOUIS  MO Any hostile bid by Monsanto Co for Swiss rival Syngenta AG is some way off  the U.S. seed company's president and chief operating officer told Reuters  adding he was focused on trying to secure a negotiated deal.",
        "date": "07172015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Exclusive: Monsanto says any hostile bid for Syngenta some way off "
    },
    {
        "content": "ZURICH  July 23 Syngenta  the world's largest pesticides maker  posted better than expected earnings for the first half and highlighted the sales potential of new products under development  as it battles Monsanto's $45 billion takeover proposal.",
        "date": "07232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta posts H1 earnings above market view "
    },
    {
        "content": "* Syngenta shares gain 2.9 percent   (Adds shares  analyst comment)",
        "date": "07152015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Paulson's hedge fund takes stake in Syngenta -sources "
    },
    {
        "content": "Hedge fund Paulson & Co has taken a stake in Syngenta AG    and could push for the board of directors of the Swiss pesticide maker to accept a takeover offer from U.S. seed company Monsanto Co   people familiar with the matter said on Tuesday.",
        "date": "07142015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Paulson's hedge fund takes stake in Syngenta: sources "
    },
    {
        "content": "July 14 Hedge fund Paulson & Co has taken a stake in Syngenta AG   and could push for the board of directors of the Swiss pesticide maker to accept a takeover offer from U.S. seed company Monsanto Co  people familiar with the matter said on Tuesday.",
        "date": "07142015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Paulson's hedge fund takes stake in Syngenta -sources "
    },
    {
        "content": "Monsanto Co  whose Roundup product is one of the world's most widely used herbicides  said on Tuesday it has arranged for an outside scientific review of a World Health Organization finding that the weed killer's key ingredient probably causes cancer.",
        "date": "07142015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto says panel to review WHO finding on cancer link to herbicide "
    },
    {
        "content": "DES MOINES  Iowa July 9 Monsanto President Brett Begemann on Thursday told U.S. soybean growers that if it buys Syngenta  the combined company would be run out of the United States and enough Syngenta operations would be shed to ensure continued market competition for seeds and chemicals.",
        "date": "07092015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto president tells farmers nothing to fear in Syngenta deal "
    },
    {
        "content": "July 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "07072015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "July 14 Monsanto Co  whose Roundup product is one of the world's most widely used herbicides  said on Tuesday it has arranged for an outside scientific review of a World Health Organization finding that the weed killer's key ingredient probably causes cancer.",
        "date": "07142015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Monsanto says panel to review WHO finding on cancer link to herbicide "
    },
    {
        "content": "ZURICH Monsanto  believes offering a higher break-up fee to Syngenta  if its $45 billion takeover approach does not go ahead would be counterproductive  Chief Executive Hugh Grant told a Swiss newspaper.",
        "date": "07072015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto CEO says bigger Syngenta break-up fee 'counterproductive': paper "
    },
    {
        "content": "ZURICH  July 7 Monsanto believes offering a higher break-up fee to Syngenta if its $45 billion takeover approach does not go ahead would be counterproductive  Chief Executive Hugh Grant told a Swiss newspaper.",
        "date": "07072015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto CEO says bigger Syngenta break-up fee \"counterproductive\" -paper "
    },
    {
        "content": "ZURICH  July 7 Monstanto Chief Executive Hugh Grant had held \"very constructive\" talks with Syngenta  shareholders and reiterated to a Swiss newspaper it could raise its $45 billion offer for the Swiss group under certain conditions.",
        "date": "07072015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto holds \"constructive\" talks with Syngenta investors-paper "
    },
    {
        "content": "* Netflix has active session after board approves stock split",
        "date": "06242015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "US STOCKS-Wall St ends broadly lower on Greek debt concerns "
    },
    {
        "content": "June 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "06242015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Monsanto Co   the world's largest seed company  said on Wednesday it would still pursue an acquisition of Swiss rival Syngenta AG   which has rebuffed talks about its $45 billion offer  even as it warned of market challenges ahead.",
        "date": "06242015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto says it still wants Syngenta; profit beats estimates "
    },
    {
        "content": "ZURICH/ FRANKFURT Syngenta will sound out shareholders in the coming days for their views on the Swiss crop chemicals maker's opposition to rival Monsanto's $45 billion takeover approach.",
        "date": "06232015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Syngenta tests investor support for Monsanto opposition "
    },
    {
        "content": "June 24 Monsanto Co  the world's largest seed company  said on Wednesday it would still pursue an acquisition of Swiss rival Syngenta AG  which has rebuffed talks about its $45 billion offer  even as it warned of market challenges ahead.",
        "date": "06242015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Monsanto says it still wants Syngenta; profit beats estimates "
    },
    {
        "content": "* Monsanto trying to buy firm \"on the cheap\" -Syngenta chairman",
        "date": "06232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Syngenta tests investor support for Monsanto opposition "
    },
    {
        "content": "June 24 Monsanto Co  the world's largest seed company  reported a better-than-expected profit for the third quarter on Wednesday  and said it continues to pursue the acquisition of Swiss rival Syngenta AG.",
        "date": "06242015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto beats view with 3rd qtr profit  says still wants Syngenta "
    },
    {
        "content": "ZURICH Monsanto Co  Chief Executive Hugh Grant called the company's attempt to buy Swiss group Syngenta AG  \"a long game\" and said he still wants to get it done despite Syngenta's rebuff  the Wall Street Journal reported.",
        "date": "06242015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto CEO calls Syngenta approach 'a long game': WSJ "
    },
    {
        "content": "ZURICH  June 23 A Syngenta spokesman said on Tuesday the Swiss crop chemicals maker will seek feedback from its largest shareholders about Monsanto's  takeover approach in the next few days.",
        "date": "06232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta to seek shareholder feedback about Monsanto's approach "
    },
    {
        "content": "ZURICH  June 24 Monsanto Co Chief Executive Hugh Grant called the company's attempt to buy Swiss group Syngenta AG \"a long game\" and said he still wants to get it done despite Syngenta's rebuff  the Wall Street Journal reported.",
        "date": "06242015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto CEO calls Syngenta approach 'a long game' - WSJ "
    },
    {
        "content": "ZURICH  June 23 The Swiss blue-chip SMI  was seen opening 0.4 percent higher at 9 056 points on Tuesday  according to premarket indications by bank Julius Baer .",
        "date": "06232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Swiss stocks - Factors to watch on June 23 "
    },
    {
        "content": "ZURICH  June 23 Syngenta's chairman said any takeover offer needed to be at a fair price and provide a high degree of certainty that it will clear regulatory hurdles  as he reaffirmed the Swiss firm's opposition to Monsanto's current proposal.",
        "date": "06232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta chairman says Monsanto looking to buy firm on the cheap "
    },
    {
        "content": "PARIS French Environment and Energy Minister Segolene Royal has asked garden shops to stop over-the-counter sales of Monsanto's Roundup weedkiller as part of a wider fight against pesticides seen as potentially harmful to humans.",
        "date": "06142015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "French minister asks shops to stop selling Monsanto Roundup weedkiller "
    },
    {
        "content": "ZURICH/FRANKFURT Monsanto is hosting meetings across Europe to woo shareholders in Syngenta after the Swiss seed and crop chemical firm rejected a second takeover approach from its U.S. rival on Monday. | Video ",
        "date": "06092015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto courts Syngenta investors to win deal support "
    },
    {
        "content": "PARIS  June 14 French Environment and Energy Minister Segolene Royal has asked garden shops to stop over-the-counter sales of Monsanto's Roundup weedkiller as part of a wider fight against pesticides seen as potentially harmful to humans.",
        "date": "06142015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-French minister asks shops to stop selling Monsanto Roundup weedkiller "
    },
    {
        "content": "ZURICH Switzerland's Syngenta rejected a second takeover proposal from agrochemicals firm Monsanto on Monday  saying its U.S. rival had made no attempt to seriously address regulatory concerns over the potential deal. | Video ",
        "date": "06092015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta rejects further takeover proposal from Monsanto "
    },
    {
        "content": "WINNIPEG  Manitoba  June 12 Seed company Monsanto Co has named Michiel de Jongh as president and general manager of its Winnipeg-based Canadian operations  effective June 1.",
        "date": "06122015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "MOVES-Monsanto names de Jongh president of Canadian unit "
    },
    {
        "content": "LONDON/FRANKFURT U.S. agrochemicals firm Monsanto Co and its advisers are working flat out to accommodate Syngenta's qualms about regulatory hurdles to a deal whose perils may well outweigh the rewards.",
        "date": "06052015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto plots pricey Syngenta comeback amid growing scepticism "
    },
    {
        "content": "June 4 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "06042015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "June 8 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "06082015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON/FRANKFURT  June 4 U.S. agrochemicals firm Monsanto Co and its advisers are working flat out to accommodate Syngenta's qualms about regulatory hurdles to a deal whose perils may well outweigh the rewards.",
        "date": "06052015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "REFILE-DEALTALK-Monsanto plots pricey Syngenta comeback amid growing scepticism "
    },
    {
        "content": "LONDON/FRANKFURT U.S. agrochemicals firm Monsanto Co and its advisers are working flat out to accommodate Syngenta's qualms about regulatory hurdles to a deal whose perils may well outweigh the rewards.",
        "date": "06042015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto plots pricey Syngenta comeback amid growing scepticism "
    },
    {
        "content": "LONDON/FRANKFURT  June 4 U.S. agrochemicals firm Monsanto Co and its advisers are working flat out to accommodate Syngenta's qualms about regulatory hurdles to a deal whose perils may well outweigh the rewards.",
        "date": "06042015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "DEALTALK-Monsanto plots pricey Syngenta comeback amid growing scepticism "
    },
    {
        "content": "ZURICH/FRANKFURT Monsanto is hosting meetings across Europe to woo shareholders in Syngenta after the Swiss seed and crop chemical firm rejected a second takeover approach from its U.S. rival on Monday. | Video ",
        "date": "06082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto courts Syngenta investors to win deal support "
    },
    {
        "content": "* Syngenta still rebuffs proposal after break-up fee added   (Releads  adds investor quotes  meeting details)",
        "date": "06082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Monsanto courts Syngenta investors to win deal support "
    },
    {
        "content": "FRANKFURT  June 2 KWS Saat  a German supplier of conventionally bred seeds  said it would look at selected seed assets if they were put on offer as part of a potential merger of rivals Monsanto and Syngenta .",
        "date": "06022015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "KWS says to look at seed assets as part of any Syngenta deal "
    },
    {
        "content": "German chemicals group BASF SE is considering a potential offer for Syngenta AG  its Swiss rival which has received a $45 billion takeover offer from Monsanto Co  people familiar with the matter said on Wednesday.",
        "date": "06042015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Exclusive: BASF mulls potential bid for Syngenta "
    },
    {
        "content": "LONDON  June 8 European shares fell on Monday  weighed down by a drop in agrochemicals group Syngenta  although Deutsche Bank outperformed to surge higher after boardroom changes.",
        "date": "06082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Deutsche Bank and Diageo outperform weaker European stock markets "
    },
    {
        "content": "ZURICH  June 8 The following are some of the main factors expected to affect Swiss stocks on Monday:",
        "date": "06082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Swiss stocks - Factors to watch on June 8 "
    },
    {
        "content": "NEW YORK  June 7 U.S. agrochemicals firm Monsanto Co has offered to pay a $2 billion reverse break-up fee to Syngenta AG if it cannot obtain global regulatory approvals for an acquisition  it said in a statement on Sunday.",
        "date": "06082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto offers $2 billion fee to Syngenta as it pursues takeover "
    },
    {
        "content": "COLOGNE  Germany  May 27 The chief executive of German drugs and chemicals group Bayer  Marijn Dekkers  said on Wednesday he could not comment on the possible takeover of Syngenta by Monsanto.",
        "date": "05272015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Bayer CEO says cannot comment on Monsanto-Syngenta "
    },
    {
        "content": "May 22 Monsanto Co  the world's largest seed company  is also known for the popularity of its Roundup herbicide  a weedkiller beloved by farmers and homeowners alike for its speed and deadly assault on tough weeds.",
        "date": "05222015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto's move on Syngenta could mean move away from glyphosate "
    },
    {
        "content": "Monsanto Co   the world's largest seed company  said on Wednesday it plans to divest Syngenta Ag's  seeds and genetic traits businesses as well as some overlapping chemistry assets to win regulatory approval for a takeover of its Swiss rival.",
        "date": "05202015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto says would divest all of Syngenta's seed business "
    },
    {
        "content": "BEIJING  May 22 State-owned China National Chemical Corp  better known as ChemChina  is not considering bidding for Monsanto's herbicide business or for Swiss crop chemicals maker Syngenta  a top ChemChina executive told Reuters on Friday.",
        "date": "05222015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "ChemChina says not considering bids for Monsanto's herbicide business  Syngenta "
    },
    {
        "content": "May 20 Monsanto Co  the world's largest seed company  said on Wednesday it plans to divest Syngenta Ag's  seeds and genetic traits businesses as well as some overlapping chemistry assets to win regulatory approval for a takeover of its Swiss rival.",
        "date": "05202015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 3-Monsanto says would divest all of Syngenta's seed business "
    },
    {
        "content": "Monsanto Co   the world's largest seed company  said on Wednesday it plans to divest all of Syngenta AG's  seeds and traits businesses as well as some overlapping chemistry assets to get regulatory approval for a takeover of its Swiss rival.",
        "date": "05202015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Factbox: Sizing up Monsanto and Syngenta "
    },
    {
        "content": "ZURICH/FRANKFURT  May 20 Swiss crop chemicals maker Syngenta said on Wednesday that Monsanto's  proposal to sell Syngenta's entire seeds business to pave the way for a merger of the two groups would not be enough to allay regulators' concerns about the tie-up.",
        "date": "05202015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta says Monsanto proposals won't appease regulators "
    },
    {
        "content": "Thomson Reuters May 20  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05202015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "BUENOS AIRES  May 19 Argentina's Agriculture Ministry is creating a registry that will track the amount of genetically modified soybean seeds reaped from farmers' crops in order to crack down on the illegal resale of seeds developed by Monsanto Co.",
        "date": "05202015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Argentine farmers to register Monsanto Soy seed use in crackdown "
    },
    {
        "content": "May 15 As seed and chemical maker Monsanto Co.  woos Swiss agrochemicals firm Syngenta  Monsanto also is trying to win over consumers in key international markets  rolling out social media and marketing campaigns.",
        "date": "05152015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "As it woos Syngenta  Monsanto mounts campaign to combat critics "
    },
    {
        "content": "May 14 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "05142015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON/FRANKFURT U.S. seeds giant Monsanto is trying to line up buyers for assets worth up to $8 billion to appease competition authorities before making a fresh takeover approach for Swiss Syngenta  possibly within three weeks  industry sources said.",
        "date": "05152015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto's Syngenta gambit hinges on sale of seed businesses: sources "
    },
    {
        "content": "LONDON/FRANKFURT U.S. seeds giant Monsanto  is trying to line up buyers for assets worth up to $8 billion to appease competition authorities before making a fresh takeover approach for Swiss Syngenta  possibly within three weeks  industry sources said.",
        "date": "05142015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto's Syngenta gambit hinges on sale of seed businesses: sources "
    },
    {
        "content": "LONDON/FRANKFURT  May 14 U.S. seeds giant Monsanto is trying to line up buyers for assets worth up to $8 billion to appease competition authorities before making a fresh takeover approach for Swiss Syngenta  possibly within three weeks  industry sources said.",
        "date": "05142015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto's Syngenta gambit hinges on sale of seed businesses - sources "
    },
    {
        "content": "FRANKFURT German drugs and chemicals group Bayer believes further consolidation in the crop chemicals and seeds markets  is likely regardless of the outcome of Monsanto's bid for Syngenta.",
        "date": "05152015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Bayer sees consolidation in crop chemicals  seeds "
    },
    {
        "content": "* Bayer sees consolidation regardless of Monsanto-Syngenta outcome",
        "date": "05152015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-Bayer sees consolidation in crop chemicals  seeds "
    },
    {
        "content": "* BASF and Dow Chemical among other potential suitors -source",
        "date": "05072015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto and Syngenta hire U.S. banks to advise on possible takeover -sources "
    },
    {
        "content": "U.S. agrochemicals firm Monsanto  has not given up on a proposed takeover of Swiss rival Syngenta   a source close to Monsanto said on Friday after its $45 billion offer was rejected.",
        "date": "05082015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto set to press ahead with Syngenta takeover plan: source "
    },
    {
        "content": "* Syngenta turns down Monsanto offer of 449 Swiss francs/share",
        "date": "05082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 5-Monsanto set to press ahead with Syngenta takeover plan - source "
    },
    {
        "content": "ZURICH/LONDON Agrochemicals firm Syngenta on Friday rejected a $45 billion takeover offer from Monsanto  saying the offer undervalued the Swiss firm and did not fully take into account regulatory risks.",
        "date": "05082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta rejects $45 billion Monsanto takeover offer "
    },
    {
        "content": "LONDON  May 8 Major investors in Swiss agrochemicals firm Syngenta are confident a deal with Monsanto will come off if the U.S. firm ups its initial $45 billion bid by at least 10 percent.",
        "date": "05082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Major Syngenta shareholders would back Monsanto bid around $50 bln "
    },
    {
        "content": "* Calmer bonds  U.S. job data boost sentiment   (Updates closing prices)",
        "date": "05082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "European shares rebound  led by UK after Conservative win "
    },
    {
        "content": "* Calmer bonds  U.S. job data boost sentiment   (Adds detail  fresh comment  updates prices)",
        "date": "05082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UK stocks lead European equity after Conservative win "
    },
    {
        "content": "Monsanto   the world's largest seed company has again approached Switzerland's Syngenta  in recent weeks with an offer to buy the company  Bloomberg reported citing people familiar with the matter.",
        "date": "04302015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto offers to buy Syngenta again: Bloomberg "
    },
    {
        "content": "* Syngenta rallies after rejecting Monsanto bid   (Updates prices  expands)",
        "date": "05082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UK leads European equity rally after Conservative win "
    },
    {
        "content": "LONDON  May 8 UK shares led a rebound in European equity indexes on Friday after early poll results showed Prime Minister David Cameron's Conservatives were set to govern Britain for another five years.",
        "date": "05082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UK market leads European equity rally after Conservatives' election win "
    },
    {
        "content": "April 30 Monsanto  the world's largest seed company has again approached Switzerland's Syngenta  in recent weeks with an offer to buy the company  Bloomberg reported citing people familiar with the matter.",
        "date": "04302015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto offers to buy Syngenta again -Bloomberg "
    },
    {
        "content": "ZURICH  May 8 Agrochemicals firm Syngenta  on Friday rejected a 449 Swiss franc per share takeover offer from Monsanto  saying the offer undervalues the Swiss firm and does not fully take into account regulatory risks.",
        "date": "05082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Syngenta says rejects 449 Swiss franc/share offer from Monsanto "
    },
    {
        "content": "BEIJING  April 8 Three Chinese citizens are taking China's Ministry of Agriculture to court in a bid to make public a toxicology report supporting the approval of Monsanto's popular weedkiller  Roundup  27 years ago.",
        "date": "04092015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "RPT-Chinese citizens sue government over transparency on Monsanto herbicide "
    },
    {
        "content": "BEIJING  April 8 Three Chinese citizens are taking China's Ministry of Agriculture to court in a bid to make public a toxicology report supporting the approval of Monsanto's popular weedkiller  Roundup  27 years ago.",
        "date": "04082015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Chinese citizens sue government over transparency on Monsanto herbicide "
    },
    {
        "content": "* Estimating currency impact like \"playing darts with blindfold\"",
        "date": "03312015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Wall St. earnings estimates may not foretell currency impact "
    },
    {
        "content": "* Estimating currency impact like \"playing darts with blindfold\"",
        "date": "04012015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "UPDATE 1-Wall St earnings estimates may not foretell currency impact "
    },
    {
        "content": "March 24 Monsanto Co  maker of the world's most widely used herbicide  Roundup  wants an international health organization to retract a report linking the chief ingredient in Roundup to cancer.",
        "date": "03242015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto seeks retraction for report linking herbicide to cancer "
    },
    {
        "content": "CHICAGO The world's most widely-used weed killer can \"probably\" cause cancer  the World Health Organization said on Friday.",
        "date": "03202015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto weed killer can 'probably' cause cancer: World Health Organization "
    },
    {
        "content": "CHICAGO  March 20 The world's most widely-used weed killer can \"probably\" cause cancer  the World Health Organization said on Friday.",
        "date": "03202015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "Monsanto weed killer can 'probably' cause cancer -World Health Organization "
    },
    {
        "content": "CHICAGO  Feb 23 U.S. farmers nervous that slumping grain prices will crimp profits are increasingly leasing equipment instead of buying it  creating new risks for manufacturers like Deere & Co that could suffer from declining values for leased machinery.",
        "date": "02232015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "U.S. farmers turn to equipment leases to cope with profit slump "
    },
    {
        "content": "* Shares rise 2 pct in early trade   (Adds CEO comments  details; updates shares)",
        "date": "01292015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 2-Dow Chemical profit beats Street estimate as farm margins jump "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 28 (Fitch) Fitch Ratings has affirmed the Long-term Issuer  Default Rating (IDR)  revolving credit facility rating  and senior unsecured  note ratings of Monsanto Company (Monsanto) at 'A-'. Fitch has also affirmed  Monsanto's Short-term IDR and commercial paper (CP) rating at 'F2'. A complete  list of rating actions follows at the end of this release.  The Rating Outlook is Stable. KEY RATING DRIVERS Company Profile. ",
        "date": "01282015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Fitch Affirms Monsanto's IDRs at 'A-/F2'; Outlook Stable "
    },
    {
        "content": "Thomson Reuters Jan 29  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                  ",
        "date": "01292015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "Thomson Reuters Jan 28  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                  ",
        "date": "01282015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 16 (Fitch) Fitch Ratings has assigned an 'A-' rating to  Monsanto Company's (Monsanto  NYSE: MON) proposed senior unsecured notes in the  amount of $365 million. A complete list of ratings follows at the end of this  release.  The Rating Outlook is Stable. The notes will be senior unsecured obligations and will rank equally with the  company's $7.6 billion in principal amount of senior unsecured notes outstanding  as o",
        "date": "01162015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Fitch Rates Monsanto's $365MM 30-Year Sr. Unsecured Notes 'A-'; Outlook Stable "
    },
    {
        "content": "Jan 15 Monsanto Co. received final U.S. approval on Thursday for herbicide-tolerant crops to be used with a new herbicide the company says will fight problematic weed resistance on farm fields  but critics say will only worsen the problems.",
        "date": "01152015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "USDA approves Monsanto's new GMO soybeans  cotton "
    },
    {
        "content": "Jan 15 Monsanto Co. received final U.S. approval on Thursday for herbicide-tolerant crops to be used with a new herbicide the company says will fight problematic weed resistance on farm fields  but critics say will only worsen the problems.",
        "date": "01152015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 1-USDA approves Monsanto's new GMO soybeans  cotton "
    },
    {
        "content": "BRUSSELS  Jan 13 Individual EU nations will be able to ban cultivation of genetically modified (GM) crops under a compromise deal agreed on Tuesday that ends years of deadlock over the barbed issue and could actually boost GM farming.",
        "date": "01132015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "EU vote gives governments the choice to grow GM crops "
    },
    {
        "content": "Monsanto Co  on Wednesday reported a 34 percent drop in quarterly profit  in part because of lower planted corn acreage in South America and a shift in timing of some sales  but the decline was less steep than analysts expected.",
        "date": "01072015",
        "name": "Monsanto Company",
        "news_type": "topStory",
        "symbol": "MON",
        "title": "Monsanto profit falls  but less sharply than Wall St expected "
    },
    {
        "content": "(Adds information on microbe research  updates share price)",
        "date": "01072015",
        "name": "Monsanto Company",
        "news_type": "normal",
        "symbol": "MON",
        "title": "UPDATE 4-Monsanto profit falls  but less sharply than Wall St expected "
    }
]