[
    {
        "content": "U.S. fertilizer company Mosaic Co  on Tuesday posted bigger-than-expected profit on higher prices  and slashed costs to ride out an agriculture slump  sparking a 9 percent jump in its shares in early trade.",
        "date": "10312017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Fertilizer maker Mosaic surprises with big profit  shares surge "
    },
    {
        "content": "* Mosaic - ‍on Oct 24 co's unit entered time charter with unit of Savage Companies under which unit to charter articulated tug-and-barge unit from Savage Harvest Source text: (http://bit.ly/2gNsADw) Further company coverage:",
        "date": "10302017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic entered time charter with unit of Savage Companies "
    },
    {
        "content": "Oct 31 U.S. fertilizer company Mosaic Co on Tuesday posted bigger-than-expected profit on higher prices  and slashed costs to ride out an agriculture slump  sparking a 9 percent jump in its shares in early trade.",
        "date": "10312017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 2-Fertilizer maker Mosaic surprises with big profit  shares surge "
    },
    {
        "content": "* Mosaic Co - ‍reduces annual dividend target to $0.10 per share​",
        "date": "10312017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-The Mosaic Company Q3 earnings per share $0.65 "
    },
    {
        "content": "Oct 31 U.S. fertilizer company Mosaic Co's profit on Tuesday rose nearly fivefold on higher potash and phosphate prices.",
        "date": "10312017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic quarterly profit surges on higher prices "
    },
    {
        "content": "* Mosaic Co - ‍ Due to Hurricane Irma  company expects approximately 250 000 to 350 000 tonnes of lower production in month of September​",
        "date": "09202017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic expects lower production in Sept due to Hurricane Irma "
    },
    {
        "content": "CHICAGO  Sept 11 Hurricane Irma stripped oranges from trees and prompted Tyson Foods Inc to shut meat plants in Florida and Georgia on Monday to keep workers safe.",
        "date": "09112017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "UPDATE 1-Hurricane Irma whips orange trees  shuts Tyson meat plants "
    },
    {
        "content": "* Mosaic announces quarterly dividend of $0.15 per share Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic announces quarterly dividend of $0.15 per share "
    },
    {
        "content": "Aug 2 U.S. fertilizer producer CF Industries Holdings Inc reported a 93.6 percent fall in quarterly profit on Wednesday and said it expects nitrogen pricing to be challenged through 2017 and into 2018.",
        "date": "08022017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Fertilizer maker CF Industries posts 93.6 pct plunge in profit "
    },
    {
        "content": "U.S. fertilizer producer Mosaic Co on Tuesday forecast slower phosphate sales and weaker prices for the current quarter  causing shares to plunge as much as 9 percent.",
        "date": "08012017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic shares tumble on disappointing fertilizer guidance "
    },
    {
        "content": "Aug 1 Mosaic Co CEO Joc O'Rourke said on Tuesday:",
        "date": "08012017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic CEO says unwilling to sell potash business at current valuation "
    },
    {
        "content": "* Q2 earnings per share view $0.23 -- Thomson Reuters I/B/E/S",
        "date": "08012017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic Q2 sales $1.8 billion versus $1.7 billion "
    },
    {
        "content": "Aug 1 U.S. fertilizer company Mosaic Co on Tuesday reported a quarterly profit that topped analysts' expectations as it sold higher volumes of phosphate and potash  helping offset lower prices.",
        "date": "08012017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Fertilizer maker Mosaic tops profit views on higher sales volumes "
    },
    {
        "content": "Aug 1 U.S. fertilizer company Mosaic Co on Tuesday reported a profit in the second quarter compared with a loss a year earlier  helped by strong demand for phosphate and potash.",
        "date": "08012017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Fertilizer maker Mosaic posts profit in second quarter "
    },
    {
        "content": "* On May 18  co entered into a letter of understanding with Richard Mclellan  Mosaic's Senior Vice President - Brazil",
        "date": "05192017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic entered into letter of understanding with Richard Mclellan  Senior VP-Brazil "
    },
    {
        "content": "* Mosaic announces quarterly dividend of $0.15 per share Source text for Eikon: Further company coverage:",
        "date": "05182017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic announces qtrly dividend of $0.15 per share "
    },
    {
        "content": "U.S. fertilizer maker Mosaic Co  reported a smaller-than-expected quarterly profit on Tuesday  as higher sales volumes were offset by lower phosphate and potash prices.",
        "date": "05022017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic profit misses on lower potash  phosphate prices "
    },
    {
        "content": "May 2 U.S. fertilizer maker Mosaic Co reported a smaller-than-expected quarterly profit on Tuesday  as higher sales volumes were offset by lower phosphate and potash prices.",
        "date": "05022017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 2-Mosaic profit misses on lower potash  phosphate prices "
    },
    {
        "content": "May 2 U.S. fertilizer maker Mosaic Co reported a quarterly loss compared to a year-ago profit  partly hurt by lower phosphate and potash prices and an ammonia plant outage.",
        "date": "05022017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic reports quarterly loss compared to year-ago profit "
    },
    {
        "content": "* Mosaic Co - James C. O'Rourke'S 2016 total compensation was $7.3 million versus $5.7 million in 2015 - SEC filing",
        "date": "04032017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic Co's James O'Rourke's 2016 total compensation $7.3 mln "
    },
    {
        "content": "NEW DELHI/WINNIPEG India's competition regulator said the proposed merger of fertilizer producers Agrium Inc and Potash Corp of Saskatchewan Inc is likely to hurt competition  but the comments were not expected to prevent the merger.",
        "date": "03292017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Indian regulator says Agrium-Potash merger likely to hurt competition "
    },
    {
        "content": "March 31 Mosaic Co said on Friday an outage at its Esterhazy K2 potash mine in Saskatchewan will likely reduce production by 200 000-300 000 tonnes.",
        "date": "03312017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic reports production outage at Esterhazy K2 mine "
    },
    {
        "content": "NEW DELHI/WINNIPEG  March 29 India's competition regulator said the proposed merger of fertilizer producers Agrium Inc and Potash Corp of Saskatchewan Inc is likely to hurt competition  but the comments were not expected to prevent the merger.",
        "date": "03292017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Indian regulator says Agrium-Potash merger likely to hurt competition "
    },
    {
        "content": "* The Mosaic Company reports production outage at Esterhazy K2 mine",
        "date": "03312017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-The Mosaic Company reports production outage at Esterhazy K2 mine "
    },
    {
        "content": "* Mosaic Co files for potential mixed shelf  size undisclosed - SEC filing  Source text for Eikon: (http://bit.ly/2m4Ugob) Further company coverage:",
        "date": "02172017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic Co files for potential mixed shelf  size undisclosed - SEC filing "
    },
    {
        "content": "* Mosaic Co - In 2018  co estimates environmental capital expenditures will be about $310 million",
        "date": "02152017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic estimates environmental capex at about $310 mln in 2018 "
    },
    {
        "content": "SAO PAULO After Norway's Yara pulled out as a potential bidder  Vale SA  has resumed searching for a buyer for four fertilizer plants that were not included in a $2.5 billion sale to Mosaic Co  according to three people with direct knowledge of the matter.",
        "date": "02152017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Exclusive: Vale resumes search for Cubatão fertilizer assets buyer - sources "
    },
    {
        "content": "* Franklin Resources Inc reports 5.4 percent passive stake in Mosaic Co as of Dec. 31  2016 - SEC filing  Source text (http://bit.ly/2lmVN9z) Further company coverage:",
        "date": "02072017",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Franklin Resources reports 5.4 pct passive stake in Mosaic as of Dec. 31  2016 "
    },
    {
        "content": "Mosaic Co  reported a better-than-expected quarterly profit as it kept a tight leash on costs  and the company slashed its annual dividend as it expected only a \"gradual\" improvement from a prolonged slump in the fertilizer market.",
        "date": "02072017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic profit beats; cuts dividend on 'gradual' market improvement "
    },
    {
        "content": "Feb 7 Mosaic Co reported a better-than-expected quarterly profit as it kept a tight leash on costs  and the company slashed its annual dividend as it expected only a \"gradual\" improvement from a prolonged slump in the fertilizer market.",
        "date": "02072017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Mosaic profit beats; cuts dividend on \"gradual\" market improvement "
    },
    {
        "content": "* The Mosaic Company reports fourth quarter and full-year 2016 results; updates dividend policy",
        "date": "02072017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-The Mosaic Company posts Q4 earnings per share $0.03 "
    },
    {
        "content": "Feb 7 Mosaic Co reported a 13.9 percent drop in quarterly net sales  and the company cut its annual dividend  as fertilizer producers struggle with a prolonged slump in the market.",
        "date": "02072017",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic's sales fall 13.9 pct; company cuts annual dividend "
    },
    {
        "content": "BRASILIA/SAO PAULO Vale SA's $2.5 billion sale of its fertilizer business to Mosaic Co  the latest step in the Brazilian iron ore miner's strategy to reduce debt  also makes it the U.S. company's biggest shareholder.",
        "date": "12202016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Vale sells fertilizer unit to Mosaic  to become top shareholder "
    },
    {
        "content": "* On november 18 mosaic company  units entered into an unsecured revolving credit and term loan facility - sec filing",
        "date": "11212016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic says entered into an unsecured revolving credit and term loan facility - SEC filing "
    },
    {
        "content": "* Mosaic -Army Corps of Engineers issued final federal wetlands permit to unit approving mining operations at South Pasture extension mine for over decade  Source text for Eikon:  Further company coverage:",
        "date": "11172016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Army Corps of Engineers issued final federal wetlands permit to Mosaic unit approving mining operations "
    },
    {
        "content": "* Mosaic announces new financing facilities for over $550 million in home solar loans",
        "date": "11212016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic announces new financing facilities for over $550 mln in home solar loans "
    },
    {
        "content": "U.S. fertilizer producer Mosaic Co  may need to restart its idled potash mine at Colonsay  Saskatchewan next year  as international buyers work through inventories  the company said on Tuesday.",
        "date": "11012016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic looks to restart Canadian potash mine as inventory dwindles "
    },
    {
        "content": "* Sees improved fertilizer demand in 2017   (Adds may restart idled Canadian potash mine)",
        "date": "11012016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 3-Mosaic looks to restart Canadian potash mine as inventory dwindles "
    },
    {
        "content": "Nov 1 Mosaic Co CEO Joc O'Rourke  speaking on a conference call:",
        "date": "11012016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic likely to restart Canadian potash mine next year - CEO "
    },
    {
        "content": "* Q3 diammonium phosphate (dap) average selling price $326 per tonne versus $451 per tonne last year",
        "date": "11012016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic Co Q3 EPS $0.11 "
    },
    {
        "content": "Nov 1 Mosaic Co  the world's largest producer of finished phosphate products  reported a 75.5 percent fall in quarterly profit on Tuesday  due to lower fertilizer prices.",
        "date": "11012016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic quarterly profit slumps 75.5 pct as prices stay low "
    },
    {
        "content": "* Mosaic announces quarterly dividend of $0.275 per share  Source text for Eikon:  Further company coverage:",
        "date": "10132016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic announces quarterly dividend of $0.275 per share "
    },
    {
        "content": "Sept 29 Testing of nine wells near a sinkhole at a Mosaic Co fertilizer facility in Florida  site of a massive leak of contaminated water  shows that water meets safe drinking standards for radioactivity and damage has not spread beyond the site  the company said.",
        "date": "09292016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Water meeting safety standards after Florida sinkhole leak: Mosaic "
    },
    {
        "content": "Sept 20 A massive leak of contaminated water through a sinkhole at a Mosaic Co fertilizer facility in Florida will cost it $20 million to $50 million to fix  a company executive said on Tuesday.",
        "date": "09202016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Florida sinkhole to cost Mosaic up to $50 million to fix "
    },
    {
        "content": "A sinkhole spanning 45 feet (13.7 meters) in diameter opened at a Mosaic Co phosphate fertilizer facility in Florida  leaking 215 million gallons of \"slightly radioactive water \" a company spokesman said on Friday. | Video ",
        "date": "09182016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Florida sinkhole at Mosaic fertilizer site leaks radioactive water "
    },
    {
        "content": "A sinkhole spanning 45 feet (13.7 meters) in diameter opened at a Mosaic Co phosphate fertilizer facility in Florida  leaking 215 million gallons of \"slightly radioactive water \" a company spokesman said on Friday.",
        "date": "09162016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Florida sinkhole at Mosaic fertilizer site leaks radioactive water "
    },
    {
        "content": "Sept 16 A sinkhole spanning 45 feet (13.7 meters) in diameter opened at a Mosaic Co phosphate fertilizer facility in Florida  leaking 215 million gallons of \"slightly radioactive water \" a company spokesman said on Friday.",
        "date": "09162016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Florida sinkhole at Mosaic fertilizer site leaks radioactive water "
    },
    {
        "content": "* COO Asher Brinbaum named as interim CEO   (Recasts with appointment of interim CEO)",
        "date": "09112016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Israel Chemicals  hurt by weak potash prices  names interim CEO "
    },
    {
        "content": "JERUSALEM  Sept 11 Stefan Borgas stepping down as chief executive is the latest in a series of issues that have plagued Israel Chemicals (ICL)  and the company's fortunes are not expected to turn around in the foreseeable future given very low potash prices.",
        "date": "09112016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Israel Chemicals faces tough road to recovery after CEO steps down "
    },
    {
        "content": "* 2016 total global potash shipments point estimate is little changed at 59.6 million tonnes within an unchanged range of 59- 60 mmt- SEC filing  Source: (http://bit.ly/2bFv0m7 ) Further company coverage:",
        "date": "09012016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic says 2016 total global potash shipments point estimate little changed - SEC filing "
    },
    {
        "content": "* Kelvin westbrook elected to board of directors of the mosaic company",
        "date": "08242016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic Company appoints Kelvin Westbrook to board of directors "
    },
    {
        "content": "* Sees fy 2016 capital expenditures and equity investments of $1.0 billion to $1.1 billion  Source text for Eikon:  Further company coverage:",
        "date": "08042016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic sees 2016 capex  equity investments of $1.0 bln-$1.1 bln "
    },
    {
        "content": "Miners that produce a diverse commodity mix may be willing to part with fertilizer assets  creating buying opportunities for producers of potash and phosphate  Mosaic Co  Chief Executive Joc O'Rourke said on Tuesday.",
        "date": "08022016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic CEO sees opportunities to buy miners' fertilizer assets "
    },
    {
        "content": "Aug 2 Miners that produce a diverse commodity mix may be willing to part with fertilizer assets  creating buying opportunities for producers of potash and phosphate  Mosaic Co Chief Executive Joc O'Rourke said on Tuesday.",
        "date": "08022016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 4-Mosaic CEO sees opportunities to buy miners' fertilizer assets "
    },
    {
        "content": "* Mosaic Co CEO  speaking to analysts  says he sees room for consolidation in potash  phosphate markets.",
        "date": "08022016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic CEO says no plans for dividend cut currently "
    },
    {
        "content": "* Q2 earnings per share view $0.12 -- Thomson Reuters I/B/E/S",
        "date": "08022016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic Company reports Q2 loss per share $0.03 "
    },
    {
        "content": "Aug 2 U.S. fertilizer company Mosaic Co  reported a quarterly loss due to weak fertilizer prices and charges related to cost cuts.",
        "date": "08022016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic reports loss as weak fertilizer prices  charges hurt "
    },
    {
        "content": "Fertilizer producer Mosaic Co has idled production at its Colonsay  Saskatchewan potash mine in western Canada for the rest of 2016  and temporarily laid off 330 workers  the company said in a statement on Wednesday.",
        "date": "07132016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic idles Saskatchewan potash mine  lays off hundreds "
    },
    {
        "content": "July 13 Fertilizer producer Mosaic Co  has idled production at its Colonsay  Saskatchewan potash mine in western Canada for the rest of 2016  and temporarily laid off 330 workers  the company said in a statement on Wednesday.",
        "date": "07132016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Mosaic idles Saskatchewan potash mine  lays off hundreds "
    },
    {
        "content": "* Will idle its Colonsay  Saskatchewan potash mine for remainder of 2016 and halt current turnaround activities.",
        "date": "07132016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic to idle Colonsay potash mine "
    },
    {
        "content": "* Stockholders approved amendments to Certificate of Incorporation to eliminate authorized class A and class B common stock",
        "date": "05232016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic stockholders approve amendments to certificate of incorporation "
    },
    {
        "content": "* Mosaic announces quarterly dividend of $0.275 per share    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05192016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic sets quarterly dividend of $0.275 per share "
    },
    {
        "content": "U.S. fertilizer company Mosaic Co  forecast higher phosphate and potash sales for the current quarter after it reported higher-than-expected first quarter sales.",
        "date": "05042016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Fertilizer company Mosaic's sales beat estimates "
    },
    {
        "content": "* Net sales in phosphates segment were $909 million for q1  down from $1.2 billion last year",
        "date": "05042016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "BRIEF-The Mosaic Company Q1 earnings per share $0.73 "
    },
    {
        "content": "April 27 Solar Mosaic Inc  a former crowdfunding startup that reinvented itself as a provider of home solar loans  said on Wednesday it had secured $200 million in funding that will support at least 5 000 rooftop installations.",
        "date": "04272016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic raises $200 million for U.S. home solar loans "
    },
    {
        "content": "* Says CEO James O' Rourke's 2015 total compensation was $5.7 million versus $5.9 million in 2014 - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04062016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "BRIEF-Mosaic says CEO James O' Rourke's 2015 total compensation was $5.7 mln vs $5.9 mln in 2014 "
    },
    {
        "content": "U.S. fertilizer company Mosaic Co   grappling with falling prices and profits  is looking for acquisitions that could be bargain-priced in a weak commodity sector.",
        "date": "02112016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic looks for bargain buys as fertilizer sector slumps "
    },
    {
        "content": "Feb 11 U.S. fertilizer company Mosaic Co   grappling with falling prices and profits  is looking for acquisitions that could be bargain-priced in a weak commodity sector.",
        "date": "02112016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 2-Mosaic looks for bargain buys as fertilizer sector slumps "
    },
    {
        "content": "Feb 11 U.S. fertilizer company Mosaic Co   the world's largest producer of finished phosphate products  reported a quarterly profit that more than halved due to lower prices.",
        "date": "02112016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Fertilizer company Mosaic's quarterly profit halves "
    },
    {
        "content": "WINNIPEG  Manitoba U.S.-based fertilizer producer Mosaic Co said on Wednesday it would cut output of phosphates by up to 400 000 tonnes with rotating plant shutdowns in the first quarter  due to weak demand.",
        "date": "02032016",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Fertilizer maker Mosaic cuts phosphate production "
    },
    {
        "content": "Jan 21 The suspension of production at an eastern Canadian mine may lead Potash Corp of Saskatchewan Inc   to shelve plans to build a new West Coast shipping terminal with partners Mosaic Co and Agrium Inc   Potash Chief Executive Jochen Tilk said on Thursday.",
        "date": "01212016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Potash Corp mine closure may shelve Canpotex port plans -CEO "
    },
    {
        "content": "* Half of TSX's 10 main groups rise; 3 gainers for every faller",
        "date": "01212016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "CANADA STOCKS-TSX bucks downtrend  rises as energy stocks bounce "
    },
    {
        "content": "Jan 21 Potash Corp of Saskatchewan's   decision this week to suspend production at an Eastern Canadian mine may lead to it shelving plans to build a new West Coast shipping terminal with partners Mosaic Co and Agrium Inc  Potash Chief Executive Jochen Tilk said on Thursday.",
        "date": "01212016",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Potash Corp mine closure may lead to shelving Canpotex port plans -CEO "
    },
    {
        "content": "Nov 5 Canadian fertilizer and farm retail dealer Agrium Inc  reported a nearly 9 percent rise in quarterly profit  helped by lower costs.",
        "date": "11052015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Fertilizer maker Agrium's profit rises nearly 9 pct "
    },
    {
        "content": "Fertilizer sales look to slide through the rest of the year  U.S. producer Mosaic Co  said on Tuesday  as greater shipments into key markets by rivals in Belarus and China boost competition.",
        "date": "11032015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic sees sliding fertilizer sales; cost-cutting boosts profit "
    },
    {
        "content": "Nov 3 Fertilizer sales look to slide through the rest of the year  U.S. producer Mosaic Co said on Tuesday  as greater shipments into key markets by rivals in Belarus and China boost competition.",
        "date": "11032015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 2-Mosaic sees sliding fertilizer sales; cost-cutting boosts profit "
    },
    {
        "content": "Nov 3 U.S. fertilizer company Mosaic Co's  quarterly profit dropped nearly 21 percent  hurt by lower sales of phosphates and potash and a strong dollar.",
        "date": "11032015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic Q3 profit falls 21 pct "
    },
    {
        "content": "WINNIPEG  Manitoba  Oct 23 U.S. fertilizer company Mosaic Co has laid off 46 unionized workers  or 8 percent of the workforce  at its Colonsay  Saskatchewan potash mine in Western Canada  the company said on Friday  as producers struggle with weak demand.",
        "date": "10232015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic cuts 8 pct of workforce at Canadian potash mine "
    },
    {
        "content": "Fertilizer maker Mosaic Co has reached a settlement worth more than $800 million with U.S. regulators over its waste management practices at plants in Florida and Louisiana.",
        "date": "10012015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic Co settles U.S. environment claims for over $800 million "
    },
    {
        "content": "Oct 1 Fertilizer maker Mosaic Co has reached a settlement worth more than $800 million with U.S. regulators over its waste management practices at plants in Florida and Louisiana.",
        "date": "10012015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 2-Mosaic Co settles U.S. environment claims for over $800 mln "
    },
    {
        "content": "Oct 1 Fertilizer maker Mosaic Co's unit said it reached settlements with federal and state environmental authorities to resolve claims regarding its waste management practices at its manufacturing plants in Florida and Louisiana.",
        "date": "10012015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic settles claims with environmental agencies "
    },
    {
        "content": "Sept 21 U.S. fertilizer company Mosaic Co  said on Monday that it would cut potash production and maintain its reduced phosphate output pace  lowering its outlook for sales.",
        "date": "09212015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic cuts potash output as demand slumps  lowers outlook "
    },
    {
        "content": "SAO PAULO  Aug 12 Fertilizer sales in Brazil will likely be between 30 million and 31 million tonnes in 2015  down from 32.2 million tonnes in 2014 due to market uncertainty  the head of U.S. fertilizer company Mosaic Co in Brazil  Floris Bielders  said on Wednesday.",
        "date": "08122015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Brazil fertilizer sales expected to fall in 2015 -Mosaic "
    },
    {
        "content": "U.S. fertilizer company Mosaic Co  reported a much higher-than-expected quarterly profit on Tuesday  helped by strong phosphates sales and improved potash prices.",
        "date": "08042015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Fertilizer maker Mosaic beats quarterly profit estimates "
    },
    {
        "content": "Aug 4 U.S. fertilizer company Mosaic Co  reported a much higher-than-expected quarterly profit on Tuesday  helped by strong phosphates sales and improved potash prices.",
        "date": "08042015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 2-Fertilizer maker Mosaic beats quarterly profit estimates "
    },
    {
        "content": "Aug 4 A possible takeover of German potash miner K+S by Potash Corp of Saskatchewan would make further consolidation less likely  the incoming chief executive of fertilizer maker Mosaic Co said on Tuesday.",
        "date": "08042015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Potash Corp-K+S deal may limit further consolidation-Mosaic "
    },
    {
        "content": "Aug 4 Canpotex Ltd  the potash export sales arm for Potash Corp of Saskatchewan  Mosaic Co and Agrium Inc  said on Tuesday that Ken Seitz would succeed Steve Dechka as chief executive officer on Nov. 1.",
        "date": "08042015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Canpotex taps Cameco's Seitz as next CEO "
    },
    {
        "content": "Aug 4 U.S. fertilizer company Mosaic Co  reported a 57 percent rise in quarterly profit  helped by strong phosphates sales  improved potash prices and lower costs.",
        "date": "08042015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Fertilizer maker Mosaic's Q2 profit rises 57 pct "
    },
    {
        "content": "(In May 14 item  corrects headline to add dropped word \"Prokopanko\") May 14 Mosaic Co :",
        "date": "05152015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "CORRECTED-BRIEF-Joc o'Rourke will succeed James T. Prokopanko as Mosaic's president and CEO (May 14) "
    },
    {
        "content": "U.S. fertilizer producer Mosaic Co  said on Thursday it would buy back $1.5 billion in shares  likely during the next two to three years  and raised its dividend.",
        "date": "05142015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Fertilizer maker Mosaic to buy back $1.5 billion in shares  hikes dividend "
    },
    {
        "content": "May 14 U.S. fertilizer producer Mosaic Co  said on Thursday it would buy back $1.5 billion in shares  likely during the next two to three years  and raised its dividend.",
        "date": "05142015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Fertilizer maker Mosaic to buy back $1.5 bln in shares  hikes dividend "
    },
    {
        "content": "Thomson Reuters May 14  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05142015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "April 30 North America's two biggest potash producers  Potash Corp of Saskatchewan  and Mosaic Co  reported larger first-quarter profits on Thursday  but results missed expectations.",
        "date": "04302015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "UPDATE 2-Potash Corp  Mosaic profits climb less than expected "
    },
    {
        "content": "Potash Corp of Saskatchewan's   quarterly profit missed estimates and the company cut its full-year profit forecast  citing lower-than-expected potash prices.",
        "date": "04302015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Potash Corp sees lower-than-expected prices hurting profit "
    },
    {
        "content": "April 30 U.S. fertilizer company Mosaic Co  reported an about 36 percent rise in quarterly profit  helped by lower costs and higher phosphate and potash prices.",
        "date": "04302015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic posts 36 pct rise in quarterly profit "
    },
    {
        "content": "TORONTO  April 21 Canadian tech start-up Mosaic is putting color into low-end 3D printers in a move to make the technology more accessible for everything from architectural modeling to medical training.",
        "date": "04212015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic aims to bring color to cheap 3D printers "
    },
    {
        "content": "U.S. fertilizer producer Mosaic Co boosted its chief executive officer's pay last year by more than $5 million as a reward for slashing costs and jobs  a regulatory filing shows.",
        "date": "04062015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Cost-cutting Mosaic CEO collects $5.5 million pay raise "
    },
    {
        "content": "April 6 U.S. fertilizer producer Mosaic Co  boosted its chief executive officer's pay last year by more than $5 million as a reward for slashing costs and jobs  a regulatory filing shows.",
        "date": "04062015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Cost-cutting Mosaic CEO collects $5.5 mln pay raise "
    },
    {
        "content": "March 30 Changes to the Canadian province of Saskatchewan's potash production tax will cost U.S. fertilizer company Mosaic Co $80 million to $100 million in 2015  the company said on Monday.",
        "date": "03312015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "CORRECTED-Canada potash tax changes to cost Mosaic $80 mln-$100 mln -company "
    },
    {
        "content": "March 31 U.S. fertilizer company Mosaic Co  said on Tuesday it would raise its annual dividend by 10 cents to $1.10 per share  effective in May.",
        "date": "03312015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "U.S. fertilizer maker Mosaic raises dividend "
    },
    {
        "content": "March 30 Changes to the Canadian province of Saskatchewan's potash production tax will cost U.S. fertilizer company Mosaic Co $80 million to $100 million in 2015  the company said on Monday.",
        "date": "03302015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Canada potash tax changes to cost Mosaic $80 mln-$100 mln -company "
    },
    {
        "content": "WINNIPEG  Manitoba  March 30 Canpotex Ltd  the offshore potash sales arm of North America's Potash Corp of Saskatchewan   Mosaic Co and Agrium Inc   said on Monday it had set 2015 supply contracts with major Chinese buyers  including Sinofert Holdings Ltd  and expected higher volume.",
        "date": "03302015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Canpotex sets potash contracts with Chinese buyers "
    },
    {
        "content": "WINNIPEG  Manitoba  March 30 Canpotex Ltd  the offshore potash sales arm of Potash Corp of Saskatchewan    Mosaic Co and Agrium Inc  said on Monday it had set 2015 supply contracts with major Chinese buyers  including Sinofert Holdings Ltd.",
        "date": "03302015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Canpotex sets potash contracts with Chinese buyers "
    },
    {
        "content": "WINNIPEG  Manitoba  March 19 Mosaic Co  North America's second-largest potash producer  is seeking a simpler potash tax and royalty system in the resource-rich Canadian province of Saskatchewan  spokeswoman Sarah Fedorchuk said on Thursday.",
        "date": "03192015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Mosaic seeking simpler Saskatchewan potash tax system "
    },
    {
        "content": "Feb 25 Canpotex Ltd  owned by a trio of North American potash producers  is seeking an 8 percent  or $25 per tonne price increase in its 2015 potash supply contract with China's Sinofert Holdings Ltd  Mosaic Co Chief Executive Jim Prokopanko said on Wednesday.",
        "date": "02252015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "UPDATE 1-Canpotex sees to raise potash price 8 pct for China's Sinofert "
    },
    {
        "content": "Feb 11 U.S. fertilizer company Mosaic Co's  fourth-quarter profit nearly tripled  helped by strong demand for phosphates and potash.",
        "date": "02112015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "UPDATE 2-Mosaic profit nearly triples on strong fertilizer demand "
    },
    {
        "content": "U.S. fertilizer company Mosaic Co's  fourth-quarter profit nearly tripled  helped by strong demand for phosphates and potash.",
        "date": "02112015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic profit nearly triples on strong fertilizer demand "
    },
    {
        "content": "Feb 11 U.S. fertilizer company Mosaic Co  said on Wednesday its quarterly profit nearly tripled  helped by a gain of 10 cents per share and strong demand for phosphates and potash.",
        "date": "02112015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Mosaic quarterly profit nearly triples "
    },
    {
        "content": "U.S. fertilizer company Mosaic Co  on Monday estimated that it would post a larger fourth-quarter profit than expected and surpassed its targets for phosphate sales.",
        "date": "01192015",
        "name": "Mosaic Company (The)",
        "news_type": "topStory",
        "symbol": "MOS",
        "title": "Fertilizer maker Mosaic forecasts bigger-than-expected fourth-quarter profit "
    },
    {
        "content": "Jan 19 U.S. fertilizer company Mosaic Co  on Monday estimated that it would post a larger fourth-quarter profit than expected and surpassed its targets for phosphate sales.",
        "date": "01192015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "UPDATE 1-Fertilizer maker Mosaic forecasts bigger-than-expected Q4 profit "
    },
    {
        "content": "Jan 19 U.S. fertilizer company Mosaic Co  on Monday estimated that it would post a larger fourth-quarter profit than expected  on stronger demand for potash and phosphates.",
        "date": "01192015",
        "name": "Mosaic Company (The)",
        "news_type": "normal",
        "symbol": "MOS",
        "title": "Fertilizer maker Mosaic forecasts bigger-than-expected Q4 profit "
    }
]