[
    {
        "content": "Nov 15 A stock market index revamp could put the FANG stocks under one roof.",
        "date": "11162017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "UPDATE 2-S&P  MSCI to blend telecom  media stocks in one sector "
    },
    {
        "content": "NEW YORK  Nov 3 MSCI Inc will temporarily ban new companies that deny equal voting rights to shareholders from two market indexes  intensifying a debate over who should police perceived lapses in corporate governance.",
        "date": "11032017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI blocks new stocks lacking voting rights from some indexes "
    },
    {
        "content": "HONG KONG JPMorgan  has expanded Greater China equities research coverage with about half a dozen new hires this year with plans to add more next year  as global investors look to boost their allocations to China stocks  a senior banker said on Friday.",
        "date": "11032017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "JPMorgan expands Greater China equities research with new hires "
    },
    {
        "content": "* MSCI to broaden consultation on treatment of non-voting shares in equity benchmarks",
        "date": "11032017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI says to broaden consultation on treatment of non-voting shares in equity benchmarks "
    },
    {
        "content": "Nov 2 U.S. index provider MSCI Inc on Thursday named Baer Pettit as president.",
        "date": "11022017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MOVES-MSCI appoints Baer Pettit as president "
    },
    {
        "content": "* MSCI reports financial results for third quarter and nine months 2017",
        "date": "11022017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI Inc Q3 revenue $322.1 million "
    },
    {
        "content": "* Marcus L. Smith appointed to MSCI Inc. Board of directors Source text for Eikon: Further company coverage:",
        "date": "11022017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI Inc appoints Marcus L. Smith to board of directors "
    },
    {
        "content": "Sept 28 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "09282017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MOVES-Deutsche Bank  Mizuho  People's Trust  MSCI  Unigestion "
    },
    {
        "content": "* MSCI integrates IHS Markit fixed income and liquidity data for regulation ready liquidity risk solution Source text for Eikon: Further company coverage:",
        "date": "09272017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI integrates IHS Markit's fixed income and liquidity data "
    },
    {
        "content": "Sept 28 MSCI Inc appointed Jay McNamara as global head of real estate and a member of its executive team.",
        "date": "09282017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MOVES-MSCI names Jay McNamara global head of real estate "
    },
    {
        "content": "U.S. index provider MSCI Inc on Monday named Jeremy Baskin as head of client coverage in the Americas  replacing Jay McNamara.",
        "date": "09182017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI names Jeremy Baskin as head of Americas client coverage "
    },
    {
        "content": "Sept 18 U.S. index provider MSCI Inc on Monday named Jeremy Baskin as head of client coverage in the Americas  replacing Jay McNamara.",
        "date": "09182017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MOVES-MSCI names Jeremy Baskin as head of Americas client coverage "
    },
    {
        "content": "NEW YORK  Aug 31 Stockpickers are jumping into the boom in passive investing by loading up on shares of index-provider MSCI Inc  whose products are the basis for dozens of popular exchange traded funds.",
        "date": "08312017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "If you can't beat 'em: Stockpickers targeting index-provider MSCI "
    },
    {
        "content": "Aug 18 U.S. index provider MSCI Inc on Friday appointed Guido Giese as executive director to its equity research team  based in London.",
        "date": "08182017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MOVES-MSCI names Guido Giese executive director of equity research "
    },
    {
        "content": "* MSCI reports financial results for second quarter and six months 2017",
        "date": "08032017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI reports Q2 adjusted earnings per share $0.95 "
    },
    {
        "content": "SHANGHAI  June 26 China's blue-chip index closed at its highest in over a year on Monday  boosted by news of index provider MSCI saying it could substantially raise the future weighting of China 'A' shares in its emerging markets benchmark.",
        "date": "06262017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "China blue-chips at 18-month high  MSCI talks up A-shares "
    },
    {
        "content": "SHANGHAI  June 26 China stocks rose on Monday morning  led by the blue-chip index advancing to a record high since 2016  after the MSCI chief said the index provider could raise its weighting of China A-shares.",
        "date": "06262017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China blue-chips hit 18-mth high on MSCI inclusion hopes; HK also up "
    },
    {
        "content": "SHANGHAI  June 27 Hong Kong's biggest yuan-denominated exchange-traded fund (ETF) that invests in China's \"A-shares\" saw its largest inflow this year on Tuesday following index publisher MSCI's decision to include mainland stocks in its emerging market benchmark sparked foreign investor interest.",
        "date": "06272017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "Hong Kong's biggest yuan ETF sees strong inflows on China 'A' shares MSCI inclusion "
    },
    {
        "content": "LONDON  June 23 Chinese mainland shares rose nearly 1 percent on Friday  enjoying their best week since November after MSCI's decision to include them in its benchmark index  whilst South Africa's rand firmed after parliament backed the central bank's independence.",
        "date": "06232017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "EMERGING MARKETS-China stocks enjoy best week since November  rand firms "
    },
    {
        "content": "LAGOS  June 22 Nigerian shares extended falls for the second day as sentiment started to weaken amid the possibility that index provider MSCI will downgrade Nigeria later in the year.",
        "date": "06222017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "Nigerian stocks fall for second day as sentiment turns "
    },
    {
        "content": "NEW YORK  June 20 BlackRock Inc  the world's largest asset manager  on Tuesday endorsed the decision by U.S. index provider MSCI to add mainland Chinese stocks to one of its key benchmarks.",
        "date": "06202017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-BlackRock says investors will benefit from MSCI nod on China stocks "
    },
    {
        "content": "NEW YORK  June 20 BlackRock Inc  the world's largest asset manager  on Tuesday endorsed the decision by U.S. index provider MSCI to add mainland Chinese stocks to one of its key benchmarks.",
        "date": "06202017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "BlackRock says investors will benefit from MSCI nod on China stocks "
    },
    {
        "content": "* MSCI to add China 'A' shares to its emerging markets benchmark",
        "date": "06202017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "GLOBAL MARKETS-Stocks fall as supply worry hits oil; U.S. dollar climbs "
    },
    {
        "content": "NEW YORK  June 20 U.S. index provider MSCI Inc said on Tuesday it will add domestic Chinese equities to its global emerging markets benchmark index.",
        "date": "06202017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI adds domestic Chinese stocks to global benchmark "
    },
    {
        "content": "BUENOS AIRES/NEW YORK  June 21 The surprise decision by benchmark investment index provider MSCI to not promote Argentina to its emerging markets stock index could delay much-needed investment in the country  showing that President Mauricio Macri's reform agenda is still far from complete  investors said on Wednesday.",
        "date": "06212017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-Investors look toward further Argentina reforms after MSCI snub "
    },
    {
        "content": "SHANGHAI  June 20 Foreign investors are betting U.S. index publisher MSCI will finally agree to include China-listed shares in its emerging markets benchmark this week  stepping up their buying of Chinese blue-chips that could gain from inclusion in the index.",
        "date": "06202017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "CORRECTED-Foreign investors bet billions on China blue-chips joining MSCI index "
    },
    {
        "content": "SHANGHAI  June 20 China stocks slipped on Tuesday amid lingering concerns over liquidity conditions  even as investors awaited a decision by U.S. index provider MSCI on whether to add mainland shares to its Emerging Markets Index .",
        "date": "06202017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks slip ahead of MSCI decision  liquidity concerns linger "
    },
    {
        "content": "* Move to full China inclusion could take a decade - investors",
        "date": "06212017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "After MSCI verdict  still long wait for China's full entry to global indexes "
    },
    {
        "content": "* China-bound traffic higher as investors expect MSCI inclusion",
        "date": "06202017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks stay in place as MSCI decision awaited; Hong Kong shares slip "
    },
    {
        "content": "NEW YORK/HONG KONG China's stocks took a major step toward global acceptance on Wednesday  finally winning a long campaign for inclusion in a leading emerging markets benchmark  in what was seen as a milestone for global investing. | Video ",
        "date": "06212017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China shares get MSCI nod in landmark moment for Beijing "
    },
    {
        "content": "* Investors hail \"historic\" decision after 3 years of rejection",
        "date": "06212017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "UPDATE 5-China shares get MSCI nod in landmark moment for Beijing "
    },
    {
        "content": "SHANGHAI  June 21 China's blue-chip index shrugged off initial softness to end at 1-1/2-year highs on Wednesday as investors snapped up consumer stocks after index provider MSCI added some mainland big-caps to one of its key benchmarks for global investors.",
        "date": "06212017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China blue-chips hit 1-1/2-yr high as MSCI inclusion boosts consumer stocks "
    },
    {
        "content": "* MSCI says decision should draw $17-$18bln into China initially",
        "date": "06212017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks lukewarm to MSCI inclusion; Hong Kong falls "
    },
    {
        "content": "June 21 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "06212017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "PRESS DIGEST- New York Times business news - June 21 "
    },
    {
        "content": "U.S. index provider MSCI said on Tuesday it would add mainland Chinese stocks to its global emerging markets benchmark index  after having declined to do so for the past three years.",
        "date": "06212017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Analyst View: MSCI adds domestic Chinese stocks to Emerging Markets Index "
    },
    {
        "content": "SEOUL The South Korean share market could see outflows of up to 4.3 trillion won following MSCI's  decision to add China's mainland-listed shares to its global indexes  a senior Korean government official said on Wednesday.",
        "date": "06212017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "South Korea stocks may see outflow of up to 4.3 trillion won after MSCI includes China: official "
    },
    {
        "content": "* Yuan also strengthens  in spite of Moody's rating downgrade",
        "date": "05252017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "China blue-chips leap most in 9 months  some sense state support "
    },
    {
        "content": "SHANGHAI  May 25 China stocks rebounded sharply on Thursday  as the blue-chip CSI300 index posted its best day in more than nine months amid growing hopes that global index provider MSCI Inc will add mainland shares to its benchmark next month.",
        "date": "05252017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "CORRECTED-China's blue chips have best day since August  aided by MSCI inclusion hopes "
    },
    {
        "content": "SHANGHAI  May 25 Hong Kong shares followed Asian markets higher on Thursday  even after Moody's downgraded Hong Kong's local and foreign currency issuer ratings shortly after cutting China's ratings on Wednesday.",
        "date": "05252017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Hong Kong stocks at fresh 22-month high despite Moody's downgrade "
    },
    {
        "content": "* Expectations rise for MSCI index to soon include China A shares",
        "date": "05252017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China shares shrug off downgrade  rise on hopes for MSCI inclusion; HK also up "
    },
    {
        "content": "* Meitu shares down 9.09 pct (Adds MSCI comment  detail  updates prices)",
        "date": "05172017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 2-MSCI reversal wipes $533 million off value of China's Meitu "
    },
    {
        "content": "HONG KONG  May 17 Shares of Meitu Inc fell as much as 7 percent on Wednesday after index provider MSCI said the Chinese selfie app maker would no longer be included in its index from June 1.",
        "date": "05172017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Shares in Chinese app maker Meitu drop after removal from MSCI "
    },
    {
        "content": "May 15 Index provider MSCI on Monday announced changes to its indexes as a result of its semiannual market reclassification  including reclassifying Pakistan as an emerging market from frontier market status and the addition of 57 securities and removal of 28 securities from its All-Country World Index.",
        "date": "05152017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-MSCI upgrades Pakistan and adds 57 securities  removes 28 from world index "
    },
    {
        "content": "May 15 Index provider MSCI announced Monday changes to its indexes as a result of its semi-annual market reclassification including the addition of 57 securities and removal of 28 securities from its All-Country World Index .",
        "date": "05152017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI adds 57 securities  removes 28 from benchmark world index "
    },
    {
        "content": "* Q1 earnings per share view $0.85 -- Thomson Reuters I/B/E/S",
        "date": "05042017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI Q1 revenue rose 8 percent to $301.2 million "
    },
    {
        "content": "* MSCI has slimmed down proposal to include 169 Connect stocks",
        "date": "04242017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "Hopes rise for China share inclusion as MSCI pitches compromise "
    },
    {
        "content": "April 20 U.S. index compiler MSCI Inc appointed Arun Sinha as chief marketing officer.",
        "date": "04202017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MOVES-MSCI names new chief marketing officer "
    },
    {
        "content": "* Years away from implementing an identity trading system   (Adds details  quotes)",
        "date": "03272017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-Hong Kong Exchange CEO says MSCI consultation may lead to index deal "
    },
    {
        "content": "* CEO Henry Fernandez's FY 2016 total compensation was $22.2 million versus $6.4 million in FY 2015 - SEC Filing",
        "date": "03242017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI CEO Henry Fernandez's FY 2016 total compensation was $22.2 mln vs $6.4 mln in FY 2015 - SEC Filing "
    },
    {
        "content": "NEW YORK/HONG KONG Global index provider MSCI Inc  is seeking feedback from market participants on whether to add Chinese shares to a widely tracked index  a move which could trigger billions of dollars in capital inflows into mainland stocks and ease pressure on its yuan currency.",
        "date": "03232017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI seeks feedback on potential China stocks inclusion "
    },
    {
        "content": "NEW YORK/HONG KONG  March 23 Global index provider MSCI Inc is seeking feedback from market participants on whether to add Chinese shares to a widely tracked index  a move which could trigger billions of dollars in capital inflows into mainland stocks and ease pressure on its yuan currency.",
        "date": "03232017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "UPDATE 1-MSCI seeks feedback on potential China stocks inclusion "
    },
    {
        "content": "March 15 U.S. market index compiler MSCI Inc  said it was not in talks for a possible takeover.",
        "date": "03152017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "U.S. index compiler MSCI says not in talks for takeover "
    },
    {
        "content": "SAN FRANCISCO  March 6 Shares of Snap Inc  slumped 12 percent on Monday and closed at their lowest level of the three sessions since the Snapchat owner's soaring market debut last week.",
        "date": "03062017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Snap slumps 12 percent  closes at lowest since IPO "
    },
    {
        "content": "NEW YORK U.S. stocks pulled back on Monday in a broad decline as investors grew uneasy over the latest tumult surrounding the Trump administration and geopolitical tensions emanating from North Korea.",
        "date": "03062017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Wall Street slips on wiretap accusation  geopolitical worries "
    },
    {
        "content": "* Indexes down: Dow 0.24 pct  S&P 0.33 pct  Nasdaq 0.37 pct   (Updates to market close)",
        "date": "03062017",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "US STOCKS-Wall St dips on Trump tumult  North Korea action "
    },
    {
        "content": "* MSCI reports financial results for fourth quarter and full-year 2016",
        "date": "02022017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI reports qtrly earnings per share of $0.73 "
    },
    {
        "content": "HOLLYWOOD  Fla. China's progress toward full inclusion of its stocks in global benchmarks could be halted if the world's second-largest economy cracks down further on people moving money out of the country  index provider MSCI Inc's top executive said on Monday.",
        "date": "01242017",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "Exclusive: MSCI head expresses concern on China capital controls "
    },
    {
        "content": "U.S. index provider MSCI announced changes to a number of its index funds on Monday  adding 55 securities and removing 34 from its World Index .",
        "date": "11152016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI announces latest changes to U.S.  China  emerging market indexes "
    },
    {
        "content": "LONDON  Nov 8 U.S. index provider MSCI said it would not include the West African Economic and Monetary Union (WAEMU) in its benchmark frontier markets index as part of its November review.",
        "date": "11082016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI excludes W.African Economic and Monetary Union from Frontier Markets 100 Index in November "
    },
    {
        "content": "Nov 14 U.S. index provider MSCI announced changes to a number of its index funds on Monday  adding 55 securities and removing 34 from its World Index.",
        "date": "11142016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 2-MSCI announces latest changes to U.S.  China  emerging market indexes "
    },
    {
        "content": "Nov 14 U.S. index provider MSCI announced changes to a number of its index funds on Monday  adding 55 securities and removing 34 from its World Index.",
        "date": "11142016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI announces latest changes to U.S.  China  emerging market indexes "
    },
    {
        "content": "* Reports financial results for third quarter and nine months 2016",
        "date": "10272016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI reports Q3 adjusted EPS $0.77 "
    },
    {
        "content": "Sept 22 Index provider MSCI Inc named Laurent Seyer its chief client officer  a newly created role.",
        "date": "09222016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MOVES-MSCI names Laurent Seyer chief client officer "
    },
    {
        "content": "NEW YORK  Sept 18 Investors who own some bank sector funds may be in for an unwanted surprise: a tax bill.",
        "date": "09182016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "U.S. financials ETF investors face tax bill after index revamp "
    },
    {
        "content": "U.S. index provider MSCI announced on Thursday that the only change to its All Country World Index will be to add Liberty Broadband C to and remove Ionis Pharmaceuticals Inc  both U.S. stocks.",
        "date": "08112016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI adds  removes one company from All World Index  moves Lending Club to small cap "
    },
    {
        "content": "* Board of directors authorize a 27.3% increase in regular quarterly cash dividend to $0.28 per share",
        "date": "07282016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI Q2 earnings per share $ 0.69 "
    },
    {
        "content": "NEW YORK/LIMA  June 14 Index provider MSCI Inc  decided on Tuesday to keep Peru's stock exchange  in its emerging markets group instead of downgrading it to the higher-risk \"frontier\" category due to low liquidity.",
        "date": "06142016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-MSCI keeps Peru bourse in its emerging markets group "
    },
    {
        "content": "NEW YORK  June 14 U.S. index provider MSCI Inc  said on Tuesday it will not add domestic Chinese equities to its global emerging markets benchmark index  concluding that the country has more progress to make in sufficiently liberalizing its capital markets.",
        "date": "06142016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI declines to add domestic Chinese shares to global benchmark "
    },
    {
        "content": "LIMA  June 14 Index provider MSCI Inc  decided on Tuesday to keep Peru's stock exchange in its emerging markets group instead of downgrading it to the higher-risk \"frontier\" category because of low liquidity.",
        "date": "06142016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI keeps Peru bourse in its emerging markets group "
    },
    {
        "content": "SHANGHAI  June 14 China stocks ended modestly higher on Tuesday  as investors remained cautious after a slump earlier in the week and ahead of MSCI's decision on whether to add Chinese shares to one of its flagship indexes.",
        "date": "06142016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks close slightly higher ahead of MSCI decision "
    },
    {
        "content": "NEW YORK The U.S. dollar fell along with bond yields on Wednesday after the Federal Reserve left U.S. interest rates unchanged and hinted at a less aggressive outlook for rates.",
        "date": "06152016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "U.S. dollar  bond yields fall after Fed statement "
    },
    {
        "content": "June 15 BlackRock Inc is introducing its first U.S.-listed exchange-traded fund providing access to mainland Chinese markets  the world's largest asset manager said on Wednesday.",
        "date": "06152016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "BlackRock debuts U.S. ETF for China-listed stock after MSCI snub "
    },
    {
        "content": "SHANGHAI  June 8 China stocks fell on Wednesday amid weak volumes as markets prepared for a long weekend holiday though investors are looking ahead to the possible announcement of mainland shares' inclusion in MSCI's emerging market indexes next week.",
        "date": "06082016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "China stocks close lower ahead of long weekend "
    },
    {
        "content": "HONG KONG China has failed again to convince U.S. index provider MSCI Inc to add local Chinese shares to its key emerging market index  and the company could not say when it was likely to give the green light  as global investors raised fresh objections. | Video ",
        "date": "06152016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI says domestic China shares still not ready for its global benchmark "
    },
    {
        "content": "By Anusha Ravindranath     June 15 Most Southeast Asian stocks rose on Wednesday as index provider MSCI's decision to not add domestic Chinese stocks to one of its key benchmarks boosted sentiment  even as investors waited for a signal from the U.S. Fed on interest rate increases this year.      U.S. index provider MSCI Inc on Tuesday declined to add domestic Chinese stocks to its Emerging Markets Index  delivering a blow to Chinese policymakers hoping to broaden the appeal of their ",
        "date": "06152016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "SE Asia Stocks-Higher on MSCI's decision on China shares; Fed move awaited "
    },
    {
        "content": "LONDON  June 15 Emerging market stocks snapped a four day-losing streak on Wednesday  as investors anticipated a soothing message later from the U.S. Federal Reserve to help settle the current outbreak of Brexit nerves.",
        "date": "06152016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "EMERGING MARKETS-Stocks snap 4-day losing streak  China shrugs off MSCI snub "
    },
    {
        "content": "June 15 Hong Kong shares rose on Wednesday  drawing optimism from a rebound in mainland markets  as investors there shrugged off MSCI's decision not to add mainland shares to one of its key benchmark indexes.",
        "date": "06152016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Hong Kong shares rise  getting cues from mainland rebound "
    },
    {
        "content": "DUBAI  June 15 Gulf stock markets were narrowly mixed in early trade on Wednesday with Saudi Arabia holding up despite disappointing news that MSCI did not put the country on a list for possible reclassification to emerging market status.",
        "date": "06152016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MIDEAST STOCKS-Gulf mixed  Saudi firm after MSCI disappointment "
    },
    {
        "content": "SHANGHAI China's stock market rose the most in two weeks on Wednesday  reversing from early losses as investors shrugged off MSCI's decision not to add mainland shares to one of its key benchmark indexes.",
        "date": "06152016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks rebound as investors shrug off MSCI 'nay' decision "
    },
    {
        "content": "SHANGHAI  June 15 China's stock market rose the most in two weeks on Wednesday  reversing from early losses as investors shrugged off MSCI's decision not to add mainland shares to one of its key benchmark indexes.",
        "date": "06152016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks rebound as investors shrug off MSCI \"nay\" decision "
    },
    {
        "content": "SHANGHAI  June 1 China stocks dipped on Wednesday following the previous day's sharp rally  as growing optimism about MSCI adding mainland stocks to its emerging markets index was offset by worries over China's economy and a looming U.S. rate hike.",
        "date": "06012016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "China stocks dip as investors take profit amid economic worry "
    },
    {
        "content": "* MSCI inclusion bets  China products demand push indexes higher",
        "date": "05312016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-China's stocks post biggest rise in 3 months on expected MSCI inclusion "
    },
    {
        "content": "SHANGHAI  June 1 China's major stock indexes opened mixed on Wednesday after posting their biggest gain in three months on Tuesday  on expectations U.S. market index provider MSCI could add mainland stocks to its emerging market benchmark for the first time.",
        "date": "06012016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks mixed at open after Tuesday rally "
    },
    {
        "content": "TOKYO  May 31 Japanese stocks rose for a fifth straight day on Tuesday as growing expectations of an imminent U.S. interest rate hike helped the dollar hold onto recent gains against the yen  supporting exporter shares.",
        "date": "05312016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Nikkei rises for 5th day on weak yen  MSCI index review drive volumes "
    },
    {
        "content": "* MSCI issue may cause stock selling near-end session - analyst     * Won set for the biggest monthly loss in 10 months      SEOUL  May 31 Shares in Seoul edged up on Tuesday but gains were capped by worries that the addition of more Chinese firms to MSCI's indexes could draw foreign investors away from South Korean equities.     U.S. index provider MSCI will significantly add to its China A index and include some Chinese firms' American Depository Receipts. The changes will be made ",
        "date": "05312016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "S.Korea stocks wobbly ahead of China MSCI index changes  won edges up "
    },
    {
        "content": "LONDON  May 26 West Africa's regional stock exchange  BRVM  expects the number of foreign investors active on the bourse to rise to triple digits once it is included in a key frontier market benchmark later in 2016  its chief executive officer said on Thursday.",
        "date": "05262016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "West Africa bourse CEO sees foreign investors increasing after MSCI inclusion "
    },
    {
        "content": "* MSCI Emerging Markets Index tracked by $1.5 trillion in funds",
        "date": "05192016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI fields sceptics and enthusiasts as China \"A\" share decision looms "
    },
    {
        "content": "LONDON  May 13 U.S. index provider MSCI will launch a consultation on whether to cut Bulgaria from its Frontier Markets index  and the firm plans to add Jamaica and the West African Economic and Monetary Union (WAEMU) Countries Index to the benchmark.",
        "date": "05132016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI may cut Bulgaria from Frontier index  add Jamaica  West Africa "
    },
    {
        "content": "LIMA  May 12 Index provider MSCI Inc on Thursday announced it will keep Southern Copper Corp   in its Peru group rather than moving it to its U.S. securities index  a move that will likely boost Lima's bourse.",
        "date": "05122016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 2-MSCI keeps Southern Copper in Peru index  pleasing bourse "
    },
    {
        "content": "May 12 U.S. index provider MSCI announced changes to a number of its index funds on Thursday  including adding four securities and removing one from its U.S. large-cap index.",
        "date": "05122016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "REFILE-UPDATE 1-MSCI announces changes to U.S.  China  emerging market indexes "
    },
    {
        "content": "May 12 U.S. index provider MSCI announced changes to a number of its index funds on Thursday  including adding four securities and removing one from its U.S. large-cap index. Additions to that group included Tyson Foods  Edwards Lifesceinces and Equinix  the three largest.",
        "date": "05122016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI announces changes to U.S.  China  emerging market indexes "
    },
    {
        "content": "LIMA  May 12 Index provider MSCI Inc  said on Thursday that it decided not to move Southern Copper Corp to its U.S. securities index  keeping it instead in its Peru index in a move that will likely boost the Lima bourse.",
        "date": "05122016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI says to keep Southern Copper in its Peru index "
    },
    {
        "content": "LAGOS  May 3 Nigerian stocks climbed to a five-week high on Tuesday after index provider MSCI said it would not change the status of Nigerian securities on its frontier index.",
        "date": "05032016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 2-Nigerian stocks hit 5-week high on MSCI index news "
    },
    {
        "content": "SINGAPORE  May 3 Appetite for socially responsible investments in Asia is growing but fund managers say there are still major obstacles that prevent more significant investment in such assets.",
        "date": "05032016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Asia funds say socially responsible investment faces major hurdles "
    },
    {
        "content": "April 28 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04282016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MOVES- BofA  MSCI  Liquidnet "
    },
    {
        "content": "* Says Kathleen Winters will succeed Bob Qutub as CFO  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04272016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "BRIEF-MSCI says Kathleen Winters appointed CFO "
    },
    {
        "content": "April 28 Index provider MSCI Inc said Kathleen Winters would replace Bob Qutub as chief financial officer  effective May 2.",
        "date": "04282016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MOVES-MSCI names Honeywell's Kathleen Winters as CFO "
    },
    {
        "content": "* Commodity currencies up vs U.S. dollar   (Updates with European shares close)",
        "date": "04192016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "GLOBAL MARKETS-Oil rises on Kuwait strike; global stock index highest since Dec "
    },
    {
        "content": "LONDON  April 19 Global stocks reached their highest levels since early December on Tuesday as oil prices rose  driven by a strike in Kuwait  and signs of economic stabilisation in China improved demand for risky assets.",
        "date": "04192016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "GLOBAL MARKETS-Stocks rise as strike in Kuwait lifts oil prices "
    },
    {
        "content": "LONDON  April 8 Index provider MSCI is seeking feedback from investors on the ease of access to the Nigerian equity market  a move that could lead to it being excluded from MSCI's Frontier Markets index.",
        "date": "04082016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI could exclude Nigeria from Frontier Markets index "
    },
    {
        "content": "LONDON  March 31 Index provider MSCI said on Thursday it would resume discussions with traders  funds and other financial market participants on including domestic China \"A\" shares in its benchmark emerging markets index.",
        "date": "03312016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI restarts talks on including China A shares in EM index "
    },
    {
        "content": "March 1 MSCI Inc appointed Jim Valente as global head of real estate  reporting to chief operating officer Baer Pettit.",
        "date": "03012016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MOVES-MSCI names Jim Valente global head of real estate "
    },
    {
        "content": "* BlackRock sees concerns over independent directors on HK boards",
        "date": "02232016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-Hong Kong's SFC sees no changes to shareholder warnings "
    },
    {
        "content": "HONG KONG  Feb 23 Hong Kong's securities regulator has no plans to change its system to warn investors of companies that have a high concentration of shareholders after MSCI Inc's move to exclude those shares from its global indices  the head of the regulator said on Tuesday.",
        "date": "02232016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Hong Kong see no changes to shareholder warnings after MSCI move-SFC "
    },
    {
        "content": "* Says QFII rule changes \"significant step\" to MSCI inclusion",
        "date": "02062016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI welcomes easing of China investor controls  raises liquidity concerns "
    },
    {
        "content": "HONG KONG MSCI will exclude from its global indices Hong Kong stocks that have been warned by the local regulator over their high concentration of shareholders  the benchmark provider said on Monday  in a blow to Hong Kong's reputation as a financial center.",
        "date": "02012016",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI to exclude some Hong Kong stocks with highly concentrated ownership "
    },
    {
        "content": "* MSCI: HK shareholding disclosure requirements insufficient   (Adds comment from Goldin Properties)",
        "date": "02012016",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "UPDATE 2-MSCI to exclude some Hong Kong stocks with highly concentrated ownership "
    },
    {
        "content": "Nov 16 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "11162015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MOVES- Nomura  MSCI  M&G  Martin Currie Asia "
    },
    {
        "content": "Nov 16 MSCI Inc appointed Alvise Munari managing director and head of client coverage in the EMEA region.",
        "date": "11162015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MOVES-MSCI appoints Alvise Munari managing director EMEA "
    },
    {
        "content": "DUBAI  Nov 14 Equity index compiler MSCI will add United Arab Emirates telecommunications operator Etisalat  and Qatar Gas Transport Co (Nakilat) to its emerging markets index  a statement on MSCI's website said.",
        "date": "11142015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-MSCI to include UAE's Etisalat  Qatar's Nakilat in EM index "
    },
    {
        "content": "NEW YORK  Nov 8 A few days after joining the board of Atlantic Power  private equity veteran Gilbert Palter said he got a flurry of calls from the energy company's top shareholders  who wanted more than just to wish him well.",
        "date": "11082015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "INSIGHT-Activist stampede pushes board directors into shareholders' arms "
    },
    {
        "content": "NEW YORK MSCI will add Alibaba Group  Baidu.com and a dozen other overseas-listed Chinese shares to its emerging market index beginning on Dec. 1  in a move that is expected to draw billions of dollars into the stocks and make MSCI the first indexer to include these shares.",
        "date": "11122015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI adds Alibaba  other U.S.-listed China shares to indexes "
    },
    {
        "content": "NEW YORK  Nov 11 China company stocks that trade on U.S.-listed exchanges were mostly higher on Thursday as investors awaited index provider MSCI's announcement to add some well-known company stocks to its emerging market indexes.",
        "date": "11122015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China's ADRs rise ahead of MSCI inclusion "
    },
    {
        "content": "LIMA  Nov 2 Peru's stock exchange is optimistic it will avoid a downgrade by index provider MSCI Inc  next year as at least two listed companies boost trading volume and start qualifying as \"emerging market\" securities  the bourse said on Monday.",
        "date": "11022015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "Peru bourse says to avoid MSCI downgrade to 'frontier' index "
    },
    {
        "content": "HONG KONG MSCI  will begin to add overseas-listed Chinese shares to its emerging market indexes this month  drawing billions of dollars into such stocks  which could eventually lead to mainland-listed companies finding their way into global equity portfolios.",
        "date": "11022015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Wary investors eye China's back-door entry into MSCI indexes "
    },
    {
        "content": "DUBAI  Oct 29 Saudi Arabia's stock market rebounded from near technical support on Thursday  encouraged by an effort to have it included in MSCI's emerging market index  while Egypt's bourse also edged up.",
        "date": "10292015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MIDEAST STOCKS-Saudi rebounds from near chart support  Egypt edges up "
    },
    {
        "content": "Oct 14 Portfolio management company MSCI Inc  said its board of directors has appointed C.D. Baer Pettit as chief operating officer and Diana Tidd as head of equity index products worldwide.",
        "date": "10142015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MOVES-MSCI names new COO  head of equity index products "
    },
    {
        "content": "LIMA  Sept 30 Index provider MSCI Inc  opted on Wednesday to keep Peru's bourse in its \"emerging market\" group but warned it might downgrade the stock exchange to a higher-risk \"frontier\" status in nine months if liquidity sinks further.",
        "date": "09302015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 2-MSCI to keep Peru bourse in 'emerging market' group for now "
    },
    {
        "content": "LIMA  Sept 30 MSCI Inc said on Wednesday it decided not to reclassify Peru's bourse as a \"frontier market\" from its current \"emerging market\" status but will reevaluate a potential downgrade to the higher-risk group next year.",
        "date": "09302015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI says to keep Peru bourse in 'emerging market' group for now "
    },
    {
        "content": "LIMA  Sept 8 Peru's bourse has a \"good chance\" of staying in MSCI Inc's emerging market category and avoiding a downgrade to a riskier status  the bourse's general manager said on Tuesday following preliminary talks with the index provider.",
        "date": "09092015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "Peru bourse sees 'good chance' of keeping emerging market status "
    },
    {
        "content": "NEW YORK U.S. index provider MSCI Inc  said on Tuesday that recent market gyrations in China and a barrage of interventions by the authorities to stop the rout will not be a factor in deciding whether to include China-listed shares in its Emerging Markets Index.",
        "date": "09022015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "Exclusive: MSCI says volatility won't impact China 'A shares' decision "
    },
    {
        "content": "HONG KONG  Aug 28 U.S. index provider MSCI Inc  said it would remove Hanergy Thin Film Power Group Ltd  from its indexes as the troubled Chinese solar company's shares had not traded for a long time.",
        "date": "08282015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI dumps troubled China solar company Hanergy from indexes "
    },
    {
        "content": "LIMA  Aug 19 Any downgrade of Peru's stock exchange to \"frontier market\" status by index provider MSCI Inc would likely trigger a capital outflow of $1.5 billion to $5 billion within three months  the head of Peru's bourse said on Wednesday.",
        "date": "08192015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "A Peru stock exchange downgrade would likely trigger large outflows -bourse "
    },
    {
        "content": "HONG KONG  July 17 Hanergy Thin Film Power Group Ltd said it may launch a judicial challenge to a decision by the Securities and Futures Commission (SFC) to suspend trading in its shares  saying the halt was not in the interest of shareholders or investors.",
        "date": "07172015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-Hanergy seeks to overturn regulator's share trading halt "
    },
    {
        "content": "LONDON Index provider MSCI on Tuesday asked for client feedback on whether it should follow its usual practice of waiting 40 days before taking action on Greece's stock market closure or if different treatment is justified.",
        "date": "07072015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "Index providers MSCI  FTSE seek feedback on Greek bourse closure  capital curbs "
    },
    {
        "content": "LONDON  July 7 Index provider MSCI on Tuesday asked for client feedback on whether it should follow its usual practice of waiting 40 days before taking action on Greece's stock market closure or if different treatment is justified.",
        "date": "07072015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "UPDATE 1-Index providers MSCI  FTSE seek feedback on Greek bourse closure  capital curbs "
    },
    {
        "content": "* Beijing using monetary policy  regulation to stem market slide",
        "date": "07052015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "RPT-China market meddling risks denting Beijing's international ambitions "
    },
    {
        "content": "* Beijing using monetary policy  regulation to stem market slide",
        "date": "07032015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "China market meddling risks denting Beijing's international ambitions "
    },
    {
        "content": "* Greece ETF also falls sharply   (Adds MSCI comment on Greece  updates ETF and ADR prices)",
        "date": "06292015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 2-Greek bonds and U.S.-listed equities slump as debt crisis worsens "
    },
    {
        "content": "LONDON Index provider MSCI said on Monday that the closure of the Athens stock market and the imposition of capital controls could lead to Greece's relegation from the benchmark emerging equity index and its reclassification as a \"standalone\" market.",
        "date": "06292015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Greece controls could relegate it to 'standalone' equity market - MSCI "
    },
    {
        "content": "LONDON  June 19 Index provider MSCI said on Friday it was monitoring investors' access to Greek equity markets and could change the country's status from emerging markets to \"standalone\" if any restrictions were introduced.",
        "date": "06192015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI could reclassify Greece \"standalone\" market if restrictions imposed "
    },
    {
        "content": "NEW YORK  June 15 Including Chinese mainland stocks in MSCI Inc's emerging markets index will have a significant impact for global investors in funds tied to the index given the weighting and volatility of the shares  a Reuters graphical data analysis shows.",
        "date": "06152015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "GRAPHIC-China A-shares will be gamechanger for emerging market benchmark "
    },
    {
        "content": "NEW YORK Including Chinese mainland stocks in MSCI Inc's emerging markets index will have a significant impact for global investors in funds tied to the index given the weighting and volatility of the shares  a Reuters graphical data analysis shows (See graphic http://graphics.thomsonreuters.com/15/msci/index.html ).",
        "date": "06162015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "China A-shares will be gamechanger for emerging market benchmark "
    },
    {
        "content": "NEW YORK  June 15 Including Chinese mainland stocks in MSCI Inc's emerging markets index will have a significant impact for global investors in funds tied to the index given the weighting and volatility of the shares  a Reuters graphical data analysis shows.",
        "date": "06162015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "RPT-GRAPHIC-China A-shares will be gamechanger for emerging market benchmark "
    },
    {
        "content": "LONDON  June 11 MSCI's decision not to include China's A-shares in its benchmark emerging markets equity index was the right move for investors  veteran emerging markets investor Mark Mobius said on Thursday.",
        "date": "06112015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "Templeton's Mobius says MSCI's decision on China A-shares was right "
    },
    {
        "content": "HONG KONG/SHANGHAI U.S. index provider MSCI Inc  has told China it must further liberalize its capital markets before it will include Chinese domestic shares in one of its global benchmarks  in a setback for Beijing's efforts to promote its currency and attract foreign capital. | Video ",
        "date": "06102015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI puts decision to include China 'A' shares in index on hold "
    },
    {
        "content": "HONG KONG  June 10 U.S.index provider MSCI Inc  said on Tuesday it will give investors a minimum of 12 months to prepare for China 'A' shares being included in one of its key benchmark indexes.",
        "date": "06092015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI to give investors at least a year to prepare for China 'A' shares "
    },
    {
        "content": "* Prospect of Fed rate hike  higher US bond yields hurt shares",
        "date": "06112015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "CORRECTED-GLOBAL MARKETS-Asia shares bounce from 3-mth lows but Fed  Greece weigh "
    },
    {
        "content": "* China seesaws after MSCI decides against inclusion   (Adds US equity futures)",
        "date": "06102015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "GLOBAL MARKETS-Bund yield hits 1 pct as stock markets halt sell-off "
    },
    {
        "content": "LONDON  June 10 Chinese stocks seesawed on Wednesday  buoyed by fresh stimulus hopes but knocked by MSCI's decision not to include them in its indexes  while other emerging markets received respite from a slight pullback in the dollar.",
        "date": "06102015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "EMERGING MARKETS-Easing dollar brings EM relief  China stocks seesaw on MSCI's No verdict "
    },
    {
        "content": "NEW YORK/SHANGHAI U.S. index provider MSCI Inc said on Tuesday it will hold off including China-listed shares in one of its key benchmark indexes  but expects them to be incorporated once outstanding market accessibility issues are resolved.",
        "date": "06092015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI delays including China 'A' shares' in benchmark index "
    },
    {
        "content": "NEW YORK/SHANGHAI  June 9 U.S. index provider MSCI Inc said on Tuesday it will hold off including China-listed shares in one of its key benchmark indexes  but expects them to be incorporated once outstanding market accessibility issues are resolved.",
        "date": "06092015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "CORRECTED-UPDATE 1-MSCI delays including China 'A' shares' in benchmark index "
    },
    {
        "content": "MUMBAI Indian shares rose more than 1 percent on Wednesday with the Nifty snapping its seven-day losing streak after U.S. index compiler MSCI Inc  delayed the inclusion of Chinese domestic shares in its emerging markets index.",
        "date": "06102015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "Nifty snaps seven-day losing streak on MSCI China A-shares delay "
    },
    {
        "content": "SHANGHAI  June 10 China stocks ended a volatile Wednesday session slightly lower  as investor disillusionment over MSCI's decision not to put mainland stocks in its global index and a coming tidal wave of listings dampened interest.",
        "date": "06102015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks end a see-saw day lower after MSCI disappointment "
    },
    {
        "content": "NEW YORK  June 9 U.S. index provider MSCI Inc  said on Tuesday it will hold off including China A shares in one of its key benchmarks  but expects them to be included once outstanding market accessibility issues are resolved.",
        "date": "06092015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI delays including China A shares for benchmark index "
    },
    {
        "content": "* Prospect of Fed rate hike  higher US bond yields hurt shares",
        "date": "06102015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "GLOBAL MARKETS-Asia shares bounce from 3-month lows but Fed  Greece weigh "
    },
    {
        "content": "* MSCI decides not to include mainland stocks into its indexes",
        "date": "06102015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks slip after MSCI's decision; Hong Kong up "
    },
    {
        "content": "HONG KONG/SHANGHAI  June 10 U.S. index provider MSCI Inc has told China it must further liberalise its capital markets before it will include Chinese domestic shares in one of its global benchmarks  in a setback for Beijing's efforts to promote its currency and attract foreign capital.",
        "date": "06102015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "UPDATE 3-MSCI puts decision to include China 'A' shares in index on hold "
    },
    {
        "content": "SHANGHAI  June 10 China stocks opened lower on Wednesday  after U.S. index provider MSCI Inc said it would hold off including China-listed shares in one of its key benchmark indexes  citing market accessibility issues.",
        "date": "06102015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks open down after MSCI decision to not include A shares in benchmark "
    },
    {
        "content": "* MSCI says not bound to June-June schedule on A share review",
        "date": "06012015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-MSCI to be flexible on review schedule for China A share inclusion "
    },
    {
        "content": "DUBAI  May 28 Qatar's bourse fell sharply on Thursday  driven by news of criminal investigations against FIFA soccer officials as well as by profit-taking after an upgrade of some stocks by index compiler MSCI. Most other Gulf markets were also soft.",
        "date": "05282015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MIDEAST STOCKS-Qatar falls further on FIFA probe  MSCI profit-taking "
    },
    {
        "content": "HONG KONG U.S.index provider MSCI Inc said on Tuesday it will give investors a minimum of 12 months to prepare for China 'A' shares being included in one of its key benchmark indexes.",
        "date": "06102015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI to give investors at least a year to prepare for China 'A' shares "
    },
    {
        "content": "* Ma'aden hits record high on bullish production  earnings outlook",
        "date": "05262015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MIDEAST STOCKS-Gulf moves little but Saudi's Ma'aden surges to record "
    },
    {
        "content": "* China A shares may be included in key benchmark in two years",
        "date": "05262015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "UPDATE 2-FTSE takes cautious steps to including China-listed shares in benchmark "
    },
    {
        "content": "DUBAI  May 26 Saudi Arabia's stock market rose in early trade on Tuesday  supported by industrial blue chips  while Egypt's bourse slipped as index compiler MSCI prepared to reduce the country's weighting in its emerging markets index.",
        "date": "05262015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "UPDATE 2-MIDEAST STOCKS-Almarai  Ma'aden lift Saudi; Egypt slips "
    },
    {
        "content": "DUBAI  May 13 Gulf equities may rise on Wednesday after oil prices jumped and index compiler MSCI upgraded several stocks from the United Arab Emirates  Qatar and Saudi Arabia. But Dubai builder Arabtec could fall after an unexpected first-quarter loss.",
        "date": "05132015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MIDEAST STOCKS-MSCI upgrades  firmer oil may lift Gulf markets "
    },
    {
        "content": "DUBAI  May 14 Most Gulf stock markets rose in early trade on Thursday  led by Qatar which was supported by the inclusion of two stocks in MSCI's emerging markets index  but Dubai construction firms fell after poor first-quarter earnings.",
        "date": "05142015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "UPDATE 1-MIDEAST STOCKS-Qatar MSCI picks extend gains; Dubai builders fall "
    },
    {
        "content": "* Investors hopeful that China stocks will be included in MSCI",
        "date": "05132015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "China stocks dip as IPO worries eclipse MSCI hopes; Hong Kong edges up "
    },
    {
        "content": "LONDON  May 8 Index provider MSCI  said on Friday that it would launch standalone equity indexes for Saudi Arabian stocks from June 1 along with a number of other regional benchmarks in the Middle East.",
        "date": "05082015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI to launch Saudi Arabia  GCC indexes on June 1 "
    },
    {
        "content": "* Saudi among last big bourses to allow direct foreign investment",
        "date": "04202015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "RPT-INVESTMENT FOCUS-Foreigners queue for opening of $500 bln Saudi bourse "
    },
    {
        "content": "* Saudi among last big bourses to allow direct foreign investment",
        "date": "04172015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "INVESTMENT FOCUS-Foreigners queue for opening of $500 bln Saudi bourse "
    },
    {
        "content": "HONG KONG  March 13 Leading global fund managers say China must make bolder market reforms before Chinese-listed shares can be included in key MSCI emerging market benchmark indexes.",
        "date": "03132015",
        "name": "MSCI Inc",
        "news_type": "topStory",
        "symbol": "MSCI",
        "title": "MSCI faces opposition to China inclusion in key index -sources "
    },
    {
        "content": "NEW YORK  Jan 16 Index provider MSCI Inc said it plans to change its rules to allow foreign-listed companies traded outside of their home countries to be included in its Global Investable Market Indexes.",
        "date": "01162015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "MSCI to allow overseas listings to be included in major indexes "
    },
    {
        "content": "NEW YORK  Jan 16 Index provider MSCI Inc said it plans to change its rules to allow foreign-listed companies traded outside of their home countries to be included in its Global Investable Market Indexes.",
        "date": "01162015",
        "name": "MSCI Inc",
        "news_type": "normal",
        "symbol": "MSCI",
        "title": "UPDATE 2-MSCI to allow overseas listings to be included in major indexes "
    }
]