[
    {
        "content": "BRUSSELS  Nov 10 ArcelorMittal  the world's largest producer of steel on Friday reported a better-than-expected core profit in the third quarter and said it was upbeat about 2018.",
        "date": "11102017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "UPDATE 1-ArcelorMittal upbeat about 2018 after strong third quarter "
    },
    {
        "content": "BRUSSELS EU antitrust regulators will investigate whether ArcelorMittal's  proposed purchase of Italian steel plant Ilva will lead to price hikes  a move likely to force the steelmaker to offer more concessions to address competition concerns.",
        "date": "11082017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "EU antitrust regulators to investigate ArcelorMittal-Ilva deal "
    },
    {
        "content": "BRUSSELS  Nov 8 EU antitrust regulators will investigate whether ArcelorMittal's proposed purchase of Italian steel plant Ilva will lead to price hikes  a move likely to force the steelmaker to offer more concessions to address competition concerns.",
        "date": "11082017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "UPDATE 2-EU antitrust regulators to investigate ArcelorMittal-Ilva deal "
    },
    {
        "content": "BRUSSELS  Nov 8 EU antitrust regulators opened a full-scale investigation on Wednesday into Luxembourg-based steelmaker ArcelorMittal's proposed purchase of Italian steel plant Ilva  saying they were worried the deal may reduce competition.",
        "date": "11082017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "EU antitrust regulators to investigate ArcelorMittal  Ilva deal "
    },
    {
        "content": "ROME  Oct 27 Italy has asked its sovereign wealth fund to consider investing in the country's biggest steelworks alongside global steelmaker ArcelorMittal to prevent competition regulators from sinking a deal to rescue the plant  sources said.",
        "date": "10272017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "Italy sovereign fund may step in to save steel factory deal -sources "
    },
    {
        "content": "BRUSSELS Luxembourg-based steelmaker ArcelorMittal  has offered concessions in a bid to allay EU antitrust concerns over its planned takeover of Italian steel plant Ilva  a filing on the European Commission website showed on Thursday.",
        "date": "10192017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "ArcelorMittal offers EU concessions over Ilva "
    },
    {
        "content": "BRUSSELS  Oct 17 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10172017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "EU mergers and takeovers (Oct 17) "
    },
    {
        "content": "    ALMATY  Oct 17 Kazakhstan's January-September refined copper output rose 2.9 percent year-on-year and crude steel output jumped 8.7 percent  while refined zinc production inched up 0.1 percent  Statistics Committee data showed on Tuesday.     London-listed copper miner KAZ Minerals and Glencore's Kazzinc account for a large part of Kazakhstan's metals production.     ArcelorMittal owns the country's only major steel plant in Temirtau.     The Statistics Committee provided the fol",
        "date": "10172017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "TABLE-Kazakhstan's Jan-Sept copper  steel  zinc output rises "
    },
    {
        "content": "BERLIN  Oct 5 Labour bosses at Germany's Thyssenkrupp said workers' legal say in strategic decisions at the corporate level could be diluted in the planned holding structure for the new venture with India's Tata Steel .",
        "date": "10052017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "Thyssenkrupp unions fear loss of rights in Tata deal structure "
    },
    {
        "content": "MEXICO CITY  Sept 28 The world's largest steelmaker  ArcelorMittal  will invest $1 billion in Mexico over the next three years  the company's board chairman Lakshmi Mittal said on Thursday. (Reporting by Ana Isabel Martinez; editing by Diane Craft)",
        "date": "09282017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "ArcelorMittal plans $1 bln Mexico investment by 2020 -board chairman "
    },
    {
        "content": "MILAN An Italian judge has ordered the seizure of a power plant run by Italy's biggest utility Enel in the south of the country as part of an investigation into illegal waste  the company said on Thursday.",
        "date": "09282017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "Enel power plant seized in illegal waste investigation "
    },
    {
        "content": "NEW DELHI ArcelorMittal's interest in buying debt-ridden Indian steel companies could derail its planned $1 billion joint venture with Steel Authority of India Ltd (SAIL)  a steel ministry report showed.",
        "date": "09262017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "ArcelorMittal's focus on other assets may hit $1 billion Indian JV "
    },
    {
        "content": "FRANKFURT  Sept 24 Thyssenkrupp AG is to set up a joint working group of board members and labour representatives to help implement the plan to merge with Tata Steel  it said in a statement published on Sunday after a supervisory board meeting.",
        "date": "09232017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "UPDATE 1-Thyssenkrupp to set up working group with unions over Tata Steel merger "
    },
    {
        "content": "NEW DELHI  Sept 26 ArcelorMittal's interest in buying debt-ridden Indian steel companies could derail its planned $1 billion joint venture with Steel Authority of India Ltd (SAIL)  a steel ministry report showed.",
        "date": "09262017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "ArcelorMittal's focus on other assets may hit $1 bln Indian JV "
    },
    {
        "content": "BRUSSELS  Sept 22 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09222017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "EU mergers and takeovers (Sept 22) "
    },
    {
        "content": "BOCHUM  Germany  Sept 22 Several thousand steelworkers took to the streets of Bochum in Germany's industrial heartland on Friday to protest against the planned merger of the European steel units of Thyssenkrupp and Tata Steel.",
        "date": "09222017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "Germany steel workers protest over Thyssen-Tata steel merger plan "
    },
    {
        "content": "BRUSSELS EU competition regulators will decide by Oct. 26 whether to clear Luxembourg-based steelmaker ArcelorMittal's  acquisition of Italian steel plant Ilva  the European Commission said on Friday.",
        "date": "09222017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "EU regulators to rule on ArcelorMittal's buy of Ilva by October 26 "
    },
    {
        "content": "* Global steel graphic: http://tmsnrt.rs/2xRzVMY (Updates with investor comments  details  rewrites throughout)",
        "date": "09202017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "UPDATE 6-Thyssenkrupp  Tata Steel agree to forge Europe's No. 2 steelmaker "
    },
    {
        "content": "* Thyssenkrupp  Kloeckner say were not searched (Adds ArcelorMittal  German steel federation)",
        "date": "09042017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "UPDATE 2-German cartel office deepens steel investigation  searches firms "
    },
    {
        "content": "SAO PAULO A body of Brazil's antitrust watchdog Cade has recommended the rejection of ArcelorMittal SA's proposed acquisition of Votorantim Siderurgia SA  saying the tie-up would impact competition in the nation's long steel market.",
        "date": "09052017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "Brazil watchdog arm recommends rejecting ArcelorMittal-Votorantim tie-up "
    },
    {
        "content": "SAO PAULO  Sept 5 A body of Brazil's antitrust watchdog Cade has recommended the rejection of ArcelorMittal SA's proposed acquisition of Votorantim Siderurgia SA  saying the tie-up would impact competition in the nation's long steel market.",
        "date": "09052017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "UPDATE 1-Brazil watchdog arm recommends rejecting ArcelorMittal-Votorantim tie-up "
    },
    {
        "content": "FRANKFURT/DUESSELDORF Germany's competition regulator said on Monday it has widened an investigation into a suspected violation of antitrust laws in the steel industry  with ArcelorMittal and Salzgitter confirming searches at some of their units.",
        "date": "09052017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "German cartel office deepens steel investigation  searches firms "
    },
    {
        "content": "BRUSSELS  July 27 ArcelorMittal  the world's largest steel producer   raised its outlook for global steel demand on Thursday  as it expected the Chinese industry to return to growth  but said cheap imports continued to hurt its business.",
        "date": "07272017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "UPDATE 1-ArcelorMittal sees higher steel demand  but fears imports "
    },
    {
        "content": "LUXEMBOURG The European Court of Justice on Wednesday ruled against steelmaker ArcelorMittal's challenge against how the European Union allocates free carbon permits.",
        "date": "07262017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "EU top court rules against ArcerlorMittal carbon challenge "
    },
    {
        "content": "* REG-BEKAERT AND ARCELORMITTAL SUCCESSFULLY CLOSE SUMARÉ DEAL",
        "date": "06222017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "BRIEF-Bekaert and ArcelorMittal successfully close Sumaré deal "
    },
    {
        "content": "ROME The Italian government supports a joint bid by ArcelorMittal and Marcegaglia group for the polluted Ilva steel plant in southern Italy  the Industry Ministry said on Monday.",
        "date": "06052017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "Italy backs ArcelorMittal bid for polluted Ilva steel plant "
    },
    {
        "content": "ROME  June 5 The Italian government supports a joint bid by ArcelorMittal and Marcegaglia group for the polluted Ilva steel plant in southern Italy  the Industry Ministry said on Monday.",
        "date": "06052017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "UPDATE 1-Italy backs ArcelorMittal bid for polluted Ilva steel plant "
    },
    {
        "content": "ROME  June 5 The Italian government is backing a joint bid by ArcelorMittal and Italian group Marcegaglia for the troubled Ilva steel plant in the south of the country  the Industry Ministry said on Monday.",
        "date": "06052017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "Italy backs ArcelorMittal bid for troubled Ilva steel plant "
    },
    {
        "content": "MEXICO CITY ArcelorMittal  the world's largest steelmaker  will invest $1 billion in Mexico over the next three years  in part to boost its North American trade operations  the company said on Thursday.",
        "date": "09292017",
        "name": "ArcelorMittal",
        "news_type": "topStory",
        "symbol": "MT",
        "title": "ArcelorMittal plans $1 billion Mexico investment by 2020: chairman "
    },
    {
        "content": "MEXICO CITY  Sept 28 ArcelorMittal  the world's largest steelmaker  will invest $1 billion in Mexico over the next three years  in part to boost its North American trade operations  the company said on Thursday.",
        "date": "09292017",
        "name": "ArcelorMittal",
        "news_type": "normal",
        "symbol": "MT",
        "title": "UPDATE 2-ArcelorMittal plans $1 bln Mexico investment by 2020 -chairman "
    }
]