[
    {
        "content": "* Vail Resorts reports fiscal 2017 fourth quarter and full year results and provides fiscal 2018 outlook",
        "date": "09282017",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts reports fiscal 2017 Q4 and full year results and provides fiscal 2018 outlook "
    },
    {
        "content": "* Expect that fiscal year 2017 resort reported EBITDA will be in top half of guidance range issued on March 10  2017 Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts provide fiscal year 2017 guidance update "
    },
    {
        "content": "* Vail Resorts reports fiscal 2017 second quarter results and increases quarterly dividend by 30%",
        "date": "03102017",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts reports Q2 revenue of $725.2 million "
    },
    {
        "content": "* Renewal of Whistler Blackcomb's master development agreements with province of British Columbia  approval of associated master plans",
        "date": "02242017",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail resorts renews Whistler Blackcomb's master development agreements with province of British Columbia "
    },
    {
        "content": " (In this Feb. 21 story  corrects location of Vail Resorts Inc to Broomfield  Colorado  instead of Brookfield)",
        "date": "02232017",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "AIG reaches $50 million pact to sell Vermont ski slope "
    },
    {
        "content": "Feb 21 Insurance giant American International Group Inc has reached a deal to sell one of its lesser-known assets: a northern Vermont ski slope.",
        "date": "02232017",
        "name": "Vail Resorts Inc",
        "news_type": "normal",
        "symbol": "MTN",
        "title": "CORRECTED-AIG reaches $50 mln pact to sell Vermont ski slope "
    },
    {
        "content": "* Vail Resorts reports certain ski season metrics for the season-to-date period ended January 8  2017",
        "date": "01132017",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts reports certain ski season metrics for the season-to-date period ended Jan. 8  2017 "
    },
    {
        "content": "* Announced sale of inn at Keystone to Dallas-based Realty Capital Partners",
        "date": "11172016",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts sells inn to Realty Capital Partners for $6.4 mln "
    },
    {
        "content": "* Vail Resorts -on Oct. 14  its unit entered into amendment of existing seventh amended & restated credit arrangement agreement  dated as of May 1  2015  Source text for Eikon: [ID:http://bit.ly/2dv4a0L] Further company coverage:",
        "date": "10172016",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts -enters into credit arrangement agreement "
    },
    {
        "content": "* Whistler Blackcomb shareholders approve strategic combination with Vail Resorts",
        "date": "10062016",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Whistler Blackcomb says co's shareholders approve strategic combination with Vail Resorts "
    },
    {
        "content": "* Vail Resorts and Whistler Blackcomb announce approval from supreme court of British Columbia and exchange rate adjustment",
        "date": "10072016",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts  Whistler Blackcomb announce approval from supreme court of British Columbia "
    },
    {
        "content": "* Vail Resorts reports fiscal 2016 fourth quarter and full year results and provides fiscal 2017 outlook",
        "date": "09262016",
        "name": "Vail Resorts Inc",
        "news_type": "normal",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts reports Q4 loss per share $1.80 "
    },
    {
        "content": "* Vail Resorts and Whistler Blackcomb strategic combination receives competition bureau clearance",
        "date": "09232016",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts  Whistler Blackcomb strategic combination gets competition bureau clearance "
    },
    {
        "content": "Vail Resorts Inc said it would buy Whistler Blackcomb Holdings Inc  operator of the ski resort that was a venue for the 2010 Olympic Winter Games  for about C$1.39 billion ($1.06 billion) to expand its mountain resort chain into Canada.",
        "date": "08082016",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "Vail to buy Canadian ski resort operator Whistler Blackcomb "
    },
    {
        "content": "* Whistler  Vail shares touch record highs   (Adds CEO comments  updates shares)",
        "date": "08082016",
        "name": "Vail Resorts Inc",
        "news_type": "normal",
        "symbol": "MTN",
        "title": "UPDATE 4-Vail to buy Canadian ski resort operator Whistler Blackcomb "
    },
    {
        "content": "Aug 8 Vail Resorts Inc said it would buy Whistler Blackcomb Holdings Inc  operator of a year-round mountain resort in British Columbia  for about C$1.39 billion ($1.06 billion).",
        "date": "08082016",
        "name": "Vail Resorts Inc",
        "news_type": "normal",
        "symbol": "MTN",
        "title": "Vail Resorts to buy Whistler Blackcomb "
    },
    {
        "content": "* Vail Resorts and Whistler Blackcomb agree to strategic combination",
        "date": "08082016",
        "name": "Vail Resorts Inc",
        "news_type": "normal",
        "symbol": "MTN",
        "title": "BRIEF-Vail and Whistler Blackcomb agree to strategic combination "
    },
    {
        "content": "* Net income attributable to Vail resorts  inc. Was $157.6 million for q3 of fiscal 2016  representing an 18.2% increase",
        "date": "06092016",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts qtrly EPS $4.23 "
    },
    {
        "content": "* Rockresorts announces termination of management agreement for half moon",
        "date": "04152016",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Rockresorts announces termination of management agreement for Half Moon "
    },
    {
        "content": "* Vail resorts reports certain ski season metrics for the season-to-date period ended April 10  2016",
        "date": "04142016",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "BRIEF-Vail Resorts reports certain ski season metrics for season-to-date period ended April 10 "
    },
    {
        "content": "SYDNEY  March 31 New York-listed Vail Resorts  will buy the largest mountain resort in Australia for $136 million in what will be its first international acquisition  the company said on Tuesday.",
        "date": "03302015",
        "name": "Vail Resorts Inc",
        "news_type": "normal",
        "symbol": "MTN",
        "title": "Vail Resorts buys Australia's largest mountain resort "
    },
    {
        "content": "SYDNEY New York-listed Vail Resorts  on Tuesday said it would buy the largest mountain resort in Australia for $136 million  in its first international acquisition.",
        "date": "03312015",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "Vail Resorts buys Australia's largest mountain resort "
    },
    {
        "content": "Here are some facts and figures of the 2015 Alpine World Ski Championships that will be held from Feb. 2-15 in Vail/Beaver Creek  Colorado.",
        "date": "01302015",
        "name": "Vail Resorts Inc",
        "news_type": "topStory",
        "symbol": "MTN",
        "title": "Factbox: 2015 alpine skiing world championships "
    }
]