[
    {
        "content": "* Books gains from release of bad loan provisions for first half",
        "date": "11142017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "UPDATE 1-MUFG Q2 profit jumps on smaller bad loan costs  stock sales "
    },
    {
        "content": "* Lender will open Saudi Arabia office (adds details of new hires  plans on expansion of other offices in Europe)",
        "date": "11132017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "UPDATE 1-Japan's MUFG hires 180 staff in London in Europe expansion drive "
    },
    {
        "content": "JAKARTA  Nov 10 Indonesia's financial services authority (OJK) confirmed on Friday that Mitsubishi UFJ Financial Group (MUFG) is interested in buying a stake in Bank Danamon Indonesia",
        "date": "11102017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Indonesian regulator confirms Japan’s MUFG eyeing Bank Danamon stake "
    },
    {
        "content": "NEW YORK Japan's Mitsubishi UFJ Financial Group Inc (MUFG)  has received approval from the U.S. Office of the Comptroller of the Currency (OCC) to convert state-supervised branches into federally regulated ones  a U.S. spokesman for the bank confirmed late on Tuesday.",
        "date": "11082017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Exclusive: Japan's MUFG gets nod to bring U.S. state branches under federal regulation "
    },
    {
        "content": "TOKYO  Nov 14 Mitsubishi UFJ Financial Group (MUFG) on Tuesday reported a 27.8 percent rise in net profit for the six months ended September  as smaller bad loan costs and gains from selling equity holdings helped offset a weak lending business.",
        "date": "11142017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MUFG 6-month profit jumps on smaller bad loan costs  stock sales "
    },
    {
        "content": "LONDON  Nov 13  Japan's Mitsubishi UFJ Financial Group (MUFG) is hiring staff in London in a drive to expand its investment banking operations across Europe  the Middle East and Africa (EMEA) and boost income outside its home market  a senior executive said.",
        "date": "11132017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan's MUFG hires 180 staff in London in Europe expansion drive "
    },
    {
        "content": "NEW YORK Mitsubishi UFJ Financial Group Inc (MUFG)  on Wednesday sued New York’s banking regulator to stop its effort to continue to supervise Japan's largest lender after it switched its state branches to federal oversight this week  according to court filings.",
        "date": "11102017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan's MUFG sues New York regulator over bank's oversight shift "
    },
    {
        "content": "TOKYO/SINGAPORE Mitsubishi UFJ Financial Group (MUFG)  is in talks to buy a 40 percent stake in Bank Danamon Indonesia  for around 200 billion yen ($1.75 billion)  a person with direct knowledge of the talks told Reuters on Thursday.",
        "date": "11092017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Japan's MUFG seeks $1.8 billion Bank Danamon stake in southeast Asia push: sources "
    },
    {
        "content": "* To buy back up to 1.5 percent of own shares worth 100 billion yen",
        "date": "11142017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "BRIEF-Japan's MUFG says to buy back up to 1.5 percent of own shares worth 100 billion yen "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Japan’s largest lender is banking on an easier ride in Indonesia. Buying into Bank Danamon would nicely round out the regional presence of the $87 billion Mitsubishi UFJ Financial Group. And when it comes to both price and politics  MUFG looks better placed than the Southeast Asian group’s previous suitor.",
        "date": "11132017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Breakingviews - MUFG banks on an easy ride in Indonesia "
    },
    {
        "content": "* MUFG in early talks with Temasek  Danamon's biggest shareholder",
        "date": "11092017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "UPDATE 4-Japan's MUFG seeks $1.8 bln Bank Danamon stake in SE Asia push -sources "
    },
    {
        "content": "JAKARTA  Nov 9 Bank Danamon Indonesia said on Thursday its controlling shareholder had received an \"expression of interest\" related to its shareholding in the company.",
        "date": "11092017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Indonesia's Bank Danamon says \"expression of interest\" received for stake "
    },
    {
        "content": "* Report that it is considering stake in Indonesia's Bank Danamon not something it announced Source text for Eikon: Further company coverage: (Reporting by Minami Funakoshi)",
        "date": "11092017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "BRIEF-Japan's MUFG: Report that it is considering stake in Indonesia's Bank Danamon not something it announced "
    },
    {
        "content": "TOKYO  Nov 9 The core unit of Mitsubishi UFJ Financial Group (MUFG) is looking at buying a stake of about 40 percent in Bank Danamon Indonesia for around $1.75 billion as part of its plans to expand in Southeast Asia  the Nikkei business daily reported.",
        "date": "11092017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MUFG may buy 40 pct of Indonesia's Bank Danamon for $1.75 bln -Nikkei "
    },
    {
        "content": "* Says Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"A+\" -R&I",
        "date": "10272017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-R&I affirms Mitsubishi UFJ Financial Group's rating at \"A+\" and says stable outlook - R&I "
    },
    {
        "content": "TOKYO  Oct 19 The chief executive of Japan's largest bank expects new business opportunities to appear as digital currencies allow collection of data on how people use their money.",
        "date": "10192017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan finance sector to reap digital currency benefits  says MUFG chief "
    },
    {
        "content": "Oct 18 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10182017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES- AMP Capital  MUFG "
    },
    {
        "content": "TOKYO  Oct 12 Japan's Mitsubishi UFJ Financial Group Inc (MUFG) plans to automate 30 percent of operations at its core banking unit by 2024  using software robots and artificial intelligence for paperwork that would otherwise take 9 500 employees to process.",
        "date": "10112017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan's MUFG to automate operations to free bankers for wealthy clients "
    },
    {
        "content": "* Mitsubishi Ufj Financial Group sold its entire stake of 412 million CIMB shares via overnight block trade Source text :(http://bit.ly/2ycVjZ0) Further company coverage: (bangalore.newsroom@thomsonreuters.com)",
        "date": "09202017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-CIMB Group Holdings says Mitsubishi Ufj Financial Group sold its entire CIMB stake "
    },
    {
        "content": "HONG KONG  Sept 19 Mitsubishi UFJ Financial Group Inc (MUFG) launched the sale of up to $620 million of shares in CIMB Group Holdings Bhd  selling its remaining stake in Malaysia's No.2 lender by assets  IFR reported on Tuesday  citing a term sheet for the transaction.",
        "date": "09192017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG to sell remaining CIMB stake in up to $620 mln deal-IFR "
    },
    {
        "content": "Sept 15 Mitsubishi UFJ Financial Group Inc appointed Franck Viort as head of insurance coverage at its EMEA financial institutions group  starting from October.",
        "date": "09152017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG names new insurance coverage head at EMEA financial institutions unit "
    },
    {
        "content": "TOKYO Japan's Mitsubishi UFJ Financial Group Inc (MUFG) said it has picked Amsterdam as its European Union investment banking base  as financial institutions prepare for Britain's exit from the EU.",
        "date": "09132017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Japan's MUFG says picks Amsterdam as EU investment banking base "
    },
    {
        "content": "TOKYO  Sept 13 Japan's Mitsubishi UFJ Financial Group Inc (MUFG) has picked Amsterdam as its European Union investment banking base  sources with direct knowledge of the matter said on Wednesday  as global financial institutions prepare for Britain's exit from the EU in 2019.",
        "date": "09132017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan's MUFG picks Amsterdam as its EU investment banking base "
    },
    {
        "content": "TOKYO Japan's Toshiba Corp sold $58.5 million worth of shares in Mitsubishi UFJ Financial Group on Wednesday  a source told Reuters  as the conglomerate struggles with losses from its bankrupt U.S. nuclear business.",
        "date": "08232017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Toshiba sells $58.5 million in shares of Mitsubishi UFJ: source "
    },
    {
        "content": "TOKYO  Aug 23 Japan's Toshiba Corp sold $58.5 million worth of shares in Mitsubishi UFJ Financial Group on Wednesday  a source told Reuters  as the conglomerate struggles with losses from its bankrupt U.S. nuclear business.",
        "date": "08232017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Toshiba sells $58.5 mln in shares of Mitsubishi UFJ - source "
    },
    {
        "content": "Aug 16 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "08162017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES- MUFG  Maven Capital  Standard Chartered "
    },
    {
        "content": "Aug 16 Mitsubishi UFJ Financial Group Inc   Japan's largest lender by assets  named Sanjiv Vohra to co-head its global corporate banking division in Asia and Oceania.",
        "date": "08162017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MOVES-MUFG names Sanjiv Vohra to co-head corporate banking in Asia & Oceania "
    },
    {
        "content": "* Gains from equity holdings  smaller bad loan costs boost profit",
        "date": "08012017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "UPDATE 1-MUFG Q1 profit surges on sales of equity holdings  lower bad loan costs "
    },
    {
        "content": "TOKYO  Aug 1 Mitsubishi UFJ Financial Group (MUFG) reported a 53 percent rise in quarterly profit  boosted by gains from sales of its equity holdings  although lending remained weak in a low interest rate environment.",
        "date": "08012017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MUFG Q1 profit jumps on sales of equity holdings "
    },
    {
        "content": "* Mitsubishi UFJ financial group cuts deemed interest in co to 4.9958 percent from 5.035 percent Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Noble Group says Mitsubishi UFJ Financial Group cuts deemed interest in Co "
    },
    {
        "content": "TOKYO  July 11 Mitsubishi UFJ Financial Group (MUFG) may disclose information on so-called special advisors - all former top executives - and clarify the work they do  as part of its efforts to improve corporate governance  sources at the bank with direct knowledge of the matter said.",
        "date": "07112017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "CORRECTED-Japan MUFG may disclose information on advisors in governance drive -sources "
    },
    {
        "content": "HONG KONG  July 7 Mitsubishi UFJ Financial Group Inc (MUFG) aims to tap into the expertise of partner Morgan Stanley and expand into wealth management  as Japan's biggest bank looks for new sources of revenue  its chief financial officer said on Friday.",
        "date": "07072017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan's MUFG to leverage Morgan Stanley expertise in wealth management foray "
    },
    {
        "content": "* Sees overseas sales contribution rising to 50 pct from 40 pct (Adds overseas business context  plans to change BTMU name)",
        "date": "07072017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "UPDATE 1-Japan's MUFG to leverage Morgan Stanley expertise in wealth management foray "
    },
    {
        "content": "LONDON  June 29 (IFR) - Mitsubishi UFJ Financial Group has hired former BNP Paribas banker Julian van Kan to head its financial institutions for Europe  Middle East and Africa.",
        "date": "06292017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG hires van Kan for EMEA FIG "
    },
    {
        "content": "June 26 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06262017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-Mitsubishi UFJ  Citigroup  Societe Generale  Wells Fargo "
    },
    {
        "content": "* Says it will retire 141.2 million shares of its common stock on July 20",
        "date": "06222017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF- Mitsubishi UFJ Financial Group to retire treasury shares "
    },
    {
        "content": "TOKYO Mitsubishi UFJ Financial Group Inc  said Takashi Oyamada  chief executive of its core banking unit  would step down for health reasons  disrupting a well-planned succession plan at Japan's largest lender by assets.",
        "date": "05242017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Head of core MUFG unit to resign for health reasons "
    },
    {
        "content": "TOKYO  May 24 Mitsubishi UFJ Financial Group Inc on Wednesday said Takashi Oyamada  chief executive of core banking unit Bank of Tokyo-Mitsubishi UFJ (BTMU)  would step down on June 14.",
        "date": "05242017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan's MUFG says head of its core banking unit will step down "
    },
    {
        "content": "* Says it will fully acquire Mitsubishi UFJ NICOS Co Ltd  through stock swap",
        "date": "05152017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Mitsubishi UFJ Financial Group to fully acquire Mitsubishi UFJ NICOS Co Ltd "
    },
    {
        "content": "TOKYO  May 15 Mitsubishi UFJ Financial Group (MUFG) said on Monday net profit fell 2.6 percent for the year ended in March  hurt by weak lending income.",
        "date": "05152017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan bank MUFG's annual profit down 2.6 pct on weak domestic lending "
    },
    {
        "content": "DUBAI  March 29 Mitsubishi UFJ Financial Group (MUFG) expects double-digit growth in its project finance business in the Middle East in 2017  driven partly by Saudi Arabia's efforts to reduce its dependence on oil  the bank's co-head in the region Elyas Algaseer said.",
        "date": "03292017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Mitsubishi UFJ optimistic on Saudi project finance  Aramco IPO role "
    },
    {
        "content": "March 27 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03272017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG  JP Morgan Asset Management  Walker Crips "
    },
    {
        "content": "* Says with the absorption-type company split  of which plan was disclosed on Jan. 24  co's wholly-owned subsidiary Mitsubishi UFJ Trust and Banking Corporation will issue its new 9 474 925 ordinary shares to co",
        "date": "03242017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Mitsubishi UFJ Financial Group updates on simplified absorption-type company split "
    },
    {
        "content": "March 27 Mitsubishi UFJ Financial Group Inc  named Louis L'Heureux head of financial sponsors for its leveraged finance division in the Europe  Middle East and Africa (EMEA) region.",
        "date": "03272017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "CORRECTED-MOVES-MUFG names new head of financial sponsors for EMEA leveraged finance unit "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  February 15 (Fitch) Fitch Ratings has assigned Japan-based Mitsubishi UFJ  Financial Group  Inc.'s (MUFG  A/Negative) USD2.5bn senior unsecured notes a  final rating of 'A'.  The notes are likely to be issued on 22 February 2017 and are expected to count  towards MUFG's total loss-absorption capacity (TLAC) requirements  which have  been set by the Financial Stability Board at 16% of its risk-weighted assets   effective 1 January",
        "date": "02162017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Fitch Assigns MUFG's Senior Unsecured Notes 'A' Final Rating "
    },
    {
        "content": "LONDON  Feb 9 The Bank of England has fined two units of Japanese bank Mitsubishi UFJ Financial Group a record 26.77 million pounds ($33.62 million) for failing to tell the British regulator about a U.S. enforcement case.",
        "date": "02092017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "UPDATE 1-BoE fines Mitsubishi UFJ units for poor communication "
    },
    {
        "content": "Feb 6 Mitsubishi UFJ Financial Group (MUFG)  hired Anne Gebuhrer to head its European Financial Institutions Debt Capital Markets (DCM).",
        "date": "02062017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG Securities names Anne Gebuhrer executive director of EMEA "
    },
    {
        "content": "LONDON  Feb 6 (IFR) - Anne Gebuhrer has been appointed as head of European financial institutions debt capital markets at Mitsubishi UFJ Financial Group  according to a company statement.",
        "date": "02062017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Gebuhrer re-emerges to head FIG DCM at MUFG "
    },
    {
        "content": "FRANKFURT Allianz  and Japanese bank Mitsubishi UFJ Financial Group (MUFG)  have invested in a U.S.-based wind park owned by French utility EDF   Allianz said  as the German insurer expands its renewables portfolio.",
        "date": "02022017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Allianz  Japan's MUFG invest in EDF-owned U.S. wind park "
    },
    {
        "content": "* Profit helped by lower bad loan costs and share holdings sale",
        "date": "02032017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "UPDATE 2-MUFG posts higher Q3 profit on share holding sale; lending still bleak "
    },
    {
        "content": "FRANKFURT  Feb 2 Allianz and Japanese bank Mitsubishi UFJ Financial Group (MUFG) have invested in a U.S.-based wind park owned by French utility EDF   Allianz said  as the German insurer expands its renewables portfolio.",
        "date": "02022017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "CORRECTED-Allianz  Japan's MUFG invest in EDF-owned U.S. wind park "
    },
    {
        "content": "TOKYO  Feb 3 Mitsubishi UFJ Financial Group  on Friday reported a 7.7 percent drop in profits for the nine months ended December  joining other Japanese banks who have also posted weak results for the period as low interest rates dragged on lending incomes.",
        "date": "02032017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MUFG 9-month net profit falls 7.7 pct  low interest rates drag "
    },
    {
        "content": "Mitsubishi UFJ Financial Group appointed Stuart Randell and Anders Maehre to the leveraged finance team in its EMEA investment banking unit.",
        "date": "01272017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG hires two PWC executives to EMEA investment banking team "
    },
    {
        "content": "ISTANBUL  Jan 26 Turkey's banking regulator has granted the local arm of Japanese lender Mitsubishi UFJ Financial Group permission to give support and advisory services for some credit transactions  the government said in its Official Gazette on Thursday.",
        "date": "01262017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Turkey gives Japan's Mitsubishi UFJ permission for local advisory services "
    },
    {
        "content": "Jan 26 Mitsubishi UFJ Financial Group  appointed Stuart Randell and Anders Maehre to the leveraged finance team in its EMEA investment banking unit.",
        "date": "01272017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "CORRECTED-MOVES-MUFG hires two PWC execs to EMEA investment banking team "
    },
    {
        "content": "Jan 18 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01182017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-BTIG  Willis Towers Watson  BlueBay Asset  MUFG "
    },
    {
        "content": "Jan 18 Mitsubishi UFJ Financial Group (MUFG)  appointed Phil Roberts to lead investment banking in EMEA  and Phillip Hall to head the structured finance business in the region.",
        "date": "01182017",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MOVES-MUFG names new EMEA investment banking  structured finance heads "
    },
    {
        "content": "Nov 21 Mitsubishi UFJ Financial Group (MUFG)  named Christopher Marks managing director and head of emerging markets  EMEA  in its banking arm.",
        "date": "11212016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG names Christopher Marks head of emerging markets  EMEA "
    },
    {
        "content": "TOKYO  Nov 14 Mitsubishi UFJ Financial Group (MUFG) reported an 18.2 percent decline in its first-half profit  its first such fall in four years  hurt by the Bank of Japan's negative interest rate policy which has further squeezed loan margins.",
        "date": "11142016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG first-half profit slides as negative rates hurt loan business "
    },
    {
        "content": "* Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"A+\" -R&I",
        "date": "11042016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-R&I affirms Mitsubishi UFJ Financial Group Inc's rating at \"A+\" and announces stable outlook -R&I "
    },
    {
        "content": "TOKYO  Nov 8 Mitsubishi UFJ Financial Group  (MUFG) is planning to set up a back-office centre in Manila to handle operations for Asia outside Japan  sources with direct knowledge of the matter said.",
        "date": "11082016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG plans Asia back-office centre in Manila - sources "
    },
    {
        "content": "Oct 26 Mitsubishi UFJ Financial Group Inc  has launched a new business in the Americas to help airlines and other companies finance the purchase of planes  company executives told Reuters.",
        "date": "10262016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan's MUFG launches aviation finance business in the Americas "
    },
    {
        "content": "TOKYO Mitsubishi UFJ Financial Group  is in talks to buy a mutual fund administration business from Shinkin Central Bank  for about 10 billion yen ($95.5 million)  a source with direct knowledge of the matter said on Monday.",
        "date": "10312016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG to buy mutual fund administration business: source "
    },
    {
        "content": "TOKYO  Oct 31 Mitsubishi UFJ Financial Group  is in talks to buy a mutual fund administration business from Shinkin Central Bank for about 10 billion yen ($95.5 million)  a source with direct knowledge of the matter said on Monday.",
        "date": "10312016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MUFG to buy mutual fund administration business-source "
    },
    {
        "content": "Oct 13 MUFG Investor Services  part of Mitsubishi UFJ Financial Group  appointed Damian McAree as executive director  business development  EMEA.",
        "date": "10132016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG Investor Services names Damian McAree executive director "
    },
    {
        "content": "LONDON  Oct 3 (IFR) - Mitsubishi UFJ Financial Group has hired Luis Marcelo Moro as an executive director in its financial institutions group team for Europe  the Middle East and Africa  according to a company statement.",
        "date": "10032016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG hires Moro as part of EMEA FIG expansion "
    },
    {
        "content": "* Says the co and Mitsubishi UFJ Lease & Finance Co Ltd  raised 23 percent and 4.2 percent stake in Hitachi Capital Corp from 0 percent respectively",
        "date": "10062016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Mitsubishi UFJ Financial Group and Mitsubishi UFJ Lease & Finance raise 23 pct and 4.2 pct stake in Hitachi Capital respectively "
    },
    {
        "content": "Sept 26 MUFG Investor Services  the global asset servicing arm of Mitsubishi UFJ Financial Group  said it named Christina Nilsson as senior relationship manager to its London office.",
        "date": "09262016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG names senior relationship manager for London office "
    },
    {
        "content": "Sept 19 MUFG Union Bank N.A.  a subsidiary of Mitsubishi UFJ Financial Group  appointed Lisa Roberts as head of private wealth management for Northern California and the Pacific Northwest.",
        "date": "09192016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG Union Bank hires Lisa Roberts "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  September 13 (Fitch) Fitch Ratings has assigned Japan-based Mitsubishi  UFJ Financial Group  Inc.'s (MUFG  A/Negative) USD4bn senior unsecured notes a  final rating of 'A'.  The notes are expected to count towards MUFG's total loss-absorption capacity  (TLAC) requirements  which have been set by the Financial Stability Board at 16%  of its risk-weighted assets  effective 1 January 2019. Fitch believes MUFG will meet its minimum r",
        "date": "09132016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Fitch Assigns MUFG's Senior Unsecured Notes 'A' Final Rating "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  September 06 (Fitch) Fitch Ratings has assigned Japan-based Mitsubishi  UFJ Financial Group  Inc.'s (MUFG  A/Negative) proposed US dollar senior  unsecured notes an expected rating of 'A (EXP).'  The notes are expected to count towards MUFG's total loss-absorption capacity  (TLAC) requirements  which have been set by the Financial Stability Board at 16%  of its risk-weighted assets  effective 1 January 2019. Fitch believes MUFG w",
        "date": "09072016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Fitch Assigns MUFG's Senior Unsecured Notes 'A (EXP)' "
    },
    {
        "content": "* Google will partner with Mitsubishi UFJ Financial Group to launch its digital wallet platform inside Japan as soon as autumn - Nikkei",
        "date": "08302016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Google to partner with Mitsubishi UFJ Financial to launch Android Pay inside Japan - Nikkei "
    },
    {
        "content": "TOKYO  Aug 12 Mitsubishi UFJ Financial Group (MUFG) has set up a 20 billion ringgit ($5 billion) Islamic securitisation programme in Malaysia  a bank official told Reuters  as Japan's largest lender strives to become a key player in Islamic finance.",
        "date": "08112016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG sets up $5 bln Islamic securitisation programme in Malaysia "
    },
    {
        "content": "* Mitsubishi UFJ Lease & Finance  Hitachi units plan leasing service in Mexico - Nikkei",
        "date": "08022016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Mitsubishi UFJ Lease & Finance  Hitachi units plan leasing service in Mexico - Nikkei "
    },
    {
        "content": "* Peers Mizuho  SMFG both reported sharp Q1 profit drops   (Recasts  adds analyst comment)",
        "date": "08012016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "UPDATE 2-Japan's negative rates whack big banks as MUFG joins peers with Q1 profit hit "
    },
    {
        "content": "TOKYO  Aug 1 Mitsubishi UFJ Financial Group (MUFG)  Japan's biggest bank  said on Monday its first-quarter profit slid 32 percent  joining global peers in reporting deepening troubles for banks hurt by low interest rates at home and in other major economies.",
        "date": "08012016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan's MUFG Q1 profit skids 32 pct  hit by negative interest rate policy "
    },
    {
        "content": "TOKYO  July 29 Mitsubishi UFJ Financial Group (MUFG) has agreed to buy a fund administration business from Chicago-based investment and advisory firm Guggenheim Partners  extending a drive by Japan's biggest bank to diversify beyond traditional loan operations.",
        "date": "07292016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Japan's MUFG agrees to buy Guggenheim's fund administration business "
    },
    {
        "content": "* Mizuho Financial Group and Mitsubishi UFJ Financial Group are reshuffling operations in Europe - Nikkei",
        "date": "07222016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Mizuho Financial Group  Mitsubishi UFJ Financial reshuffling operations in Europe - Nikkei "
    },
    {
        "content": "* Jeffrey Bucher joined organization as managing director and head of transaction banking sales for regional bank  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "07142016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Mitsubishi UFJ Financial - Jeffrey Bucher joined organization as managing director "
    },
    {
        "content": "LONDON  July 8 (IFR) - Mitsubishi UFJ Financial Group's (MUFG) banking arm has hired Mathias Noack as managing director and head of syndications for Europe  Middle East and Africa.",
        "date": "07082016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG hires Noack as head of syndications in EMEA "
    },
    {
        "content": "* Mitsubishi UFJ Financial Group to invest in Coinbase  a service that allows users to store the virtual currency and make payments with it - Nikkei",
        "date": "07072016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Mitsubishi UFJ Financial to invest in bitcoin venture Coinbase - Nikkei "
    },
    {
        "content": "* Designating U.S. bank holding company  MUFG Americas Holdings Corporation as intermediate holding company",
        "date": "07012016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Mitsubishi UFJ designates MUFG Americas Holdings Corp as intermediate holding company "
    },
    {
        "content": "TOKYO  June 28 Mitsubishi UFJ Financial Group Inc (MUFG) faces the possibility of a $500 million impairment loss on Hitachi Capital Corp shares  whose value has plunged since Britons voted to leave the European Union on Friday.",
        "date": "06282016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Japan's MUFG faces impairment loss on Hitachi Capital after Brexit vote "
    },
    {
        "content": "* Long-term implications for JGB demand are worrying - analyst",
        "date": "06082016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "UPDATE 2-MUFG bank unit set to quit as primary dealer for shrinking JGB market "
    },
    {
        "content": "TOKYO  June 8 Bank of Tokyo-Mitsubishi UFJ (BTMU) is considering quitting as a Japanese government bond primary dealer  a source with direct knowledge of the deal said on Wednesday.",
        "date": "06072016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Bank of Tokyo Mitsubishi UFJ mulls quitting as JGB primary dealer-source "
    },
    {
        "content": "TOKYO  June 8 Bank of Tokyo-Mitsubishi UFJ is expected to give up its role as a primary dealer of Japanese government bonds as early as July  a person familiar with the matter said on Wednesday.",
        "date": "06082016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MUFG's bank unit set to withdraw as JGB primary dealer in July - source "
    },
    {
        "content": "LONDON  May 31 (IFR) - Mitsubishi UFJ Financial Group has appointed Masahiro Kuwahara as chief executive for Europe  Middle East and Africa and the bank's resident managing officer for EMEA.",
        "date": "05312016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG appoints Kuwahara as EMEA CEO "
    },
    {
        "content": "May 13 Mitsubishi Ufj Financial Group Is Expected To Announce It Has 10.4 Trillion Yen Worth Of Credit Lines Open For Resource",
        "date": "05132016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-MUFG to report credit lines worth 10.4 trillion yen for resource-related businesses- Nikkei "
    },
    {
        "content": "* Expects net Y850 bln this FY; fell 8 pct to Y951 bln last FY",
        "date": "05162016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "UPDATE 2-MUFG sees lowest profit in 6 years  hurt by negative interest rates "
    },
    {
        "content": "TOKYO  May 16 Japan's Mitsubishi UFJ Financial Group Inc (MUFG) said on Monday profit fell 8 percent in the last business year  missing analyst estimates  brought down by an increase in provisions for bad loans to the energy sector.",
        "date": "05162016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Japan's MUFG says profit fell 8 pct last year  missing analyst estimates "
    },
    {
        "content": "* Says to buy back up to 1.67 percent of own shares worth 100 billion yen ($920 million)  Further company coverage:   ($1 = 108.6800 yen)",
        "date": "05162016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "BRIEF-MUFG to buy back up to $920 mln of own shares "
    },
    {
        "content": "May 10 Japan's Mitsubishi UFJ Financial Group Inc named Grant Moyer as head of leveraged capital markets for its securities business in the United States.",
        "date": "05102016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG appoints Grant Moyer as head of leveraged capital markets "
    },
    {
        "content": "* Hitachi and Mitsubishi UFJ Financial Group will form a capital and business tie-up in the field of leasing - Nikkei",
        "date": "05112016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Hitachi and Mitsubishi UFJ Financial to form capital and business tie-up - Nikkei "
    },
    {
        "content": "NEW YORK  May 10 (IFR) - Mitsubishi UFJ Financial Group said on Tuesday it has hired Grant Moyer to head up its leveraged capital markets securities business in the Americas.",
        "date": "05102016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MOVES-MUFG hires Grant Moyer to head up Americas leveraged finance "
    },
    {
        "content": "April 29 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04292016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES- Rothschild  MUFG  SocGen "
    },
    {
        "content": "April 29 Japan's Mitsubishi UFJ Financial Group Inc promoted Dong Nam to a newly created position as deputy chief executive for Mitsubishi UFJ Securities (HK) Ltd.",
        "date": "04292016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MOVES-MUFG names new deputy CEO for Hong Kong securities business "
    },
    {
        "content": "* Mitsubishi UFJ Financial Group expected to report consolidated net profit of around 950 billion yen ($8.74 billion) for year ended March 31 - Nikkei",
        "date": "04282016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "BRIEF-Sumitomo Mitsui Financial Group's bottom line is seen at over 650 bln yen for year ended March 31- Nikkei "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  April 20 (Fitch) Fitch Ratings has affirmed the 'A' rating on Japan-based  Mitsubishi UFJ Financial Group  Inc.'s (MUFG  A/Stable) senior unsecured note  issue  which was increased to USD7bn from USD5bn. Fitch on 1 March 2016 assigned  a final rating to the notes  which were issued out of the banking group's debt  programme.  The notes are expected to count towards MUFG's total loss-absorption capacity  (TLAC) requirements  which",
        "date": "04202016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Fitch Affirms MUFG's Larger Senior Unsecured Note Issue at 'A' "
    },
    {
        "content": "LONDON  April 1 (IFR) - Japan's Mitsubishi UFJ Financial Group has appointed Ayse Zadil as head of corporates and financial institutions at its Turkish business  leading the bank's strategy to increase its presence there.",
        "date": "04012016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-MUFG hires Zadil to boost Turkey push "
    },
    {
        "content": "TOKYO  March 30 Taiwan's Foxconn plans to buy all 200 billion yen ($1.78 billion) worth of the preferred shares owned by Sharp Corp's two major creditor banks  a source familiar with the matter said on Wednesday.",
        "date": "03302016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "Foxconn to buy all 200 bln yen preferred shares from Sharp's creditor banks - source "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  March 01 (Fitch) Fitch Ratings has assigned Japan-based Mitsubishi UFJ  Financial Group  Inc.'s (MUFG) USD5bn senior unsecured notes a final rating of  'A'. The notes are expected to count towards MUFG's total loss-absorption  capacity (TLAC) requirements  which have been set by the Financial Stability  Board at 16% of its risk-weighted assets  effective 1 January 2019. The senior bonds will constitute direct  unconditional  unse",
        "date": "03012016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Fitch Assigns MUFG's Senior Unsecured Notes 'A' Final Rating "
    },
    {
        "content": "Feb 25 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "02252016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES- Barclays  Marsh  SFC  Bank of Tokyo-Mitsubishi "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  February 11 (Fitch) Fitch Ratings has published Japan-based Mitsubishi  UFJ Financial Group's (MUFG) Long-Term Issuer Default Rating (IDR) of 'A'. The  agency has also published the company's Short-Term IDR of 'F1'  its Viability  Rating (VR) at 'a'  Support Rating (SR) at '1' and Support Rating Floor (SRF) at  'A-'. The Rating Outlook on the Long-term IDR is Stable. The agency has  simultaneously assigned an expected rating of '",
        "date": "02122016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Fitch Publishes MUFG Rtg; Rates Asia's 1st TLAC Eligible Notes "
    },
    {
        "content": "NEW YORK  Feb 4 Colm Kelleher is a stickler for discipline  even when it comes to the office dress code.",
        "date": "02042016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "PROFILE-Morgan Stanley's new president cements role as enforcer-in-chief "
    },
    {
        "content": "TOKYO  Feb 1 Mitsubishi UFJ Financial Group Inc  reported on Monday an 8 percent decline in profit for the nine months ended in December  in the absence of windfall gains from bad-loan reserves that boosted the year-earlier results.",
        "date": "02012016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Japan bank MUFG's 9-month profit falls 8 pct  hurt by credit costs "
    },
    {
        "content": "TOKYO  Jan 28 Mitsubishi UFJ Financial Group Inc (MUFG) said on Thursday it has appointed Deputy President Takashi Oyamada to succeed Nobuyuki Hirano as the next president of its core banking unit  Bank of Tokyo-Mitsubishi UFJ  effective April 1.",
        "date": "01282016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG picks Takashi Oyamada as chief of core banking unit "
    },
    {
        "content": "TOKYO  Jan 14 Bank of Tokyo-Mitsubishi UFJ is in final talks to buy a 20 percent stake in Security Bank Corp  of the Philippines for about 100 billion yen ($850 million)  a source with direct  knowledge of the matter said on Thursday.",
        "date": "01142016",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG set to buy 20 pct of Security Bank for $850 mln -source "
    },
    {
        "content": "TOKYO  Nov 13 Mitsubishi UFJ Financial Group Inc (MUFG) said on Friday net profit rose 3.6 percent for the six months ended in September  driven by gains from its overseas operations and brokerage business.",
        "date": "11132015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Top Japan bank MUFG's H1 profit up 3.6 pct  exceeds own forecast "
    },
    {
        "content": "TOKYO  Nov 11 Banks under Mitsubishi UFJ Financial Group Inc and Mizuho Financial Group Inc  sold a total 160 billion yen ($1.3 billion) of shares to individual investors in the Japan Post triple IPO  sources with knowledge of the matter said.",
        "date": "11112015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG  Mizuho banks sell 160 bln yen worth of Japan Post shares to individuals "
    },
    {
        "content": "- to buy back around 100 billion yen ($815 million) of own shares - Nikkei",
        "date": "11132015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "REFILE-BRIEF-Mitsubishi UFJ to buy back around 100 bln yen own shares -Nikkei "
    },
    {
        "content": "Oct 29 Morgan Stanley said its top shareholder  Mitsubishi UFJ Financial Group Inc  had appointed Nobuyuki Hirano a representative director on the bank's board  replacing Masaaki Tanaka.",
        "date": "10292015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "ON THE MOVE-Mitsubishi UFJ's Nobuyuki Hirano to rejoin Morgan Stanley board "
    },
    {
        "content": "Oct 29 Mitsubishi UFJ Financial Group's  banking arm  The Bank of Tokyo-Mitsubishi UFJ Ltd  appointed Ian Wootton and Richard Price to its corporate banking team in the European  Middle East and African region.",
        "date": "10292015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MOVES-Mitsubishi UFJ Financial Group hires Wootton  Price "
    },
    {
        "content": "Sept 11 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "09112015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TOKYO  Sept 7 Mitsubishi UFJ Financial Group Inc  will sell shares in the Japan Post Holdings  group at its banking unit  sources said  giving it a leg-up over rival mega-banks only prepared for an offering at their brokerage arms.",
        "date": "09072015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG to offer Japan Post shares at banking unit -sources "
    },
    {
        "content": "TOKYO  Aug 7 Mitsubishi UFJ Financial Group's  core banking unit has become the first foreign lender in Myanmar to extend a local currency loan  a person with knowledge of the matter said  a sign that strong loan demand in the fast-growing economy is likely to be better met.",
        "date": "08062015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG is first foreign bank to make Myanmar local currency loan -source "
    },
    {
        "content": "TOKYO  July 31 Mitsubishi UFJ Financial Group Inc (MUFG)  Japan's largest lender by assets  said on Friday it could sell off shareholdings held as investments in domestic companies if their returns don't meet a newly drawn up yardstick.",
        "date": "07312015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Japan bank MUFG says sets new criteria for cutting cross-shareholdings "
    },
    {
        "content": "TOKYO  June 19 A unit of Japan's Mitsubishi UFJ Financial Group has reached an agreement with UBS Global Asset Management to acquire the Swiss fund's Alternative Fund Services (AFS) business  the two companies said in a statement.",
        "date": "06192015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG unit says to buy UBS's Alternative Fund Services business "
    },
    {
        "content": "June 17 Tokyo-based Mitsubishi UFJ Financial Group Inc appointed Ryosei Hayashi as head of the rates trading and sales business for Asia at Mitsubishi UFJ Securities (HK) Ltd.",
        "date": "06172015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MOVES-Mitsubishi UFJ Securities Asia rates business gets new head "
    },
    {
        "content": "MANILA  June 18 Twelve foreign and local investors  including Japan's largest lender by assets Mitsubishi UFJ Financial Group Inc.  have expressed interest in the Philippine government's controlling stake in medium-sized United Coconut Planters Bank (UCPB).",
        "date": "06182015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Mitsubishi UFJ among 12 interested bidders in Philippine's UCPB stake "
    },
    {
        "content": "TOKYO   May 15 Mitsubishi UFJ Financial Group Inc (MUFG)  Japan's largest lender by assets  reported a record annual profit for a second year in a row as its aggressive overseas expansion strategy paid off.",
        "date": "05152015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "CORRECTED-Japan's MUFG posts record annual profit  driven by overseas growth "
    },
    {
        "content": "May 15 (Reuters)-            Mitsubishi UFJ Financial Group  Inc            PARENT-ONLY FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                    Year ended      Year ended       Year to     NEXT                      Mar 31  2015    Mar 31  2014   Mar 31  2016     YEAR                         LATEST         YEAR-AGO        COMPANY      COMPANY                       RESULTS         RESULTS       FORECAST    H1 FORECAST    Revenues         585.81          258.69          ",
        "date": "05152015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "TABLE-Mitsubishi UFJ FG -2014/15 parent results "
    },
    {
        "content": "May 15 (Reuters)-            Mitsubishi UFJ Financial Group  Inc            CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                    Year ended      Year ended       Year to       NEXT                    Mar 31  2015    Mar 31  2014   Mar 31  2016     YEAR                         LATEST         YEAR-AGO        COMPANY      COMPANY                       RESULTS         RESULTS       FORECAST    H1 FORECAST    Revenues        5.64 trln       5.18 trln       ",
        "date": "05152015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "TABLE-Mitsubishi UFJ FG -2014/15 group results "
    },
    {
        "content": "* to buy back about 100 billion yen ($836.68 million) of own shares - Nikkei  Further company coverage:   ($1 = 119.5200 yen)",
        "date": "05152015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "BRIEF-Mitsubishi UFJ to buy back about 100 bln yen own shares - Nikkei "
    },
    {
        "content": "* Looks to expand into neighbouring countries   (Adds quotes  details of expansion)",
        "date": "04282015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "UPDATE 1-MUFG-controlled Bank of Ayudhya to invest up to $307 mln on IT  branches "
    },
    {
        "content": "TOKYO  April 6 Japanese regional lender Tomony Holdings Inc said on Monday it is in talks to merge with Osaka-based Taisho Bank  owned 26 percent by Mitsubishi UFJ Financial Group Inc (MUFG)  helping to keep up momentum for consolidation in the crowded sector.",
        "date": "04062015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Japan regional lender Tomony in merger talks with MUFG affiliate "
    },
    {
        "content": "HONG KONG  March 17 (IFR) - Mitsubishi UFJ Financial Group  priced Japan's first yen-denominated Additional Tier 1  opening the way for other lenders to follow suit in a country that has been slow to adapt bail-in bonds.",
        "date": "03172015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "MUFG Financial prices first yen AT1 bond "
    },
    {
        "content": "TOKYO  March 17 Mitsubishi UFJ Financial Group Inc said on Tuesday it will issue 100 billion yen ($823.3 million) perpetual bonds and the proceeds from the debt sale will be used to bolster its capital under Basel III global bank capital rules.",
        "date": "03172015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "MUFG to issue Y100 bln Basel III-compliant bond "
    },
    {
        "content": "By size  Japan's Mitsubishi UFJ Financial Group Inc (MUFG)  is the world's sixth-largest lender  while Bank of Ayudhya Pcl is the fifth-largest lender in Thailand.",
        "date": "03022015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "THAILAND PRESS-Japan's MUFG believes synergy will boost mutual prosperity-The Nation "
    },
    {
        "content": "TOKYO  Feb 11 Mitsubishi UFJ Financial Group Inc  aims to add more directors to its board from outside the bank  people with direct knowledge of the matter said  taking a step towards a more U.S.-style management structure.",
        "date": "02122015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "REFILE-Japanese bank MUFG to introduce US-style board-sources "
    },
    {
        "content": "TOKYO  Feb 3 Mitsubishi UFJ Financial Group Inc   Japan's largest lender by assets  reported an 18 percent rise in nine-month profit  with aggressive overseas expansion offsetting continued weakness in domestic lending.",
        "date": "02032015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "topStory",
        "symbol": "MTU",
        "title": "Japan's No.1 bank MUFG's 9-month profit up 18 pct on overseas expansion "
    },
    {
        "content": "NEW YORK  Feb 4 The U.S. dollar rebounded on Wednesday from its worst day in more than a year  while a retreat in oil prices pressured energy shares and weighed on Wall Street.",
        "date": "02042015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "GLOBAL MARKETS-Dollar rebounds after slide  oil slumps 7 pct "
    },
    {
        "content": "Feb 3 (Reuters)-               Mitsubishi UFJ Financial Group  Inc               CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                                    9 months ended      9 months ended       Year to                    Dec 31  2014        Dec 31  2013     Mar 31  2015                       LATEST             YEAR-AGO          LATEST                          RESULTS             RESULTS         FORECAST      Revenues          4.26 trln           3.81 trln",
        "date": "02032015",
        "name": "Mitsubishi UFJ Financial Group Inc",
        "news_type": "normal",
        "symbol": "MTU",
        "title": "TABLE-Mitsubishi UFJ FG -9-MTH group results "
    }
]