[
    {
        "content": "* Australia Barrow Island  Cooper Basin reach close to $70/bbl",
        "date": "11072017",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "Oil at $70/barrel already a reality for some as Asian premium bites "
    },
    {
        "content": "* Murphy Oil Corp announces third quarter 2017 financial and operating results",
        "date": "11012017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil Corp reports Q3 adjusted loss per share $0.03 excluding items "
    },
    {
        "content": "* Murphy Oil Corp - ‍Board declared a quarterly cash dividend on common stock of murphy oil corporation of $0.25 per share​ Source text for Eikon: Further company coverage:",
        "date": "10042017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil ‍board declares quarterly cash dividend of $0.25 per share​ "
    },
    {
        "content": "* Murphy Oil Corporation announces strategic entry into deep water Brazil",
        "date": "09272017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil Corp announces strategic entry into deep water Brazil "
    },
    {
        "content": "* Murphy Oil Corporation announces offering of $550 million of senior notes due 2025",
        "date": "08032017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil reports offering of $550 mln of senior notes due 2025 "
    },
    {
        "content": "* Murphy Oil Corporation announces pricing of $550 million of notes due 2025",
        "date": "08042017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil announces pricing of $550 mln of notes due 2025 "
    },
    {
        "content": "* Murphy Oil Corporation announces second quarter 2017 financial and operating results",
        "date": "08022017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil Corporation Q2 loss per share $0.10 from continuing operations "
    },
    {
        "content": " ((In May 16 story  corrects to remove reference to North Sea net output rise in paragraph 1  corrects output projections in paragraph 3  changes headline to conform.)",
        "date": "05182017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "New oil projects brighten North Sea's twilight years "
    },
    {
        "content": "* Murphy Oil Corporation announces preliminary first quarter 2017 financial and operating results",
        "date": "05032017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil Corp announces Q1 earnings per share $0.34 "
    },
    {
        "content": "* Murphy Oil Corp -  board declared a quarterly cash dividend on common stock of Murphy Oil Corporation of $0.25 per share Source text for Eikon: Further company coverage:",
        "date": "04052017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil Corporation announces dividend "
    },
    {
        "content": "* Murphy Oil Corp - CEO Roger W. Jenkins' total compensation for 2016 was $8.5 million versus $14.1 million in 2015   Source text:(http://bit.ly/2ocpE5e) Further company coverage:",
        "date": "03242017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil Corp's CEO's total compensation for 2016 was $8.5 mln "
    },
    {
        "content": "AMSTERDAM  March 8 Dutch power grid operator TenneT said on Wednesday it had found the first partner for its plan to create an offshore energy hub in the North Sea  Danish power transmission company Energinet.dk.",
        "date": "03082017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "UPDATE 1-Dutch  Danish grid operators to form offshore power hub in North Sea "
    },
    {
        "content": "CALGARY  Alberta  Feb 28 Canada's oil-rich province of Alberta has fined a local subsidiary of U.S.-based Murphy Oil Corp C$172 500 ($130 031) for its role in a 9 000-barrel spill in 2015 that went undetected for more than six weeks  the provincial energy regulator said on Tuesday.",
        "date": "02282017",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "Canada's Alberta fines Murphy Oil for role in 2015 spill "
    },
    {
        "content": "* Pzena Investment Management LLC reports 5 percent passive stake in Murphy Oil Corp as of December 31  2016 - SEC filing  Source text: (http://bit.ly/2jURS1R) Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "02062017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Pzena Investment Management reports 5 pct passive stake in Murphy Oil - SEC filing "
    },
    {
        "content": "LONDON North Sea-focused Premier Oil   which has struggled to contain its $2.8 billion debt pile  has agreed further terms with lenders to stretch out repayment of its debt after months of wrangling.",
        "date": "02032017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "UK's Premier Oil agrees debt restructuring deal after months of wrangling "
    },
    {
        "content": "* REG-MURPHY OIL CORPORATION ANNOUNCES PRELIMINARY FOURTH QUARTER AND FULL YEAR 2016 FINANCIAL AND OPERATING RESULTS",
        "date": "01252017",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-MURPHY OIL REPORTS Q4 LOSS PER SHARE $0.37 "
    },
    {
        "content": "* New revolving credit facility will be a senior unsecured guaranteed facility and will expire in August 2019",
        "date": "08122016",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil entered into an amendment of its existing revolving credit facility "
    },
    {
        "content": "* Murphy Oil Corporation announces offering of $500 million of senior notes due 2024",
        "date": "08102016",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil announces offering of $500 mln senior notes "
    },
    {
        "content": "* Murphy Oil Corporation announces pricing and upsizing of offering of $550 million of senior notes due 2024",
        "date": "08122016",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil upsizes offering of $550 mln of senior notes due 2024 "
    },
    {
        "content": "* Murphy Oil Corp announces intent to enter into new credit facility",
        "date": "08102016",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil Corp announces intent to enter into new credit facility "
    },
    {
        "content": "* Decision to reduce dividend was \"based on lack of a sustained recovery in commodity prices\"",
        "date": "08032016",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil cuts quarterly cash dividend "
    },
    {
        "content": "LONDON Britain has cut rental fees by up to 90 percent in its latest tender for oil and gas licenses in the North Sea launched on Wednesday in a bid to attract companies to find new fields in the mature basin.",
        "date": "07272016",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "Britain offers new oil and gas licenses amid exploration drought "
    },
    {
        "content": "LONDON  July 27 Britain has cut rental fees by up to 90 percent in its latest tender for oil and gas licences in the North Sea launched on Wednesday in a bid to attract companies to find new fields in the mature basin.",
        "date": "07272016",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "Britain offers new oil and gas licences amid exploration drought "
    },
    {
        "content": "* Q2 production guidance will be reduced by 8 400 barrels oil equivalent per day",
        "date": "06232016",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil reduces Q2 production forecast by 8 400 boepd "
    },
    {
        "content": "* Over remainder of 2016  we plan to spend approximately US$40 million on completions  infrastructure and facilities",
        "date": "05132016",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil Corp closes Kaybob Duvernay  Placid Montney joint venture "
    },
    {
        "content": "* Athabasca closes light oil joint venture with Murphy Oil  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05132016",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "BRIEF-Athabasca closes light oil joint venture with Murphy Oil "
    },
    {
        "content": "* Murphy oil corporation announces preliminary first quarter 2016 financial and operating results",
        "date": "05042016",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil Corp Q1 adjusted loss per share $0.66 excluding items "
    },
    {
        "content": "* Murphy Oil Corporation announces non-core asset sale - divests interest in Syncrude joint venture for C$937 million",
        "date": "04282016",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy Oil divests interest in Syncrude joint venture for C$937 million "
    },
    {
        "content": "CALGARY  Alberta  April 28 Suncor Energy   Canada's largest oil and gas producer  said on Thursday it will focus on improving efficiency but not seek operatorship at Syncrude oil sands project in northern Alberta  in which it is acquiring a majority stake.",
        "date": "04282016",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "Suncor says will not seek operatorship of Syncrude oil sands plant "
    },
    {
        "content": "Canadian oil and gas producer Suncor Energy Inc said on Wednesday it has agreed to pay about C$937 million to acquire an additional 5 percent stake in its Syncrude oil sands joint venture from Murphy Oil Corp's Canadian unit.",
        "date": "04282016",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "Suncor Energy to acquire additional 5 percent stake in Syncrude "
    },
    {
        "content": "April 27 Canadian oil and gas producer Suncor Energy Inc said on Wednesday it has agreed to pay about C$937 million to acquire an additional 5 percent stake in its Syncrude oil sands joint venture from Murphy Oil Corp's  Canadian unit.",
        "date": "04282016",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "UPDATE 1-Suncor Energy to acquire additional 5 pct stake in Syncrude "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.35per share  Source text for Eikon:  Further company coverage:",
        "date": "04062016",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "BRIEF-Murphy oil sets quarterly cash dividend of $0.35 per share "
    },
    {
        "content": "Jan 27 Canada's largest pipeline company Enbridge Inc said it would buy Murphy Oil Corp's  Tupper Main and Tupper West gas plants in northeastern British Columbia for C$538 million.",
        "date": "01272016",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "Enbridge to buy some Murphy Oil gas plants in British Columbia "
    },
    {
        "content": "Jan 27 Enbridge Inc  Canada's largest pipeline company  said it would buy Murphy Oil Corp's  Tupper Main and Tupper West gas plants in northeastern British Columbia for C$538 million  ($382 million).",
        "date": "01272016",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "UPDATE 1-Enbridge to buy some Murphy Oil gas plants in British Columbia "
    },
    {
        "content": "Ineos [INEOSE.UL]  owner of Scotland's Grangemouth petrodoil refinery  has struck a deal with subsidiaries of ExxonMobil and Shell to supply ethane derived from U.S. shale gas which it is to import into Scotland to their nearby chemical plant  the company said on Monday.",
        "date": "11092015",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "Ineos signs U.S. shale gas ethane deal with Exxon  Shell in Scotland "
    },
    {
        "content": "French oil major Total  is in talks to sell its gas pipeline in the UK's North Sea to ArcLight Capital partners  a U.S.-based private equity firm focused on energy infrastructure  Bloomberg reported citing people familiar with the matter.",
        "date": "06252015",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "Total in talks to sell UK pipeline to U.S. buyout group ArcLight: Bloomberg "
    },
    {
        "content": "June 25 French oil major Total is in talks to sell its gas pipeline in the UK's North Sea to ArcLight Capital partners  a U.S.-based private equity firm focused on energy infrastructure  Bloomberg reported citing people familiar with the matter.",
        "date": "06252015",
        "name": "Murphy Oil Corporation",
        "news_type": "normal",
        "symbol": "MUR",
        "title": "Total in talks to sell UK pipeline to U.S. buyout group ArcLight -Bloomberg "
    },
    {
        "content": "LONDON  May 15 High-profile oil and gas executives are teaming up with private equity funds seeking to invest billions in British North Sea assets and maximize profits by cutting costs  offering the ageing basin a badly needed lifeline.",
        "date": "05152015",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "Top oil execs  cash-rich funds team up to buy UK North Sea assets "
    },
    {
        "content": "* LetterOne given six months to sell assets   (Adds LetterOne reaction  background)",
        "date": "04202015",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "UPDATE 3-Britain orders sale of Russian billionaire Fridman's North Sea fields "
    },
    {
        "content": "LONDON  March 18 The British government is still considering Russian billionaire Mikhail Fridman's acquisition of North Sea gas fields  but has made clear it has the power to require him to sell the assets  Prime Minister David Cameron's spokesman said on Wednesday.",
        "date": "03182015",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "UK still mulling Russian tycoon's N. Sea deal  has power to force sale "
    },
    {
        "content": "LONDON  March 11 Russian billionaire Mikhail Fridman's LetterOne fund said it had submitted detailed information to the British government as it tries to salvage a deal to buy North Sea assets from Germany's RWE and avoid a legal clash.",
        "date": "03112015",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "UPDATE 1-Russian oligarch steps up efforts to salvage North Sea deal "
    },
    {
        "content": "LONDON  March 5 Britain is ready to force the sale of Russian oligarch Mikhail Fridman's recently acquired North Sea energy assets unless it receives unspecified assurances within the next week  Prime Minister David Cameron's spokesman said on Thursday.",
        "date": "03052015",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "UPDATE 1-Britain ready to force sale of oligarch Fridman's N.Sea assets -PM spokesman "
    },
    {
        "content": "OSLO  Feb 24 Norwegian engineering firm Aibel has won a contract worth 8 billion crowns ($1.05 billion) from Statoil to build a drilling platform for the Johan Sverdrup field  one of the biggest deals for the giant North Sea field.",
        "date": "02242015",
        "name": "Murphy Oil Corporation",
        "news_type": "topStory",
        "symbol": "MUR",
        "title": "Norway's Aibel wins $1.05 bln Statoil contract for Sverdrup platform "
    }
]