[
    {
        "content": "* Theravance Biopharma and Mylan submit new drug application to FDA for revefenacin (TD-4208) in adults with chronic obstructive pulmonary disease",
        "date": "11132017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Theravance Biopharma and Mylan submit marketing application to FDA for revefenacin "
    },
    {
        "content": "* Mylan launches generic Clolar for injection Source text for Eikon: Further company coverage:",
        "date": "11092017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Clolar for injection "
    },
    {
        "content": "* Mylan announces voluntary delisting from the Tel Aviv Stock Exchange (TASE)",
        "date": "11102017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan announces voluntary delisting from the Tel Aviv Stock Exchange (TASE) "
    },
    {
        "content": "* Says mylan resubmits Biosimilar Trastuzumab and Pegfilgrastim dosseirs with EMA‍​ Source text for Eikon: Further company coverage:",
        "date": "11072017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Biocon says Mylan resubmits Biosimilar Trastuzumab and Pegfilgrastim dosseirs with EMA‍​ "
    },
    {
        "content": "Mylan NV  on Monday raised its full-year forecast and  expects sales from its recently approved version of Teva's  blockbuster multiple sclerosis treatment Copaxone to offset declining revenue from its EpiPen emergency allergy injector.",
        "date": "11062017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan raises forecast on strength of generic Copaxone "
    },
    {
        "content": "* Raises lower end of 2017 revenue  adjusts earnings forecasts",
        "date": "11062017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 3-Mylan raises forecast on strength of generic Copaxone "
    },
    {
        "content": "Nov 6 U.S. drugmaker Mylan NV reported a 2.3 percent decline in third-quarter revenue on Monday  hurt by lower sales in North America.",
        "date": "11062017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Drugmaker Mylan's revenue drops 2.3 percent "
    },
    {
        "content": "* Momenta Pharmaceuticals reports third quarter 2017 financial results and provides corporate update",
        "date": "11012017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Momenta Pharma says Q3 loss per share $0.44 "
    },
    {
        "content": "* Theravance Biopharma and mylan report additional positive phase 3 data for Revefenacin (TD-4208) in multiple presentations at 2017 Chest Annual Meeting",
        "date": "11012017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Theravance Biopharma and Mylan reports positive Phase 3 data for Revefenacin "
    },
    {
        "content": "* Momenta And Mylan report initial results from phase 1 clinical trial for M834  a proposed biosimilar of Orencia® (abatacept)",
        "date": "11012017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Momenta And Mylan report initial results from phase 1 clinical trial for M834 "
    },
    {
        "content": "* Sanofi files suit in the U.S. to defend its patent rights on Lantus® and Lantus® Solostar®",
        "date": "10242017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Sanofi files suit in the U.S. to defend patent rights "
    },
    {
        "content": "* Mylan wins UK court ruling related to Copaxone® 40 mg/ml patent",
        "date": "10262017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan wins UK court ruling related to Copaxone 40 mg/ml patent "
    },
    {
        "content": "* U.S. district court for Eastern District of Texas issued decision finding asserted claims of patents relating to Restasis invalid ​",
        "date": "10172017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-‍Mylan invalidates Allergan's patents on Restasis​ "
    },
    {
        "content": "LONDON Teva's blockbuster multiple sclerosis treatment Copaxone will face additional generic competition in Europe  just two days after Mylan NV won U.S. approval to sell  cheaper versions of the medicine in the world's largest market.",
        "date": "10052017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Teva's Copaxone faces generic competition in Europe after U.S. hit "
    },
    {
        "content": "LONDON  Oct 5 Teva's blockbuster multiple sclerosis treatment Copaxone will face additional generic competition in Europe  just two days after Mylan NV won U.S. approval to sell  cheaper versions of the medicine in the world's largest market.",
        "date": "10052017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Teva's Copaxone faces generic competition in Europe after U.S. hit "
    },
    {
        "content": "* Mylan received final approval from U.S. FDA for its Abbreviated New Drug Application for this antifungal which has multiple indications Source text for Eikon: Further company coverage:",
        "date": "10022017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Cancidas for injection "
    },
    {
        "content": "* Mylan  in partnership with Synthon  receives marketing authorization approval in Europe for first generic for Copaxone 40 mg/ml",
        "date": "10052017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan receives marketing authorization approval in Europe for first generic for Copaxone 40 mg/ml "
    },
    {
        "content": "* Mylan NV - ‍announced U.S. launch of Moxifloxacin Hydrochloride  first AP-rated generic version of Bayer's Avelox ​ Source text for Eikon: Further company coverage:",
        "date": "10052017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches first AP-rated generic Avelox injection "
    },
    {
        "content": "* Mylan confirms U.S. Launch of first generic for Copaxone 40 mg/ml 3-times-a-week and generic for Copaxone 20 mg/ml once-daily",
        "date": "10042017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan confirms U.S. Launch of first generic for Copaxone 40 mg/ml 3-times-a-week "
    },
    {
        "content": "* Says marketing partner mylan launches generic glatiramer acetate in U.S. Market Source text - http://bit.ly/2xUtxo0 Further company coverage:",
        "date": "10052017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Natco Pharma's marketing partner Mylan launches generic glatiramer acetate in U.S. "
    },
    {
        "content": "Mylan NV's long-awaited U.S. approval for its generic version of rival Teva's blockbuster multiple sclerosis treatment Copaxone drove Mylan's shares up around 18 percent on Wednesday while Teva shares plunged.",
        "date": "10042017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan surges  Teva slumps after FDA approves Copaxone copy "
    },
    {
        "content": "* Mylan - Annouces U.S. launch of imatinib mesylate tablets  100 mg  400 mg ; co received final approval from U.S. FDA for ANDA on the product​ Source text for Eikon: Further company coverage:",
        "date": "09292017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Gleevec tablets "
    },
    {
        "content": "Oct 4 Mylan NV's long-awaited U.S. approval for its generic version of rival Teva's blockbuster multiple sclerosis treatment Copaxone drove Mylan's shares up around 18 percent on Wednesday while Teva shares plunged.",
        "date": "10042017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 4-Mylan surges  Teva slumps after FDA approves Copaxone copy "
    },
    {
        "content": "* PepsiCo down 2 pct after cutting FY organic revenue forecast",
        "date": "10042017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "US STOCKS-Wall St set to open lower after record highs "
    },
    {
        "content": "Sept 25 Indivior's U.S. subsidiary  together with Monosol Rx  has settled a patent dispute with U.S. drugmaker Mylan related to generic versions of its opioid addiction treatment Suboxone  which generates 80 percent of the Indivior's revenue.",
        "date": "09252017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Indivior settles addiction treatment case with Mylan for undisclosed terms "
    },
    {
        "content": "Oct 4 Shares of Mylan NV jumped about 17 percent in premarket trading on Wednesday after the U.S. Food and Drug Administration approved the drugmaker's copycat version of Teva Pharmaceutical Industries Ltd's blockbuster multiple sclerosis drug.",
        "date": "10042017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan surges as its generic of Teva's Copaxone gets FDA nod "
    },
    {
        "content": "A Native American tribe holding patents for drugmaker Allergan Plc on Friday moved to dismiss a case brought by generic drug company Mylan NV challenging the patents.",
        "date": "09222017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Native American tribe moves to dismiss Allergan patent case "
    },
    {
        "content": "Oct 4 - Indian shares were set for a fourth winning session on Wednesday as oil firms such as Reliance Industries gained due to a tax cut on petrol and diesel  though caution lingered ahead of the outcome of the central bank's policy meeting.",
        "date": "10042017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Indian shares rise on oil refiners; all eyes on RBI "
    },
    {
        "content": "* Mylan announces U.S. FDA approval of first generic for Copaxone® 40 mg/ml 3-times-a-week and may be eligible for 180-day exclusivity",
        "date": "10042017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan announces FDA approval of first generic for Copaxone 40 mg/ml "
    },
    {
        "content": "Sept 22 A Native American tribe holding patents for drugmaker Allergan Plc on Friday moved to dismiss a case brought by generic drug company Mylan NV challenging the patents.",
        "date": "09222017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Native American tribe moves to dismiss Allergan patent case "
    },
    {
        "content": "LONDON  Sept 18 The long-heralded threat of cut-price competition to its top-selling biological cancer medicines is finally becoming a reality for Roche  the world's biggest maker of oncology treatments.",
        "date": "09182017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Biosimilar cancer drug threat closing in for Roche "
    },
    {
        "content": "* Mylan expands women's healthcare portfolio with launch of generic Minastrin 24 FE tablets",
        "date": "09142017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan expands women's healthcare portfolio with launch of generic Minastrin 24 FE tablets "
    },
    {
        "content": "* Mylan names Dennis Zeleny as chief human relations officer Source text for Eikon: Further company coverage:",
        "date": "09132017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan names Dennis Zeleny as chief human relations officer "
    },
    {
        "content": "* Mylan NV- Otsuka Pharmaceutical Co Ltd  co entered into license agreement between their respective subsidiaries ONPG and Mylan Pharmaceuticals Private Limited",
        "date": "08242017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Otsuka and Mylan announce license agreement to commercialize Delamanid "
    },
    {
        "content": "BOSTON Mylan NV  has finalized a $465 million settlement resolving U.S. Justice Department claims it overcharged the government for its EpiPen emergency allergy treatment  which became the center of a firestorm over price increases.",
        "date": "08172017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan  U.S. finalize $465 million EpiPen settlement "
    },
    {
        "content": "BOSTON  Aug 17 Mylan NV has finalized a $465 million settlement resolving U.S. Justice Department claims it overcharged the government for its EpiPen emergency allergy treatment  which became the center of a firestorm over price increases.",
        "date": "08172017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 5-Mylan  U.S. finalize $465 million EpiPen settlement "
    },
    {
        "content": "* Mylan finalizes settlement agreement on Medicaid rebate classification for Epipen auto-injector",
        "date": "08172017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan finalizes settlement on Medicaid rebate classification for Epipen "
    },
    {
        "content": "* Mylan advances access in the fight against HIV with the launch of three generic antiretroviral medicines in Canada",
        "date": "08102017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches three generic antiretroviral medicines in Canada "
    },
    {
        "content": "* Mylan - ‍Tentative approval from U.S. FDA for NDA for dolutegravir  lamivudine and tenofovir disoproxil fumarate tablets  50 mg/300 mg/300 mg​ Source text for Eikon: Further company coverage:",
        "date": "08072017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan receives tentative approval for \"TLD\" under PEPFAR "
    },
    {
        "content": "* Mylan Pharmaceuticals- received marketing authorization from Drug Controller General of India for antiretroviral drug Avonza Source text for Eikon: Further company coverage:",
        "date": "08082017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches Avonza in India "
    },
    {
        "content": "Aug 9 Mylan NV said on Wednesday that delays in launching key new drugs and eroding prices for generics in the United States will hurt its profitability this year and in 2018.",
        "date": "08092017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "UPDATE 4-Mylan cuts forecasts on delays in new drugs  weak prices "
    },
    {
        "content": "Mylan NV said on Wednesday that delays in launching key new drugs and eroding prices for generics in the United States will hurt its profitability this year and in 2018. | Video ",
        "date": "08092017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan cuts forecasts on delays in new drugs  weak prices "
    },
    {
        "content": "* Says disappointed with the execution by FDA on approval process of generic Copaxone",
        "date": "08092017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan gives details on genric approval processes "
    },
    {
        "content": "* Mylan reports second quarter 2017 results and updates 2017 guidance",
        "date": "08092017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan reports Q2 GAAP earnings per share $0.55 "
    },
    {
        "content": "Aug 9 Generic drug maker Mylan NV reported a 76.4 percent increase in quarterly profit on Wednesday  helped by demand for products it gained through the acquisition of Swedish drugmaker Meda last year.",
        "date": "08092017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan profit jumps 76.4 percent "
    },
    {
        "content": "NEW YORK  July 31 Pharmacy benefit manager Express Scripts Holding Co said on Monday it would favor drugmaker Mylan Inc's versions of the EpiPen lifesaving allergy treatment over the allergy auto-injectors of other companies.",
        "date": "07312017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Express Scripts to cover Mylan's EpiPen  exclude rivals "
    },
    {
        "content": "NEW YORK  July 31 Pharmacy benefit manager Express Scripts Holding Co said on Monday it would favor drugmaker Mylan Inc's versions of the EpiPen lifesaving allergy treatment over the allergy auto-injectors of other companies.",
        "date": "07312017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Express Scripts to cover Mylan's EpiPen  exclude rivals "
    },
    {
        "content": "* Approval from World Health Organization prequalification of medicines program  of its application for Sofosbuvir tablets  400 mg",
        "date": "07262017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan receives who prequalification for Generic Sovaldi "
    },
    {
        "content": "* Theravance Biopharma and Mylan announce positive results from 12-month phase 3 safety study of revefenacin (TD-4208) in patients with chronic obstructive pulmonary disease (COPD)",
        "date": "07192017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Theravance Biopharma and Mylan announce positive results from 12-month phase 3 safety study of revefenacin "
    },
    {
        "content": "* FDA oncologic drugs advisory committee unanimously recommends approval of Mylan and Biocon's proposed biosimilar Trastuzumab",
        "date": "07132017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-FDA oncologic drugs advisory committee unanimously recommends approval of Mylan and Biocon's proposed biosimilar Trastuzumab "
    },
    {
        "content": "NEW YORK  June 28 More than a third of investors voting at Mylan NV annual meeting last week cast votes against Chairman Robert Coury's re-election as the generic drugmaker faced a shareholder campaign against its directors and executive pay packages.",
        "date": "06282017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "More than a third of Mylan investors voted against chairman "
    },
    {
        "content": "NEW YORK An investor group led by New York City's comptroller called for Mylan NV's  Chairman Robert Coury and Director Wendy Cameron to step down  as part of a campaign against the firm's executive pay packages and high prices for an allergy treatment.",
        "date": "06292017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Investors call on Mylan chairman  director to step down "
    },
    {
        "content": "* Says shareholders approved appointment of all 11 director nominees",
        "date": "06282017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan shareholders approve appointment of 11 director nominees "
    },
    {
        "content": "NEW YORK  June 28 An investor group led by New York City's comptroller called for Mylan NV's Chairman Robert Coury and Director Wendy Cameron to step down  as part of a campaign against the firm's executive pay packages and high prices for an allergy treatment.",
        "date": "06292017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Investors call on Mylan chairman  director to step down "
    },
    {
        "content": "June 28 New York City And State Comptrollers  Calstrs Call On Mylan",
        "date": "06292017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Investors urge Mylan to fire director-letter "
    },
    {
        "content": "AMSTERDAM Mylan NV shareholders voted against the generic drugmaker's executive pay policy but re-elected the board at its annual meeting on Thursday despite a shareholder campaign in the wake of a scandal over high prices for its EpiPen emergency allergy treatment.",
        "date": "06222017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan shareholders vote against executive pay  re-elect board "
    },
    {
        "content": "NEW YORK Mylan N.V.  is best known for producing EpiPen emergency allergy treatments and generic drugs.",
        "date": "06212017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Drugmaker Mylan gets boost from unlikely source: coal "
    },
    {
        "content": "AMSTERDAM  June 22 Mylan NV shareholders voted against the generic drugmaker's executive pay policy but re-elected the board at its annual meeting on Thursday despite a shareholder campaign in the wake of a scandal over high prices for its EpiPen emergency allergy treatment.",
        "date": "06222017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 4-Mylan shareholders vote against executive pay  re-elect board "
    },
    {
        "content": "Mylan NV shareholders re-elected the generic drugmaker's board at its annual meeting on Thursday  despite a shareholder campaign to vote down most of the directors in the wake of a scandal related to its high prices for emergency allergy treatment EpiPen.",
        "date": "06222017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan shareholders re-elect board  vote against executive pay "
    },
    {
        "content": "AMSTERDAM  June 22 Mylan NV shareholders re-elected the generic drugmaker's board at its annual meeting on Thursday  despite a shareholder campaign to vote down most of the directors in the wake of a scandal related to its high prices for emergency allergy treatment EpiPen.",
        "date": "06222017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan shareholders re-elect board  vote against exec pay "
    },
    {
        "content": "June 15 Adamis Pharmaceuticals on Thursday said it received U.S. approval for its emergency epinephrine syringes to treat severe allergic reactions that would compete with Mylan's widely used EpiPen  sending its shares up 50 percent.",
        "date": "06152017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Adamis gets U.S. approval to sell EpiPen rival  shares soar "
    },
    {
        "content": "* Mylan's letter to shareholders dated june 12 says Teva’s expression of interest was simply not right for Mylan and its stakeholders",
        "date": "06132017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan says Teva's expression of interest was simply not right for Mylan and its stakeholders "
    },
    {
        "content": "Influential proxy firm ISS on Monday turned up the heat on Mylan NV  advising its institutional clients to voice their dissatisfaction with the generic drugmaker's board of directors and its chairman's pay package at its June 22 shareholder meeting.",
        "date": "06122017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "ISS pressures Mylan ahead of shareholder vote "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 09 (Fitch) Fitch Ratings has affirmed Mylan's ratings at 'BBB-' and assigned an 'F3' short-term rating to the company's new commercial paper program. The Rating Outlook is Stable. The ratings apply to $15.3 billion of debt at March 31  2017. See the full list of rating actions at the end of this release. KEY RATING DRIVERS Elevated Leverage to Decline: Mylan is in the process of deleveraging from its partly debt-financed a",
        "date": "06092017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Fitch Affirms Mylan's Ratings at 'BBB-'; Outlook Stable "
    },
    {
        "content": "June 12 Influential proxy firm ISS on Monday turned up the heat on Mylan NV  advising its institutional clients to voice their dissatisfaction with the generic drugmaker's board of directors and its chairman's pay package at its June 22 shareholder meeting.",
        "date": "06122017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-ISS pressures Mylan ahead of shareholder vote "
    },
    {
        "content": "June 12 Influential proxy firm ISS on Monday urged shareholders of generic drugmaker Mylan NV to vote against most of the company's nominees to its board of directors  ahead of a  shareholder meeting later this month.",
        "date": "06122017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "ISS recommends voting against ten Mylan board nominees "
    },
    {
        "content": "June 12 Institutional Shareholder Services (ISS):",
        "date": "06122017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Proxy firm ISS says recommends vote against 10 out of 11 of Mylan's director nominees "
    },
    {
        "content": "Mylan NV  defended Chairman Robert Coury's role to ISS this week as the influential proxy firm prepares to advise shareholders on how they should vote on the re-election of Coury and other directors  according to a letter the drugmaker released on Wednesday.",
        "date": "06072017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan defends chairman to ISS ahead of June 22 investor vote "
    },
    {
        "content": "* Entered into definitive documentation to establish an unsecured commercial paper program -SEC filing",
        "date": "06082017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan enters into definitive documentation "
    },
    {
        "content": "* Mylan NV - ‍u.s. Launch of rasagiline tablets  0.5 mg and 1 mg  a generic version of reference listed drug  Teva's azilect tablets​",
        "date": "06022017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Azilect tablets "
    },
    {
        "content": "June 7 Mylan NV defended Chairman Robert Coury's role to ISS this week as the influential proxy firm prepares to advise shareholders on how they should vote on the re-election of Coury and other directors  according to a letter the drugmaker released on Wednesday.",
        "date": "06072017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan defends chairman to ISS ahead of June 22 investor vote "
    },
    {
        "content": "* Announced u.s. Launch of zoledronic acid injection  5 mg/100 ml single dose vial  a generic version of novartis' reclast® injection",
        "date": "06022017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic reclast injection "
    },
    {
        "content": "* Mylan NV files proxy materials with U.S. SEC with co's letter  dated June 6  to Institutional Shareholder Services",
        "date": "06072017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan  in letter to proxy firm ISS  says Teva never made an offer to acquire Mylan "
    },
    {
        "content": "NEW YORK The U.S. government may have overpaid drugmaker Mylan N.V. by as much as $1.27 billion between 2006 and 2016 for its EpiPen emergency allergy treatment  the Department of Health and Human Services said on Wednesday.",
        "date": "05312017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan may have overcharged U.S. for EpiPen by $1.27 bln -HHS "
    },
    {
        "content": "NEW YORK The U.S. government may have overpaid drugmaker Mylan N.V. by as much as $1.27 billion between 2006 and 2016 for its EpiPen emergency allergy treatment  the Department of Health and Human Services said on Wednesday.",
        "date": "05312017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan may have overcharged U.S. for EpiPen by $1.27 billion: HHS "
    },
    {
        "content": "NEW YORK  May 31 The U.S. government may have overpaid drugmaker Mylan N.V. by as much as $1.27 billion between 2006 and 2016 for its EpiPen emergency allergy treatment  the Department of Health and Human Services said on Wednesday.",
        "date": "05312017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Mylan may have overcharged U.S. for EpiPen by $1.27 bln -HHS "
    },
    {
        "content": "* Sen. Grassley says estimate from Department of Health & Human Services taxpayers may have overpaid for Mylan's Epipen by as much as $1.27 billion from 2006-2016",
        "date": "05312017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Sen. Grassley says HHS estimates taxpayers may have overpaid for Mylan's Epipen by as much as $1.27 bln from 2006-2016 "
    },
    {
        "content": "NEW YORK  May 31 The New York City and State pension funds and the California State Teachers' Retirement System are fighting the re-election of six board members at drugmaker Mylan Inc and its 2016 executive pay including Chairman Robert Coury's compensation of more than $97 million.",
        "date": "05312017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Investment funds urge shareholders to vote down Mylan board  pay "
    },
    {
        "content": "May 31 Calstrs  New York City Pension Funds  PGGM:",
        "date": "05312017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Calstrs  New York City Pension Funds  PGGM urge Mylan shareholders to vote against management proposal 5 to ratify 2016 executive compensation "
    },
    {
        "content": "* Mylan NV says CEO Heather Bresch's 2016 total compensation $13.8 million - sec filing",
        "date": "05232017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan NV says CEO's 2016 compensation was $13.8 mln "
    },
    {
        "content": "Generic drug maker Mylan NV  on Wednesday said it disagrees with the reasoning behind the U.S. Food and Drug Administration's decision not to approve its generic for GlaxoSmithKline Plc's  blockbuster Advair in March. | Video ",
        "date": "05102017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan disagrees with FDA over generic Advair delay "
    },
    {
        "content": "* Shares fall in afternoon trading (Adds analyst comment  updates shares)",
        "date": "05102017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 4-Mylan disagrees with FDA over generic Advair delay "
    },
    {
        "content": "NEW YORK  May 10 Drugmaker Mylan Inc  which is trying to launch a generic form of GlaxoSmithKline's Advair asthma treatment  on Wednesday said it is in disagreement with the U.S. Food and Drug Administration over the standards it must meet.",
        "date": "05102017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan says disagrees with FDA over generic Advair delay "
    },
    {
        "content": "* President says EpiPen will account for less than 5 percent of global revenue and less than 10 percent of north american sales",
        "date": "05102017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan says EpiPen sales suffer from increased competition "
    },
    {
        "content": "May 10 EpiPen maker Mylan NV said on Wednesday first-quarter profit more than quadrupled  as the maker of generic drugs benefited from strong demand outside the United States.",
        "date": "05102017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "EpiPen maker Mylan's profit surges "
    },
    {
        "content": "* CEO Heather Bresch's 2016 total compensation $13.8 million versus $18.9 million in 2015 - SEC filing Source: (http://bit.ly/2pBt59h) Further company coverage:",
        "date": "05012017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan CEO Heather Bresch's 2016 total compensation $13.8 mln "
    },
    {
        "content": "* Mylan nv - nominated sjoerd s. Vollebregt as a candidate for election to mylan's board at 2017 annual meeting of shareholders",
        "date": "05012017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan nominates Sjoerd Vollebregt for election to board "
    },
    {
        "content": "April 24 Sanofi SA on Monday sued Mylan NV  accusing the pharmaceutical company of engaging in illegal conduct to squelch competition to its EpiPen allergy treatment  which has been at the center of a public debate over drug prices.",
        "date": "04242017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Sanofi files U.S. antitrust lawsuit against Mylan over EpiPen "
    },
    {
        "content": "April 24 France's Sanofi SA on Monday sued Mylan NV  accusing the pharmaceutical company of engaging in illegal conduct to squelch competition to its EpiPen allergy treatment  which has been at the center of a public debate over drug prices.",
        "date": "04242017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Sanofi files U.S. antitrust lawsuit against Mylan over EpiPen "
    },
    {
        "content": "* U.S. launch of Perphenazine Tablets USP  2 mg  4 mg  8 mg and 16 mg  a generic version of Trilafon Tablets originally marketed by Schering Source text for Eikon: Further company coverage:",
        "date": "04202017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Trilafon Tablets "
    },
    {
        "content": "Novartis AG on Friday filed a patent infringement lawsuit seeking to block Mylan Inc from launching a generic version of cancer drug Afinitor.",
        "date": "04072017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Novartis sues Mylan over generic version of cancer drug Afinitor "
    },
    {
        "content": "April 11 The U.S. Food and Drug Administration (FDA) has raised concerns over quality controls at a Mylan NV manufacturing plant in India  according to a warning letter from the agency dated April 3.",
        "date": "04112017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "FDA warns Mylan over quality concerns at India facility "
    },
    {
        "content": "April 6 A U.S. appeals court ruled that Mylan Inc's proposed generic version of the blood thinner Angiomax would not infringe on patents held by The Medicines Company.",
        "date": "04062017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Federal appeals court rules Mylan can proceed with generic Angiomax "
    },
    {
        "content": "April 3 Mylan NV has been hit with a new proposed class action lawsuit over the price of its EpiPen allergy treatment  which shot up to more than $600 for a two-pack of the device from less than $100 in 2007.",
        "date": "04032017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan hit with new class action lawsuit over EpiPen pricing "
    },
    {
        "content": "March 31 Generic drugmaker Mylan NV said on Friday that its manufacturing partner for EpiPen devices had expanded a recall of the life-saving allergy shot in the United States and other markets.",
        "date": "03312017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan says EpiPen manufacturing partner to expand device recall "
    },
    {
        "content": "Generic drugmaker Mylan NV said on Friday that its manufacturing partner for EpiPen devices had expanded a recall of the life-saving allergy shot in the United States and other markets.",
        "date": "04032017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan says EpiPen manufacturing partner to expand device recall "
    },
    {
        "content": "April 6 A U.S. appeals court ruled that Mylan Inc's proposed generic version of the blood thinner Angiomax would not infringe on patents held by The Medicines Company.",
        "date": "04062017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Federal appeals court rules Mylan can proceed with generic Angiomax "
    },
    {
        "content": "* Mylan provides update on meridian medical technologies'  a Pfizer company  expanded voluntary worldwide recall of epipen® auto-injector",
        "date": "03312017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan provides update on Meridian Medical Technologies'  expands voluntary worldwide recall of epipen auto-injector "
    },
    {
        "content": "LONDON  March 30 GlaxoSmithKline's new CEO Emma Walmsley  who takes over on April 1  has won a short-term reprieve from the threat of generic Advair with a delay in U.S. approval for Mylan's copy of the blockbuster lung inhaler.",
        "date": "03302017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "GSK's new CEO gets short-term win from generic Advair delay "
    },
    {
        "content": "Mylan NV said on Wednesday the U.S. Food and Drug Administration declined to approve its generic version of GlaxoSmithKline Plc's  blockbuster Advair asthma treatment  but provided no details of the agency's concerns or how long the product might be delayed.",
        "date": "03292017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "FDA declines to approve Mylan's generic of GSK's Advair for now "
    },
    {
        "content": "LONDON A deadline for U.S. regulators to give a verdict on a generic copy of GlaxoSmithKline's blockbuster inhaled lung drug Advair has passed with no sign of approval  sparking speculation that a threat to GSK profits might be delayed.",
        "date": "03292017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "FDA  Mylan silence on generic Advair may be good news for GSK "
    },
    {
        "content": "March 29 Mylan NV said on Wednesday the U.S. Food and Drug Administration declined to approve its generic version of GlaxoSmithKline Plc's blockbuster Advair asthma treatment  but provided no details of the agency's concerns or how long the product might be delayed.",
        "date": "03292017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-FDA declines to approve Mylan's generic of GSK's Advair for now "
    },
    {
        "content": "Generic drugmaker Mylan NV has recalled about 81 000 EpiPen devices in countries outside the United States  following two reports of the life-saving allergy shot failing to work in emergencies.",
        "date": "03222017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan recalls 81 00 EpiPens outside U.S. after reports of failure "
    },
    {
        "content": "* Mylan receives tentative approval for \"TLE400\" under PEPFAR",
        "date": "03202017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan receives tentative approval from U.S. FDA for \"TLE400\" under PEPFAR "
    },
    {
        "content": "March 29 Mylan NV said on Wednesday its application to market a generic copy of GlaxoSmithKline Plc's blockbuster inhaled lung drug Advair was rejected by the U.S. Food and Drug Administration.",
        "date": "03292017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "U.S. FDA rejects Mylan's generic version of GSK's Advair "
    },
    {
        "content": "Generic drugmaker Mylan NV has recalled about 81 000 EpiPen devices in countries outside the United States  following two reports of the life-saving allergy shot failing to work in emergencies.",
        "date": "03222017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan recalls 81 000 EpiPens outside U.S. after reports of failure "
    },
    {
        "content": "* Mylan comments on generic Advair Diskus abbreviated new drug application",
        "date": "03292017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan receives CRL for generic Advair Diskus ANDA "
    },
    {
        "content": "March 22 Generic drugmaker Mylan NV has recalled about 81 000 EpiPen devices in countries outside the United States  following two reports of the life-saving allergy shot failing to work in emergencies.",
        "date": "03222017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "CORRECTED-UPDATE 1-Mylan recalls 81 000 EpiPens outside U.S. after reports of failure "
    },
    {
        "content": "* Hikma seeks okay for competing generic by May 10 (Adds Mylan no comment  more on FDA bioequivalence standards)",
        "date": "03292017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-FDA  Mylan silence on generic Advair may be good news for GSK "
    },
    {
        "content": "LONDON  March 29 GlaxoSmithKline shares gained on Wednesday as lack of news about U.S. approval of a generic copy of its blockbuster inhaled lung drug Advair buoyed speculation that a threat to profits might be delayed.",
        "date": "03292017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "FDA silence on generic Advair may be good news for GSK "
    },
    {
        "content": "* Mylan NV - received final approval from U.S. Food and Drug Administration (FDA) for its abbreviated new drug application (ANDA) for the product  Source text for Eikon: Further company coverage:",
        "date": "03102017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic pristiq tablets "
    },
    {
        "content": "LONDON  March 13 Generic drugmaker Mylan said on Monday it had reached a settlement with Roche providing \"a clear pathway\" for the launch of its biosimilar version of the Swiss company's top-selling breast cancer drug Herceptin in major markets.",
        "date": "03132017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan deal clears path for biosimilar copy of Roche's Herceptin "
    },
    {
        "content": "* Mylan announces global settlement and license agreements with Genentech and Roche on herceptin",
        "date": "03132017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan reports global settlement  license agreements with Genentech  Roche "
    },
    {
        "content": "* Mylan -related to restructuring activities  recorded pre-tax restructuring charges of $149.7 million for certain workforce reduction and cost savings initiatives during 2016",
        "date": "03012017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan records pre-tax restructuring charges of $149.7 mln during 2016 "
    },
    {
        "content": "EpiPen allergy shot maker Mylan NV  forecast 2017 profit and revenue largely above analysts' estimates on Wednesday  in sharp contrast to downbeat expectations from its rivals  amid pricing pressure in the U.S. generics market.",
        "date": "03012017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "EpiPen maker Mylan forecasts strong 2017; shares jump "
    },
    {
        "content": "March 1 EpiPen allergy shot maker Mylan NV  forecast 2017 profit and revenue largely above analysts' estimates on Wednesday  in sharp contrast to downbeat expectations from its rivals  amid pricing pressure in the U.S. generics market.",
        "date": "03012017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-EpiPen maker Mylan forecasts strong 2017; shares jump "
    },
    {
        "content": "* Mylan reports fourth quarter and full year 2016 results and provides 2017 guidance",
        "date": "03012017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan reports Q4 GAAP earnings per share $0.78 "
    },
    {
        "content": "March 1 Generic drugmaker Mylan NV reported a 31.2 percent rise in quarterly revenue  helped by demand for products it gained through the acquisition of Swedish drugmaker Meda last year.",
        "date": "03012017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan's quarterly revenue jumps 31 pct "
    },
    {
        "content": "* U.S. FDA accepts Biologics License Application (BLA) for Mylan and Biocon's proposed biosimilar pegfilgrastim for review",
        "date": "02162017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-FDA accepts BLA for Mylan  Biocon's proposed biosimilar pegfilgrastim for review "
    },
    {
        "content": "* Says U.S. FDA accepts Biologics License Application (BLA) for Mylan and Biocon's proposed biosimilar Pegfilgrastim for review",
        "date": "02162017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-India's Biocon says USFDA accepts BLA for Mylan & co's proposed biosimilar Pegfilgrastim "
    },
    {
        "content": "* Paulson & co cuts share stake in fedex corp by 89.7 percent to 11 000 shares  - sec filing",
        "date": "02142017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Paulson & Co cuts share stake in Fedex  Mylan "
    },
    {
        "content": "WASHINGTON Marathon Pharmaceuticals LLC said on Monday it was \"pausing\" the launch of its Duchenne muscular dystrophy drug after U.S. lawmakers questioned why the company priced it at $89 000 a year when patients had been able to import it for as little as $1 000.",
        "date": "02132017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Marathon pauses Duchenne drug launch amid price outcry "
    },
    {
        "content": "* Vanguard Group Inc reports 5.3 percent passive stake in Mylan NV as of Dec 31  2016  -  SEC filing  Source text - http://bit.ly/2kAVQjF",
        "date": "02102017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Vanguard Group Inc reports 5.3 pct passive stake in Mylan NV as of Dec 31  2016 "
    },
    {
        "content": "WASHINGTON  Feb 13 Marathon Pharmaceuticals LLC said on Monday it was \"pausing\" the launch of its Duchenne muscular dystrophy drug after U.S. lawmakers questioned why the company priced it at $89 000 a year when patients had been able to import it for as little as $1 000.",
        "date": "02132017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Marathon pauses Duchenne drug launch amid price outcry "
    },
    {
        "content": "Feb 6 Mylan NV has agreed to pay $96.5 million to settle  claims by drug purchasers that it delayed launching a generic version of Cephalon Inc's narcolepsy drug Provigil in exchange for payment from Cephalon.",
        "date": "02062017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan agreed to pay $96.5 mln in Provigil antitrust class action "
    },
    {
        "content": "Mylan NV has agreed to pay $96.5 million to settle  claims by drug purchasers that it delayed launching a generic version of Cephalon Inc's narcolepsy drug Provigil in exchange for payment from Cephalon.",
        "date": "02062017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan agreed to pay $96.5 million in Provigil antitrust class action "
    },
    {
        "content": "Feb 6 Mylan NV has agreed to pay $96.5 million to settle  claims by drug purchasers that it delayed launching a generic version of Cephalon Inc's narcolepsy drug Provigil in exchange for payment from Cephalon.",
        "date": "02062017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan agreed to pay $96.5 mln in Provigil antitrust class action "
    },
    {
        "content": "A federal appeals court on Thursday dealt another blow to Mylan Inc’s plans to offer a generic version of an improved antidote for acetaminophen poisoning  ruling that Cumberland Pharmaceutical’s patent on the product was valid.",
        "date": "01272017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Cumberland defeats Mylan’s appeal on Acetadote patent "
    },
    {
        "content": "* Mylan wins U.S. District court ruling related to Copaxone\u007f 40 mg/ml patents  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan wins U.S. court ruling related to Copaxone 40 mg/ml patents "
    },
    {
        "content": "* Mylan received an information request from the FTC months ago as part of a preliminary investigation- Mylan spokeswoman",
        "date": "01302017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan says it received information request from FTC as part of preliminary investigation "
    },
    {
        "content": "* Mylan faces US anti-trust probe over its Epipen practices- CNBC  citing report",
        "date": "01302017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan faces US anti-trust probe over Epipen practices- CNBC  citing report "
    },
    {
        "content": "NEW YORK Mylan NV has yet to reach a settlement with the U.S. Department of Justice over the classification in the Medicaid program of its life-saving EpiPen allergy treatment  according to a letter from a regulatory agency disclosed on Thursday.",
        "date": "01192017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "U.S. health agency tells Grassley there is no EpiPen deal yet "
    },
    {
        "content": "NEW YORK  Jan 19 Mylan NV has yet to reach a settlement with the U.S. Department of Justice over the classification in the Medicaid program of its life-saving EpiPen allergy treatment  according to a letter from a regulatory agency disclosed on Thursday.",
        "date": "01192017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-U.S. health agency tells Grassley there is no EpiPen deal yet "
    },
    {
        "content": "Drugstore chain CVS Health Corp  has cut the price of a generic version of Impax Laboratories Inc's  emergency allergy injection  a device similar to Mylan NV's  controversial EpiPen.",
        "date": "01122017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "CVS slashes price of Impax's EpiPen rival "
    },
    {
        "content": "* U.S. FDA accepts biologics license application (BLA) for Mylan and Biocon's proposed biosimilar trastuzumab",
        "date": "01112017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-U.S. FDA accepts BLA for Mylan and Biocon's proposed biosimilar trastuzumab "
    },
    {
        "content": "* Prophase labs announces agreement to sell cold-eeze(r) brand",
        "date": "01092017",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Prophase labs announces agreement to sell cold-eeze(r) brand "
    },
    {
        "content": "* Says U.S. FDA accepts Biologics License Application (BLA) for Mylan and Biocon's proposed biosimilar trastuzumab",
        "date": "01112017",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Biocon Ltd says USFDA accepts BLA for Mylan & co's proposed biosimilar trastuzumab "
    },
    {
        "content": "Mylan NV  which has come under fire for its drug pricing  said on Friday it would start selling a generic version of its life-saving EpiPen allergy treatment for $300 per two-pack  a more than 50 percent discount. | Video ",
        "date": "12162016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan launches EpiPen generic at $300 per two-pack "
    },
    {
        "content": "Generic drugmaker Mylan NV   which has been under fire for price hikes on the life-saving EpiPen allergy treatment  said on Wednesday that it expected to cut less than 10 percent of its workforce in a restructuring to integrate acquisitions.",
        "date": "12072016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "EpiPen maker Mylan to restructure  cut workforce "
    },
    {
        "content": "* Mylan NV says on November 22  2016  entered into a revolving credit agreement",
        "date": "11292016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan NV enters into a revolving credit agreement "
    },
    {
        "content": "WASHINGTON The U.S. Senate Judiciary Committee on Monday postponed a hearing planned for next week to discuss Mylan NV's  pending $465 million settlement to resolve charges that it underpaid government healthcare programs by misclassifying its EpiPen emergency allergy treatment.",
        "date": "11242016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Senate panel postpones Mylan hearing "
    },
    {
        "content": "Nov 21 Mylan NV has declined a U.S. Senate committee request to testify about a $465 million pending settlement to resolve charges the company underpaid government healthcare programs by misclassifying its the EpiPen emergency allergy treatment.",
        "date": "11212016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan declines Senate committee request to testify about EpiPen "
    },
    {
        "content": "* Says Mylan declining to testify at judiciary committee hearing on potential settlement between Mylan and DOJ  Source text - (http://bit.ly/2fy1MoP) Further company coverage:",
        "date": "11212016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-U.S. senator Chuck Grassley says Mylan declining to testify at judiciary committee hearing "
    },
    {
        "content": "LONDON  Nov 21 (IFR) - Corporate borrowers on both sides of the Atlantic shrugged off concerns about global volatility last week with pharmaceutical companies leading the charge  although they had to pay significantly higher premiums.",
        "date": "11212016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Corporates stay strong despite market rout "
    },
    {
        "content": "* Ups share stake in Mylan NV by 29.4 percent to 6.4 million shares - SEC filing",
        "date": "11142016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Greenlight Capital ups stake in Mylan  cuts in GM "
    },
    {
        "content": "* Shares up 4 pct in premarket trading   (Adds details  shares)",
        "date": "11102016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Perrigo to review options for Multiple Sclerosis drug Tysabri "
    },
    {
        "content": "LONDON  Nov 14 (IFR) - US pharmaceuticals AbbVie and Mylan have set their sights on Europe's bond market to sell debut euro bonds  taking advantage of positive sentiment for the sector after last week's unexpected Donald Trump victory in the US election.",
        "date": "11142016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "US pharmas eye Europe's bond market amid rates volatility "
    },
    {
        "content": "Generic drugmaker Mylan NV said on Wednesday it was working to finalize a settlement with the U.S. government over Medicaid rebates for its EpiPen emergency allergy treatment  adding that money set aside for the settlement led to a third quarter loss.",
        "date": "11092016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan working to finalize EpiPen Medicaid settlement-CFO "
    },
    {
        "content": "Generic drugmaker Mylan NV said on Wednesday it was working to finalize a settlement with the U.S. government over Medicaid rebates for its EpiPen emergency allergy treatment  adding that money set aside for the settlement led to a third quarter loss.",
        "date": "11092016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan working to finalize EpiPen Medicaid settlement: CFO "
    },
    {
        "content": "WASHINGTON The U.S. Senate Judiciary Committee urged federal antitrust regulators on Monday to launch a probe into whether EpiPen maker Mylan NV broke the law by preventing schools from purchasing competing allergy treatments.",
        "date": "11072016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "U.S. Senate panel urges FTC to launch antitrust probe of Mylan "
    },
    {
        "content": "WASHINGTON The internal watchdog at the U.S. Department of Health and Human Services warned the office tasked with administering federal health insurance programs that Mylan NV's EpiPen was improperly classified as a generic drug in 2009  Senator Charles Grassley said on Tuesday.",
        "date": "11082016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "U.S. watchdog told Medicare  Medicaid that EpiPen was misclassified in 2009: senator "
    },
    {
        "content": "Nov 9 Generic drugmaker Mylan NV said on Wednesday it was working to finalize a settlement with the U.S. government over Medicaid rebates for its EpiPen emergency allergy treatment  adding that money set aside for the settlement led to a third quarter loss.",
        "date": "11092016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Mylan working to finalize EpiPen Medicaid settlement-CFO "
    },
    {
        "content": "* Mylan sees generic drugs price erosion in mid single digits for rest of year",
        "date": "11092016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan CEO sees EpiPen accounting for 6 pct of 2017 sales "
    },
    {
        "content": "WASHINGTON  Nov 8 The internal watchdog at the U.S. Department of Health and Human Services warned the office tasked with administering federal health insurance programs that Mylan NV's EpiPen was improperly classified as a generic drug in 2009  Senator Charles Grassley said on Tuesday.",
        "date": "11082016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-U.S. watchdog told Medicare  Medicaid that EpiPen was misclassified in 2009 -senator "
    },
    {
        "content": "WASHINGTON  Nov 8 The internal watchdog at the U.S. Department of Health and Human Services warned the office tasked with administering federal health insurance programs that Mylan NV's EpiPen was improperly classified as a generic drug in 2009  Senator Charles Grassley said Tuesday.",
        "date": "11082016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Internal watchdog told Medicare  Medicaid centers EpiPen was misclassified in 2009 "
    },
    {
        "content": "* We continue to see pricing across very broad generics portfolio to be in line with expectations",
        "date": "11092016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan reports Q3 loss per share $0.23 "
    },
    {
        "content": "Nov 9 Generic drugmaker Mylan NV  which is under investigation and has faced harsh criticism over steep price increases for its EpiPen emergency allergy treatment  on Wednesday reported a third quarter loss due the cost of a proposed settlement with the U.S. department of Justice and other government agencies.",
        "date": "11092016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan posts 3rd-quarter loss on proposed settlement costs "
    },
    {
        "content": "WASHINGTON  Nov 7 The U.S. Senate Judiciary Committee urged federal antitrust regulators on Monday to launch a probe into whether EpiPen maker Mylan NV broke the law by preventing schools from purchasing competing allergy treatments.",
        "date": "11072016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-U.S. Senate panel urges FTC to launch antitrust probe of Mylan "
    },
    {
        "content": "* Mylan and Biocon announce regulatory submission for insulin glargine accepted for review by European Medicines Agency  Source text for Eikon:  Further company coverage:",
        "date": "11032016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan and Biocon announce regulatory submission for insulin glargine "
    },
    {
        "content": "WASHINGTON West Virginia Attorney General Patrick Morrisey on Wednesday blasted Mylan NV's announced $465 million settlement with the U.S. Justice Department over the drugmaker's classification of its lifesaving allergy treatment EpiPen as a generic  saying the amount was \"woefully deficient.\"",
        "date": "11022016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "West Virginia urges Justice Dept to reject settlement with Mylan "
    },
    {
        "content": "* Biocon Ltd says Mylan and Biocon announce U.S. FDA submission for proposed biosimilar trastuzumab  Source text - (http://bit.ly/2eA3Db3) Further company coverage:",
        "date": "11082016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Biocon and Mylan announce U.S. FDA submission for proposed biosimilar Trastuzumab "
    },
    {
        "content": "* Hospital shares crushed on Obamacare rollback worries   (Adds background on biotechs  analyst comment  updates share moves)",
        "date": "11092016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 4-Pharma  biotech shares soar as Trump win calms pricing talk "
    },
    {
        "content": "Nov 7 Three members of the U.S. Senate Judiciary Committee  ahead of a planned hearing late this month  said Mylan NV appears to have greatly overcharged the military for its lifesaving allergy treatment EpiPen and asked the pharmaceutical company when it plans to reimburse the Department of Defense.",
        "date": "11072016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Three U.S. senators ask Mylan for EpiPen military reimbursements "
    },
    {
        "content": "* Mylan and Biocon announce regulatory submission for insulin glargine accepted for review by European Medicines Agency",
        "date": "11032016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Biocon says EMA accepts for review Mylan's regulatory submission for insulin glargine "
    },
    {
        "content": "* Strides Shasun Ltd says co  Mylan agree to settle regulatory and general claims on Agila transaction",
        "date": "11032016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Strides Shasun  Mylan agree to settle regulatory  general claims on Agila deal "
    },
    {
        "content": "NEW YORK/WASHINGTON Mylan NV's price hikes on EpiPens have added millions to U.S. Department of Defense spending since 2008 as the agency covered more prescriptions for the lifesaving allergy shot at near retail prices  government data provided to Reuters shows.",
        "date": "10282016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Exclusive: EpiPen price hikes add millions to Pentagon costs "
    },
    {
        "content": "WASHINGTON  Nov 2 West Virginia Attorney General Patrick Morrisey on Wednesday blasted Mylan NV's  announced $465 million settlement with the U.S. Justice Department over the drugmaker's classification of its lifesaving allergy treatment EpiPen as a generic  saying the amount was \"woefully deficient.\"",
        "date": "11022016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 3-West Virginia urges Justice Dept to reject settlement with Mylan "
    },
    {
        "content": "* Two U.S. Senators seek answers on how Mylan price spikes on EpiPen have impacted U.S. military's budget",
        "date": "11022016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Lawmakers seek details on U.S. military's spending on EpiPens "
    },
    {
        "content": "* Mylan launches first generics of Benicar\u007f and Benicar HCT\u007f Tablets  Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches first generics of Benicar\u007f and Benicar HCT\u007f Tablets "
    },
    {
        "content": "WASHINGTON  Nov 2 West Virginia Attorney General Patrick Morrisey on Wednesday blasted a pending $465 million settlement between Mylan NV and the U.S. Justice Department over the misclassification of the EpiPen  saying it is \"woefully deficient.\"",
        "date": "11022016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "REFILE-West Virginia urges Justice Dept to reject \"sweetheart\" settlement with Mylan "
    },
    {
        "content": "Privately held drugmaker Kaleo Inc announced on Wednesday plans for a U.S. relaunch of its Auvi-Q injector for life-threatening allergic reactions in the first half of next year.",
        "date": "10262016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "EpiPen rival plans return to U.S. market in first-half 2017 "
    },
    {
        "content": "* Mylan nv - momenta has achieved milestone necessary to earn a $25 million payment from mylan.",
        "date": "11022016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Momenta and Mylan initiate early-stage study for proposed biosimilar of Orencia "
    },
    {
        "content": "Mylan NV on Friday said it will pay $465 million to settle the question of whether misclassification of its EpiPen emergency allergy treatment resulted in underpayment of rebates to the U.S. Medicaid healthcare program.",
        "date": "10072016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan pays $465 million to settle EpiPen Medicaid rebate dispute "
    },
    {
        "content": "Oct 7 Mylan NV said it agreed to a $465 million settlement with the U.S. Department of Justice related to the manner in which it had improperly classified its EpiPen emergency allergy treatment to pay lower rebates to state health programs.",
        "date": "10072016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan agrees to $465 mln settlement over EpiPen classification "
    },
    {
        "content": "WASHINGTON A U.S. federal health agency said on Wednesday it had \"expressly advised\" Mylan NV  that the drugmaker had improperly classified its EpiPen emergency allergy treatment in a way that allowed it to pay lower rebates to state health programs.",
        "date": "09292016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "U.S. agency told Mylan that EpiPen was misclassified "
    },
    {
        "content": "* Received final approval from U.S. FDA for its abbreviated new drug application for metformin hydrochloride extended-release tablets USP  Source text for Eikon:  Further company coverage:",
        "date": "09302016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Fortamet tablets "
    },
    {
        "content": "A Johnson & Johnson unit and Gilead Sciences Inc can pursue a lawsuit seeking to stop Mylan NV from making a generic version of Gilead's HIV drug Complera in Delaware federal court  a judge has ruled.",
        "date": "09302016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Lawsuit over generic HIV drug can stay in Delaware - judge "
    },
    {
        "content": "WASHINGTON A U.S. federal health agency said on Wednesday it had \"expressly advised\" Mylan NV  that the drugmaker had improperly classified its EpiPen emergency allergy treatment in a way that allowed it to pay lower rebates to state health programs.",
        "date": "09282016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "U.S. agency told Mylan that EpiPen was misclassified "
    },
    {
        "content": "Mylan NV  faced questions on Monday about the profit on its EpiPen emergency allergy treatment  following a report that the company makes 60 percent more on the injector than it had told Congress.",
        "date": "09262016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan faces scrutiny over EpiPen profit data shown to Congress "
    },
    {
        "content": "WASHINGTON  Sept 28 A U.S. federal health agency said on Wednesday it had \"expressly advised\" Mylan NV  that the drugmaker had improperly classified its EpiPen emergency allergy treatment in a way that allowed it to pay lower rebates to state health programs.",
        "date": "09282016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-U.S. agency told Mylan that EpiPen was misclassified "
    },
    {
        "content": "* Mylan NV sees 2016 sales for EpiPen in U.S. $1 100 MLN - SEC Filing",
        "date": "09262016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan NV sees 2016 sales for EpiPen in U.S. of $1 100 mln - SEC Filing "
    },
    {
        "content": "WASHINGTON  Sept 28 A U.S. health agency said on Wednesday it had \"expressly advised\" Mylan  that the company had misclassified the EpiPen in a way that led to the company paying a lower rebate to states.",
        "date": "09282016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "U.S. agency says it advised Mylan that EpiPen was misclassified "
    },
    {
        "content": "Sept 26 Under fire generic drugmaker Mylan NV  reiterated it makes a net profit of $104  after taxes  for a pair of its EpiPen emergency allergy treatment sold in the United States  the company said in a filing on Monday.",
        "date": "09262016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan reiterates profit on EpiPen two-pack in US "
    },
    {
        "content": "CHICAGO When Mylan NV recruited food allergy bloggers to learn about its campaign to get allergic shock antidotes into schools  many were eager to join the maker of the EpiPens they carry in purses and stash in book bags to protect their children against potentially lethal attacks.",
        "date": "09232016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Parent bloggers question role in Mylan’s EpiPen schools push "
    },
    {
        "content": "CHICAGO  Sept 23 When Mylan NV recruited food allergy bloggers to learn about its campaign to get allergic shock antidotes into schools  many were eager to join the maker of the EpiPens they carry in purses and stash in book bags to protect their children against potentially lethal attacks.",
        "date": "09232016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Parent bloggers question role in Mylan's EpiPen schools push "
    },
    {
        "content": "WASHINGTON U.S. lawmakers on Wednesday blasted Mylan NV Chief Executive Heather Bresch for sharply increasing prices for the EpiPen emergency allergy treatment at a congressional hearing in which Republicans and Democrats questioned the reasons behind rising U.S. drug costs.",
        "date": "09212016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "U.S. lawmakers blast Mylan CEO over 'sickening' EpiPen price hikes "
    },
    {
        "content": "NEW YORK Mylan NV faced new scrutiny over price hikes for its anti-allergy EpiPen on Tuesday  with U.S. lawmakers calling for a probe of oversight of the company's rebates to government healthcare plans  while West Virginia said it was investigating whether Mylan defrauded its Medicaid department.",
        "date": "09202016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Senate Republicans seek probe of Mylan EpiPen oversight "
    },
    {
        "content": "WASHINGTON  Sept 21 U.S. lawmakers on Wednesday blasted Mylan NV Chief Executive Heather Bresch for sharply increasing prices for the EpiPen emergency allergy treatment at a congressional hearing in which Republicans and Democrats questioned the reasons behind rising U.S. drug costs.",
        "date": "09212016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-U.S. lawmakers blast Mylan CEO over 'sickening' EpiPen price hikes "
    },
    {
        "content": "WASHINGTON  Sept 21 U.S. lawmakers on Wednesday blasted steep price increases for Mylan's EpiPen emergency allergy treatment as they grilled the company's Chief Executive Heather Bresch at a congressional hearing.",
        "date": "09212016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "U.S. lawmakers grill Mylan CEO over EpiPen steep price increases "
    },
    {
        "content": "NEW YORK  Sept 20 Shares of Mylan NV are trading at historically low valuations as the company's chief executive officer is set to face a congressional grilling on Wednesday over the price of its EpiPen emergency allergy treatment.",
        "date": "09202016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan shares languish at low valuation as EpiPen hearing nears "
    },
    {
        "content": "Sept 20 The state of West Virginia is investigating whether Mylan NV violated antitrust laws or defrauded the state's Medicaid program in connection with its EpiPen device.",
        "date": "09202016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "West Virginia investigating Mylan over EpiPen pricing "
    },
    {
        "content": "NEW YORK Mylan NV  faced new scrutiny over price hikes for its anti-allergy EpiPen on Tuesday  with U.S. lawmakers calling for a probe of oversight of the company’s rebates to government healthcare plans  while West Virginia said it was investigating whether Mylan defrauded its Medicaid department.",
        "date": "09212016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Senate Republicans seek probe of Mylan EpiPen oversight "
    },
    {
        "content": "NEW YORK Shares of Mylan NV  are trading at historically low valuations as the company's chief executive officer is set to face a congressional grilling on Wednesday over the price of its EpiPen emergency allergy treatment.",
        "date": "09212016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan shares languish at low valuation as EpiPen hearing nears "
    },
    {
        "content": "NEW YORK U.S. government spending on Mylan Inc's  EpiPen in the Medicare program for seniors and the disabled rose 1 151 percent from 2007 through 2014  while the number of EpiPen users grew 164 percent  the Kaiser Family Foundation said on Tuesday in an analysis.",
        "date": "09212016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Medicare EpiPen spending outpaces prescription growth: Kaiser report "
    },
    {
        "content": "NEW YORK  Sept 20 Mylan NV faced new scrutiny over price hikes for its anti-allergy EpiPen on Tuesday  with U.S. lawmakers calling for a probe of oversight of the company's rebates to government healthcare plans  while West Virginia said it was investigating whether Mylan defrauded its Medicaid department.",
        "date": "09212016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 4-Senate Republicans seek probe of Mylan EpiPen oversight "
    },
    {
        "content": "Aug 9 Mylan NV on Tuesday reported higher second quarter  profit on increased demand for its generic medicines and specialty drugs.",
        "date": "08092016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan 2nd quarter profit rises; 2016 EPS forecast unchanged "
    },
    {
        "content": "Perrigo Co Plc  slashed its full-year earnings forecast for the second time  citing pricing pressure in its generic drugs business  sending its shares down as much as 13 percent and wiping out about $1.77 billion of market value.",
        "date": "08102016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Perrigo slashes full-year forecast again  shares plunge "
    },
    {
        "content": "* Meda shareholders representing approximately 94% of Meda shares accept Mylan offer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08022016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Meda shareholders accept Mylan offer "
    },
    {
        "content": "* Mylan launches generic Dexedrine\u007f capsules  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom : +1-646-223-8780)",
        "date": "08012016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Dexedrine capsules "
    },
    {
        "content": "* Mylan receives U.S. FTC clearance for proposed Meda acquisition",
        "date": "07272016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan gets U.S. FTC clearance for proposed Meda buy "
    },
    {
        "content": "* Mylan and Biocon announce regulatory submission for proposed Biosimilar Pegfilgrastim accepted for review by European Medicines Agency  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "07212016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan and Biocon announce regulatory submission accepted for review by EMA "
    },
    {
        "content": "BRUSSELS  July 20 EU antitrust regulators said on Wednesday they had cleared generic drugmaker Mylan's  planned cash-and-stock purchase of Sweden's Meda  subject to it selling certain assets.",
        "date": "07202016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan gets EU approval for Meda purchase  subject to conditions "
    },
    {
        "content": "U.S. generic drugmaker Mylan is expected to win conditional EU antitrust approval for its planned takeover of Swedish rival Meda AB after agreeing to shed some assets  two people familiar with the matter said on Friday.",
        "date": "07152016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan to get EU green light for Swedish drugmaker deal -sources "
    },
    {
        "content": "* Pulmatrix led pilot pharmacokinetic clinical study and supportive development work with collaborative support from Mylan",
        "date": "07192016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Pulmatrix and Mylan collaborate for pilot pharmacokinetic clinical study "
    },
    {
        "content": "BRUSSELS U.S. generic drugmaker Mylan  is expected to win conditional EU antitrust approval for its planned takeover of Swedish rival Meda AB  after agreeing to shed some assets  two people familiar with the matter said on Friday.",
        "date": "07152016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Exclusive: Mylan to get EU green light for Swedish drugmaker deal - sources "
    },
    {
        "content": "* U.S. Launch of Temozolomide capsules  5 mg  20 mg  100 mg  140 mg  180 mg and 250 mg  which is a generic version of Merck's Temodar  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07112016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Temodar capsules "
    },
    {
        "content": "* u.s. Launch of fenofibrate tablets usp  40 mg and 120 mg  which is a generic version of santarus's fenoglide\u007f",
        "date": "07062016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Fenoglide tablets "
    },
    {
        "content": "BRUSSELS  July 6 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "07062016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "EU mergers and takeovers (July 6) "
    },
    {
        "content": "BRUSSELS  June 30 - U.S. generic drugmaker Mylan NV  has offered concessions in a bid to allay concerns by EU competition regulators over its proposed $7.2-billion acquisition of Swedish rival Meda  the European Commission said on Thursday.",
        "date": "06302016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan offers EC concessions to get approval for $7.2 bln Meda buy "
    },
    {
        "content": "* Says confirmed that Attorney General of Netherlands has rejected request of Dutch group VEB",
        "date": "06202016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan NV confirms that Attorney General of Netherlands has rejected request of VEB "
    },
    {
        "content": "* U.S. launch of Dutasteride capsules  0.5 mg  generic version of GlaxoSmithKline's avodart capsules  Source text for Eikon:  Further company coverage:",
        "date": "06242016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic version of GSK's avodart capsules "
    },
    {
        "content": "* Mylan and Biocon to present phase 3 trastuzumab biosimilar data at the American Society Of Clinical Oncology (ASCO) annual meeting",
        "date": "06032016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan and Biocon to present phase 3 trastuzumab biosimilar data at ASCO annual meeting "
    },
    {
        "content": "* Pricing of a private placement of $6 .5 billion aggregate principal amount of senior notes",
        "date": "05312016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan prices senior notes "
    },
    {
        "content": "* U.S. launch of propafenone hydrochloride extended-release capsules USP  225 mg  325 mg  425 mg  a generic version of glaxosmithkline's Rythmol Sr  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06022016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic rythmol sustained-release capsules "
    },
    {
        "content": "* Announced U.S. launch of armodafinil tablets  50 mg  150 mg  250 mg  a generic version of Cephalon's nuvigil  Source text for Eikon:  Further company coverage:",
        "date": "06012016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches first generic of nuvigil tablets in U.S. "
    },
    {
        "content": "BRUSSELS - European Union antitrust regulators will rule by July 6 whether to allow U.S. generic drugmaker Mylan NV to buy Swedish peer Meda or open a full-scale investigation.",
        "date": "06022016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "EU regulators to rule on Mylan's $7.2 billion Meda bid by July 6 "
    },
    {
        "content": "BRUSSELS  June 2 - European Union antitrust regulators will rule by July 6 whether to allow U.S. generic drugmaker Mylan NV  to buy Swedish peer Meda or open a full-scale investigation.",
        "date": "06022016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "EU regulators to rule on Mylan's $7.2 bln Meda bid by July 6 "
    },
    {
        "content": "Mylan NV  said it would buy a part of the topicals-focused drug business of Renaissance Acquisition Holdings LLC for $950 million to expand its dermatological product portfolio.",
        "date": "05132016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan to buy Renaissance's topical business for $950 million "
    },
    {
        "content": "* Mylan launches generic frova\u007f tablets  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05122016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Frova tablets "
    },
    {
        "content": "May 13 Mylan NV said it would buy a part of the topicals-focused drug business of Renaissance Acquisition Holdings LLC for $950 million to expand its dermatological product portfolio.",
        "date": "05132016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan to buy Renaissance's topical business for $950 mln "
    },
    {
        "content": "May 13 Drugmaker Mylan NV said it would buy Renaissance Acquisition Holdings LLC's non-sterile  topicals-focused specialty and generics business for $950 million.",
        "date": "05132016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan to buy Renaissance's topical business for $950 mln "
    },
    {
        "content": "* Chief Executive Officer Heather Bresch's total 2015 compensation $13.1 million versus $25.8 million in 2014",
        "date": "05052016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan NV says CEO Heather Bresch's total 2015 compensation $13.1 mln "
    },
    {
        "content": "* u.s. Launch of hydralazine hydrochloride injection usp  20 mg/ml  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "05052016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic version of Novartis' hypertension drug "
    },
    {
        "content": "* Says former CFO John D. Sheehan and Mylan Inc. entered into a retirement and consulting agreement - SEC Filing",
        "date": "04142016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan NV former CFO John D. Sheehan enters into retirement and consulting agreement "
    },
    {
        "content": "* u.s. Launch of metoprolol tartrate tablets usp  37.5 mg and 75 mg  which is generic version of novartis' lopressor tablets  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04112016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan NV launches intermediate dosage strengths of generic Lopressor tablets "
    },
    {
        "content": "* U.S. launch of Lamivudine Tablets USP  150 mg and 300 mg  which is generic version of ViiV Healthcare's Epivir tablets  Source text for Eikon:  Further company coverage:",
        "date": "04062016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Epivir tablets in U.S. "
    },
    {
        "content": "* U.S. launch of Tramadol Hydrochloride extended-release tablets USP  100 mg  200 mg and 300 mg",
        "date": "03282016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Mylan launches generic Ultram extended-release tablets "
    },
    {
        "content": "* United states court of appeals for federal circuit upheld a lower court ruling",
        "date": "03212016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Acorda Therapeutics says court upheld ruling in co's ANDA litigation against Mylan "
    },
    {
        "content": "Feb 10 Generic drug maker Mylan NV said it would buy Sweden's Meda AB for about $9.9 billion  including debt  in a combination of cash and stock.",
        "date": "02102016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan says to buy Sweden's Meda "
    },
    {
        "content": "Generic drugmaker Mylan NV  said it would acquire Meda AB  in a $7.2 billion cash-and-stock deal in its third attempt to buy the Swedish company. | Video ",
        "date": "02112016",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan to buy Swedish drugmaker Meda in $7.2 billion deal "
    },
    {
        "content": "* Mylan Q4 earnings  rev miss estimates   (Adds comments on the deal  quotes from Meda chairman)",
        "date": "02112016",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 3-Mylan to buy Swedish drugmaker Meda in $7.2 bln deal "
    },
    {
        "content": "Dec 2 Morgan Stanley named John Collins as the co-head of its global healthcare banking group  according to an internal memo on Wednesday. He replaces Clint Gartin  who will become  chairman of investment banking.",
        "date": "12072015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "CORRECTED-Morgan Stanley names Collins to global healthcare banking co-head role: memo "
    },
    {
        "content": "Dec 4 Mylan N.V. said on Friday it had been subpoenaed by the antitrust division of the U.S. Department of Justice  seeking information related to the marketing  pricing and sale of its generic doxycycline products.",
        "date": "12042015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan receives subpoena from Department of Justice "
    },
    {
        "content": "Generic Drugmaker Mylan NV  plans to buy back shares worth up to $1 billion  after Perrigo Co Plc'S  shareholders spurned its $26 billion hostile bid.",
        "date": "11162015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan to buy back $1 billion in stock "
    },
    {
        "content": "Nov 16 Generic Drugmaker Mylan NV plans to buy back shares worth up to $1 billion  after Perrigo Co Plc'S shareholders spurned its $26 billion hostile bid.",
        "date": "11162015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan to buy back $1 bln in stock "
    },
    {
        "content": "Perrigo Company Plc   the Irish-based generic drugmaker trying to fend off a hostile bid by Mylan NV   held unsuccessful talks to acquire Endo International Plc  in an all-stock deal  according to people familiar with the matter.",
        "date": "11122015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan-targeted Perrigo held merger talks with Endo: sources "
    },
    {
        "content": "Perrigo Co Plc's  shareholders rejected Mylan NV's  $26 billion hostile bid  ending the Netherlands-based generic drug maker's seven-month pursuit of its smaller rival. | Video ",
        "date": "11132015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Perrigo shareholders snub drugmaker Mylan's $26 billion hostile bid "
    },
    {
        "content": "Nov 12 Perrigo Company Plc  the Irish-based generic drugmaker trying to fend off a hostile bid by Mylan NV  held unsuccessful talks to acquire Endo International Plc in an all-stock deal  according to people familiar with the matter.",
        "date": "11122015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan-targeted Perrigo held merger talks with Endo -sources "
    },
    {
        "content": "* Perrigo shares fall as much as 10 pct   (Adds analysts comments  background; updates shares)",
        "date": "11132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 3-Perrigo shareholders snub drugmaker Mylan's $26 bln hostile bid "
    },
    {
        "content": "Drugmaker Mylan NV's  $26 billion hostile bid for Perrigo Co Plc  failed on Friday  putting an end to the ongoing saga  which started more than seven months ago.",
        "date": "11132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan fails in $26 billion takeover bid for Perrigo "
    },
    {
        "content": "Nov 13 Drugmaker Mylan NV's $26 billion hostile bid for Perrigo Co Plc failed on Friday  putting an end to the ongoing saga  which started more than seven months ago.",
        "date": "11132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "TIMELINE-Mylan fails in $26 bln takeover bid for Perrigo "
    },
    {
        "content": "* Indexes down: Dow 0.16 pct  S&P 0.19 pct  Nasdaq 0.37 pct   (Updates to open)",
        "date": "11132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "US STOCKS-Wall St lower on fears of retail slowdown; Cisco drags "
    },
    {
        "content": "Nov 13 Mylan NV said on Friday that 40 percent of Perrigo Co Plc's shares were tendered in its $26 billion hostile takeover offer  falling short of the goal of 50 percent.",
        "date": "11132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan says 40 percent of Perrigo shares tendered  misses goal "
    },
    {
        "content": "Nov 13 U.S. stock index futures were slightly lower on Friday  a day after a sharp selloff that saw S&P 500 and the Dow close below a key technical level  and ahead of retail sales and consumer sentiment data  amid growing concerns of a slowdown in demand.",
        "date": "11132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "US STOCKS-Futures drop ahead of retail sales  consumer sentiment data "
    },
    {
        "content": "Generic drug maker Mylan NV's  $26 billion hostile bid for peer Perrigo Company Plc  looked unlikely to succeed late on Thursday  a few hours before it was set to expire  according to people familiar with the matter.",
        "date": "11132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan's tender offer for Perrigo unlikely to succeed: sources "
    },
    {
        "content": "Nov 12 Generic drug maker Mylan NV's $26 billion hostile bid for peer Perrigo Company Plc looked unlikely to succeed late on Thursday  a few hours before it was set to expire  according to people familiar with the matter.",
        "date": "11132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan's tender offer for Perrigo unlikely to succeed -sources "
    },
    {
        "content": "TEL AVIV  Nov 2 Shares in Mylan will begin trading in Tel Aviv on Nov. 4  the Tel Aviv Stock Exchange (TASE) said on Monday  as the generic drugmaker seeks to strengthen its hand in its hostile bid for rival Perrigo Co Plc   which is also listed on the bourse.",
        "date": "11022015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan shares to begin trading in Tel Aviv on Nov. 4 "
    },
    {
        "content": "TEL AVIV Mylan will likely win its bid to take over Irish-based generic drugmaker Perrigo Co  but if the bid fails the company can live without seeking an alternative acquisition  its chairman said on Wednesday.",
        "date": "11042015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan not relying on acquisitions if Perrigo bid fails: chairman "
    },
    {
        "content": "WASHINGTON Mylan  received U.S. antitrust approval for its hostile bid for Irish-based generic drugmaker Perrigo Co   the Federal Trade Commission said on Tuesday.",
        "date": "11032015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "FTC approves Mylan's hostile bid for Perrigo with conditions "
    },
    {
        "content": "TEL AVIV  Nov 4 Mylan will likely win its bid to take over Irish-based generic drugmaker Perrigo Co   but if the bid fails the company can live without seeking an alternative acquisition  its chairman said on Wednesday.",
        "date": "11042015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan not relying on acquisitions if Perrigo bid fails -chairman "
    },
    {
        "content": "WASHINGTON  Nov 3 Mylan received U.S. antitrust approval for its hostile bid for Irish-based generic drugmaker Perrigo Co  the Federal Trade Commission said on Tuesday.",
        "date": "11032015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-FTC approves Mylan's hostile bid for Perrigo with conditions "
    },
    {
        "content": "WASHINGTON Mylan  received U.S. antitrust approval for its hostile bid for Irish-based generic drugmaker Perrigo Co  under the condition Mylan sells seven drugs to Alvogen Group Inc  the Federal Trade Commission said on Tuesday.",
        "date": "11042015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "FTC approves Mylan's hostile bid for Perrigo with conditions "
    },
    {
        "content": "WASHINGTON  Nov 3 Mylan received U.S. antitrust approval for a hostile takeover of Irish-based generic drugmaker Perrigo Co  the Federal Trade Commission said on Tuesday.",
        "date": "11032015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "FTC approves hostile Mylan takeover of Perrigo with conditions "
    },
    {
        "content": "WASHINGTON  Nov 3 Mylan received U.S. antitrust approval for its hostile bid for Irish-based generic drugmaker Perrigo Co under the condition Mylan sells seven drugs to Alvogen Group Inc  the Federal Trade Commission said on Tuesday.",
        "date": "11042015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-FTC approves Mylan's hostile bid for Perrigo with conditions "
    },
    {
        "content": "Oct 30 Vertex Pharmaceuticals Inc said it received a subpoena from the U.S. Department of Justice in the third quarter  seeking documents related primarily to its \"good laboratory practices\" in a bioanalytical lab.",
        "date": "10302015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Vertex  Mylan  CVS subpoenaed by federal agencies "
    },
    {
        "content": "TEL AVIV  Oct 27 The chief executive of Irish-based generic drugmaker Perrigo Co on Tuesday urged shareholders not to accept rival Mylan NV's $25 billion hostile bid for the company.",
        "date": "10272015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Perrigo CEO doesn't believe Mylan's hostile bid will succeed "
    },
    {
        "content": "Oct 28 Mylan NV said an Israeli district court has ruled against target Perrigo Company Plc's  attempt to block Mylan's listing on the Tel Aviv Stock Exchange.",
        "date": "10282015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Israeli court rules in favour of Mylan's Tel Aviv stock listing "
    },
    {
        "content": "Mylan NV   embroiled in an increasingly bitter takeover attempt for fellow drugmaker Perrigo Co Plc   posted a better-than-expected quarterly profit on Friday as sales of its generic drugs increased in North America and Europe.",
        "date": "10302015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan profit beats as generic sales jump in North America and Europe "
    },
    {
        "content": "* Shares little changed in light premarket trading   (Adds forecast  details; updates shares)",
        "date": "10302015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Mylan profit beats as generic sales jump in N.America and Europe "
    },
    {
        "content": "Oct 30 Mylan NV  which has made a hostile bid for Perrigo Co Plc  posted a 29 percent rise in quarterly revenue as demand for its generic drugs increased in North America and Europe.",
        "date": "10302015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan revenue rises 29 percent "
    },
    {
        "content": "Perrigo Co Plc  said it would lay off 6 percent of its global workforce and buy back shares worth $2 billion to boost earnings  as the generic drug maker looks to convince investors to rebuff Mylan NV's  hostile bid.",
        "date": "10222015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Perrigo plans job cuts  share buyback as Mylan deadline looms "
    },
    {
        "content": "Oct 21 A lawyer for Perrigo Co on Wednesday urged a federal judge in Manhattan to stop Mylan NV from moving forward with its unsolicited offer to buy the Michigan-based drugmaker until it corrects what he called misleading statements to Perrigo shareholders.",
        "date": "10212015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Perrigo urges judge to put Mylan offer on hold "
    },
    {
        "content": "* Perrigo shares fall as much as 8 pct   (Adds CEO  analyst comments; updates shares)",
        "date": "10222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 4-Perrigo plans job cuts  share buyback as Mylan deadline looms "
    },
    {
        "content": "Oct 22 Drugmaker Perrigo Co Plc said it would cut about 800 jobs and buy back $2 billion worth of common shares as it looks to stave off a hostile bid from Mylan NV .",
        "date": "10222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Perrigo to cut 800 jobs  buy back $2 bln in shares "
    },
    {
        "content": "Oct 13 The Irish Takeover Panel said on Tuesday that it had rejected Perrigo Company Plc's request to declare Mylan NV's unsolicited tender offer lapsed.",
        "date": "10132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Irish takeover panel rejects Perrigo's request over Mylan offer "
    },
    {
        "content": "(Adds details  background)     Oct 13 The Irish Takeover Panel said on Tuesday that it had rejected generic drugmaker Perrigo Company Plc's  request to declare Mylan NV's unsolicited tender offer lapsed.     The offer from Mylan remains \"lawful and valid and fully capable of acceptance\" by all Perrigo shareholders including Israeli ones  the takeover panel said.      Netherlands-based Mylan has offered $75 in cash and 2.3 Mylan shares for each Perrigo share  a combination now wort",
        "date": "10132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Irish takeover panel rejects Perrigo's request over Mylan offer "
    },
    {
        "content": "* Perrigo recently made an application to Panel requesting Panel to declare Mylan's offer of Sept. 14  2015 lapsed",
        "date": "10132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Irish Takeover Panel rejects Perrigo application to declare Mylan offer lapsed "
    },
    {
        "content": "NEW YORK  Sept 22 Mylan NV countersued Perrigo Company Plc on Tuesday over \"serious misstatements\" it made related to the generic and over-the-counter drugmaker's unsolicited $27 billion tender offer.",
        "date": "09222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan countersues Perrigo over 'misstatements' about tender offer "
    },
    {
        "content": "NEW YORK  Sept 22 Mylan NV countersued Perrigo Co on Tuesday over \"serious misstatements\" it made as part of its defense against an unsolicited $27 billion tender offer by the generic and over-the-counter drugmaker.",
        "date": "09222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan countersues Perrigo over 'misstatements' about tender offer "
    },
    {
        "content": "Generic and over-the-counter drugmaker Perrigo Co on Thursday urged its shareholders to reject Mylan NV's unsolicited $27 billion tender offer  saying it substantially undervalued the company.",
        "date": "09172015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Perrigo recommends shareholders reject Mylan's tender offer "
    },
    {
        "content": "Sept 17 Generic and over-the-counter drugmaker Perrigo Co on Thursday urged its shareholders to reject Mylan NV's unsolicited $27 billion tender offer  saying it substantially undervalued the company.",
        "date": "09172015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 3-Perrigo recommends shareholders reject Mylan's tender offer "
    },
    {
        "content": "Sept 17 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "09172015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Sept 17 Perrigo Co Plc rejected Mylan NV's unsolicited $27 billion tender offer  saying it substantially undervalued the company and did not adequately compensate shareholders.",
        "date": "09172015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Perrigo rejects Mylan's tender offer "
    },
    {
        "content": "Sept 14 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "09142015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Sept 14 Mylan NV said it launched a tender offer to acquire fellow generic drugmaker Perrigo Co Plc  for about $27 billion - an offer Perrigo has rejected.",
        "date": "09142015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan launches tender offer for Perrigo "
    },
    {
        "content": "Sept 14 Mylan NV said it launched a tender offer on Monday to acquire fellow generic drugmaker Perrigo Co Plc for about $27 billion - an offer Perrigo has rejected so far.",
        "date": "09142015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan launches tender offer for Perrigo "
    },
    {
        "content": "NEW YORK Mylan NV  shareholders on Friday backed the drugmaker's hostile bid for Perrigo Co   allowing it to launch a tender offer for the company's shares in the next few weeks.",
        "date": "08282015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan shareholders back Perrigo takeover  tender offer up next "
    },
    {
        "content": "AMSTERDAM  Aug 29 The Dutch public employees' pension fund  the world's third largest  has sold all its shares in pharmaceuticals maker Mylan after it emerged that one of its products is in stock at a United States prison where death sentences are carried out.",
        "date": "08292015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Largest Dutch pension fund exits Mylan over death penalty concerns "
    },
    {
        "content": "NEW YORK Perrigo Co Plc's  chief executive expressed confidence on Tuesday that his company's shareholders will reject rival generic drugmaker Mylan NV's hostile takeover attempt  and said the offer is not close to what it would take to get a deal done.",
        "date": "08252015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Perrigo CEO expects shareholders to reject Mylan bid "
    },
    {
        "content": "NEW YORK  Aug 28 Mylan NV shareholders on Friday backed the drugmaker's hostile bid for Perrigo Co   allowing it to launch a tender offer for the company's shares in the next few weeks.",
        "date": "08282015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Mylan shareholders back Perrigo takeover  tender offer up next "
    },
    {
        "content": "AMSTERDAM  Aug 29 The Dutch public employees' pension fund  the world's third largest  has sold all its shares in pharmaceuticals maker Mylan after it emerged that one of the company's products is in stock at a U.S. prison where death sentences are carried out.",
        "date": "08292015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Largest Dutch pension fund exits Mylan over death penalty concerns "
    },
    {
        "content": "* Ruled Perrigo's Aug 13 statement \"Mylan already proposed a dilutive deal that substantially undervalues Perrigo\" breached rule",
        "date": "08252015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Irish Takeover Panel says Perrigo's Aug 13 statement breached rule "
    },
    {
        "content": "NEW YORK  Aug 28 Mylan NV shareholders on Friday backed the drugmaker's hostile bid for Perrigo Co   allowing it to launch a tender offer for the company's shares in the next few weeks.",
        "date": "08282015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan says shareholders back Perrigo takeover "
    },
    {
        "content": "BRUSSELS  Aug 19 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08212015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "EU mergers and takeovers (Aug 21) "
    },
    {
        "content": "NEW YORK ISS Proxy Advisory Services recommended on Friday that its clients vote against Mylan NV's  $30 billion hostile takeover of Perrigo Co   even as Mylan's largest hedge fund investor put its money behind the combination.",
        "date": "08142015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Proxy firm urges Mylan investors vote 'no'; Paulson backs deal "
    },
    {
        "content": "NEW YORK  Aug 14 ISS Proxy Advisory Services recommended on Friday that its clients vote against Mylan NV's  $30 billion hostile takeover of Perrigo Co  even as Mylan's largest hedge fund investor put its money behind the combination.",
        "date": "08142015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Proxy firm urges Mylan investors vote 'no'; Paulson backs deal "
    },
    {
        "content": "Aug 13 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "08132015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  Aug 14 ISS Proxy Advisory Services on Friday recommended that its institutional investor clients vote against Mylan NV's $34 billion hostile takeover offer of Perrigo Co saying that it would result in significant dilution.",
        "date": "08142015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Proxy firm ISS advises Mylan investors to vote no on Perrigo buy "
    },
    {
        "content": "NEW YORK Mylan NV   which is trying to buy drugmaker Perrigo Co   through a $34 billion hostile tender offer  on Thursday lowered the percentage of Perrigo shares it needs to control the company to just over 50 percent.",
        "date": "08132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan pursues minimum of Perrigo shareholder support for takeover "
    },
    {
        "content": "NEW YORK  Aug 13 Mylan NV  which is trying to buy drugmaker Perrigo Co  through a $34 billion hostile tender offer  on Thursday lowered the percentage of Perrigo shares it needs to control the company to just over 50 percent.",
        "date": "08132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 3-Mylan pursues minimum of Perrigo shareholder support for takeover "
    },
    {
        "content": "NEW YORK  Aug 13 Mylan NV  which is trying to buy drugmaker Perrigo Co  through a hostile tender offer  on Thursday lowered the  level of support it requires from Perrigo shareholders to push through the takeover.",
        "date": "08132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan pursues Perrigo with lower shareholder support for takeover "
    },
    {
        "content": "Drugmaker Mylan Inc reported a better-than-expected quarterly profit as it sold more generic drugs in North America  and said it remained committed to its acquisition of Perrigo Co Plc.",
        "date": "08062015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "North America generic sales help Mylan's profit beat "
    },
    {
        "content": "Aug 6 Drugmaker Mylan Inc reported a better-than-expected quarterly profit as it sold more generic drugs in North America  and said it remained committed to its acquisition of Perrigo Co Plc.",
        "date": "08062015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-North America generic sales help Mylan's profit beat "
    },
    {
        "content": "Aug 5 Perrigo Co Plc on Wednesday made a fresh case for rejecting a $34 billion offer from generic drugmaker Mylan NV and said Mylan's recent share price plunge reinforces Perrigo's intention to remain independent.",
        "date": "08052015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Perrigo CEO says no easy path for Mylan to acquire company "
    },
    {
        "content": "BRUSSELS  July 30 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "07302015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "EU mergers and takeovers (July 30) "
    },
    {
        "content": "BRUSSELS  July 29 The European Commission said on Wednesday it had cleared generic drug maker Mylan's  planned takeover of Ireland-based Perrigo Co.",
        "date": "07292015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "EU clears acquisition of Perrigo by Mylan "
    },
    {
        "content": "BRUSSELS  July 24 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "07242015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "EU mergers and takeovers (July 24) "
    },
    {
        "content": "TEL AVIV Israel's Teva Pharmaceutical Industries will pay $40.5 billion in cash and stock for Allergan's generic drugs business  solidifying Teva's position as the world's No. 1 maker of generics while freeing Allergan to focus on branded drugs  paying down debt and potential \"transformational\" acquisitions.",
        "date": "07272015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Teva to buy Allergan generic business for $40.5 bln  drops Mylan bid "
    },
    {
        "content": "TEL AVIV  July 26 After months of sparring in a hostile takeover bid for rival Mylan NV  Teva Pharmaceutical's move to buy Allergan Plc's  generic drug business instead could be a smoother ride that will bring bigger returns  faster.",
        "date": "07262015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Allergan bid may be healthier for Teva than battle with Mylan "
    },
    {
        "content": "TEL AVIV Israel’s Teva Pharmaceutical Industries will pay $40.5 billion in cash and stock for Allergan’s generic drugs business  solidifying Teva's position as the world's No. 1 maker of generics while freeing Allergan to focus on branded drugs  paying down debt and potential \"transformational\" acquisitions. | Video ",
        "date": "07272015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Teva to buy Allergan generic business for $40.5 billion  drops Mylan bid "
    },
    {
        "content": "July 25 Teva Pharmaceutical Industries Ltd  is in advanced talks to buy Allergan Plc's  generic drug business following a thus far unsuccessful effort to acquire peer Mylan NV  according to a person familiar with the matter.",
        "date": "07262015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Teva nears deal for Allergan's generic drugs unit -source "
    },
    {
        "content": "* Combined entity to have proforma revenue of $26 bln in 2016",
        "date": "07272015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 6-Teva to buy Allergan generic business for $40.5 bln  drops Mylan bid "
    },
    {
        "content": "AMSTERDAM An independent Dutch foundation linked to generic drugs manufacturer Mylan  used a poison pill to try and block a $40 billion takeover bid by Israeli rival Teva   citing potential job losses.",
        "date": "07232015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan foundation tries to block Teva takeover bid with poison pill "
    },
    {
        "content": "* Teva says has power to challenge action in court   (Adds Breakingviews link  updates Mylan share price)",
        "date": "07232015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 3-Mylan foundation tries to block Teva takeover bid with poison pill "
    },
    {
        "content": "July 14 Hedge fund Paulson & Co has taken a stake in Syngenta AG   and could push for the board of directors of the Swiss pesticide maker to accept a takeover offer from U.S. seed company Monsanto Co  people familiar with the matter said on Tuesday.",
        "date": "07142015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Paulson's hedge fund takes stake in Syngenta -sources "
    },
    {
        "content": "TEL AVIV As Israel's biggest company Teva strives to get even bigger by swallowing up rival Mylan for more than $40 billion  further down the food chain a raft of upstart life science firms are struggling to climb onto the global ladder.",
        "date": "07082015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Israeli life science firms seek help to follow Teva's lead "
    },
    {
        "content": "Teva Pharmaceutical Industries Ltd  is preparing to raise its bid for rival drugmaker Mylan NV  by as much as $2 billion  to $43 billion  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "07062015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Teva plans to raise Mylan bid by as much as $2 billion: Bloomberg "
    },
    {
        "content": "July 6 Teva Pharmaceutical Industries Ltd  is preparing to raise its bid for rival drugmaker Mylan NV by as much as $2 billion  to $43 billion  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "07062015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Teva plans to raise Mylan bid by as much as $2 bln - Bloomberg "
    },
    {
        "content": "June 25 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "06252015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "BRUSSELS  June 25 European Union competition regulators will decide by July 29 whether U.S. drugmaker Mylan  should be allowed to go ahead with its $34-billion hostile bid for Perrigo  the European Commission said.",
        "date": "06252015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "EU regulators to rule on Mylan bid for Perrigo by July 29 "
    },
    {
        "content": "June 19 Israel's Teva Pharmaceutical Industries Ltd has raised its stake in Mylan N.V. to the 4.61 percent needed for it to legally challenge Mylan's rejection of Teva's hostile takeover offer under Dutch law.",
        "date": "06192015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Teva raises stake in Mylan as three-way takeover battle heats up "
    },
    {
        "content": "TEL AVIV  June 23 Mylan NV chief financial officer John Sheehan will arrive in Israel on Wednesday for a meeting with the head of the Tel Aviv Stock Exchange to discuss a possible listing of its shares if it succeeds in buying Perrigo Co  an industry source said.",
        "date": "06232015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan CFO to meet Tel Aviv bourse chief to discuss listing - source "
    },
    {
        "content": "TEL AVIV  June 24 Drugmaker Mylan NV's  chief financial officer John Sheehan said on Wednesday the company would like to join the Tel Aviv Stock Exchange (TASE) if it succeeds in buying Perrigo Co.",
        "date": "06242015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan eyes Tel Aviv listing if Perrigo deal goes ahead "
    },
    {
        "content": "TEL AVIV  June 24 Drugmaker Mylan NV's  chief financial officer John Sheehan said on Wednesday the company would like to join the Tel Aviv Stock Exchange (TASE) if it succeeds in buying Perrigo Co.",
        "date": "06242015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan eyes Tel Aviv listing if Perrigo deal goes ahead "
    },
    {
        "content": "Mylan NV's  largest stakeholder  Abbott Laboratories   said it would back Mylan's proposed acquisition of Perrigo Co Plc   potentially helping Mylan fend off interest from Teva Pharmaceutical Industries Ltd .",
        "date": "06162015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Abbott to vote for Mylan's acquisition of Perrigo "
    },
    {
        "content": "June 16 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06162015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "June 16 Mylan NV's largest stakeholder  Abbott Laboratories  said it would back Mylan's proposed acquisition of Perrigo Co Plc  potentially helping Mylan fend off interest from Teva Pharmaceutical Industries Ltd .",
        "date": "06162015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "REFILE-UPDATE 1-Abbott to vote for Mylan's acquisition of Perrigo "
    },
    {
        "content": "Teva Pharmaceutical Industries Ltd  has changed the law firm it had tapped for advice on its $40 billion attempt to take over smaller rival Mylan NV  after a court sided with the latter's bid to seek a preliminary injunction against the previous law firm.",
        "date": "06102015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Teva switches legal counsel after Mylan challenge "
    },
    {
        "content": "June 9 Teva Pharmaceutical Industries Ltd  has changed the law firm it had tapped for advice on its $40 billion attempt to take over smaller rival Mylan NV  after a court sided with the latter's bid to seek a preliminary injunction against the previous law firm.",
        "date": "06102015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "REFILE-UPDATE 1-Teva switches legal counsel after Mylan challenge "
    },
    {
        "content": "June 9 A U.S. federal court has recommended that a preliminary injunction be issued to disqualify law firm Kirkland & Ellis LLP from advising Teva Pharmaceutical in its $40 billion attempt to take over smaller rival Mylan NV.",
        "date": "06102015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "CORRECTED- Judge recommends injunction to Kirkland from representing Teva "
    },
    {
        "content": "June 5 Teva Pharmaceutical Industries Ltd  has increased its stake in Mylan NV to nearly 2.2 percent as it presses on with an unsolicited bid for its generic drug-making rival  a regulatory filing showed on Friday.",
        "date": "06052015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Teva raises its stake in acquisition target Mylan "
    },
    {
        "content": "AMSTERDAM Executives at Israeli drugmaker Teva  sent an open letter to takeover target Mylan  on Monday  saying they remain committed to a deal and reiterated that Teva's $40 billion takeover proposal would benefit shareholders of both firms.",
        "date": "06082015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Teva bosses issue riposte to Mylan  praise takeover plan "
    },
    {
        "content": "AMSTERDAM  June 8 Executives at Israeli drugmaker Teva sent an open letter to takeover target Mylan on Monday  saying they remain committed to a deal and reiterated that Teva's $40 billion takeover proposal would benefit shareholders of both firms.",
        "date": "06082015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Teva bosses issue riposte to Mylan  praise takeover plan "
    },
    {
        "content": "AMSTERDAM  June 8 Top executives at Israeli drugmaker Teva sent an open letter to takeover target Mylan on Monday  saying they remained committed to striking a deal and reasserting that Teva's $82-per-share offer would benefit shareholders of both firms.",
        "date": "06082015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Teva bosses say remain committed to Mylan takeover "
    },
    {
        "content": "* Signs deal with Mylan EPD for exclusive marketing of its probiotic AB-LIFE in Australia and New Zealand",
        "date": "06042015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Ab-Biotics signs deal for exclusive marketing of its probiotic in Australia and New Zealand "
    },
    {
        "content": "Teva Pharmaceutical Industries Ltd  is looking to buy more shares in Mylan NV   positioning itself for a possible legal challenge to the generics drugmaker that has spurned its takeover bid  people familiar with the matter said.",
        "date": "06022015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Exclusive: Teva poised to raise its stake in Mylan - sources "
    },
    {
        "content": "June 3 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "06032015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Teva Pharmaceutical Industries Ltd is looking to buy more shares in Mylan NV  positioning itself for a possible legal challenge to the generics drugmaker that has spurned its takeover bid  people familiar with the matter said.",
        "date": "06022015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Teva poised to raise its stake in Mylan -sources "
    },
    {
        "content": "May 27 Teva Pharmaceutical Industries Ltd   disclosed a 1.35 percent interest in Mylan NV   saying the purchase underscored its commitment to buy Mylan as soon as possible.",
        "date": "05272015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Teva discloses 1.35 pct stake in target Mylan "
    },
    {
        "content": "Mylan NV's Chairman Robert Coury said he may sweeten the company's offer for Perrigo Co Plc by adding terms that will reduce risk to Perrigo's shareholders  sources told Bloomberg on Monday.",
        "date": "05122015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan chairman said to consider Perrigo sweeteners to make deal: Bloomberg "
    },
    {
        "content": "May 11 Mylan NV's Chairman Robert Coury said he may sweeten the company's offer for Perrigo Co Plc  by adding terms that will reduce risk to Perrigo's shareholders  sources told Bloomberg on Monday.",
        "date": "05122015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan chairman said to consider Perrigo sweeteners to make deal -Bloomberg "
    },
    {
        "content": "Generics drugmaker Mylan NV  which is in the middle of a three-way takeover battle  has said it is unwilling to sell itself to Israeli rival Teva Pharmaceuticals Industries Ltd  but would consider buying that company down the road  Mylan Executive Chairman Robert Coury told investors this week.",
        "date": "05082015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan chairman tells investors he would consider buying Teva "
    },
    {
        "content": "* Says expects Russia business to bottom out in Q4 at the latest",
        "date": "05072015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "BRIEF-Stada targets forex-adj Russia sales growth of 17-20 pct "
    },
    {
        "content": "Generics drugmaker Mylan NV   which is in the middle of a three-way takeover battle  has said it is unwilling to sell itself to Israeli rival Teva Pharmaceuticals Industries Ltd   but would consider buying that company down the road  Mylan Executive Chairman Robert Coury told investors this week.",
        "date": "05082015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Exclusive: Mylan chairman tells investors he would consider buying Teva "
    },
    {
        "content": "Generic drugmaker Mylan NV   at the center of a high-stakes  three-way takeover battle  said on Tuesday it is fully committed to acquiring Ireland-based Perrigo Co  and believes it can complete the deal by year end.",
        "date": "05052015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan says can close Perrigo deal by year end  reports profit "
    },
    {
        "content": "May 5 Generic drugmaker Mylan NV  at the center of a high-stakes  three-way takeover battle  said on Tuesday it is fully committed to acquiring Ireland-based Perrigo Co and believes it can complete the deal by year end.",
        "date": "05052015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Mylan says can close Perrigo deal by year end  reports profit "
    },
    {
        "content": "May 5   Mylan Sees q2 adjusted eps $0.86 to $0.90",
        "date": "05052015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Mylan confident it can close Perrigo deal by year end "
    },
    {
        "content": "May 5 Generic drugmaker Mylan NV  at the center of a high-stakes  three-way takeover battle  on Tuesday reported slightly higher-than-expected first-quarter profit and said it was \"steadfast\" in its commitment to acquire Ireland-based Perrigo Co.",
        "date": "05052015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan reports profit  maintains commitment to acquire Perrigo "
    },
    {
        "content": "Perrigo Co Ltd  on Wednesday rejected a sweetened takeover offer from Mylan NV   while Teva Pharmaceutical Industries Ltd  said it remains committed to acquiring Mylan  in a high stakes battle of major generic drugmakers.",
        "date": "04292015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Perrigo rejects raised Mylan bid; Teva recommits to Mylan buy "
    },
    {
        "content": "* Teva responds to Mylan rejection   (Adds details from Teva letter to Mylan  updates shares)",
        "date": "04292015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 4-Perrigo rejects raised Mylan bid; Teva recommits to Mylan buy "
    },
    {
        "content": "April 29 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "04292015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Generic drugmaker Perrigo Company Plc > is expected to reject the latest offer made on Wednesday by Mylan NV   according to a person familiar with the matter.",
        "date": "04292015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Perrigo expected to reject Mylan's latest offer: source "
    },
    {
        "content": "April 30 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "04302015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "April 27 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "04272015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TEL AVIV Teva Pharmaceutical Industries  raised its 2015 earnings forecast after beating first-quarter estimates  and said it would devote \"all necessary resources\" to its $40 billion-plus bid for rival Mylan Inc .",
        "date": "04302015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Teva lifts 2015 earnings forecast as pursues Mylan bid "
    },
    {
        "content": "* Teva shares down 1.2 pct in New York   (Adds comments on Mylan  Copaxone  analyst  shares)",
        "date": "04302015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Teva lifts 2015 earnings forecast as pursues Mylan bid "
    },
    {
        "content": "NEW YORK Teva Pharmaceutical Industries' bid for Mylan NV would create a company controlling nearly 25 percent of the U.S. generics market  including drugs in short supply  according to industry experts and a Reuters review of regulatory filings.",
        "date": "04242015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Drug overlaps  shortages may complicate Teva bid for Mylan "
    },
    {
        "content": "Mylan NV  rejected Teva Pharmaceutical Industries Ltd's  $40 billion takeover offer on Monday  saying in a scathing letter that it grossly undervalued the company and that Mylan has no interest in payment in what it termed \"high-risk\" Teva stock.",
        "date": "04272015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan says Teva offer too low; criticizes stock  growth prospects "
    },
    {
        "content": "NEW YORK  April 24 Teva Pharmaceutical Industries' bid for Mylan NV would create a company controlling nearly 25 percent of the U.S. generics market  including drugs in short supply  according to industry experts and a Reuters review of regulatory filings.",
        "date": "04262015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "RPT-DEALTALK-Drug overlaps  shortages may complicate Teva bid for Mylan "
    },
    {
        "content": "April 30 Teva Pharmaceutical Industries  TEVA.N> CEO Erez Vigodman says:",
        "date": "04302015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "BRIEF-Teva CEO on Mylan bid "
    },
    {
        "content": "NEW YORK  April 24 Teva Pharmaceutical Industries' bid for Mylan NV would create a company controlling nearly 25 percent of the U.S. generics market  including drugs in short supply  according to industry experts and a Reuters review of regulatory filings.",
        "date": "04242015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "DEALTALK-Drug overlaps  shortages may complicate Teva bid for Mylan "
    },
    {
        "content": "April 27 Mylan NV rejected Teva Pharmaceutical Industries Ltd's $40 billion takeover offer on Monday  saying in a scathing letter that it grossly undervalued the company and that Mylan has no interest in payment in what it termed \"high-risk\" Teva stock.",
        "date": "04272015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 4-Mylan says Teva offer too low; criticizes stock  growth prospects "
    },
    {
        "content": "April 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "04242015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Generic drugmaker Mylan NV said on Friday it would take its $31 billion offer for Perrigo Co Plc directly to shareholders  in what is set to be one of the most high-profile hostile takeover attempts of the year.",
        "date": "04242015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Generic drugmaker Mylan goes hostile in bid for Perrigo "
    },
    {
        "content": "April 27 Mylan NV rejected Teva Pharmaceutical Industries Ltd's unsolicited $40 billion takeover offer  saying it \"grossly undervalues\" the company.",
        "date": "04272015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan rejects Teva's $40 bln offer "
    },
    {
        "content": "Some of the top investors at Mylan NV  including Paulson & Co  are encouraging its board of directors to consider a takeover proposal from rival Teva Pharmaceutical Industries Inc  according to people familiar with the matter.",
        "date": "04212015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Top Mylan shareholders seek deal with Teva: sources "
    },
    {
        "content": "April 24 Generic drugmaker Mylan NV said on Friday it would take its $31 billion offer for Perrigo Co Plc  directly to shareholders  in what is set to be one of the most high-profile hostile takeover attempts of the year.",
        "date": "04242015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 2-Generic drugmaker Mylan goes hostile in bid for Perrigo "
    },
    {
        "content": "TEL AVIV/NEW YORK Teva Pharmaceutical Industries Ltd on Tuesday made an unsolicited $40 billion offer for smaller rival Mylan NV  a bold bid for growth as its lucrative Copaxone drug faces generic competition. | Video ",
        "date": "04212015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Generic drugmaker Teva makes $40 billion offer for rival Mylan "
    },
    {
        "content": "April 21 Dublin-based Perrigo Company Plc  said its board unanimously rejected a $205 per share offer from generic drugmaker Mylan NV  saying the bid substantially undervalued the company.",
        "date": "04212015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Perrigo rejects $205/share bid from Mylan "
    },
    {
        "content": "April 24 Generic drugmaker Mylan NV said on Friday it would commence a formal offer to acquire Perrigo Co Plc  three days after Perrigo rejected its unsolicited offer.",
        "date": "04242015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan says to commence offer for Perrigo "
    },
    {
        "content": "April 22 Teva Pharmaceutical Industries Ltd   said on Wednesday it could \"promptly\" divest some operations if necessary to obtain regulatory clearance for its proposed takeover of smaller rival Mylan NV.",
        "date": "04222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Teva ready to divest operations to win regulatory nod for Mylan buy "
    },
    {
        "content": "Generic drugmaker Mylan NV moved quickly on Friday to pour cold water on published reports that Teva Pharmaceuticals Industries is considering a bid to acquire it.",
        "date": "04172015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Mylan says merger with Teva would be bad fit "
    },
    {
        "content": "* Yahoo  Chipotle down after the bell following quarterly reports",
        "date": "04212015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "US STOCKS-Earnings cloud drags down Dow; Nasdaq gains on biotech M&A "
    },
    {
        "content": "LONDON  April 24 Worldwide dealmaking in the healthcare sector has doubled this year compared with the same time in 2014  buoyed by Teva Pharmaceuticals Industries'  unsolicited $40 billion bid for smaller rival Mylan  this week  Thomson Reuters data shows.",
        "date": "04242015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Global healthcare M&A doubles versus 2014 "
    },
    {
        "content": "April 22 Generic drugmaker Teva Pharmaceutical Industries Ltd  said it could \"promptly\" divest some operations to obtain regulatory clearance for its proposed $40 billion takeover of smaller rival Mylan NV.",
        "date": "04222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Teva ready to divest operations to win regulatory nod for Mylan buy "
    },
    {
        "content": "April 17 Generic drugmaker Mylan NV  moved quickly on Friday to pour cold water on published reports that Teva Pharmaceuticals Industries is considering a bid to acquire it.",
        "date": "04172015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan says merger with Teva would be bad fit "
    },
    {
        "content": "TEL AVIV/NEW YORK  April 21 Teva Pharmaceutical Industries Ltd on Tuesday made an unsolicited $40 billion offer for smaller rival Mylan NV  a bold bid for growth as its lucrative Copaxone drug faces generic competition.",
        "date": "04212015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 6-Generic drugmaker Teva makes $40 billion offer for rival Mylan "
    },
    {
        "content": "Abbott Laboratories  on Wednesday said its initial proceeds of $5.3 billion from the recent sale to Mylan  of part of its generic drug business were now worth more than $7 billion because of appreciation of the stock it obtained in the deal.",
        "date": "04222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Abbott says its payoff from Mylan deal surged "
    },
    {
        "content": "April 22 Abbott Laboratories on Wednesday said its initial proceeds of $5.3 billion from the recent sale to Mylan of part of its generic drug business were now worth more than $7 billion because of appreciation of the stock it obtained in the deal.",
        "date": "04222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Abbott says its payoff from Mylan deal surged "
    },
    {
        "content": " ",
        "date": "04172015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Teva considering potential bid for Mylan - Bloomberg "
    },
    {
        "content": "* Dow off 0.45 pct  S&P down 0.1 pct  Nasdaq up 0.48 pct   (Updates to afternoon)",
        "date": "04212015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "US STOCKS-Wall St mixed as doubts about earnings offset biotech M&A bid "
    },
    {
        "content": "April 22 Abbott Laboratories on Wednesday said its initial proceeds of $5.3 billion from the recent sale to Mylan of part of its generic drug business were now worth more than $7 billion because of appreciation of the stock it obtained in the deal.",
        "date": "04222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "CORRECTED-Abbott says payoff from Mylan deal surges  as Mylan shares leap "
    },
    {
        "content": "Perrigo Co Plc is set to reject a $29 billion unsolicited takeover offer from generic drugmaker Mylan NV as soon as this week  according to a source familiar with the matter.",
        "date": "04212015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Exclusive: Perrigo expected to reject Mylan offer as soon as this week - source "
    },
    {
        "content": "Drugmaker Mylan N.V said it settled a patent litigation with Pfizer Inc related to Viagra  paving the way for the launch of the drug's generic version in the United States once approved.",
        "date": "04132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan settles Viagra patent litigation with Pfizer "
    },
    {
        "content": "NEW YORK  April 10 (IFR) - Drugmaker Mylan is at risk of dropping back into junk territory if it doesn't strike a perfect balance between bond and equity to finance its proposed US$30bn acquisition of healthcare supplier Perrigo  analysts warned.",
        "date": "04102015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Perrigo acquisition could threaten Mylan's investment grade "
    },
    {
        "content": "Generic drugmaker Mylan NV  plans to make a new offer for Perrigo Co Plc  in the near term  CNBC reported on Wednesday  citing a source familiar with the matter.",
        "date": "04222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan plans to make new offer for Perrigo: CNBC "
    },
    {
        "content": "April 21 Perrigo Company PLC is set to reject a $29 billion unsolicited takeover offer from generics drugmaker Mylan NV as soon as this week  according to a source familiar with the matter.",
        "date": "04212015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "EXCLUSIVE-Perrigo expected to reject Mylan offer as soon as this week -source "
    },
    {
        "content": "April 22 Generic drugmaker Mylan NV  plans to make a new offer for Perrigo Co Plc in the near term  CNBC reported on Wednesday  citing a source familiar with the matter.",
        "date": "04222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan plans to make new offer for Perrigo - CNBC "
    },
    {
        "content": "April 13 Drugmaker Mylan N.V said it settled a patent litigation with Pfizer Inc related to Viagra  paving the way for the launch of the drug's generic version in the United States once approved.",
        "date": "04132015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan settles Viagra patent litigation with Pfizer "
    },
    {
        "content": "Teva Pharmaceutical Industries  has offered to buy rival generic drugmaker Mylan  for $40 billion in what would be the largest acquisition in Israel's history  equivalent to nearly 15 percent of GDP.",
        "date": "04222015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Factbox: Teva Pharmaceutical's history of key acquisitions "
    },
    {
        "content": "Generic drugmaker Mylan NV has offered to buy Perrigo Co Plc for about $29 billion in cash and stock  a deal that would make Mylan a major player in over-the-counter consumer products and extend its geographic reach.",
        "date": "04082015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Generic drugmaker Mylan offers $29 billion for Perrigo "
    },
    {
        "content": "April 8 Generic drugmaker Mylan NV has offered to buy Perrigo Co Plc for about $29 billion in cash and stock  a deal that would make Mylan a major player in over-the-counter consumer products and extend its geographic reach.",
        "date": "04082015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 3-Generic drugmaker Mylan offers $29 bln for Perrigo "
    },
    {
        "content": "* Fed minutes indicate rate hike in 2015; members differ on month",
        "date": "04082015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "US STOCKS-Wall St ends with modest gains after Fed minutes "
    },
    {
        "content": "April 8 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "04082015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK Perrigo Co Plc's  options attracted an unusually large bullish bet days ahead of an offer from generic drugmaker Mylan NV  to buy the company  options data shows.",
        "date": "04082015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Perrigo options attracted large bullish bet ahead of Mylan offer "
    },
    {
        "content": "* Fed minutes indicate rate hike in 2015  but members differ on month",
        "date": "04082015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "US STOCKS-Wall St rises in volatile trading after Fed minutes "
    },
    {
        "content": "* Fed's Dudley keeps June rate hike on the table depending on data",
        "date": "04082015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "US STOCKS-Wall St ticks up on M&A but energy weighs as crude drops "
    },
    {
        "content": "* Fed's Dudley keeps June rate hike on the table depending on data",
        "date": "04082015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "US STOCKS-Wall St ticks up but energy weighs after crude drop "
    },
    {
        "content": "March 2 U.S. generic drug maker Mylan Inc  is still on the prowl for more deals  after completing the multibillion-dollar acquisition of some of Abbott Laboratories' non-U.S. businesses just last week.",
        "date": "03032015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan still on the prowl for deals  perhaps one by end 2015 "
    },
    {
        "content": "Generic and specialty drugmaker Mylan Inc reported a rise in quarterly profit and revenue  driven mainly by strong demand for its generics in North America.",
        "date": "03022015",
        "name": "Mylan NV",
        "news_type": "topStory",
        "symbol": "MYL",
        "title": "Drugmaker Mylan's fourth-quarter profit rises on strong demand in North America "
    },
    {
        "content": "March 2 Generic and specialty drugmaker Mylan Inc reported a rise in quarterly profit and revenue  driven mainly by strong demand for its generics in North America.",
        "date": "03022015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Drugmaker Mylan's 4th-qtr profit rises on strong demand in N. America "
    },
    {
        "content": "Feb 2 Mylan Inc said it would buy Indian drugmaker Famy Care Ltd's female health businesses to expand its line of women's health products.",
        "date": "02022015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "Mylan buys female health businesses from Indian drugmaker "
    },
    {
        "content": "Feb 2 Mylan Inc said it would buy Indian drugmaker Famy Care Ltd's female health businesses for about $750 million in cash and $50 million in contingent payments to expand its line of women's health products.",
        "date": "02022015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "UPDATE 1-Mylan buys female health businesses from Indian drugmaker "
    },
    {
        "content": "BRUSSELS  Jan 28 The European Commission approved on Wednesday the acquisition of Abbot Laboratories'  non-U.S. Developed Markets Specialty and Branded Generics Business (Abbott EPD-DM) by the U.S. based producer of generic pharmaceuticals Mylan Inc  subject to conditions.",
        "date": "01282015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "EU approves Mylan purchase of Abbot generics  subject to conditions "
    },
    {
        "content": "BRUSSELS  Jan 28 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01282015",
        "name": "Mylan NV",
        "news_type": "normal",
        "symbol": "MYL",
        "title": "EU mergers and takeovers (Jan 28) "
    }
]