[
    {
        "content": "* Star NCLC entered ‍underwriting deal with Norwegian Cruise Line Holdings",
        "date": "11172017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Genting Hong Kong divests 5 mln shares in Norwegian Cruise Line Holdings "
    },
    {
        "content": "* Norwegian Cruise Line Holdings Ltd. announces launch of secondary public offering by selling shareholders",
        "date": "11152017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings announces launch of secondary public offering by selling shareholders "
    },
    {
        "content": "* Norwegian cruise line holdings ltd. Announces pricing of secondary public offering by selling shareholders",
        "date": "11162017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian cruise Announces pricing of secondary offering "
    },
    {
        "content": "* Norwegian Cruise Line Holdings Ltd reports financial results for the third quarter 2017",
        "date": "11092017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line reports Q3 adjusted earnings per share $1.86 "
    },
    {
        "content": "* Norwegian Cruise Line Holdings Ltd - unit entered into a third amended  restated credit agreement​ on Oct 10",
        "date": "10102017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line enters into third amended and restated credit agreement "
    },
    {
        "content": "* Norwegian Cruise Line-on Sept 27 co's unit delivered supplemental conditional notice of redemption to holders of 4.625% senior notes due 2020",
        "date": "09272017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line says unit delivered supplemental conditional notice of redemption to holders of 4.625 pct senior notes due 2020 "
    },
    {
        "content": "* On September 19  2017  NCL Corporation  unit of co  launched an amendment for its existing credit facilities",
        "date": "09192017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line's unit amends credit facilities "
    },
    {
        "content": "HONG KONG  Aug 14 Cruise operator Genting Hong Kong Ltd said it  Apollo Funds and TPG Fund have agreed to sell an aggregate 6.58 percent of shares in Norwegian Cruise Line Holdings Ltd with a market value of over $800 million to third party investors.",
        "date": "08172017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "CORRECTED-Genting Hong Kong  Apollo  TPG to sell 6.58 pct of Norwegian Cruise Line "
    },
    {
        "content": "* Norwegian Cruise Line Holdings Ltd - ‍launch of a secondary public offering of 15 million of its ordinary shares by certain funds​ Source text for Eikon: Further company coverage:",
        "date": "08102017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings announces launch of secondary public offering by selling shareholders "
    },
    {
        "content": "* Norwegian Cruise Line Holdings reports financial results for the second quarter 2017",
        "date": "08082017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings posts Q2 adj. earnings $1.02/shr "
    },
    {
        "content": "* says Wartsila and U.S. based cruise operator Norwegian Cruise Line Holdings (NCLH) have signed a renewal of their existing performance-based service agreement for engines in 10 cruise ships Source text for Eikon: Further company coverage: (Helsinki Newsroom)",
        "date": "06082017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Wartsila renews service deal with Norwegian Cruise Line Holdings "
    },
    {
        "content": "* Norwegian Cruise Line Holdings reports financial results for the first quarter 2017",
        "date": "05102017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings reports Q1 adjusted earnings per share $0.40 "
    },
    {
        "content": "* Norwegian Cruise Line Holdings partners with Alibaba Group to enter the China cruise market",
        "date": "05042017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings partners with Alibaba Group "
    },
    {
        "content": "* Norwegian Cruise Line Holdings Ltd. extends share repurchase program through April 2020",
        "date": "05012017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line extends share repurchase program through April 2020 "
    },
    {
        "content": "* Multi-year deal with Norwegian Cruise Line to enhance services across Norwegian Cruise Line brand's fleet of 14 ships",
        "date": "03142017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Global Eagle Entertainment announces multi-year deal with Norwegian Cruise Line "
    },
    {
        "content": "* Norwegian Cruise Line Holdings Ltd files for potential stock shelf; size not disclosed - SEC filing  Source text: (http://bit.ly/2mnpLNX) Further company coverage:",
        "date": "03032017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings files for potential stock shelf "
    },
    {
        "content": "* Norwegian Cruise Line Holdings reports financial results for the fourth quarter and full year 2016",
        "date": "02222017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line reports Q4 adjusted earnings $0.56/shr "
    },
    {
        "content": "* Norwegian Cruise Line Holdings announces order for next generation of ships for norwegian cruise line",
        "date": "02162017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line announces order for next generation of ships "
    },
    {
        "content": "* Awarded an order from Norwegian Cruise Line Holdings Ltd for the construction of 4 new generation cruise ships with an option for additional 2",
        "date": "02162017",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "normal",
        "symbol": "NCLH",
        "title": "BRIEF-Fincantieri is awarded order from Norwegian Cruise Line Holdings "
    },
    {
        "content": "U.S cruise operators Royal Caribbean Cruises Ltd and Norwegian Cruise Line Holdings Ltd said on Wednesday they had got approval from Cuban authorities to begin operations to the country.",
        "date": "12072016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "Royal Caribbean  Norwegian get Cuba go-ahead for cruises "
    },
    {
        "content": "* Still anticipate delivering double-digit growth in adjusted eps in 2017",
        "date": "11092016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings Q3 adjusted EPS $1.62 "
    },
    {
        "content": "* Q2 earnings per share view $0.83 -- Thomson Reuters I/B/E/S",
        "date": "08092016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings Q2 GAAP EPS $0.64 "
    },
    {
        "content": "* Amendment increases principal amount of commitments under term loan credit facility from 590.5 million euros to 729.9 million euros -SEC filing",
        "date": "07292016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise unit amends credit agreement "
    },
    {
        "content": "* Unit entered into a second amended and restated credit agreement dated as of october 31  2014",
        "date": "06082016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line unit entered into second amended and restated credit agreement "
    },
    {
        "content": "* Norwegian Cruise Line Holdings announces refinancing of its senior secured credit facility",
        "date": "06072016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings says refinance of credit facility "
    },
    {
        "content": "* \"remains confident\" in reaching targets of double-digit adjusted roic in 2016  growing to 14% by 2018  $5.00 adjusted eps in 2017",
        "date": "05102016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings Q1 earnings per share $0.32 "
    },
    {
        "content": "* Norwegian Cruise Line holdings enters a long-term  strategic agreement with EMC to deliver a faster internet experience for guests  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05052016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line Holdings enters strategic agreement with EMC "
    },
    {
        "content": "* Was advised that cuba government has authorized entry  exit of cuban citizens in and out of cuba as passengers or crew of cruise ships",
        "date": "04222016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line says Cuba Govt authorized entry and exit of Cuban citizens of cruise ships independent of migratory status "
    },
    {
        "content": "* CEO Frank J. Del Rio 2015 total  compensation was  $31.9 million versus $2.1 million in 2014 - SEC Filing",
        "date": "04072016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise Line CEO's 2015 total compensation was $31.9 mln vs $2.1 mln in 2014 -SEC Filing "
    },
    {
        "content": "* Reached agreement with Fincantieri of Italy to construct sister ship to seven seas explorer for its Regent Seven Seas Cruises brand",
        "date": "03312016",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "BRIEF-Norwegian Cruise announces newbuild order for Regent Seven Seas Cruises "
    },
    {
        "content": "Oct 12 Norwegian Cruise Line Holdings Ltd  said it will introduce a ship in China in 2017 to tap the fastest growing market for cruises.",
        "date": "10122015",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "Norwegian Cruise Line to start service from China in 2017 "
    },
    {
        "content": "May 19 A Norwegian Cruise Line ship ran aground on a reef on Tuesday after leaving Bermuda but no one was injured and the vessel was later floated off at high tide  the company said.",
        "date": "05202015",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "UPDATE 3-Norwegian Cruise Line ship runs aground on Bermuda reef; no injuries "
    },
    {
        "content": "MIAMI  March 11 The former chief executive of Norwegian Cruise Line Holdings Ltd sued Richard Branson's Virgin Group in federal court in Miami for $300 million on Wednesday over plans by the British billionaire to launch his own luxury cruise line.",
        "date": "03112015",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "normal",
        "symbol": "NCLH",
        "title": "Former Norwegian Cruise Line CEO sues Virgin Group over cruise line "
    },
    {
        "content": "MIAMI  March 11 The former chief executive of Norwegian Cruise Line Holdings Ltd sued Richard Branson's Virgin Group in federal court in Miami for $300 million on Wednesday over plans by the British billionaire to launch his own luxury cruise line.",
        "date": "03112015",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "normal",
        "symbol": "NCLH",
        "title": "UPDATE 2-Former Norwegian Cruise Line CEO sues Virgin Group over cruise line "
    },
    {
        "content": "Prestige Cruises International Inc  which was bought by  Norwegian Cruise Line Holdings Ltd  in a $3 billion deal in September  filed with U.S. regulators to withdraw its plan for an initial public offering.",
        "date": "01122015",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "topStory",
        "symbol": "NCLH",
        "title": "Prestige Cruises withdraws IPO plan "
    },
    {
        "content": "Jan 12 Prestige Cruises International Inc  which was bought by  Norwegian Cruise Line Holdings Ltd in a $3 billion deal in September  filed with U.S. regulators to withdraw its plan for an initial public offering.",
        "date": "01122015",
        "name": "Norwegian Cruise Line Holdings Ltd",
        "news_type": "normal",
        "symbol": "NCLH",
        "title": "UPDATE 1-Prestige Cruises withdraws IPO plan "
    }
]