[
    {
        "content": "NEW YORK  Oct 17 A proposed regulatory experiment to test the effects of lowering stock exchange fees could end up making stocks harder to trade and should be delayed pending a comprehensive market review  the three largest U.S. stock exchange operators said in a letter to the Securities and Exchange Commission.",
        "date": "10172017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "Big U.S. stock exchanges ask SEC to hold off on fee cap plan "
    },
    {
        "content": "Sept 5 U.S. exchange operator Nasdaq Inc said on Tuesday it would buy investment analytics provider eVestment Alliance LLC for $705 million to bolster its market technology business and woo more institutional investors.",
        "date": "09052017",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "UPDATE 4-Nasdaq to buy analytics firm eVestment for $705 mln "
    },
    {
        "content": "NEW YORK  Aug 9 The U.S. Securities and Exchange Commission on Wednesday put on hold a decision by its staff approving the sale of the Chicago Stock Exchange to a group led by China-based investors  giving the regulator more time to mull the politically sensitive deal.",
        "date": "08092017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "UPDATE 1-U.S. SEC puts Chicago Stock Exchange's China deal on hold "
    },
    {
        "content": "* Nasdaq Inc - ‍announces appointment of nine directors to Nasdaq Futures  Inc board; directors will serve a one-year term​ Source text for Eikon: Further company coverage:",
        "date": "07282017",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "BRIEF-Nasdaq Futures elects board directors "
    },
    {
        "content": "NEW YORK  July 10 Eleven members of Congress asked the U.S. Securities and Exchange Commission on Monday to stop the sale of the Chicago Stock Exchange to a group led by China-based investors  saying the regulator lacks the ability to monitor the foreign buyers.",
        "date": "07102017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "Lawmakers urge SEC to stop Chicago Stock Exchange's China deal "
    },
    {
        "content": "NEW YORK  June 8 U.S. exchange group Nasdaq Inc has joined a 7 million-euro ($7.9 million) investment round in Stratumn  which helps companies develop applications using blockchain technology  the Paris-based startup said on Thursday.",
        "date": "06082017",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq joins investment round in French blockchain startup Stratumn "
    },
    {
        "content": "* Astana International Financial Centre JSC and NASDAQ sign technology deal for new AIFC exchange",
        "date": "05292017",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "BRIEF-Astana International Financial Centre and NASDAQ sign technology deal for new AIFC exchange "
    },
    {
        "content": "* NASDAQ STOCKHOLM ORDERS OSCAR PROPERTIES AB TO PAY FINE CORRESPONDING TO TWO ANNUAL FEES",
        "date": "05082017",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "BRIEF-Nasdaq Stockholm orders Oscar Properties to pay fine of SEK 410 000 "
    },
    {
        "content": "Nasdaq Inc  posted a better-than-expected quarterly profit as the transatlantic exchange operator benefited from its acquisitions.",
        "date": "04262017",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Acquisitions help Nasdaq beat profit estimates "
    },
    {
        "content": "April 26 Nasdaq Inc posted a better-than-expected quarterly profit as the transatlantic exchange operator benefited from its acquisitions.",
        "date": "04262017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "UPDATE 1-Acquisitions help Nasdaq beat profit estimates "
    },
    {
        "content": "* Q1 GAAP earnings per share $0.99; Q1 non-GAAP earnings per share $1.10; Q1 net revenue $583 million  up 9 percent",
        "date": "04262017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "BRIEF-Nasdaq Inc Q1 GAAP earnings per share $0.99 "
    },
    {
        "content": "TORONTO  April 6 The Toronto Stock Exchange operator  TMX Group Ltd  said on Thursday it has developed a blockchain-based prototype for electronic shareholder voting  the latest effort by an exchange operator to leverage the technology to try to solve an industry problem.",
        "date": "04062017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "Exchange operator TMX develops proxy voting prototype using blockchain "
    },
    {
        "content": "NEW YORK Nasdaq Inc has provided blockchain technology to run a new exchange to trade guaranteed advertising contracts as more mainstream finance projects using the record keeping software move into the real world. ",
        "date": "03142017",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq provides blockchain tech to new advertising exchange "
    },
    {
        "content": "NEW YORK  March 14 Nasdaq Inc has provided blockchain technology to run a new exchange to trade guaranteed advertising contracts as more mainstream finance projects using the record keeping software move into the real world.",
        "date": "03142017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "REFILE-Nasdaq provides blockchain tech to new advertising exchange "
    },
    {
        "content": " ",
        "date": "02082017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "Chicago Stock Exchange plans new speed bump to curb fast traders "
    },
    {
        "content": "NEW YORK Exchange operator Nasdaq Inc  plans to set up a venture capital arm to invest in financial technology companies that can help grow its own businesses  two people familiar with the plans told Reuters.",
        "date": "02092017",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq plans venture arm to invest in financial technology: sources "
    },
    {
        "content": "NEW YORK  Feb 9 Exchange operator Nasdaq Inc  plans to set up a venture capital arm to invest in financial technology companies that can help grow its own businesses  two people familiar with the plans told Reuters.",
        "date": "02092017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "Nasdaq plans venture arm to invest in financial technology -sources "
    },
    {
        "content": "NEW YORK Nasdaq Inc  said on Tuesday it would wind down its struggling London-based interest rate derivatives exchange  NLX  as unrelated one-time costs pulled the transatlantic exchange operator to a fourth-quarter loss.",
        "date": "01312017",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq to close NLX trading venue  reports fourth-quarter loss "
    },
    {
        "content": "NEW YORK  Jan 31 Nasdaq Inc said on Tuesday it would wind down its struggling London-based interest rate derivatives exchange  NLX  as unrelated one-time costs pulled the transatlantic exchange operator to a fourth-quarter loss.",
        "date": "01312017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "UPDATE 2-Nasdaq to close NLX trading venue  reports Q4 loss "
    },
    {
        "content": "NEW YORK  Jan 20 Nasdaq Inc will ask U.S. regulators under the Trump administration to limit the trading of shares of small companies and illiquid exchange-traded funds to the exchanges on which they are listed  the market operator said in a note to clients.",
        "date": "01202017",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "Nasdaq backs trading illiquid stocks only on listing exchange "
    },
    {
        "content": "* Nasdaq Inc says trading was halted in Globus Maritime Limited at 13:24:10 ET for \"additional information requested\" from co at a last price of $7.318  Source text for Eikon:  Further company coverage:",
        "date": "11282016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "BRIEF-Nasdaq Inc says trading was halted in Globus Maritime Limited "
    },
    {
        "content": "Nasdaq Inc  said on Monday that its long-time chief executive Robert Greifeld would retire and that Adena Friedman  president and chief operating officer  would become CEO as of Jan. 1.",
        "date": "11142016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq names Friedman CEO; Greifeld to be chairman "
    },
    {
        "content": "Nov 14 Nasdaq Inc said on Monday that its long-time chief executive Robert Greifeld would retire and that Adena Friedman  president and chief operating officer  would become CEO as of Jan. 1.",
        "date": "11142016",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "UPDATE 2-Nasdaq names Friedman CEO; Greifeld to be chairman "
    },
    {
        "content": "NEW YORK IEX Group  operator of the newest U.S. stock exchange  on Monday said it hired former Morgan Stanley executive Sara Furber to help it challenge Nasdaq Inc  and Intercontinental Exchange Inc's  New York Stock Exchange for corporate listings.",
        "date": "11142016",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "IEX hires ex-banking executive to take on NYSE  Nasdaq for listings "
    },
    {
        "content": "NEW YORK  Nov 14 IEX Group  operator of the newest U.S. stock exchange  on Monday said it hired former Morgan Stanley executive Sara Furber to help it challenge Nasdaq Inc and Intercontinental Exchange Inc's New York Stock Exchange for corporate listings.",
        "date": "11142016",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "IEX hires ex-banking exec to take on NYSE  Nasdaq for listings "
    },
    {
        "content": "* NASDAQ Inc - jochumsen currently serves as president of NASDAQ  Source text for Eikon:  Further company coverage:",
        "date": "10242016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "BRIEF-NASDAQ names Jochumsen vice chairman "
    },
    {
        "content": "TEL AVIV The Tel Aviv Stock Exchange (TASE) must make significant changes to its structure  regulations and image or it will run itself out of business  a senior Nasdaq OMX official said on Wednesday.",
        "date": "09212016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Tel Aviv bourse needs quick reform or will disappear: Nasdaq official "
    },
    {
        "content": "NEW YORK Nasdaq Inc NDAQ.O on Wednesday said it plans to increase the amount it pays to trading firms that support exchange-traded funds in an effort to make thinly traded ETFs easier to buy and sell.",
        "date": "08102016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq to launch incentives to spur trading in low-volume ETFs "
    },
    {
        "content": " ",
        "date": "07282016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq shares hit record as earnings top expectations "
    },
    {
        "content": "* Bolsa de valores de colombia (bvc) extends trading technology contract with nasdaq",
        "date": "07282016",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "BRIEF-BVC extends trading techonology contract with Nasdaq "
    },
    {
        "content": "* May 2016 U.S. equity options volume of 66 million contracts versus 67 million last year",
        "date": "06062016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "BRIEF-Nasdaq Inc reports May 2016 Volumes "
    },
    {
        "content": "* Denominated 3.850% senior notes due 2026  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06022016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "BRIEF-Nasdaq Inc prices $500 mln senior notes offering "
    },
    {
        "content": "May 16 A Ukrainian man has become the first computer hacker to plead guilty in what U.S. authorities called a worldwide scheme to hack into services that distribute corporate news releases  and use stolen information to conduct insider trading.",
        "date": "05162016",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "Hacker pleads guilty in U.S. over press release insider scheme "
    },
    {
        "content": "* April european options and futures volume 8.1 million contracts versus 7.9 million in march  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom)",
        "date": "05052016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "BRIEF-Nasdaq Inc says April European options and Futures volume of 8.1 mln contracts "
    },
    {
        "content": "By John McCrank Nasdaq Inc may launch a new marketplace aimed at improving trading in exchange-traded funds using one of the exchange licenses from its $1.1 billion purchase of International Securities Exchange  the head of the company said on Wednesday.",
        "date": "04272016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq mulls new exchange to ease trading in illiquid ETFs - CEO "
    },
    {
        "content": "NEW YORK  April 27 Nasdaq Inc may launch a new marketplace aimed at improving trading in exchange-traded funds using one of the exchange licenses from its $1.1 billion purchase of International Securities Exchange  the head of the company said on Wednesday.",
        "date": "04272016",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "UPDATE 1-Nasdaq mulls new exchange to ease trading in illiquid ETFs -CEO "
    },
    {
        "content": "NEW YORK  April 27 Nasdaq Inc may launch a new marketplace aimed at improving trading in exchange-traded funds using one of the exchange licenses from its $1.1 billion purchase of International Securities Exchange  the head of the company said on Wednesday.",
        "date": "04272016",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "Nasdaq mulls new exchange to ease trading in illiquid ETFs -CEO "
    },
    {
        "content": "NEW YORK  April 27 Trans-Atlantic exchange operator Nasdaq Inc on Thursday reported a rise in fourth quarter profit as acquisitions and growth from existing businesses drove revenues higher across its business units and cash equity trading volumes increased.",
        "date": "04272016",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "UPDATE 1-Nasdaq Q1 profit up  aided by acquisitions  stock trading rise "
    },
    {
        "content": "NEW YORK/FRANKFURT Deutsche Boerse  is selling U.S. options exchange operator International Securities Exchange for $1.1 billion to Nasdaq   potentially strengthening its hand in a proposed merger with London Stock Exchange (LSE).",
        "date": "03102016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Deutsche Boerse to sell ISE options exchange to Nasdaq "
    },
    {
        "content": "* Deutsche Boerse to book gain in hundreds of millions of euros",
        "date": "03102016",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "UPDATE 3-Deutsche Boerse to sell ISE options exchange to Nasdaq "
    },
    {
        "content": "March 9 Exchange operator Nasdaq Inc  said on Wednesday it would buy International Securities Exchange from Deutsche Borse AG for $1.1 billion.",
        "date": "03092016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq to buy International Securities Exchange from Deutsche Borse "
    },
    {
        "content": "NEW YORK  Feb 16 Exchange operator Nasdaq Inc  said on Tuesday it plans to lower trading prices for some U.S. stocks during times of extreme market volatility to determine whether the incentives lead to less disruptive trading.",
        "date": "02162016",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "Nasdaq to test new incentives to ease volatility  trading halts "
    },
    {
        "content": "* Q4 adjusted earnings per share $0.89; Q4 earnings per share $0.88; Q4 net revenues $536 million  up 4 percent",
        "date": "01282016",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "BRIEF-Nasdaq Inc Q4 adjusted EPS $0.89 "
    },
    {
        "content": "COPENHAGEN Nasdaq  is poised to launch a platform for foreign exchange trading which it says would make the $5 trillion-a-day global market more transparent and would diversify its own business  a top executive from the stock market operator said.",
        "date": "08242015",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq poised to launch FX trading platform: top executive "
    },
    {
        "content": "DUBAI  March 26 Borse Dubai has no \"current intention\" to sell its stake in Nasdaq OMX Group   a spokesman for the company told Reuters on Thursday.",
        "date": "03262015",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "Borse Dubai rules out Nasdaq OMX Group stake sale "
    },
    {
        "content": "* \"No current intention\" to sell Nasdaq OMX stake - Borse Dubai",
        "date": "03262015",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "UPDATE 1-Borse Dubai rules out Nasdaq OMX Group stake sale "
    },
    {
        "content": "BOCA RATON  Florida Nasdaq OMX Group said on Wednesday it is expanding into energy derivatives with energy futures and options set to trade on the Nasdaq Futures Exchange at less than half the prices charged by incumbents CME Group and Intercontinental Exchange.",
        "date": "03112015",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "Nasdaq to challenge ICE and CME with new energy futures market "
    },
    {
        "content": "NEW YORK  Jan 29 Transatlantic exchange operator Nasdaq OMX Group on Thursday reported a drop in fourth-quarter profit  due in part to acquisition-related expenses and the impact of changes in foreign exchange rates.",
        "date": "01292015",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "UPDATE 1-Nasdaq fourth-quarter profit tops expectations "
    },
    {
        "content": "Jan 5 Nasdaq OMX Group Inc said on Monday it will buy smart beta index provider Dorsey  Wright & Associates LLC for $225 million to boost its index business.",
        "date": "01052015",
        "name": "Nasdaq Inc",
        "news_type": "topStory",
        "symbol": "NDAQ",
        "title": "UPDATE 1-Nasdaq boosts smart beta index business in $225 mln deal "
    },
    {
        "content": "Jan 5 Nasdaq OMX Group Inc will buy smart beta index provider Dorsey  Wright & Associates LLC (DWA) for $225 million to boost its index business.",
        "date": "01052015",
        "name": "Nasdaq Inc",
        "news_type": "normal",
        "symbol": "NDAQ",
        "title": "UPDATE 1-Nasdaq to boost smart beta index business with $225 mln deal "
    }
]