[
    {
        "content": "* Newmont Mining - ‍dividend of $0.075 per share is 50 percent higher than dividend declared in prior year quarter​ Source text for Eikon: Further company coverage:",
        "date": "10242017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont declares quarterly dividend of $0.075 per share "
    },
    {
        "content": "Newmont Mining Corp's  third-quarter profit beat Street estimates but margins were squeezed as the cost of gold production increased and selling prices were lower  sending its shares down nearly 4 percent on Thursday.",
        "date": "10262017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Gold miner Newmont's higher costs cast shadow on profit beat "
    },
    {
        "content": "Oct 26 Newmont Mining Corp's third-quarter profit beat Street estimates but margins were squeezed as the cost of gold production increased and selling prices were lower  sending its shares down nearly 4 percent on Thursday.",
        "date": "10262017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 2-Gold miner Newmont's higher costs cast shadow on profit beat "
    },
    {
        "content": "* Q3 earnings per share view $0.33 -- Thomson Reuters I/B/E/S",
        "date": "10262017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Mining Q3 adjusted earnings per share $0.35 "
    },
    {
        "content": "Oct 26 Gold miner Newmont Mining Corp reported a quarterly profit on Thursday  compared with a year-ago loss when the company took a charge due to discontinued operations.",
        "date": "10262017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Gold miner Newmont posts quarterly profit vs. year-ago loss "
    },
    {
        "content": "LIMA  Sept 19 A farmer in Peru is suing Newmont Mining Corp in U.S. federal court over allegations the miner used violence and threats to try to evict her from her home to make way for a gold project  the environmental group representing her said Tuesday.",
        "date": "09192017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Peru farmer sues miner Newmont in U.S. court over alleged abuse "
    },
    {
        "content": "LIMA  Sept 19 A farmer in Peru is suing Newmont Mining Corp in U.S. federal court  claiming the miner used violence and threats to try to evict her from her home to make way for a gold project  the environmental group representing her said on Tuesday.",
        "date": "09192017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Peru farmer sues miner Newmont in U.S. court over alleged abuse "
    },
    {
        "content": "TORONTO  Aug 9 With a plump $3.1 billion pile of cash  Newmont Mining Corp is mulling a sweeter dividend to attract a broader shareholder base  a move that makes it an outlier in the still recovering gold sector.",
        "date": "08092017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Cash-rich Newmont Mining mulls boosting dividend as peers pursue debt reduction "
    },
    {
        "content": "Newmont Mining Corp handily beat quarterly profit estimates on Tuesday as production improved  more than offsetting the impact of lower realized gold prices  lifting the miner's shares as much as 7.7 percent to a five-month high.",
        "date": "07252017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Rising gold production pushes Newmont past profit estimates "
    },
    {
        "content": "* Shares up as much as 7.7 pct  hit 5-mth high (Adds details from conference call  updates shares)",
        "date": "07252017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 3-Rising gold production pushes Newmont past profit estimates "
    },
    {
        "content": "* Q2 revenue $1.875 billion versus i/b/e/s view $1.77 billion",
        "date": "07252017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont reports Q2 EPS $0.46  produces 1.4 mln ounces of gold "
    },
    {
        "content": "July 25 Newmont Mining Corp  the world's second-biggest gold producer by market value  reported a 60 percent jump in adjusted quarterly profit on Tuesday  as production improved.",
        "date": "07252017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Gold miner Newmont's adjusted quarterly profit jumps 60 pct "
    },
    {
        "content": "* Announced it retired $575 million of principal under its 1.625 pct convertible senior notes due July 15  2017",
        "date": "07172017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont retires $575 million of convertible senior notes "
    },
    {
        "content": "* Evrim Resources Corp says signing of a two-year exploration alliance agreement with a wholly-owned subsidiary of Newmont Mining Corp",
        "date": "07172017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Evrim Resources signs two-year exploration agreement with a unit of Newmont Mining "
    },
    {
        "content": "* Shore gold announces acquisition from newmont to consolidate star-orion south diamond project and earn-in with rio tinto",
        "date": "06232017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Shore Gold announces acquisition from Newmont "
    },
    {
        "content": "* Newmont Mining Corp - on June 14  Newmont USA received a verbal order by an MSHA inspector - SEC filing",
        "date": "06202017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont USA receives a verbal order by an MSHA inspector "
    },
    {
        "content": "* Newmont mining- on may 25 entered amendment and restatement agreement to its existing credit agreement dated as of may 20  2011 - sec filing",
        "date": "05262017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Mining amends credit agreement "
    },
    {
        "content": "* Goldstrike Resources - is mobilizing to Plateau Property in Central Yukon with a Canadian subsidiary of Newmont Mining Corporation",
        "date": "05152017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Goldstrike Resources mobilizes to Plateau Property with a Canadian subsidiary of Newmont Mining "
    },
    {
        "content": "* Announce that Newmont Mining Corp has agreed to purchase 37.38 million common shares of company at a price of c$4.00 per share",
        "date": "05112017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Continental Gold announces agreement with Newmont Mining Corp to purchase 37.38 million common shares of co "
    },
    {
        "content": "* Newmont Mining Corp- announced an agreement to invest approximately U.S.$109 million for 19.9 percent ownership of Continental Gold Inc",
        "date": "05112017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Mining Corp to invest approximately U.S.$109 mln for 19.9 pct ownership of Continental Gold Inc "
    },
    {
        "content": "LIMA  May 3 Peru's Supreme Court ruled on Wednesday in favor of a farmer who Newmont Mining Corp claimed had illegally occupied its land  dealing a blow to the U.S. miner's long-stalled efforts to build a $5 billion gold mine in the Andean country.",
        "date": "05032017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Peru Supreme Court rules against Newmont in dispute over gold mine "
    },
    {
        "content": "Newmont Mining Corp  reported higher-than-expected adjusted earnings on Monday helped by higher production and gold prices as the gold miner also raised its longer-term forecast for output and lowered costs due to expansions at a Ghanaian mine.",
        "date": "04242017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Miner Newmont beats market  ups long-term output forecast "
    },
    {
        "content": "* Q1 GAAP earnings per share $0.13 from continuing operations",
        "date": "04242017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Mining reports Q1 GAAP earnings per share $0.13 from continuing operations "
    },
    {
        "content": "April 24 Newmont Mining Corp reported higher-than-expected adjusted earnings on Monday helped by higher production and gold prices as the gold miner also raised its longer-term forecast for output and lowered costs due to expansions at a Ghanaian mine.",
        "date": "04242017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Miner Newmont beats market  ups long-term output forecast "
    },
    {
        "content": "April 24 Newmont Mining reported slightly lower first-quarter net income on Monday after operations in Australia and South America were hit by poor weather.",
        "date": "04242017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Gold miner Newmont first-quarter earnings dip "
    },
    {
        "content": "* Newmont adds profitable gold production through expansion of Ahafo in Ghana",
        "date": "04202017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont adds profitable gold production through expansion of Ahafo in Ghana "
    },
    {
        "content": "* Newmont Mining Corp - declared a quarterly dividend of $0.05 per share of common stock  dividend is double the dividend paid in prior year quarter Source text for Eikon: Further company coverage:",
        "date": "04192017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Mining Corp declares quarterly dividend $0.05 per share "
    },
    {
        "content": "VANCOUVER  March 6 Newmont Mining on Monday became the latest of the world's biggest gold miners to invest in Canada's Yukon territory  the site of a famous gold rush 120 years ago  as miners hunt for rich  new deposits in safe regions.",
        "date": "03062017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Newmont joins gold 'staking rush' in Canada's once-fabled Yukon "
    },
    {
        "content": "* Entered into a strategic alliance with Newmont Mining Corporation and its subsidiary  Newmont Canada FN Holdings ULC",
        "date": "03062017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Goldstrike forms strategic alliance with Newmont and its unit "
    },
    {
        "content": "* Newmont declares quarterly dividend of $0.05 per share  Source text for Eikon:  Further company coverage:",
        "date": "02172017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont declares quarterly dividend of $0.05 per share "
    },
    {
        "content": "Gold and copper miner Newmont Mining Corp  reported a smaller-than-expected quarterly profit on Tuesday  as costs and expenses jumped more than 51 percent.",
        "date": "02212017",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Miner Newmont's quarterly profit misses as costs surge "
    },
    {
        "content": "Feb 21 Gold and copper miner Newmont Mining Corp  reported a smaller-than-expected quarterly profit on Tuesday  as costs and expenses jumped more than 51 percent.",
        "date": "02212017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Miner Newmont's quarterly profit misses as costs surge "
    },
    {
        "content": "* Newmont announces full year and fourth quarter 2016 results",
        "date": "02212017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont reports Q4 gaap loss per share $0.73 "
    },
    {
        "content": "Feb 21 Gold and copper miner Newmont Mining Corp  reported a bigger quarterly loss on Tuesday as the company took an impairment charge of $974 million.",
        "date": "02212017",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "CORRECTED-Newmont posts bigger quarterly loss on impairment charge "
    },
    {
        "content": "Newmont Mining Corp said on Tuesday it is likely it will record a non-cash impairment charge of between $1 billion and $1.2 billion in the fourth quarter related to an increase in the estimated cost of closing down its Yanacocha gold mine in Peru.",
        "date": "12132016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont sees fourth-quarter writedown related to Peru mine closure costs "
    },
    {
        "content": "* Newmont announces final results and settlement of debt tender offer",
        "date": "11282016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont announces final results and settlement of debt tender offer "
    },
    {
        "content": "* Newmont Mining Corp - \"on track to complete value-adding expansions at Tanami by 2017 and at Carlin by 2018\"",
        "date": "11152016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont declares commercial production at Long Canyon "
    },
    {
        "content": "* To purchase for cash aggregate combined principal amount of up to $500 million of 3.500% senior notes due 2022 and 5.125% senior notes due 2019",
        "date": "11102016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont announces pricing of debt tender offer "
    },
    {
        "content": "TORONTO/VANCOUVER China's Zijin Mining Group Co Ltd and Shandong Gold Mining Co Ltd have held separate talks with Barrick Gold Corp to buy a 50 percent stake in its Veladero gold mine in Argentina  according to four sources with knowledge of the process.",
        "date": "10252016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Exclusive: Chinese miners in talks for stake in Barrick's Veladero mine - sources "
    },
    {
        "content": "* Newmont mining corp-to purchase for cash an aggregate principal amount of up to $500 million of 3.500% senior notes due 2022  5.125% senior notes due 2019  Source text for Eikon:  Further company coverage:",
        "date": "10272016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont announces debt tender offer "
    },
    {
        "content": "Newmont Mining  doubled its dividend on Wednesday and raised its production forecast for the year  as it reported a rise in third-quarter earnings  boosted by a higher gold price.",
        "date": "10262016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Gold miner Newmont doubles dividend  says CFO retiring "
    },
    {
        "content": "TORONTO  Oct 27 Barrick Gold Corp will consider offers to buy all or some of its five major mines  including Veladero in Argentina  a top executive said on Thursday  after Reuters reported the company held talks with Chinese miners.",
        "date": "10272016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Barrick says it's open to offers for core mines  including Veladero "
    },
    {
        "content": "Oct 26 Newmont Mining doubled its dividend on Wednesday and raised its production forecast for the year  as it reported a rise in third-quarter earnings  boosted by a higher gold price.",
        "date": "10262016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 2-Gold miner Newmont doubles dividend  says CFO retiring "
    },
    {
        "content": "* Newmont announces third quarter operating and financial results",
        "date": "10262016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Q3 adjusted earnings per share $0.38 "
    },
    {
        "content": "* Newmont appoints Nancy K. Buese to succeed Laurie Brlas as executive vice president and chief financial officer",
        "date": "10262016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont appoints Nancy Buese to succeed Laurie Brlas as CFO "
    },
    {
        "content": "Oct 26 Newmont Mining reported higher third-quarter earnings on Wednesday while also raising its production forecast for the year and doubling its gold price-linked dividend.",
        "date": "10262016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Gold miner Newmont earnings rise  ups dividend  output forecast "
    },
    {
        "content": "* Appointed Andrew Woodley to lead company's North America business beginning on January 2  2017  Source text for Eikon:  Further company coverage:",
        "date": "10052016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Mining appoints Andrew Woodley to lead North America business from Jan 2  2017 "
    },
    {
        "content": "* Co has completed construction of Merian Gold Mine in Suriname on time",
        "date": "10032016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont mining completes construction of Merian Gold mine in Suriname "
    },
    {
        "content": "* Indonesian subsidiary PTNNT repaid remaining $190 million balance under its revolving credit facility due in 2017",
        "date": "09132016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont subsidiary repays outstanding balance on revolving credit facility "
    },
    {
        "content": "COLORADO SPRINGS  Colo. Newmont Mining Corp's sale of its stake in the Batu Hijau mine in Indonesia may not close until the fourth quarter of the year  Chief Executive Gary Goldberg said on Monday  adding that the approvals process was complex.",
        "date": "09192016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont's Indonesia mine sale closure may slip into fourth quarter: CEO "
    },
    {
        "content": "* Solidusgold to acquire Northumberland Project from Newmont for US$20 million",
        "date": "09162016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Solidusgold to acquire Northumberland project from Newmont for US$20 million "
    },
    {
        "content": "* Under some conditions  Delta Holdco  LLC will be required to pay company a reverse termination fee of $101.31 million - SEC filing  Source text: [http://bit.ly/2d21ci9] Further company coverage:",
        "date": "09192016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Under some conditions  Delta Holdco will be required to pay Infoblox a reverse termination fee of $101.31 million "
    },
    {
        "content": "JAKARTA Indonesian oil and gas producer PT Medco Energi Internasional Tbk plans to invest $500 million to build a copper smelter following its deal to buy control of Newmont Nusa Tenggara (NNT)  its president commissioner told Reuters.",
        "date": "08192016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Indonesia's Medco to invest $500 million to build copper smelter after Newmont deal "
    },
    {
        "content": "* Newmont pays remaining balance on term loan maturing in 2019",
        "date": "08182016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Mining Newmont pays remaining balance on term loan maturing in 2019 "
    },
    {
        "content": "JAKARTA  Aug 18 Indonesia's government has approved an Indonesian investor group's bid to buy control of Newmont Nusa Tenggara (NNT)  which operates the country's second-biggest copper and gold mine  a senior official said on Thursday.",
        "date": "08182016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Indonesian government approves Newmont Nusa Tenggara deal - official "
    },
    {
        "content": "VANCOUVER/TORONTO  Aug 3 Barrick Gold Corp's  sale of its stake in Australia's Kalgoorlie mine should attract a string of suitors  but its  partner Newmont Mining  may have an advantage over other bidders in the sale process  industry sources say.",
        "date": "08032016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "DEALTALK-Newmont seen in strong position in Barrick Australian mine sale "
    },
    {
        "content": "VANCOUVER/TORONTO Barrick Gold Corp's  sale of its stake in Australia's Kalgoorlie mine should attract a string of suitors  but its  partner Newmont Mining  may have an advantage over other bidders in the sale process  industry sources say.",
        "date": "08032016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Newmont seen in strong position in Barrick Australian mine sale "
    },
    {
        "content": "TORONTO  July 21 Newmont Mining Corp  the world's second biggest gold miner by market value  hinted on Thursday that it will boost its quarterly dividend later this year  reflecting a 25 percent jump in bullion prices so far this year.",
        "date": "07212016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Miner Newmont hints at dividend increase as bullion prices soar "
    },
    {
        "content": "* Newmont Chief Financial Officer: Plan to reassess dividend later this year  \"would expect to be able to adjust it  given our strong cash performance\"",
        "date": "07212016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont to consider mine extensions  exploration  dividend "
    },
    {
        "content": "Newmont Mining's  adjusted net income in the second quarter blew past market expectations on Wednesday and the world's second biggest gold miner by value also cut its gold cost forecast  sending its shares higher after hours.",
        "date": "07202016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Gold miner Newmont cuts cost forecast  beats market "
    },
    {
        "content": "July 20 Newmont Mining's adjusted net income in the second quarter blew past market expectations on Wednesday and the world's second biggest gold miner by value also cut its gold cost forecast  sending its shares higher after hours.",
        "date": "07202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 2-Gold miner Newmont cuts cost forecast  beats market "
    },
    {
        "content": "* Sets quarterly dividend of $0.025 per share  Source text for Eikon:  Further company coverage:",
        "date": "07202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Mining sets qtrly dividend of $0.025 per share "
    },
    {
        "content": "* Qtrly gold CAS $637 per ounce compared to $642 per ounce in prior year quarter",
        "date": "07202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Q2 adjusted earnings per share $0.44 "
    },
    {
        "content": "July 20 Newmont Mining Corp reported higher second-quarter adjusted net income on Wednesday on the back of higher gold production and lower costs.",
        "date": "07202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Gold miner Newmont quarterly adjusted income jumps "
    },
    {
        "content": "* Moody's says Newmont's sale of Batu Hijau interest credit positive  Source text for Eikon:  Further company coverage:    (Bengaluru newsroom)",
        "date": "07052016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Moody's says Newmont's sale of Batu Hijau interest credit positive "
    },
    {
        "content": "* Says total consideration is $1.3 billion for Newmont's 48.5 percent economic interest in PTNNT",
        "date": "06302016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont enters agreement to sell interest in Indonesian assets "
    },
    {
        "content": "* Legal case may hamper Indonesians' plan to fully own NNT   (Adds comment from Indonesia's energy minister)",
        "date": "07012016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "UPDATE 5-Indonesian group to buy 82.2 pct of copper-gold miner for $2.6 bln "
    },
    {
        "content": "JAKARTA  May 24 Indonesia's mining ministry recommended renewing the export licence for the local unit of U.S. copper and gold miner Newmont Mining Corp to export copper concentrate for the next six months  a ministry official said on Tuesday.",
        "date": "05242016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "UPDATE 1-Indonesia renews Newmont Mining's copper export licence for six months "
    },
    {
        "content": "* Chilean subsidiary established a Chilean joint venture company with subsidiary of Newmont Mining Corporation",
        "date": "05172016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Revelo establishes JV in Chile for Montezuma Project "
    },
    {
        "content": "* Newmont unit says it has \"most rights\" over 17.8 pct Nusa Tenggara stake",
        "date": "05192016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont asks Jakarta court to deny request that may block Indonesia mine sale "
    },
    {
        "content": "Newmont Mining Corp is conducting an investigation into certain business activities of the company  its affiliates and contractors in countries outside the United States  the miner said in a filing with the U.S. Securities and Exchange Commission (SEC) on Wednesday.",
        "date": "04212016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont Mining investigates some activities outside of U.S.-filing "
    },
    {
        "content": "* Newmont's gold price-linked dividend policy includes quarterly dividend payable based on average lbma p.m. Gold price for preceding quarter",
        "date": "04192016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont Mining declares qtrly dividend of $0.025 per share "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)  The Coca-Cola Co is expected to report first-quarter revenue slightly above analysts' expectations  according to Thomson Reuters StarMine data. The world's largest soda maker has been aggressively cutting costs to cushion the impact of a strong dollar",
        "date": "04192016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "What to Watch in the Day Ahead - Wednesday  April 20 "
    },
    {
        "content": "Gold and copper miner Newmont Mining Corp  reported lower quarterly earnings on Wednesday but they blew past analyst estimates due to higher copper sales from its Indonesian operation and a strong performance from its Australasian mines.",
        "date": "04202016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Gold miner Newmont's earnings beat market estimates "
    },
    {
        "content": "Newmont Mining Corp is conducting an investigation into certain business activities of the company  its affiliates and contractors in countries outside the United States  the miner said in a filing with the U.S. Securities and Exchange Commission (SEC) on Wednesday.",
        "date": "04202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Newmont Mining investigates some activities outside of U.S.: filing "
    },
    {
        "content": "April 20 Newmont Mining Corp is conducting an investigation into certain business activities of the company  its affiliates and contractors in countries outside the United States  the miner said in a filing with the U.S. Securities and Exchange Commission (SEC) on Wednesday.",
        "date": "04202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Newmont Mining investigates some activities outside of U.S.-filing "
    },
    {
        "content": "April 20 Newmont Mining Corp is conducting an investigation into certain business activities of the company  its affiliates and contractors in countries outside the United States  the miner said in a filing with the U.S. Securities and Exchange Commission (SEC) on Wednesday.",
        "date": "04202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Newmont Mining investigates some activities outside of U.S.-filing "
    },
    {
        "content": "April 20 Gold and copper miner Newmont Mining Corp reported lower quarterly earnings on Wednesday but they blew past analyst estimates due to higher copper sales from its Indonesian operation and a strong performance from its Australasian mines.",
        "date": "04202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 2-Gold miner Newmont's earnings beat market estimates "
    },
    {
        "content": "April 20 Newmont Mining Corp reported lower first-quarter  earnings on Wednesday on the back of weaker gold and copper prices  although the earnings beat analyst estimates with help from higher production and lower costs.",
        "date": "04202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "CORRECTED-UPDATE 1-Gold miner Newmont first-quarter earnings beat market estimates "
    },
    {
        "content": "April 20 Newmont Mining Corp reported lower first-quarter earnings on Wednesday on the back of weaker average realized gold and copper prices.",
        "date": "04202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "CORRECTED-Newmont Mining first-quarter net earnings fall "
    },
    {
        "content": "* Newmont announces first quarter operating and financial results",
        "date": "04202016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "BRIEF-Newmont reports Q1 adjusted earnings per share $0.34 "
    },
    {
        "content": "* Newmont shareholder's legal battle may complicate deal   (Adds comment from SOE minister  background)",
        "date": "04152016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "UPDATE 1-Indonesia state miners may join with Panigoro group for Newmont unit -official "
    },
    {
        "content": "JAKARTA  April 15 Indonesian state miners may partner with a consortium including prominent businessman Arifin Panigoro to buy a stake in Newmont Mining Corp's local operations  an official at the state enterprises ministry said on Friday.",
        "date": "04152016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Indonesia state miners may join with Panigoro group for Newmont -official "
    },
    {
        "content": "* Suit could hold up Panigoro group's bid to control Newmont unit",
        "date": "04122016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "REFILE-UPDATE 1-Indonesia businessman asks court to block sale of company's Newmont stake "
    },
    {
        "content": "JAKARTA  April 11 Indonesia's government has to approve a local group's plan to buy a controlling stake in Newmont Mining Corp's Indonesian unit  Bambang Gatot  director general of coal and minerals at the energy ministry said on Monday.",
        "date": "04112016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Indonesia govt has to approve Newmont Indonesia's stake sale -official "
    },
    {
        "content": "* Suit could hold up Panigoro group's bid to control Newmont unit",
        "date": "04122016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Indonesia businessman asks court to block sale of local company's Newmont stake "
    },
    {
        "content": "JAKARTA  April 6 Shares of PT Bumi Resources Minerals Tbk surged as much as 22 percent on Wednesday on hopes that the Indonesian miner would reap profits from selling a stake in Newmont Mining Corp's Indonesian operations to a consortium.",
        "date": "04062016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Indonesia Bumi Resources Minerals' shares up on hopes of Newmont unit stake sale "
    },
    {
        "content": "JAKARTA  April 7 An Indonesian group has obtained a $750 million loan from two state-owned banks to help finance its purchase of a controlling stake in Newmont Mining Corp's Indonesian operations  Basis Point reported on Thursday.",
        "date": "04072016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Indonesian group gets $750 mln loan from two banks for Newmont deal-Basis Point "
    },
    {
        "content": "* Deal to involve debt and equity  valued around $2 bln -source",
        "date": "04052016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "UPDATE 2-Indonesian group to buy control of Newmont unit for $2 billion "
    },
    {
        "content": "JAKARTA  April 5 An Indonesian group is set to buy a controlling stake in U.S. miner Newmont Mining Corp's  local operations and the deal is expected to be announced this week  Indonesian businessman Arifin Panigoro said on Tuesday.",
        "date": "04052016",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Indonesian group to control Newmont Mining unit -businessman Panigoro "
    },
    {
        "content": "* Newmont announces pricing of debt tender offer  Source text for Eikon:  Further company coverage:    (Reporting By Sudarshan Varadhan)",
        "date": "03142016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Newmont announces pricing of debt tender offer "
    },
    {
        "content": "SYDNEY  March 11 U.S. gold giant Newmont Mining  said it is selling its stake in Australian miner Regis Resources to institutional investors for $182 million.",
        "date": "03102016",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont sells out of Australian gold miner Regis "
    },
    {
        "content": "Newmont Mining Corp said on Wednesday it expects to maintain profitable production of between 4.5 million and 5 million ounces of gold a year over the next five years and keep all-in sustaining costs below $1 000 an ounce.",
        "date": "12032015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Gold miner Newmont sees costs below $1 000/ounce for next 5 years "
    },
    {
        "content": "Dec 2 Newmont Mining Corp said on Wednesday it expects to maintain profitable production of between 4.5 million and 5 million ounces of gold a year over the next five years and keep all-in sustaining costs below $1 000 an ounce.",
        "date": "12022015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "UPDATE 1-Gold miner Newmont sees costs below $1 000/ounce for next 5 yrs "
    },
    {
        "content": "Dec 2 Newmont Mining Corp said on Wednesday it expects to maintain profitable production of between 4.5 million and 5 million ounces of gold a year over the next five years and keep all-in sustaining costs below $1 000 an ounce.",
        "date": "12022015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Gold miner Newmont sees costs below $1 000/ounce for next 5 yrs "
    },
    {
        "content": "Nov 26 Newmont Mining Corp said discussions with firms potentially interested in acquiring the U.S. company's Indonesian assets have not met its \"sales criteria\".",
        "date": "11262015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont says firms eyeing Indonesian assets yet to meet \"sales criteria\" "
    },
    {
        "content": "JAKARTA  Nov 25 The owner of Indonesia's Medco Energi Internasional  Arifin Panigoro  is seeking government approval to acquire a 76 percent stake in the Indonesian unit of Newmont Mining Corp  resources minister Rizal Ramli was quoted on Wednesday as saying.",
        "date": "11262015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "CORRECTED-Indonesia's Medco Energi owner eyeing 76 percent stake in Newmont unit-minister "
    },
    {
        "content": "JAKARTA  Nov 25 The owner of Indonesia's Medco Energi Internasional  Arifin Paniorogo  is seeking government approval to acquire a 76 percent stake in the Indonesian unit of Newmont Mining Corp  resources minister Rizal Ramli was quoted on Wednesday as saying.",
        "date": "11252015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Indonesia's Medco Energi owner eyeing 76 percent stake in Newmont unit-minister "
    },
    {
        "content": "JAKARTA  Nov 20 Indonesia's mining ministry has issued a six-month quota to U.S. copper and gold miner Newmont Mining Corp to export 430 000 tonnes of copper concentrate from its mine in eastern Indonesia  a ministry official said on Friday.",
        "date": "11202015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont gets 6-mth quota to export 430 000 T of copper concentrate from Indonesia "
    },
    {
        "content": "Newmont Mining Corp   the biggest U.S.-based gold miner  reported lower earnings on Wednesday but the results were better than the market expected on the back higher gold production and lower cost.",
        "date": "10282015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont earnings beat market expectations   cuts cost outlook "
    },
    {
        "content": "Oct 28 Newmont Mining Corp  the biggest U.S.-based gold miner  reported lower earnings on Wednesday but the results were better than the market expected on the back higher gold production and lower cost.",
        "date": "10282015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Newmont earnings beat market expectations   cuts cost outlook "
    },
    {
        "content": "Oct 28 Newmont Mining Corp  the biggest U.S.-based gold miner  reported slightly weaker third-quarter net income on Wednesday as a drop in gold prices offset higher production and lower costs.",
        "date": "10282015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Newmont reports lower third-quarter net income "
    },
    {
        "content": "Oct 28 Newmont Mining Corp on Wednesday announced plans to expand its Tanami gold mining operation in Australia by building a second decline in the underground mine and adding plant capacity.",
        "date": "10282015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Gold miner Newmont to expand Tanami mine in Australia "
    },
    {
        "content": "Oct 28 Newmont Mining Corp on Wednesday announced plans to expand its Tanami gold mining operation in Australia by building a second decline in the underground mine and adding plant capacity.",
        "date": "10282015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Gold miner Newmont to expand Tanami mine in Australia "
    },
    {
        "content": "SYDNEY  Oct 1 Barrick Gold Corp has not had talks over a sale of its 50 percent stake in Australia's Super Pit gold mine to its partner Newmont Mining Corp  Barrick adviser and ex-president Jim Gowans said on Thursday.",
        "date": "10012015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Barrick not in talks with Newmont on sale in gold mine stake  - adviser "
    },
    {
        "content": "JAKARTA  Sept 22 Newmont Mining Corp's  Indonesian copper export permit  which expired on Tuesday  will not be renewed as the U.S. miner has failed to meet government stipulations for developing a domestic smelter  government officials said.",
        "date": "09222015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "UPDATE 1-Newmont's Indonesian copper export permit will not be renewed - govt officials "
    },
    {
        "content": "DENVER  Sept 22 Newmont Mining Corp is not interested in buying the U.S. assets Barrick Gold  has put up for sale  but would be keen on Barrick's 50 percent stake in an Australian mine at the right price  Newmont Chief Executive Gary Goldberg said on Tuesday.",
        "date": "09222015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Newmont not interested in Barrick's U.S. assets  eyes Australia "
    },
    {
        "content": "JAKARTA  Sept 18 Newmont Mining Corp's  Indonesian copper export permit will not be renewed beyond Friday unless the U.S. miner submits a progress update to the government on its plans to develop a domestic smelter  a mine ministry official said.",
        "date": "09182015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "UPDATE 1-Indonesia says Newmont running out of time on new export permit "
    },
    {
        "content": "JAKARTA  Sept 18 Newmont Mining Corp's  Indonesian copper export permit will not be renewed beyond Friday unless the U.S. miner submits a progress update to the government on its plans to develop a domestic smelter  a mine ministry official said.",
        "date": "09182015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Indonesia says Newmont running out of time on new export permit "
    },
    {
        "content": "Newmont Mining Corp  reported higher second-quarter adjusted earnings on Wednesday  in line with analyst expectations  as lower oil prices and favorable exchange rates offset the impact of weaker metal prices.",
        "date": "07222015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Gold miner Newmont earnings in line  raises output forecast "
    },
    {
        "content": "July 22 Newmont Mining Corp reported higher second-quarter adjusted earnings on Wednesday  in line with analyst expectations  as lower oil prices and favorable exchange rates offset the impact of weaker metal prices.",
        "date": "07222015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Gold miner Newmont earnings in line  raises output forecast "
    },
    {
        "content": "July 22 Newmont Mining Corp reported higher second-quarter adjusted earnings on Wednesday as lower oil prices and favorable exchange rates offset the impact of weaker metal prices.",
        "date": "07222015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "U.S. gold miner Newmont's quarterly adjusted earnings rise "
    },
    {
        "content": "Newmont Mining Corp has agreed to buy the Cripple Creek & Victor gold mine in Colorado from AngloGold Ashanti Ltd for $820 million  giving the world's No. 2 gold producer an expanding asset in a mining-friendly jurisdiction.",
        "date": "06082015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Gold miner Newmont to buy Colorado mine from AngloGold "
    },
    {
        "content": "June 8 Newmont Mining Corp has agreed to buy the Cripple Creek & Victor gold mine in Colorado from AngloGold Ashanti Ltd for $820 million  giving the world's No. 2 gold producer an expanding asset in a mining-friendly jurisdiction.",
        "date": "06082015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 2-Gold miner Newmont to buy Colorado mine from AngloGold "
    },
    {
        "content": "June 8 Newmont Mining Corp said on Monday it has agreed to buy the Cripple Creek & Victor gold mine in Colorado from AngloGold Ashanti Ltd for $820 million plus a net smelter royalty.",
        "date": "06082015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Gold miner Newmont agrees to buy Colorado mine from AngloGold "
    },
    {
        "content": "TORONTO Bigger isn't better for the world's gold miners  who are increasingly making \"bite-sized\" developments that carry less risk of budget disasters and fewer of the political and environmental disputes that have derailed mega-mines in recent years.",
        "date": "06052015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "For risk-wary gold miners  small is beautiful "
    },
    {
        "content": "TORONTO/VANCOUVER Newmont Mining Corp  is in exclusive talks with AngloGold Ashanti Ltd  as it moves closer toward clinching a deal to buy the African miner's Cripple Creek & Victor gold mine in Colorado  according to two sources familiar with the matter.",
        "date": "06012015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "AngloGold in exclusive talks with Newmont on Colorado mine: sources "
    },
    {
        "content": "TORONTO/VANCOUVER  June 1 Newmont Mining Corp  is in exclusive talks with AngloGold Ashanti Ltd  as it moves closer toward clinching a deal to buy the African miner's Cripple Creek & Victor gold mine in Colorado  according to two sources familiar with the matter.",
        "date": "06012015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "AngloGold in exclusive talks with Newmont on Colorado mine-sources "
    },
    {
        "content": "SYDNEY  May 26 Gold miners are spearheading a wave of merger and acquisition activity in Australia  riding a rebound in local gold prices to pounce on projects promising quick growth.",
        "date": "05262015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Australia's gold miners drive M&A revival "
    },
    {
        "content": "* French government approves the strategic agreement with Newmont Mining Corp",
        "date": "04302015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "BRIEF-Auplata says French government accepts the deal with Newmont Mining "
    },
    {
        "content": "Newmont Mining Corp  said on Wednesday it has tentatively agreed to sell its Waihi gold mining operation in New Zealand to OceanaGold Corp  for around $106 million plus a 1 percent net smelter royalty on a recent discovery near the mine.",
        "date": "04292015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont agrees to sell New Zealand gold mine to OceanaGold "
    },
    {
        "content": "April 29 Newmont Mining Corp said on Wednesday it has tentatively agreed to sell its Waihi gold mining operation in New Zealand to OceanaGold Corp for about $106 million plus a 1 percent net smelter royalty on a recent discovery near the mine.",
        "date": "04302015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 2-Newmont agrees to sell New Zealand gold mine to OceanaGold "
    },
    {
        "content": "April 29 Newmont Mining Corp said on Wednesday it has tentatively agreed to sell its Waihi gold mining operation in New Zealand to OceanaGold Corp for around $106 million plus a 1 percent net smelter royalty on a recent discovery near the mine.",
        "date": "04292015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Newmont agrees to sell New Zealand gold mine to OceanaGold "
    },
    {
        "content": "April 29 Newmont Mining Corp said on Wednesday it has tentatively agreed to sell its Waihi gold mining operation in New Zealand to OceanaGold Corp for around $106 million plus a one percent net smelter royalty.",
        "date": "04292015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Newmont in tentative deal to sell New Zealand gold mine to OceanaGold "
    },
    {
        "content": "SYDNEY  April 29 Canada's Barrick Gold  will relinquish some management duties at Australia's Super Pit gold mine to partner Newmont Mining  in a further pull-back from operations in the Southern Hemisphere",
        "date": "04292015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Barrick Gold takes backseat at Australia's Super Pit "
    },
    {
        "content": "Newmont Mining Corp  the world's No. 2 gold miner   reported an adjusted quarterly profit that was double the analysts' average estimate  helped by lower costs.",
        "date": "04232015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont Mining posts profit well ahead of estimate "
    },
    {
        "content": "April 23 Newmont Mining Corp  the world's No. 2 gold miner   reported an adjusted quarterly profit that was double the analysts' average estimate  helped by lower costs.",
        "date": "04232015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Newmont Mining posts profit well ahead of estimate "
    },
    {
        "content": "April 23 Newmont Mining Corp  the world's No. 2 gold producer  reported an 89 percent rise in first-quarter adjusted profit on Thursday  helped by lower costs and higher copper production.",
        "date": "04232015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Miner Newmont's adjusted profit rises 89 percent "
    },
    {
        "content": "April 8 Newmont Mining Corp said on Wednesday it will go ahead with building the first phase of its Long Canyon gold mine in Nevada.",
        "date": "04082015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Newmont Mining says will build new Nevada gold mine "
    },
    {
        "content": "April 8 Newmont Mining Corp will go ahead with building the first phase of its Long Canyon gold mine in Nevada  the company  the biggest U.S.-based gold miner said on Wednesday.",
        "date": "04082015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Newmont Mining says will build new Nevada gold mine "
    },
    {
        "content": "JAKARTA  March 19 Newmont Mining Corp's  Indonesian copper export permit was extended for six months on Wednesday.      Below is a list of six-month export permits issued by the Energy and Mineral Resources Ministry for the year-to-date  but released late on Wednesday by the ministry's Director General  Sukhyar.      The table below lists companies  concentrates and export quota tonnage issued by the ministry:          Company                        Mineral/concentrates  Tonnage     ",
        "date": "03192015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Indonesia issues list of six-month mining export permits "
    },
    {
        "content": "JAKARTA  March 18 Newmont Mining Corp's  Indonesian copper export permit has been extended for six months  a mining ministry official said on Wednesday  after the company gave assurances over its commitment to build a smelter with Freeport-McMoRan Inc.",
        "date": "03182015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "UPDATE 1-Newmont's Indonesian copper export permit extended "
    },
    {
        "content": "JAKARTA  March 18 Newmont Mining Corp's  Indonesian copper export permit will be extended for six months on Wednesday  a mines ministry official said  after the company gave assurances over its commitment to build a smelter with Freeport-McMoRan Inc.",
        "date": "03182015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Newmont to get Indonesian export permit extension - govt official "
    },
    {
        "content": "JAKARTA  March 2 Newmont Mining Corp's  Indonesian copper export permit will not be renewed beyond March 19 unless it strikes a deal with Freeport-McMoRan Inc to invest in the latter's planned smelter  a mines ministry official said on Monday.",
        "date": "03022015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "UPDATE 2-Indonesia sets Newmont deadline for Freeport smelter deal "
    },
    {
        "content": "JAKARTA Newmont Mining Corp's Indonesian copper export permit will not be renewed beyond March 19 unless it strikes a deal with Freeport-McMoRan Inc to invest in the latter's planned smelter  a mines ministry official said on Monday.",
        "date": "03022015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Indonesia sets Newmont deadline for Freeport smelter deal "
    },
    {
        "content": "JAKARTA  March 2 Newmont Mining Corp's  Indonesian copper export permit will not be renewed beyond March 19 unless it strikes a deal with Freeport-McMoRan Inc to invest in the latter's planned smelter  a mines ministry official said on Monday.",
        "date": "03022015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "REFILE-UPDATE 1-Indonesia sets Newmont deadline for Freeport smelter deal "
    },
    {
        "content": "JAKARTA  March 2 Newmont Mining Corp's  Indonesian copper export permit will not be renewed beyond March 19 unless it strikes a deal with Freeport-McMoRan Inc to invest in the latter's planned smelter  a mines ministry official said on Monday.",
        "date": "03022015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Indonesia give Newmont three weeks to strike smelter deal "
    },
    {
        "content": "Newmont Mining Corp   the U.S.'s largest gold producer  reported on Thursday a narrower adjusted fourth quarter profit  though earnings were stronger than expected.",
        "date": "02192015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Newmont adjusted profit down on gold price  but beats estimates "
    },
    {
        "content": "Feb 19 Newmont Mining Corp  the U.S.'s largest gold producer  reported on Thursday a narrower adjusted fourth quarter profit  though earnings were stronger than expected.",
        "date": "02192015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "UPDATE 1-Newmont adjusted profit down on gold price  but beats estimates "
    },
    {
        "content": "Feb 19 Newmont Mining Corp reported on Thursday a narrower adjusted fourth quarter profit  as lower gold production and metal prices weighed on revenues.",
        "date": "02192015",
        "name": "Newmont Mining Corporation",
        "news_type": "normal",
        "symbol": "NEM",
        "title": "Newmont Mining adjusted profit down on gold price  output "
    },
    {
        "content": "JAKARTA  Feb 10 Indonesia expects U.S. miner Newmont Mining Corp to produce 25 percent more copper and gold concentrate in 2015  a mining ministry official said  after a nine-month export stoppage hit Newmont's production in 2014.",
        "date": "02102015",
        "name": "Newmont Mining Corporation",
        "news_type": "topStory",
        "symbol": "NEM",
        "title": "Indonesia sees Newmont concentrate output up 25 pct in 2015 "
    }
]