[
    {
        "content": "Six U.S. cable providers said they lost a total of 498 000 subscribers in the third quarter and more than 1.6 million subscribers this year as customers opt for online streaming packages like Netflix Inc and Hulu.",
        "date": "11162017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Factbox: U.S. TV viewers continue cutting the cord in the third quarter "
    },
    {
        "content": "* Tiger Global Management takes share stake of 1.5 million class A shares in Roku Inc - Sec filing‍​",
        "date": "11142017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Tiger Global Management ups stake in Netflix  takes stake in Roku "
    },
    {
        "content": "Amazon.com Inc has bought the global television rights to \"The Lord of the Rings \" the company said on Monday  in what may be its biggest and most expensive move yet to draw viewers to its streaming and shopping club Prime.",
        "date": "11142017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Amazon to produce 'Lord of the Rings' television series "
    },
    {
        "content": "Nov 10 Walt Disney's shares rose 3 percent on Friday  as Wall Street shrugged off poor financial results and focused instead on the media giant's commitment to build a service that will compete aggressively with video streaming pioneer Netflix.",
        "date": "11102017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Disney shares rise as focus turns to streaming commitment "
    },
    {
        "content": "TORONTO/MONTREAL The Canadian province of Quebec has told Ottawa it will impose a sales tax on online companies  such as video streaming service Netflix Inc   and called on the federal government to reconsider its own decision not to do the same  La Presse newspaper reported on Wednesday.",
        "date": "11082017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Canada's Quebec looks to impose sales tax on Netflix  others: report "
    },
    {
        "content": "TORONTO/MONTREAL  Nov 8 The Canadian province of Quebec has told Ottawa it will impose a sales tax on online companies  such as video streaming service Netflix Inc  and called on the federal government to reconsider its own decision not to do the same  La Presse newspaper reported on Wednesday.",
        "date": "11082017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Canada's Quebec looks to impose sales tax on Netflix  others -report "
    },
    {
        "content": "LOS ANGELES Netflix Inc severed ties on Friday with Kevin Spacey  one of its biggest stars and the lead in its popular drama  \"House of Cards \" after a number of allegations of sexual misconduct against the Oscar-winning actor.",
        "date": "11042017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix cuts ties with Kevin Spacey after sexual misconduct allegations "
    },
    {
        "content": "LOS ANGELES  Nov 3 Netflix Inc severed ties on Friday with Kevin Spacey  one of its biggest stars and the lead in its popular drama  \"House of Cards \" after a number of allegations of sexual misconduct against the Oscar-winning actor.",
        "date": "11042017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 2-Netflix cuts ties with Kevin Spacey after sexual misconduct allegations "
    },
    {
        "content": "LOS ANGELES Oscar-winning actor Kevin Spacey is seeking unspecified treatment  according to his representatives  following allegations of sexual misconduct that have forced a halt in production of his Netflix show \"House of Cards\" and a social media backlash.",
        "date": "11032017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Kevin Spacey seeks treatment after sexual misconduct claims: representatives "
    },
    {
        "content": "LOS ANGELES  Oct 31 Netflix Inc suspended production of political drama \"House of Cards\" on Tuesday following an allegation of sexual misconduct against star Kevin Spacey  the streaming service and the show's producer said in a statement.",
        "date": "10312017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix suspends 'House of Cards' production after Spacey allegation "
    },
    {
        "content": "LOS ANGELES  Nov 2 Oscar-winning actor Kevin Spacey is seeking unspecified treatment  according to his representatives  following allegations of sexual misconduct that have forced a halt in production of his Netflix show \"House of Cards\" and a social media backlash.",
        "date": "11032017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Kevin Spacey seeks treatment after sexual misconduct claims -representatives "
    },
    {
        "content": "* Aannounced availability of Netflix Ultra HD (UHD) 4K programming on Xfinity X1​ Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Comcast says introducing Netflix in 4K on Xfinity X1 "
    },
    {
        "content": "LOS ANGELES Netflix Inc's groundbreaking political drama \"House of Cards\" will end after its upcoming sixth season  the company said on Monday  one day after a sexual misconduct allegation emerged against star Kevin Spacey. | Video ",
        "date": "10312017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix ending 'House of Cards ' says 'troubled' by Spacey allegation "
    },
    {
        "content": "* Says ‍announced pricing of an offering of $1.6 billion aggregate principal amount of 4.875% senior notes due 2028​ Source text for Eikon: Further company coverage:",
        "date": "10232017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix prices $1.6 bln offering of senior notes "
    },
    {
        "content": "NEW YORK Target Corp  said on Monday it would start free shipping beginning in November and that most of its gift assortment had been priced at under $15  as the retailer gets ready to take on Amazon.com  and Wal-Mart  in the most crucial shopping season of the year.",
        "date": "10232017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Target gears up for holidays with free shipping and gifts under $15 "
    },
    {
        "content": "Shares of Netflix Inc hit a record high on Tuesday as  more subscribers around the globe signed up for its popular original content in the latest quarter. | Video ",
        "date": "10172017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix flirting near record on subscriber growth "
    },
    {
        "content": "Oct 17 Shares of Netflix Inc hit a record high on Tuesday as  more subscribers around the globe signed up for its popular original content in the latest quarter.",
        "date": "10172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix flirting near record on subscriber growth "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Netflix's valuation outstrips its burgeoning opportunity. The $87 billion video-streaming service hit another all-time high on Monday  benefiting in part from Comcast and AT&T recently warning of a fall in subscribers. Pay-TV customers cutting the cord should mean more viewers for Netflix. But even that and a fee hike last month don’t justify it trading at a sky-high multiple.",
        "date": "10162017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Breakingviews - Netflix valuation outstrips burgeoning opportunity "
    },
    {
        "content": "Oct 17 Shares in Netflix Inc were set to open at a record high on Tuesday after the video streaming company added more subscribers than expected around the world in the third quarter.",
        "date": "10172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix set to open at record high on subscriber growth "
    },
    {
        "content": "Netflix Inc added more subscribers than expected around the world in the third quarter and projected growth in line with Wall Street forecasts  saying it had a head start on rivals as internet television explodes globally. | Video ",
        "date": "10172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix adds more subscribers than expected  shares hit record "
    },
    {
        "content": "** Shares of Netflix up 1.7 pct and hitting a record high in extended trade of $210.79 after the video-streaming pioneer added more subscribers than analysts expected in fiscal Q3",
        "date": "10162017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BUZZ-Netflix subscriber growth beats estimates  stock hits record "
    },
    {
        "content": "Oct 16 Netflix Inc added more subscribers than expected around the world in the third quarter and projected growth in line with Wall Street forecasts  saying it had a head start on rivals as internet television explodes globally.",
        "date": "10172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 3-Netflix adds more subscribers than expected  shares hit record "
    },
    {
        "content": "* Quarterly total streaming net additions were 5.30 million versus co's forecast of 4.4 million",
        "date": "10162017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix Inc reports quarterly earnings per share $0.29 "
    },
    {
        "content": "Oct 16 Video-streaming pioneer Netflix Inc added more subscribers than expected in the third quarter as original shows such as the latest season of \"Narcos\" helped attract more viewers.",
        "date": "10162017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix subscriber adds beat St as original shows pull in new viewers "
    },
    {
        "content": "* MONDO TV SUISSE AND AURORA WORLD CORP SAY NETFLIX HAS ENTERED INTO LICENSING AGREEMENT OF ANIMATED TV SERIES BASED ON CHARACTER YOOHOO",
        "date": "10162017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Mondo TV Suisse and Aurora to co-produce YooHoo TV series with Netflix "
    },
    {
        "content": "NEW YORK  Oct 13 Netflix Inc shares hit an all-time high on Friday as Goldman Sachs and other brokerages raised their price targets on the world's biggest online-streaming company  citing its ability to raise fees without scaring away customers.",
        "date": "10132017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Wall Street raises targets on Netflix  citing price increases "
    },
    {
        "content": "Oct 13 Netflix Inc shares hit an all-time high on Friday as Goldman Sachs and other brokerages raised their price targets on the world's biggest online-streaming company  citing its ability to raise fees without scaring away customers.",
        "date": "10132017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Wall Street raises targets on Netflix  citing price increases "
    },
    {
        "content": "Bets on the future of an investment in a Netflix-style movie subscription business sent shares in previously little-known IT firm Helios and Matheson Analytics Inc soaring again on Wednesday.",
        "date": "10112017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Helios and Matheson reaps benefits of MoviePass frenzy "
    },
    {
        "content": "Oct 6    ** Video-streaming service raises subscription fees for first time since 2015  two brokerages hike PT",
        "date": "10062017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BUZZ-Netflix Inc: Analysts raise PT after fee hike "
    },
    {
        "content": "Oct 11 Bets on the future of an investment in a Netflix-style movie subscription business sent shares in previously little-known IT firm Helios and Matheson Analytics Inc soaring again on Wednesday.",
        "date": "10112017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Helios and Matheson reaps benefits of MoviePass frenzy "
    },
    {
        "content": "Oct 10 Netflix Inc said on Tuesday it had received formal approval to set up a C$500 million production unit in Canada and sought to quell talk it had sought special tax benefits for investing in its first such unit outside the United States.",
        "date": "10102017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix fends off criticism over Canada investment "
    },
    {
        "content": "Netflix Inc's U.S. business announced the first rises in monthly fees in two years on Thursday  hiking costs for two of its three main subscription plans as it spends heavily on its own original content.",
        "date": "10052017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix ups U.S. fees for first time since 2015 "
    },
    {
        "content": "* Netflix says will increase prices for U.S. new members on Oct 5",
        "date": "10052017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix ups U.S. fees for first time since 2015 "
    },
    {
        "content": "Oct 5 Netflix Inc's U.S. business announced the first rises in monthly fees in two years on Thursday  hiking costs for two of its three main subscription plans as it spends heavily on its own original content.",
        "date": "10052017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 2-Netflix ups U.S. fees for first time since 2015 "
    },
    {
        "content": "* Indexes higher: Dow 0.14 pct  S&P 0.22 pct  Nasdaq 0.25 pct (Adds comments from analyst  updates prices)",
        "date": "10052017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Tech stocks power Wall St indexes to fresh record-highs "
    },
    {
        "content": "Oct 5 Netflix Inc has raised the monthly subscription fees for two out of its three main U.S. plans by $1 and $2 respectively  according to details published on the company's subscription page on Thursday.",
        "date": "10052017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix ups monthly subscription fees for two plans "
    },
    {
        "content": "Oct 5 The following are the top stories from select Canadian newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "10052017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "PRESS DIGEST- Canada- Oct 5 "
    },
    {
        "content": "* Co has been awarded contract to supply camera systems and equipment for Netflix's first Korean original production Source text for Eikon: Further company coverage:",
        "date": "09182017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Spackman Entertainment awarded contract to supply camera systems for Netflix's production "
    },
    {
        "content": "* We're seeing the momentum of shift to internet entertainment pick up steam   that's helping drive our growth - CFO  Conf call",
        "date": "09122017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix CFO says the momentum of shift to internet entertainment pick up steam   helping drive our growth "
    },
    {
        "content": "T-Mobile US Inc  said on Wednesday it will offer a free subscription to video streaming service Netflix Inc  with its unlimited data family plans in a push to lure more subscribers.",
        "date": "09062017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "T-Mobile US to offer free Netflix with family plan "
    },
    {
        "content": "Sept 6 T-Mobile US Inc said on Wednesday it will offer a free subscription to video streaming service Netflix Inc with its unlimited data family plans in a push to lure more subscribers.",
        "date": "09062017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 3-T-Mobile US to offer free Netflix with family plan "
    },
    {
        "content": "* Announces exclusive partnership with Netflix; T-Mobile ONE family plans will now come with Netflix at no extra charge",
        "date": "09062017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-T-Mobile offers free Netflix to some family plan customers "
    },
    {
        "content": "Sept 6 T-Mobile US Inc  the No. 3 U.S. wireless carrier  said on Wednesday it would offer Netflix Inc's video subscription service to some of its family plan customers for free.",
        "date": "09062017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "T-Mobile offers free Netflix to some family plan customers "
    },
    {
        "content": "LOS ANGELES Damien Chazelle  the Oscar-winning director of hit movie \"La La Land \" has another musical in the works  this time a multilingual television series set in Paris.",
        "date": "09012017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "'La La Land''s Chazelle partners with Netflix for Paris TV musical "
    },
    {
        "content": "NEW YORK  Aug 31 Time Inc  publisher of magazines including People and Sports Illustrated  is turning to the internet to distribute its growing cache of video material and television shows  part of a plan to counter fast-declining print advertising revenue.",
        "date": "08312017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Time Inc shifts toward video as eyeballs move online "
    },
    {
        "content": "NEW YORK  Aug 31 Time Inc  publisher of magazines including People and Sports Illustrated  is turning to the internet to distribute its growing cache of video material and television shows  part of a plan to counter fast-declining print advertising revenue.",
        "date": "08312017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Time Inc shifts toward video as eyeballs move online "
    },
    {
        "content": "NEW YORK Closely-watched U.S. hedge fund managers were generally bearish on the FAANG group of high-flying tech stocks in the second quarter  with eight such investors in aggregate cutting or liquidating 18 stakes in the companies  regulatory filings showed.",
        "date": "08142017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "U.S. hedge funds bearish on FAANG stocks in second-quarter: SEC filings "
    },
    {
        "content": "Aug 14 \"Grey's Anatomy\" creator Shonda Rhimes is taking her Shondaland production house away from Walt Disney Co's ABC network to Netflix Inc to produce new content  the video streaming company said on Sunday.",
        "date": "08142017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "'Grey's Anatomy' creator Shonda Rhimes leaves ABC for Netflix "
    },
    {
        "content": "* Tiger Global Management LLC cuts share stake in Facebook by 24.7 percent to 531 000 class A shares",
        "date": "08142017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Tiger Global Management cuts stake in Netflix  Facebook "
    },
    {
        "content": "* Omega Advisors Inc ups share stake in Zynga Inc by 30.1 percent to 9.2 million class a shares - SEC filing",
        "date": "08142017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Omega Advisors cuts share stake in Facebook  Netflix "
    },
    {
        "content": "LOS ANGELES Netflix Inc is in \"active discussions\" with Walt Disney Co about keeping Marvel and \"Star Wars\" films after 2019  when new Disney and Pixar movies will stop appearing on the streaming service  a senior executive said late on Thursday.",
        "date": "08112017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix discussing keeping Disney's Marvel  'Star Wars' films "
    },
    {
        "content": "LOS ANGELES  Aug 11 Netflix Inc is in \"active discussions\" with Walt Disney Co about keeping Marvel and \"Star Wars\" films after 2019  when new Disney and Pixar movies will stop appearing on the streaming service  a senior executive said late on Thursday.",
        "date": "08112017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix discussing keeping Disney's Marvel  'Star Wars' films "
    },
    {
        "content": "LOS ANGELES  Aug 11 Netflix Inc is in \"active discussions\" with Walt Disney Co about keeping Marvel and \"Star Wars\" films after 2019 when new Disney and Pixar movies will stop appearing on the streaming service  a senior Netflix executive said on Thursday.",
        "date": "08112017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix says in discussions with Disney over Marvel  'Star Wars' films "
    },
    {
        "content": "Aug 6 A growing number of U.S. cable operators are forming alliances with Netflix Inc  a shift that is helping the streaming pioneer add customers as its largest single market matures.",
        "date": "08062017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "U.S. cable firms embrace former foe Netflix as TV viewing shifts "
    },
    {
        "content": "Netflix Inc on Monday said it has bought comics publisher Millarworld  bringing on board renowned comic book writer Mark Millar and a host of character franchises it can mine for TV shows and movies.",
        "date": "08072017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix buys comics publisher Millarworld to feed films and TV "
    },
    {
        "content": "Aug 7 Netflix Inc on Monday said it has bought comics publisher Millarworld  bringing on board renowned comic book writer Mark Millar and a host of character franchises it can mine for TV shows and movies.",
        "date": "08072017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-UPDATE 1-Netflix buys comics publisher Millarworld to feed films and TV "
    },
    {
        "content": "MUMBAI Indian movie production house Eros is in early talks with Apple  Amazon and Netflix to sell its film and music library  a source familiar with the matter said.",
        "date": "08072017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Bollywood lures Apple  Amazon and Netflix in Eros library sale "
    },
    {
        "content": "* Mumbai-listed shares in Eros jump 4.5 pct on news (Adds Breakingviews link)",
        "date": "08072017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 3-Bollywood lures Apple  Amazon and Netflix in Eros library sale "
    },
    {
        "content": "Aug 7 U.S. video streaming company Netflix Inc said on Monday it bought comic book publisher Millarworld  home to titles such as \"Kick-Ass\" and \"Kingsman \" in its first ever acquisition.",
        "date": "08072017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix buys comic book publisher run by 'modern-day Stan Lee' "
    },
    {
        "content": "Walt Disney Co  will stop providing new movies to Netflix Inc  starting in 2019 and launch its own streaming service as the world's biggest entertainment company tries to capture digital viewers who are dumping traditional television. | Video ",
        "date": "08082017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Disney to pull movies from Netflix  plans own streaming service "
    },
    {
        "content": "* Netflix  - ‍announced it acquired Millarworld  comic book publishing company founded by mark millar​",
        "date": "08072017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix acquires comic book publishing co Millarworld "
    },
    {
        "content": "A growing number of U.S. cable operators are forming alliances with Netflix Inc NFLX.O  a shift that is helping the streaming pioneer add customers as its largest single market matures. | Video ",
        "date": "08072017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "U.S. cable firms embrace former foe Netflix as TV viewing shifts "
    },
    {
        "content": "LOS ANGELES  Aug 9 Oscar-winning filmmakers Joel and Ethan Coen are transitioning to the small screen with a new Western anthology for Netflix Inc  the online streaming company said on Wednesday  the latest talent to join the platform's growing roster.",
        "date": "08092017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Oscar-winning Coen brothers to bring Western anthology series to Netflix "
    },
    {
        "content": "Aug 8 Walt Disney Co will stop providing new movies to Netflix Inc starting in 2019 and launch its own streaming service as the world's biggest entertainment company tries to capture digital viewers who are dumping traditional television.",
        "date": "08082017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 4-Disney to pull movies from Netflix  plans own streaming service "
    },
    {
        "content": "* Walt Disney Co says new direct ESPN service will be available to consumers in early 2018 - conf call",
        "date": "08082017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Walt Disney CEO calls end of distribution agreement with Netflix \"major strategic shift\" "
    },
    {
        "content": "Aug 6 A growing number of U.S. cable operators are forming alliances with Netflix Inc  a shift that is helping the streaming pioneer add customers as its largest single market matures.",
        "date": "08072017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "RPT-U.S. cable firms embrace former foe Netflix as TV viewing shifts "
    },
    {
        "content": "Aug 9 Walt Disney Co's plan to launch its own digital movie and sports services means the world's largest entertainment company must learn how to attract streaming video subscribers and keep them hooked in a highly competitive market.",
        "date": "08092017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 2-Disney shares drop as investors weigh risks of new streaming plans "
    },
    {
        "content": "* The Walt Disney Company to acquire majority ownership of BAMTech",
        "date": "08082017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-The Walt Disney Company to acquire majority ownership of BAMTech "
    },
    {
        "content": "* David Letterman is returning to television for a new six-episode series for Netflix Source text: (http://nflx.it/2uCHrW2) Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "08082017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-David Letterman to star in new six-episode series for Netflix "
    },
    {
        "content": "* Indexes down: Dow 0.24 pct  S&P 0.11 pct  Nasdaq 0.26 pct (Updates to early afternoon)",
        "date": "08092017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St lower as investors weigh rising N. Korea tensions "
    },
    {
        "content": "* 10 new carbon minerals found (https://mineralchallenge.net/)",
        "date": "08012017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Scientists turn to big data in hunt for minerals  oil and gas "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_08082017.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     10:00 am: Eicher Motors annual general meeting in New Delhi.      11:00 am: Monsoon session of parliament continues in New Delhi.     12:30 pm: Power Minister Piyush Goel at FICCI event in New Delhi.",
        "date": "08082017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Morning News Call - India  August 8 "
    },
    {
        "content": "* Announcement of Stretch Armstrong and Flex Fighters  a new original series from Hasbro studios premiering on Netflix Source text for Eikon: Further company coverage:",
        "date": "07312017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Hasbro and Netflix announce new original series "
    },
    {
        "content": "* Indexes down: Dow 0.24 pct  S&P 0.21 pct  Nasdaq 0.48 pct (Adds details  changes comment  updates prices)",
        "date": "08092017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St slips as rising N.Korea tensions rattle investors "
    },
    {
        "content": "* Indexes down: Dow 0.22 pct  S&P 0.32 pct  Nasdaq 0.69 pct (Updates to open)",
        "date": "08092017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St opens lower as tensions with N.Korea escalate "
    },
    {
        "content": "* Netflix Inc - ‍on july 27  co entered into a revolving credit agreement - sec filing​",
        "date": "07282017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix says entered into revolving credit agreement​ "
    },
    {
        "content": "* Futures down: Dow 35 pts  S&P 9.25 pts  Nasdaq 39.75 pts (Adds details  comment  updates prices)",
        "date": "08092017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St set to open lower as tensions with N.Korea mount "
    },
    {
        "content": "Aug 9 U.S. stock index futures were lower on Wednesday as investors moved away from risky assets following escalating tensions between North Korea and the United States.",
        "date": "08092017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Futures lower amid mounting tensions between U.S.  N. Korea "
    },
    {
        "content": "Five of the largest U.S. pay-TV providers posted subscriber losses during the second quarter as younger viewers increasingly cut the cord and moved to \"skinny bundles \" or cheaper packages with select channels  and Internet streaming services like Netflix or Hulu.",
        "date": "07282017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Factbox: More subscribers abandon pay-TV in the second quarter "
    },
    {
        "content": "Aug 9 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08092017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "PRESS DIGEST - Wall Street Journal - August 9 "
    },
    {
        "content": "NEW YORK  July 18 Major stock indexes were mixed on Tuesday  as Netflix's rally boosted the Nasdaq Composite to a record high while Goldman Sachs weighed on the Dow  with earnings taking investors' focus.",
        "date": "07182017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "US STOCKS SNAPSHOT-Netflix catapults Nasdaq to record; Goldman drags Dow "
    },
    {
        "content": "* Dow down 0.25 pct  S&P 500 up 0.06 pct  Nasdaq up 0.47 pct (Updates to close)",
        "date": "07182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Nasdaq hits record on Netflix boost; Dow dragged by Goldman "
    },
    {
        "content": "* BofA  Goldman Sachs drag banks lower after quarterly results",
        "date": "07182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Goldman Sachs drags Dow lower; Netflix rally buoys Nasdaq "
    },
    {
        "content": "* Dow down 0.39 pct  S&P off 0.09 pct  Nasdaq up 0.16 pct (Updates to early afternoon)",
        "date": "07182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Goldman weighs on Dow; Netflix helps cap S&P  Nasdaq losses "
    },
    {
        "content": "* Dow down 0.46 pct  S&P off 0.14 pct  Nasdaq up 0.07 pct (Adds details  changes comment  updates prices)",
        "date": "07182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Banks drag S&P  Dow lower; Netflix caps Nasdaq losses "
    },
    {
        "content": "Twenty years after Reed Hastings co-founded Netflix Inc   and a decade after the company introduced video streaming  it hit another milestone - one that is key to its ability to sustain its scorching pace of growth.",
        "date": "07182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix wins international Crown with original shows "
    },
    {
        "content": "July 18 Twenty years after Reed Hastings co-founded Netflix Inc  and a decade after the company introduced video streaming  it hit another milestone - one that is key to its ability to sustain its scorching pace of growth.",
        "date": "07182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix wins international Crown with original shows "
    },
    {
        "content": "Netflix Inc crushed Wall Street forecasts by adding 5.2 million new streaming customers in the second quarter and predicted continued momentum as foreign subscriptions topped those in the United States  lifting its stock 10.4 percent on Monday.",
        "date": "07172017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix beats subscriber targets  shares jump over 10 percent "
    },
    {
        "content": "July 17 Netflix Inc crushed Wall Street forecasts by adding 5.2 million new streaming customers in the second quarter and predicted continued momentum as foreign subscriptions topped those in the United States  lifting its stock 10.4 percent on Monday.",
        "date": "07172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 3-Netflix beats subscriber targets  shares jump over 10 pct "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Netflix has proved again that it has a way of triggering a Pavlovian response from its shareholders. The video-streaming service on Monday unveiled second-quarter results that show it added more subscribers than expected. It also grew operating income faster than revenue. That sent shares soaring  even though expected profitability falls a long way short of being able to justify the stock’s fairy-tale multiple.",
        "date": "07172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix triggers shareholders’ Pavlovian response "
    },
    {
        "content": "* Dow down 0.04 pct  S&P 500 down 0.01 pct  Nasdaq up 0.03 pct",
        "date": "07172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St ends flat; Netflix jumps after the bell "
    },
    {
        "content": "* 1.07 million U.S. streaming net additions in Q2 versus co's forecast of 0.6 million",
        "date": "07172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix reports Q2 total earnings of $0.15 per share "
    },
    {
        "content": "July 17 Netflix Inc added more U.S. and international subscribers than expected in the second quarter as new original shows such as \"13 Reasons Why\" as well as the latest season of hit political drama \"House of Cards\" helped attract more viewers.",
        "date": "07172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix's subscriber growth beats on strong original shows "
    },
    {
        "content": "LONDON  July 13 Rupert Murdoch is unlikely to offer any new concessions to protect the editorial independence of Sky  increasing the chance that the $15 billion takeover deal goes to a lengthy investigation  a person familiar with the situation said.",
        "date": "07132017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Murdoch's Fox unlikely to offer remedies in Sky deal - source "
    },
    {
        "content": "* Hudson Pacific Properties - signed agreement with Netflix to occupy more soundstages  office and support space at Sunset Bronson Studios in Hollywood Source text for Eikon: Further company coverage:",
        "date": "07122017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Hudson Pacific Properties says signed agreement with Netflix for soundstages  office and support space "
    },
    {
        "content": "LONDON  June 29 Britain intends to subject Rupert Murdoch's takeover of European pay-TV group Sky to a lengthy in-depth investigation after finding the $15 billion deal risks giving the media mogul too much power over the news agenda.",
        "date": "06292017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 4-Britain says Fox bid for Sky risks giving Murdoch too much power "
    },
    {
        "content": "* Dolby Laboratories and Netflix partner to deliver first global combined Dolby Atmos and Dolby Vision streaming experience to consumers around world",
        "date": "06282017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Dolby Laboratories and Netflix partner to deliver the first global combined Dolby Atmos and Dolby Vision streaming experience to consumers around the world "
    },
    {
        "content": "LOS ANGELES  June 16 Apple Inc has hired two long-time Sony Pictures Television executives to expand the iPhone maker's push into original television programming  plunging deeper into a field crowded by Hollywood studios and online streaming services.",
        "date": "06162017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 4-Apple poaches top Sony TV executives to boost video content "
    },
    {
        "content": "SYDNEY  June 2 Bosses of Australia's media companies  including an arm of Rupert Murdoch's News Corp   have formed an unprecedented front to lobby for changes they say will allow more consolidation and help them compete with internet giants.",
        "date": "06022017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Australia's old media moguls unite to fight online giants "
    },
    {
        "content": "* French group faces challenge over Mediaset stake (Updates source on with appointment of de Puyfontaine chairman)",
        "date": "06012017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 2-Telecom Italia appoints Vivendi's CEO as chairman "
    },
    {
        "content": "NEW YORK Just over a decade ago  CBS Corp  accelerated its push to own more of the shows it broadcasts  rather than licensing them from studios.",
        "date": "06012017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "CBS move to own shows like 'MacGyver' pays off in overseas sales "
    },
    {
        "content": "* Netflix CEO Reed Hastings at Code Conference - probably assessed China entry wrong",
        "date": "05312017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix CEO Hastings says committed to an ad-free experience - Code Conference "
    },
    {
        "content": "* Netflix CEO Reed Hastings says launch in China is off for a couple of years-CNBC",
        "date": "05312017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix CEO Reed Hastings says launch in China is off for a couple of years-CNBC "
    },
    {
        "content": "JERUSALEM  May 29 Partner Communications   Israel's second-largest mobile phone operator  said on Monday that streaming giant Netflix will be available on Partner's new television service.",
        "date": "05292017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Partner Communications to offer Netflix on new Israeli TV service "
    },
    {
        "content": "* Partner Communications announces Netflix and partner communications collaborate in Israel",
        "date": "05292017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Partner Communications says Netflix  Partner collaborate in Israel "
    },
    {
        "content": "* Calstrs says urges Netflix shareholders to vote for proposal to adopt a majority vote standard for director elections - SEC filing‍​ Source text for Eikon: Further company coverage:",
        "date": "05272017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Calstrs urges Netflix shareholders to vote for proposal to adopt a majority vote standard for director elections "
    },
    {
        "content": "* Soros Fund Management takes share stake in Apple Inc of 1 400 shares - SEC filing",
        "date": "05152017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Soros Fund Management takes share stake in Apple  cuts share stake in Netflix "
    },
    {
        "content": "* Tiger Global Management takes share stake in Netflix Inc of 429 000 shares",
        "date": "05152017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Tiger Global Management takes share stake in Netflix  cuts in Fleetcor "
    },
    {
        "content": "KOBARID  Slovenia Nestled in a valley just a few miles from the Italian border  Ana Ros' restaurant lures food-lovers from around the world with her quirky dishes: eel with pomegranate  foie gras and field chicory and tripe with fava beans and fried nettles.",
        "date": "05152017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Recipe for success: discipline and diplomacy  says top Slovenian chef "
    },
    {
        "content": "* Omega Advisors Inc takes share stake in Alcoa Corp of 200 000 shares - SEC filing",
        "date": "05152017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Omega Advisors Inc takes share stake in Alcoa  Netflix "
    },
    {
        "content": "May 11 Netflix Inc said it would create 400 jobs in its new European customer service hub in Amsterdam  as the U.S. video streaming pioneer expands around the world.",
        "date": "05112017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix adds 400 jobs in Europe "
    },
    {
        "content": "* Netflix announces 400 new jobs in Europe and two new European original series",
        "date": "05112017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix announces 400 new jobs in Europe "
    },
    {
        "content": "JOHANNESBURG South Africa's Discover Digital  hoping to capitalize on the rapid uptake of smartphones and improving telecommunications infrastructure on the continent  is starting a video streaming service to rival Netflix and Showmax  it said on Thursday.",
        "date": "05042017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "South African video streaming firm to compete with Showmax  Netflix "
    },
    {
        "content": "May 5 Citigroup listed seven companies as potential takeover targets for Apple Inc  including Netflix  Walt Disney and Tesla Inc  as a way to put its cash hoard of more than $250 billion to work.",
        "date": "05052017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Citi lists Netflix  Tesla as potential takeover targets for Apple "
    },
    {
        "content": "SAN FRANCISCO  May 2 Traders short selling Tesla's soaring stock have lost $3.7 billion this year  eclipsing the combined losses of traders   shorting Apple   Amazon.com and Netflix.",
        "date": "05022017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Tesla is most painful stock for short sellers in 2017 "
    },
    {
        "content": "* Iqiyi signs licensing agreement with Netflix for popular shows",
        "date": "04282017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Iqiyi signs licensing agreement with Netflix for popular shows "
    },
    {
        "content": "* Pricing of an offering of EUR 1.3 billion aggregate principal amount of 3.625% senior notes due 2027",
        "date": "04262017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix prices EUR 1.3 bln offering of senior notes "
    },
    {
        "content": "BEIJING  April 25 Netflix is to introduce original content in China in a licensing deal with local video streaming service iQiyi.com  the U.S. company said on Tuesday.",
        "date": "04252017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix clinches licensing deal with China's iQiyi.com "
    },
    {
        "content": "* Netflix announces proposed 1 billion euro offering of senior notes",
        "date": "04242017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix announces proposed 1 bln euro offering of senior notes "
    },
    {
        "content": "* Member states could ask them to help finance EU films (Adds tech lobby group comment)",
        "date": "04252017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-EU lawmakers vote to make YouTube fight online hate speech "
    },
    {
        "content": "BRUSSELS  April 25 Video-sharing platforms such as Google's YouTube and Vimeo will have to take measures to protect citizens from content containing hate speech and incitement to violence under measures voted by EU lawmakers on Tuesday.",
        "date": "04252017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "EU lawmakers vote to make YouTube fight online hate speech "
    },
    {
        "content": "April 21 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04212017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "PRESS DIGEST- British Business - April 21 "
    },
    {
        "content": "* Tech’s growing sway on Wall Street: http://tmsnrt.rs/2oYIpgQ",
        "date": "04162017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "RPT-Wall St Week Ahead-Netflix scorecard to test mettle of tech rally "
    },
    {
        "content": "SAN FRANCISCO  April 18 Shares of Netflix fell from record-high territory on Tuesday and were headed for their worst session in five months after a mixed quarterly report failed to impress Wall Street.",
        "date": "04182017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix shares on track for worst day in five months "
    },
    {
        "content": "Netflix Inc made a bullish forecast for subscriber additions by mid-year  a positive sign for its push to expand around the world that sent its shares toward an all-time high. | Video ",
        "date": "04182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix shares head for new high after strong subscriber outlook "
    },
    {
        "content": "* Q1 U.S. streaming net additions 1.42 million versus co's forecast of 1.5 million",
        "date": "04172017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix reports quarterly earnings of $0.40 per share "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Netflix's content crown is starting to fit a bit more comfortably. In its first quarter  the video-streaming service led by Reed Hastings missed subscriber estimates yet still managed to grab nearly 100 million customers worldwide. The plan to spend billions on films and TV series like “Stranger Things” is helping to lift its base. But it’s still far from able to justify a stock trading at 130 times this year’s estimated earnings.",
        "date": "04182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix content crown begins to fit comfortably "
    },
    {
        "content": "April 17 Popular video streaming service Netflix Inc added fewer subscribers than analysts' had estimated  both internationally and in the United States  in the first quarter  as a drop in the number of breakout hits attracted fewer users.",
        "date": "04172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix's Q1 subscriber additions misses estimates "
    },
    {
        "content": "China's home prices accelerate in March on-month  highlighting policy challenges",
        "date": "04182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Reuters Business News Schedule at 0430 GMT/00.30AM ET "
    },
    {
        "content": "April 17 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "04172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "April 17 Netflix Inc made a bullish forecast for subscriber additions by mid-year  a positive sign for its push to expand around the world that sent its shares toward an all-time high.",
        "date": "04182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 3-Netflix shares head for new high after strong subscriber outlook "
    },
    {
        "content": "JAKARTA  April 17 U.S. video streaming service provider Netflix is in talks with Indonesia's top telecom firm PT Telekomunikasi Indonesia Tbk (Telkom) to roll out its service in the country  a spokesman at the Indonesian company said.",
        "date": "04172017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Indonesia's Telkom says in talks to team up with Netflix "
    },
    {
        "content": "* Comcast said to plan online rival to Netflix using hit NBC shows- Bloomberg  citing sources Source text : https://bloom.bg/2oZOtT5 Further company coverage:",
        "date": "04102017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Comcast planning online rival to Netflix using hit NBC shows- Bloomberg "
    },
    {
        "content": "* Greg Peters to become Netflix chief product officer in July",
        "date": "04072017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix Chief Talent Officer to leave company "
    },
    {
        "content": "* Tech’s growing sway on Wall Street: http://tmsnrt.rs/2oYIpgQ",
        "date": "04132017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "REFILE-Wall St Week Ahead-Netflix scorecard to test mettle of tech rally "
    },
    {
        "content": "* Says retiring five-star rating system and replacing it with a simpler and more intuitive thumbs-up and thumbs-down Source text : http://nflx.it/2o9HWas Further company coverage:",
        "date": "04052017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix retiring 5-star rating system  replacing it with thumbs-up/down "
    },
    {
        "content": "* Part of Jack Ma's initiative to remove trade barriers for small firms",
        "date": "03222017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Alibaba to set up regional logistics hub in Malaysia "
    },
    {
        "content": "* Says it signs 1.72 billion won contract with Netflix to provide Korean drama named My Only Love Song",
        "date": "03142017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-FNC Add Culture signs 1.72 bln won contract with Netflix "
    },
    {
        "content": "NEW YORK  March 13 Malaysian streaming video provider iflix has tapped Sean Carey  a former Netflix executive  as its new chief content officer  the company said in statement on Monday.",
        "date": "03132017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Malaysian streaming provider taps Netflix executive "
    },
    {
        "content": "* Videocon d2h signs partnership with Netflix for its HD smart connect  Source text - (Videocon d2h  the fastest growing DTH service provider in India has now signed a standalone deal with the world's leading internet television network Netflix. With this partnership  Videocon d2h connected box customers will now be able to access seamlessly the extensive library of Netflix TV and movie titles)",
        "date": "03062017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Videocon d2h signs partnership with Netflix "
    },
    {
        "content": "SINGAPORE  March 6 (IFR) - India's Bollywood film industry is set to premiere in the US dollar bond market as one of the country's biggest distributors prepares its debut high-yield offering.",
        "date": "03062017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Bollywood film maker Eros pitches high-yield bonds "
    },
    {
        "content": "WELLINGTON  Feb 27 New Zealand telecommunications company Spark said on Monday it was partnering with U.S. video streaming giant Netflix in an arrangement that was the first of its kind.",
        "date": "02262017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "New Zealand's Spark partners with Netflix "
    },
    {
        "content": "WELLINGTON  Feb 27 New Zealand telecommunications company Spark said on Monday it was partnering with U.S. video streaming giant Netflix in an arrangement that was the first of its kind.",
        "date": "02262017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-New Zealand's Spark partners with Netflix "
    },
    {
        "content": "* Partnership gives Spark broadband customers a subscription to Netflix's standard plan for one year   Source text for Eikon:  Further company coverage:",
        "date": "02262017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Spark New Zealand partners with Netflix "
    },
    {
        "content": "NEW YORK Top U.S. hedge funds trimmed bets on a group of closely-watched technology stocks in the fourth quarter in an apparent effort to cut their losses following Donald Trump's U.S. presidential election victory  regulatory filings showed.",
        "date": "02152017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Hedge funds trim bets on FANG stocks in fourth quarter: filings "
    },
    {
        "content": "Feb 10 CBS Corp has taken an ownership stake in Kapital Entertainment  the independent production company behind such series as HBO's \"Divorce \" CBS' \"Life in Pieces\" and Netflix Corp's \"Santa Clarita Diet.\"",
        "date": "02102017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-CBS invests in Kapital Entertainment in bid to own more content "
    },
    {
        "content": "LOS ANGELES (Variety.com) - Netflix has ordered eight new episodes of seminal '00s hit \"Queer Eye for the Straight Guy.\" The new season will begin production in the spring  bringing on a new Fab Five to replace original stars Carson Kressley  Ted Allen  Kyan Douglas  Thom Filicia  and Jai Rodriguez.",
        "date": "01242017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix Revives 'Queer Eye for the Straight Guy' "
    },
    {
        "content": "LOS ANGELES  Jan 20 Traditional TV networks are following Netflix Inc's lead by releasing all new episodes of a series at the same time  a step to win over binge viewers who do not want to wait a week for the next installment.",
        "date": "01202017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "More TV networks follow Netflix to binge-watching model "
    },
    {
        "content": "LOS ANGELES  Jan 20 Traditional TV networks are following Netflix Inc's lead by releasing all new episodes of a series at the same time  a step to win over binge viewers who do not want to wait a week for the next installment.",
        "date": "01202017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "RPT-More TV networks follow Netflix to binge-watching model "
    },
    {
        "content": "Netflix Corp's surprisingly strong subscriber growth in the fourth quarter allayed concerns about the company's multi-billion dollar investment in original content.",
        "date": "01192017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix Original: New shows drive blockbuster quarter "
    },
    {
        "content": "Jan 18 Streaming video pioneer Netflix Inc  added over a third more subscribers than expected in the last quarter of 2016  a sign of success for its ambitious global expansion that sent its shares up 8 percent in extended trading.",
        "date": "01182017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "UPDATE 3-Netflix adds a third more subscribers than expected; shares jump 8 pct "
    },
    {
        "content": "Streaming video pioneer Netflix Inc added over a third more subscribers than expected in the last quarter of 2016  a sign of success for its ambitious global expansion that sent its shares up 8 percent in extended trading.",
        "date": "01192017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix adds a third more subscribers than expected; shares jump eight percent "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Financially speaking  Netflix has come to embody the title of one of its new hit shows: \"Stranger Things.\" The video-streaming service blew past quarterly subscriber expectations  as it celebrated a decade of being online. After burning through still more cash  its share price soared to a new high. Apparently growth can come at almost any cost.",
        "date": "01182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix finances keep producing stranger things "
    },
    {
        "content": "* Quarterly revenues $2.48 billion versus $1.82 billion last year",
        "date": "01182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix reports Q4 total EPS including DVD of $0.15 "
    },
    {
        "content": "Jan 18 Netflix Inc's international and U.S. subscriber additions sped past analysts' estimates as the video streaming service released shows including the award-winning British drama \"The Crown\" and a revival of \"Gilmore Girls\".",
        "date": "01182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix adds more subscribers than expected "
    },
    {
        "content": "Please click on the link below for Netflix Inc's fourth-quarter earnings press release:  Source text:",
        "date": "01182017",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix Q4 results press release "
    },
    {
        "content": "* Hudson Pacific Properties - Netflix signed lease to fully occupy all 91 953 square feet of space at its new  five-story office building in Hollywood  Source text for Eikon:  Further company coverage:",
        "date": "01062017",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Hudson Pacific Properties says Netflix signed lease to occupy 91 953 square feet of space in Hollywood "
    },
    {
        "content": "One of Netflix Inc's  Twitter accounts was hacked on Wednesday by an entity calling itself \"OurMine\".",
        "date": "12212016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Hacker group takes over Netflix Twitter account "
    },
    {
        "content": "Amazon.com Inc  launched its video-streaming service  Prime Video  in nearly every country except China on Wednesday  in its biggest challenge yet to Netflix Inc .",
        "date": "12142016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Amazon launches Prime Video globally  leaves out China "
    },
    {
        "content": "Video streaming pioneer Netflix Inc has added an option that allows subscribers to download shows at no additional cost on their mobile device to watch without an internet connection.",
        "date": "11302016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix allows subscribers to binge-watch shows offline "
    },
    {
        "content": "* TiVo Corp says product and intellectual property agreements with Netflix do not change fiscal year 2016 estimates given by TiVo on November 3  2016  Source text for Eikon:  Further company coverage:",
        "date": "11282016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-TiVo Corp says product and intellectual property agreements with Netflix do not change fiscal year 2016 estimates given by TiVo on November 3  2016 "
    },
    {
        "content": "* TiVo and Netflix enter into product and intellectual property agreements",
        "date": "11282016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-TiVo and Netflix enter into product and intellectual property agreements "
    },
    {
        "content": "* Cuts share stake in Charter Communications by 56.1 percent to 12 135 class A shares",
        "date": "11142016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Soros Fund Management takes stake in Netflix  Harley "
    },
    {
        "content": "* Omega Advisors dissolves share stake in Netflix - SEC filing",
        "date": "11142016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Omega Advisors dissolves share stake in Netflix  cuts in Facebook - SEC filing "
    },
    {
        "content": "* Comcast to launch Netflix on X1 to millions of customers nationwide",
        "date": "11042016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Comcast to launch Netflix on X1 to millions of customers nationwide "
    },
    {
        "content": "* Pricing of an offering of $1 billion aggregate principal amount of 4.375 percent senior notes due 2026",
        "date": "10242016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix prices $1 bln offering of senior notes "
    },
    {
        "content": "A media company that doesn't own both programming and the means to distribute it is like a combo meal without the fries.  Or so the theory goes.",
        "date": "10242016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Data Dive: Vertically Challenged? Spend $85 billion "
    },
    {
        "content": "* Netflix announces proposed $800 million offering of senior notes  Source text for Eikon:  Further company coverage:",
        "date": "10242016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix announces proposed $800 mln offering of senior notes "
    },
    {
        "content": "* We expect Q4'16 free cash flow to be similar to Q3'16 free cash flow",
        "date": "10172016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix reports Q3 total EPS including DVD of $0.12 "
    },
    {
        "content": "Oct 17 Netflix Inc added many more subscribers in the third quarter than analysts expected as new original shows such as \"Stranger Things\" kept users hooked to the service.",
        "date": "10172016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix adds more subscribers than expected "
    },
    {
        "content": "* Indexes down: Dow 0.18 pct  S&P 0.14 pct  Nasdaq 0.05 pct   (Updates to early afternoon)",
        "date": "10172016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St dips as energy  consumer stocks weigh "
    },
    {
        "content": "Netflix Inc's shares jumped as much as 20 percent on Tuesday  after the company added 50 percent more subscribers than expected in the third quarter.",
        "date": "10182016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix's big bet on original shows finally seen paying off "
    },
    {
        "content": "* Indexes up: Dow 0.42 pct  S&P 0.62 pct  Nasdaq 0.85 pct   (Updates to market close)",
        "date": "10182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St climbs on earnings improvement "
    },
    {
        "content": "NEW YORK  Oct 18 A gauge of global equity markets climbed to a one-week high on Tuesday  lifted by rising commodity prices and a strong bounce in Europe  while solid corporate earnings helped drive share prices higher.",
        "date": "10182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "GLOBAL MARKETS-Stocks rise on corporate results  rising commodities "
    },
    {
        "content": "The folks that brought you \"House Of Cards\" and \"Jessica Jones\" added 3.2 million international subscribers  trouncing its internal estimate of 2 million by 60 percent. Netflix attributed its international success to its new original shows such as \"Stranger Things\" and \"Narcos.\"",
        "date": "10182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Data Dive: How Netflix got its groove back "
    },
    {
        "content": "* Indexes up: Dow 0.58 pct  S&P 0.69 pct  Nasdaq 0.93 pct   (Updates to open)",
        "date": "10182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St rallies on strong corporate earnings reports "
    },
    {
        "content": "Oct 18 U.S. stocks opened higher amid broad gains on Tuesday as Goldman Sachs' profit jump boosted financial companies and the Dow  while Netflix's surge buoyed consumer discretionary stocks.",
        "date": "10182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS SNAPSHOT-Wall St open higher on Goldman  Netflix results "
    },
    {
        "content": "* Futures up: Dow 98 pts  S&P 14.5 pts  Nasdaq 37.25 pts   (Adds details  comments  updates prices)",
        "date": "10182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St set to open higher on Goldman  Netflix results "
    },
    {
        "content": "Oct 18 U.S. stock index futures were modestly higher on Tuesday  buoyed by better-than-expected quarterly reports  including from Netflix and Johnson & Johnson.",
        "date": "10182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Futures up on strong reports from Netflix  J&J "
    },
    {
        "content": " (This version of the October 17 story corrects reference to past quarters in second paragraph) | Video ",
        "date": "10182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix subscriptions boom around world  shares jump 20 percent "
    },
    {
        "content": "NEW YORK  Oct 12 As the number of streaming video services proliferate  about 16 percent of U.S. video viewers have signed up for more than one online streaming service  up from 10 percent three years ago  according to a report from market research firm GfK SE.",
        "date": "10122016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "More viewers subscribing to multiple streaming services -survey "
    },
    {
        "content": "Oct 7 Video streaming service Netflix Inc's  Chief Executive Reed Hastings said the likelihood of the company entering the Chinese market \"doesn't look good\".",
        "date": "10072016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix CEO says China entry \"doesn't look good\" "
    },
    {
        "content": "* Netflix Inc CFO says no immediate plans for advertising supportive products - Goldman Sachs Conf  Further company coverage:",
        "date": "09202016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix CFO says no immediate plans for advertising supportive products - Goldman Sachs Conf "
    },
    {
        "content": "WARSAW  Sept 20 Netflix Inc has made no progress in its plan to enter the potentially lucrative Chinese market as it needs to obtain a government licence  its Chief Executive Officer Reed Hastings said on Tuesday.",
        "date": "09202016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix CEO says no progress in entering China "
    },
    {
        "content": "By Robert Iafolla Twenty-First Century Fox Inc has accused Netflix Inc of engaging in a \"brazen campaign\" to target  recruit and poach its top executives.",
        "date": "09192016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Fox sues Netflix for 'brazen' poaching campaign targeting executives "
    },
    {
        "content": "AMSTERDAM  Sept 14 Liberty Global  the international telecommunications company controlled by American tycoon John Malone  said on Wednesday it has struck a deal to offer Netflix to all its customers directly via cable set top boxes.",
        "date": "09142016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Liberty Global to offer Netflix to all customers "
    },
    {
        "content": "AMSTERDAM  Sept 14 Liberty Global  the international telecommunications company controlled by American tycoon John Malone  said on Wednesday it has struck a deal to offer Netflix to all its customers directly via cable set-top boxes.",
        "date": "09142016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Liberty Global to offer Netflix to all customers "
    },
    {
        "content": "* Revealed multi-year partnership with Netflix Inc; Netflix content to be made available to Liberty Global video customers  Source text for Eikon:  Further company coverage:",
        "date": "09142016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Liberty Global revealed multi-year partnership with Netflix "
    },
    {
        "content": "WASHINGTON  Sept 7 The top U.S. communications regulator plans on Thursday to unveil a revised plan to allow about 100 million pay TV subscribers to replace expensive set-top boxes with less-costly apps that provide access to television and video programs  two people briefed on the plan said.",
        "date": "09072016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "U.S. FCC chief to unveil revised plan to eliminate cable boxes "
    },
    {
        "content": "NEW YORK  Aug 31 Hedge fund investor Leon Cooperman  the chief executive and chairman of Omega Advisors  said on Wednesday on CNBC that equity markets are \"fairly but fully valued.\"",
        "date": "08312016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "UPDATE 3-Cooperman on CNBC says U.S. equities 'fairly but fully valued' "
    },
    {
        "content": "* Soros Fund Management Dissolves Share Stake In Sunedison Inc",
        "date": "08152016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Soros Fund Management dissolves stake in Facebook  Netflix "
    },
    {
        "content": "* Change in holdings are as of June 30  2016 and compared with the previous quarter ended as of March 31  2016  Source text for quarter ended June 30  2016: (http://bit.ly/2bimrhL) Source text for quarter ended March 31  2016: (http://bit.ly/2btcMT8)",
        "date": "08152016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Tiger Global Management LLC dissolves share stake in Netflix - SEC filing "
    },
    {
        "content": "* Takes 87 500 Share Stake In Canadian Pacific Railway - SEC filing",
        "date": "08152016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Omega Advisors takes stake in Netflix  cuts in Microsoft "
    },
    {
        "content": "SAN FRANCISCO  Aug 5 Alibaba Group Holding Inc  is not making an investment in Netflix Inc  Alibaba spokesman Bob Christie told Reuters on Friday.",
        "date": "08052016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Alibaba says it is not making an investment in Netflix "
    },
    {
        "content": "* Default setting will enable user to stream about 3 hours of tv shows and movies per gigabyte of data",
        "date": "05052016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix introduces new cellular data controls globally "
    },
    {
        "content": "* Ceo reed hastings total 2015 compensation $16.6 million versus $11.1 million",
        "date": "04272016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix CEO total 2015 compensation $16.6 mln "
    },
    {
        "content": "April 26 Turner Communications is expected to announce Tuesday that it is launching its own streaming video-on-demand service for film buffs this fall  according to a company statement reviewed by Reuters",
        "date": "04262016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Turner to launch streaming video service for film buffs "
    },
    {
        "content": "* On april ceo reed hastings sold 81 816 shares in multiple transactions at price range between $93.16 and $96.97 per share - sec filing  Source text: (http://1.usa.gov/1SVYqHp) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04222016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix says CEO Reed Hastings sold 81 816 shares in multiple transactions "
    },
    {
        "content": "SEOUL/JAKARTA  April 22 Months after its global rollout  Netflix Inc is facing problems in several major Asian markets as it struggles to provide enough strong content to attract consumers amid tough local competition  and also faces many regulatory hurdles  underlining concerns about disappointing subscriber numbers reported this week.",
        "date": "04222016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "In Asia  Netflix trips on regulation  content  and competition "
    },
    {
        "content": "Streaming video service Netflix Inc forecast U.S. and international subscriptions would grow at a slower pace than Wall Street expected this quarter  sending its shares tumbling 8 percent in after-hours trading on Monday.",
        "date": "04202016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix shares plunge as subscriber forecasts miss estimates "
    },
    {
        "content": " (This April 19 story has been refiled to correct the word \"is\" to \"it\" in paragraph 6)",
        "date": "04202016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix's global push seen needing local touch "
    },
    {
        "content": "April 19 Netflix Inc is thinking global but needs to act more local to realize its full potential  analysts said after the company's subscriber forecasts came up short of expectations.",
        "date": "04202016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-UPDATE 2-Netflix's global push seen needing local touch (April 19) "
    },
    {
        "content": "April 18 Streaming video service Netflix Inc  forecast U.S. and international subscriptions would grow at a slower pace than Wall Street expected this quarter  sending its shares tumbling 8 percent in after-hours trading on Monday.",
        "date": "04182016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "UPDATE 3-Netflix shares plunge as subscriber forecasts miss estimates "
    },
    {
        "content": "April 18 Amazon.com Inc said it would offer its video streaming service as a monthly subscription as it looks to drive membership in its Prime bundle.",
        "date": "04182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Amazon offers video streaming service as monthly subscription "
    },
    {
        "content": "* Says Q1 U.S. Streaming net additions 2.23  million versus 2.28 million last year",
        "date": "04182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "CORRECTED-BRIEF-Netflix reports Q1 total earnings per share  including DVD  $0.06 "
    },
    {
        "content": "April 18 Video-streaming service Netflix Inc  forecast U.S. subscribers additions for the current quarter that fell short of analysts expectation  in part due to price increases for its service.",
        "date": "04182016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix forecasts Q2 U.S. subscriber additions below estimates "
    },
    {
        "content": "A federal appeals court has ruled that investors cannot pursue a securities fraud lawsuit accusing Netflix Inc of making misleading statements about the wisdom of its move into online streaming.",
        "date": "04122016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "9th Circuit rejects securities fraud claims against Netflix "
    },
    {
        "content": "* Corus entertainment lands new deal with netflix for nickelodeon content to stream in canada",
        "date": "04132016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Corus Entertainment Inc lands new deal with Netflix for Nickelodeon content to stream in Canada "
    },
    {
        "content": "BOSTON  April 6 Hedge fund Tiger Global Management  known for making big bets on technology companies  slipped modestly in March  leaving it down 21 percent for the first three months of the year  an investor in the fund said.",
        "date": "04062016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Hedge fund Tiger Global down 21 pct; Viking off 8 pct "
    },
    {
        "content": "WASHINGTON Video provider Netflix did not violate any U.S. regulations when it \"throttled\" the picture quality for AT&T and Verizon wireless customers and the FCC has no plans to investigate  FCC chairman Tom Wheeler said on Thursday.",
        "date": "03312016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "U.S. FCC not to investigate Netflix throttling of some mobile consumers "
    },
    {
        "content": "WASHINGTON Video provider Netflix did not violate any U.S. regulations when it \"throttled\" the picture quality for AT&T and Verizon wireless customers and the FCC has no plans to investigate  FCC chairman Tom Wheeler said on Thursday.",
        "date": "03312016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "FCC not to investigate Netflix throttling of some mobile consumers "
    },
    {
        "content": "WASHINGTON  March 31 Video provider Netflix  did not violate any U.S. regulations when it \"throttled\" the picture quality for AT&T and Verizon wireless customers and the FCC has no plans to investigate  FCC chairman Tom Wheeler said on Thursday.",
        "date": "03312016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-U.S. FCC not to investigate Netflix throttling of some mobile consumers "
    },
    {
        "content": "NEW YORK Wall Street banks appear to be routinely mispricing corporate bond issues  potentially costing U.S. companies billions of dollars in excess interest payments  according to a new study by London-based research firm Fideres.",
        "date": "03312016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "U.S. companies overpaying for bonds; banks may be to blame: study "
    },
    {
        "content": "NEW YORK  March 31 Wall Street banks appear to be routinely mispricing corporate bond issues  potentially costing U.S. companies billions of dollars in excess interest payments  according to a new study by London-based research firm Fideres.",
        "date": "03312016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "U.S. companies overpaying for bonds; banks may be to blame-study "
    },
    {
        "content": "WASHINGTON  March 31 The head of the U.S. Federal Communications Commission said on Thursday that video provider Netflix did not violate any U.S. regulations when it \"throttled\" the picture quality for AT&T and Verizon wireless customers and it has no plans to investigate.",
        "date": "03312016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "U.S. FCC won't investigate Netflix throttling of some mobile consumers "
    },
    {
        "content": "Netflix Inc said it had been lowering the quality of its video for customers watching its service on wireless networks such as AT&T and Verizon Communications for more than five years  The Wall Street Journal reported on Thursday.",
        "date": "03252016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix admits to downgrading video quality on AT&T  Verizon phones: WSJ "
    },
    {
        "content": "March 24 Netflix Inc said it had been lowering the quality of its video for customers watching its service on wireless networks such as AT&T and Verizon Communications for more than five years  The Wall Street Journal reported on Thursday.",
        "date": "03242016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix admits to downgrading video quality on AT&T  Verizon phones - WSJ "
    },
    {
        "content": "March 24 Netflix Inc said it had been lowering the quality of its video for customers watching its service on wireless networks such as AT&T and Verizon Communications for more than five years  The Wall Street Journal reported on Thursday.",
        "date": "03252016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix admits to downgrading video quality on AT&T  Verizon phones - WSJ "
    },
    {
        "content": "* Netflix admits for first time that it throttles videos on most mobile networks around the world  including Verizon and AT&T networks -CNBC  citing DJ",
        "date": "03242016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix admits for first time that it throttles videos on most mobile networks around the world  including Verizon and AT&T networks -CNBC  citing DJ "
    },
    {
        "content": "* Netflix on track to make data saver feature available to members sometime in May - blog",
        "date": "03252016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix says will soon introduce data saver feature for mobile apps - blog "
    },
    {
        "content": "MILAN  March 21 Vivendi is interested to collaborate with Mediaset on content  but the French media group is not after the Italian broadcaster  former prime minister Silvio Berlusconi  whose family controls Mediaset  told a radio station on Monday.",
        "date": "03212016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Vivendi eyeing Mediaset contents deal not group -Berlusconi to radio "
    },
    {
        "content": "MILAN A jump in the company's share price should brighten the mood of any chief executive but that is unlikely to have been the effect this week on Marco Patuano  the head of Telecom Italia.",
        "date": "03042016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Heat is on Telecom Italia's CEO as Vivendi pushes on strategy "
    },
    {
        "content": "NEW YORK  Feb 19 Verizon Communications Inc   which launched its pay TV plan \"Fios Custom TV\" last year to let viewers choose bundles of channels they want to watch  has redesigned the offering.",
        "date": "02232016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-UPDATE 2-Verizon redesigns its Fios Custom TV offering "
    },
    {
        "content": "NEW YORK  Feb 8 Fund managers who relied on the so-called FANG stocks - Facebook  Amazon.com  Netflix  and Google - to boost their performance numbers in 2015 are cutting ties as the global economy looks weaker than many expected  leaving last year's outperformers in the midst of a deep selloff.",
        "date": "02092016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "CORRECTED-Fund managers ditch 2015 winners and move toward safety "
    },
    {
        "content": "BOSTON  Feb 5 Tiger Global Management still likes Amazon  Netflix and JD.com  which fueled last year's positive returns  even as their stock tumbled in January  leaving the hedge fund with a double digit loss at the start of the year.",
        "date": "02052016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Tiger Global still likes Internet names  gets pointers from Jeter "
    },
    {
        "content": "Relativity Media and Netflix Inc video streaming service are sparring over terms of their contract just weeks before the film studio hopes to win court approval to exit bankruptcy.",
        "date": "01262016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Relativity tangles with Netflix as Chap. 11 plan confirmation nears "
    },
    {
        "content": "Netflix Inc's  aggressive push into international markets won more customers than the video streaming service and its investors expected last quarter  sending its shares surging 7 percent.",
        "date": "01202016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix global push grabs more customers than expected; shares jump "
    },
    {
        "content": "Jan 20 Netflix Inc's shares fell as much as 10 percent on Wednesday after a widespread selloff on Wall Street overshadowed the video streaming company's impressive subscriber additions in the fourth quarter.",
        "date": "01202016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix swept up in market rout despite strong subscriber signups "
    },
    {
        "content": "Jan 19 Netflix Inc's aggressive push into international markets won more customers than the video streaming service and its investors expected last quarter  sending its shares surging 7 percent.",
        "date": "01192016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "UPDATE 2-Netflix global push grabs more customers than expected; shares jump "
    },
    {
        "content": "Jan 19 Video-streaming service Netflix Inc  reported a 22.8 percent rise in revenue and added more subscribers than projected internationally for the fourth quarter  as its plan to expand globally pays off.",
        "date": "01192016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix revenue rises 22.8 pct  adds more international subscribers "
    },
    {
        "content": "By Trevor Hunnicutt and David Randall     NEW YORK  Jan 13 Not every investor is chagrined by the dismal way the year has started in stocks. Some  like self-described value manager Rupal Bhansali  are gleefully loading up on companies that got beaten down when the whole market sold off at the start of the year.     Bhansali  whose Ariel International Equity Fund  had been socking away cash for just such an occasion  says she is buying in the most battered areas  including the one ide",
        "date": "01132016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Value investors go dumpster diving on Wall Street "
    },
    {
        "content": "Jan 14 Video-streaming service provider Netflix Inc said subscribers will  in a few weeks  no longer be able to use proxies to watch content not available in their home country.",
        "date": "01142016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix to block proxy access to content not available locally "
    },
    {
        "content": "Jan 14 Video-streaming service provider Netflix Inc's subscribers will no longer be able to use proxies to watch content not available in their home country.",
        "date": "01142016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix to block proxy access to content not available locally "
    },
    {
        "content": "JOHANNESBURG  Jan 7 Naspers  the largest listed company in Africa  said it was not worried about Netflix's arrival in South Africa  adding it believed the market for video on demand was large enough to accommodate more players.",
        "date": "01072016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Naspers says can cope with Netflix challenge in South Africa "
    },
    {
        "content": "* Netflix likely to announce expansion plans at CES -industry execs  analysts",
        "date": "01052016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix set to tap Bollywood-mad India in pursuit of global viewers "
    },
    {
        "content": "Netflix Inc's video-streaming service went live in more than 130 countries on Wednesday  covering almost the entire globe except China  in a huge global push by Chief Executive Reed Hastings to counter slowing growth in the United States.",
        "date": "01062016",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix goes global  reaches most countries except China "
    },
    {
        "content": "Jan 6 Netflix Inc's video-streaming service went live in more than 130 countries on Wednesday  covering almost the entire globe except China  in a huge global push by Chief Executive Reed Hastings to counter slowing growth in the United States.",
        "date": "01062016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 2-Netflix goes global  reaches most countries except China "
    },
    {
        "content": "* Netflix CEO Reed Hastings  in interview  says he hopes to bring service to China in 2016 'but you never know'",
        "date": "01062016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix CEO on China: 'we are very patient' "
    },
    {
        "content": "Jan 6 Video streaming company Netflix Inc  on Wednesday launched its services in 130 countries  covering almost the entire globe except China  as part of efforts to counter slowing growth in the United States.",
        "date": "01062016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix to stream in almost all countries  skips China "
    },
    {
        "content": "Jan 6 Netflix Inc launched operations in India on Wednesday  with plans starting at 500 rupees ($7.50) per month.",
        "date": "01062016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix launches in India  plans start at 500 rupees "
    },
    {
        "content": "Jan 6 Netflix Inc launched operations in India on Wednesday  with plans starting at 500 rupees ($7.50) per month  as the U.S.-based video streaming company pushes ahead with its global expansion plans.",
        "date": "01062016",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix launches in India  plans start at 500 rupees "
    },
    {
        "content": "Dec 21 The record-breaking launch of the latest Star Wars movie puts the shares of U.S. theater operators on course for a stellar performance this quarter and beyond  analysts said  as rave reviews pull in die-hard fans and theater-shy audiences alike.",
        "date": "12212015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Star Wars movie could awaken shares of theater operators "
    },
    {
        "content": "STOCKHOLM Net Insight's new invention that enables synchronized live broadcasts on TV  tablets and smartphones could double its total addressable market in 1-2 years and should have a healthy impact on profit margins  its chief executive told Reuters.",
        "date": "12212015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Net Insight says new invention could double addressable market "
    },
    {
        "content": "Dec 7 Netflix Inc will focus on developing its own content next year and nearly double the number of original shows to 31 from 16  Chief Content Officer Ted Sarandos said on Monday.",
        "date": "12072015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix content head says to double own shows next year "
    },
    {
        "content": "WASHINGTON A U.S. appeals court heard arguments on Friday over the legality of the Federal Communications Commission's net neutrality rules  in a case that may ultimately determine how consumers get access to content on the Internet.",
        "date": "12042015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "U.S. appeals court hears challenge to net neutrality rules "
    },
    {
        "content": "WASHINGTON  Dec 4 A U.S. appeals court heard arguments on Friday over the legality of the Federal Communications Commission's net neutrality rules  in a case that may ultimately determine how consumers get access to content on the Internet.",
        "date": "12042015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-U.S. appeals court hears challenge to net neutrality rules "
    },
    {
        "content": "WASHINGTON  Dec 4 A three-judge U.S. appeals court panel on Friday will consider whether the Federal Communications Commission's (FCC) net neutrality rules are legal  hearing arguments from major cable and telecommunications trade associations and AT&T Inc.",
        "date": "12042015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "U.S. court to hear challenge to net neutrality rules "
    },
    {
        "content": "STOCKHOLM Swedish telecoms network gear maker Ericsson raised its forecast for mobile data traffic  in a further boost to companies that benefit from rising numbers of consumers viewing online videos on platforms such as YouTube and Netflix.",
        "date": "11172015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Ericsson sees video driving tenfold rise in mobile data by 2021 "
    },
    {
        "content": "STOCKHOLM  Nov 17 Swedish telecoms network gear maker Ericsson raised its forecast for mobile data traffic  in a further boost to companies that benefit from rising numbers of consumers viewing online videos on platforms such as YouTube and Netflix.",
        "date": "11172015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Ericsson sees video driving tenfold rise in mobile data by 2021 "
    },
    {
        "content": "Soros Fund Management  which manages the investments of billionaire George Soros and his family  took new stakes in video streaming company Netflix Inc and casino operator Wynn Resorts Ltd during the third quarter.",
        "date": "11162015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Soros checks into Netflix  bids Herbalife adieu "
    },
    {
        "content": "Top U.S. hedge fund management firms  including Soros Fund Management LLC and Viking Global Investors  placed new bets on Netflix Inc  while Tiger Global Management increased its stake in the video streaming company during the third quarter  regulatory filings showed on Monday.",
        "date": "11172015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Factbox: Netflix  PayPal become hedge fund darlings in third quarter "
    },
    {
        "content": "* SAYS TO LAUNCH NEW STREAMING VIDEO ON DEMAND SERVICE IN FRANCE NEXT WEEK CALLED ZIVE",
        "date": "11092015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Numericable-SFR to launch video streaming to rival Netflix "
    },
    {
        "content": "LOS ANGELES  Nov 4 Time Warner Inc on Wednesday re-ignited concerns that U.S. consumers are shifting to Internet television faster than expected and creating challenges to major media companies that have thrived with programming on pay TV.",
        "date": "11042015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Time Warner amplifies fears that viewers are deserting pay TV "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)  Walt Disney Co is expected to report fourth-quarter revenue below the analyst average estimate  according to Thomson Reuters StarMine. The media company cut its profit forecast for its cable networks unit in August as it expects a decline in subscr",
        "date": "11042015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "What to Watch in the Day Ahead - Thursday  Nov 5 "
    },
    {
        "content": "* Signs non exclusive license agreement with Netflix for the online distribution of Sherlock Yack in Italy  Spain and Portugal",
        "date": "10232015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Mondo TV France sells non exclusive online rights to Sherlock Yack to Netflix "
    },
    {
        "content": "* Youku Tudou shares trading at $24.95   (Adds CFO  analyst comment  updates share price)",
        "date": "10162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 4-Alibaba offers to buy all of 'China's YouTube' "
    },
    {
        "content": "Oct 15 Spotify and some other online companies on Thursday played down the impact of a transition to chip-based bank cards a day after Netflix Inc blamed the shift for slow quarterly U.S. subscriber growth.",
        "date": "10152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Spotify  others downplay chip card woes cited by Netflix "
    },
    {
        "content": "Video-streaming service provider Netflix Inc reported third-quarter U.S. subscriber additions below its own forecast  blaming an ongoing transition to chip-based cards for the miss. | Video ",
        "date": "10142015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix blames weak U.S subscriber adds on new chip-based cards "
    },
    {
        "content": "Oct 15 Investors are likely to question Netflix Inc's premium valuation after the video-streaming service said on Wednesday that third-quarter subscriber additions in the United States came in below its own expectations.",
        "date": "10152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix's weak subscriber additions at odds with lofty valuation "
    },
    {
        "content": "Oct 14 Video-streaming service provider Netflix Inc reported third-quarter U.S. subscriber additions below its own forecast  blaming an ongoing transition to chip-based cards for the miss.",
        "date": "10142015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "CORRECTED-UPDATE-3-Netflix blames weak U.S subscriber adds on new chip-based cards "
    },
    {
        "content": "Oct 15 Investors questioned Netflix Inc's  premium valuation after the video-streaming service reported U.S. subscriber additions below its own expectations  a sign that competition from the likes of Hulu is intensifying.",
        "date": "10152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix's weak subscriber additions at odds with lofty valuation "
    },
    {
        "content": "Oct 14 Video-streaming service provider Netflix Inc reported U.S. subscriber additions below its own forecast  which the company attributed to the ongoing transition to chip-based credit and debit cards.",
        "date": "10142015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE-2-Netflix adds fewer U.S. subscribers than forecast; shares fall "
    },
    {
        "content": "Oct 14 Video-streaming service provider Netflix Inc reported U.S. subscriber additions below its own forecast  which the company attributed to the ongoing transition to chip-based credit and debit cards.",
        "date": "10142015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "CORRECTED-UPDATE 1-Netflix adds fewer U.S. subscribers than forecast; shares fall "
    },
    {
        "content": "Oct 14 Video-streaming service provider Netflix Inc reported U.S. subscriber additions below its own forecast  even as international subscriber additions blew past its estimates.",
        "date": "10142015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "CORRECTED-Netflix U.S. subscriber additions fall below estimates "
    },
    {
        "content": "Video-streaming service provider Netflix Inc reported third-quarter U.S. subscriber additions below its own forecast  blaming a transition to chip-based cards for the miss. | Video ",
        "date": "10152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix blames weak U.S subscriber adds on new chip-based cards "
    },
    {
        "content": "MILAN  Oct 15 European shares are expected to open higher on Thursday following three days of losses  tracking gains in Asia on growing expectations that the U.S. Federal Reserve will delay any interest rate increase until 2016.",
        "date": "10152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "European Factors to Watch-Shares seen up on U.S. rates outlook "
    },
    {
        "content": "MILAN  Oct 15 Financial spreadbetters expected Britain's FTSE 100 to open up by 24-32 points  or 0.4-0.5 percent  Germany's DAX  to open 59-69 points higher  or 0.6-0.7 percent  and France's CAC 40  to open 31-35 points higher  or 0.7-0.8 percent.",
        "date": "10152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "European Factors to Watch-Shares seen opening higher "
    },
    {
        "content": "Netflix Inc said on Thursday it has increased the subscription rate for some new members by $1.00 a month to $9.99 in the United States  Canada and Latin America.",
        "date": "10082015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix hikes rate for most popular plan by $1.00 "
    },
    {
        "content": "* 3rd-qtr U.S. subscriber additions 0.88 mln vs estimate 1.15 mln",
        "date": "10152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE-4-Netflix blames weak U.S subscriber adds on new chip-based cards "
    },
    {
        "content": "Oct 8 Netflix Inc said on Thursday it has increased the subscription rate for some new members by $1.00 a month to $9.99 in the United States  Canada and Latin America.",
        "date": "10082015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix hikes rate for most popular plan by $1.00 "
    },
    {
        "content": "Oct 8 Netflix Inc on Thursday hiked the subscription rate for its standard plan by $1.00 a month to $9.99 in the United States  the company's website showed.",
        "date": "10082015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix hikes subscription rate by $1 to $9.99/month "
    },
    {
        "content": "* Signs long-time agreement with Netflix International BV for distribution of OTT in Italy for the second window pay-TV of recent cinema releases and for non exclusive titles in Subscription Video On Demand service",
        "date": "09232015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Leone Film Group signs distribution agreement with Netflix International BV "
    },
    {
        "content": "JOHANNESBURG  Sept 18 A rapid roll-out of fibre optic broadband in upmarket South African neighbourhoods has caught the attention of Internet video streaming companies who are racing to capture a slice of a lucrative  untapped market.",
        "date": "09182015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "South Africa broadband blitz unlocks video-on-demand "
    },
    {
        "content": "BOSTON  Sept 10 Mutual fund company Vanguard Group backed measures at more than  a dozen companies this year that could give shareholders more power over the makeup of corporate boards  securities filings show.",
        "date": "09102015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Amid activist fears  some tough Vanguard votes on board reform "
    },
    {
        "content": "Netflix Inc said it would launch its movie and TV streaming service in South Korea  Singapore  Hong Kong and Taiwan early next year.",
        "date": "09092015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix to launch in South Korea  Singapore  Hong Kong  Taiwan early next year "
    },
    {
        "content": "Sept 9 Netflix Inc said it would launch its movie and TV streaming service in South Korea  Singapore  Hong Kong and Taiwan early next year.",
        "date": "09092015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix to launch in S.Korea  Singapore  Hong Kong  Taiwan early next year "
    },
    {
        "content": "VENICE Venice may be the world's oldest film festival  but this year it is pioneering what may well become the future of cinema as Netflix screens two films here  one of them its first feature and a contender for the top prize. | Video ",
        "date": "09042015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix makes big splash in Venice's film lagoon "
    },
    {
        "content": "VENICE  Sept 3 Venice may be the world's oldest film festival  but this year it is pioneering what may well become the future of cinema as Netflix screens two films here  one of them its first feature and a contender for the top prize.",
        "date": "09032015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix makes big splash in Venice's film lagoon "
    },
    {
        "content": "Apple Inc is looking to move into the original programing business to compete with video streaming companies such as Netflix Inc  Variety reported on Monday.",
        "date": "09012015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Apple explores move into original programing business: Variety "
    },
    {
        "content": "Aug 31 Iphone maker Apple Inc is looking to move into the original programming business to compete with video streaming companies such as Netflix Inc   Variety reported on Monday.",
        "date": "09012015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Apple explores move into original programming business - Variety "
    },
    {
        "content": "Aug 31 Major films such as Hunger Games: Catching Fire  World War Z  and Transformers: Age of Extinction will move to online video service Hulu from Netflix starting in October when cable network Epix switches streaming partners.",
        "date": "08312015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Hulu to become Epix's streaming partner after Netflix opts out "
    },
    {
        "content": "BOSTON  Aug 28 Hedge fund managers often promise to find stock ideas off the beaten path but this month many prominent players have been bloodied by doing exactly the opposite; betting on a small handful of popular names that sold off sharply in August.",
        "date": "08282015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Hedge funds that crowded into same names likely to nurse losses "
    },
    {
        "content": "Aug 26 Amazon.com plans to launch its video streaming service in Japan for members of its Prime paid service as it gears up for Netflix Inc's planned entry into the country in September  the Nikkei reported.",
        "date": "08262015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Amazon to launch video streaming service in Japan - Nikkei "
    },
    {
        "content": "Aug 26 Amazon.com said on Wednesday it plans to launch its video streaming service in Japan for members of its Prime paid service as it gears up for Netflix Inc's  planned entry into the country in September.",
        "date": "08272015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "UPDATE 1-Amazon to launch video streaming service in Japan "
    },
    {
        "content": "NEW YORK Millennial parents are coming to Corporate America  and companies are bracing for impact.",
        "date": "08182015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Why Netflix is raising the bar for millennial parents "
    },
    {
        "content": "NEW YORK  Aug 18 Millennial parents are coming to Corporate America  and companies are bracing for impact.",
        "date": "08182015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "COLUMN-Why Netflix is raising the bar for millennial parents "
    },
    {
        "content": "LOS ANGELES  Aug 13 U.S. broadcast TV network NBC is unlikely to extend its binge-watching experiment for the second season of drama \"Aquarius  the head of entertainment at the Comcast-owned network said on Thursday  though he would not rule out trying the approach for other series.",
        "date": "08132015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "NBC unlikely to repeat binge-watch test for 'Aquarius' "
    },
    {
        "content": "Netflix Inc is offering up to a year of paid maternity and paternity leave for employees to care for a newborn or newly adopted child  significantly raising the bar for parental benefits in corporate America.",
        "date": "08052015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix's year-long parental leave raises bar for U.S. employers "
    },
    {
        "content": "Aug 5 Netflix Inc is offering up to a year of paid maternity and paternity leave for employees to care for a newborn or newly adopted child  significantly raising the bar for parental benefits in corporate America.",
        "date": "08052015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-UPDATE 1-Netflix's year-long parental leave raises bar for U.S. employers "
    },
    {
        "content": "Aug 5 Netflix Inc is offering up to a year of paid maternity and paternity leave for employees to care for a newborn or newly adopted child  significantly raising the bar for parental benefits in corporate America.",
        "date": "08052015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix offers employees a year of parental leave "
    },
    {
        "content": "* Indexes down: Dow 0.21 pct  S&P 0.16 pct  Nasdaq 0.22 pct   (Updates to early afternoon)",
        "date": "08042015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St lower as Apple slips to 6-month low "
    },
    {
        "content": "MILAN Italian phone group Telecom Italia has reached an agreement with Mediaset  to sell the broadcaster's pay-TV content to its own clients  two sources with knowledge of the matter told Reuters.",
        "date": "08052015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Telecom Italia agrees pay-TV content deal with Mediaset: sources "
    },
    {
        "content": "MILAN  Aug 5 Italian phone group Telecom Italia has reached an agreement with Mediaset to sell the broadcaster's pay-TV content to its own clients  two sources with knowledge of the matter told Reuters.",
        "date": "08052015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Telecom Italia agrees pay-TV content deal with Mediaset - sources "
    },
    {
        "content": "MILAN  July 29 Telecom Italia will offer TV series and movies from Netflix to its clients after a deal the Italian phone group said would help spur demand for faster Internet in the euro zone's No. 3 economy.",
        "date": "07292015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Telecom Italia inks content deal with Netflix "
    },
    {
        "content": "MILAN  July 29 Telecom Italia will offer TV series and movies from Netflix to its clients after a deal the Italian phone group said would help spur demand for faster Internet in the euro zone's No. 3 economy.",
        "date": "07292015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Telecom Italia inks deal with Netflix "
    },
    {
        "content": "LOS ANGELES  July 20 As consumers flock to streaming video services like Netflix  the cable industry has struggled to regularly attract customers to its own online viewing options. This summer  networks and distributors will unite in a marketing campaign to try and change that.",
        "date": "07202015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "U.S. cable industry campaign aims to boost mobile views "
    },
    {
        "content": "A major rally in Google pushed the Nasdaq to a second straight record high on Friday while weak energy stocks weighed on the Dow and S&P 500. | Video ",
        "date": "07172015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Google propels Nasdaq to another record high close "
    },
    {
        "content": "NEW YORK - Wall Street ended stronger on Thursday  with the Nasdaq up more than 1 percent at a record high after earnings reports from eBay and Netflix boosted optimism.",
        "date": "07172015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "India Morning Call-Global Markets "
    },
    {
        "content": "NEW YORK Billionaire hedge fund manager David Einhorn said in an investor letter on Monday that chipmaker Micron Technology Inc  would be worth more than Netflix Inc  within the next few years.",
        "date": "07132015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Greenlight's Einhorn says Micron 'will be worth more than' Netflix "
    },
    {
        "content": "Netflix Inc  added nearly a third more subscribers than expected in the second quarter  sending its shares up 9.4 percent as the video streaming service said its investment in original television programs and movies was paying off.",
        "date": "07152015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix subscriptions far outpace expectations  shares up 9 percent "
    },
    {
        "content": "* Indexes up: Dow 1.22 pct  S&P 1.11 pct  Nasdaq 1.48 pct   (Updates to close  adds detail)",
        "date": "07132015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall Street rallies on Greek deal; tech stocks jump "
    },
    {
        "content": "Wall Street ended stronger on Thursday  with the Nasdaq up more than 1 percent at a record high after earnings reports from eBay  and Netflix  boosted optimism. | Video ",
        "date": "07162015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Wall St. rises; eBay  Netflix push Nasdaq to record high "
    },
    {
        "content": "Netflix Inc  Chief Executive Reed Hastings said it was possible the movie and TV streaming service's planned entry into China might be delayed beyond the company's goal of 2016.",
        "date": "07152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix might not make it into China in 2016  CEO says "
    },
    {
        "content": "* Indexes up: Dow 1.07 pct  S&P 0.93 pct  Nasdaq 1.31 pct   (Updates to afternoon  adds comment  details on volatility)",
        "date": "07132015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall Street surges on Greek deal; tech stocks rally "
    },
    {
        "content": "* Indexes up: Dow 0.99 pct  S&P 0.86 pct  Nasdaq 1.3 pct   (Updates to early afternoon)",
        "date": "07132015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-U.S. stocks advance on Greek deal; tech stocks lead "
    },
    {
        "content": "* Indexes up: Dow 0.39 pct  S&P 0.8 pct  Nasdaq 1.26 pct   (Updates to close  adds detail)",
        "date": "07162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St rises; eBay  Netflix push Nasdaq to record high "
    },
    {
        "content": "July 15 Netflix Inc Chief Executive Reed Hastings said it was possible the movie and TV streaming service's planned entry into China might be delayed beyond the company's goal of 2016.",
        "date": "07152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix might not make it into China in 2016  CEO says "
    },
    {
        "content": "* Netflix CEO Reed Hastings says 'I suppose it's possible' launch in China won't happen in 2016  Source text for Eikon:  Further company coverage:    (Reporting by Lisa Richwine)",
        "date": "07152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix CEO says 'it's possible' launch in China won't happen in 2016 "
    },
    {
        "content": "* Indexes up: Dow 0.23 pct  S&P 0.64 pct  Nasdaq 1.03 pct   (Updates to mid-afternoon)",
        "date": "07162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St rises as eBay  Netflix push Nasdaq toward record "
    },
    {
        "content": "July 15 Netflix Inc added nearly a third more subscribers than expected in the second quarter  sending its shares up 9.4 percent as the video streaming service said its investment in original television programs and movies was paying off.",
        "date": "07152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 2-Netflix subscriptions far outpace expectations  shares up 9 pct "
    },
    {
        "content": "* Indexes up: Dow 0.23 pct  S&P 0.64 pct  Nasdaq 1 pct   (Updates to early afternoon)",
        "date": "07162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St gains as bellwethers post strong earnings reports "
    },
    {
        "content": "* Indexes off: Dow 0.02 pct  S&P 0.07 pct  Nasdaq 0.12 pct   (Adds Intel  Netflix earnings)",
        "date": "07152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall Street edges lower as energy weighs "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.66 pct  Nasdaq 1.05 pct   (Adds details  comment  updates prices)",
        "date": "07162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St jumps on strong earnings report "
    },
    {
        "content": "Netflix Inc's accelerating subscriber growth signals the video streaming service has much more room to expand  with some analysts seeing it tripling its subscribers to 200 million within a few years  driven by international expansion.",
        "date": "07162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix seen adding more viewers with strong content  new markets "
    },
    {
        "content": " ",
        "date": "07152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix revenue boosted by strong subscriber growth "
    },
    {
        "content": "* Indexes up: Dow 0.25 pct  S&P 0.56 pct  Nasdaq 0.65 pct   (Updates to open)",
        "date": "07162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St opens higher on strong quarterly reports "
    },
    {
        "content": "July 7 Netflix Inc said its first original movie  \"Beasts of No Nation \" will be released on Oct. 16 on its video streaming service and in select U.S. theatres.",
        "date": "07072015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Beasts of No Nation: First original Netflix movie release in Oct "
    },
    {
        "content": "LOS ANGELES Rapper Sean \"P. Diddy\" Combs will not face assault charges stemming from an incident involving a kettlebell weight at the University of California  Los Angeles  Los Angeles city officials said on Thursday. | Video ",
        "date": "07032015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Rapper Sean Combs avoids assault charges in UCLA kettlebell incident "
    },
    {
        "content": "* Futures up: Dow 44 pts  S&P 8 pts  Nasdaq 18 pts   (Adds details  comment  updates prices)",
        "date": "07162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St set to open up on strong quarterly reports "
    },
    {
        "content": "July 16 U.S. stock index futures rose on Thursday as investors welcomed Greek parliamentary approval of a bailout plan and on strong results from Netflix and Intel overnight.",
        "date": "07162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Futures rise after Greek vote; Intel  Netflix results "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn said Wednesday that his firm had sold the remainder of its stake in Netflix Inc  and that Apple  represented the same opportunity he said Netflix offered years ago.",
        "date": "06252015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Carl Icahn says sold remainder of Netflix stake "
    },
    {
        "content": "* Netflix has active session after board approves stock split",
        "date": "06242015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St ends broadly lower on Greek debt concerns "
    },
    {
        "content": "NEW YORK  June 24 U.S. stocks fell in a broad decline on Wednesday as the outcome of negotiations between Greece and its international creditors remained up in the air  prompting investors to drop riskier assets like equities.",
        "date": "06242015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-U.S. stocks fall broadly on Greek debt concerns "
    },
    {
        "content": "June 23 Netflix Inc said on Tuesday its board of directors approved a seven-for-one stock split.",
        "date": "06232015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix board approves a seven-for-one stock split "
    },
    {
        "content": "* First-qtr GDP contracted 0.2 pct vs earlier estimate of 0.7 pct",
        "date": "06242015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "CORRECTED-US STOCKS-U.S. stocks down on Greek debt crisis jitters "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn said Wednesday that his firm had sold the remainder of its stake in Netflix Inc  and that Apple  represented the same opportunity he said Netflix offered years ago.",
        "date": "06242015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Carl Icahn says sold remainder of Netflix stake "
    },
    {
        "content": "LOS ANGELES Rapper Sean \"P. Diddy\" Combs was arrested and charged with assault with a deadly weapon at the University of California Los Angeles on Monday  college law enforcement authorities said. | Video ",
        "date": "06232015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Rapper Sean Combs arrested for assault with deadly weapon at UCLA "
    },
    {
        "content": "SHANGHAI  June 14 Alibaba Group Holding Ltd  will launch an online video streaming service in China in about two months  hoping to emulate the U.S.'s Netflix Inc  and HBO  the firm's head of digital entertainment said on Sunday.",
        "date": "06142015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Alibaba to launch Netflix-like video streaming service in two months "
    },
    {
        "content": "NEW YORK  June 10 U.S. stocks jumped on Wednesday  helped by gains in technology and financial shares and optimism that Greece may be closer to reaching a deal with creditors.",
        "date": "06102015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St climbs on tech  financials gains  optimism on Greece "
    },
    {
        "content": "NEW YORK  June 10 U.S. stocks jumped on Wednesday  helped by optimism that Greece may be closer to reaching a deal with creditors and by gains in technology and financial shares.",
        "date": "06102015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St jumps on optimism about Greece; financials gain "
    },
    {
        "content": "June 10 U.S. stocks were higher in afternoon trading on Wednesday after a Bloomberg report that Germany may be satisfied with Greece committing to at least one economic reform in return for aid.",
        "date": "06102015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-US STOCKS-Wall St up on report Germany may consider Greece aid "
    },
    {
        "content": "* Indexes up: Dow 1.4 pct  S&P 1.2 pct  Nasdaq 1.3 pct   (Adds details  changes comment  updates prices)",
        "date": "06102015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St jumps on report Germany may consider Greece aid "
    },
    {
        "content": "* Indexes up: Dow 0.8 pct  S&P 0.7 pct  Nasdaq 0.5 pct   (Update to open)",
        "date": "06102015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Dow opens higher for first time in five days "
    },
    {
        "content": "LOS ANGELES Netflix Inc  shareholders on Tuesday approved a massive increase in the number of shares the company is authorized to issue  the first step toward a possible stock split.",
        "date": "06092015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix investors approve share increase  company to pursue stock split "
    },
    {
        "content": "LOS ANGELES  June 9 Netflix Inc  shareholders on Tuesday approved a massive increase in the number of shares the company is authorized to issue  the first step toward a possible stock split.",
        "date": "06092015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix investors approve share increase  company to pursue stock split "
    },
    {
        "content": "LOS ANGELES  June 9 Netflix Inc  shareholders on Tuesday approved a massive increase in the number of shares the company is authorized to issue  the first step toward a possible stock split.",
        "date": "06092015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix shareholders OK share increase  company to pursue split "
    },
    {
        "content": "FRANKFURT Internet television service Netflix plans to expand into Italy and Portugal later this year  the company said on Saturday  as part of a bid to expand its popular streaming TV service to some 200 countries worldwide within two years.",
        "date": "06062015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix expands Internet TV service to southern Europe "
    },
    {
        "content": "FRANKFURT  June 6 Internet television service Netflix plans to expand into Italy and Portugal later this year  the company said on Saturday  as part of a bid to expand its popular streaming TV service to some 200 countries worldwide within two years.",
        "date": "06062015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix expands Internet TV service to southern Europe "
    },
    {
        "content": "FRANKFURT  June 6 Internet TV service Netflix  plans to expand into Italy later this year  the company said on Saturday  as part of a bid to expand its popular streaming television service to some 200 countries worldwide within two years.",
        "date": "06062015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix to offer Internet TV service in Italy  Spain "
    },
    {
        "content": "May 20 Telecom Italia CEO Marco Patuano tells shareholder meeting:",
        "date": "05202015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Telecom Italia will be open platform for Sky  Mediaset  Netflix "
    },
    {
        "content": "* Says company has discussion with Netflix on internet TV business  but has not reached any agreement as of May 18",
        "date": "05182015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Wasu Media confirms discussion with Netflix  no agreement yet "
    },
    {
        "content": "May 15 U.S. shares ended little changed on Friday  with the S&P 500 edging up to a record high for a second straight session after a ream of weak economic data.",
        "date": "05152015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "US STOCKS-S&P ekes out second record close after lackluster data "
    },
    {
        "content": "May 15 U.S. shares dipped on Friday and the S&P 500 eased off a recent record high as a ream of weak data stirred concerns about the economy's health.",
        "date": "05152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-US STOCKS-Wall St dips  S&P off peak  on lackluster data "
    },
    {
        "content": "* Indexes down: Dow 0.1 pct  S&P 0.1 pct  Nasdaq 0.2 pct   (Adds details  changes comment  updates prices)",
        "date": "05152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St slips after weak economic data "
    },
    {
        "content": "Video streaming company Netflix Inc  is in talks with Jack Ma-backed Wasu Media Holding Co  and other potential partners to enter China's booming online video market  Bloomberg reported  citing people familiar with the matter. | Video ",
        "date": "05152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix in talks with Jack Ma-backed Wasu to enter China: Bloomberg "
    },
    {
        "content": "* Indexes: Dow up 0.05 pct  S&P up 0.01 pct  Nasdaq down 0.01 pct   (Updates to open)",
        "date": "05152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St little changed as industrial output falls "
    },
    {
        "content": "* Futures up: Dow 20 pts  S&P 2.25 pts  Nasdaq 10.25 pts   (Adds details  changes comment  updates prices)",
        "date": "05152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St set to open higher as global bond selloff eases "
    },
    {
        "content": "May 15 Video streaming company Netflix Inc  is in talks with Jack Ma-backed Wasu Media Holding Co  and other potential partners to enter China's booming online video market  Bloomberg reported  citing people familiar with the matter.",
        "date": "05152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix in talks with Jack Ma-backed Wasu to enter China -Bloomberg "
    },
    {
        "content": "LOS ANGELES Tripping on muscle relaxants and peyote on the beach  two discarded wives portrayed by Jane Fonda and Lily Tomlin work through their anger and heartbreak and then ask \"now what?\" | Video ",
        "date": "05072015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Fonda  Tomlin bare septuagenarian souls in 'Grace and Frankie' "
    },
    {
        "content": "WASHINGTON Netflix Inc has urged the U.S. Federal Communications Commission to reject the pending $48 billion merger of AT&T Inc and DirecTV unless its concerns about the deal are addressed.",
        "date": "05052015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix asks FCC to reject AT&T-DirecTV merger unless changes made "
    },
    {
        "content": "WASHINGTON  May 5 Netflix Inc has urged the U.S. Federal Communications Commission to reject the pending $48 billion merger of AT&T Inc and DirecTV unless its concerns about the deal are addressed.",
        "date": "05052015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 2-Netflix asks U.S. FCC to reject AT&T-DirecTV merger unless changes made "
    },
    {
        "content": "* Netflix Spokeswoman Says Company Does Not Oppose At&T Inc-DirecTV merger  seeks conditions    (Reporting By Alina Selyukh)",
        "date": "05052015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix says does not oppose AT&T-DirecTV merger  seeks conditions "
    },
    {
        "content": "NEW YORK Wall Street equities finished modestly lower on Thursday as investors worried about coming corporate results  while European stocks fell nearly 1 percent under the weight of Greece's worsening financial predicament.",
        "date": "04162015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Wall Street holds steady  oil rises and dollar declines "
    },
    {
        "content": "NEW YORK U.S. stocks ended marginally lower on Thursday as lingering worries about upcoming corporate earnings reports offset enthusiasm about a trio of soaring Wall Street debuts.",
        "date": "04162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Wall Street ends slightly lower as earnings worries linger "
    },
    {
        "content": "* Dow finishes down 0.04 pct  S&P 500 down 0.08 pct Nasdaq loses 0.06 pct",
        "date": "04162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St ends slightly lower as earnings worries linger "
    },
    {
        "content": "Netflix Inc has been a stock market darling over the past few years and strong first-quarter subscriber additions sent its shares to another record high on Thursday. But is the company's sky-high valuation sustainable?",
        "date": "04162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix's soaring valuation raises some doubts on Wall St "
    },
    {
        "content": "April 16 Netflix Inc has been a stock market darling over the past few years and strong first-quarter subscriber additions sent its shares to another record high on Thursday. But is the company's sky-high valuation sustainable?",
        "date": "04162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix's soaring valuation raises some doubts on Wall St "
    },
    {
        "content": "April 16 U.S. stocks were mixed on Thursday afternoon as soaring Wall Street debuts by online retailer Etsy and trading firm Virtu offset lingering worries about upcoming corporate earnings reports.",
        "date": "04162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St mixed as Netflix surges and investors eye earnings "
    },
    {
        "content": "Although its streaming media rivals Netflix and Apple have faced the Kudelski Group in court over accusations of patent infringement  Google has decided to license the Swiss company's portfolio  Kudelski announced on Tuesday.",
        "date": "04142015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Google licenses patents from company behind Netflix  Apple suits "
    },
    {
        "content": "* Dow down 0.02 pct  S&P 500 down 0.04 pct Nasdaq down 0.1 pct",
        "date": "04162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St flat; first-quarter results mixed so far "
    },
    {
        "content": "April 16 U.S. stocks edged lower on Thursday as corporate results showed little organic growth even as they largely beat profit expectations.",
        "date": "04162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-US STOCKS-Wall St edges lower; investors look for profit growth "
    },
    {
        "content": "* Indexes down: Dow 0.3 pct  S&P 0.3 pct  Nasdaq 0.1 pct   (Updates to market open  adds analyst comment)",
        "date": "04162015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St dips  but Netflix surge supports Nasdaq "
    },
    {
        "content": "Video streaming pioneer Netflix Inc added more subscribers than projected in the United States and abroad during the first quarter  news that sent its shares up nearly 12 percent on Wednesday. | Video ",
        "date": "04152015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix beats forecasts with 62 million streaming subscribers "
    },
    {
        "content": "April 15 Video streaming pioneer Netflix Inc  added more subscribers than projected in the United States and abroad during the first quarter  news that sent its shares up nearly 12 percent on Wednesday.",
        "date": "04152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 2-Netflix beats forecasts with 62 mln streaming subscribers "
    },
    {
        "content": "* Indexes down: Dow 0.5 pct  S&P 0.5 pct  Nasdaq 0.2 pct   (Updates close with Norfolk Southern shares down after the bell)",
        "date": "04132015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St declines as worries about earnings deepen "
    },
    {
        "content": "April 10 Netflix Inc is seeking to increase its share authorization by nearly 30 times  the video streaming service said in a filing with regulators.",
        "date": "04102015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix seeks to raise share authorization in step to stock split "
    },
    {
        "content": "April 15 U.S. stocks closed higher on Wednesday  fueled by gains in oil companies and speculation that upcoming first-quarter earnings reports might not be quite as weak as previously thought.",
        "date": "04152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St ends higher as jitters about earnings and oil recede "
    },
    {
        "content": "* Indexes down: Dow 0.5 pct  S&P 0.5 pct  Nasdaq 0.2 pct   (Updates to close)",
        "date": "04132015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St ends down as earnings worries deepen "
    },
    {
        "content": "April 15 Netflix Inc's quarterly revenue jumped nearly 24 percent as the TV and movie streaming service provider added 4.88 million net subscribers worldwide  beating its own forecast of 4.05 million.",
        "date": "04152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "CORRECTED-Netflix subscriber additions top forecast "
    },
    {
        "content": "* Netflix to raise share authorization in step to split stock",
        "date": "04132015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Dow  S&P 500 edge lower as earnings worries deepen "
    },
    {
        "content": "April 15 U.S. stocks rose on Wednesday  fueled by gains in the energy sector and speculation that upcoming first-quarter earnings reports might not be quite as bad as previously thought.",
        "date": "04152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St rallies as earnings jitters recede and oil rebounds "
    },
    {
        "content": "* Netflix to raise share authorization in step to split stock",
        "date": "04132015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Nasdaq near all-time high on lift from tech "
    },
    {
        "content": "April 15 U.S. stocks rose on Wednesday  fueled by gains in the energy sector and speculation that upcoming first-quarter earnings reports might not be quite as bad as previously thought.",
        "date": "04152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-US STOCKS-Wall St rises as earnings jitters recede and oil rebounds "
    },
    {
        "content": "* Indexes up: Dow 0.3 pct  S&P 0.4 pct  Nasdaq 0.4 pct   (Updates to midday)",
        "date": "04152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St up as earnings worries recede  oil jumps "
    },
    {
        "content": "NEW YORK  April 7 When BlackRock  the world's largest asset manager   evaluates potential stock purchases  its managers look at all the usual financial metrics.",
        "date": "04082015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-RPT-INSIGHT -Does a happy employee make for a healthy stock price? "
    },
    {
        "content": "April 15 U.S. stocks rose higher on Wednesday as earnings from major companies beat lowered expectations and investors' worries about a poor quarterly season receded.",
        "date": "04152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "REFILE-US STOCKS-Wall St edges higher as earnings worries recede "
    },
    {
        "content": "LOS ANGELES (Variety.com) - Netflix's \"Orange Is the New Black\" will be returning for a fourth season in 2016  the company announced.",
        "date": "04152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix Renews 'Orange Is the New Black' for Season 4 "
    },
    {
        "content": "NEW YORK When BlackRock  the world’s largest asset manager  evaluates potential stock purchases  its managers look at all the usual financial metrics.",
        "date": "04082015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Insight: Does a happy employee make for a healthy stock price? "
    },
    {
        "content": "* Futures up: Dow 57 pts  S&P 5.5 pts  Nasdaq 10 pts   (Adds details  comments  updates prices)",
        "date": "04152015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St set to rise as earnings beat low expectations "
    },
    {
        "content": "Streaming video service provider Netflix Inc said it will premiere its next series  \"Montauk\"  in 2016 as it looks to boost its original content in a highly competitive market.",
        "date": "04022015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix to premiere original series 'Montauk' in 2016 "
    },
    {
        "content": "April 2 Streaming video service provider Netflix Inc said it will premiere its next series  \"Montauk\"  in 2016 as it looks to boost its original content in a highly competitive market.",
        "date": "04022015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix to premiere original series \"Montauk\" in 2016 "
    },
    {
        "content": "John Malone-backed Charter Communications Inc said it would buy Bright House Networks in a $10.4 billion deal as it expands its cable network after losing out to Comcast Corp in a fight for Time Warner Cable Inc. | Video ",
        "date": "03312015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Charter beefs up cable muscle with Bright House deal "
    },
    {
        "content": "ROME  March 10 Italy's biggest phone company  Telecom Italia said on Tuesday it was in talks with Netflix over a possible content deal with the U.S. online movie streaming company.",
        "date": "03102015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Telecom Italia says in talks with Netflix over content deal "
    },
    {
        "content": "March 9 HBO's standalone streaming service will launch on Apple Inc devices next month in time for the season premiere of hit series \"Game of Thrones \" the network said on Monday  a move to reach millions of viewers who do not subscribe to pay television packages.",
        "date": "03092015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "UPDATE 2-HBO standalone service coming to Apple devices in April "
    },
    {
        "content": "NEW YORK  March 4 Actor Leonardo DiCaprio is the latest high-profile name to partner with Netflix Inc  as he and his production company Appian Way will produce a documentary and a series that will premiere exclusively on the digital streaming service  the company said on Wednesday.",
        "date": "03042015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Leonardo DiCaprio partners with Netflix for documentary projects "
    },
    {
        "content": "SHANGHAI  March 2 U.S. video service provider Netflix Inc is likely to enter the Chinese market without a local partner  which could make it harder to do business in the world's biggest internet market widely known for censorship and strict regulation.",
        "date": "03022015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix eyes entering tricky China market on its own "
    },
    {
        "content": "LOS ANGELES  Feb 20 Netflix Inc  the streaming video pioneer that shook up Internet television with \"House of Cards \" loped into the heart of the Hollywood film world this awards season on the backs of some captivating mountain gorillas.",
        "date": "02202015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix raises Oscar stakes with documentary contender 'Virunga' "
    },
    {
        "content": "LOS ANGELES  Feb 11 An early release of the new season of Netflix Inc's political thriller \"House of Cards\" was caused by a technical glitch  the company said on Wednesday.",
        "date": "02112015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix 'technical glitch' gives early peek at 'House of Cards' "
    },
    {
        "content": " ",
        "date": "02092015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix launches in Cuba "
    },
    {
        "content": "Netflix Inc launched its movie and TV streaming service in Cuba on Monday  joining the list of U.S. companies looking to take advantage of thawing diplomatic relations between the United States and the communist-ruled island country.",
        "date": "02092015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix launches in Cuba "
    },
    {
        "content": "Feb 9 Netflix Inc launched its movie and TV streaming service in Cuba on Monday  joining the list of U.S. companies looking to take advantage of thawing diplomatic relations between the United States and the communist-ruled island country.",
        "date": "02092015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 2-Netflix launches in Cuba "
    },
    {
        "content": "Feb 9 Netflix Inc said it launched its movie and TV streaming service in Cuba on Monday.",
        "date": "02092015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix launches streaming service in Cuba "
    },
    {
        "content": "Netflix Inc will launch its movie and TV streaming service in Japan in the fall of 2015  a source with knowledge of the matter said on Wednesday.",
        "date": "02042015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix to enter Japan in fall of 2015: source "
    },
    {
        "content": "Feb 4 Netflix Inc will launch its movie and TV streaming service in Japan in the fall of 2015  a source with knowledge of the matter said on Wednesday.",
        "date": "02042015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix to enter Japan in fall of 2015 -source "
    },
    {
        "content": "Netflix Inc said it will launch its movie and TV streaming service in Japan in the fall of 2015.",
        "date": "02052015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix to enter Japan in fall of 2015 "
    },
    {
        "content": "Feb 4 Netflix Inc said it will launch its movie and TV streaming service in Japan in the fall of 2015.",
        "date": "02052015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix to enter Japan in fall of 2015 "
    },
    {
        "content": "WASHINGTON  Jan 28 New U.S. \"net neutrality\" rules are expected to regulate for the first time deals in which content companies such as Netflix Inc pay broadband providers to connect with their networks for smooth downloads  according to people familiar with the plan.",
        "date": "01292015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "U.S. net neutrality rules expected to cover interconnection deals "
    },
    {
        "content": "BEIJING/LOS ANGELES  Jan 21 As Netflix Inc  tackles stalling U.S. growth  the online video pioneer known for hit political drama \"House of Cards\" plans a play for China that may see it lock horns with potent domestic firms that rule the world's biggest Internet market.",
        "date": "01222015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "RPT-In Netflix China push  domestic tech giants  online habits block path to success "
    },
    {
        "content": "NEW YORK U.S. stocks edged up in a choppy Wednesday session as traders digested reports that new stimulus would be announced by the European Central Bank at its Thursday meeting  while declines in IBM limited gains.",
        "date": "01212015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Wall Street up on ECB bets but details  IBM cap gains "
    },
    {
        "content": "* 'not 100 percent clear' Netflix will get license to operate in China",
        "date": "01202015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix CEO Hastings says company will be 'very cautious' if it gets license to operate in China "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.4 pct  Nasdaq 0.3 pct   (Updates prices  changes comment  byline)",
        "date": "01212015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St up on ECB bets but details  IBM cap gains "
    },
    {
        "content": "Netflix Inc added 4.3 million net subscribers to its TV and movie streaming service worldwide in the fourth quarter  helped by expansion into new markets  sending its shares soaring in after market trading. | Video ",
        "date": "01202015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix adds 4.3 million streaming subscribers  shares soar "
    },
    {
        "content": "Jan 20 Netflix Inc added 4.3 million net subscribers to its TV and movie streaming service worldwide in the fourth quarter  helped by expansion into new markets  sending its shares soaring in after market trading.",
        "date": "01202015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix adds 4.3 mln streaming subscribers  shares soar "
    },
    {
        "content": "* Indexes up: Dow 0.3 pct  S&P 0.7 pct  Nasdaq 0.7 pct   (Updates to afternoon trading)",
        "date": "01212015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St rises on report of ECB action; IBM falls "
    },
    {
        "content": "* Indexes up: Dow 0.02 pct  S&P off 0.15 pct  Nasdaq up 0.44 pct   (Adds volume data  IBM and Netflix results)",
        "date": "01202015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St ends flat as hope for ECB move increases "
    },
    {
        "content": "* Indexes up: Dow 0.4 pct  S&P 0.7 pct  Nasdaq 0.7 pct   (Updates to midday trading)",
        "date": "01212015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St rises on report of ECB action "
    },
    {
        "content": "* Indexes: Dow down 0.1 pct  S&P up 0.2 pct  Nasdaq up 0.1 pct   (Updates to open of U.S. trading)",
        "date": "01212015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Wall St edges up on ECB hopes  but IBM weighs "
    },
    {
        "content": "Jan 20 Netflix Inc's quarterly revenue rose 26.3 percent as the TV and movie streaming service added 4.3 million net subscribers worldwide  beating its own forecast of 4 million.",
        "date": "01202015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix adds 4.3 mln streaming subscribers in Dec quarter "
    },
    {
        "content": "Netflix Inc's faster-than-expected rollout in overseas markets took most analysts by surprise  setting off a flurry of price target increases on the stock.",
        "date": "01212015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix's accelerated global rollout catches Wall Street off guard "
    },
    {
        "content": "Jan 21 Netflix Inc's  faster-than-expected rollout in overseas markets took most analysts by surprise  setting off a flurry of price target increases on the stock.",
        "date": "01212015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "UPDATE 1-Netflix's accelerated global rollout catches Wall St off guard "
    },
    {
        "content": "* Futures down: Dow 79 pts  S&P 5.5 pts  Nasdaq 10.5 pts   (Updates prices)",
        "date": "01212015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "US STOCKS-Futures point to lower open as IBM weighs "
    },
    {
        "content": "Jan 21 Netflix Inc's  faster-than-expected rollout in overseas markets surprised many analysts  who scrambled to raise their price targets on the stock.",
        "date": "01212015",
        "name": "Netflix Inc",
        "news_type": "normal",
        "symbol": "NFLX",
        "title": "Netflix's accelerated global rollout catches Wall St off guard "
    },
    {
        "content": "* Netflix and Kudelski Group announce comprehensive product relationship",
        "date": "01132015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "BRIEF-Netflix and Kudelski Group announce comprehensive product relationship "
    },
    {
        "content": "PASADENA  Calif. The historical epic \"Marco Polo\" will get a second 10-episode season on Netflix  the online streaming service said on Wednesday.",
        "date": "01072015",
        "name": "Netflix Inc",
        "news_type": "topStory",
        "symbol": "NFLX",
        "title": "Netflix renews historical epic 'Marco Polo' for second season "
    }
]