[
    {
        "content": "Nov 9 British power grid operator National Grid Plc reported a slightly worse-than-expected fall in half-year profit on Thursday hurt by weakness in its UK electricity transmission business.",
        "date": "11092017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 1-National Grid reports lower-than-expected H1 profit "
    },
    {
        "content": "Nov 9 British power grid operator National Grid Plc reported a slightly worse-than-expected fall in half-year profit on Thursday hurt by weakness in its UK electricity transmission business.",
        "date": "11092017",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "National Grid reports fall in H1 profit "
    },
    {
        "content": "LONDON  Oct 12 Britain will have enough power generation and imports through interconnectors to meet demand this winter  National Grid said in its 2017/18 winter outlook report on Thursday.",
        "date": "10122017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "Britain has enough power to meet winter demand -National Grid "
    },
    {
        "content": "* No major damage identified at Williams Partners’ facilities following Hurricane Harvey",
        "date": "09062017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "BRIEF-No major damage identified at Williams Partners’ facilities after Hurricane Harvey "
    },
    {
        "content": "OSLO  Aug 3 Britain's National Grid will create a new company to separately operate its electricity system by April 2019  energy regulator Ofgem said on Thursday.",
        "date": "08032017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "Britain's National Grid to create separate system operator "
    },
    {
        "content": "May 18 National Grid Plc said full-year adjusted operating profit rose 14 percent  helped by strong growth in its UK power transmission units and \"favourable timing\" in the UK and U.S. businesses partly related to the weather.",
        "date": "05182017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "National Grid reports 14 pct rise in FY adjusted operating profit "
    },
    {
        "content": "LONDON  May 10 Britain is emerging as a hotbed for utility-scale battery development  with two of Europe's three biggest projects under way there and several companies joining a race that could shake up the energy market.",
        "date": "05102017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "Falling costs  new revenues fuel Britain's big battery boom "
    },
    {
        "content": "* Sunrun Inc says on May 9  2017  a jointly-owned subsidiary of Sunrun and National Grid entered aggregate $202 million of senior secured credit facilities Source text for Eikon: (http://bit.ly/2phELzg) Further company coverage:",
        "date": "05092017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "BRIEF-Sunrun and National Grid's jointly-owned subsidiary entered aggregate $202 million of senior secured credit facilities "
    },
    {
        "content": "April 12 Gas and electricity distributor National Grid Plc said it expected full-year earnings per share to be 5 pence more than previously estimated due to \"higher favourable timing\" in both its UK and U.S. businesses.",
        "date": "04122017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "National Grid sees higher full-year earnings "
    },
    {
        "content": "* James Harrison takes over as national grid gas distribution's head of operations for London",
        "date": "04062017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "BRIEF-National Grid says James Harrison takes over as head of London ops "
    },
    {
        "content": "* Expects to complete investment in National Grid's gas distribution network within next few weeks",
        "date": "03232017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "BRIEF-International Public Partnerships to complete investment in National Grid's gas distribution network "
    },
    {
        "content": "BRUSSELS  March 17 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03172017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "EU mergers and takeovers (March 17) "
    },
    {
        "content": "BRUSSELS  March 14 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03142017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "EU mergers and takeovers (March 14) "
    },
    {
        "content": "LONDON The business case for building power links between Britain and its European neighbors remains good despite Brexit  National Grid's director of business development told a parliamentary committee on Wednesday.",
        "date": "01252017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "National Grid confident on prospects for UK-EU power links "
    },
    {
        "content": "* French energy markets regulator approves project   (Updates with French energy regulator approving power link)",
        "date": "01252017",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "UPDATE 1-National Grid confident on prospects for UK-EU power links "
    },
    {
        "content": "Jan 12 Britain's National Grid will escape with an arms-length separation of its two main businesses rather than a formal break-up under proposals by energy regulator Ofgem to ensure the group avoids conflicts of interest.",
        "date": "01122017",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 1-Britain's National Grid escapes with shake-up not break-up "
    },
    {
        "content": "Jan 12 Britain plans to create a more independent electricity market operator within National Grid   which currently runs the system  to boost competition and benefit consumers.",
        "date": "01122017",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "Britain plans to create more independent electricity market operator "
    },
    {
        "content": "* National Grid Saudi Arabia enters into New Asset Health and Condition Assessment Agreement with Doble Engineering Company",
        "date": "11142016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "BRIEF-National Grid Saudi Arabia enters into New Asset Health  Condition Assessment Agreement with Doble Engineering "
    },
    {
        "content": "LONDON  Nov 7 Britain's National Grid  cancelled a notice to back-up power suppliers that they might be called upon on Monday after supply forecasts improved.",
        "date": "11072016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 2-UK's National Grid cancels notice of tight power supply "
    },
    {
        "content": "Hermes Investment Management has joined a consortium bidding to buy a controlling stake in the gas distribution division of National Grid   Sky News reported.",
        "date": "10272016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "Hermes Investment joins bid for National Grid's gas pipelines unit: Sky News "
    },
    {
        "content": "Oct 27 Hermes Investment Management has joined a consortium bidding to buy a controlling stake in the gas distribution division of National Grid  Sky News reported.",
        "date": "10272016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "Hermes Investment joins bid for National Grid's gas pipelines unit- Sky News "
    },
    {
        "content": "* Hermes Investment Management signed up to a consortium vying to buy controlling stake in National Grid's gas distribution division- Sky News",
        "date": "10272016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "BRIEF-Hermes Investment signed up to consortium to buy controlling stake in National Grid's gas distribution division- sky news "
    },
    {
        "content": "Oct 18 British energy regulator Ofgem said on Tuesday it has for National Grid's annual revenues from a planned electricity interconnector to Norway by percent  meaning British consumers benefit more than expected.",
        "date": "10182016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 1-UK regulator cuts proposed earnings cap for Norway power link "
    },
    {
        "content": "Sept 30 Britain's energy regulator Ofgem said on Friday it has granted National Grid approval to transfer its gas transportation license to its new subsidiary National Grid Gas Distribution Limited (NGGD)  which is set for sale.",
        "date": "09302016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 1-Ofgem approves transfer of National Grid gas transport license to subsidiary "
    },
    {
        "content": "Sept 30 Britain's energy regulator Ofgem said on Friday it has granted National Grid consent to transfer its gas transportation license to its new subsidiary National Grid Gas Distribution Limited (NGGD)  which is set for sale.",
        "date": "09302016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "Ofgem agrees on license transfer to National Grid's subsidiary set for sale "
    },
    {
        "content": "Sept 26 Britain's FTSE 100 index is seen opening down 19 points  or 0.3 percent  on Monday  according to financial bookmakers.          * The UK blue chip index closed finished 0.03 percent lower at 6 909.43 points on Friday  as a weak day for banks was offset by a rise in housebuilders. The index rose 3 percent in the week  its best performance in nearly three months.      * BREXIT: Three-quarters of British company bosses are considering moving operations abroad following the vote ",
        "date": "09262016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "UK Stocks-Factors to watch on Sept. 26 "
    },
    {
        "content": "Sept 28 UK energy regulator Ofgem told potential buyers of a majority stake in National Grid's four gas networks and part of utility SSE's SGN network on Wednesday that price controls for the period after 2021 have not yet been set  SSE said.",
        "date": "09282016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UK's Ofgem tells bidders for National Grid gas networks earnings not guaranteed-SSE "
    },
    {
        "content": "Reuters Hong Kong billionaire Li Ka-Shing is likely to face significant regulatory hurdles if he bids for a stake in National Grid's  British gas networks  banking and industry sources said  because of similar assets he already owns.",
        "date": "09232016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "Li Ka-Shing could face regulatory snag on National Grid deal: sources "
    },
    {
        "content": "Reuters  Sept 23 Hong Kong billionaire Li Ka-Shing is likely to face significant regulatory hurdles if he bids for a stake in National Grid's British gas networks  banking and industry sources said  because of similar assets he already owns.",
        "date": "09232016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "Li Ka-Shing could face regulatory snag on National Grid deal - sources "
    },
    {
        "content": "* Servelec awarded National Grid gas framework  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "09212016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "BRIEF-Servelec Group says awarded National Grid gas framework contract "
    },
    {
        "content": "Hong Kong billionaire Li Ka-shing is preparing to bid for a majority stake in British electricity grid operator National Grid Plc's gas distribution unit  the Financial Times reported on Thursday  citing people close to the talks.",
        "date": "09222016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "Li Ka-shing planning bid for stake in National Grid gas unit: FT "
    },
    {
        "content": "Sept 22 Hong Kong billionaire Li Ka-shing is preparing to bid for a majority stake in British electricity grid operator National Grid Plc's gas distribution unit  the Financial Times reported on Thursday  citing people close to the talks.",
        "date": "09222016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "Li Ka-shing planning bid for stake in National Grid gas unit-FT "
    },
    {
        "content": "LONDON  July 6 Shares in United Utilities   National Grid and Severn Trent rose to record highs on Wednesday  as investors continued to pile into dividend-yielding defensive stocks as a shield against volatile markets.",
        "date": "07062016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UK utility shares hit record highs as hunt for yield deepens "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 1-Britain could import as much as 93 pct of its gas by 2040 - National Grid "
    },
    {
        "content": "LONDON  July 5 Britain could rely on other countries for 93 percent of its gas supplies by 2040 if there is weak economic growth and not enough money available to support domestic gas production  National Grid said on Tuesday.",
        "date": "07042016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "Britain could import 93 pct of its gas by 2040 - National Grid "
    },
    {
        "content": "LONDON  June 17 British lawmakers called on Friday for the operation of the country's energy transmission network to be transferred from National Grid to an independent system operator  similar to the model used in the United States.",
        "date": "06162016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "British lawmakers call for power transmission network shake-up "
    },
    {
        "content": "June 8 Britain's energy market regulator Ofgem said that it was consulting on National Grid Plc's  request to recover the rising costs of two contracts for grid services that it agreed with SSE Plc and Drax Group Plc .",
        "date": "06082016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "CORRECTED-UPDATE 1-UK's Ofgem weighing up National Grid's cost recovery plea "
    },
    {
        "content": "June 8 Britain's energy market regulator Ofgem said that it was consulting on National Grid Plc's  request to recover the additional costs of two contracts for grid services that it agreed with SSE Plc and Drax Group Plc.",
        "date": "06082016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "CORRECTED-UK's Ofgem says it is consulting on National Grid's cost recovery plea "
    },
    {
        "content": "June 8 Britain's FTSE 100 index is seen opening down by 14 points  or 0.2 percent  on Wednesday  according to financial bookmakers  with futures down about 0.1 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "06082016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "UPDATE 2-UK Stocks-Factors to watch on June 8 "
    },
    {
        "content": "* National Grid pays 'aggregators' to cut industrial power use",
        "date": "05232016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "The power cutters shaking up Britain's energy market "
    },
    {
        "content": "* Gas distribution sales process to start end June/early July   (Adds CEO quote  background  share movement)",
        "date": "05192016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 1-National Grid profits rise  expects lower revenue from interconnectors "
    },
    {
        "content": "May 19 Britain's National Grid Plc said its full-year pretax profit rose 15 percent  aided by strong growth in its interconnectors and property businesses.",
        "date": "05192016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "National Grid's pretax profit rises 15 pct "
    },
    {
        "content": "LONDON  May 12 Britain's electricity regulator has launched a review into some electricity and gas transmission projects planned by grid operator National Grid.",
        "date": "05122016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 1-UK watchdog to review some gas and electricity transmission projects "
    },
    {
        "content": "LONDON  May 10 Nissan is to launch a trial this year to allow electric car owners in Britain to sell electricity back to the National Grid and potentially make money in the process.",
        "date": "05102016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "Nissan's electric cars in UK trial to sell surplus power "
    },
    {
        "content": "LONDON  May 12 Britain's electricity regulator has launched a review into the price controls set for electricity and gas transmission by grid operator National Grid .",
        "date": "05122016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "UK watchdog to review gas and electricity transmission price controls "
    },
    {
        "content": "April 1 Drax Group Plc said it expects core profit for 2016 to be towards the top end of market forecasts  after it signed a contract with National Grid Plc  to provide services that would help ensure British electricity transmission systems work reliably.",
        "date": "04012016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 1-Drax sees 2016 profit at top end of forecasts on National Grid deal "
    },
    {
        "content": "April 1 Power producer Drax Group Plc  said it expects to report core profit for 2016 towards the top end of the range of current market forecasts  after signing a year-long contract with National Grid Plc.",
        "date": "04012016",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "Drax sees 2016 profit at top end of forecasts on National Grid deal "
    },
    {
        "content": "* Britain grappling with potential power shortages   (Updates with details  comment)",
        "date": "01262016",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 1-Britain to pay companies  hospitals to cut power demand "
    },
    {
        "content": "Nov 27 Britain's National Grid requested a wind farm in Scotland to turn down power output by 30 megawatts between 0830 and 1000 GMT on Friday after high winds and a transmission line outage trapped too much supply in the local network.",
        "date": "11272015",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "CORRECTED-Britain's National Grid requests 30 MW less power supply for Scotland "
    },
    {
        "content": "* Energy network operator to focus on better-performing assets",
        "date": "11102015",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 3-National Grid to sell majority stake in British gas distribution business "
    },
    {
        "content": "Nov 10 Britain's National Grid Plc said it began a process for the potential sale of a majority stake in its UK gas distribution business.",
        "date": "11102015",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "National Grid to sell majority stake in UK gas unit "
    },
    {
        "content": "* Legal & General agrees 13 billion stg pension mandate with National Grid UK pension scheme",
        "date": "09112015",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "BRIEF-Legal & General agrees 13 bln stg pension mandate with UK's National Grid "
    },
    {
        "content": "* National Grid's property business has awarded a three year contract to BNP Paribas Real Estate",
        "date": "08172015",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "BRIEF-National Grid's property business inks contract with BNP Paribas Real Estate "
    },
    {
        "content": "NEW SHOREHAM  Rhode Island  July 27 Rhode Island's Deepwater Wind began installing the foundations for North America's first offshore wind farm on Monday  a milestone the company says could pave the way for an industry long established in Europe but still struggling with opposition in the United States.",
        "date": "07272015",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "UPDATE 1-Offshore wind power gets foothold in US with Rhode Island project "
    },
    {
        "content": "NEW SHOREHAM  Rhode Island Rhode Island's Deepwater Wind will start installing the foundations for North America's first offshore wind farm on Monday  a milestone the company says could pave the way for an industry long established in Europe but that is still struggling with opposition in the United States.",
        "date": "07272015",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "Offshore wind power gets foothold in U.S. with Rhode Island project "
    },
    {
        "content": "NEW SHOREHAM  Rhode Island  July 27 Rhode Island's Deepwater Wind will start installing the foundations for North America's first offshore wind farm on Monday  a milestone the company says could pave the way for an industry long established in Europe but that is still struggling with opposition in the United States.",
        "date": "07272015",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "Offshore wind power gets foothold in US with Rhode Island project "
    },
    {
        "content": "LONDON  July 15 Britain is facing the tightest winter power supplies in a decade mostly due to power plant closures  although measures have been taken to ensure electricity meets demand  National Grid said on Wednesday.",
        "date": "07152015",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "RPT-Britain faces tightest winter power supplies in decade -National Grid "
    },
    {
        "content": "LONDON  July 14 Britain's National Grid  has awarded contracts totalling 1.5 billion euros ($1.7 billion) to companies involved in building the first electricity link between Britain and Norway  it said on Tuesday.",
        "date": "07142015",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "National Grid awards contracts for Britain-Norway electricity link "
    },
    {
        "content": "LONDON  June 8 Belgium's Elia and Britain's National Grid have awarded two contracts jointly worth roughly 500 million euros ($558.35 million) to build the first power trade cable between Britain and Belgium to Siemens and a subsidiary of Sumitomo Electric Industries.",
        "date": "06082015",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "Operators award UK-Belgium power link contracts to Siemens  Sumitomo "
    },
    {
        "content": "LONDON  May 21 A place in Europe's energy market is vital for Britain  the head of National Grid said on Thursday  joining an increasing chorus of business leaders speaking out on the impact of a European Union referendum.",
        "date": "05212015",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "UPDATE 2-Access to EU energy market vital for UK - National Grid CEO "
    },
    {
        "content": "LONDON  May 21 Britain's gas and electricity network operator National Grid reported an 11 percent rise in annual pretax profit  allowing the company to pay shareholders a full-year dividend of 42.87 pence  up 2 percent year on year.",
        "date": "05212015",
        "name": "National Grid Transco PLC",
        "news_type": "normal",
        "symbol": "NGG",
        "title": "National Grid posts full-year profit rise "
    },
    {
        "content": "BRUSSELS  Jan 6 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01062015",
        "name": "National Grid Transco PLC",
        "news_type": "topStory",
        "symbol": "NGG",
        "title": "EU mergers and takeovers (Jan 6) "
    }
]