[
    {
        "content": "JERUSALEM  Nov 2 Israeli software provider Nice narrowed the range of its 2017 earnings estimate after topping third-quarter forecasts boosted by higher revenue in its omni-channel  cloud  analytics and artificial intelligence businesses.",
        "date": "11022017",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Israel's Nice tops Q3 estimates  tweaks 2017 profit forecast "
    },
    {
        "content": "LONDON  Nov 1 Britain's healthcare cost-effectiveness agency NICE  which decides if medicines should be used on the state health service   has decided Roche's immunotherapy drug Tecentriq is worth using to treat certain patients with bladder cancer.",
        "date": "11012017",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "UK's NICE gives Roche drug green light for bladder cancer "
    },
    {
        "content": "* ‍Q3 2017 total revenues increased 36.1% to $322.8 million compared to $237.2 million for Q3 of 2016​",
        "date": "11022017",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "BRIEF-Nice Ltd reports Q3 earnings per share of $0.42 "
    },
    {
        "content": "* Migdal Insurance & Financial Holdings Ltd reports 4.95 percent passive stake ​ in Nice Ltd as of Oct 26 - SEC filing Source text: (http://bit.ly/2lxaLhu) Further company coverage:",
        "date": "10312017",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "BRIEF-Migdal Insurance & Financial Holdings reports 4.95 pct passive stake ​ in Nice as of Oct 26 "
    },
    {
        "content": "LONDON  Aug 2 Britain's healthcare cost-effectiveness agency NICE has decided Roche's new immunotherapy drug Tecentriq is too expensive to justify its routine use to treat bladder cancer  but still hopes it can be used in certain circumstances.",
        "date": "08022017",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "UK finds Roche bladder cancer drug too costly for routine use "
    },
    {
        "content": "* Nice reports 35 pct growth in revenue for the first quarter 2017",
        "date": "05042017",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "BRIEF-Nice reports 35 pct growth in Q1 revenue "
    },
    {
        "content": "* Nice Ltd - San Francisco Department Of Emergency Management selects Nice for 9-1-1 center upgrade Source text for Eikon: Further company coverage:",
        "date": "04182017",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "BRIEF-Nice Ltd says selected for San Francisco Dept Of Emergency Management's 9-1-1 center upgrade "
    },
    {
        "content": "* Nice reports 10 percent growth in GAAP revenue and 11 percent growth in non-GAAP revenue for full year 2016",
        "date": "02162017",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "BRIEF-Nice reports Q4 non-GAAP earnings of $1.18/shr "
    },
    {
        "content": "* Nice announces pricing of offering of $250 000 000 of 1.25% exchangeable senior notes due 2024",
        "date": "01122017",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "BRIEF-Nice announces pricing of offering of $250 mln of 1.25% exchangeable senior notes due 2024 "
    },
    {
        "content": "* Nice LTD - Nice Systems intends to use a portion of net proceeds of offering to pay cost of exchangeable note hedge transactions",
        "date": "01102017",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "BRIEF-NICE announces proposed offering of $225 mln of exchangeable senior notes due 2024 "
    },
    {
        "content": " ",
        "date": "01102017",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "A "
    },
    {
        "content": "* Nice Ltd- Q4 and full year 2016 non-gaap revenue and non-GAAP earnings per share are expected to be at or above mid-point of company's previously announced guidance ranges",
        "date": "01102017",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "BRIEF-Nice Ltd- Q4  full year 2016 non-gaap revenue  non-gaap earnings per share are expected to be at or above mid-point of co's previously announced guidance ranges "
    },
    {
        "content": "* Israel's Nice Systems on Thursday reported an 11 percent rise in quarterly profit  with diluted earnings per share (EPS) of 83 cents excluding one-off items  versus 75 cents a year earlier.",
        "date": "11102016",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Nice Systems Q3 profit tops estimates  raises 2016 forecast "
    },
    {
        "content": "LONDON  Oct 13 Britain's healthcare cost agency NICE  which determines if medicines should be used in the state health system  plans to fast-track its recommendations for the most cost-effective new drugs.",
        "date": "10132016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "UK plans 'fast track' for most cost-effective new medicines "
    },
    {
        "content": "LONDON  Aug 9 Britain's cost-effectiveness agency NICE has recommended use of a virus-based melanoma drug from Amgen  reversing an earlier negative decision after the company provided further information.",
        "date": "08092016",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "In change of tack  UK agency backs Amgen virus-based cancer drug "
    },
    {
        "content": "PARIS Demand for air travel to France and Nice  the country's second most popular destination after Paris  has dropped again after an attacker killed 84 people in the city on the French Riviera on July 14  according to travel data analysis company ForwardKeys.",
        "date": "07282016",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Flight bookings for Nice and France drop again after July 14 attack: data firm "
    },
    {
        "content": "PARIS  July 28 Demand for air travel to France and Nice  the country's second most popular destination after Paris  has dropped again after an attacker killed 84 people in the city on the French Riviera on July 14  according to travel data analysis company ForwardKeys.",
        "date": "07282016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "Flight bookings for Nice and France drop again after July 14 attack-data firm "
    },
    {
        "content": "* Israel's Nice Systems on Thursday reported a 23 percent rise in quarterly profit  with diluted earnings per share (EPS) of 79 cents excluding one-off items  versus 64 cents a year earlier.",
        "date": "07282016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "Israel's Nice Systems Q2 profit  revenue top estimates "
    },
    {
        "content": "* Sees Q3 2016 revenue $234 million to $244 million  Source text for Eikon:  Further company coverage:",
        "date": "07282016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "BRIEF-Nice reports quarterly earnings per share of $0.42 "
    },
    {
        "content": "* Dollar at 3-wk high vs yen  sterling set for best ever wk vs yen",
        "date": "07152016",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "GLOBAL MARKETS-Stocks at 8-mth high  France attack subdues Europe "
    },
    {
        "content": "LONDON  June 16 Roche's two-drug combination of Cotellic and Zelboraf for melanoma was rejected by Britain's healthcare cost agency NICE as \"too expensive\" on Thursday  in contrast to the green light given in April to a rival cocktail from Novartis.",
        "date": "06162016",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Roche skin cancer drugs \"too expensive\"  says UK cost agency "
    },
    {
        "content": "JERUSALEM Israeli software provider Nice Systems  is to buy U.S.-based inContact   a maker of cloud software for call centers  for about $940 million.",
        "date": "05182016",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Software group Nice Systems to buy inContact for $940 million "
    },
    {
        "content": "JERUSALEM  May 18 Israeli software provider Nice Systems is to buy U.S.-based inContact  a maker of cloud software for call centres  for about $940 million.",
        "date": "05182016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "UPDATE 2-Software group Nice Systems to buy inContact for $940 mln "
    },
    {
        "content": "JERUSALEM  May 18 Israeli software provider Nice Systems said on Wednesday it was acquiring U.S.-based inContact  a leader in cloud contact center software  for about $940 million dollars.",
        "date": "05182016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "Israel's Nice Systems to buy inContact for $940 mln "
    },
    {
        "content": "* Nice acquires incontact; transaction values incontact at approximately $940 million",
        "date": "05182016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "BRIEF-NICE-Systems acquires inContact for about $940 million "
    },
    {
        "content": "* inContact to be acquired by NICE Systems for $14.00 per share in cash",
        "date": "05182016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "BRIEF-inContact to be acquired by NICE Systems for $14.00 per share in cash "
    },
    {
        "content": "TEL AVIV Israeli software provider Nice Systems  reported a higher than expected 17 percent rise in first-quarter net profit and raised its earnings forecast for 2016.",
        "date": "05052016",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Nice Systems first-quarter profit tops estimates  raises 2016 forecast "
    },
    {
        "content": "May 5 Nice-systems Ltd : * Nice systems announces departure of CFO Sarit Sagiv * Says company is in process of selecting a new CFO Source text for Eikon: Further company coverage:    ) ",
        "date": "05052016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "BRIEF-Nice-Systems announces departure of CFO Sarit Sagiv "
    },
    {
        "content": "LONDON  March 23 A new cystic fibrosis treatment from Vertex Pharmaceuticals has been rejected as too expensive by Britain's healthcare cost agency NICE.",
        "date": "03232016",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "UK cost agency says \"no\" to pricey Vertex cystic fibrosis drug "
    },
    {
        "content": "Feb 12 Amazon Web Services  the cloud computing arm of Amazon.com Inc   said it has acquired NICE  a software developer for technical computing.",
        "date": "02122016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "Amazon acquires Italy-based software firm "
    },
    {
        "content": "JERUSALEM  Feb 11 Israeli software provider Nice Systems reported a higher than expected 12 percent rise in fourth-quarter net profit and forecast further growth in 2016.",
        "date": "02112016",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Nice Systems Q4 profit tops estimates  sees better 2016 "
    },
    {
        "content": "JERUSALEM Israeli software provider Nice Systems on Monday agreed to buy analytics firm Nexidia for $135 million in cash to expand its growing analytics business.",
        "date": "01112016",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Nice Systems to buy analytics firm Nexidia for $135 million in cash "
    },
    {
        "content": "JERUSALEM  Jan 11 Israeli software provider Nice Systems on Monday agreed to buy analytics firm Nexidia for $135 million in cash to expand its growing analytics business.",
        "date": "01112016",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "Nice Systems to buy analytics firm Nexidia for $135 mln in cash "
    },
    {
        "content": "LONDON  Dec 11 Novartis's big new drug hope Entresto has been recommended for use in some patients with heart failure by Britain's cost agency NICE  which said on Friday it believed the treatment was a cost-effective option.",
        "date": "12112015",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "UK cost agency endorses Novartis heart drug for some patients "
    },
    {
        "content": "JERUSALEM  Oct 29 Israeli software provider Nice Systems reported a bigger than expected rise in third-quarter profit  boosted by higher sales  sending its shares up 7.5 percent.",
        "date": "10292015",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "UPDATE 1-Israel's Nice Systems beats Q3 profit forecast  raises 2015 earnings estimate "
    },
    {
        "content": "JERUSALEM  Oct 29 Israeli software provider Nice Systems reported a higher than expected rise in third-quarter profit  boosted by higher sales.",
        "date": "10292015",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "Nice Systems increases profit  raises 2015 earnings estimate "
    },
    {
        "content": "JERUSALEM Israeli software provider Nice Systems is selling its video surveillance technologies unit to private equity firm Battery Ventures for up to $100 million  its second divestment in three months as it focuses more on its analytics business.",
        "date": "08032015",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Israel's Nice Systems sells video surveillance unit for $100 million "
    },
    {
        "content": "JERUSALEM  Aug 3 Israeli software provider Nice Systems is selling its video surveillance technologies unit to private equity firm Battery Ventures for up to $100 million  its second divestment in three months as it focuses more on its analytics business.",
        "date": "08032015",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "Israel's Nice Systems sells video surveillance unit for $100 mln "
    },
    {
        "content": "JERUSALEM  July 30 Israeli software provider Nice Systems' second-quarter profit rose 21 percent  topping estimates  boosted by higher sales and cost-cutting measures.",
        "date": "07302015",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Israel's Nice Systems 2nd-qtr profit rises  raises EPS estimates "
    },
    {
        "content": "TEL AVIV  May 26 Israeli software provider Nice Systems is in talks to acquire chat software firm LivePerson  the Calcalist financial news website said on Tuesday.",
        "date": "05262015",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Israel's Nice Systems in talks to buy LivePerson -report "
    },
    {
        "content": "* Elbit shares up 1 pct  Nice down 0.8 pct   (Adds analyst's comments  share reaction)",
        "date": "05212015",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "UPDATE 1-Elbit Systems buys Nice's cyber unit for up to $158 mln "
    },
    {
        "content": "TEL AVIV  May 21 Israeli defence electronics firm Elbit Systems has  agreed to buy Nice Systems'  cyber and intelligence division for $157.9 million as it seeks to boost its presence in this fast-growing market.",
        "date": "05212015",
        "name": "NICE Ltd",
        "news_type": "normal",
        "symbol": "NICE",
        "title": "Elbit Systems buys Nice's cyber unit for up to $158 mln "
    },
    {
        "content": "JERUSALEM  May 7 Israeli software provider Nice Systems reported a 26 percent rise in quarterly profit that topped estimates  boosted by continued growth in its analytics products and cost-cutting measures.",
        "date": "05072015",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Israel's Nice Systems Q1 profit jumps  tops estimates "
    },
    {
        "content": "JERUSALEM  Feb 5 Israeli software provider Nice Systems reported a 36 percent rise in quarterly profit that beat estimates  driven by growth in its analytics applications.",
        "date": "02052015",
        "name": "NICE Ltd",
        "news_type": "topStory",
        "symbol": "NICE",
        "title": "Nice Q4 profit beats estimates  CFO to step down "
    }
]