[
    {
        "content": "* Foot Locker announces elevated customer experience platform in partnership with Nike Source text for Eikon: Further company coverage:",
        "date": "11172017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Foot Locker announces elevated customer experience platform in partnership with Nike "
    },
    {
        "content": "* ‍Board of directors has approved a quarterly cash dividend of $0.20 per share on company's outstanding class A and class B common stock​ Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike announces 11 percent increase in quarterly dividend "
    },
    {
        "content": "* Expects average ROIC in low 30 percent range over next 5 years",
        "date": "10252017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike expects average ROIC in low 30 percent range over next 5 years "
    },
    {
        "content": "* Expects earnings-per-share to grow in the mid-teens over the next five years ‍​",
        "date": "10252017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "BRIEF-Nike expects EPS to grow in the mid-teens over the next five years ‍​ "
    },
    {
        "content": "Nike Inc  said on Wednesday it expects earnings per share to grow in the mid-teens over the next five years  driven by online sales and new product categories  sending its shares up by about three percent.",
        "date": "10252017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike gives upbeat forecast at investor conference  shares rise "
    },
    {
        "content": "* Puma  Adidas taking U.S. market share from Nike (Adds details  background)",
        "date": "10182017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 1-Puma raises outlook for third time this year "
    },
    {
        "content": "Sept 27 Nike Inc's fight to claw back market share in an intensifying U.S. sneaker price war is still some way off bearing fruit  analysts said on Wednesday  a day after the sportswear giant reported its weakest quarterly sales growth in nearly seven years.",
        "date": "09272017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 1-Nike's road to recovery in North America likely a long one "
    },
    {
        "content": "* Dollar up 0.5 pct on Yellen's hawkish remarks  tax plan hopes",
        "date": "09272017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St set to open higher as Trump's tax plan awaited "
    },
    {
        "content": "The following are some of the factors that may move German stocks on Wednesday:",
        "date": "09272017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "German stocks - Factors to watch on September 27 "
    },
    {
        "content": "* Nike Inc recasts segment financials in connection with the consumer direct offense",
        "date": "09252017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike Inc recasts segment financials in connection with the consumer direct offense "
    },
    {
        "content": "Nike Inc  posted its slowest quarterly sales growth in nearly seven years in the face of intensifying competition from Adidas AG  and said it expects a further drop in revenue from North America.",
        "date": "09262017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike posts slowest quarterly sales growth in nearly 7 years "
    },
    {
        "content": "* Q1 EPS 57 cents vs. est. 48 cents (Adds details from conference call  updates shares)",
        "date": "09262017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Nike posts slowest quarterly sales growth in nearly 7 years "
    },
    {
        "content": "* Q1 earnings per share view $0.48 -- Thomson Reuters I/B/E/S",
        "date": "09262017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "BRIEF-Nike Inc Q1 earnings per share $0.57 "
    },
    {
        "content": "Sept 26 Nike Inc reported a 23.9 percent drop in quarterly profit as the world's largest footwear maker discounted heavily and spent more to expand its direct-to-consumer business.",
        "date": "09262017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike's quarterly profit drops 24 pct "
    },
    {
        "content": "A federal judge on Tuesday said Nike Inc's retail arm was not required to pay workers in California for the few seconds each day that they spent going through security checks  and tossed out a class action against the company.",
        "date": "09132017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Judge tosses workers' class action against Nike over security checks "
    },
    {
        "content": "Sept 1 Lululemon Athletica Inc is coming off two straight quarters of solid growth and is forging ahead with expansion plans that include a focus on menswear  a move that could breathe life into an ailing athleisure market.",
        "date": "09012017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Lululemon is leaning toward men to bolster growth "
    },
    {
        "content": "* Dow up 0.1 pct  S&P up 0.1 pct  Nasdaq down 0.1 pct (Updates close with latest volume)",
        "date": "08212017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-S&P 500 index gains after recent selloff; energy stocks fall "
    },
    {
        "content": "* Dow up 0.1 pct  S&P up 0.1 pct  Nasdaq down 0.1 pct (Updates to close)",
        "date": "08212017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-S&P 500 gains after two days of declines; energy falls "
    },
    {
        "content": "* All three indexes below their 50-day moving avg (Adds details  changes comment  updates prices)",
        "date": "08212017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St edges lower  led by tech and financial stocks "
    },
    {
        "content": "Aug 18 Shares of sporting goods retailers were pummeled in early trading on Friday as dismal quarterly results from Hibbett and Foot Locker heightened investor concerns about a supply glut intensifying price wars in the industry.",
        "date": "08182017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Footwear retailers trampled as price war sparks concerns "
    },
    {
        "content": "* Nike Inc declares $0.18 quarterly dividend Source text for Eikon: Further company coverage:",
        "date": "08102017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike declares $0.18 quarterly dividend "
    },
    {
        "content": "* On conf call- traffic still remains slightly negative in the quarter  an improvement in traffic was the driver of improved performance in sales",
        "date": "08102017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "BRIEF-Kohl's conf call- Q2 inventory per store decreased 2 pct "
    },
    {
        "content": "BERLIN Adidas  will pour more cash into marketing to try to stay ahead in the race with U.S. rivals Nike  and Under Armour   the German sportswear firm said on Thursday as it reported another quarter of bumper sales growth. | Video ",
        "date": "08032017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Adidas powers ahead in North America and China "
    },
    {
        "content": "BERLIN  Aug 3 Adidas will pour more cash into marketing to try to stay ahead in the race with U.S. rivals Nike and Under Armour  the German sportswear firm said on Thursday as it reported another quarter of bumper sales growth.",
        "date": "08032017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Adidas powers ahead in North America and China "
    },
    {
        "content": "FRANKFURT German sportswear company Puma plans to keep spending to sign up top athletes and celebrities after its flagship star Usain Bolt retires  seeking to bolster a brand that lags market leaders Nike and Adidas.",
        "date": "07262017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Puma to keep up spending on new stars in post-Bolt era "
    },
    {
        "content": "* Says CEO Mark Parker's fiscal year 2017 total compensation was $13.9 million versus $47.6 million in fiscal year 2016 - SEC filing",
        "date": "07252017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike CEO Mark Parker's 2017 total compensation $13.9 mln vs $47.6 mln in 2016 - SEC filing "
    },
    {
        "content": "* Demand for new shoe models boosts margins (Recasts  adds CEO comments  further details on results)",
        "date": "07262017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 1-Puma to keep up spending on new stars in post-Bolt era "
    },
    {
        "content": "FRANKFURT  July 26 German sportswear firm Puma plans to keep spending on marketing and on winning endorsements from star athletes  its chief executive said  seeking to revive a brand that still lags market leaders Nike and Adidas.",
        "date": "07262017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Puma to keep spending on marketing to revive brand - CEO "
    },
    {
        "content": "* Shares rise as much as 8.6 percent (Adds detail  Ashley quote  analyst comment  updates shares)",
        "date": "07202017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 3-Sports Direct's optimism after profit slump propels shares "
    },
    {
        "content": "* Nike  Inc. Announces Monique Matheson as new evp  global human resources",
        "date": "07182017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike Inc appoints Monique Matheson as new EVP  global human resources "
    },
    {
        "content": "* Nike Inc chairman emeritus Philip Knight reports acquisition of 1.8 million shares of co's class a common convertible on July 5 - SEC filing",
        "date": "07072017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike's Philip Knight reports acquisition co's stock as a result of a private pro rata distribution from Swoosh "
    },
    {
        "content": "LONDON Nike  the world's largest footwear maker  have signed a multi-year agreement to become Premier League club Tottenham Hotspur’s official kit supplier from next season.",
        "date": "07012017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike in multi-year deal to supply Tottenham kit "
    },
    {
        "content": "LONDON  July 1 Nike  the world's largest footwear maker  have signed a multi-year agreement to become Premier League club Tottenham Hotspur’s official kit supplier from next season.",
        "date": "07012017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Soccer-Nike in multi-year deal to supply Tottenham kit "
    },
    {
        "content": "NEW YORK Oil rose for a seventh straight session on Friday on a declining U.S. rig count and stronger demand data from China  while U.S. equities mostly rebounded to end a volatile week on an up-beat  helped by a double-digit jump in Nike shares.",
        "date": "06302017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Oil rises for seventh session  U.S. stocks rebound "
    },
    {
        "content": "NEW YORK  June 30 Oil rose for a seventh straight session on Friday on a declining U.S. rig count and stronger demand data from China  while U.S. equities rebounded and were set to end a volatile week on an up-beat  helped by a double-digit jump in Nike shares.",
        "date": "06302017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "GLOBAL MARKETS-Oil rises for seventh session  U.S. stocks rebound "
    },
    {
        "content": "* Indexes up: Dow 0.44 pct  S&P 0.35 pct  Nasdaq 0.21 pct (Updates to late afternoon)",
        "date": "06302017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St ending bumpy week  solid first half on high note "
    },
    {
        "content": "Nike's pilot program to sell certain products on Amazon and Instagram is a precursor to it forging a deeper relationship with online retailers  and could hit sales at sporting goods retailers such as Foot Locker Inc .",
        "date": "06302017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike-Amazon deal may hurt sporting goods retailers: analysts "
    },
    {
        "content": "June 30 Nike's pilot program to sell certain products on Amazon and Instagram is a precursor to it forging a deeper relationship with online retailers  and could hit sales at sporting goods retailers such as Foot Locker Inc.",
        "date": "06302017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike-Amazon deal may hurt sporting goods retailers - analysts "
    },
    {
        "content": "* Shares up 8.2 pct at $57.54 in after-market trade (Adds details  background; updates shares)",
        "date": "06292017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 2-Nike to launch pilot program with Amazon; results top estimates "
    },
    {
        "content": "* S&P tech sector on track to post biggest weekly drop in 6 mths",
        "date": "06302017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Nike lifts S&P  Dow; biotechs limit gains on Nasdaq "
    },
    {
        "content": "Nike Inc   the world's largest footwear maker  said on Thursday it would launch a pilot program with Amazon.com Inc  to sell a limited product assortment on its website.",
        "date": "06292017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike to launch pilot program with Amazon; results top estimates "
    },
    {
        "content": "* S&P tech sector on track to post biggest weekly drop in 6 mths",
        "date": "06302017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Nike lifts Dow  S&P; tech stocks weigh on Nasdaq "
    },
    {
        "content": "Wall Street fell sharply on Thursday  with the S&P 500 and the Dow industrials suffering their worst daily percentage drops in about six weeks  as a recent decline in technology shares deepened and outweighed strength in bank shares. | Video ",
        "date": "06292017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Wall Street hit hard as tech softness continues "
    },
    {
        "content": "June 29 Nike Inc  the world's No. 1 footwear maker  reported quarterly revenue that beat analysts' estimates  helped by higher demand in Western Europe  China and emerging markets.",
        "date": "06292017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike posts higher-than-expected quarterly revenue "
    },
    {
        "content": "Nike Inc's  shares rose as much as 2 percent after Goldman Sachs said the world's biggest sportswear maker could be close to selling directly on Amazon.com Inc   raising competition for brick-and-mortar sporting goods retailers.",
        "date": "06212017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike close to selling directly on Amazon: Goldman Sachs "
    },
    {
        "content": "June 21 Nike Inc's shares rose as much as 2 percent after Goldman Sachs said the world's biggest sportswear maker could be close to selling directly on Amazon.com Inc  raising competition for brick-and-mortar sporting goods retailers.",
        "date": "06212017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike close to selling directly on Amazon - Goldman Sachs "
    },
    {
        "content": "BERLIN  June 16 Zalando wants to double in size by 2020  it's co-chief executive said on Friday  as Europe's biggest pure online fashion retailer announced new partnerships with Nike  H&M Weekday brand and the Bestseller group.",
        "date": "06162017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Zalando seeks to double revenue by 2020 "
    },
    {
        "content": "Nike Inc  said on Thursday it would cut about 2 percent of its global workforce and eliminate a quarter of its shoe styles as it looks to become nimbler in the face of intensifying competition and fast-changing consumer trends. | Video ",
        "date": "06152017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike to cut 2 percent of workforce  eliminate shoe styles "
    },
    {
        "content": "* Shares down 2.7 pct  biggest pct loser on Dow (Adds details  background)",
        "date": "06152017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Nike to cut 2 pct of workforce  eliminate shoe styles "
    },
    {
        "content": "June 15 Nike Inc said on Thursday it would cut about 2 percent of its global workforce as part of efforts to simplify its organizational structure  that will bring down its business segments to four from six.",
        "date": "06152017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike to cut 2 pct of workforce  simplify organizational structure "
    },
    {
        "content": "BRUSSELS EU antitrust regulators will investigate whether Nike   Comcast's  Universal Studios and Hello Kitty owner Sanrio  illegally block some cross-border sales or ban certain online retailers from selling their products.",
        "date": "06142017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike  Sanrio  Universal Studios face EU probe over online sales "
    },
    {
        "content": "* Nike Inc - ‍introduced consumer direct offense  a new company alignment that allows nike to better serve consumer personally  at scale​",
        "date": "06152017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "BRIEF-Nike says ‍introduced consumer direct offense  a company alignment that allows to better serve consumer personally "
    },
    {
        "content": "* Follows on heels of probe into consumer electronics makers (Adds Nike comment  no immediate response from Universal Studios and Sanrio)",
        "date": "06142017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Nike  Sanrio  Universal Studios face EU probe over online sales "
    },
    {
        "content": "BRUSSELS  June 14 EU antitrust regulators opened an investigation on Wednesday into U.S. footwear maker Nike   Comcast's Universal Studios and Hello Kitty owner Sanrio to see if the companies are illegally blocking online sales in the bloc.",
        "date": "06142017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "EU to investigate Nike  Sanrio  Universal Studios over licensing practices "
    },
    {
        "content": "LAS VEGAS  May 18 Hedge fund Hoplite Capital Management's John Lykouretzos on Thursday pitched Nike Inc as a favorite long position  saying that its stock price could double within three years amid strong international growth.",
        "date": "05182017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Hedge fund Hoplite pitches Nike as long bet  sees shares doubling "
    },
    {
        "content": "* Sets quarterly dividend of $0.18per share Source text for Eikon: Further company coverage:",
        "date": "05112017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike declares $0.18 quarterly dividend "
    },
    {
        "content": "* On conf call- pleased with Q1  performance in active apparel and dress business  these improvements bode well for the balance of 2017",
        "date": "05122017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-J C Penney CEO -\"Have no great optimism we'll be able to swing overall apparel to positive (in 2017)\" "
    },
    {
        "content": "* AIK FOTBOLL STARTS NEW COOPERATION WITH NIKE FROM 2018 Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "05092017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-AIK Fotboll starts new cooperation with Nike from 2018 "
    },
    {
        "content": "BERLIN Shares in Adidas  rose to a record high on Thursday after the German sportswear firm reported a bigger than expected increase in first-quarter sales and profits  outpacing rival Nike  in North America and China and growing fast online. | Video ",
        "date": "05042017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Adidas outpaces Nike in North America and China "
    },
    {
        "content": "* Shares up 2 pct  top DAX gainer (Adds details from CEO conference call)",
        "date": "05042017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Adidas outpaces Nike in North America and China "
    },
    {
        "content": "* Nike Inc - board of directors approved amendments to company's third restated bylaws  effective April 20  2017  to implement proxy access - SEC filing",
        "date": "04242017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike says board approved amendments to company's third restated bylaws "
    },
    {
        "content": "April 19 A pregnant Serena Williams makes the tennis superstar even more attractive to corporate sponsors  allowing her to extend her reach into maternity wear and motherhood products  sponsorship industry executives said.",
        "date": "04192017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Serena Williams pregnancy likely to boost sponsorship -industry experts "
    },
    {
        "content": "LONDON World number two Rory McIlroy has signed a long-term extension to his contract with Nike ahead of this week's U.S. Masters at Augusta National.",
        "date": "04032017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "McIlroy agrees new long-term deal with Nike "
    },
    {
        "content": "LONDON  April 3 World number two Rory McIlroy has signed a long-term extension to his contract with Nike ahead of this week's U.S. Masters at Augusta National.",
        "date": "04032017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Golf-McIlroy agrees new long-term deal with Nike "
    },
    {
        "content": "* Dow down 0.12 pct  S&P flat  Nasdaq up 0.16 pct   (Updates to open)",
        "date": "03222017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "US STOCKS-S&P  Nasdaq little changed; Dow dragged down by Nike "
    },
    {
        "content": "March 22 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "03222017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "PRESS DIGEST - Wall Street Journal - March 22 "
    },
    {
        "content": "BERLIN  March 20 Adidas has been testing a store where shoppers can design a sweater  have a body scan to determine fit and get it knitted by a state-of-the-art machine within hours  as the German company looks at ways to respond more quickly to customer demands.",
        "date": "03202017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Adidas takes the sweat out of sweater shopping with in-store machine "
    },
    {
        "content": "Nike Inc  reported lower-than-expected quarterly revenue on Tuesday as the world's largest footwear maker battles for market share in North America with a resurgent Adidas AG and a fast-growing Under Armour Inc.",
        "date": "03212017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike's revenue misses estimates as rivals gain ground "
    },
    {
        "content": "March 21 Nike Inc reported lower-than-expected quarterly revenue on Tuesday as the world's largest footwear maker battles for market share in North America with a resurgent Adidas AG and a fast-growing Under Armour Inc.",
        "date": "03212017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Nike's revenue misses estimates as rivals gain ground "
    },
    {
        "content": "March 21 Nike Inc  the world's largest footwear maker  reported lower-than-expected quarterly revenue on Tuesday amid intense competition from a resurgent Adidas AG  and Under Armour Inc in North America.",
        "date": "03212017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike reports lower-than-expected quarterly revenue "
    },
    {
        "content": "* Futures up: Dow 10 pts  S&P 3.5 pts  Nasdaq 10.25 pts   (Adds details  comment  updates prices)",
        "date": "03212017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St set to open higher  tracking European markets "
    },
    {
        "content": "SHANGHAI China's annual consumer rights day television show turned its spotlight on U.S. sports brand Nike Inc  for misleading advertising and Japanese brand Muji for selling food products allegedly sourced from part of Japan affected by radiation. | Video ",
        "date": "03162017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "China consumer day show skewers Nike shoes  Muji foods "
    },
    {
        "content": "* Consumer say impact likely short-lived   (Adds Muji  Chinese Foreign Ministry comment)",
        "date": "03162017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 4-China consumer day show skewers Nike shoes  Muji foods "
    },
    {
        "content": "BERLIN  March 14 Adidas set a target on Tuesday for sales in North America to rise by almost half by 2020  predicting strong demand will continue for fashion sneakers after its retro Superstar was the top selling shoe in the U.S. market in 2016.",
        "date": "03142017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Adidas banks on sports as lifestyle to drive U.S. sales "
    },
    {
        "content": "March 8 Nike Inc will launch a hijab for female Muslim athletes early next year  becoming the first major sports apparel maker to offer a traditional Islamic head scarf designed specifically for competition  the company said on Wednesday.",
        "date": "03082017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike to launch high-tech hijab for female Muslim athletes "
    },
    {
        "content": "HERZOGENAURACH  Germany The new boss of Adidas  increased sales and profit targets on Wednesday  sending shares in the German sportswear firm to a record high as he pledged to keep investing heavily in the key U.S. market and do more to boost e-commerce sales. | Video ",
        "date": "03082017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Adidas U.S. push keeps up pressure on Nike  Under Armour "
    },
    {
        "content": "* New CEO says more work to be done in United States   (Adds details from news conference)",
        "date": "03082017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Adidas U.S. push keeps up pressure on Nike  Under Armour "
    },
    {
        "content": "* Nike declares $0.18 quarterly dividend  Source text for Eikon:  Further company coverage:",
        "date": "02162017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike declares $0.18 quarterly dividend "
    },
    {
        "content": "Jan 25 Tiger Woods will return to the PGA Tour this week as a member of the TaylorMade stable after announcing on Wednesday that he had made the switch after years of using Nike equipment.",
        "date": "01252017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Golf-Woods now a TaylorMade man "
    },
    {
        "content": "* Perry Ellis international enters into distribution agreements for Nike Swim in Latin America",
        "date": "01202017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Perry Ellis International enters into distribution agreements for Nike Swim in Latin America "
    },
    {
        "content": "* Nike Vision - Kevin Durant is teaming up with Nike Vision for collaborative line of optical eyewear  Source text for Eikon:  Further company coverage:",
        "date": "01172017",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike Vision teams up with Kevin Durant for collaborative line of optical eyewear "
    },
    {
        "content": "Jan 17 Department store operator J.C. Penney Co Inc said on Tuesday it would open Nike Inc  outlets in more than 600 of its stores to tap into the high demand for activewear and athletic shoes.",
        "date": "01172017",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "J.C. Penney to open Nike outlets in more than 600 stores "
    },
    {
        "content": "Nike Inc   the world's largest footwear maker  reported better-than-expected quarterly revenue and profit  and indicated a rebound in its basketball category.",
        "date": "12202016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike revenue beats; sees rebound in basketball category "
    },
    {
        "content": "* Nike Inc announces 13 percent increase in quarterly dividend",
        "date": "11172016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike announces 13 pct increase in quarterly dividend "
    },
    {
        "content": "* Strong U.S. sales in last 8-10 weeks - CEO   (Adds comments by CEO  share price reaction)",
        "date": "11102016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Puma sees year profits hitting top end of targeted range "
    },
    {
        "content": "* Company still pursuing higher bids   (Recasts  adds comments from former chairman  time frame for sale)",
        "date": "10312016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Ex-chairman eyes bid for bankruptcy-hit Performance Sports "
    },
    {
        "content": "* Apple says 'Apple Watch Nike+' will be available Friday  October 28",
        "date": "10242016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Apple says 'Apple Watch Nike+' will be available Friday  Oct. 28 "
    },
    {
        "content": "* files for potential two-part dollar-denominated notes offering; size undisclosed - SEC filing  Source text for Eikon: (http://bit.ly/2ehkiRO) Further company coverage:",
        "date": "10182016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike files for potential two-part dollar-denominated notes offering "
    },
    {
        "content": "LONDON Chelsea announced on Thursday a long-term partnership with Nike from next year in a deal that media reports suggested could be worth 60 million pounds ($74.61 million) a season.",
        "date": "10132016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Chelsea agree long-term kit deal with Nike "
    },
    {
        "content": "Oct 13 Nike Inc said on Thursday it signed a long-term deal with top English football club Chelsea FC  becoming its official kit supplier from the 2017-18 season.",
        "date": "10132016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike to become official kit supplier of Chelsea FC "
    },
    {
        "content": "* Chelsea Football Club announces new technical partnership with Nike",
        "date": "10132016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "BRIEF-Nike to be official kit supplier to Chelsea FC from 2017/18 season "
    },
    {
        "content": "* Signs collective labour agreement with Tek-Gida labour union",
        "date": "10052016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Coca-Cola Icecek signs collective labour agreement "
    },
    {
        "content": "* To stop giving futures orders in earnings release   (Adds analyst comment)",
        "date": "09272016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 3-Nike orders miss estimates as competition heats up "
    },
    {
        "content": "* Q1 earnings per share view $0.56 -- Thomson Reuters I/B/E/S",
        "date": "09272016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "BRIEF-Nike Q1 earnings per share $0.73 "
    },
    {
        "content": "Sept 27 Nike Inc forecast future orders below analysts' estimate on a constant currency basis  in part due to weakness in its basketball category and increased competition from rival Adidas  which has continued to gain ground in North America.",
        "date": "09272016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike's forecast for future orders misses estimate "
    },
    {
        "content": "* Has signed an agreement with Niké  Slovakian operator  for integration of GIG's iGaming cloud (IGC) platform",
        "date": "09082016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Gaming Innovation Group signs deal with Slovakian operator "
    },
    {
        "content": "By Robert Iafolla A federal judge has certified a class action accusing a Nike Inc subsidiary of violating California law by not paying workers for time spent waiting for security checks whenever they want to leave a store.",
        "date": "08232016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Federal judge certifies class in security check lawsuit against Nike "
    },
    {
        "content": "TORONTO/NEW YORK  Aug 24 The former chairman of Performance Sports Group Ltd  Graeme Roustan  told Reuters he has hired investment banks Jefferies Group LLC and Canaccord Genuity to explore a possible bid for the troubled maker of hockey gear.",
        "date": "08242016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Performance Sports ex-chairman may bid for hockey-gear maker "
    },
    {
        "content": "* Affiliates of Apollo Global Management and Nike Inc announce strategic partnership for apparel manufacturing in the Americas",
        "date": "08182016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike  Apollo Global in partnership for apparel manufacturing "
    },
    {
        "content": "* Soros fund management cuts share stake in abbott laboratories by 21.5% to 0.33 million shares",
        "date": "08152016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Soros fund management cuts stake in Amazon  dissolves Qualcomm  Nike "
    },
    {
        "content": "* Nike Inc declares $0.16 quarterly dividend  Source text for Eikon:  Further company coverage:",
        "date": "08112016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike declares $0.16 quarterly dividend "
    },
    {
        "content": "SAN FRANCISCO Nike has top billing among sports brands at the Rio Olympics  but a week into the Games  its stock is losing to Adidas and Under Armour .",
        "date": "08122016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike's stock falls behind rivals amid Rio Olympics "
    },
    {
        "content": "SAN FRANCISCO  Aug 12 Nike has top billing among sports brands at the Rio Olympics  but a week into the Games  its stock is losing to Adidas and Under Armour.",
        "date": "08122016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 1-Nike's stock falls behind rivals amid Rio Olympics "
    },
    {
        "content": "SAN FRANCISCO  Aug 12 Nike has top billing among sports brands at the Rio Olympics  but a week into the games  its stock is losing to Adidas and Under Armour.",
        "date": "08122016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike's stock falls behind rivals at Rio Olympics "
    },
    {
        "content": "LONDON  Aug 10 Adidas will open a new factory near Atlanta in 2017  largely operated by robots  part of a drive to shift production closer to customers and counter rising wages in Asia and lengthy shipping times.",
        "date": "08102016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Adidas to open shoe factory in Atlanta in 2017 "
    },
    {
        "content": "* Reaches agreement with Tek-Gida labor union on collective labor agreement",
        "date": "08082016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Coca-Cola Icecek reaches agreement with labor union on collective labor agreement "
    },
    {
        "content": "Aug 3 Nike Inc  the world's biggest sportswear maker  said it would stop selling golf equipment  including clubs  golf balls and bags.",
        "date": "08032016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike to exit golf equipment business "
    },
    {
        "content": "* Also announced that it will open its first digital studio in NYC  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08022016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike launches new Nike+ app "
    },
    {
        "content": "* Nike golf will transition out of equipment - including clubs  balls and bags",
        "date": "08032016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "BRIEF-Nike to transition out of making golf equipment "
    },
    {
        "content": "BERLIN  July 27 German sportswear firm Puma  wants to forge even closer ties with Usain Bolt  the highest profile athlete it sponsors  if the Jamaican sprinter retires after the Rio Olympics  predicting he could be just as valuable off the track.",
        "date": "07272016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Puma expects even closer ties if Usain Bolt retires "
    },
    {
        "content": "* Says CFO Andrew Campion FY 2016 total compensation $4.8 million - SEC filing",
        "date": "07252016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike's CEO FY 2016 total compensation $47.6 mln "
    },
    {
        "content": "* Lesnard succeeds Patrick Seehafer who will become VP  Europe merchandising",
        "date": "07182016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike announces Steve Lesnard VP  GM of global running "
    },
    {
        "content": "* Files for debt shelf offering; size not disclosed  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07212016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike files for debt shelf offering "
    },
    {
        "content": "BERLIN Nike Inc  expects sales growth to recover in North America after a weak March-May quarter  helped by the upcoming Olympics  an expansion of its basketball business and clearing excess stock  brand chief Trevor Edwards told Reuters.",
        "date": "07212016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike optimistic for sales rebound in North America "
    },
    {
        "content": "BERLIN  July 21 Nike Inc expects sales growth to recover in North America after a weak March-May quarter  helped by the upcoming Olympics  an expansion of its basketball business and clearing excess stock  brand chief Trevor Edwards told Reuters.",
        "date": "07212016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "INTERVIEW-Nike optimistic for sales rebound in North America "
    },
    {
        "content": "* Nike  Inc. And Phil Knight complete planned chairman succession",
        "date": "06302016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike appoints Tim Cook as lead independent director of Board "
    },
    {
        "content": "June 29 Against a backdrop of the iconic five rings  legendary swimmer Michael Phelps sat on a United States Olympic Committee stage at a March media event in Los Angeles  telling reporters why he had arrived fashionably late.",
        "date": "06302016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "RPT-INSIGHT-Under Armour leads Olympic marketing shake-up after \"rule 40\" changes "
    },
    {
        "content": "BERLIN Adidas  has agreed to expand its partnership with Kanye West  including opening new stores  hoping to build on its higher profile in the U.S. market since it poached the singer-turned-designer from Nike  in 2013. | Video ",
        "date": "06292016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Adidas strikes new deal with Kanye West in U.S. market push "
    },
    {
        "content": "June 29 Against a backdrop of the iconic five rings  legendary swimmer Michael Phelps sat on a United States Olympic Committee stage at a March media event in Los Angeles  telling reporters why he had arrived fashionably late.",
        "date": "06292016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "RPT-INSIGHT-Under Armour leads Olympic marketing shake-up after \"rule 40\" changes "
    },
    {
        "content": "Against a backdrop of the iconic five rings  legendary swimmer Michael Phelps sat on a United States Olympic Committee stage at a March media event in Los Angeles  telling reporters why he had arrived fashionably late.",
        "date": "06292016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Under Armour leads Olympic marketing shake-up after 'rule 40' changes "
    },
    {
        "content": "June 29Against a backdrop of the iconic five rings  legendary swimmer Michael Phelps sat on a United States Olympic Committee stage at a March media event in Los Angeles  telling reporters why he had arrived fashionably late.",
        "date": "06292016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "INSIGHT-Under Armour leads Olympic marketing shake-up after \"rule 40\" changes "
    },
    {
        "content": "* Looking ahead to Q1 will continue to clear excess inventory through factory stores and select third party value channels - conf call",
        "date": "06282016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike expects FY 2017 outlook largely in line with prior guidance "
    },
    {
        "content": "BERLIN  June 29 Adidas has agreed a new long-term partnership with singer-turned-designer Kanye West  who the German sportswear firm poached from arch rival Nike in 2013  helping to revive its business in the U.S. market.",
        "date": "06292016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Adidas agrees new long-term partnership with Kanye West "
    },
    {
        "content": "Nike Inc's  quarterly revenue growth and its forecast for future orders missed analysts' estimates  underscoring the sportswear maker's struggle to fend off competition from Adidas and others  especially in its home turf of North America.",
        "date": "06282016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike sales  forecast disappoint as Adidas gains ground "
    },
    {
        "content": "* Q4 earnings per share view $0.48 -- Thomson Reuters I/B/E/S",
        "date": "06282016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "BRIEF-Nike reports Q4 earnings per share $0.49 "
    },
    {
        "content": "June 28 Nike Inc  the world's largest footwear maker  reported quarterly revenue that missed analysts' estimates as a strong dollar ate into sales from some of its overseas markets.",
        "date": "06282016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike quarterly sales rise less than expected "
    },
    {
        "content": "* Adidas CEO prepares to hand over to successor   (Writes through with quotes)",
        "date": "06162016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 1-Adidas says soccer investment bringing rewards "
    },
    {
        "content": "PARIS  June 16 Adidas expects sales of soccer boots  shirts and balls to rise 14 percent to a new record of 2.5 billion euros  ($2.8 billion) in 2016  helped by reclaiming leadership of top European markets for soccer footwear from arch rival Nike.",
        "date": "06162016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "REFILE-Adidas says beating Nike in Europe soccer boots battle "
    },
    {
        "content": "* Craig Zanon has been named VP  GM of Nike global basketball  replacing Michael Jackson who has resigned from Nike  Source text for Eikon:  Further company coverage:",
        "date": "06142016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike names Craig Zanon VP  GM of Nike global basketball "
    },
    {
        "content": "June 9 Under Armour Inc said Dave Dombrow would return as the sportswear maker's chief design officer  three months after he left with plans to join bigger rival Nike Inc.",
        "date": "06092016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Dave Dombrow to return to Under Armour as design chief "
    },
    {
        "content": "LONDON  June 8 The career of Russian former world number one Maria Sharapova was in tatters on Wednesday after she was given a two-year ban by the International Tennis Federation (ITF) following her positive test for the banned drug meldonium.",
        "date": "06082016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 5-Tennis-Sharapova banned for two years by ITF "
    },
    {
        "content": "BERLIN A battle between Adidas and Nike for dominance of the global soccer gear market is driving a steep rise in sponsorship payments to elite clubs - and cutting into the two manufacturers' profits.",
        "date": "06042016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Winner takes all in mega soccer shirt deals "
    },
    {
        "content": "MADRID Barcelona have agreed an extension to their kit-manufacturing deal with Nike which Spanish media reported was the most lucrative arrangement of its kind in the world.    The Spanish champions issued a statement saying details of the contract will be specified at their next general assembly.    Barcelona-based daily newspapers Diario Sport and Mundo Deportivo reported that the deal could be worth 155 million euros ($174 million) a season and would run until 2026.",
        "date": "05212016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Barcelona agrees to kit deal extension with Nike "
    },
    {
        "content": "MADRID  May 21 Barcelona have agreed an extension to their kit-manufacturing deal with Nike which Spanish media reported was the most lucrative arrangement of its kind in the world.",
        "date": "05212016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Soccer-Barcelona agree kit deal extension with Nike "
    },
    {
        "content": "* Nike said to agree to $87 million apparel deal with Chelsea- Bloomberg  citing sources",
        "date": "05182016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike said to agree to $87 million apparel deal with Chelsea- Bloomberg "
    },
    {
        "content": "* Says has declared a quarterly cash dividend of $0.16 per share on company's outstanding Class A and Class B common stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05132016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike declares $0.16 qtrly dividend "
    },
    {
        "content": "May 11 Full-time U.S. employees of Nike Inc.  who are new parents or who are needed to care for sick family members are now eligible to receive eight weeks of paid leave  the world's biggest sportswear company said on Wednesday.",
        "date": "05112016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike expands  adds to its paid family leave "
    },
    {
        "content": "Sept 28 Nike Inc  the world's No. 1 footwear maker  will  continue to dominate the sportswear market despite intensifying competition in North America  analysts said on Wednesday  a day after the company reported \"futures orders\" below estimates.",
        "date": "09282016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike seen on track for long-run growth despite tough competition "
    },
    {
        "content": "* Nike Inc Says  Recommends That Shareholders Reject \"Mini tender\" offer",
        "date": "04262016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike Inc recommends shareholders to reject \"mini-tender\" offer "
    },
    {
        "content": "* Says Elliott Hill  president of geographies and sales  will become president of geographies and integrated marketplace",
        "date": "04212016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "BRIEF-Nike announces strategic management changes "
    },
    {
        "content": "Nike Inc   the world's largest footwear maker  reported quarterly revenue that missed analysts' estimates as a strong dollar hurt sales from some of its overseas markets. | Video ",
        "date": "03232016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike's revenue misses as strong dollar weighs "
    },
    {
        "content": "* Expects currency neutral revenue to grow in the high single to low double-digit percentage range in FY 2017- Conf call",
        "date": "03222016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Nike expects reported revenue to grow at a high single digit rate in FY 2017 - Conf call "
    },
    {
        "content": "* Shares fall as much as 6 pct   (Adds details  background  analyst comment; updates shares)",
        "date": "03222016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Nike's revenue misses as strong dollar weighs "
    },
    {
        "content": "* Qtrly gross margin was 45.9 percent  flat compared to prior year",
        "date": "03222016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "BRIEF-Nike reports Q3 earnings per share $0.55 "
    },
    {
        "content": "March 22 Nike Inc  the world's largest footwear maker  reported a 7.6 percent rise in quarterly sales  helped by strong demand for its running and basketball footwear  and athletic apparel.",
        "date": "03222016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike quarterly sales rise 7.6 pct "
    },
    {
        "content": "LOS ANGELES Russian tennis star Maria Sharapova said on Monday she had failed a drug test at the Australian Open due to a substance she was taking for health issues  leading longtime sponsor Nike to announce it was suspending ties during the investigation. | Video ",
        "date": "03082016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Sharapova fails drug test  Nike suspends ties "
    },
    {
        "content": "* Sponsor Nike suspends ties with Sharapova   (Recasts lead with Nike suspending ties  adds details from statement)",
        "date": "03082016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 8-Tennis-Sharapova fails drug test  Nike suspends ties "
    },
    {
        "content": "* Reaches agreement with Tek-Gida labour union on collective labour agreement",
        "date": "02222016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Turk Tuborg reaches agreement with Tek-Gida on collective labour agreement "
    },
    {
        "content": "Nike Inc  the world's largest sportswear maker  said it had ended its contract with Manny Pacquiao after the Filipino boxer described gays as \"worse than animals\".",
        "date": "02172016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike drops boxer Manny Pacquiao after anti-gay comments "
    },
    {
        "content": "Feb 18 Nike Inc  the world's largest sportswear maker  said it had ended its contract with Manny Pacquiao after the Filipino boxer described gays as \"worse than animals\".",
        "date": "02182016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike drops boxer Manny Pacquiao after anti-gay comments "
    },
    {
        "content": "The U.S. Patent and Trademark Office improperly denied Nike a chance to amend a shoe patent in the face of a challenge to its validity by rival Adidas  a U.S. appeals court said on Thursday  ordering it to take another look at the case.",
        "date": "02112016",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike gets second chance to keep shoe patent in dispute with Adidas "
    },
    {
        "content": "BERLIN  Jan 18 Adidas has named Henkel's Kasper Rorsted as its new chief executive  boosting its shares as investors expressed hopes that the Dane has the credentials to boost profits at the German sportswear firm.",
        "date": "01182016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Adidas names Henkel's Rorsted to replace Hainer as CEO "
    },
    {
        "content": "* Company has history of buying stakes in other retailers   (Adds detail  background  share price)",
        "date": "01132016",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 1-Britain's Sports Direct buys stakes in U.S. firms Iconix and Dick's\u007f "
    },
    {
        "content": "Nike Inc   the world's largest footwear maker  reported futures orders that breezed past analysts' estimates  powered by strong demand in North America and China.",
        "date": "12232015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike's futures orders surge as demand in China  North America soars "
    },
    {
        "content": "* Shares rise 2.5 pct in extended trading   (Adds analyst comments  conference call details; updates shares)",
        "date": "12232015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Nike's futures orders surge as demand in China  N. America soars "
    },
    {
        "content": "* Shares rise nearly 3 pct in extended trading   (Adds analyst comment; updates shares)",
        "date": "12222015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 2-Nike's futures orders surge as demand in China  N. America soars "
    },
    {
        "content": "Nike Inc   the world's largest footwear maker  reported a 4.1 percent rise in quarterly revenue as demand rose for its shoes and apparel in North America.",
        "date": "12222015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike sales rise 4.1 percent as demand jumps in North America "
    },
    {
        "content": "Dec 22 Nike Inc  the world's largest footwear maker  reported a 4.1 percent rise in quarterly revenue as demand rose for its shoes and apparel in North America.",
        "date": "12222015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike quarterly sales rise 4.1 pct "
    },
    {
        "content": "NEW YORK Top stock-picking fund managers won 2015 by aiming for brand name companies and avoiding the sector bets that brought down biotech and energy investors.",
        "date": "12222015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Top 2015 U.S. stock funds stay defensive heading into 2016 "
    },
    {
        "content": "NEW YORK  Dec 22 Top stock-picking fund managers won 2015 by aiming for brand name companies and avoiding the sector bets that brought down biotech and energy investors.",
        "date": "12222015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "CORRECTED-Top 2015 US stock funds stay defensive heading into 2016 "
    },
    {
        "content": "* Investors satisfied  particularly like Adidas core brand-CEO",
        "date": "12092015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Adidas CEO says to stay until end of contract in 2017 "
    },
    {
        "content": "MONACO Sebastian Coe is stepping down from his ambassadorial role with Nike  the IAAF president said on Thursday.",
        "date": "11262015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Coe quits ambassadorial role with Nike "
    },
    {
        "content": "* IAAF president also to stand down as British Olympic head   (Adds quotes  background)",
        "date": "11262015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Athletics-Coe quits ambassadorial role with Nike "
    },
    {
        "content": "MONACO  Nov 26 IAAF president Sebastian Coe announced at a news conference on Thursday that he will step down from his ambassadorial role with sportswear company Nike.",
        "date": "11262015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Athletics-Coe steps down from ambassadorial role with Nike "
    },
    {
        "content": "MONACO Sebastian Coe is stepping down from his ambassadorial role with Nike  the IAAF president said on Thursday. | Video ",
        "date": "11272015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Coe quits ambassadorial role with Nike "
    },
    {
        "content": "Nov 20 U.S. stock index futures were slightly higher on Friday with no catalysts to drive the market convincingly in either direction.",
        "date": "11202015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "US STOCKS-Futures edge higher; Nike jumps on buyback "
    },
    {
        "content": "Nov 19 Nike Inc said its board approved a new $12 billion share buyback program and a two-for-one split of its class A and class B shares.",
        "date": "11192015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 1-Nike plans $12 bln buyback  two-for-one split "
    },
    {
        "content": "* Shares rise as much as 10 pct   (Adds details  analyst and conference call comments; Updates shares)",
        "date": "11202015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Foot Locker profit and sales race past estimates "
    },
    {
        "content": "Nov 19 Nike Inc said its board approved a new $12 billion share buyback program and a two-for-one split of its class A and class B shares.",
        "date": "11192015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike plans $12 bln buyback  two-for-one split "
    },
    {
        "content": "Nov 19 Shoe maker Skechers Inc said it won a favorable ruling from the U.S. International Trade Commission (ITC) in a lawsuit filed by Nike Inc unit Converse Inc against the company over Converse's Chuck Taylor sneaker.",
        "date": "11192015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Skechers says wins favorable ruling in Nike lawsuit "
    },
    {
        "content": "BERLIN German sportswear company Adidas   trying to muscle into Nike's  home territory  plans to increase spending on marketing again after high-profile sponsorship deals and celebrity partnerships helped rekindle U.S. sales.",
        "date": "11052015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Adidas to intensify marketing drive as U.S. sales rebound "
    },
    {
        "content": "* Adidas brand sales in North America grow fastest since 2011",
        "date": "11052015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Adidas to intensify marketing drive as U.S. sales rebound "
    },
    {
        "content": "Oct 14 The world's largest sportswear maker's revenue is set to grow faster over the next five years than it had in the previous five.",
        "date": "10142015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "RPT-UPDATE 2-Nike set to grow faster  hit $50 bln in sales by 2020 "
    },
    {
        "content": "The world's largest sportswear maker's revenue is set to grow faster over the next five years than it had in the previous five.",
        "date": "10142015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike set to grow faster  hit $50 billion in sales by 2020 "
    },
    {
        "content": "Oct 14 The world's largest sportswear maker's revenue is set to grow faster over the next five years than it had in the previous five.",
        "date": "10142015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "REFILE-UPDATE 2-Nike set to grow faster  hit $50 bln in sales by 2020 "
    },
    {
        "content": "TEL AVIV  Oct 14 UK hedge fund Lansdowne Partners Chairman Stuart Roden said on Wednesday that with oil prices set to stay low there were more opportunities to short companies in the supply chain than to buy them.",
        "date": "10142015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Lansdowne pessimistic on oil-related shares  likes German real estate  Disney  Nike "
    },
    {
        "content": "Nike Inc  reported a better-than-expected profit for the ninth straight quarter as the world's largest sportswear maker sold more products at higher prices and benefited from increased sales in its owned stores and internet business.",
        "date": "09242015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike sprints ahead as high-margin products sales rise "
    },
    {
        "content": "* Indexes: Dow up 0.7 pct  S&P down 0.1 pct  Nasdaq down 1 pct   (Updates to close)",
        "date": "09252015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "US STOCKS-S&P 500 ends flat as biotech selloff offsets Yellen comments "
    },
    {
        "content": "* Shares gain 7.5 pct after the bell   (Adds analyst comment  details; updates shares)",
        "date": "09242015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Nike sprints ahead as high-margin products sales rise "
    },
    {
        "content": "* Indexes up: Dow 1.25 pct  S&P 0.87 pct  Nasdaq 0.68 pct   (Adds details  comment  updates prices)",
        "date": "09252015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St rises as Yellen eases fears of slowing growth "
    },
    {
        "content": "* Indexes up: Dow 1.06 pct  S&P 0.67 pct  Nasdaq 0.70 pct   (Updates to open)",
        "date": "09252015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St opens higher as Yellen eases slowing growth fears "
    },
    {
        "content": "Sept 24 Nike Inc  the world's largest sportswear maker  reported a 23 percent rise in quarterly profit as it sold more higher-margin basketball shoes and apparel.",
        "date": "09242015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike profit rises as sales of higher-margin products jump "
    },
    {
        "content": "BENGALURU/SHANGHAI Nike Inc's  first-quarter profits outpaced expectations as surprisingly steep China growth boosted the world's largest sportswear maker  despite fears of a slowdown in the world's second-biggest economy.",
        "date": "09252015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike sprints ahead as China sales defy economic slowdown "
    },
    {
        "content": "BENGALURU/SHANGHAI  Sept 24 Nike Inc's  first-quarter profits outpaced expectations as surprisingly steep China growth boosted the world's largest sportswear maker  despite fears of a slowdown in the world's second-biggest economy.",
        "date": "09252015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "RPT-UPDATE 3-Nike sprints ahead as China sales defy economic slowdown "
    },
    {
        "content": "* Shares gain 7.5 pct after the bell   (Recasts with China performance  adds executive comments)",
        "date": "09252015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Nike sprints ahead as China sales defy economic slowdown "
    },
    {
        "content": "NEW YORK  Sept 16 Athletic wear maker Under Armour Inc said on Wednesday it expects to more than double revenues and build more than 800 stores outside North America by 2018 as it takes on bigger rival Nike Inc in the highly competitive athletic gear market.",
        "date": "09172015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "CORRECTED-Under Armour expects revenue to more than double by 2018 (Sept. 16) "
    },
    {
        "content": "NEW YORK  Sept 16 Athletic wear maker Under Armour Inc said on Wednesday it expects to more than double revenues and build more than 800 stores outside North America by 2018 as it takes on bigger rival Nike Inc in the highly competitive athletic gear market.",
        "date": "09162015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Under Armour expects revenue to more than double by 2018 "
    },
    {
        "content": "LONDON/MUNICH  Aug 6 German sportswear company Adidas has appointed investment bank Guggenheim Partners to help with the possible sale of its golf brands  which are struggling as the sport loses popularity  particularly in the United States.",
        "date": "08062015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 4-Adidas considers giving up golf as cycling booms "
    },
    {
        "content": "* Recent Under Armour deals gave it 120 mln users   (Adds details  background)",
        "date": "08052015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 1-Adidas buys fitness tracking app maker Runtastic "
    },
    {
        "content": "Nike Inc   the world's largest sports shoe company  said Chairman and co-founder Phil Knight would step down next year.",
        "date": "06302015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike Chairman Phil Knight to step down in 2016 "
    },
    {
        "content": "June 30 Nike Inc  the world's largest sports shoe company  said Chairman and co-founder Phil Knight would step down next year.",
        "date": "06302015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 1-Nike Chairman Phil Knight to step down in 2016 "
    },
    {
        "content": "June 30 Nike Inc  the world's biggest sports shoe company  said it had started a succession plan for Chairman Phil Knight and said he would transfer his ownership in the company to Swoosh  a limited liability company.",
        "date": "06302015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "CORRECTED-Nike outlines Chairman Knight's succession plan "
    },
    {
        "content": "* Nike rallies after results; Micron tumbles  hits semiconductors",
        "date": "06262015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "US STOCKS-S&P 500 ends down week with flat session  semis fall "
    },
    {
        "content": "June 26 The Nasdaq Composite fell 1 percent in afternoon trading on Friday after weak forecast from Micron Technology dragged down chipmakers including Intel.",
        "date": "06262015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Nasdaq falls 1 pct as Micron  Intel weigh "
    },
    {
        "content": "BERLIN German sportswear firm Adidas presented plans on Wednesday to defend its position as the world's top soccer brand against fierce competition from Nike by launching a new range of footwear and setting up more grassroots programs.",
        "date": "06242015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Adidas to grow soccer sales by getting back to roots "
    },
    {
        "content": "* Football sales target lower than that for whole Adidas group",
        "date": "06242015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Adidas to grow soccer sales by getting back to roots "
    },
    {
        "content": "BERLIN  June 24 Adidas laid out plans on Wednesday to defend its position as the world's top soccer brand from fierce competition from rival Nike by launching a new range of footwear and setting up more grassroots programmes.",
        "date": "06242015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Adidas to defend soccer leadership by connecting with grassroots "
    },
    {
        "content": "Nike Inc   the world's largest footwear maker  reported a better-than-expected profit for the eighth quarter in a row as it sold more high-margin shoes and apparel at higher prices  and posted a surprise rise in growth of \"futures orders\".",
        "date": "06252015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike beats estimates again as demand shows no sign of abating "
    },
    {
        "content": "* Shares rise 3.3 pct in extended trading   (Adds forecast  analyst comment; updates shares)",
        "date": "06252015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Nike beats estimates again as demand shows no sign of abating "
    },
    {
        "content": "June 25 Nike Inc  the world's largest footwear maker  reported a 24 percent rise in quarterly profit as it sold more high margin basketball shoes and apparel at higher prices.",
        "date": "06252015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike profit rises 24 percent "
    },
    {
        "content": "WASHINGTON U.S. authorities are examining payments made by Nike Inc  under a 1996 soccer sponsorship deal with Brazil for possible evidence of wrongdoing by the company or others  the Wall Street Journal reported on Friday  citing people familiar with the matter.",
        "date": "06132015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "U.S. probes Nike payments under Brazil soccer deal: WSJ "
    },
    {
        "content": "WASHINGTON  June 12 U.S. authorities are examining payments made by Nike Inc  under a 1996 soccer sponsorship deal with Brazil for possible evidence of wrongdoing by the company or others  the Wall Street Journal reported on Friday  citing people familiar with the matter.",
        "date": "06132015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 1-U.S. probes Nike payments under Brazil soccer deal -WSJ "
    },
    {
        "content": "WASHINGTON  June 12 U.S. authorities are examining payments made by Nike Inc  under a 1996 soccer sponsorship deal with Brazil for possible evidence of any wrongdoing by the company or others  the Wall Street Journal reported on Friday.",
        "date": "06132015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "U.S. probes Nike payments under Brazil soccer deal -WSJ "
    },
    {
        "content": "Nike Inc won an eight-year merchandising and marketing contract with the National Basketball Association  replacing Adidas as its exclusive apparel provider and making it the first athletic apparel company to have its logo appear on team uniforms.",
        "date": "06102015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike replaces Adidas as maker of NBA uniforms  signs eight-year deal "
    },
    {
        "content": "NEW YORK  June 9 Nike Inc has settled a lawsuit against three former shoe designers it had accused of stealing its commercial secrets and taking them to German rival Adidas AG with plans to open a footwear design studio in Brooklyn.",
        "date": "06092015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike settles with designers it accused of stealing secrets "
    },
    {
        "content": "June 10 Nike Inc won an eight-year merchandising and marketing contract with the National Basketball Association  replacing Adidas as its exclusive apparel provider and making it the first athletic apparel company to have its logo appear on team uniforms.",
        "date": "06102015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 1-Nike replaces Adidas as maker of NBA uniforms  signs 8-year deal "
    },
    {
        "content": "June 10 Nike Inc said it had signed an eight-year merchandising and marketing agreement with the National Basketball Association  making it the first NBA apparel partner to have its logo appear on team uniforms.",
        "date": "06102015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "CORRECTED-Nike signs 8-year marketing  merchandising agreement with NBA "
    },
    {
        "content": "* Footwear industry employs millions in China  Vietnam  Brazil",
        "date": "06102015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "INSIGHT-Robots could restore \"Made in Germany\" label to Adidas shoes "
    },
    {
        "content": "SAO PAULO/BRASILIA Nike Inc and some other big international companies face a grilling over their powerful role in Brazilian soccer as a former star player turned senator vows to expose what he describes as suspect marketing contracts and their links to corrupt payments.",
        "date": "06062015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Brazil soccer probe to put harsh glare on Nike  other sponsors "
    },
    {
        "content": "SAO PAULO/BRASILIA  June 5 Nike Inc and some other big international companies face a grilling over their powerful role in Brazilian soccer as a former star player turned senator vows to expose what he describes as suspect marketing contracts and their links to corrupt payments.",
        "date": "06052015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "RPT-Brazil soccer probe to put harsh glare on Nike  other sponsors "
    },
    {
        "content": "SAO PAULO/BRASILIA  June 5 Nike Inc and some other big international companies face a grilling over their powerful role in Brazilian soccer as a former star player turned senator vows to expose what he describes as suspect marketing contracts and their links to corrupt payments.",
        "date": "06052015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Brazil soccer probe to put harsh glare on Nike  other sponsors "
    },
    {
        "content": "NEW YORK Nike Inc may be able to avoid U.S. charges over any involvement in bribery payments to win soccer sponsorships  but could face penalties if U.S. prosecutors decide to clamp down on the global sportswear giant  lawyers with expertise in the subject said.",
        "date": "06012015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike seen avoiding charges in soccer bribery probe - lawyers "
    },
    {
        "content": "NEW YORK  May 29 Nike Inc may be able to avoid U.S. charges over any involvement in bribery payments to win soccer sponsorships  but could face penalties if U.S. prosecutors decide to clamp down on the global sportswear giant  lawyers with expertise in the subject said.",
        "date": "05292015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike seen avoiding charges in soccer bribery probe - lawyers "
    },
    {
        "content": "* Adidas  Coca-Cola Hyundai  McDonald's  Anheuser-Busch concerned",
        "date": "05282015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 4-Visa threatens to ditch FIFA as sponsor dismay mounts "
    },
    {
        "content": "NEW YORK  May 27 World Cup sponsor Nike Inc  said on Wednesday it was cooperating with authorities after bribery and corruption charges against senior FIFA officials were announced by U.S. prosecutors and arrests were made in Switzerland.",
        "date": "05272015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Soccer sponsors dismayed by corruption allegations at FIFA "
    },
    {
        "content": "NEW YORK Nike Inc may be able to avoid U.S. charges over any involvement in bribery payments to win soccer sponsorships  but could face penalties if U.S. prosecutors decide to clamp down on the global sportswear giant  lawyers with expertise in the subject said.",
        "date": "05292015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike seen avoiding charges in soccer bribery probe: lawyers "
    },
    {
        "content": "ZURICH/NEW YORK  May 27 The world's most popular sport was plunged into turmoil on Wednesday as seven senior soccer officials were arrested on U.S. corruption charges and faced extradition from Switzerland  whose authorities also announced a criminal investigation into the awarding of the next two World Cups.",
        "date": "05272015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "WRAPUP 7-World soccer rocked by U.S.  Swiss arrests of officials for graft "
    },
    {
        "content": "NEW YORK  May 27 Nike Inc on Wednesday said that it was cooperating with authorities on alleged bribery and corruption at soccer's governing body FIFA.",
        "date": "05272015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike says cooperating with authorities on FIFA allegations "
    },
    {
        "content": "DETROIT  May 11 Nike Inc's announcement that it could create up to 10 000 manufacturing jobs in the United States will spark further debate on whether the country is starting to see an industrial renaissance after many years of job losses.",
        "date": "05112015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "RPT-U.S. factory job gains come slowly despite corporate vows "
    },
    {
        "content": "WASHINGTON  May 6 President Barack Obama will make a high-profile pitch for a Pacific trade deal he promises will protect workers on Friday at Nike Inc  a company once reviled for using Asian sweatshops to make its famous sneakers.",
        "date": "05062015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Obama puts Nike in trade spotlight despite sweatshop stigma of past "
    },
    {
        "content": "BERLIN German sportswear company Adidas  turned around its sales in North America in the first quarter  helped by a marketing campaign designed to win business from dominant rival Nike. | Video ",
        "date": "05052015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Adidas begins marathon turnaround in North America "
    },
    {
        "content": "ABOARD AIR FORCE ONE The White House declined to say on Thursday whether Nike Inc would be making a company announcement to coincide with President Barack Obama's visit to the company's Oregon headquarters on Friday.",
        "date": "05072015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "White House says will let Nike 'share their news' on Obama visit "
    },
    {
        "content": "* Shares up 1.2 percent   (Adds details from conference call)",
        "date": "05052015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 3-Adidas begins marathon turnaround in North America "
    },
    {
        "content": "ABOARD AIR FORCE ONE  May 7 The White House declined to say on Thursday whether Nike Inc would be making a company announcement to coincide with President Barack Obama's visit to the company's Oregon headquarters on Friday.",
        "date": "05072015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 1-White House says will let Nike \"share their news\" on Obama visit "
    },
    {
        "content": "BEAVERTON  Oregon President Barack Obama  co-opting Nike Inc's famous slogan  told Democrats on Friday to \"just do it\" and support a trade deal with Asian countries that the shoe company said would help it create up to 10 000 U.S. jobs over 10 years.",
        "date": "05082015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Obama to Democrats on Asia trade pact: like Nike  'just do it' "
    },
    {
        "content": "ONBOARD AIR FORCE ONE  May 7 The White House declined to say on Thursday whether Nike  would be making a company announcement to coincide with President Barack Obama's visit to the company's headquarters on Friday.",
        "date": "05072015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "White House says it will let Nike \"share their news\" on Obama visit "
    },
    {
        "content": "DETROIT  May 8 Nike Inc's announcement that it could create up to 10 000 manufacturing jobs in the United States will spark further debate on whether the country is starting to see an industrial renaissance after many years of job losses.",
        "date": "05082015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "U.S. factory job gains come slowly despite corporate vows "
    },
    {
        "content": "FUERTH  Germany Adidas  shareholders took aim at the management of the German sportswear company on Thursday  not convinced a new strategy would be enough to challenge the dominance of rival Nike .",
        "date": "05072015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Adidas under fire from investors despite recovery signs "
    },
    {
        "content": "WASHINGTON  May 8 Sports shoe maker Nike's  Chief Executive Mark Parker said on Friday that the 12-nation Trans-Pacific Partnership would eliminate duties and free up funds the company could use to create 10 000 U.S. jobs.",
        "date": "05082015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike CEO Parker says can create jobs if Asia trade pact passes "
    },
    {
        "content": "* CEO rejects call for sale of Reebok brand   (Adds details  quotes)",
        "date": "05072015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 1-Adidas under fire from investors despite recovery signs "
    },
    {
        "content": "PORTLAND  Oregon  May 8 Sports shoe maker Nike Inc put its weight behind President Barack Obama's push for a trade deal with Asian countries on Friday with a promise to create up to 10 000 U.S.-based manufacturing jobs if the pact is approved.",
        "date": "05082015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike backs Obama on trade with pledge to create 10 000 U.S. jobs "
    },
    {
        "content": "WASHINGTON President Barack Obama will travel to Nike Inc  headquarters in Oregon next Friday to argue that a 12-nation Pacific trade deal and the fast-track legislation needed to finalize the pact are good for workers.",
        "date": "04302015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Obama to push case for trade deal at Nike headquarters in Oregon "
    },
    {
        "content": "WASHINGTON  April 30 President Barack Obama will travel to Nike Inc headquarters in Oregon next Friday to argue that a 12-nation Pacific trade deal and the fast-track legislation needed to finalize the pact are good for workers.",
        "date": "04302015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "CORRECTED-Obama to push case for trade deal at Nike headquarters in Oregon "
    },
    {
        "content": "BEIJING  April 15 JD.com Inc  China's No. 2 e-commerce player  on Wednesday launched its JD Worldwide cross-border online shopping platform  a challenger to Alibaba Group Holding Ltd's Tmall Global service.",
        "date": "04152015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "China's JD.com sets up cross-border e-commerce platform in challenge to Alibaba "
    },
    {
        "content": "NEW YORK - U.S. stocks rose on Friday  pushing the Nasdaq to a 15-year high and helping the S&P 500 snap a three-week string of losses  following a pullback in the dollar  upbeat results from Nike and further biotech gains.",
        "date": "03232015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "India Morning Call-Global Markets "
    },
    {
        "content": "Nike Inc's  quarterly profit beat market estimates as the world's largest sportswear maker sold more higher margin shoes and apparel  but the company warned Wall Street that the stronger dollar would take a toll on its current quarter.Investors  however  ignored the warning  sending its shares up 4.5 percent to $102.75 in heavy after-hours trading on Thursday.",
        "date": "03192015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Nike profit trumps Street  strong dollar weighs on forecast "
    },
    {
        "content": "March 19 Nike Inc's quarterly profit beat market estimates as the world's largest sportswear maker sold more higher margin shoes and apparel  but the company warned Wall Street that the stronger dollar would take a toll on its current quarter.",
        "date": "03192015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "UPDATE 2-Nike profit trumps Street  strong dollar weighs on forecast "
    },
    {
        "content": "U.S. stocks rose on Friday  pushing the Nasdaq to a 15-year high and helping the S&P 500 snap a three-week string of losses  following a pullback in the dollar  upbeat results from Nike and further biotech gains. | Video ",
        "date": "03202015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Wall St. rises on Nike  lower dollar; Nasdaq hits 15-year high "
    },
    {
        "content": "March 19 Nike Inc  the world's largest sportswear maker  reported a 16 percent jump in quarterly profit due to higher demand for its apparel and basketball and running shoes.",
        "date": "03192015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike profit up 16 pct on higher demand for apparel  shoes "
    },
    {
        "content": "* Indexes rise: Dow and S&P 0.9 percent  Nasdaq 0.7 percent   (Updates close with energy shares up  Apple down  latest volume)",
        "date": "03202015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St rises on Nike  lower dollar; Nasdaq hits 15-yr high "
    },
    {
        "content": "* Indexes rise: Dow and S&P 0.9 percent  Nasdaq 0.7 percent   (Updates to close)",
        "date": "03202015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St rises on Nike  lower dollar; snaps 3-week string of losses "
    },
    {
        "content": "* Indexes up: Dow 1.3 pct  S&P 1.1 pct  Nasdaq 1 pct   (Updates to early afternoon)",
        "date": "03202015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St rises on Nike  lower dollar; set to snap 3 weeks of losses "
    },
    {
        "content": "* European stocks helped after Athens' assurances   (Updates to afternoon trading  recasts lead and adds Nike results)",
        "date": "03202015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "GLOBAL MARKETS-Decline in U.S. dollar lifts oil  stocks "
    },
    {
        "content": "* Indexes up: Dow 1.08 pct  S&P 0.98 pct  Nasdaq 0.87 pct   (Updates to late morning)",
        "date": "03202015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St rises on Nike  biotechs; set to snap 3-week skid "
    },
    {
        "content": "* Indexes up: Dow 0.78 pct  S&P 0.68 pct  Nasdaq 0.7 pct   (Updates to market open)",
        "date": "03202015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St climbs on Nike  biotech lift "
    },
    {
        "content": "NEW YORK  March 20 U.S. stocks rose at the open on Friday  with the S&P 500 on track to snap a three-week losing streak  lifted by strong earnings at Nike and by another strong showing from the biotech sector.",
        "date": "03202015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS SNAPSHOT-Biotech  Nike lift Wall St at open "
    },
    {
        "content": "* Futures up: Dow 148 pts  S&P 15 pts  Nasdaq 36 pts   (Adds quote  updates prices)",
        "date": "03202015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "US STOCKS-Wall St set for higher open as Nike provides lift "
    },
    {
        "content": "* Says gets Nike's approval to become qualified materials supplier",
        "date": "03092015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "BRIEF-Anhui Anli Artificial Leather becomes qualified supplier for Nike "
    },
    {
        "content": "BERLIN  March 5 German sportswear company Adidas  expects robust sales growth in 2015 as its golf business improves and consumer confidence recovers  while net profit should rise faster still despite currency impacts and higher marketing spending.",
        "date": "03052015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "Adidas expects sales and profit growth as golf unit recovers "
    },
    {
        "content": "* Shares jump 4.4 pct on search announcement   (Adds investor comment)",
        "date": "02192015",
        "name": "Nike Inc",
        "news_type": "topStory",
        "symbol": "NKE",
        "title": "UPDATE 2-Adidas starts search to replace veteran CEO "
    },
    {
        "content": " ",
        "date": "02122015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Nike's CFO Donald Blair to retire "
    },
    {
        "content": "BERLIN  Jan 28 The long-serving chief executive of Adidas has no intention of stepping down despite criticism as the German sportswear company loses ground to U.S. rival Nike  he told a German newspaper.",
        "date": "01282015",
        "name": "Nike Inc",
        "news_type": "normal",
        "symbol": "NKE",
        "title": "Adidas CEO vows to stay on  admits mistakes - paper "
    }
]