[
    {
        "content": "FRANKFURT/LONDON Belgium has hired Nomura  to prepare the country's third-largest bank Belfius for an initial public offering (IPO) in a deal that could value the lender at up to 8 billion euros ($9.3 billion)  sources familiar with the matter told Reuters.",
        "date": "11032017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Exclusive: Belgian state hires Nomura for Belfius bank float - sources "
    },
    {
        "content": "Nov 2 Japanese investment bank Nomura said on Thursday it named Hugh Karseras managing director  global sales chief operating officer to its global markets division.",
        "date": "11022017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura names Hugh Karseras global sales COO "
    },
    {
        "content": "* Retail arm a bright spot  pretax profit up 77 pct y/y (Writes through; adds CFO and analyst comment)",
        "date": "10302017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 2-Bond slump drags on Nomura's profits  stirs overseas income worries "
    },
    {
        "content": " (Changes first revenues to total revenues  and second revenues to net revenues.) Oct 30 (Reuters)-  Nomura Holdings Inc  CONSOLIDATED FINANCIAL HIGHLIGHTS (in billions of yen unless specified)                     6 months ended      6 months ended       Year to                   Sep 30  2017        Sep 30  2016     Mar 31  2018                      LATEST             YEAR-AGO          COMPANY                      RESULTS             RESULT          FORECAST   Total revenues     930.32          ",
        "date": "10302017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "REFILE-TABLE-Nomura Holdings 6-MTH group results (SEC) "
    },
    {
        "content": "TOKYO  Oct 30 Nomura Holdings Inc on Monday said its second-quarter net profit fell 15 percent  as its wholesale division was hit by a drop in fixed income trading. Japan's biggest brokerage and investment banking group said in a statement that its July-September net profit fell to 51.9 billion yen ($457 million)  from 61.2 billion yen a year ago. That was below an average estimate of 60.5 billion yen from two analysts polled by Thomson Reuters. ($1 = 113.6600 yen) (Reporting by Thom",
        "date": "10302017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura Q2 net profit falls 15 pct on bond trading drop "
    },
    {
        "content": "* Says it receives a notice from Nomura Securities Co.  Ltd.  confirming share subscription of 9 900 shares",
        "date": "10262017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Nishimoto confirms to issue 9 900 shares to Nomura Securities "
    },
    {
        "content": "* Says it completed repurchase of 100 million shares of its common stock  for 62.35 billion yen in total  as of Oct. 23",
        "date": "10232017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Nomura Holdings completes share repurchase "
    },
    {
        "content": "LONDON  Oct 25 (IFR) - Japanese investment bank Nomura has hired former Citigroup banker Frederic Giovansili to head its global market sales for Western Europe.",
        "date": "10252017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura hires Giovansili for global market sales "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  October 25 (Fitch) Fitch Ratings has today affirmed the Long-Term Issuer Default Ratings (IDRs) on the following entities at 'A-'; their Outlooks are Stable: - Nomura Holdings  Inc. (Nomura Holdings) and its wholly owned subsidiary Nomura Securities Co.  Ltd. (Nomura Securities)  which are jointly referred to as Nomura - Nomura Financial Products & Services  Inc. (NFPS)  a wholly owned subsidiary of Nomura Holdings - Daiwa Securi",
        "date": "10252017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Fitch Affirms Nomura and Daiwa; Upgrades VR of Nomura Holdings "
    },
    {
        "content": "* Says it confirmed that it will issue 6 735 units at the price of 721.2 million yen in total  through private placement to Nomura Securities Co Ltd",
        "date": "10202017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Aeon Reit Investment to issue 6 735 units to Nomura Securities "
    },
    {
        "content": "Oct 9 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10092017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES- Nomura  UniCredit  Exotix Capital "
    },
    {
        "content": "Sept 29 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "09292017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura  BNP Paribas  BofA Merrill Lynch "
    },
    {
        "content": "* Says co receives notice from Nomura Securities Co. Ltd  confirming share subscription",
        "date": "09292017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF-AIN Holdings confirms to issue 450 000 shares to Nomura Securities "
    },
    {
        "content": "Sept 25 Investment bank Nomura Holdings Inc appointed Keith Willard as managing director and Matt Shiel as executive director within its agency mortgage business in the Americas.",
        "date": "09252017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura names two new directors to agency mortgage business "
    },
    {
        "content": "NEW YORK  Sept 28 Nomura Holdings Inc and Royal Bank of Scotland Group Plc lost a U.S. court appeal on Thursday to overturn an order requiring them to pay $839 million for making false statements while selling mortgage-backed securities to Fannie Mae and Freddie Mac.",
        "date": "09282017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "REFILE-Nomura  RBS lose bid to overturn $839 million mortgage bond award "
    },
    {
        "content": "NEW YORK Nomura Holdings Inc  and Royal Bank of Scotland Group Plc  lost a U.S. court appeal on Thursday to overturn an order requiring them to pay $839 million for making false statements while selling mortgage-backed securities to Fannie Mae  and Freddie Mac.",
        "date": "09282017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura  RBS lose bid to overturn $839 million mortgage bond award "
    },
    {
        "content": "* Says it received notice from Nomura Securities Co Ltd  confirming share subscription",
        "date": "09192017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-UUUM confirms to issue 77 500 shares to Nomura Securities "
    },
    {
        "content": "* Says it repurchased 25.4 million shares of its common stock for 15.78 billion yen in total  from Aug. 1 to Aug. 31",
        "date": "09012017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Nomura Holdings buys back 25.4 mln shares for 15.78 bln yen "
    },
    {
        "content": "Aug 21 Global investment bank Nomura Holdings Inc said on Monday it appointed Andrey Chuprin as managing director and head of global markets sales for Russia and CIS.",
        "date": "08212017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura names Andrey Chuprin managing director for Russia & CIS "
    },
    {
        "content": "* Says it will issue 50th series  51th series and 52 series unsecured corporate bonds worth 30 billion yen  20 billion yen and 10 billion yen respectively  with payment date on Aug. 10",
        "date": "08042017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF- Nomura Holdings to issue unsecured corporate bonds worth 60 bln yen "
    },
    {
        "content": "TOKYO  July 27 Nomura Holdings Inc said on Thursday it would tender to sell its shares in Jafco Co through a share buyback with the venture capital firm  as the brokerage looks to deploy its capital more efficiently.",
        "date": "07272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "CORRECTED-Nomura looks to sell stake in venture capital firm Jafco "
    },
    {
        "content": "TOKYO Nomura Holdings Inc  said on Friday it had sold all its shares of its stake in Jafco Co  back to the venture capital firm  as the Japanese brokerage seeks to shift capital into areas where it sees more growth.",
        "date": "07282017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Japan's Nomura sells stake in venture capital firm Jafco "
    },
    {
        "content": "* Says it will sell 5 million shares of Nomura Research Institute Ltd",
        "date": "07272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "CORRECTED-BRIEF-JAFCO to sell 5 mln shares of Nomura Research Institute "
    },
    {
        "content": "* Says it will sell entire 8.5 million shares of JAFCO Co Ltd",
        "date": "07272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF-Nomura Holdings to sell entire shares of JAFCO "
    },
    {
        "content": "TOKYO  July 27 Daiwa Securities Group Inc   Japan's second-largest brokerage group  said on Thursday it will buy two boutique merger-and-acquisitions (M&A) advisory firms to strengthen its M&A operations in the United States.",
        "date": "07272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Japan's Daiwa Securities to buy two U.S. M&A advisory firms "
    },
    {
        "content": "* Jafco shares close highest since Oct 2015 (Adds share tender details  CFO comments  share price moves)",
        "date": "07282017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 2-Japan's Nomura sells stake in venture capital firm Jafco "
    },
    {
        "content": "* Overseas operations continue recovery (Writes through  adds CFO's and analyst's comments)",
        "date": "07282017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 2-Nomura's retail arm drives 21 pct jump in quarterly net profit "
    },
    {
        "content": "TOKYO  July 28 Nomura Holdings Inc said its first-quarter net profit rose 21 percent  as a strong performance in its domestic-oriented retail division offset a drop in bond trading at its wholesale division.",
        "date": "07282017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura's Q1 profit jumps 21 pct on strong retail business "
    },
    {
        "content": "* Says it sold entire 8.5 million shares (19.1 percent voting power) of JAFCO Co Ltd for 38.71 billion yen",
        "date": "07282017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF- Nomura Holdings sells entire shares of JAFCO for 38.71 bln yen "
    },
    {
        "content": "* Says it received a notice from Nomura Securities Co.  Ltd.   confirming share subscription",
        "date": "07182017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Fringe81 confirms to issue 39 000 shares to Nomura Securities "
    },
    {
        "content": "CARACAS Canadian miner Crystallex  seeking to recoup financial damages from an expropriation by Venezuela  won U.S. court approval on Friday to bar Japanese bank Nomura  from transferring securities owned by the OPEC nation.",
        "date": "06302017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Miner Crystallex wins court order against Nomura over Venezuela deal "
    },
    {
        "content": "CARACAS  June 30 Canadian miner Crystallex  seeking to recoup financial damages from an expropriation by Venezuela  won U.S. court approval on Friday to bar Japanese bank Nomura from transferring securities owned by the OPEC nation.",
        "date": "06302017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 1-Miner Crystallex wins court order against Nomura over Venezuela deal "
    },
    {
        "content": "Goldman Sachs Group Inc's  asset management arm has sold at least $300 million of the Venezuelan bonds it acquired in a purchase in May  the Wall Street Journal reported on Friday  citing people familiar with the matter.",
        "date": "06302017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Goldman Sachs sells $300 million of controversial Venezuelan bonds: WSJ "
    },
    {
        "content": "June 30 Goldman Sachs Group Inc's asset management arm has sold at least $300 million of the Venezuelan bonds it acquired in a purchase in May  the Wall Street Journal reported on Friday  citing people familiar with the matter.",
        "date": "06302017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Goldman Sachs sells $300 mln of controversial Venezuelan bonds-WSJ "
    },
    {
        "content": "SINGAPORE  June 30 Hong Kong's Bank of East Asia Ltd (BEA) has obtained approval from China's securities regulator to set up a joint venture in free trade zone Qianhai as it expands its reach in the world's second largest economy.",
        "date": "06302017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Hong Kong's Bank of East Asia gets China's approval for securities JV in Qianhai "
    },
    {
        "content": "TOKYO  June 27 Nomura Holdings Inc is applying for a licence to operate a new entity in Frankfurt  as Japan's largest brokerage gears up for Britain's exit from the European Union in 2019.",
        "date": "06272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "RPT-UPDATE 1-Japan's Nomura plans new entity in Frankfurt as it prepares for Brexit "
    },
    {
        "content": "CARACAS Venezuela's central bank is seeking to sell fixed-income securities to Nomura Holdings Inc  as a way of raising cash amid an economic crisis  an opposition deputy and a finance industry source said on Thursday  only weeks after a similar deal embroiled the Japanese bank in controversy.",
        "date": "06222017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Venezuela in talks with Nomura to sell fixed-income securities -sources "
    },
    {
        "content": "* Other banks eyeing move to German city (Adds background  context)",
        "date": "06272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 1-Japan's Nomura plans new entity in Frankfurt as it prepares for Brexit "
    },
    {
        "content": "CARACAS  June 22 Venezuela's central bank is seeking to sell fixed-income securities to Nomura Holdings Inc as a way of raising cash amid an economic crisis  an opposition deputy and a finance industry source said on Thursday  only weeks after a similar deal embroiled the Japanese bank in controversy.",
        "date": "06222017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 3-Venezuela in talks with Nomura to sell fixed-income securities -sources "
    },
    {
        "content": "CARACAS  June 22 Venezuela's central bank is seeking to sell fixed-income securities to Japanese bank Nomura Holdings Inc as a way of raising cash amid an economic crisis  an opposition deputy and a finance industry source said on Thursday.",
        "date": "06222017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Venezuela in talks with Nomura to sell fixed-income securities: sources "
    },
    {
        "content": "TOKYO  June 27 Nomura Holdings Inc said on Tuesday it is applying for a license to operate a new entity in Frankfurt  as Japan's largest brokerage group prepares for Britain's exit from the European Union.",
        "date": "06272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura  gearing up for Brexit  applies for license to operate in Frankfurt "
    },
    {
        "content": "HONG KONG/TOKYO  June 19 Under pressure in Japan from Wall Street rivals and anticipating more deals in the United States or by American companies overseas  Nomura Holdings is boosting its U.S. investment banking business  including some senior hires in the technology and finance sectors.",
        "date": "06192017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Squeezed at home  Japan's Nomura seeks to push into Wall Street's home turf "
    },
    {
        "content": "June 15 A federal jury on Thursday delivered a mixed verdict for three former Nomura Holdings Inc traders accused by the U.S. Department of Justice of lying to customers about the prices of mortgage bonds they bought and sold.",
        "date": "06152017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura bond trader fraud trial ends in split U.S. jury verdict "
    },
    {
        "content": "CARACAS/NEW YORK  June 5 In early May  Goldman Sachs turned down a request from Caracas to convert $5 billion in sovereign bonds into marketable securities partly because it would mean dealing directly with a Venezuelan state bank  according to people familiar with the talks.",
        "date": "06052017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "RPT-Goldman  Nomura heeded warnings before Venezuela bond deal "
    },
    {
        "content": "CARACAS/NEW YORK  June 5 In early May  Goldman Sachs turned down a request from Caracas to convert $5 billion in sovereign bonds into marketable securities partly because it would mean dealing directly with a Venezuelan state bank  according to people familiar with the talks.",
        "date": "06052017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Goldman  Nomura heeded warnings before Venezuela bond deal "
    },
    {
        "content": "CARACAS  June 1 The head of Venezuela's opposition-led congress on Thursday slammed Japanese investment bank Nomura Securities for buying about $100 million worth of state oil company bonds  accusing it of helping finance President Nicolas Maduro's \"dictatorship.\"",
        "date": "06012017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "After Goldman storm  Venezuela congress blasts Nomura bond buy "
    },
    {
        "content": "May 31 Japanese investment bank Nomura Securities bought about $100 million worth of Venezuelan government bonds last week as part of the same transaction that has landed Goldman Sachs Group Inc in the middle of a political controversy  the Wall Street Journal reported on Wednesday.",
        "date": "05312017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura bought controversial Venezuelan bonds at discount - WSJ "
    },
    {
        "content": "June 1 The following bids  mergers  acquisitions and disposals were reported by 1930 GMT on Thursday:",
        "date": "06012017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "REFILE-Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "June 1 The Financial Industry Regulatory Authority (FINRA) said on Thursday it barred John Batista Bocchino  a former Morgan Stanley representative  for concealing around $190 million in Venezuelan bond trades from the firm  which had restricted such trading.",
        "date": "06012017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "FINRA suspends ex-Morgan Stanley trader for Venezuelan bond deals "
    },
    {
        "content": "June 1 The following bids  mergers  acquisitions and disposals were reported by 1400 GMT on Thursday:",
        "date": "06012017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "CARACAS/TOKYO Japanese investment bank Nomura Securities bought about $100 million worth of Venezuelan government bonds last week as part of the same transaction that has landed Goldman Sachs Group Inc  in the middle of a political storm  two sources said on Thursday.",
        "date": "06012017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura bought controversial Venezuelan bonds at discount: sources "
    },
    {
        "content": "CARACAS/TOKYO  June 1 Japanese investment bank Nomura Securities bought about $100 million worth of Venezuelan government bonds last week as part of the same transaction that has landed Goldman Sachs Group Inc in the middle of a political storm  two sources said on Thursday.",
        "date": "06012017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 2-Nomura bought controversial Venezuelan bonds at discount -sources "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  May 22 (Fitch) Fitch Ratings has revised the Outlooks on the following entities to Stable from Negative and affirmed the Long-Term Issuer Default Ratings (IDRs) on the entities at 'A-': - Nomura Holdings  Inc. (Nomura Holdings) and its wholly owned subsidiary Nomura Securities Co.  Ltd. (Nomura Securities)  which are jointly referred to as Nomura - Nomura Financial Products & Services  Inc. (NFPS)  a wholly owned subsidiary of No",
        "date": "05222017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Fitch Revises Outlooks on Nomura and Daiwa to Stable; Affirms Ratings "
    },
    {
        "content": "NEW YORK A former co-head of Nomura Holdings Inc's commercial mortgage-backed securities desk was charged by a U.S. regulator on Monday with fraud for lying to customers about bond prices  in order to boost profit.",
        "date": "05152017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "SEC says ex-Nomura trading chief lied about bond prices "
    },
    {
        "content": "NEW YORK Two traders who ran Nomura Holdings Inc's  commercial mortgage-backed securities desk were charged on Monday by the U.S. Securities and Exchange Commission with lying to customers about bond prices  to boost profit and their own bonuses.",
        "date": "05152017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "SEC charges two former top Nomura traders with bond price lies "
    },
    {
        "content": "* Overseas biz FY pretax profit Y88.1 bln vs Y79.6 bln loss pvs yr",
        "date": "04272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 2-Nomura scales wall on overseas business with first annual profit in 7 years "
    },
    {
        "content": "* Says it will repurchase up to 100 million shares  representing 2.6 percent of outstanding",
        "date": "04272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF- Nomura Holdings to repurchase shares "
    },
    {
        "content": "TOKYO  April 27 Nomura Holdings Inc said it swung to a net profit in its fiscal fourth quarter as strength in its wholesale business  driven by revenue from bond trading  helped its overseas business record its first annual profit in seven years.",
        "date": "04272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura swings to Q4 profit on bond trading  sets 80 bln yen buyback "
    },
    {
        "content": "* Nomura says to buy back up to 2.6 percent of own shares worth 80 billion yen ($719 million) Further company coverage: ($1 = 111.2400 yen)",
        "date": "04272017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF-Nomura says to buy back up to 2.6 pct of own shares worth 80 bln yen "
    },
    {
        "content": "* Says it received notice from Nomura Securities Co.  Ltd.  confirming shares subscription",
        "date": "04182017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Aucnet confirms to issue 723 000 shares to Nomura Securities "
    },
    {
        "content": "* Says it received notice from Nomura Securities Co.  Ltd.  and confirms the issue of 3 400 units at 93 248 yen per unit to Nomura Securities",
        "date": "04202017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Star Asia Investment confirms to issue 3 400 units to Nomura Securities "
    },
    {
        "content": "* Says it received notice from Nomura Securities Co.  Ltd.  confirming shares subscription",
        "date": "04172017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Oro confirms to issue 150 000 shares to Nomura Securities "
    },
    {
        "content": "* Targeting members of employee stock ownership plans -president",
        "date": "04132017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Japan's Nomura targets younger generation as demographic crunch looms "
    },
    {
        "content": "* Says it received notice from Nomura Securities Co.  Ltd.  confirming shares subscription",
        "date": "04112017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Greens confirms to issue 660 000 share to Nomura Securities "
    },
    {
        "content": "* Says it will issue 436 new units through a private placement to Nomura Securities Co.  Ltd. ",
        "date": "04072017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Hoshino Resorts REIT to issue new units "
    },
    {
        "content": "March 29 Nomura Holdings Inc appointed Prabhat Awasthi as its new head of India  replacing Vikas Sharma  who has been promoted to head of Asia ex-Japan.",
        "date": "03292017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura names Prabhat Awasthi head of India "
    },
    {
        "content": "* Updates that it will issue 15 545 new units at 115 046 yen per unit via private placement to Nomura Securities on March 14",
        "date": "03102017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Aeon Reit Investment updates new units issuance "
    },
    {
        "content": "* Group CEO Nagai will remain in charge of Nomura Holdings   (Adds details on Morita and Okuda  other appointments  analyst comment)",
        "date": "03072017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 2-Nomura promotes Morita  Okuda  positioning them as possible CEO successors "
    },
    {
        "content": "TOKYO  March 7 Nomura Holdings Inc will promote company veteran Toshio Morita to the role of president of its Nomura Securities subsidiary  people familiar with the matter said on Tuesday.",
        "date": "03072017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura Holdings to name Morita as Nomura Securities' president - sources "
    },
    {
        "content": "Feb 21 Japanese bank Nomura has named Stefano Giudici as its head of investment banking in Italy.",
        "date": "02212017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura names Stefano Giudici Italy investment banking head "
    },
    {
        "content": "CARACAS  Feb 8 Venezuela's central bank is considering a repurchase agreement that would provide $1 billion from investment bank Nomura in exchange for bonds issued by state oil company PDVSA  according to a document and source familiar with the situation.",
        "date": "02082017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 2-Venezuelan central bank eyes $1 bln 'repo' deal with Nomura -source "
    },
    {
        "content": "CARACAS  Feb 8 Venezuela's central bank is evaluating a financial operation in which it would receive more than $1 billion from investment bank Nomura in exchange for bonds issued by state oil company PDVSA  according to a document seen by Reuters and a source with first-hand knowledge of the situation.   (Reporting by Corina Pons  writing by Brian Ellsworth; Editing by Meredith Mazzilli)",
        "date": "02082017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Venezuela cenbank eyes $1 bln financing operation with Nomura -sources "
    },
    {
        "content": "* Q3 net profit 70.3 bln yen vs 35.4 bln yen in year-ago period",
        "date": "01312017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 2-Nomura set for first overseas annual profit in 7 years after Q3 jump "
    },
    {
        "content": "TOKYO  Jan 31 Nomura Holdings Inc  Japan's biggest brokerage  said third-quarter profit almost doubled on strong performance of its wholesale division  driven by the fixed income business.",
        "date": "01312017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura Holdings Q3 net profit doubles on strong fixed income business "
    },
    {
        "content": "Jan 10 Nomura Holdings Inc  Japan's largest brokerage  said on Tuesday it named Dan McNicholas as APAC head of capital introductions on Dec. 19.",
        "date": "01102017",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura names APAC head of capital introductions "
    },
    {
        "content": "TOKYO Nomura Holdings Inc  sees opportunities in the pro-business stance of U.S. president-elect Donald Trump  though his protectionist tilt brings uncertainty to the global economy  said the chief of Japan's biggest brokerage and investment bank.",
        "date": "12292016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Japan's Nomura sees opportunities from Trump's pro-business agenda "
    },
    {
        "content": "SAN FRANCISCO  Nov 3 Nomura Holdings Inc  banker  Rudy Balseiro  who was head of the equity syndicate  has left for Japanese rival  SMBC Nikko Securities  a unit of bank Sumitomo Mitsui Financial Group  according to people familiar with the matter.",
        "date": "11032016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura loses syndicate banker  head of U.S. M&A-sources "
    },
    {
        "content": "Nomura Holdings Inc will pay more than $3 million to settle claims that it sold faulty U.S. residential mortgage-backed securities to two corporate credit unions  the National Credit Union Administration (NCUA) said on Wednesday.",
        "date": "11022016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura to pay more than $3 million to settle U.S. mortgage securities claims "
    },
    {
        "content": "Nov 2 Nomura Holdings Inc will pay more than $3 million to settle claims that it sold faulty U.S. residential mortgage-backed securities to two corporate credit unions  the National Credit Union Administration (NCUA) said on Wednesday.",
        "date": "11022016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura to pay more than $3 mln to settle U.S. mortgage securities claims "
    },
    {
        "content": "Nov 1 Nomura Holdings Inc  Japan's largest brokerage  said it appointed Mark Doms as a managing director and senior economist.",
        "date": "11012016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura appoints new senior economist in U.S. "
    },
    {
        "content": "* Overseas division in black for 2nd straight quarter   (Adds CFO comments  overseas business profit)",
        "date": "10272016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 2-Japan's Nomura Q2 profit leaps on wholesale surge  overseas pickup "
    },
    {
        "content": "* Says its top shareholder that a Tokyo-based real estate leasing firm to transfer 64 777 500 shares (33.8 percent voting rights) in the co to Nomura Holdings Inc",
        "date": "10272016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF-Nomura Real Estate Holdings says Nomura Holdings to hold 33.8 pct voting rights in the co "
    },
    {
        "content": "TOKYO  Oct 27 Nomura Holdings Inc  Japan's biggest brokerage  said second-quarter profit rose nearly a third  boosted by a surge in its wholesale division  housing mergers and acquisitions advisory business as well as currency and bond trading.",
        "date": "10272016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "REFILE-Nomura Holdings Q2 net profit jumps 31 pct  wholesale business surges "
    },
    {
        "content": "LONDON  Oct 7 (IFR) - Wissam Farah has been appointed head of sales for the Europe  Middle East and Africa region within the global markets division of Japanese bank Nomura.",
        "date": "10072016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Farah to head EMEA sales at Nomura "
    },
    {
        "content": "Sept 27 Nomura Holdings Inc  Japan's largest brokerage  appointed Christopher Marai as a managing director and senior analyst  covering biotechnology.",
        "date": "09272016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura appoints Christopher Marai as managing director "
    },
    {
        "content": "* On September 14  2016  Caroline Holdings unit of co entered into stock purchase agreement with Nomura Securities Co.  ltd",
        "date": "09142016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Tiptree says Caroline Holdings entered stock purchase agreement with Nomura Securities "
    },
    {
        "content": "MUMBAI/SINGAPORE  Sept 13 Bankers are finding new ways to sell India's \"masala\" bonds by  structuring this rupee-denominated debt issued abroad into derivatives  and then sweetening the deal with leveraged returns of 12 to 13 percent after fees and hedging.",
        "date": "09142016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "RPT-Banks add leverage to spice up 'masala' bonds for expatriate Indians "
    },
    {
        "content": "MUMBAI/SINGAPORE  Sept 13 Bankers are finding new ways to sell India's \"masala\" bonds by  structuring this rupee-denominated debt issued abroad into derivatives  and then sweetening the deal with leveraged returns of 12 to 13 percent after fees and hedging.",
        "date": "09132016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Banks add leverage to spice up 'masala' bonds for expatriate Indians "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  September 09 (Fitch) Fitch Ratings has affirmed the Long-Term Issuer  Default Ratings (IDRs) of Nomura Holdings  Inc. (Nomura Holdings) and of its  wholly owned subsidiaries Nomura Securities Co.  Ltd. (Nomura Securities) and  Nomura Financial Products & Services  Inc. (NFPS) ) at 'A-'. Fitch has also  affirmed the Long-Term IDRs of Daiwa Securities Group Inc. (Daiwa Securities  Group) and its wholly owned subsidiary  Daiwa Secur",
        "date": "09092016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Fitch Affirms Nomura and Daiwa at 'A-'; Outlook Negative "
    },
    {
        "content": "* Announces plan for up to 45 bln yen share buy-back   (Adds comment from CFO and analyst  earnings details)",
        "date": "07282016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 2-Nomura Q1 profit skids 32 pct as retail investors check out of uncertain markets "
    },
    {
        "content": "MILAN  July 28 Italy's third-biggest lender  Monte dei Paschi di Siena  has received a last-minute rescue proposal by Swiss bank UBS  just hours before it is due to unveil its own bailout plan to meet regulators' concerns over its stability.",
        "date": "07282016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 2-Italy's Monte dei Paschi gets alternative rescue proposal from UBS "
    },
    {
        "content": "LONDON  July 28 Morgan Stanley and Italian lenders UniCredit and Intesa SanPaolo  have rebuffed a proposal by Italy's third-largest lender  Banca Monte dei Paschi di Siena  to back its proposed 5 billion euro ($5.54 billion) cash call  a source familiar with the matter told Reuters.",
        "date": "07282016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Three banks opt out of Monte dei Paschi's proposed 5 bln euro cash call - source "
    },
    {
        "content": "TOKYO  July 28 Nomura Holdings Inc  Japan's largest brokerage  said its first-quarter profit fell 32 percent as investors held onto savings rather than bet on assets like stocks and bonds  hit by uncertain global markets and negative interest rates.",
        "date": "07282016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Japan's Nomura Holdings Q1 net profit skids 32 pct; plans $430 mln share buy-back "
    },
    {
        "content": "* Nomura holdings: to buy back up to 2.6 percent of own shares worth 45 billion yen  Source text for Eikon:  Further company coverage:",
        "date": "07282016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF-Nomura holdings to buy back up to 2.6 percent of own shares worth 45 billion yen "
    },
    {
        "content": "* Takeda working with Nomura Holdings to sell chemicals unit  which could fetch more than $1 billion - Bloomberg  citing sources   Source text: (http://bloom.bg/29Of55y)   (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "07212016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Takeda working with Nomura Holdings to sell chemicals unit - Bloomberg "
    },
    {
        "content": "TOKYO Nomura Holdings Inc's  overseas business remains on track to return to profit by March for the first time in seven years despite Britain's vote to leave the European Union  its chief operating officer said.",
        "date": "07082016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura's overseas division to return to profit by March: COO "
    },
    {
        "content": "* Overseas division to snap six straight years of losses - COO",
        "date": "07082016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura's overseas division to return to profit by March - COO "
    },
    {
        "content": "SINGAPORE/HONG KONG Nomura Holdings expects to grow its Asia ex-Japan wealth management assets by 15 percent to 20 percent a year over the next two to three years by tapping a wider pool of wealthy clients  a senior executive at Japan's biggest brokerage said.",
        "date": "06162016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura sees its Asia ex-Japan wealth assets rising 15-20 percent: executive "
    },
    {
        "content": "SINGAPORE/HONG KONG  June 15 Nomura Holdings  expects to grow its Asia ex-Japan wealth management assets by 15 percent to 20 percent a year over the next two to three years by tapping a wider pool of wealthy clients  a senior executive at Japan's biggest brokerage said.",
        "date": "06162016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "CORRECTED (OFFICIAL)-REUTERS SUMMIT-Nomura sees its Asia ex-Japan wealth assets rising 15-20 pct-exec "
    },
    {
        "content": "TOKYO/LONDON Schroders plc has appointed Shigesuke Kashiwagi  former Chief Financial Officer of Nomura Holdings  as its president and country head of Japan  the London-listed global asset manager said in a statement issued exclusively to Reuters.",
        "date": "06102016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Exclusive: Schroders names ex Nomura CFO Kashiwagi as Japan country head "
    },
    {
        "content": "* Says its unit Nomura Securities buys a 8.62 percent stake (3 300 voting rights) in Tazmo Co Ltd for sale",
        "date": "06072016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Nomura Holdings' unit buys shares in Tazmo for sale "
    },
    {
        "content": "TAIPEI  June 6 Six Taiwanese banks said on Monday they have filed a lawsuit in Taiwan against subsidiaries of Nomura Holdings Inc  accusing the Japanese bank of not extending its portion of a syndicated loan to now-insolvent shoemaker Ultrasonic AG.",
        "date": "06062016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Six Taiwan banks sue Nomura units over loan deal with shoemaker Ultrasonic "
    },
    {
        "content": "* Says it to issue 179 private placement units at 1 249 594 yen per unit with subscription date of May 23 and payment date of May 24 to Nomura Securities",
        "date": "05202016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Hoshino Resorts REIT to issue 179 private placement units "
    },
    {
        "content": "NEW YORK  May 18 Five major banks and four traders were sued on Wednesday in a private U.S. lawsuit claiming they conspired to rig prices worldwide in a more than $9 trillion market for bonds issued by government-linked organizations and agencies.",
        "date": "05182016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Five banks sued in U.S. for rigging $9 trillion agency bond market "
    },
    {
        "content": "* Says it to issue 11 800 private placement new units at  96 250 yen per unit to Nomura Securities",
        "date": "05132016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Star Asia Investment to issue 11 800 new units "
    },
    {
        "content": "TOKYO Japan's biggest brokerage Nomura Holdings  posted its first quarterly loss since 2011 on Wednesday and detailed deep cost cuts designed to get its global business back into the black.",
        "date": "04272016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura outlines deep cost cuts after first quarterly loss in four years "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO/SINGAPORE  May 03 (Fitch) Japan's two largest securities firms  Nomura and  Daiwa  remain vulnerable to market volatility and other uncertainties relating  to the operating environment  says Fitch Ratings. Both companies are likely to  continue to face challenges in the next few quarters after reporting profit  declines in the last financial year that were below Fitch's expectations - but  not significantly so.  Net operating reve",
        "date": "05032016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Fitch: Nomura and Daiwa Face Challenges from Market Volatility "
    },
    {
        "content": "* Aims to cut over $700 million from wholesale division by 2018",
        "date": "04272016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "CORRECTED-UPDATE 2-Nomura outlines deep cost cuts after first quarterly loss in four years "
    },
    {
        "content": "TOKYO  April 27 Nomura Holdings Inc  Chief Operating Officer Tetsu Ozaki said on Wednesday that Japan's biggest brokerage is targeting turning a profit in its overseas business by March 2017  as it  cuts jobs and operations in Europe and the Americas to end a run of six years of net losses.",
        "date": "04272016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura COO Ozaki: Overseas business will turn profitable by March 2017 "
    },
    {
        "content": "* Nomura holdings: to cut wholesale division costs by about 20 percent by March 2020 compared with March 2015  Further company coverage:",
        "date": "04272016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF-Nomura to cut wholesale unit costs by 20 pct "
    },
    {
        "content": "TOKYO  April 27 Nomura Holdings Inc  Japan's biggest brokerage  said on Wednesday it slid to its first quarterly net loss since 2011 in its fiscal fourth quarter as its retail division weakened and its overseas operations lost money for a sixth straight year.",
        "date": "04272016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura slips to Q4 net loss  first quarter in red since 2011 "
    },
    {
        "content": "* to buy back up to 20 billion yen ($180 million) of shares or 0.9 percent   Further company coverage:",
        "date": "04272016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF-Nomura to buy back up to 20 billion yen of shares "
    },
    {
        "content": "* Nomura holdings to cut jobs in Americas and Europe-WSJ  citing sources",
        "date": "04112016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Nomura holdings to cut jobs in Americas and Europe- WSJ  citing sources "
    },
    {
        "content": "April 12 Nomura Holdings Inc is laying off more than two-thirds of its U.S. employees who focus on leveraged buyouts  people familiar with the matter said on Tuesday  as the Japanese bank announced broad strategic changes in Europe and the United States to boost profits.",
        "date": "04122016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura guts leveraged loans group in strategy shift -sources "
    },
    {
        "content": "LONDON/TOKYO  April 12 (IFR/Reuters) - Nomura plans to axe 500-600 staff in Europe and will also cut global markets staff in the US  people familiar with the matter said on Tuesday  as Japan's biggest brokerage tries to stem years of heavy overseas losses.",
        "date": "04122016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE-Nomura to cut 500-600 staff in European equities cull "
    },
    {
        "content": "* Cuts a major blow to Nomura international ambitions   (Adds details of Nomura announcement  analyst comment)",
        "date": "04122016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 2-Nomura beats partial retreat from Europe  Americas as global vision fades "
    },
    {
        "content": "April 12 Nomura Holdings Inc :  - to cut up to 1 000 jobs in Americas  Europe - Nikkei Source text for Eikon:  Further company coverage: ",
        "date": "04122016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF-Nomura Holdings to cut up to 1 000 jobs in Americas  Europe - Nikkei "
    },
    {
        "content": "TOKYO  April 12 Nomura Holdings Inc  plans to cut between 500-600 jobs  mainly in its European cash equities business  as Japan's biggest brokerage tries to stem losses incurred in its long-term drive to become a major global industry player  people familiar with the matter said on Tuesday.",
        "date": "04122016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura to cut around 500-600 jobs in Europe cash equities pullback - sources "
    },
    {
        "content": "* Retail chief Toshio Morita to take senior investment banking position",
        "date": "03012016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 1-Nomura Holdings promotes retail chief in possible move as CEO successor "
    },
    {
        "content": "LONDON/SINGAPORE Singapore Exchange Ltd (SGX)  said it had submitted an initial offer to buy the Baltic Exchange  the hub of the global shipping market  a move aimed at shoring up the Southeast Asian exchange operator's business.",
        "date": "02262016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Singapore Exchange confirms sale talks with Baltic Exchange "
    },
    {
        "content": "TOKYO Nomura Holdings Inc  plans a shift in focus in the United States toward client-oriented services from market-based trading  the chief executive said  in its latest attempt to establish a profitable business in a major overseas economy.",
        "date": "02102016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura CEO aims to finally crack U.S. with shift to M&A advisory "
    },
    {
        "content": "TOKYO Nomura Holdings Inc  on Tuesday said it hoped to get an earnings boost from the Bank of Japan's move to negative interest rates  after a bout of risk aversion among retail investors contributed to a near-halving of third-quarter profit.",
        "date": "02022016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura eyes boost from BOJ's negative rates after third-quarter profit halves "
    },
    {
        "content": "* Volatile markets prompted Q3 wait-and-see mode -CFO   (Recasts  adds CFO and analyst comments  context)",
        "date": "02022016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 2-Nomura eyes boost from BOJ's negative rates after Q3 profit halves "
    },
    {
        "content": "TOKYO  Feb 2 Nomura Holdings Inc on Tuesday said net profit fell by nearly half in October-December  as volatile markets kept retail investors away.",
        "date": "02022016",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Japan's Nomura Holding's Q3 profit nearly halves as retail revenue drops "
    },
    {
        "content": "Dec 17 Tokyo-based financial services provider Nomura Holdings Inc appointed Jim Leng as non-executive chairman of its unit  Nomura Europe Holdings Plc.",
        "date": "12172015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura hires Leng as non-executive chairman for European unit "
    },
    {
        "content": "TOKYO  Dec 1 Japan's biggest brokerage Nomura Holdings Inc said it will invest further in its Americas operations over the next two to three years  seeking to strengthen its M&A advisory and primary equity and debt businesses in the region.",
        "date": "12012015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 1-Japan's Nomura to invest further in Americas operations "
    },
    {
        "content": "MILAN  Nov 27 Milan prosecutors will need to submit a new request that Japanese bank Nomura be sent to trial in Italy over a 2009 derivative trade with Italian lender Monte dei Paschi di Siena  legal sources said on Friday.",
        "date": "11272015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "New request needed to try Nomura in Monte Paschi case in Italy-sources "
    },
    {
        "content": "Nov 17 Nomura Holdings Inc's investment banking division has appointed John Moran as senior adviser at its London office.",
        "date": "11172015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura appoints John Moran as senior adviser  investment banking "
    },
    {
        "content": "Nov 16 Japanese investment bank Nomura Holdings Inc said it hired three managing directors for its emerging markets group in the Americas.",
        "date": "11162015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura hires 3 managing directors for emerging markets "
    },
    {
        "content": "NEW YORK  Nov 16 (IFR) - Nomura has hired three managing directors for its emerging markets group in New York following the departure of much of its EM sales and trading team to Jefferies earlier this year.",
        "date": "11162015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "MOVES: Nomura bolsters EM team with three hires "
    },
    {
        "content": "TOKYO  Nov 2 Japan's Ashikaga Holdings Co Ltd  and Joyo Bank Ltd said on Monday they had agreed to merge in a deal that would create the country's third-largest regional lender.",
        "date": "11022015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Japan regional lenders Joyo  Ashikaga agree to merge "
    },
    {
        "content": "TOKYO  Oct 26 Japanese banks Ashikaga Holdings Co Ltd and Joyo Bank Ltd said on Monday they were in merger talks  in a deal that would create the country's third-largest regional lender by assets as the industry faces bleak growth prospects.",
        "date": "10262015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 1-Japanese regional lenders Ashikaga and Joyo in merger talks "
    },
    {
        "content": "MILAN  Oct 28 A banking foundation shareholder in Italian lender Monte dei Paschi di Siena said it will seek more than 300 million euros ($332 million) in damages from former bank managers and Japanese broker Nomura  over a loss-making derivative trade.",
        "date": "10282015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Italy's Monte Paschi shareholder to seek damages from Nomura "
    },
    {
        "content": "TOKYO Nomura Holdings Inc  said on Wednesday its quarterly net profit fell 12 percent as Japan's top investment bank was hurt by volatility in global markets caused by China's economic slowdown and worries about U.S. interest rates rising.",
        "date": "10282015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Japan investment bank Nomura's quarterly profit slides on market turmoil "
    },
    {
        "content": "* Investment banking is a bright spot in quarter   (Adds details of results  performance of segments)",
        "date": "10282015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 1-Japan investment bank Nomura's quarterly profit slides on market turmoil "
    },
    {
        "content": "Investment bank Nomura Holdings Inc appointed Johnny Heng as chief investment officer of its wealth management unit in Asia  excluding Japan.",
        "date": "10222015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura names Johnny Heng investment head for Asia wealth management "
    },
    {
        "content": "TOKYO  Oct 28 Japan's top investment bank Nomura Holdings Inc said on Wednesday its quarterly net profit fell after it booked costs to settle a lawsuit with Italian bank Monte dei Paschi.",
        "date": "10282015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Japan investment bank Nomura's quarterly net falls after lawsuit settled "
    },
    {
        "content": "Oct 22 Investment bank Nomura Holdings Inc  appointed Johnny Heng as chief investment officer of its wealth management unit in Asia  excluding Japan.",
        "date": "10222015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "MOVES-Nomura names Johnny Heng investment head for Asia wealth management "
    },
    {
        "content": "LONDON  Oct 7 Peter Hurd has taken on the role as Head of EMEA High Yield and Leveraged Loan Capital Markets at Nomura  banking sources said on Wednesday.",
        "date": "10072015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Hurd takes over as Nomura EMEA lev fin head "
    },
    {
        "content": "MILAN/TOKYO Monte dei Paschi reached a settlement with Japan's Nomura Holdings to close a loss-making derivative trade  end years of litigation and remove a big financial burden to boost its chances of finding a buyer.",
        "date": "09242015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Monte dei Paschi closes costly derivative trade with Nomura "
    },
    {
        "content": "* MPS lifts burden on balance sheet through settlement with Nomura",
        "date": "09242015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 3-Monte dei Paschi closes costly derivative trade with Nomura "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO/HONG KONG  September 15 (Fitch) Fitch Ratings has upgraded the Long-Term  Issuer Default Ratings (IDRs) of Daiwa Securities Group Inc. (Daiwa Securities  Group) and its wholly owned subsidiary  Daiwa Securities Co. Ltd. (Daiwa  Securities) to 'A-' from 'BBB+'. Fitch has also affirmed the Long-Term IDRs of  Nomura Holdings  Inc. (Nomura Holdings) and of its wholly owned subsidiaries  Nomura Securities Co.  Ltd. (Nomura Securities) ",
        "date": "09152015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Fitch Upgrades Daiwa to 'A-'; Affirms Nomura at 'A-' "
    },
    {
        "content": "Sept 10 Three former Nomura Holdings Inc  traders on Thursday pleaded not guilty to criminal charges that they deceived customers about bond prices in a fraudulent effort to boost profits  federal prosecutors said.",
        "date": "09102015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura traders plead not guilty to deceiving bond customers "
    },
    {
        "content": "U.S. prosecutors on Tuesday charged three former traders at Nomura Holdings Inc with misleading investors by lying about mortgage bond prices after the financial crisis.",
        "date": "09082015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "U.S. charges ex-Nomura mortgage bond traders for defrauding investors "
    },
    {
        "content": "Sept 8 U.S. prosecutors on Tuesday charged three former traders at Nomura Holdings Inc with misleading investors by lying about mortgage bond prices after the financial crisis.",
        "date": "09082015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 3-U.S. charges ex-Nomura mortgage bond traders for defrauding investors "
    },
    {
        "content": "Sept 1 Nomura Holdings Inc appointed Lee Chee Pin as head of financial products and solutions for wealth management in Asia ex-Japan  based in Singapore.",
        "date": "09012015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura appoints Lee Chee Pin to Asia wealth management team "
    },
    {
        "content": "ROME  Aug 12 Banca Monte dei Paschi di Siena  has cut its exposure to Japanese bank Nomura  to within regulatory limits as required by the European Central Bank  the Italian lender said on Wednesday.",
        "date": "08122015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Monte Paschi cuts Nomura exposure to within regulatory levels "
    },
    {
        "content": "* Q1 net profit 68.7 bln Y vs 55.3 bln avg estimate of 2 analysts",
        "date": "07292015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 1-Nomura's quarterly net profit more than triples on stocks boom "
    },
    {
        "content": "RESULTS             RESULT          FORECAST   Revenues           508.45              462.15",
        "date": "07292015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "CORRECT-TABLE-Nomura Holdings -Q1 group results (SEC) "
    },
    {
        "content": "TOKYO  July 29 Japanese brokerage Nomura Holdings's quarterly net profit more than tripled as strong demand from customers to trade domestic stocks boosted its retail revenue.",
        "date": "07292015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura's quarterly net profit more than triples amid stocks boom "
    },
    {
        "content": "KARUIZAWA  Japan  July 23 The yen's weakness is not a problem for Japanese industry around current levels  Nomura Holdings Inc Chairman Nobuyuki Koga said on Thursday.",
        "date": "07232015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura chairman says dlr at 120-125 yen no problem for Japan industry "
    },
    {
        "content": "* Nomura exposure brought back to within regulatory limits -sources",
        "date": "07252015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Monte dei Paschi cuts exposure to Nomura -sources "
    },
    {
        "content": "* To start selling investment trusts at post offices in Feb 2016",
        "date": "07222015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 1-Japan Post to launch investment trust JV with Nomura  SMTB "
    },
    {
        "content": "TOKYO  July 22 Japan Post Holdings Co   Sumitomo Mitsui Trust Bank Ltd  and Nomura Securities Co said on Wednesday they had agreed to set up a joint venture to sell investment trusts.",
        "date": "07222015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Japan Post  Nomura  Sumitomo Mitsui to set up investment trust JV "
    },
    {
        "content": "NEW YORK The Federal Housing Finance Agency disclosed on Thursday that it paid two law firms over $373 million since 2010 to pursue litigation against several banks over mortgage-backed securities sold to Fannie Mae and Freddie Mac before the financial crisis.",
        "date": "07162015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Exclusive: U.S. housing regulator paid law firms $373 million to sue banks "
    },
    {
        "content": "July 21 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "07212015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Barclays  Nomura  HSBC  Permal "
    },
    {
        "content": "FRANKFURT  July 2 Japanese investment bank Nomura named Walter Heindl as country head for Germany and Austria  replacing Koichi Katakawa who held the position since 2006.",
        "date": "07022015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura names Walter Heindl country head for Germany  Austria "
    },
    {
        "content": "* Says to invest in unit of Philippines' BDO Unibank; BDO to hold 51 percent  Nomura 49 percent",
        "date": "06292015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "BRIEF-Nomura to invest in unit of Philippines' BDO Unibank "
    },
    {
        "content": "LONDON  June 4 (IFR) - Standard Bank's former head of emerging markets research ex-Africa Timothy Ash is to join Japanese rival Nomura in a senior research position  according to two sources with knowledge of the information.",
        "date": "06052015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Emerging markets analyst Ash heads to Nomura "
    },
    {
        "content": "TOKYO  May 28 Japan's biggest brokerage Nomura Holdings Inc plans to keep a lid on costs as it chases a profit at its loss-making overseas business for the first time in six years  a target some analysts see as tough amid looming financial market jitters.",
        "date": "05282015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "CORRECTED-Nomura sees end to overseas business losses; analysts see tough markets ahead "
    },
    {
        "content": "May 18 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05182015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "MOVES-Nomura Holdings  Deutsche Bank  Arma Partners  City Noble "
    },
    {
        "content": "* Nomura's new mutual fund investing in high ROE firms in focus     * Takeda tumbles on weaker-than-expected profit forecast     * Machinery data has limited impact on market      By Ayai Tomisawa     TOKYO  May 18 Japan's Nikkei share average rose on Monday morning to a 2-1/2-week high  bolstered by gains in the insurance sector after Dai-ichi Life announced higher shareholder payouts.     The Nikkei 225 gained 0.5 percent to 19 828.65 after rising as high as 19 849.75  its loftiest",
        "date": "05182015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nikkei rises to 2-1/2-week high  insurers support; Dai-ichi soars "
    },
    {
        "content": "NEW YORK  May 15 A U.S. judge on Friday ordered Nomura Holdings Inc and Royal Bank of Scotland Group Plc to pay a collective $806 million for making false statements in selling mortgage-backed securities to Fannie Mae  and Freddie Mac.",
        "date": "05152015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura  RBS must pay $806 mln in mortgage bond case-U.S. judge "
    },
    {
        "content": "NEW YORK A U.S. judge on Friday ordered Nomura Holdings Inc  and Royal Bank of Scotland Group Plc  to pay a collective $806 million for making false statements in selling mortgage-backed securities to Fannie Mae  and Freddie Mac .",
        "date": "05152015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura  RBS must pay $806 million in mortgage bond case: U.S. judge "
    },
    {
        "content": "NEW YORK  May 15 A U.S. judge on Friday ordered Nomura Holdings Inc and Royal Bank of Scotland Group Plc to pay a collective $806 million for making false statements in selling mortgage-backed securities to Fannie Mae  and Freddie Mac.",
        "date": "05152015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 1-Nomura  RBS must pay $806 mln in mortgage bond case-U.S. judge "
    },
    {
        "content": "NEW YORK  May 12 A U.S. judge's ruling that Nomura Holdings Inc and Royal Bank of Scotland Group Plc made false statements selling mortgage-backed securities to Fannie Mae and Freddie Mac could result in a judgment exceeding $805 million  a U.S. regulator's lawyer said on Tuesday.",
        "date": "05122015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura  RBS face $805 million damages after U.S. ruling -lawyer "
    },
    {
        "content": "NEW YORK A U.S. judge's ruling that Nomura Holdings Inc and Royal Bank of Scotland Group Plc made false statements selling mortgage-backed securities to Fannie Mae and Freddie Mac could result in a judgment exceeding $805 million  a U.S. regulator's lawyer said on Tuesday.",
        "date": "05122015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura  RBS face $805 million damages after U.S. ruling: lawyer "
    },
    {
        "content": "* Exposure at 48.8 percent of total capital  well above limit",
        "date": "05122015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 1-Monte Paschi says Nomura exposure rose to 4.7 bln euros at end-March "
    },
    {
        "content": "NEW YORK A U.S. judge on Monday ruled that Nomura Holdings Inc made false statements in selling mortgage-backed securities to Fannie Mae and Freddie Mac ahead of the 2008 financial crisis.",
        "date": "05112015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura misled Fannie  Freddie on mortgage bonds  U.S. judge finds "
    },
    {
        "content": "NEW YORK  May 11 A U.S. judge on Monday ruled that Nomura Holdings Inc made false statements in selling mortgage-backed securities to Fannie Mae and Freddie Mac ahead of the 2008 financial crisis.",
        "date": "05112015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 2-Nomura misled Fannie  Freddie on mortgage bonds  U.S. judge finds "
    },
    {
        "content": "NEW YORK  May 11 A federal judge on Monday ruled that Nomura Holdings Inc misled Fannie Mae  and Freddie Mac by making false statements about the quality of mortgages that backed securities it sold.",
        "date": "05112015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "US judge rules for FHFA over Nomura in mortgage bond lawsuit "
    },
    {
        "content": "* Banks sounding each other out for possible trade closure-sources",
        "date": "04302015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Monte Paschi  Nomura in informal talks to end derivative row -sources "
    },
    {
        "content": "* Annual net profit 225 bln yen  10 pct higher than consensus",
        "date": "04302015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "CORRECTED-UPDATE 1-Nomura profit hits 9-year high on asset management  M&A gains "
    },
    {
        "content": "MILAN  April 24 Milan prosecutors are requesting that troubled lender Monte dei Paschi di Siena and Japanese bank Nomura be sent to trial in Italy over a 2009 derivative trade  judicial sources said.",
        "date": "04242015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Italian prosecutors seek trial for Monte Paschi  Nomura over derivative trade "
    },
    {
        "content": "TOKYO  April 30 Nomura Holdings on Thursday said annual net profit rose 5.2 percent on a strong performance by its retail and investment banking divisions although its overseas operations were in the red for a fifth year in a row.",
        "date": "04302015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "CORRECTED-Nomura annual net profit climbs to 9-yr high on strong retail performance "
    },
    {
        "content": "* Q4 net income 82 billion yen ($691 million) versus 61.3 billion yen a year ago",
        "date": "04302015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF-Nomura Q4 net income 82 bln yen versus 61.3 bln yen a year ago "
    },
    {
        "content": "SIENA  Italy April 16 The chairman of Italian bank Monte dei Paschi di Siena said the lender was re-calculating damages it is seeking from Japanese bank Nomura  over a 2009 derivative contract after new allegations by Milan prosecutors.",
        "date": "04162015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Monte Paschi says re-calculating claims against Nomura after new allegations "
    },
    {
        "content": "MILAN  April 10 Italian bank Monte dei Paschi di Siena said on Friday it had overstepped regulatory limits with regards to its financial exposure to Japanese bank Nomura  in a surprise disclosure that could raise questions about whether the Italian lender's plans to raise capital and seek a buyer are on track.",
        "date": "04102015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 1-Monte Paschi says Nomura exposure more than one third of capital "
    },
    {
        "content": "MILAN  April 10 Italy's third largest bank Monte dei Paschi di Siena said on Friday its exposure to Japanese investment bank Nomura exceeded regulatory limits and was over one third of its core capital at the end of last year.",
        "date": "04102015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Monte Paschi says Nomura exposure more than one third of capital "
    },
    {
        "content": "NEW YORK A lawyer for Nomura Holdings Inc argued on Thursday that a U.S. regulator relied on \"voodoo science\" to pursue claims that the bank made false statements in selling $2 billion in mortgage-backed securities to Fannie Mae and Freddie Mac.",
        "date": "04092015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura blasts U.S. agency at mortgage bond trial's close "
    },
    {
        "content": "NEW YORK  April 9 A lawyer for Nomura Holdings Inc argued on Thursday that a U.S. regulator relied on \"voodoo science\" to pursue claims that the bank made false statements in selling $2 billion in mortgage-backed securities to Fannie Mae and Freddie Mac.",
        "date": "04092015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "UPDATE 1-Nomura blasts U.S. agency at mortgage bond trial's close "
    },
    {
        "content": "NEW YORK  April 9 A lawyer for Nomura Holdings Inc argued Thursday that a U.S. regulator relied on \"voodoo science\" in suing the bank for making false statements in selling $2 billion in mortgage-backed securities to Fannie Mae and Freddie Mac.",
        "date": "04092015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura blasts U.S. agency's case as $1 bln mortgage bond trial closes "
    },
    {
        "content": "NEW YORK  March 31 Former Fannie Mae  CEO Daniel Mudd testified on Tuesday in a $1 billion civil trial over losses the company suffered on mortgage-backed securities and said it did not predict the severe decline in U.S. housing prices during the financial crisis.",
        "date": "03312015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Ex-Fannie Mae CEO testifies in $1 bln mortgage trial of Nomura  RBS "
    },
    {
        "content": "NEW YORK Former Fannie Mae  CEO Daniel Mudd testified on Tuesday in a $1 billion civil trial over losses the company suffered on mortgage-backed securities and said it did not predict the severe decline in U.S. housing prices during the financial crisis.",
        "date": "04012015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Ex-Fannie Mae CEO testifies in $1 billion mortgage trial of Nomura  RBS "
    },
    {
        "content": "NEW YORK Former Fannie Mae  CEO Daniel Mudd testified on Tuesday in a $1 billion civil trial over losses the company suffered on mortgage-backed securities and said it did not predict the severe decline in U.S. housing prices during the financial crisis.",
        "date": "03312015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Ex-Fannie Mae CEO testifies in $1 billion mortgage trial of Nomura  RBS "
    },
    {
        "content": "NEW YORK In 2007  a Royal Bank of Scotland Group Plc employee emailed his boss with his view of a sample of mortgages underlying a bond that the bank was underwriting: \"This one is crap.\"",
        "date": "03262015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura  RBS 'crap' emails come into play in $1 bln mortgage bond trial "
    },
    {
        "content": "NEW YORK In 2007  a Royal Bank of Scotland Group Plc employee emailed his boss with his view of a sample of mortgages underlying a bond that the bank was underwriting: \"This one is crap.\"",
        "date": "03262015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura  RBS 'crap' emails come into play in $1 billion mortgage bond trial "
    },
    {
        "content": "NEW YORK  March 26 In 2007  a Royal Bank of Scotland Group Plc employee emailed his boss with his view of a sample of mortgages underlying a bond that the bank was underwriting: \"This one is crap.\"",
        "date": "03262015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "REFILE-Nomura  RBS 'crap' emails come into play in $1 bln mortgage bond trial "
    },
    {
        "content": "NEW YORK A U.S. housing regulator is set to take two of the world's biggest banks to trial on Monday to try and recoup more than $1 billion in damages over mortgage bonds sold to government-run mortgage finance companies ahead of the 2008 economic crisis.",
        "date": "03132015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "Nomura  RBS face U.S. mortgage trial; $1 billion damages at stake "
    },
    {
        "content": "NEW YORK  March 16 A U.S. housing regulator urged a federal judge on Monday to award it $1.1 billion due to false claims made about \"crap\" mortgages underlying securities sold by Nomura Holdings Inc to Fannie Mae and Freddie Mac ahead of the 2008 financial crisis.",
        "date": "03162015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "U.S. agency seeks $1.1 bln as Nomura  RBS face mortgage bond trial "
    },
    {
        "content": "NEW YORK A U.S. housing regulator is set to take two of the world's biggest banks to trial on Monday to try and recoup more than $1 billion in damages over mortgage bonds sold to government-run mortgage finance companies ahead of the 2008 economic crisis.",
        "date": "03132015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Preview: Nomura  RBS face U.S. mortgage trial; $1 bln damages at stake "
    },
    {
        "content": "NEW YORK A U.S. housing regulator urged a federal judge on Monday to award it $1.1 billion due to false claims made about \"crap\" mortgages underlying securities sold by Nomura Holdings Inc to Fannie Mae and Freddie Mac ahead of the 2008 financial crisis.",
        "date": "03162015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "U.S. agency seeks $1.1 billion as Nomura  RBS face mortgage bond trial "
    },
    {
        "content": "Feb 10 Nomura Holdings Inc  Japan's largest investment bank and brokerage  has named Jaj Singh as head of research on ASEAN banks  according to an internal memo seen by Reuters on Tuesday.",
        "date": "02102015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Nomura appoints head of ASEAN banks research - memo "
    },
    {
        "content": "* Fixed income falls  overseas ops post loss   (adds analyst comments  recasts)",
        "date": "01292015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 2-Nomura's quarterly profit boosted by strong share market "
    },
    {
        "content": "(Second \"Revenues\" in table is revenues(excluding financing costs)) Jan 29 (Reuters)-            Nomura Holdings Inc            CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                     9 months ended      9 months ended       Year to                    Dec 31  2014        Dec 31  2013     Mar 31  2015                       LATEST             YEAR-AGO          COMPANY                         RESULTS             RESULT          FORECAST      Revenues       ",
        "date": "01292015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "REFILE-TABLE-Nomura Holdings -9-MTH group results (SEC) "
    },
    {
        "content": "TOKYO  Jan 29 Nomura Holdings Inc on Thursday reported a net profit of 70 billion yen ($595.24 million) for its third quarter  as strength in its retail business offset weakness in its overseas bond-trading operations.",
        "date": "01292015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura Holdings Q3 net profit 70 bln yen vs 48 bln yen year earlier "
    },
    {
        "content": "* Says to buy back up to 1 percent of its own shares for as much as 30 billion yen ($255 million)",
        "date": "01292015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "BRIEF-Nomura Holdings announces share repurchase plan "
    },
    {
        "content": "HONG KONG  Jan 20 Nomura Holdings Inc  will cut at least 12 jobs in Asian equities as part of a strategic rethink to refocus on sales to clients  as opposed to proprietary trading or other parts of the business  a source with direct knowledge of the matter told Reuters on Tuesday.",
        "date": "01202015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 1-Japan's Nomura to cut 12 jobs in Asian equities "
    },
    {
        "content": "TOKYO  Jan 19 Japan's Nomura Securities said on Monday it will lift wages for entry-level workers from April  answering a call by Prime Minister Shinzo Abe for companies to boost pay to help the economy recover from recession.",
        "date": "01192015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "UPDATE 1-Nomura Securities  riding Abenomics wave  lifts entry-level wages "
    },
    {
        "content": "TOKYO  Jan 19 Japan's Nomura Securities said on Monday it will lift wages for entry-level workers  answering a call by Prime Minister Shinzo Abe for companies to boost pay to help the economy recover from recession.",
        "date": "01192015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "Nomura Securities  riding Abenomics wave  lifts entry-level wages "
    },
    {
        "content": "Jan 5 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01052015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "topStory",
        "symbol": "NMR",
        "title": "MOVES-Citigroup  FTI Consulting  Berkshire Partners  Nomura "
    },
    {
        "content": "Jan 5 Nomura Holdings Inc named Amanda Chen deputy head of its wealth management arm for Asia  ex-Japan.",
        "date": "01052015",
        "name": "Nomura Holdings Inc ADR",
        "news_type": "normal",
        "symbol": "NMR",
        "title": "MOVES-Amanda Chen named deputy head of Nomura's wealth management unit "
    }
]