[
    {
        "content": "JOHANNESBURG  Nov 7 Finnish network equipment maker Nokia will trial its 5G technology in South Africa in collaboration with Vodacom Group  the firms said on Tuesday  as they seek to provide faster data delivery.",
        "date": "11072017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Finland's Nokia joins Vodacom to trial 5G technology in South Africa "
    },
    {
        "content": "* Says Nokia and Vodacom have signed MoU under which the companies will trial Nokia 5G technology in South Africa Source text for Eikon: Further company coverage: (Helsinki Newsroom)",
        "date": "11072017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia signs MoU with Vodacom on South Africa 5G trials "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  October 30 (Fitch) Nokia's weak near-term outlook for its networks business reflects a downturn in telecom sector spending already factored into Fitch's rating case for the company. The future path of its 'BB+'/Positive rating is most likely to be determined by whether it can generate sufficient free cash flow through the cycle  achieve its restructuring cost savings targets  and maintain a solid cash position while managing mul",
        "date": "10302017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Fitch: Cash Flow  not Market Volatility  is Key to Nokia Rating "
    },
    {
        "content": "HELSINKI  Oct 31 HMD Global  the Finnish company that owns the rights to use Nokia's brand for mobile phones  launched a new smartphone with a global average retail price of 99 euros ($115).",
        "date": "10312017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "HMD Global launches $115 Nokia smartphone "
    },
    {
        "content": "* ‍Qualcomm Technologies - Co  AT&T  Ford  Nokia to help accelerate development of connected cars with first announced cellular-V2X trials in the U.S.​ Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-‍Qualcomm  AT&T  Ford and Nokia launch cellular-V2X connected car technology trials "
    },
    {
        "content": "HELSINKI/LONDON Nokia  reported a sharp drop in quarterly earnings at its main telecom network gear business on Thursday  warning the market had turned more challenging due to tough competition in China and consolidation among wireless carriers.",
        "date": "10262017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Shrinking network equipment market hits Nokia "
    },
    {
        "content": "HELSINKI Nokia is still reviewing its options for its undersea cables unit  a business that underpins the global Internet  chief executive Rajeev Suri said on Thursday.",
        "date": "10262017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia still reviewing options for undersea cables unit: CEO "
    },
    {
        "content": "* ALTRAN AND NOKIA EXPAND STRATEGIC COLLABORATION TO DELIVER INNOVATIVE IOT SOLUTIONS FOR AUTO AND RAILWAYS SECTORS‍​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "10192017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Altran and Nokia expand strategic collaboration "
    },
    {
        "content": "HELSINKI  Oct 26 Nokia is still reviewing its options for its undersea cables unit  a business that underpins the global Internet  chief executive Rajeev Suri said on Thursday.",
        "date": "10262017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia still reviewing options for undersea cables unit -CEO "
    },
    {
        "content": "* Shares fall as much as 16 percent (Adds context  valuation  updates share move)",
        "date": "10262017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 3-Shrinking network equipment market hits Nokia "
    },
    {
        "content": "* Says Nokia and Bosch Connected Devices and Solutions GmbH have announced a strategic partnership to more easily deploy industrial IoT solutions from sensors through to applications Source text for Eikon: Further company coverage: (Helsinki Newsroom)",
        "date": "10182017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia announces IoT partnership with Bosch "
    },
    {
        "content": "* NOKIA FOCUSES ON PATENT  BRAND AND TECHNOLOGY LICENSING AND TARGETS FASTER GROWTH IN DIGITAL HEALTH WITH SHARPENED STRATEGY FOR NOKIA TECHNOLOGIES",
        "date": "10102017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia Technology: personnel reductions to affect up to 310 employees "
    },
    {
        "content": "HELSINKI  Oct 6 He runs a company that is a byword for technological innovation -- but Nokia's chairman had no qualms about going back to school to learn more about artificial intelligence (AI).",
        "date": "10062017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "AI on the menu as Nokia chairman goes back to school "
    },
    {
        "content": "PARIS Nokia  has reaffirmed its commitment to creating research and development jobs in France  the country's junior economy minister said on Monday  though the Finnish telecoms maker will still be able to cut hundreds of jobs in other areas.",
        "date": "10022017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia committed to creating R&D jobs in France: minister "
    },
    {
        "content": "* To help Idea Cellular meet bandwidth demand by deploying 1830 photonic services switch based wavelength division multiplexing (WDM) solution​ Source text - Nokia will help Idea Cellular meet ever-increasing bandwidth demand by deploying Nokia's 1830 Photonic Services Switch (PSS) based Wavelength Division Multiplexing (WDM) solution. The optical transport network solution will be implemented across fiber-constrained geographies on the Idea network. Once the technology is deployed  Idea will be",
        "date": "09272017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia to help Idea Cellular meet bandwidth demand "
    },
    {
        "content": "PARIS Nokia's  plan to cut almost 600 jobs in France is suspended until Oct. 2  French junior economy minister Benjamin Griveaux said on Tuesday after meeting the head of the Finnish telecom equipment maker's French unit.",
        "date": "09192017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia's French jobs cut plan suspended until October 2: French minister "
    },
    {
        "content": "* Says to modernize private nationwide LTE network for Finland's Ukkoverkot  supporting industrial and public safety services",
        "date": "09192017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins LTE network order in Finland "
    },
    {
        "content": "FRANKFURT  Sept 14 HERE  the digital mapping company controlled by Germany's premium carmakers  aims to expand its business not only to offer navigation for self-driving cars but also drones and advanced robotics  Chief Executive Edzard Overbeek told Reuters.",
        "date": "09142017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Mapping firm HERE looks beyond driverless cars "
    },
    {
        "content": "HELSINKI Nokia  will start to book additional revenue from the current quarter after a ruling by an arbitration court on payments from South Korea's LG Electronics  for using its smartphone patents.",
        "date": "09182017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia says to get sales boost after patent ruling "
    },
    {
        "content": "HELSINKI  Sept 18 Nokia will start to book additional revenue from the current quarter after a ruling by an arbitration court on payments from South Korea's LG Electronics for using its smartphone patents.",
        "date": "09182017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 1-Nokia says to get sales boost after patent ruling "
    },
    {
        "content": "HELSINKI  Sept 18 Nokia said on Monday it had received a decision in patent licence arbitration with LG Electronics.",
        "date": "09182017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia gets decision in patent arbitration with LG "
    },
    {
        "content": "FRANKFURT  Sept 12 German automotive supplier Continental is still interested in working with digital mapping firm HERE  Chief Executive Elmar Degenhart said on Tuesday.",
        "date": "09122017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Continental still interested in mapping firm HERE - CEO "
    },
    {
        "content": "* Qualcomm and Nokia to collaborate on driving wide-scale mobile 5G NR deployments to meet growing market demand",
        "date": "09112017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Qualcomm and Nokia to collaborate on driving wide-scale mobile 5G NR deployments "
    },
    {
        "content": "* STMicroelectronics to be removed from the CAC Next 20 index",
        "date": "09072017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Euronext announces annual revision of French indices "
    },
    {
        "content": "PARIS  Sept 7 The Paris-based Euronext bourse said on Thursday that it had decided to remove Nokia from its CAC 40 index in an annual review  and would instead include STMicroelectronics.",
        "date": "09072017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Euronext to remove Nokia from CAC 40 index  include STMicroelectronics "
    },
    {
        "content": "* Telenor and Telia have signed a managed services contract with Nokia that will see the company manage their joint mobile radio network in Denmark",
        "date": "08222017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins order from Telia and Telenor in Denmark "
    },
    {
        "content": "HELSINKI  Aug 16 HMD Global  the Finnish start-up looking to reinvigorate the Nokia phone brand  unveiled the Nokia 8 on Wednesday  hoping to cash in on rising consumer demand for high-quality audio and video features.",
        "date": "08162017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "New Nokia 8 phone targets surging demand for video-streaming "
    },
    {
        "content": "* SIGNS FRAMEWORK AGREEMENTS WITH NOKIA  HUWAWEI AND ERICSSON TO MODERNIZE ITS MOBILE NETWORK",
        "date": "08142017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Saudi's Mobily says Nokia  Huwawei  Ericsson to modernize co's network "
    },
    {
        "content": "Network equipment makers Nokia and Ericsson on Tuesday urged a federal appeals court not to reverse a recent decision out of the Eastern District of Texas that allows more patent infringement cases to be heard in the plaintiff-friendly jurisdiction.",
        "date": "08092017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia and Ericsson urge Federal Circuit not to undo patent case venue ruling "
    },
    {
        "content": "HELSINKI Network equipment maker Nokia reported a jump in profit on Thursday thanks to a patent deal with Apple and gains in market share though it warned the network business could slow by more than expected this year.",
        "date": "07272017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia profits surge after Apple deal and network gains "
    },
    {
        "content": "* Shares rise as much as 6 pct (Adds comments  outlook details  share reaction)",
        "date": "07272017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 2-Nokia profits surge after Apple deal and network gains "
    },
    {
        "content": "HELSINKI  July 27 Finnish network equipment maker Nokia reported larger than expected quarterly profits on Thursday thanks to a patent deal with Apple along with improving profitability at its network business but warned its key market would slow.",
        "date": "07272017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia beats quarterly market forecasts but lowers networks outlook "
    },
    {
        "content": "HELSINKI Telecoms gear maker Nokia is likely to see a boost to quarterly earnings on Thursday from a recent patent licensing deal with Apple that offsets weak demand in its main equipment business from network operators.",
        "date": "07252017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Patents boost to offset weak networks for Nokia "
    },
    {
        "content": "BERLIN  July 20 German car manufacturing supplier Continental is in talks to acquire an 8-10 percent stake in the digital mapping firm HERE which is now controlled by Germany's leading carmakers  Manager Magazin said on Thursday  citing unnamed company sources.",
        "date": "07202017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 1-Continental to buy 8-10 pct stake in mapping firm HERE - Magazin "
    },
    {
        "content": "FRANKFURT  July 19 HMD Global  the Finnish company that owns the rights to use Nokia's brand on mobile phones and tablets  said Chief Executive Arto Nummela is leaving the company with immediate effect.",
        "date": "07192017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "CEO of Nokia phone maker HMD Global steps down "
    },
    {
        "content": "* Says to provide an advanced communications network to the Placer County Water Agency (PCWA) in Northern California to support its hydro-electric power generation and water distribution services Source text for Eikon: Further company coverage: (Helsinki Newsroom)",
        "date": "07122017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins network order from California utility PCWA "
    },
    {
        "content": "* Says Nokia and Worldlink to build Nepal's first 100g optical network for super-fast broadband services for consumers and businesses",
        "date": "07102017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins order from Nepal's Worldlink "
    },
    {
        "content": "* Radware Ltd - ‍OEM agreement with Nokia now includes Radware's attack mitigation products​",
        "date": "07132017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Radware says ‍OEM agreement with Nokia now includes its attack mitigation products​ "
    },
    {
        "content": "HELSINKI  July 5 Telecoms network equipment maker Nokia and Chinese handset maker Xiaomi Technology have signed a patent licencing agreement  the companies said on Wednesday.",
        "date": "07052017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia  China's Xiaomi sign patent deal "
    },
    {
        "content": "HELSINKI  July 5 Telecoms network equipment maker Nokia and Chinese smartphone maker Xiaomi Technology have signed a patent licencing agreement  the companies said on Wednesday.",
        "date": "07052017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 1-Nokia  China's Xiaomi sign patent deal "
    },
    {
        "content": "* Says  have signed a business collaboration agreement and a multi-year patent agreement",
        "date": "07052017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and Xiaomi sign cooperation and patent agreements "
    },
    {
        "content": "HELSINKI  June 30 Nokia has appointed senior Samsung executive Gregory Lee as head of its Technologies unit and member of the group leadership team  the telecoms network equipment maker said on Friday.",
        "date": "06302017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia appoints Samsung executive as head of Technologies "
    },
    {
        "content": "* Says to supply Shanghai Oriental Pearl Group with advanced wireless networking technology for smart city services Source text for Eikon: Further company coverage: (Helsinki Newsroom)",
        "date": "06302017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins LTE network order in Shanghai "
    },
    {
        "content": "* Says has announced the successful completion of its acquisition of Comptel Corporation Source text for Eikon: Further company coverage: (Helsinki Newsroom)",
        "date": "06292017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia completes acquisition of Comptel "
    },
    {
        "content": "* Says establishes special unit to help large-scale Chinese internet firms expand overseas",
        "date": "06292017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia establishes unit to support Chinese internet firms expand overseas "
    },
    {
        "content": "* Infracapital and Nokia named preferred bidder for Polish fibre broadband network",
        "date": "06152017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Infracapital and Nokia named preferred bidder for Polish fibre broadband network "
    },
    {
        "content": "* says Nokia and China Mobile are deploying millions of home gateways to provide residential customers across 29 different provinces in China with access to fiber-based ultra-broadband applications and intelligent home services",
        "date": "06122017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia signs ultra-broadband access technology deal with China Mobile "
    },
    {
        "content": "HELSINKI  June 9 Telecom network equipment maker Nokia has completed lay-off talks in its home country Finland and will as a result cut 170 jobs  the company said on Friday.",
        "date": "06092017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia cuts 170 jobs in Finland "
    },
    {
        "content": "SAN FRANCISCO Nokia  launched the world's fastest network chips on Wednesday  breaking into the Juniper  and Cisco  dominated core router market and giving its existing network business a boost.",
        "date": "06142017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia targets gains from web giants with fastest routers "
    },
    {
        "content": "* Spark new zealand invests in strategic partnership with nokia for core infrastructure to prepare for 5g  ultra-broadband and iot",
        "date": "06142017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Spark New Zealand invests in strategic partnership with Nokia "
    },
    {
        "content": "* Nokia Corp files preliminary prospectus supplement with u.s. Sec for potential two-part notes offering - SEC Filing Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia files preliminary prospectus supplement with U.S. SEC for potential two-part notes offering "
    },
    {
        "content": "* NEW COMMERCIAL ORDER FROM NOKIA FOR LATIN-AMERICAN OPERATOR",
        "date": "06022017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Claviter: new commercial order from Nokia for Latin-American operator "
    },
    {
        "content": "* Akzo Nobel falls as PPG drops bid plans (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon  see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "06012017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Italy outperforms European shares after GDP surprise "
    },
    {
        "content": "* Nokia commences tender offers for outstanding notes and consent solicitation from certain note holders",
        "date": "05302017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia commences tender offers for outstanding notes "
    },
    {
        "content": "HELSINKI Nokia relaunched its simple but classic 3310 phone in its home market of Finland on Wednesday  hoping a wave of nostalgia may boost the brand as it expands into newer smartphones. | Video ",
        "date": "05312017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia takes its relaunched 3310 'brick' home to Finland "
    },
    {
        "content": "HELSINKI  May 31 Nokia relaunched its simple but classic 3310 phone in its home market of Finland on Wednesday  hoping a wave of nostalgia may boost the brand as it expands into newer smartphones.",
        "date": "05312017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia takes its relaunched 3310 \"brick\" home to Finland "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Samsung looks unprepared for a future without a prince firmly on the throne. The sprawling business empire  facing unprecedented legal risks  is preserving a structure that lets the Lee family keep nominal control of its $289 billion crown jewel via a small stake  despite an activist investor lobbying for an overhaul. The decision makes the group harder to steer  and the iconic South Korean brand owes much of its success to two generations of charismatic  if a",
        "date": "05312017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Samsung gambles on an heirless future "
    },
    {
        "content": "* Nokia - Nokia And Frontier Communications deploy G.Fast Technology to expand gigabit ultra-broadband access across Connecticut Source text for Eikon: Further company coverage:",
        "date": "05252017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and Frontier Communications deploy G.fast technology to expand gigabit ultra-broadband access across Connecticut "
    },
    {
        "content": "HELSINKI Apple has settled a patent dispute with Finnish telecom equipment maker Nokia and agreed to buy more of its network products and services  sending Nokia shares up 7 percent. | Video ",
        "date": "05232017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Apple and Nokia see deeper partnership after ending patent dispute "
    },
    {
        "content": "* Greek stocks drop as debt deal hopes dashed (Adds details  closing prices)",
        "date": "05232017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Tech  banks help European stocks edge up "
    },
    {
        "content": "* REG-NOKIA AND CHINA HUAXIN SIGN DEFINITIVE AGREEMENTS FOR CREATION OF NEW NOKIA SHANGHAI BELL JOINT VENTURE",
        "date": "05182017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and China Huaxin sign definitive agreements on Nokia Shanghai Bell JV "
    },
    {
        "content": "* Nokia shares rise 7 percent (Adds investor  analyst comments)",
        "date": "05232017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 3-Apple and Nokia see deeper partnership after ending patent dispute "
    },
    {
        "content": "LONDON  May 23 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "05232017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia jumps on Apple settlement; UK mid-caps outperform - For more see the European equities LiveMarkets blog "
    },
    {
        "content": "* CEO Rajeev Suri tells Nokia's annual general meeting on Tuesday that the patent license agreement with Apple \"makes sense  it is a good deal for Nokia\"",
        "date": "05232017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia CEO says Apple patent deal \"makes sense\" "
    },
    {
        "content": "* Says on May 9  co entered into settlement agreement and release of claims with Microsoft Corp",
        "date": "05112017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Interdigital enters into settlement agreement and release of claims with Microsoft Corp "
    },
    {
        "content": "* Spanish banks recover (Recasts  adds quotes and detail  updates prices)",
        "date": "05232017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Tech  banks keep European stocks afloat "
    },
    {
        "content": "LONDON  May 23 Nokia shares jumped more than 6 percent to their highest levels in more than a year and were a standout in an otherwise sluggish open on European stock markets on Tuesday.",
        "date": "05232017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "REFILE-Tech  banks keep European stocks afloat "
    },
    {
        "content": " (Corrects last paragraph of this May 3 story to show TE Connectivity is a U.S.-listed Swiss company  not a U.S. company.)",
        "date": "05052017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia plans to sell its undersea cables division: sources "
    },
    {
        "content": "HELSINKI Nokia  plans to cut up to 200 more jobs in Finland because of weak demand for its telecom network equipment.",
        "date": "05042017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia to cut up to 200 jobs more in Finland on weaker demand "
    },
    {
        "content": "PARIS  May 3 Finland's Nokia plans to sell its undersea cables unit  a business that underpins the global Internet  two union sources and a French government source told Reuters.",
        "date": "05052017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "REFILE-UPDATE 1-Nokia plans to sell its undersea cables division -sources "
    },
    {
        "content": "HELSINKI  May 4 Nokia plans to cut up to 200 more jobs in Finland because of weak demand for its telecom network equipment.",
        "date": "05042017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 1-Nokia to cut up to 200 jobs more in Finland on weaker demand "
    },
    {
        "content": "HELSINKI  May 4 Finnish network equipment maker Nokia said on Thursday it plans to continue job cuts in Finland and remove up to 200 positions in Finland in a bid to protect profitability amid falling demand in the global network market.",
        "date": "05042017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia plans to cut up to 200 jobs in Finland "
    },
    {
        "content": "HELSINKI Finnish telecom networks equipment maker Nokia  reported a slowing rate of sales decline on Thursday  saying the global networks market was showing signs of recovery  particularly in North America and India.",
        "date": "04272017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia outpaces Ericsson in first quarter as network market recovers "
    },
    {
        "content": "* Zodiac drops on doubts over Safran takeover (Adds details after ECB meeting  updates prices)",
        "date": "04272017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "European shares fall as ECB stands pat  banks drop "
    },
    {
        "content": "LONDON  April 27 European shares retreated from 20-month highs on Thursday with financials and commodity-related stocks the main drag on the benchmark index.",
        "date": "04272017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Banks drag European shares down from 20-month highs "
    },
    {
        "content": "HELSINKI  April 27 Finnish telecom networks equipment maker Nokia reported a slowing rate of sales decline on Thursday  saying the global networks market was showing signs of recovery  particularly in North America and India.",
        "date": "04272017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 2-Nokia outpaces Ericsson in first quarter as network market recovers "
    },
    {
        "content": "* says subsequent offer period under the recommended public cash tender offer by Nokia to purchase all of the issued and outstanding shares and option rights in Comptel expired on April 19",
        "date": "04242017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia says holds about 97 pct of Comptel shares "
    },
    {
        "content": "Apple Inc is facing a new patent infringement lawsuit by Acacia Research Corp  a licensing firm Apple has previously accused of conspiring with Nokia Corp to extract exorbitant patent royalties from smartphone makers.",
        "date": "04202017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Acacia escalates Apple patent fight with new infringement claims "
    },
    {
        "content": "* Says according to the preliminary results  shares tendered during the subsequent offer period for all shares and option rights of Comptel represent approximately 3.96 percent of all the shares and votes",
        "date": "04202017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia says controls 97 pct of Comptel shares after subsequent offer period "
    },
    {
        "content": "March 30 Finnish telecoms equipment maker Nokia on Thursday announced preliminary results of its tender offer for Finnish telecom software company Comptel .",
        "date": "03302017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "UPDATE 1-Nokia says controls 88 pct of all Comptel shares  continues offer "
    },
    {
        "content": "* Says mobile device malware infection rates increased steadily in 2016  reaching an all-time high",
        "date": "03272017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia says smartphone malware infection rates rose nearly 400 pct in 2016 "
    },
    {
        "content": "* Says shares tendered in offer represent approximately 88.39 percent of all shares and votes in Comptel  excluding the treasury shares held by Comptel",
        "date": "03302017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia announces preliminary results of Comptel bid "
    },
    {
        "content": "* says proposes Jeanette Horan and Edward Kozel to be elected as new members of the board of directors",
        "date": "03302017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia proposes Horan and Kozel as new board members "
    },
    {
        "content": "* Nokia says has received all necessary authority approvals for its tender offer for Comptel",
        "date": "03222017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia says Comptel acquisition cleared by authorities "
    },
    {
        "content": "* Says announces final results for its offer to purchase euro and dollar notes",
        "date": "03222017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia announces final result of offer to buy euro  dollar notes "
    },
    {
        "content": "* Says Nokia and TIM extend technology partnership in Brazil to expand 4G LTE network in 700 mhz spectrum band",
        "date": "03152017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia says extends technology partnership with TIM in Brazil "
    },
    {
        "content": "HELSINKI  March 17 Nokia's head of mobile networks  the division which accounted for more than half of Finnish telecom network equipment maker's sales last year  is leaving the company.",
        "date": "03172017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia's mobile networks head quits  to split business "
    },
    {
        "content": "* Says organizational changes include the separation of Nokia's current Mobile Networks business group into two distinct organizations",
        "date": "03172017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia splits mobile networks group into two organizations "
    },
    {
        "content": "* Nokia and Tata Power Delhi Distribution join forces to modernize electrical grids with advanced communications networks  Source text - (Delhi-NCR  India \u0096 Nokia has provided the leading Indian power utility Tata Power Delhi Distribution Limited (TATA Power-DDL) with a state-of-the-art Internet Protocol/Multiprotocol Label Switching (IP/MPLS) network  to support the management of its electrical grid in its area of operation in North and North-west Delhi. This deployment has enabled TATA Power-D",
        "date": "03092017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and Tata Power Delhi Distribution join forces to modernize electrical grids "
    },
    {
        "content": "* Nokia and Vimpelcom sign major five-year managed services contract for management of fixed  mobile and transport networks",
        "date": "03072017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and Vimpelcom sign five-year managed services contract for fixed  mobile and transport networks "
    },
    {
        "content": "* Nokia  airtel to leverage Nokia's 5G first end-to-end 5G solution including AirScale radio access portfolio and AirFrame data center platform",
        "date": "03012017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia & Bharti Airtel to collaborate on 5G and IoT applications "
    },
    {
        "content": "* Says Nokia and BSNL come together to develop 5G ecosystem in India",
        "date": "03032017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia & BSNL partner to develop 5G ecosystem in India "
    },
    {
        "content": "BARCELONA  Spain Nokia's  newly revitalized phone business went back to the future on Sunday  re-introducing a brightly colored version of the classic 3310 talk and text phone  the world's most popular device in the year 2000.",
        "date": "02262017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia goes back to the future with 49 euro phone "
    },
    {
        "content": "* Devices announced by Nokia and brand licensing partner HMD   (Adds background  detail  comments)",
        "date": "02262017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 2-Nokia goes back to the future with 49 euro phone "
    },
    {
        "content": "* says tender offer for all issued and outstanding shares and option rights in Comptel commences on February 27",
        "date": "02232017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia's Comptel offer to commence on Feb 27 "
    },
    {
        "content": "* Nokia says co and AT&T recently completed fixed wireless 5G tests with AT&T's internet TV streaming service  DIRECTV NOW  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and AT&T recently completed fixed wireless 5G tests with AT&T's internet TV streaming service "
    },
    {
        "content": "* Nokia and Intel launch 5G acceleration labs in U.S. and Finland to help operators bring 5G innovations to market",
        "date": "02212017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and Intel launch 5G acceleration labs "
    },
    {
        "content": "BARCELONA  Spain  Feb 26 Nokia's newly revitalised phone business went back to the future on Sunday  re-introducing a brightly coloured version of the best-selling phone of 2000.",
        "date": "02262017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia goes back to the future with 49 euro feature phone "
    },
    {
        "content": "* the board Of directors of Comptel posts a statement regarding the voluntary public tender offer by Nokia",
        "date": "02212017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia's bid is financially fair  Comptel board says "
    },
    {
        "content": "* says will launch an expanded portfolio of Withings consumer digital health products and solutions under Nokia brand in summer 2017",
        "date": "02262017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia launches digital health products "
    },
    {
        "content": "BARCELONA Nokia  sees demand for higher speed 4G network equipment starting to recover this year  led by Japan  the company's chief executive Rajeev Suri said on Sunday as he  announced a series of contracts with telecom operators.",
        "date": "02262017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia sees growth opportunities in networks market "
    },
    {
        "content": "BARCELONA  Feb 26 Nokia sees demand for higher speed 4G network equipment starting to recover this year  led by Japan  the company's chief executive Rajeev Suri said on Sunday as he  announced a series of contracts with telecom operators.",
        "date": "02262017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 1-Nokia sees growth opportunities in networks market "
    },
    {
        "content": "BARCELONA  Feb 26 Nokia sees demand for the higher speed 4G network equipment to begin to recover this year  led by Japan  the company's chief executive Rajeev Suri said on Sunday  while announcing a series of contracts with telecom operators.",
        "date": "02262017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia sees network gear demand recovering "
    },
    {
        "content": "In the latest sign that Blackberry Ltd will be aggressively monetizing its patent portfolio  the struggling Canadian smartphone pioneer sued Nokia on Tuesday for infringing patents considered essential to wireless communications technology.",
        "date": "02162017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Blackberry hits Nokia with lawsuit over wireless patents "
    },
    {
        "content": "* Nokia chief financial officer Kristian Pullola tells a conference call: \"We like this (Comptel) type of bolt-on deals and we will be looking at them also going forward\"",
        "date": "02092017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia looks for further bolt-on deals - CFO "
    },
    {
        "content": "HELSINKI Finnish telecoms equipment maker Nokia  said on Thursday it is seeking to buy local company Comptel  for 347 million euros ($370 million)  as mobile operators increasingly rely on software to make their networks more intelligent.",
        "date": "02092017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia seeks to buy Finnish telecoms software firm Comptel for $370 million "
    },
    {
        "content": "* Network maker says aims to build \"standalone software business\"",
        "date": "02092017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 2-Nokia seeks to buy Finnish telecoms software firm Comptel for $370 mln "
    },
    {
        "content": "* Nokia announces its intention to acquire Comptel to advance its software strategy; launches a recommended cash tender offer for all the shares and option rights in Comptel",
        "date": "02092017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia announces intention to acquire Comptel "
    },
    {
        "content": "HELSINKI  Feb 9 Network equipment maker Nokia  said on Thursday it has agreed to buy another Finnish company  Comptel  for about 347 million euros ($370 million) to expand its software business.",
        "date": "02092017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia offers to buy Comptel for $370 million "
    },
    {
        "content": "* Nokia and Energia Communications sign distributor agreement for gGfast fixed ultra-broadband access technology in Japan  Source text for Eikon:  Further company coverage:   (Gdynia Newsroom)",
        "date": "02092017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia signs distributor agreement with Energia Communications in Japan "
    },
    {
        "content": "* Says completes acquisition of IP network analytics firm Deepfield  originally announced December 15  2016  Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "01312017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia completes acquisition of Deepfield "
    },
    {
        "content": "* joint definition and test platform deployment of 5G-based applications for new services for consumer and vertical markets   Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "01302017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia  Orange Group collaborate on 5G services "
    },
    {
        "content": "* Nokia CFO Kristian Pullola tells a conference call that if necessary  the Finnish company is prepared for a long legal process with Apple  a process where additional litigation cost could be around 100 million euros per year",
        "date": "02022017",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia prepared for long legal battle with Apple - CFO "
    },
    {
        "content": "Following are news stories  press reports and events to watch that may affect Poland's financial markets on Tuesday. ALL TIMES GMT (Poland: GMT + 1 hour):",
        "date": "01312017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Poland - Factors to Watch Jan 31 "
    },
    {
        "content": "HELSINKI Finnish network equipment maker Nokia reported its quarterly profits fell less than expected  helped by cost cuts and the acquisition of Alcatel-Lucent  and said the tough global market was starting to stabilize.",
        "date": "02022017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia beats market expectations  sees network market improving "
    },
    {
        "content": "HELSINKI  Feb 2 Finnish network equipment maker Nokia reported its quarterly profits fell less than expected  helped by cost cuts and the acquisition of Alcatel-Lucent  and said the tough global market was starting to stabilise.",
        "date": "02022017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 3-Nokia beats market expectations  sees network market improving "
    },
    {
        "content": "* Nokia CEO Rajeev Suri tells conference call the company has finished main integration work with Alcatel-Lucent  Further company coverage:    (Helsinki Newsroom)",
        "date": "02022017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia has finished main integration work with Alcatel - CEO "
    },
    {
        "content": "TEL AVIV  Jan 9 The venture arms of Microsoft  and Qualcomm have invested in Team8  an Israeli creator of cybersecurity start-ups  as big multinational companies get behind Israel's burgeoning cyber industry in the face of growing threats.",
        "date": "01092017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Microsoft  Qualcomm back Israel's Team8 cybersecurity firm "
    },
    {
        "content": "HELSINKI  Jan 8 HMD Global  the Finnish company that owns the rights to use Nokia's brand on mobile phones  announced on Sunday its first smartphone  targeted for Chinese users with a price of 1 699 yuan ($246).",
        "date": "01082017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "HMD Global launches first Nokia smartphone "
    },
    {
        "content": "LAS VEGAS  Jan 8 Automotive suppliers and automakers are expanding alliances to develop self-driving car technology that can serve multiple automakers  as the race to put such vehicles on the road separates companies that can go it alone from those that need help sharing the financial and technical burdens.",
        "date": "01082017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "CORRECTED-RPT-Automakers  suppliers team up to share costs of self-driving cars "
    },
    {
        "content": "LAS VEGAS  Jan 8 Automotive suppliers and automakers are expanding alliances to develop self-driving car technology that can serve multiple automakers  as the race to put such vehicles on the road separates companies that can go it alone from those that need help sharing the financial and technical burdens.",
        "date": "01082017",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "CORRECTED-Automakers  suppliers team up to share costs of self-driving cars "
    },
    {
        "content": "HELSINKI Finnish telecoms networks equipment maker Nokia  said on Thursday it had filed a new set of patent lawsuits against Apple Inc  in Asia  Europe and the United States. | Video ",
        "date": "12222016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia files more patent suits against Apple "
    },
    {
        "content": "BELGRADE/HELSINKI Nokia Corp  said on Wednesday it had filed a number of lawsuits against Apple Inc  for violating 32 technology patents  striking back at the iPhone maker's legal action targeting the one-time cellphone industry leader a day earlier. | Video ",
        "date": "12222016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia sues Apple for infringing patents  industry back on war footing "
    },
    {
        "content": "HELSINKI/BELGRADE Nokia  shares fell by nearly 5 percent on Thursday in Helsinki as analysts warned a legal battle with Apple  could delay for years royalty payments that are vital to shoring up the Finnish company's profits.",
        "date": "12222016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia shares fall on patent dispute with Apple "
    },
    {
        "content": "HELSINKI HMD Global  the Finnish company that owns the rights to use the Nokia brand on mobile phones  announced its first new products on Tuesday - two basic handsets without internet access priced at $26 before local taxes and subsidies.",
        "date": "12132016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "HMD launches its first new Nokia phones "
    },
    {
        "content": "HELSINKI Finnish telecom network equipment maker Nokia said it was planning to acquire Deepfield  a small IP network analytics company based in the United States.",
        "date": "12152016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia to buy IP network analytics firm Deepfield "
    },
    {
        "content": "FRANKFURT/HELSINKI Nokia smartphones are poised for a comeback after former managers at the Finnish company licensed the handset brand from Microsoft and struck up partnerships with Google and phone manufacturer Foxconn.",
        "date": "12012016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Fallen smartphone brand Nokia challenges Apple  Samsung again "
    },
    {
        "content": "* Says Danish telecommunications provider TDC Group  and Nokia are upgrading Danish broadband network to deliver ultra-broadband speeds",
        "date": "11282016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins order for broadband network update from Denmark's TDC "
    },
    {
        "content": "* says dtac  part of the Telenor Group and the second largest mobile operator in Thailand  has selected products in Nokia's IP/Optical portfolio to support its network  Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "11092016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Finland's Nokia wins order from Thailand "
    },
    {
        "content": "BARCELONA/HELSINKI Nokia  said on Tuesday it was outperforming arch-rival Ericsson  in a weak telecoms equipment market  but its shares fell as its dividend plans and profitability forecasts missed analysts' expectations.",
        "date": "11152016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia says telecoms gear market tough  but outpacing Ericsson "
    },
    {
        "content": "* Shares fall as much as 7.7 pct   (Adds details on market outlook  Ericsson forecasts  5G hopes)",
        "date": "11152016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 3-Nokia says telecoms gear market tough  but outpacing Ericsson "
    },
    {
        "content": "MILAN  Nov 15 European shares steadied on Tuesday as a rebound in utilities and crude prices was offset by sharp falls among mining stocks  while telecoms equipment maker Nokia slumped after a disappointing earnings outlook update.",
        "date": "11152016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "European shares steady as utilities' bounce offset by weak miners "
    },
    {
        "content": "LONDON  Nov 15 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "11152016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Reflation trades pause  Nokia slumps  bond proxies recover. This and more on the European equities LiveMarkets blog "
    },
    {
        "content": "* \"Primary addressable market to return to growth in 2018\"  Nokia CEO Rajeev Suri said in presentation at company's Capital Markets Day event in Barcelona",
        "date": "11152016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia CEO Suri says company outperforming Ericsson in every area "
    },
    {
        "content": "HELSINKI  Nov 15 Nokia said on Tuesday it expects its primary addressable network equipment market to fall around 2 percent next year.",
        "date": "11152016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia sees network market declining around 2 pct in 2017 "
    },
    {
        "content": "* Says to repurchase own shares in line with its capital structure optimization program",
        "date": "11152016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia to buy back shares worth up to 1 bln euros "
    },
    {
        "content": "* says Nokia and Globe Telecom from the Philippines have signed two frame agreements  one for wireless technologies and the other for IP  Optical and SDN technologies  Further company coverage:    (Helsinki Newsroom)",
        "date": "10242016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Finland's Nokia wins orders from Globe Telecom in the Philippines "
    },
    {
        "content": "HELSINKI Finnish telecoms equipment group Nokia  reported a sharp drop in third-quarter earnings on Thursday  suffering from  weaker sales in the wireless network market and warning that the market was likely to shrink further in the coming year.",
        "date": "10272016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia hit by weak wireless market  says awaiting merger benefits "
    },
    {
        "content": "HELSINKI  Oct 27 Finnish telecoms equipment group Nokia reported a sharp drop in third-quarter earnings on Thursday  suffering from  weaker sales in the wireless network market and warning that the market was likely to shrink further in the coming year.",
        "date": "10272016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "REFILE-UPDATE 3-Nokia hit by weak wireless market  says awaiting merger benefits "
    },
    {
        "content": "* Says Timo Ihamuotila  Chief Financial Officer of Nokia  resigns from company to join  ABB in Switzerland as Chief Financial Officer and a member of executive committee",
        "date": "10272016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia CFO Ihamuotila leaves company  joins ABB "
    },
    {
        "content": "HELSINKI  Oct 27 Finnish telecom network equipment maker Nokia said on Thursday its quarterly profit fell less than expected as it was boosted by a non-recurring licensing payment from Samsung.",
        "date": "10272016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia beats profit expectations in third quarter "
    },
    {
        "content": "* Q3 group sales 6.0 billion euros ($6.54 billion)  above analyst's average expectation of 5.85 million in Reuters poll    Source text for Eikon:  Further company coverage:  ($1 = 0.9175 euros)   (Helsinki Newsroom)",
        "date": "10272016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia Q3 sales 6 0 billion euros  above market expectations "
    },
    {
        "content": "* Nokia says has signed an agreement with STC to expand high-speed mobile broadband capacity and coverage in Saudi Arabia using Nokia's 4.5G technology",
        "date": "10182016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins 4.5G order from Saudi Arabia "
    },
    {
        "content": "Oct 21 Philippines' Globe Telecom says in a statement",
        "date": "10212016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Philippines' Globe signs $750 mln deals with Huawei  Nokia  Wuhan in China "
    },
    {
        "content": "* Nokia - Nokia and U.S. Cellular collaborate to test 5g in North America and demonstrate 5g fixed wireless in both indoor and outdoor environments  Source text for Eikon:  Further company coverage:",
        "date": "10122016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and U.S. Cellular collaborate to test 5g in North America "
    },
    {
        "content": "FRANKFURT  Oct 12 Nokia's Alcatel Submarine Networks (ASN) Unit said on Wednesday it has set a new record for cable transmission capacity for communications traffic - doubling its previous levels - as the company responds to booming demand from Internet firms.",
        "date": "10122016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia sets new record for submarine cable capacity as demand jumps "
    },
    {
        "content": "* Expiration date of nokia's public buy-out offer for alcatel-lucent securities extended following a legal action against amf clearance decision; squeeze-out to follow completion of public buy-out offer",
        "date": "10042016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Expiration date of Nokia's offer for Alcatel-Lucent securities extended "
    },
    {
        "content": "HELSINKI  Oct 5 Telecoms network maker Nokia  said on Wednesday it had acquired Eta Devices  a U.S.-based start-up specializing in power amplifier efficiency solutions for network base stations.",
        "date": "10052016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia buys base station energy solutions start-up "
    },
    {
        "content": "* Sees Eta Devices to bolster Nokia's push to enhance base station energy efficiency",
        "date": "10052016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia acquires US start-up to enhance base station energy efficiency "
    },
    {
        "content": "* Nokia board of directors resolved on a directed share issuance to Nokia employees participating in the employee share purchase plans 2015 and 2016",
        "date": "09282016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia's Board resolves on directed share issuance to Nokia employees "
    },
    {
        "content": "* says Nokia is expanding its partnership with China Unicom for the high-end core router CR-B for three continuous years",
        "date": "09272016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia expands router deal with China Unicom "
    },
    {
        "content": "* Says China Unicom expands partnership with Nokia for high capacity metro core routers to cover 10 provinces  Source text for Eikon:  Further company coverage:",
        "date": "09272016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-China Unicom expands partnership with Nokia for high capacity metro core routers "
    },
    {
        "content": "* The French stock market authority has approved Nokia's proposed public buy-out offer followed by a squeeze-out relating to the remaining securities of Alcatel-Lucent it does not own  Source text for Eikon:  Further company coverage:    (Reporting By Johan Ahlander)",
        "date": "09202016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-French stock market authority approves Nokia proposed buy-out of Alcatel-Lucent securities "
    },
    {
        "content": "* says has launched its public buy-out offer for all the securities of Alcatel-Lucent that it does not own  squeeze-out expected to occur on October 6",
        "date": "09222016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Finland's Nokia to squeeze out remaining Alcatel-Lucent securities on Oct 6 "
    },
    {
        "content": "* Announces it has signed a bi-lateral agreement for Operations Support System Interoperability Initiative (OSSii) with Nokia   Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "09202016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Astellia to sign OSSii agreement with Nokia "
    },
    {
        "content": "ABUJA  Sept 9 Nigeria's telecoms regulator has shut the offices of Nokia-Alcatel for operating in Africa's largest economy without the necessary permit  the watchdog said on Friday.",
        "date": "09092016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia-Alacatel's Nigerian offices closed by watchdog for lack of licence "
    },
    {
        "content": "* Says to offer EUR 3.50 per share for remaining Alcatel-Lucent shares and expects to reach 100 pct ownership by early Q4  draft joint offer document has been filed with the french stock market authority  Source text for Eikon:  Further company coverage:    (Stockholm Newsroom)",
        "date": "09062016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia says to offer EUR 3.50/shr for remaining Alcatel-Lucent shares  expects full ownership by early Q4 "
    },
    {
        "content": "* says Nokia and Ooredoo launch Myanmar's first high-speed 4G service and extend managed services contract",
        "date": "08242016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia completes 4G roll-out in Myanmar "
    },
    {
        "content": "HELSINKI  Aug 18 Nokia has cut the price of its OZO virtual reality camera by 25 percent from its initial launch price  the Finnish company said on Thursday.",
        "date": "08182016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia cuts price for OZO virtual reality camera "
    },
    {
        "content": "* Says awarded over 30 percent share of China Mobile's 2016-2017 new construction of optical network  Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "08172016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia says won 30 pct of China Mobile's optical network orders 2016-2017 "
    },
    {
        "content": "HELSINKI  Aug 15 HMD Global Oy  a new Finnish company looking to relaunch the Nokia brand for phones  said on Monday it has hired Pekka Rantala  the former CEO of Angry Birds maker Rovio  as its Chief Marketing Officer.",
        "date": "08152016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Ex-Rovio CEO hired to bring Nokia phones back to market "
    },
    {
        "content": "HELSINKI  Aug 15 HMD Global Oy  a new Finnish company looking to relaunch the Nokia brand for phones  said on Monday it has hired Pekka Rantala  the former CEO of Angry Birds maker Rovio  as its Chief Marketing Officer.",
        "date": "08152016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "RPT-Ex-Rovio CEO hired to bring Nokia phones back to market "
    },
    {
        "content": "* Says Nokia and China Telecom have signed an agreement to expand deployment of 4G technology in 19 provinces in China",
        "date": "08122016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Finland's Nokia signs 4G deal with China Telecom "
    },
    {
        "content": "* Nokia and Telefonica Germany sign managed services contract to transform fixed and mobile network operations",
        "date": "08022016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and Telefonica Germany sign managed services contract "
    },
    {
        "content": "* Alfa and Nokia have launched country's first 4G LTE-advanced network  as part of an agreement signed between two companies  Source text: http://nokia.ly/2aF6fpa",
        "date": "08022016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and Alfa launch first 4G LTE-A network in Lebanon "
    },
    {
        "content": "HELSINKI Nokia's  second-quarter profit fell more sharply than expected as telecom operators around the world spent less on faster mobile networks  prompting the company to lift its cost-cutting target following its merger with Alcatel-Lucent.",
        "date": "08042016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia quarterly profit halves on weak network sales  merger distractions "
    },
    {
        "content": "* CEO sees market improving in H2   (Adds comments  competition  updates shares)",
        "date": "08042016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 2-Nokia quarterly profit halves on weak network sales  merger distractions "
    },
    {
        "content": "* Says Vivek Badrinath will step down from the Nokia Board of Directors effective immediately due to his appointment as Chief Executive for Vodafone's Africa  Middle East and Asia-Pacific  Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "07292016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia board member Vivek Badrinath steps down  joins Vodafone "
    },
    {
        "content": "* Says to provide Tele2 with cloud packet core solution across entire Tele2 group network to deliver mobile broadband  further prepare for 5g",
        "date": "07252016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins order from Tele2 "
    },
    {
        "content": "* Nokia corporation financial report for Q2 and half year 2016",
        "date": "08042016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia Q2 earnings per share EUR 0.03 "
    },
    {
        "content": "HELSINKI  Aug 4 Nokia's quarterly profit fell more sharply than expected as telecom operators spent less on faster networks and as others held off signing new orders as the Finnish firm merges operations with recently-acquired rival Alcatel-Lucent.",
        "date": "08042016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia posts weak quarterly profits  lifts cost-cut target "
    },
    {
        "content": "* Says is working with city of San Diego to enhance its public safety communications network",
        "date": "07122016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins order for San Diego public safety network "
    },
    {
        "content": "LONDON  July 13 European stock markets rose on Wednesday  leaving a benchmark regional index near its highest level in more than two weeks  with shares in AccorHotels and Nokia both outperforming.",
        "date": "07132016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "European stocks rise as Accor and Nokia climb "
    },
    {
        "content": "* Nokia and Samsung expand their intellectual property cross license",
        "date": "07132016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and Samsung expand their intellectual property cross license "
    },
    {
        "content": " ",
        "date": "06282016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins order for optic network from Telefonica Spain "
    },
    {
        "content": "* Says enters the 2 billion dollar Diameter Signaling Control market with the launch of its Nokia Dynamic Diameter Engine (DDE)",
        "date": "06292016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia launches cloud-based solution for network traffic control "
    },
    {
        "content": "* Nokia board of directors adjusts Nokia equity plans due to the special dividend and increases the maximum number of restricted shares under restricted share plan 2016  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06172016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia board of directors adjusts Nokia equity plans "
    },
    {
        "content": "* Says expects to cross 95% ownership thresholds in Alcatel-Lucent and announces intention to file a public buy-out offer in cash for the remaining alcatel-lucent securities followed by a squeeze-out  Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "06162016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia plans buy-out after crossing 95 percent threshold in Alcatel-Lucent "
    },
    {
        "content": "HELSINKI Nokia has signed a 1.36 billion euro ($1.5 bln) one-year framework deal with China Mobile  the Finnish company said on Monday  easing fears that it would lose market share while it merges operations with Alcatel-Lucent.",
        "date": "06132016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia signs $1.5 billion framework deal with China Mobile "
    },
    {
        "content": "HELSINKI  June 13 Nokia has signed a 1.36 billion euro ($1.5 bln) one-year framework deal with China Mobile  the Finnish company said on Monday  easing fears that it would lose market share while it merges operations with Alcatel-Lucent.",
        "date": "06132016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia signs $1.5 bln framework deal with China Mobile "
    },
    {
        "content": "* says one-year Yuan 9.927 billion (EUR 1.36 billion) frame agreement  covering all of 2016  signed at Sino-German Economic Forum",
        "date": "06132016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia  China Mobile sign 1.36 billion euro frame agreement "
    },
    {
        "content": "* says Nokia Technologies has established a new Digital Health business unit led by Cédric Hutchings  formerly CEO of Withings",
        "date": "05312016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia completes Withings acquisition "
    },
    {
        "content": "* says Chorus and Nokia have agreed on a three-year extension of their technology partnership to further invest in New Zealand's ultra high speed broadband program",
        "date": "05312016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia  Chorus extend technology partnership in New Zealand "
    },
    {
        "content": "HELSINKI Telecom network equipment maker Nokia  is likely to cut 10 000 to 15 000 jobs globally - far more than it has announced so far - after its acquisition of Franco-American rival Alcatel-Lucent   a Finnish union representative said.",
        "date": "05242016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia could cut 10 000-15 000 jobs worldwide: union "
    },
    {
        "content": "* Nokia aiming to slash 900 mln euros of operating costs by 2018",
        "date": "05242016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 1-Nokia could cut 10 000-15 000 jobs worldwide - union "
    },
    {
        "content": "* Nokia aiming to slash 900 mln euros of operating costs by 2018",
        "date": "05242016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia could cut 10 000-15 000 jobs worldwide - union "
    },
    {
        "content": "HELSINKI  May 20 Nokia is cutting 1 032 jobs in Finland as part of a cost-cutting programme following its acquisition of Alcatel-Lucent  the telecom network equipment maker said in a statement on Friday.",
        "date": "05202016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia cuts more than a thousand jobs in Finland "
    },
    {
        "content": "* says Nokia and Three Ireland sign five-year contract to upgrade radio access network operations",
        "date": "05172016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia signs five-year upgrade contract with Three Ireland "
    },
    {
        "content": "HELSINKI The Nokia name will return to the mobile phone market after a company backed by one of its former executives teamed up with manufacturer Foxconn  to buy the rights to the brand for mobile devices.",
        "date": "05182016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia name to return to mobile phones after licensing deal "
    },
    {
        "content": "* Microsoft sells entry-level phone business to HMD/Foxconn   (Adds Breakingviews link  updates Nokia share price)",
        "date": "05182016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 3-Nokia name to return to mobile phones after licensing deal "
    },
    {
        "content": "HELSINKI  May 18 Nokia said on Wednesday it has signed an exclusive 10-year licensing deal with Finnish company HMD Global Oy to create Nokia-branded phones and tablets.",
        "date": "05182016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia returns to mobile phones with brand-licensing deal "
    },
    {
        "content": "* Nokia and MTS Group have signed a collaboration agreement that will create a strategic path to the realization of 5G technology and the management of the ever-growing demands of connected people and devices",
        "date": "05182016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and MTS Group to collaborate on IoT and 5G in Russia "
    },
    {
        "content": "* Nokia and Zain KSA boost 4G network speeds to meet growing subscriber demand using three component carrier aggregation",
        "date": "05112016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins 4G deal in Saudi Arabia "
    },
    {
        "content": "HELSINKI/FRANKFURT Nokia's  sales of network traffic equipment fell more than expected in the first quarter and will decline this year  the Finnish company said  as buyers hold off orders while it merges operations with recently purchased rival Alcatel Lucent.",
        "date": "05102016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia stock falls 7 percent after vague long-term profit outlook "
    },
    {
        "content": "HELSINKI/FRANKFURT  May 10 Nokia's  sales of network traffic equipment fell more than expected in the first quarter and will decline this year  the Finnish company said  as buyers hold off orders while it merges operations with recently purchased rival Alcatel Lucent.",
        "date": "05102016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "CORRECTED-UPDATE 3-Nokia stock falls 7 pct after vague long-term profit outlook "
    },
    {
        "content": "* Nokia Chief Executive Rajeev Suri said on Tuesday that the company is contending with a mobile equipment indsutry where there are few mega-deals that previous years and where pricing remains tough  but no worse than in recent quarters.",
        "date": "05102016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia says small number of mobile customers delayed buying in Q1 "
    },
    {
        "content": "* Nokia Chief Executive Rajeev Suri said on Tuesday that the company is contending with a mobile equipment indsutry where there are few mega-deals that previous years and where pricing remains tough  but no worse than in recent quarters.",
        "date": "05102016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Mega-deals few  pricing tough  similar to prior qtrs-Nokia "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Tuesday:",
        "date": "05102016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "NORDIC STOCKS - Factors to watch on May 10 "
    },
    {
        "content": "HELSINKI  May 10 Nokia's net sales of telecoms equipment fell more than expected in the first quarter as the Finnish company warned on Tuesday that earnings in its mainstay business would decline this year due to slowing demand in China.",
        "date": "05102016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia posts falling network sales  lifts cost-saving targets "
    },
    {
        "content": "* Says issues new shares to settle the acquisition of Alcatel-Lucent shares from the Alcatel-Lucent depositary",
        "date": "05102016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia issues new shares to settle Alcatel acquisition "
    },
    {
        "content": "* Nokia and Ooredoo Qatar signs three-year network expansion agreement to meet ever-increasing high-speed data demands  Source text: http://nokia.ly/1pXQ5vt Further company coverage:    (Gdynia Newsroom)",
        "date": "05032016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia and Ooredoo Qatar sign three-year network expansion agreement "
    },
    {
        "content": "HELSINKI Finnish mobile network equipment maker Nokia  said on Tuesday it had struck a deal to buy France's Withings S.A. for 170 million euros ($191 million) in its first move into the market for digital products that monitor health.",
        "date": "04262016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia to buy health tracking firm Withings "
    },
    {
        "content": "HELSINKI  April 26 Finnish mobile network equipment maker Nokia on Tuesday said it was planning to buy France's Withings S.A. for 170 million euros ($191 million) in its bid to expand into digital health markets.",
        "date": "04262016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Finland's Nokia plans to acquire Withings for $191 million "
    },
    {
        "content": "* says Jouko Karvinen and Simon Jiang will leave the board after AGM  proposes Carla Smits-Nusteling as new member",
        "date": "04212016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia proposes Smits-Nusteling as new board member  Karvinen and Jiang to leave "
    },
    {
        "content": "* Shares on track for biggest one-day drop since 2007   (Adds investor  analyst quotes  detail  background  updates shares)",
        "date": "04212016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 3-Ericsson to cut costs as profit miss alarms investors "
    },
    {
        "content": "(Adds Yara  Husqvarna  Norwegian Air  TGS) The following stocks may be affected by newspaper reports and other factors on Thursday:",
        "date": "04212016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "NORDIC STOCKS - Factors to watch on April 21 "
    },
    {
        "content": "* says Nokia and Turk Telekom have signed a Memorandum of Understanding to accelerate the development of 5G radio access network technology and the applications that will drive the Internet of Things",
        "date": "04152016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia  Turk Telekom collaborate on 5G development "
    },
    {
        "content": "HELSINKI Telecom network equipment maker Nokia  is planning to cut thousands of jobs worldwide  including 1 400 in Germany and 1 300 in its native Finland  as part of a cost-cutting program following its acquisition of Alcatel-Lucent.",
        "date": "04062016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia to cut thousands of jobs following Alcatel deal "
    },
    {
        "content": "HELSINKI  April 6 Telecom network equipment maker Nokia is planning to cut thousands of jobs worldwide  including 1 400 in Germany and 1 300 in its native Finland  as part of a cost-cutting programme following its acquisition of Alcatel-Lucent.",
        "date": "04062016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 2-Nokia to cut thousands of jobs following Alcatel deal "
    },
    {
        "content": "* Says not yet clear whether there will be forced redundancies in Germany  For broader story:  Further company coverage:",
        "date": "04062016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia to cut 1 400 of 4 800 jobs in Germany by 2018 "
    },
    {
        "content": "* Spokeswoman says company plans to cut about 400 jobs in France following Alcatel acquisition  Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "04062016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia plans to cut 400 jobs in France "
    },
    {
        "content": "HELSINKI  April 6 Finland's Nokia  launched a job cutting programme on Wednesday following its acquisition of France's Alcatel-Lucent  but did not say how many positions it was planning to axe.",
        "date": "04062016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia to start job cuts following Alcatel deal "
    },
    {
        "content": "* Says has completed its acquisition of Canadian software firm Nakina Systems  Further company coverage:    (Helsinki Newsroom)",
        "date": "04012016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia completes the acquisition of Nakina Systems "
    },
    {
        "content": "* Alcatel-Lucent upgraded to 'BB+' on merger with Nokia and removed from watch positive; outlook positive  Source text (http://bit.ly/1MxHsgz)",
        "date": "03212016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-S&P says Alcatel-Lucent upgraded to 'BB+' on merger with Nokia and removed from watch positive; outlook positive "
    },
    {
        "content": "* Resolves to issue new shares in a directed share issue to the Alcatel-Lucent depositary in exchange for Alcatel-Lucent shares",
        "date": "03172016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia to issue maximum of 72.8 million new shares\u007f "
    },
    {
        "content": "GENEVA  March 1 Renault-Nissan   is studying whether to acquire a stake in digital mapping business HERE  the former Nokia unit now owned by German luxury carmakers.",
        "date": "03012016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Renault-Nissan mulls acquiring stake in former Nokia mapping unit "
    },
    {
        "content": "BARCELONA Mobile equipment maker Nokia sees the shift to the next generation of 5G wireless networks kicking off well ahead of 2020  the year when many in the industry consider mass-market upgrades will begin  its chief executive said on Sunday.",
        "date": "02222016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia 5G pickup could begin as early as 2017 - chief executive "
    },
    {
        "content": "BARCELONA Mobile equipment maker Nokia sees the shift to the next generation of 5G wireless networks kicking off well ahead of 2020  the year when many in the industry consider mass-market upgrades will begin  its chief executive said on Sunday.",
        "date": "02212016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia 5G pickup could begin as early as 2017: chief executive "
    },
    {
        "content": "BARCELONA  Feb 21 Mobile equipment maker Nokia  sees the shift to the next generation of 5G wireless networks kicking off well ahead of 2020  the year when many in the industry consider mass-market upgrades will begin  its chief executive said on Sunday.",
        "date": "02212016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia 5G pickup could begin as early as 2017 - chief executive "
    },
    {
        "content": "* Nokia wireless business growth seen turning negative this year",
        "date": "02122016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia Alcatel merger story draws investors  even as growth fades "
    },
    {
        "content": "* A total of 320 701 193 Nokia Corporation's shares have been subscribed in the directed issue of Nokia Corporation",
        "date": "02122016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia Corporation - directed issue "
    },
    {
        "content": "* Nokia announces settlement of its reopened public exchange offer for Alcatel-Lucent securities and the registration of new shares",
        "date": "02122016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia announces settlement of Alcatel offer's 2nd round "
    },
    {
        "content": "HELSINKI Finnish telecoms network equipment maker Nokia  on Wednesday said it holds about 91 percent of the shares in France's Alcatel-Lucent  following the second round of its 15.6 billion euro ($17.6 billion) all-stock offer.",
        "date": "02102016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia holds 91 percent of Alcatel after second round of offer "
    },
    {
        "content": "HELSINKI  Feb 10 Finnish telecoms network equipment maker Nokia on Wednesday said it holds about 91 percent of the shares in France's Alcatel-Lucent  following the second round of its 15.6 billion euro ($17.6 billion) all-stock offer.",
        "date": "02102016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia holds 91 pct of Alcatel after second round of offer "
    },
    {
        "content": "HELSINKI Finnish telecom gear maker Nokia  warned that demand for new mobile networks would slow this year in China and said it would not give a financial outlook until April following its acquisition of Alcatel-Lucent .",
        "date": "02112016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia leaves investors in dark over outlook "
    },
    {
        "content": "* Shares fall 4 pct   (Adds CEO comments  Ericsson comparison  share reaction)",
        "date": "02112016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 2-Nokia leaves investors in dark over outlook "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Thursday:",
        "date": "02112016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "NORDIC STOCKS - Factors to watch on Feb 11 "
    },
    {
        "content": "HELSINKI  Feb 11 Finland's Nokia  reported better-than-expected profits for its mainstay telecom network equipment business but warned that rollouts for new mobile networks would start to slow this year in its key market in China.",
        "date": "02112016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia posts strong network result  warns over China slowdown "
    },
    {
        "content": "LONDON  Feb 1 European stock markets were steady on Monday  as a rise in the shares of major banks such as Bankia  offset a fall in the telecoms sector after Nokia  settled a dispute with Samsung.",
        "date": "02012016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "European shares steady as firmer banks offset weaker telecoms "
    },
    {
        "content": "HELSINKI  Jan 30 Nokia and Samsung  are expected to settle their two-year patent dispute within days  with analysts forecasting a one-time payment of hundreds of millions of euros for the Finnish company.",
        "date": "01302016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia-Samsung patent verdict expected within days "
    },
    {
        "content": "* says announced redemption of USD 1.85 billion senior notes issued by Alcatel-Lucent USA Inc. as part of Nokia's planned capital structure optimization program",
        "date": "01112016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia announces redemption of $1.85 bln Alcatel notes "
    },
    {
        "content": "* Says Nokia reopens public exchange offer for outstanding Alcatel-Lucent securities",
        "date": "01142016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia reopens public exchange offer for outstanding Alcatel-Lucent securities "
    },
    {
        "content": "* Nokia reopens public exchange offer for outstanding Alcatel Lucent securities",
        "date": "01142016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia's reopened Alcatel offer to close on Feb 3 "
    },
    {
        "content": "* Nokia confirms the composition of the board of directors and announces the composition of the board committees and the new group leadership team",
        "date": "01082016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia confirms board of directors "
    },
    {
        "content": "* says the French stock market authority today published the final results of the initial offer period of Nokia's public exchange offer for Alcatel-Lucent securities in France and in the United States",
        "date": "01052016",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia holds about 80 pct of Alcatel  French authority confirms "
    },
    {
        "content": "HELSINKI Finland's Nokia said on Monday it has gained control of French counterpart Alcatel-Lucent following its 15.6-billion-euro ($17 billion) all-share offer and the two telecom equipment makers would start to combine their operations next week.",
        "date": "01042016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia to move swiftly after taking control of Alcatel-Lucent "
    },
    {
        "content": "HELSINKI  Jan 4 Finland's Nokia said on Monday it has gained control of French counterpart Alcatel-Lucent following its 15.6-billion-euro ($17 billion) all-share offer and the two telecom equipment makers would start to combine their operations next week.",
        "date": "01042016",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 2-Nokia to move swiftly after taking control of Alcatel-Lucent "
    },
    {
        "content": "* Nokia reminds holders of Alcatel-Lucent securities that it may waive the minimum tender condition in accordance with U.S. regulatory requirements",
        "date": "12112015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia reminds Alcatel-Lucent shareholders it may waive min. tender condition "
    },
    {
        "content": "* Nokia shareholders approve all resolutions at extraordinary general meeting",
        "date": "12022015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia shareholders approve Alcatel-Lucent acquisition "
    },
    {
        "content": "HELSINKI  Dec 4 Finland's Nokia on Friday said it had completed the sale of its navigation business HERE to German car makers BMW  Audi and Mercedes.",
        "date": "12042015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Finland's Nokia closes maps unit sale to German car makers "
    },
    {
        "content": "HELSINKI Finland's Nokia  said on Thursday it expects to close the sale of its navigation business HERE to German car makers on Dec. 4.",
        "date": "12032015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia says to close navigation unit sale on December 4  ahead of plan "
    },
    {
        "content": "HELSINKI  Dec 3 Finland's Nokia said on Thursday it expects to close the sale of its navigation business HERE to German car makers on Dec. 4.",
        "date": "12032015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia says to close navigation unit sale on Dec. 4  ahead of plan "
    },
    {
        "content": "HELSINKI  Dec 1 Finland's Nokia on Tuesday said it will price its virtual reality camera at $60 000 and begin its shipments in the first quarter of next year.",
        "date": "12012015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia prices virtual reality camera at $60 000 "
    },
    {
        "content": "HELSINKI  Nov 20 Finnish mobile operating system company Jolla  created by ex-Nokia software developers  has filed to a local court for debt restructuring after running out of funding and plans temporary lay-offs  it said on Friday.",
        "date": "11202015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Finland's Jolla files for debt restructuring after running out of funds "
    },
    {
        "content": " (This Nov. 18 story corrects fourth paragraph to show Nokia and Alcatel-Lucent would have combined 4.7 billion euro investment in R&D based on 2014 figures)",
        "date": "11202015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia CEO says Alcatel buy will increase its 5G firepower "
    },
    {
        "content": "* says announced today that it has commenced a public exchange offer to exchange all outstanding ordinary shares  American depositary shares and OCEANE convertible bonds of Alcatel-Lucent for Nokia shares or Nokia American depositary shares   Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "11182015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "RPT-BRIEF-Nokia launches Alcatel-Lucent offer "
    },
    {
        "content": "* says announced today that it has commenced a public exchange offer to exchange all outstanding ordinary shares  American depositary shares and OCEANE convertible bonds of Alcatel-Lucent for Nokia shares or Nokia American depositary shares   Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "11182015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia launches Alcatel-Lucent offer "
    },
    {
        "content": "HELSINKI Finland has rolled images of a couple in a sauna  an old Nokia phone and a heavy-metal music fan as part of its own set of national \"emojis\"  or symbols to be used in digital communication.",
        "date": "11042015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Fancy a sauna? Or a headbang? Finland launches national 'emojis' "
    },
    {
        "content": "HELSINKI  Nov 4 Finland has rolled images of a couple in a sauna  an old Nokia phone and a heavy-metal music fan as part of its own set of national \"emojis\"  or symbols to be used in digital communication.",
        "date": "11042015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Fancy a sauna? Or a headbang? Finland launches national \"emojis\" "
    },
    {
        "content": "* Says Nokia Networks and China Mobile have announced framework agreement for mobile communications equipment and services valued at more than one billion USD (930 million euros)",
        "date": "10302015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia signs framework deal with China Mobile "
    },
    {
        "content": "HELSINKI/PARIS Finnish network equipment maker Nokia  reported stronger-than-expected quarterly profits as growth in China offset weaker demand in other key markets  and said it would return money to shareholders after acquiring Alcatel-Lucent .",
        "date": "10292015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia beats estimates and returns cash  Alcatel deal on track "
    },
    {
        "content": "HELSINKI/PARIS  Oct 29 Finnish network equipment maker Nokia reported stronger-than-expected quarterly profits as growth in China offset weaker demand in other key markets  and said it would return money to shareholders after acquiring Alcatel-Lucent.",
        "date": "10292015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 3-Nokia beats estimates and returns cash  Alcatel deal on track "
    },
    {
        "content": "LONDON  Oct 29 European shares surrendered early gains on Thursday after disappointing updates from companies like Deutsche Bank  Saint-Gobain and Barclays and a sharp drop in mining shares.",
        "date": "10292015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "European shares give up gains  pulled down by financial  mining stocks "
    },
    {
        "content": "HELSINKI The European market for mobile broadband network equipment will remain under pressure in the coming quarters  the chief executive of Finland's Nokia  said on Thursday.",
        "date": "10292015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia sees European network gear market under pressure: CEO "
    },
    {
        "content": "HELSINKI  Oct 29 The European market for mobile broadband network equipment will remain under pressure in the coming quarters  the chief executive of Finland's Nokia  said on Thursday.",
        "date": "10292015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "RPT-Nokia sees European network gear market under pressure -CEO "
    },
    {
        "content": "HELSINKI  Oct 29 The European market for mobile broadband network equipment will remain under pressure in the coming quarters  the chief executive of Finland's Nokia  said on Thursday.",
        "date": "10292015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Nokia sees European network gear market under pressure -CEO "
    },
    {
        "content": "* Announces $4.4 bln dividend and share buyback plan   (Adds analyst comment  networks forecast)",
        "date": "10292015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 1-Finland's Nokia Q3 beats estimates  to return $4.4 bln to shareholders "
    },
    {
        "content": "* announces receipt of all required regulatory approvals to proceed with the filing of its public exchange offer for Alcatel-Lucent",
        "date": "10212015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia secures all required approvals for Alcatel-Lucent deal "
    },
    {
        "content": "* Says its Board of Directors has resolved to convene an extraordinary general meeting to be held on December 2  2015.",
        "date": "10222015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia to convene extraordinary general meeting to vote on Alcatel-Lucent deal "
    },
    {
        "content": "PARIS Telecoms equipment maker Alcatel-Lucent  posted a net loss in the third quarter despite higher revenues from its core networking products  adding that larger rival Nokia's  plan to buy it was on track to complete in the first quarter.",
        "date": "10292015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Alcatel-Lucent says Nokia deal on track to complete in first quarter "
    },
    {
        "content": "PARIS  Oct 29 Telecoms equipment maker Alcatel-Lucent posted a net loss in the third quarter despite higher revenues from its core networking products  adding that larger rival Nokia's plan to buy it was on track to complete in the first quarter.",
        "date": "10292015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Alcatel-Lucent says Nokia deal on track to complete in Q1 "
    },
    {
        "content": "BEIJING/HELSINKI China's Ministry of Commerce on Monday approved Nokia's proposed acquisition of French rival Alcatel-Lucent with conditions  almost completing the 15.6 billion euro ($17.6 billion) deal's antitrust process.",
        "date": "10192015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "China gives conditional approval to Nokia-Alcatel deal "
    },
    {
        "content": "BEIJING/HELSINKI  Oct 19 China's Ministry of Commerce on Monday approved Nokia's proposed acquisition of French rival Alcatel-Lucent with conditions  almost completing the 15.6 billion euro ($17.6 billion) deal's antitrust process.",
        "date": "10192015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 1-China gives conditional approval to Nokia-Alcatel deal "
    },
    {
        "content": "* says Nokia Networks signs major TD-LTE-advanced deal with China Mobile  reinforces position as largest non-chinese vendor",
        "date": "10132015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins order from China Mobile "
    },
    {
        "content": "* says receives clearance from China's Ministry Of Commerce for proposed acquisition Of Alcatel-Lucent",
        "date": "10192015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins Chinese approval to Alcatel-Lucent deal "
    },
    {
        "content": "BEIJING  Oct 19 China's Ministry of Commerce said on Monday it has approved telecom equipment maker Nokia's  proposed takeover of France's Alcatel-Lucent  providing that the Finnish firm can meet certain terms by Dec. 10.",
        "date": "10192015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "China gives conditional approval to Nokia takeover of Alcatel-Lucent "
    },
    {
        "content": "* says has decided to exercise its option to redeem its EUR 750 million convertible bonds due in 2017 on November 26 at their principal amount outstanding plus accrued interest  Further company coverage:    (Helsinki Newsroom)",
        "date": "10082015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia redeems its convertible bonds due in 2017 "
    },
    {
        "content": "PARIS  Oct 6 Alcatel-Lucent said on Tuesday it will not sell its undersea cables unit  meaning the strategic business which underpins the global Internet will be taken by Nokia once it completes its acquisition of the Franco-American group.",
        "date": "10062015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Alcatel's strategic undersea cables unit to be swallowed by Nokia "
    },
    {
        "content": "PARIS Alcatel-Lucent said on Tuesday it will not sell its undersea cables unit  meaning the strategic business which underpins the global Internet will be taken over by Nokia once it completes its acquisition of the Franco-American group.",
        "date": "10072015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Alcatel's strategic undersea cables unit to be swallowed by Nokia "
    },
    {
        "content": "* Alcatel-Lucent to retain undersea cables unit as wholly-owned subsidiary",
        "date": "10062015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Alcatel-Lucent to retain undersea cables unit as wholly-owned subsidiary "
    },
    {
        "content": "PARIS  Oct 6 Alcatel-Lucent said on Tuesday it will not sell its undersea cables unit  meaning the strategic business which underpins the global Internet will be taken over by Nokia once it completes its acquisition of the Franco-American group.",
        "date": "10072015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "REFILE-Alcatel's strategic undersea cables unit to be swallowed by Nokia "
    },
    {
        "content": "* Announces planned leadership and organizational structure for combined Nokia And Alcatel",
        "date": "10072015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "BRIEF-Nokia: planned leadership and organizational structure for combined Nokia and Alcatel-Lucent "
    },
    {
        "content": "PARIS  Oct 7 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "10072015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "French and Benelux stocks-Factors to watch on Wednesday "
    },
    {
        "content": "* says board of directors resolved on a directed share issuance to Nokia employees participating in the employee share purchase plan 2014",
        "date": "09302015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia to issue shares to employees "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Wednesday:",
        "date": "09232015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "NORDIC STOCKS - Factors to watch on Sept 23 "
    },
    {
        "content": "* Says has received clearance from the Committee on Foreign Investment in the United States (CFIUS) for the proposed acquisition of Alcatel-Lucent.",
        "date": "09142015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia's acquisition of Alcatel-Lucent cleared by CFIUS "
    },
    {
        "content": "* Says has revised departure package for ex-CEO Combes after oversight committee recommendations",
        "date": "09112015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Alcatel-Lucent revises ex-CEO departure package "
    },
    {
        "content": "FLORENCE  Italy  Sept 11 EU regulators have yet to decide whether to wade into a patent dispute between ZTE  and New York-based patent licensing firm Vringo   despite a year-old complaint by the Chinese handset maker  the bloc's antitrust chief said.",
        "date": "09112015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "EU's Vestager says undecided yet on opening ZTE  Vringo probe "
    },
    {
        "content": "* says HERE maps are in 49 of the 54 new car models being presented at the Frankfurt motor show   Further company coverage:    (Helsinki Newsroom)",
        "date": "09102015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-HERE maps in most new car models at Frankfurt show "
    },
    {
        "content": "AMSTERDAM  Sept 1 The Netherlands' Central Bank on Tuesday gave Dutch pension funds  which include some of the largest in the world  12 years to rectify low funding ratios.",
        "date": "09012015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "UPDATE 1-Dutch Central Bank gives pension funds 12 years to recover "
    },
    {
        "content": "WASHINGTON  Sept 2 German carmakers BMW   Audi and Mercedes have won U.S. antitrust approval to buy Nokia's maps business for around 2.5 billion euros ($2.8 billion)  the Federal Trade Commission said on Wednesday.",
        "date": "09022015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "German carmakers win US antitrust approval to buy Nokia maps "
    },
    {
        "content": "WASHINGTON German carmakers BMW  Audi  and Mercedes have won U.S. antitrust approval to buy Nokia's maps business for around 2.5 billion euros ($2.8 billion)  the Federal Trade Commission said on Wednesday.",
        "date": "09022015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "German carmakers win U.S. antitrust approval to buy Nokia maps "
    },
    {
        "content": "PARIS French Economy Minister Emmanuel Macron stepped up the pressure on former Alcatel-Lucent CEO Michel Combes  describing his departure from the company before the finalization of a takeover by Nokia as \"shocking\" and \"bad corporate behavior\".",
        "date": "09022015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "French minister decries 'shocking' behavior of parting Alcatel CEO "
    },
    {
        "content": "PARIS  Sept 2 French Economy Minister Emmanuel Macron stepped up the pressure on former Alcatel-Lucent  CEO Michel Combes  describing his departure from the company before the finalisation of a takeover by Nokia  as \"shocking\" and \"bad corporate behaviour\".",
        "date": "09022015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "French minister decries 'shocking' behaviour of parting Alcatel CEO "
    },
    {
        "content": "HELSINKI Finnish telecom equipment maker Nokia said it had agreed to create a Chinese joint venture with Huaxin in a move that could pave the way for China's approval for Nokia's proposed takeover of Alcatel-Lucent.",
        "date": "08282015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "Nokia agrees on 'Shanghai Bell' joint venture with China Huaxin "
    },
    {
        "content": "HELSINKI  Aug 28 Finnish telecom equipment maker Nokia said it had agreed to create a Chinese joint venture with Huaxin in a move that could pave the way for China's approval for Nokia's proposed takeover of Alcatel-Lucent .",
        "date": "08282015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "UPDATE 1-Nokia agrees on \"Shanghai Bell\" joint venture with China Huaxin "
    },
    {
        "content": "HELSINKI  Aug 28 Finnish telecom equipment maker Nokia on Friday said it has agreed to create a joint venture in China with state-owned Huaxin  following Nokia's proposed takeover of Alcatel-Lucent.",
        "date": "08282015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Finland's Nokia agrees on China joint venture with Huaxin "
    },
    {
        "content": "HELSINKI  Aug 21 Microsoft Corp on Friday confirmed it will close Nokia Oyj's former handset product development unit in Salo  Finland  and will cut a total of up to 2 300 jobs in the Nordic country.",
        "date": "08212015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Microsoft confirms Finnish phone site closure and job cuts "
    },
    {
        "content": "* Nokia has earlier received approvals from regulators such as European Commission and United States",
        "date": "08192015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia wins approval for Alcatel-Lucent deal in India "
    },
    {
        "content": "* says has filed a preliminary draft of its registration statement on form F-4 with the U.S. Securities and Exchange Commission relating to the proposed public exchange offer to acquire Alcatel-Lucent  Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "08142015",
        "name": "Nokia Corporation",
        "news_type": "topStory",
        "symbol": "NOK",
        "title": "BRIEF-Nokia files SEC draft statement on Alcatel deal "
    },
    {
        "content": "FRANKFURT/HELSINKI  Aug 10 Nokia is hiring software experts  testing new products and seeking sales partners as it plots its return to the mobile phone and consumer tech arena it abandoned with the sale of its handset business.",
        "date": "08102015",
        "name": "Nokia Corporation",
        "news_type": "normal",
        "symbol": "NOK",
        "title": "Back to the future: Nokia prepares for mobile comeback "
    }
]