[
    {
        "content": "* NRG completes agreements with Chemphys for strategic alliance  raises a total of CAD$1 215 000 by private placement Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG completes agreements with Chemphys for strategic alliance "
    },
    {
        "content": "* ‍Intends to commence an offering of $870 million in aggregate principal amount of senior notes due 2028​",
        "date": "11092017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy announces proposed offering of senior notes "
    },
    {
        "content": "* Announces cash tender offer for any and all of its outstanding 6.625 pct senior notes due 2023",
        "date": "11092017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy announces cash tender offer for any and all of its outstanding 6.625 pct senior notes due 2023 "
    },
    {
        "content": "* NRG energy inc - qtrly ‍​total operating revenues $3 049 million versus $3 421 million",
        "date": "11022017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy Inc qtrly earnings per share $0.53 ‍​ "
    },
    {
        "content": "* MCKESSON SIGNS AGREEMENT WITH NRG TO INSTALL SOLAR ARRAYS AT MCKESSON FACILITY",
        "date": "10302017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-MCKESSON SIGNS AGREEMENT WITH NRG TO INSTALL SOLAR ARRAYS AT MCKESSON FACILITY "
    },
    {
        "content": "* NRG Energy Inc announces redemption of its outstanding 7.625 percent senior notes due 2018 and its outstanding 7.875 percent senior notes due 2021",
        "date": "09142017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy announces redemption of its outstanding senior notes "
    },
    {
        "content": "WASHINGTON  Aug 29 The two nuclear reactors at the South Texas Project plant near Houston were operating at full capacity on Tuesday  a spokesman for the plant said  as watchdog groups called for the facility to shut due to Tropical Storm Harvey.",
        "date": "08292017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "UPDATE 1-South Texas Project nuclear plant running despite Harvey "
    },
    {
        "content": "WASHINGTON  Aug 29 The two nuclear reactors at the South Texas Project plant 90 miles from Houston are operating at full capacity despite calls from watchdog groups for the facility to shut due to Tropical Storm Harvey  a spokesman for the plant said on Tuesday.",
        "date": "08292017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "South Texas Project nuclear plant running despite Harvey storm "
    },
    {
        "content": "* Elliott Associates and affiliates report they have combined economic exposure in NRG Energy Inc Of about 4.4 percent of shares of common stock outstanding",
        "date": "08242017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-Elliott reduces its stake in NRG Energy to about 4.4 pct "
    },
    {
        "content": "* Reached agreement with creditors to restructure Genon Energy  Inc. and its subsidiaries through consensual bankruptcy process",
        "date": "08032017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy Inc posts Q2 ‍loss of $0.05​ per share "
    },
    {
        "content": "NRG Energy Inc  said it would raise as much as $4 billion through asset sales and slash debt by $13 billion  sending its shares surging 21 percent to a near two-year high on Wednesday.",
        "date": "07122017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "NRG Energy to raise up to $4 billion through asset sales  shares soar "
    },
    {
        "content": "* Shares near 2-yr high of $19.76 (Adds details on the power sector  background)",
        "date": "07122017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "UPDATE 2-NRG Energy to raise up to $4 bln through asset sales  shares soar "
    },
    {
        "content": "* NRG Energy Inc- ‍business review committee (brc) unanimously recommended transformation plan​",
        "date": "07122017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy Inc - ‍transformation plan targets removal of $13 bln debt "
    },
    {
        "content": "July 12 NRG Energy Inc  the largest independent U.S. power producer  said on Wednesday it was targeting asset sales of up to $4 billion  as part of a three-year restructuring effort to cut costs.",
        "date": "07122017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "NRG Energy targets asset sales of up to $4 bln "
    },
    {
        "content": "* NRG has determined that the disposal of Genon is a discontinued operation",
        "date": "06202017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy says Genon and its subsidiaries will be deconsolidated from NRG's financial statements "
    },
    {
        "content": "WILMINGTON  Del.  June 14 NRG Energy Inc's GenOn business filed for bankruptcy on Wednesday with an agreement with bondholders to cut $1.75 billion of its debt and restructure the power generator as a standalone business  according to a securities filing.",
        "date": "06142017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "NRG Energy's GenOn unit files for bankruptcy "
    },
    {
        "content": "* NRG Energy - Co  Genon Energy  holders of Genon's notes  continue negotiating  documenting  finalizing restructuring support agreement - SEC filing",
        "date": "06122017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy  Genon Energy  holders of Genon's notes  continue restructuring support agreement "
    },
    {
        "content": "* NRG Energy-consistent with consent agreement with Genon energy  extending its term to June 9 to facilitate negotiations of restructuring support agreement Source text (http://bit.ly/2qW9dvy) Further company coverage:",
        "date": "06072017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy-consistent with consent agreement with Genon energy  extends its term to June 9 "
    },
    {
        "content": "* Nrg energy-pursuant to consent agreement with genon energy  agreed to extend term of consent agreement to june 6 to facilitate negotiation of restructuring support agreement​‍​ Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy provides update on agreement with GenOn Energy "
    },
    {
        "content": "BOSTON  April 28 A director at NRG Energy Inc was elected to its board with a strong margin of votes cast  a securities filing showed on Friday  overcoming concerns about his comments on climate change and the intentions of the activist investors who backed him at the New Jersey power company.",
        "date": "04292017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "NRG director wins strong shareholder support despite NYC opposition "
    },
    {
        "content": "* NRG Energy Inc - reaffirming 2017 adjusted EBITDA and free cash flow before growth (FCFBG) guidance",
        "date": "05022017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy Inc posts Q1 loss per share $0.52 "
    },
    {
        "content": "* NRG Energy Inc says all 13 directors nominated by company were elected and each received affirmative vote of majority of votes cast at Annual Meeting Source text (http://bit.ly/2qfpqyW) Further company coverage:",
        "date": "04282017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy says all 13 directors nominated by co elected at annual meeting "
    },
    {
        "content": "WASHINGTON/LOS ANGELES/NEW YORK When President Donald Trump signed an executive order last week to sweep away Obama-era climate change regulations  he said it would end America's \"war on coal\"  usher in a new era of energy production and put miners back to work.",
        "date": "04052017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "Trump declares end to 'war on coal ' but utilities aren't listening "
    },
    {
        "content": "* Ceo Mauricio Gutierrez's fy 2016 total compensation $8.3 million versus $2.5 million in fy 2015 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "03162017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy CEO Mauricio Gutierrez's fy 2016 total compensation $8.3 mln "
    },
    {
        "content": "* NRG Energy Inc - reaffirming 2017 adjusted ebitda  cash from operations and Fcfbg guidance",
        "date": "02282017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy qtrly operating revenue $2 819 million "
    },
    {
        "content": "Feb 13 NRG Energy Inc  the largest U.S. independent power producer  said it would appoint two directors in a deal with activist investor Elliott Management and private equity firm Bluescape Energy Partners.",
        "date": "02132017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "UPDATE 1-NRG names two directors in deal with Elliott and Bluescape "
    },
    {
        "content": "Feb 13 Power company NRG Energy Inc said it would appoint two directors in a settlement with activist investor Elliott Management and private equity firm Bluescape Energy Partners.",
        "date": "02132017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "NRG settles with activist investors  appoints two directors "
    },
    {
        "content": "* NRG Energy announces cooperation agreement with Elliott Management and Bluescape Energy Partners",
        "date": "02132017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy announces cooperation agreement "
    },
    {
        "content": "* Carlson Capital L P reports 5.41 percent passive stake in NRG Energy Inc as of December 31  2016 - sec filing  Source text : http://bit.ly/2jNBIIk Further company coverage:",
        "date": "01302017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-Carlson Capital reports 5.41 pct passive stake in NRG Energy "
    },
    {
        "content": "* NRG Energy  Inc. statement on schedule 13d filing by Elliott Associates and Bluescape Energy Partners",
        "date": "01182017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy statement on schedule 13d filing by Elliott Associates and Bluescape Energy Partners "
    },
    {
        "content": "* Nrg Energy Inc - announces it will reprice its $1.9 billion term loan B due June 2023",
        "date": "01202017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy Inc announces it will reprice its $1.9 billion term loan B due June 2023 "
    },
    {
        "content": "Elliott Management and private equity firm Bluescape Energy Partners have teamed up to buy a 9.4 percent stake in NRG Energy Inc  and said they may push to elect one or more directors to its board.",
        "date": "01172017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "Elliott teams with ex-TXU CEO for NRG Energy shake-up "
    },
    {
        "content": "Jan 17 Elliott Management and private equity firm Bluescape Energy Partners have teamed up to buy a 9.4 percent stake in NRG Energy Inc and said they may push to elect one or more directors to its board.",
        "date": "01172017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "UPDATE 2-Elliott teams with ex-TXU CEO for NRG Energy shake-up "
    },
    {
        "content": "Jan 17 Activist investor Elliott Management and private equity firm Bluescape Energy Partners said they bought stakes in NRG Energy Inc and would team up to urge the power producer to make strategic changes to the company.",
        "date": "01172017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "Elliott  private equity firm buy stakes in NRG Energy "
    },
    {
        "content": "* Bluescape Energy Partners reports 2.5 pct stake in NRG Energy Inc as of Jan 4 - SEC filing  Source text: http://bit.ly/2ixgMZq Further company coverage:",
        "date": "01172017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "BRIEF-Bluescape Energy Partners reports 2.5 pct stake in NRG Energy "
    },
    {
        "content": "Jan 17 Elliott International And Affiliates Report Combined Economic Exposure In Nrg Energy Inc",
        "date": "01172017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "BRIEF-Elliott reports stake in NRG Energy  teams up with Bluescape to initiate talks with NRG "
    },
    {
        "content": "THOMPSONS  Texas NRG Energy Inc and JX Nippon Oil & Gas Exploration Corp said on Tuesday they had begun operations at a $1.04 billion carbon capture facility at a Texas coal-fired power plant and were using the emissions to extract crude from a nearby oilfield.",
        "date": "01102017",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "Texas $1 billion carbon project to curb emissions  up oil recovery "
    },
    {
        "content": "Jan 9 Entergy Corp's over 40-year old Indian Point nuclear power plant will be shut by 2021 because of concerns for the safety of  millions of New Yorkers in and around the Big Apple  Governor Andrew Cuomo announced on Monday.",
        "date": "01092017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "UPDATE 3-New York City's closest nuclear power plant to shut by 2021 "
    },
    {
        "content": "THOMPSONS  Texas  Jan 10 NRG Energy Inc  and JX Nippon Oil & Gas Exploration Corp said on Tuesday they had begun operations at a $1.04 billion carbon capture facility at a Texas coal-fired power plant and were using the emissions to extract crude from a nearby oilfield.",
        "date": "01102017",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "Texas $1 bln carbon project to curb emissions  up oil recovery "
    },
    {
        "content": "* Press release - Nrg Energy Services announces agreement with Golden Spread Electric Cooperative for third-party operations and maintenance at two electric generating stations",
        "date": "11292016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-Nrg Energy to provide operations services for 2 Golden Spread generating stations "
    },
    {
        "content": "* NRG Energy Inc Q3 total operating revenue $3 952 million versus $4 434 million in last year",
        "date": "11042016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy posts Q3 earnings of $1.27/share "
    },
    {
        "content": "* NRG Energy  Inc announces early results for its cash tender offer",
        "date": "10192016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy announces early results for its cash tender offer "
    },
    {
        "content": "* Announces cash tender offer for its outstanding 7.625 percent senior notes due 2018 and partial redemption of its outstanding 7.875 percent senior notes due 2021",
        "date": "10042016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy announces cash tender offer for its outstanding 7.625 pct senior notes due 2018 "
    },
    {
        "content": "CHICAGO  Sept 12 Houston-based NRG Energy Inc  has won the auction for bankrupt renewable power plant developer SunEdison Inc 's wind and solar projects in Texas and other states with a $144 million bid  according to a court filing.",
        "date": "09122016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "NRG Energy wins auction for SunEdison wind and solar projects "
    },
    {
        "content": "* NRG Energy Inc reports second quarter results and reaffirms 2016 guidance",
        "date": "08092016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy Q2 loss per share $0.61 "
    },
    {
        "content": "* NRG Energy Inc announces redemption of its outstanding 8.25% senior notes due 2020 and partial redemption of its outstanding 7.875% senior notes due 2021  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08022016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy announces redemption of its outstanding 8.25% senior notes due 2020 "
    },
    {
        "content": "* Priced its offering of $1 250 million in aggregate principal amount of 6.625% senior notes due 2027",
        "date": "07192016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy upsizes and prices senior notes offering "
    },
    {
        "content": "* Intends to use net proceeds from offering  together with cash on hand  to redeem all of its outstanding 8.25% senior notes due 2020",
        "date": "07192016",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy intends to commence offering of $1 bln in aggregate principal amount of senior notes due 2027 "
    },
    {
        "content": "* Nrg announces pricing of $1.9 billion term loan b facility due 2023",
        "date": "06162016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG announces pricing of $1.9 bln term loan B facility due 2023 "
    },
    {
        "content": "* Completed repurchase from Credit Suisse First Boston of 100% of outstanding shares of its $344.5 million 2.822% preferred stock at price of $225.9 million",
        "date": "06132016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy Inc announces repurchase of 100% of outstanding convertible perpetual preferred stock "
    },
    {
        "content": "* NRG Energy Inc says has amended terms of its offers to increase tender offer cap for 2018 notes from $300 million to $400 million",
        "date": "05232016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy Inc increases tender offer cap for 2018 notes "
    },
    {
        "content": "* Priced its offering of $1 000 million in aggregate principal of 7.25% senior notes due 2026",
        "date": "05092016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy priced its offering of $1 000 mln in aggregate principal of 7.25 pct senior notes due 2026 "
    },
    {
        "content": "* Has commenced tender offers to purchase certain of its outstanding senior notes for aggregate cash consideration of up to $1.0 billion",
        "date": "05092016",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy Inc announces cash tender offers "
    },
    {
        "content": "* Intends to commence an offering of $700 million in aggregate principal amount of senior notes due 2026",
        "date": "05092016",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy announces proposed offering of senior notes "
    },
    {
        "content": "* Agreed to sell majority interest in EVGO to vision ridge partners",
        "date": "05052016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy Q1 earnings per share $0.24 "
    },
    {
        "content": "* Declared a quarterly dividend on company's common stock of $0.03 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "04182016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy sets qtrly div of $0.03 per share "
    },
    {
        "content": "* Calpers says request shareowners of NRG Energy to vote for non-binding proposal to give shareowners access to co's director nomination process  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04152016",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "BRIEF-NRG Energy says Calpers says request shareowners of NRG to vote for non-binding proposal "
    },
    {
        "content": "Dec 3 NRG Energy Inc on Thursday said its chief executive of 12 years  David Crane  would step down immediately after investors grew impatient with his costly  long-term plan to transform the power plant owner into a renewable energy pioneer.",
        "date": "12032015",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "NRG Energy's Crane steps down as CEO after stock slide "
    },
    {
        "content": "NEW YORK  May 28 A consortium of York Capital Management  NRG Energy Inc and ITC Holdings Corp  have proposed investing as much as $3.5 billion in Puerto Rico's electrical infrastructure  a source familiar with the consortium said on Thursday.",
        "date": "05292015",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "UPDATE 3-Group proposes investing $3.5 bln in Puerto Rico utilities -source "
    },
    {
        "content": "NEW YORK A consortium of York Capital Management  NRG Energy and ITC Holdings have proposed investing as much as $3.5 billion in Puerto Rico's electrical infrastructure  a source familiar with the consortium said on Thursday.",
        "date": "05282015",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "Group proposes to invest in Puerto Rico utility infrastructure: source "
    },
    {
        "content": "NEW YORK  May 28 A consortium of York Capital Management  NRG Energy and ITC Holdings have proposed investing as much as $3.5 billion in Puerto Rico's electrical infrastructure  a source familiar with the consortium said on Thursday.",
        "date": "05282015",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "UPDATE 1-Group proposes to invest in Puerto Rico utility infrastructure -source "
    },
    {
        "content": "Thomson Reuters May 7  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For ",
        "date": "05072015",
        "name": "NRG Energy Inc",
        "news_type": "normal",
        "symbol": "NRG",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "LOS ANGELES  April 15 NRG Energy Inc is turning California's devastating drought into a business opportunity.",
        "date": "04152015",
        "name": "NRG Energy Inc",
        "news_type": "topStory",
        "symbol": "NRG",
        "title": "NRG bundles solar with water-saving products in California "
    }
]