[
    {
        "content": "* Nutanix Inc says ‍on October 27  2017  Bipul Sinha resigned from his role as a member of board of Nutanix  Inc - SEC filing​",
        "date": "10312017",
        "name": "Nutanix Inc",
        "news_type": "topStory",
        "symbol": "NTNX",
        "title": "BRIEF-Bipul Sinha resigns from board of Nutanix "
    },
    {
        "content": "* Nutanix appoints former Cisco leader Inder Sidhu as executive vice president of customer success and business operations to help drive next phase of growth Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "Nutanix Inc",
        "news_type": "topStory",
        "symbol": "NTNX",
        "title": "BRIEF-Nutanix appoints Inder Sidhu as senior executive "
    },
    {
        "content": "* Nutanix reports fourth quarter and fiscal 2017 financial results",
        "date": "08312017",
        "name": "Nutanix Inc",
        "news_type": "topStory",
        "symbol": "NTNX",
        "title": "BRIEF-Nutanix Q4 loss per share $0.59 "
    },
    {
        "content": "* Nutanix reports third quarter fiscal 2017 financial results",
        "date": "05252017",
        "name": "Nutanix Inc",
        "news_type": "topStory",
        "symbol": "NTNX",
        "title": "BRIEF-Nutanix Q3 loss per share $0.78 "
    },
    {
        "content": "* Vanguard Group Inc reporst 11.57 percent passive stake in Nutanix Inc as of December 30  2016 - Sec Filing  Source text (http://bit.ly/2iBSxFl) Further company coverage:",
        "date": "01102017",
        "name": "Nutanix Inc",
        "news_type": "topStory",
        "symbol": "NTNX",
        "title": "BRIEF-Vanguard Group Inc reporst 11.57 pct passive stake in Nutanix as of December 30  2016 "
    },
    {
        "content": "Nov 29 Cloud data-storage firm Nutanix Inc  reported a smaller-than-expected loss in the company's first quarterly results since its initial public offering in September.",
        "date": "11292016",
        "name": "Nutanix Inc",
        "news_type": "topStory",
        "symbol": "NTNX",
        "title": "UPDATE 1-Cloud computing firm Nutanix posts smaller-than-expected loss "
    },
    {
        "content": "Nov 29 Cloud data-storage firm Nutanix Inc's  net loss widened significantly in the company's first quarterly results since its initial public offering in September.",
        "date": "11292016",
        "name": "Nutanix Inc",
        "news_type": "normal",
        "symbol": "NTNX",
        "title": "Nutanix loss widens in first quarterly report since IPO "
    },
    {
        "content": "* Nutanix reports first quarter fiscal 2017 financial results",
        "date": "11292016",
        "name": "Nutanix Inc",
        "news_type": "normal",
        "symbol": "NTNX",
        "title": "BRIEF-Nutanix reports first quarter fiscal 2017 financial results "
    },
    {
        "content": "* Canada Pension Plan Investment Board reports 15.3 passive stake in Nutanix Inc as of Oct. 25 - SEC filing  Source text: (http://bit.ly/2fVmSkQ) Further company coverage:",
        "date": "11082016",
        "name": "Nutanix Inc",
        "news_type": "topStory",
        "symbol": "NTNX",
        "title": "BRIEF-CPP Investment Board reports 15.3 pct passive stake in Nutanix "
    },
    {
        "content": "* Macquarie Group Limited reports 9.2 percent passive stake in Nutanix Inc as of Oct 31-  SEC filing  Source text for Eikon:  Further company coverage:    ;))",
        "date": "11102016",
        "name": "Nutanix Inc",
        "news_type": "topStory",
        "symbol": "NTNX",
        "title": "BRIEF-Macquarie Group reports 9.2 pct passive stake in Nutanix - SEC filing "
    },
    {
        "content": "* Wellington Management Group Llp reports a passive stake of 16.8 percent in Nutanix Inc as of Sept 30 - SEC Filing  Source text - http://bit.ly/2dIJUfe Further company coverage:",
        "date": "10112016",
        "name": "Nutanix Inc",
        "news_type": "topStory",
        "symbol": "NTNX",
        "title": "BRIEF-Wellington Management Group Llp reports 16.8 pct passive stake in Nutanix "
    },
    {
        "content": "* Oz Management Lp reports 5.85 percent passive stake in Nutanix Inc as of October 6 - sec filing  Source text (http://bit.ly/2e2sQAE) Further company coverage:",
        "date": "10112016",
        "name": "Nutanix Inc",
        "news_type": "normal",
        "symbol": "NTNX",
        "title": "BRIEF-Oz Management Lp reports 5.85 pct passive stake in Nutanix as of Oct 6 "
    },
    {
        "content": "Oct 6 Shares of Coupa Software Inc  a U.S. maker of cloud-based software that helps companies manage spending  surged 85 percent in their debut on Thursday  as investors showed renewed appetite for IPOs by venture-backed tech companies.",
        "date": "10062016",
        "name": "Nutanix Inc",
        "news_type": "normal",
        "symbol": "NTNX",
        "title": "UPDATE 1-Coupa Software shares soar 85 pct in market debut "
    },
    {
        "content": "Oct 6 Shares of Coupa Software Inc  a U.S. maker of cloud-based software that helps companies manage spending  more than doubled in their debut on Thursday  underscoring strong market appetite for IPOs by tech companies - even unprofitable ones.",
        "date": "10062016",
        "name": "Nutanix Inc",
        "news_type": "normal",
        "symbol": "NTNX",
        "title": "Coupa Software shares more than double in market debut "
    }
]