[
    {
        "content": "Nov 13 Northern Trust Asset Management said on Monday it has appointed Martha Fee as its chief operating officer for Europe  Middle East  Africa (EMEA) and Asia-Pacific (APAC).",
        "date": "11132017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Asset manager Northern Trust names new COO for EMEA  APAC "
    },
    {
        "content": "* NORTHERN TRUST MAKES SENIOR HIRE: EXPANDS MARKET ADVOCACY & INNOVATION RESEARCH FUNCTION IN ASIA-PACIFIC",
        "date": "11082017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust hires Danielle Henderson for market advocacy & innovation research function in APAC "
    },
    {
        "content": "* Northern Trust names Michael G. O'Grady chief executive officer  effective January 1  2018",
        "date": "10172017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust names Michael G. O'Grady CEO effective January 1  2018 "
    },
    {
        "content": "* Northern Trust Corporation reports third quarter net income of $298.4 million  earnings per common share of $1.20",
        "date": "10182017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust Corporation reports third quarter net income of $298.4 million "
    },
    {
        "content": "* Northern Trust Corp repo​rts a 20.8 percent passive stake in Kellogg Co as of September 30  2017 - SEC filing Source text: (http://bit.ly/2xwRXzz) Further company coverage:",
        "date": "10102017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust repo​rts 20.8 pct passive stake in Kellogg "
    },
    {
        "content": "* Northern Trust appoints St. Louis president Source text for Eikon: Further company coverage:",
        "date": "09202017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern trust appoints St. Louis president "
    },
    {
        "content": "* Northern Trust names Yen Leng Ong as country head Singapore and head of South East Asia Source text for Eikon: Further company coverage:",
        "date": "08302017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust names Yen Leng Ong as country head Singapore and head of South East Asia "
    },
    {
        "content": "* Files for potential mixed shelf offfering; size not disclosed - sec filing Source text: (http://bit.ly/2vmAg95) Further company coverage:",
        "date": "07312017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust files for potential mixed shelf offfering "
    },
    {
        "content": "LONDON  July 25 Around a third of Northern Trust's institutional clients have asked it to ringfence British exposure from their broader European portfolios to protect them from Brexit-related risks.",
        "date": "07252017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "Northern Trust clients \"segregate\" UK from European exposure "
    },
    {
        "content": "** Shares of U.S. asset management company down 6.6 pct at $90.96 and on course for worst one-day performance since last June  when Britain voted to leave the EU",
        "date": "07192017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BUZZ-Northern Trust Corp: Set for worst day since Brexit vote "
    },
    {
        "content": "* Northern Trust Corporation reports second quarter net income of $267.9 million  earnings per common share of $1.12",
        "date": "07192017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust Corp reports Q2 earnings of $1.12 per share "
    },
    {
        "content": "LONDON  July 19 Asset management company Northern Trust will set up a European Union banking base in Luxembourg following Britain's decision last year to leave the bloc  the body promoting the Grand Duchy as a financial centre said on Wednesday.",
        "date": "07192017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "UPDATE 2-Northern Trust to set up EU bank in Luxembourg ahead of Brexit "
    },
    {
        "content": "* Says Stephen N. Potter appointed vice chairman of the board Source text for Eikon: Further company coverage:",
        "date": "07172017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust says Stephen Potter appointed vice chairman of the board "
    },
    {
        "content": "LONDON  July 19 Asset management company Northern Trust will set up a European Union banking base in Luxembourg following Britain's decision to leave the bloc  the body promoting the Grand Duchy as a financial centre said on Wednesday.",
        "date": "07192017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "Northern Trust to set up EU bank in Luxembourg ahead of Brexit "
    },
    {
        "content": "July 17 Northern Trust Corp said on Monday it appointed Lisa Marcus as managing director and senior wealth strategist.",
        "date": "07172017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust names Lisa Marcus managing director  senior wealth strategist "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 12 (Fitch) Fitch Ratings has affirmed the Long- and Short-Term Issuer Default Ratings (IDRs) of Northern Trust Corporation (NTRS) at 'AA-'/'F1+'. The Rating Outlook remains Stable. A full list of rating actions follows at the end of this rating action commentary. KEY RATING DRIVERS IDRs  VR AND SENIOR DEBT The affirmation of NTRS' ratings reflects the company's solid franchise in institutional asset management  private wea",
        "date": "07122017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "Fitch Affirms Northern Trust's Long-Term IDR at 'AA-'; Outlook Stable "
    },
    {
        "content": "* Northern Trust - pursuant to its 2017 capital plan  co requested authority to increase quarterly common stock dividend to $0.42/share from $0.38/share",
        "date": "06282017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust requests authority to increase qtrly common stock dividend "
    },
    {
        "content": "May 24 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05242017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES- Rothschild  Northern Trust  Bluemountain Capital "
    },
    {
        "content": "May 24 Northern Trust Corp said on Wednesday it appointed Wim van Ooijen to lead its business activities in Switzerland  effective immediately.",
        "date": "05242017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust appoints Wim van Ooijen to head Switzerland business "
    },
    {
        "content": "April 17 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04172017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Citigroup  Northern Trust  Morningstar Credit Ratings "
    },
    {
        "content": "April 17 Northern Trust Corp appointed Robert Ashcroft senior vice president and director of business owner consulting in its wealth management unit.",
        "date": "04172017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust Wealth Management hires new director of business owner consulting "
    },
    {
        "content": "WASHINGTON Northern Trust Corp  had shortcomings in its \"living will\" plans and has until year-end to update a proposal for how to unwind if it went bankrupt  U.S. regulators said on Friday as they granted an extension for four foreign banks to comply.",
        "date": "03242017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "Fed gives four foreign banks 'living will' extension  faults Northern Trust "
    },
    {
        "content": "WASHINGTON  March 24 Northern Trust Corp  had shortcomings in its \"living will\" plans and has until year-end to update a proposal for how to unwind if it went bankrupt  U.S. regulators said on Friday as they granted an extension for four foreign banks to comply.",
        "date": "03242017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "UPDATE 1-Fed gives four foreign banks 'living will' extension  faults Northern Trust "
    },
    {
        "content": "WASHINGTON  March 24 Northern Trust Corp  had shortcomings in its 'living will' plans and will have until year-end to update its plan on how to unwind in bankruptcy  U.S. regulators said on Friday as they granted a similar extension to four foreign banks.",
        "date": "03242017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "CORRECTED-Fed gives Northern Trust 'living will' extension along with four foreign banks "
    },
    {
        "content": "March 21 Northern Trust Corp announced five management changes following the appointment of Peter Cherecwich as president of its Corporate & Institutional Services (C&IS) unit.",
        "date": "03212017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust announces new hires for institutional business "
    },
    {
        "content": "* Northern Trust Corp - CEO Frederick Waddell's total compensation for 2016 was $11.2 million versus $12.8 million in 2015 - SEC filing  Source text for Eikon: (http://bit.ly/2nqMA4b) Further company coverage:",
        "date": "03162017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust Corp's CEO Frederick Waddell's 2016 total compensation was $11.2 mln "
    },
    {
        "content": "March 16 Northern Trust Corp named Katharine Morris head of sales at its global fund services business in the UK.",
        "date": "03162017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust hires global fund services sales head for UK "
    },
    {
        "content": "* Northern Trust hires head of global fund services sales for the UK",
        "date": "03162017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust hires head of global fund services sales for UK "
    },
    {
        "content": "NEW YORK  Feb 22 Northern Trust Corp has deployed a new blockchain-based system built with International Business Machines Corp  to record information on transactions involving private equity funds  in one of the first commercial deployments of the nascent technology.",
        "date": "02222017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "Northern Trust uses blockchain for private equity record-keeping "
    },
    {
        "content": "ZURICH  Feb 20 U.S.-based Northern Trust  is buying UBS Group's UBS Asset Management fund administration servicing units in Luxembourg and Switzerland  UBS said in a statement on Monday.",
        "date": "02202017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "Northern Trust buys UBS Asset Management administration units "
    },
    {
        "content": "* Northern Trust to acquire fund services units of UBS in Luxembourg and Switzerland",
        "date": "02202017",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust to acquire fund services units of UBS in Luxembourg and Switzerland "
    },
    {
        "content": "* Northern Trust Corporation reports fourth quarter net income of $266.5 million  earnings per common share of $1.11",
        "date": "01182017",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust posts Q4 earnings per share $1.11 "
    },
    {
        "content": "Sept 29 Northern Trust Corp said it appointed Vignesh Vijayakumar as senior relationship manager and Yovan Dabee as senior wealth strategist for Northern Trust's Global Family & Private Investment Offices group in London.",
        "date": "09292016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust announces two senior appointments "
    },
    {
        "content": "Sept 12 Wealth management company Northern Trust Corp appointed James Wright the head of its Institutional Investor Group for the UK  Ireland and Guernsey.",
        "date": "09122016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-James Wright joins Northern Trust Institutional Investor Group "
    },
    {
        "content": "Aug 1 U.S.-based wealth management firm Northern Trust Corp said it appointed Delbert Chang as senior vice president and senior portfolio manager.",
        "date": "08012016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust names Delbert Chang senior portfolio manager "
    },
    {
        "content": "July 29 U.S.-based wealth management firm Northern Trust Corp named Sarah Boddey chief diversity officer for its Europe  Middle East  Africa (EMEA) and Asia-Pacific (APAC) regions.",
        "date": "07292016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust hires chief diversity officer for EMEA  APAC "
    },
    {
        "content": "* Declared a quarterly cash dividend of $0.38 per share on its common stock ($1.66-2/3 par value)  payable on october 1  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "07202016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust raises quarterly dividend "
    },
    {
        "content": "* Northern Trust Corporation reports second quarter net income of $260.7 million  earnings per common share of $1.09",
        "date": "07202016",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust Corp reports Q2 earnings per share $1.09 "
    },
    {
        "content": "* President William L. Morrison has been appointed to a new role as vice chairman",
        "date": "07192016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust names William Morrison vice chairman "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 12 (Fitch) Fitch Ratings has affirmed the Long-Term and Short-Term  Issuer Default Ratings (IDRs) of Northern Trust Corporation (NTRS) and its  subsidiaries at 'AA-' and 'F1+'  respectively. NTRS' Viability Rating (VR) has  also been affirmed at 'aa-'. The Rating Outlook remains Stable.  These rating actions were taken in conjunction with Fitch's U.S. trust and  processing bank peer review. A full list of rating actions is",
        "date": "07122016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "Fitch Affirms Northern Trust's IDR at 'AA-'; Outlook Stable "
    },
    {
        "content": "* Northern Trust's 2016 capital plan provides for repurchase of up to $275 million of its common stock",
        "date": "06292016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust announces proposed capital actions "
    },
    {
        "content": "* Dissolves 10.69 pct passive stake in Global Ship Lease Inc as of February 29  2016 - SEC filing  Source text - (http://1.usa.gov/1VZX5FJ)",
        "date": "06152016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust dissolves passive stake in Global Ship Lease "
    },
    {
        "content": "* 50 South Capital Advisors and Aurora Investment Management terminate acquisition agreement   Source text for Eikon:   Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04182016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-50 South Capital Advisors and Aurora Investment Management terminate acquisition agreement "
    },
    {
        "content": "* Northern Trust announces new director appointment  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04192016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust announces new director appointment "
    },
    {
        "content": "* Q1 earnings per share view $0.95 -- Thomson Reuters I/B/E/S",
        "date": "04192016",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "BRIEF-Northern Trust Q1 earnings per share $1.01 "
    },
    {
        "content": "April 5 U.S.-based wealth management company Northern Trust Corp said it appointed John McCareins to lead its Asia-Pacific asset management business.",
        "date": "04052016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust appoints Asia-Pacific asset management head "
    },
    {
        "content": "March 31 Northern Trust Corp said it appointed Joseph Gillingwater as head of fixed income securities lending trading for Europe  Middle East and Africa (EMEA) region and Asia-Pacific (APAC) region.",
        "date": "03312016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust hires State Street's Joseph Gillingwater "
    },
    {
        "content": "BOSTON  March 3 Northern Trust Corporation  is beefing up its alternative assets business by buying hedge fund of funds manager Aurora Investment Management  the trust bank said.",
        "date": "03032016",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "Northern Trust buys hedge fund investor Aurora from Natixis "
    },
    {
        "content": "Jan 11 Northern Trust Corp hired Henry Johnson to lead its wealth management business in the U.S. Northeast.",
        "date": "01112016",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust hires Henry Johnson from Fiduciary Trust "
    },
    {
        "content": "Dec 7 U.S.-based wealth management company Northern Trust Corp appointed Belinda Burgess as head of its Channel Islands office.",
        "date": "12072015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust names Belinda Burgess as Channel Islands head "
    },
    {
        "content": "Nov 12 Northern Trust Corp named Ali Sheikh as head of its hedge fund services business in Asia-Pacific.",
        "date": "11122015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust names Ali Sheikh head of hedge fund services  Asia-Pacific "
    },
    {
        "content": "Nov 9 U.S.-based wealth management company Northern Trust Corp appointed JPMorgan Chase & Co's  Bo Thulin to lead its businesses in the Nordic region.",
        "date": "11092015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust names Bo Thulin as head of Nordic region "
    },
    {
        "content": "Sept 8 Wealth manager Northern Trust Corp  named Douglas Gee head of sales for its asset servicing business in Europe  Middle East and Africa.",
        "date": "09082015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust names Douglas Gee head of sales for asset servicing "
    },
    {
        "content": "Sept 10 Custody bank Northern Trust Corp  said it appointed Sunil Daswani as head of its international securities lending across Europe  Middle East  Africa and Asia-Pacific.",
        "date": "09102015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust makes appointments in global capital markets business "
    },
    {
        "content": "July 21 Asset management company Northern Trust Corp appointed Madeleine Senior as head of Australia and New Zealand to replace Rohan Singh  who will become head of Singapore and South East Asia.",
        "date": "07212015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust appoints head of Australia and New Zealand "
    },
    {
        "content": "American Bryce Molder used a red-hot finish to move into a four-way share of the second round clubhouse lead at the Greenbrier Classic on Friday while world number three Bubba Watson was three shots back.",
        "date": "07032015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "Molder grabs share of Greenbrier lead  Watson three back "
    },
    {
        "content": "June 10 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06102015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES- Deutsche Bank  Virgin Money  Westpac Banking  Metro Bank "
    },
    {
        "content": "June 10 Asset management company Northern Trust Corp said Paul Lee had joined its wealth advisory services group as senior vice president and senior regional wealth adviser.",
        "date": "06102015",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust names Paul Lee senior regional wealth adviser "
    },
    {
        "content": "April 17 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04172015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES- Barclays  Northern Trust  Cantor Fitzgerald  Morgan Stanley "
    },
    {
        "content": "April 17 Asset management company Northern Trust Corp appointed Shane Teunissen and Ann-Marie Garry as sales representatives to support its expansion across Australia.",
        "date": "04172015",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust appoints two sales representatives in Australia "
    },
    {
        "content": "March 26 Asset management company Northern Trust Corp appointed Michael Wu to a newly created role of head of its Greater China region.",
        "date": "03262015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "MOVES-Northern Trust names Michael Wu head of Greater China "
    },
    {
        "content": "Wealth management firm Veris Wealth Partners said it hired Jane Swan from Northern Trust Corp as senior wealth manager.",
        "date": "03032015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "Veris Wealth hires adviser from Northern Trust "
    },
    {
        "content": "The assistants for this year's Presidents Cup in South Korea were finalised on Wednesday with Internationals captain Nick Price opting for continuity and his United States counterpart Jay Haas turning to experience.",
        "date": "03042015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "Price  Haas finalize assistants for Presidents Cup "
    },
    {
        "content": "March 3 Wealth management firm Veris Wealth Partners said it hired Jane Swan from Northern Trust Corp  as senior wealth manager.",
        "date": "03032015",
        "name": "Northern Trust Corporation",
        "news_type": "normal",
        "symbol": "NTRS",
        "title": "ON THE MOVE-Veris Wealth hires adviser from Northern Trust "
    },
    {
        "content": "Northern Trust Corp has agreed to pay $60 million to settle lawsuits over claims that the financial services institution imprudently managed its securities lending program  resulting in losses to retirement plans and pension funds.",
        "date": "02232015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "Northern Trust to pay $60 million over securities lending program "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 21 (Fitch) Northern Trust Corporation's (Northern) fourth  quarter 2014 (4Q'14) net income was $244 million  which equated to a return on  average common equity (ROE) of 11.5%. Fitch Ratings notes that this includes  $9.5 million income tax benefit related to Northern's decision to reinvest the  pre-tax earnings of a foreign tax subsidiary indefinitely outside the U.S. Excluding this income tax benefit would imply net i",
        "date": "01212015",
        "name": "Northern Trust Corporation",
        "news_type": "topStory",
        "symbol": "NTRS",
        "title": "Higher Earnings in Northern Trust's Fourth Quarter Results "
    }
]