[
    {
        "content": "Shares of Nvidia Corp  hit a record on Friday  after it posted stellar quarterly results powered by higher demand for graphics chips used in gaming and data centers  and the rapid adoption of its new Volta chips for AI and driverless cars.",
        "date": "11102017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia shares set record as Volta chips ensure future growth "
    },
    {
        "content": "Nvidia Corp's  quarterly profit and revenue topped market estimates and the chipmaker also gave a strong revenue forecast for the current quarter  powered by demand for its graphics chips used in gaming and data centers.",
        "date": "11092017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Chipmaker Nvidia tops estimates on gaming  data center boost "
    },
    {
        "content": "* Indexes end down: Dow 0.43 pct  S&P 0.38 pct  Nasdaq 0.58 pct (Updates with detail on Nvidia's stock move)",
        "date": "11092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "US STOCKS-Tech stocks tug Wall St lower; investors fret about U.S. tax cut delays "
    },
    {
        "content": "Nov 6 Bitter rivals Advanced Micro Devices Inc and Intel Corp on Monday unveiled a partnership that will help the chipmakers take on Nvidia Corp.",
        "date": "11062017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Rivals AMD  Intel partner to take on Nvidia "
    },
    {
        "content": "* Nvidia Corp Q3 fy 2018 gpu business revenue of $2 217 million versus $1 697 million  ‍​",
        "date": "11092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia Corp Q3 FY 2018 GPU business revenue of $2 217 million versus $1 697 million  ‍​ "
    },
    {
        "content": "TOKYO Sprint Corp  can grow on its own but will still consider a merger if it can get management control  the CEO of the U.S. wireless operator's parent SoftBank Group Corp said  days after a move to combine with T-Mobile US Inc  ended.",
        "date": "11062017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "SoftBank's Son says Sprint can grow on its own but merger door still open "
    },
    {
        "content": "* Q2 op profit rises  buoyed by Vision Fund's gains (Adds details of Softbank's investments)",
        "date": "11062017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 3-SoftBank's Son says Sprint can grow on its own but merger door still open "
    },
    {
        "content": "* Nvidia announces financial results for third quarter fiscal 2018",
        "date": "11092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia posts Q3 adj. earnings per share $1.33 "
    },
    {
        "content": "* Intel and AMD team up on PC chips to battle Nvidia- WSJ  citing sources‍​",
        "date": "11062017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-Intel and AMD team up on PC chips to battle Nvidia- WSJ "
    },
    {
        "content": "Nov 9 Nvidia Corp reported a 54.6 percent rise in quarterly profit  driven by strong demand for its graphics chips used in gaming devices  data centers  autonomous vehicles and also by cryptocurrency miners.",
        "date": "11092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia Corp reports 54.6 percent rise in quarterly profit "
    },
    {
        "content": "SAN FRANCISCO Shares of chipmakers slumped on Thursday ahead of a quarterly earnings report from Nvidia Corp   the star performer of the high-flying sector over the past year.",
        "date": "11092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Chip stocks tumble as top performer Nvidia set to report results "
    },
    {
        "content": "* Is collaborating with Taiwan's Ministry of Science & Technology to accelerate development of artificial intelligence across Taiwan's commercial sector​",
        "date": "10262017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-NVIDIA  Taiwan government partner to accelerate AI development in Taiwan's commercial sector​ "
    },
    {
        "content": "LONDON Silicon Valley graphics chipmaker NVIDIA unveiled on Tuesday the first computer chips for developing fully autonomous vehicles and said it had more than 25 customers working to build a new class of driverless cars  robotaxis and long-haul trucks.",
        "date": "10102017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "NVIDIA unveils next-generation platform for fully autonomous cars "
    },
    {
        "content": "LONDON  Oct 10 Silicon Valley graphics chipmaker NVIDIA unveiled on Tuesday the first computer chips for developing fully autonomous vehicles and said it had more than 25 customers working to build a new class of driverless cars  robotaxis and long-haul trucks.",
        "date": "10102017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 1-NVIDIA unveils next-generation platform for fully autonomous cars "
    },
    {
        "content": "* Nvidia Corp - Deutsche Post DHL Group and ZF partnered together to deploy a test fleet of autonomous delivery trucks  starting in 2018​ Source text for Eikon: Further company coverage:",
        "date": "10102017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia - Deutsche Post DHL Group and ZF partner to deploy test fleet of autonomous delivery trucks​ "
    },
    {
        "content": "LONDON  Oct 10 Silicon Valley graphics chipmaker NVIDIA unveiled on Tuesday the first computer chips for developing fully autonomous vehicles and said it had more than 25 customers working to build a new class of driverless cars  robotaxis and long-haul trucks.",
        "date": "10102017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "NVIDIA unveils next-generation chip for fully autonomous cars "
    },
    {
        "content": "* Creative subsidiary Ziilabs files patent infringement lawsuit in the US against Nvidia Corporation",
        "date": "10032017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Creative Technology's unit files patent infringement lawsuit against Nvidia corp "
    },
    {
        "content": "The giant information and entertainment screens in Tesla Inc's cars will now be powered by chipmaker Intel Corp after the electric carmaker replaced Nvidia Corp for that function  Bloomberg reported.",
        "date": "09262017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Tesla shifts to Intel from Nvidia for infotainment: Bloomberg "
    },
    {
        "content": "Sept 26 The giant information and entertainment screens in Tesla Inc's cars will now be powered by chipmaker Intel Corp after the electric carmaker replaced Nvidia Corp for that function  Bloomberg reported.",
        "date": "09262017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Tesla shifts to Intel from Nvidia for infotainment - Bloomberg "
    },
    {
        "content": "* Indexes up: Dow 0.29 pct  S&P 0.25 pct  Nasdaq up 0.49 pts (Updates to open)",
        "date": "09262017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "US STOCKS-Tech stocks power Wall St at open "
    },
    {
        "content": "* Avitas Systems GE Venture- Partnering with Nvidia to use some advances in artificial intelligence computing to optimize use of robotics Source text: [http://bit.ly/2wLeh9O] Further company coverage:",
        "date": "09072017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Avitas Systems  a GE Venture  partners with Nvidia to enhance AI for robotic inspection and automated defect recognition "
    },
    {
        "content": "Nvidia Corp's quarterly revenue in its widely watched data center and automotive businesses missed estimates  dragging down the chipmaker's shares that have nearly tripled in value over the past 12 months.",
        "date": "08112017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia shares fall on data center revenue but chips ride cryptocurrency boom "
    },
    {
        "content": "A federal appeals court on Tuesday revived a non-practicing entity's patent infringement case against video chipmaker Nvidia Corp  finding that the asserted patent does not claim an abstract idea.",
        "date": "08152017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Federal Circuit revives computer memory patent case against Nvidia "
    },
    {
        "content": "Aug 10 Nvidia Corp's quarterly revenue in its widely watched data center and automotive businesses missed estimates  dragging down the chipmaker's shares that have nearly tripled in value over the past 12 months.",
        "date": "08112017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 3-Nvidia shares fall on data center revenue but chips ride cryptocurrency boom "
    },
    {
        "content": "* Nvidia Corp - qtrly revenue from gpu business $1 897 million versus $1 196 million",
        "date": "08102017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia reports 19 pct rise in quaretrly automotive revenue "
    },
    {
        "content": "Aug 10 Nvidia Corp reported a 56 percent jump in quarterly revenue on Thursday  helped by strong demand for its chips used in data centers and gaming devices such as Nintendo Co Ltd's Switch.",
        "date": "08102017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia's quarterly revenue rises 56 percent "
    },
    {
        "content": "* Nvidia announces financial results for second quarter fiscal 2018",
        "date": "08102017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia Q2 non-GAAP earnings per share $1.01 "
    },
    {
        "content": "* Nvidia recalls european plug heads sold with power adaptors due to electric shock hazard",
        "date": "08082017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-U.S. CPSC says Nvidia recalls european plug heads sold with power adaptors due to electric shock hazard "
    },
    {
        "content": "* Nvidia Corp - ‍launch of Nvidia Optix 5.0 SDK with ray-tracing capabilities​ Source text for Eikon: Further company coverage:",
        "date": "07312017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia Corp launches Nvidia Optix 5.0 SDK with ray-tracing capabilities​ "
    },
    {
        "content": "* Nvidia - co   baidu announced partnership to bring artificial intelligence technology to cloud computing  self-driving vehicles and ai home assistants",
        "date": "07052017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-NVIDIA  Baidu announce partnership to accelerate AI "
    },
    {
        "content": "DETROIT  July 5 Baidu Inc  the top Chinese internet search firm  has formed a broad alliance to promote self-driving cars  pitting its Apollo platform against Alphabet Inc's system  it said on Wednesday  in hopes of getting the vehicles on the road in China by 2019.",
        "date": "07052017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "China's Baidu taps 50 partners to help advance self-driving "
    },
    {
        "content": "SUNNYVALE  Calif.  June 30 Baidu  China's leading internet search company  is set to announce the first vehicle manufacturing partners for its self-driving software next week  including Chery Automobile  one of the country's biggest carmakers  according to a person familiar with the matter.",
        "date": "06302017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Baidu leads China’s self-driving charge in Silicon Valley "
    },
    {
        "content": "* Nvidia will release graphic cards specifically designed for cryptocurrency mining through its partners - CNBC  citing source Source text - http://cnb.cx/2sXMDVf Further company coverage: (Bengaluru Newsroom)",
        "date": "06272017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia to launch graphic cards specifically designed for cryptocurrency mining - CNBC "
    },
    {
        "content": "FRANKFURT  June 27 German carmaker Volkswagen said on Tuesday it would cooperate with U.S. chipmaker Nvidia on deep learning software that could be used to manage traffic flows or make it easier for humans to work with robots.",
        "date": "06272017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Volkswagen  Nvidia to cooperate on artificial intelligence "
    },
    {
        "content": "SAN FRANCISCO  June 26 Chipmaker Nvidia Corp announced on Monday it was partnering with Volvo Cars and Swedish auto supplier Autoliv to develop self-driving car technology for vehicles due to hit the market by 2021.",
        "date": "06272017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "REFILE--Nvidia partners with Volvo  auto suppliers  in self-driving deals "
    },
    {
        "content": "STOCKHOLM  June 27 Volvo Cars and Swedish car safety supplier Autoliv have signed a deal with U.S. firm Nvidia Corp  best known for its graphics technology in computer games  to develop software systems for self-driving cars.",
        "date": "06272017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Volvo and Autoliv team up with Nvidia for self-driving cars "
    },
    {
        "content": "* Sees need to go on offensive while preserving firm's strengths",
        "date": "06142017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Toyota chief says may consider acquisitions to gain auto tech access "
    },
    {
        "content": "SAN FRANCISCO A steep drop in technology stocks on Friday  led by Apple's worst plunge in 14 months  has left investors concerned that a rally may be over for high-flying Silicon Valley names that have pushed Wall Street to record highs this year.",
        "date": "06092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "U.S. tech stock selloff leaves investors eyeing end of rally "
    },
    {
        "content": "SAN FRANCISCO  June 9 A steep drop in technology stocks on Friday  led by Apple's worst plunge in 14 months  has left investors concerned that a rally may be over for high-flying Silicon Valley names that have pushed Wall Street to record highs this year.",
        "date": "06092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "RPT-U.S. tech stock selloff leaves investors eyeing end of rally "
    },
    {
        "content": "* Dow up 0.42 pct  S&P down 0.08 pct  Nasdaq down 1.8 pct (Updates to close with Apple's biggest decline in about 14 months  share details on Alphabet and Facebook)",
        "date": "06092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "US STOCKS-Tech stocks tumble  taking down Nasdaq as big names sink "
    },
    {
        "content": "* Former FBI director says no doubt Russia meddled in U.S. election",
        "date": "06082017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "US STOCKS-S&P  Dow flat after Comey testimony; Nasdaq at record high "
    },
    {
        "content": "* Dow up 0.42 pct  S&P down 0.08 pct  Nasdaq down 1.8 pct (Updates to close of U.S. markets)",
        "date": "06092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "US STOCKS-Tech stocks tumble  taking down Nasdaq "
    },
    {
        "content": "* On june 2  co entered into an agreement with goldman sachs & co. Llc - sec filing",
        "date": "06052017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia enters into agreement with Goldman Sachs "
    },
    {
        "content": "* Softbank Group Corp has amassed a $4 billion stake in Nvidia Corp making it the fourth-largest shareholder in the chipmaker - Bloomberg  citing sources Source: https://bloom.bg/2qNPVLr Further company coverage:",
        "date": "05242017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Softbank has amassed a $4 bln stake in Nvidia Corp- Bloomberg "
    },
    {
        "content": "* On March 31  A German patent court acknowledged receipt of nullity actions filed by co challenging validity of EP1428225 and DE 1020066043668",
        "date": "05232017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-A German patent court acknowledged receipt of nullity actions filed by Nvidia "
    },
    {
        "content": "SAN JOSE Nvidia Corp announced a partnership with Toyota Motor Corp on Wednesday  saying the Japanese car maker would use Nvidia's artificial intelligence technology to develop self-driving vehicle systems planned for the next few years.",
        "date": "05102017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia says Toyota will use its AI technology for self-driving cars "
    },
    {
        "content": "SAN JOSE  May 10 Nvidia Corp announced a partnership with Toyota Motor Corp on Wednesday  saying the Japanese car maker would use Nvidia's artificial intelligence technology to develop self-driving vehicle systems planned for the next few years.",
        "date": "05102017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 1-Nvidia says Toyota will use its AI technology for self-driving cars "
    },
    {
        "content": "SAN FRANCISCO  May 10 Nvidia Corp and Toyota Motor Corp on Wednesday in a statement said the Japanese car maker would use Nvidia's microchip technology to develop self-driving vehicle systems planned for the next few years.",
        "date": "05102017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia says Toyota will use its technology for self-driving cars "
    },
    {
        "content": "Nvidia Corp  reported a better-than-expected 48.4 percent jump in quarterly revenue  helped by strong demand for its chips that are used by major cloud computing providers in data centers.",
        "date": "05092017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia's data center business powers revenue beat "
    },
    {
        "content": "* Shares jump 14.2 pct after market (Adds analyst and CFO comments; Updates share move)",
        "date": "05092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 2-Nvidia's data center business powers revenue beat "
    },
    {
        "content": "* NVidia announces financial results for first quarter fiscal 2018",
        "date": "05092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-NVidia reports Q1 non-GAAP earnings per share $0.85 "
    },
    {
        "content": "* Q1 revenue from GPU business $1 562 million versus $1 079 million",
        "date": "05092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia Q1 revenue from gpu business $1 562 million "
    },
    {
        "content": "May 9 Nvidia Corp reported a 48.4 percent jump in quarterly revenue  helped by strong demand for its graphics chips and its diversification into fast-growing areas such as self-driving systems and artificial intelligence.",
        "date": "05092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Chipmaker Nvidia's quarterly revenue jumps 48.4 pct "
    },
    {
        "content": "* CEO Jen-Hsun Huang's FY 2017 total compensation was $12.2 million versus $10 million in fy 2016",
        "date": "04072017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia CEO's 2017 total compensation was $12.2 million "
    },
    {
        "content": "March 16 U.S. chipmaker Nvidia Corp said on Thursday it was working with truckmaker Paccar Inc  to develop autonomous vehicles.",
        "date": "03162017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Chipmaker Nvidia says working with Paccar on driverless trucks "
    },
    {
        "content": "* Bosch Connected World Bosch says working with Nvidia to develop artificial intelligence self-driving systems for mass market cars  Source text for Eikon: Further company coverage:",
        "date": "03152017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Bosch Connected World Bosch says working with Nvidia to develop artificial intelligence self-driving systems for mass market cars "
    },
    {
        "content": "DETROIT  March 10 California  the largest U.S. car market  plans to allow testing on public roads of self-driving vehicles without human backup drivers by the end of the year  state officials said Friday.",
        "date": "03102017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "California paves way to self-driving car tests without humans "
    },
    {
        "content": "Nvidia Corp's quarterly revenue surged more than 50 percent for the second straight quarter and beat expectations  helped by rising demand for its graphics chips and strength in rapidly growing areas such as self-driving systems and artificial intelligence.",
        "date": "02092017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Graphics-chip maker Nvidia's revenue beats expectations "
    },
    {
        "content": "Feb 9 Nvidia Corp's quarterly revenue surged more than 50 percent for the second straight quarter and beat expectations  helped by rising demand for its graphics chips and strength in rapidly growing areas such as self-driving systems and artificial intelligence.",
        "date": "02092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 2-Graphics-chip maker Nvidia's revenue beats expectations "
    },
    {
        "content": "* NVIDIA Corp says GPU business revenue for the fourth quarter was $1.85 billion  up 57 percent from a year earlier",
        "date": "02092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-NVIDIA Corp says GPU business revenue for the fourth quarter was $1.85 billion  up 57 percent from a year earlier "
    },
    {
        "content": "* NVIDIA announces financial results for fourth quarter and fiscal 2017",
        "date": "02092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-NVIDIA announces financial results for fourth quarter and fiscal 2017 "
    },
    {
        "content": "Feb 9 Nvidia Corp's quarterly revenue surged more than 50 percent for the second straight quarter  helped by rising demand for its graphics chips and strength in rapidly growing areas such as self-driving systems and artificial intelligence.",
        "date": "02092017",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Graphics-chip maker Nvidia's revenue surges 55.1 pct "
    },
    {
        "content": "Advanced Micro Devices Inc (AMD) shares could double in a year as the chip maker recoups ground lost to Intel Corp and increases its market share in the graphic chips area dominated by Nvidia Corp  Barron's said on Sunday.",
        "date": "02062017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "AMD stock could double in a year: Barron's "
    },
    {
        "content": "* Nvidia names Tim Teter as general counsel  Source text for Eikon:  Further company coverage:",
        "date": "01182017",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia names Tim Teter as general counsel "
    },
    {
        "content": "* Economic prospects strong enough for Fed rate hike - Fischer",
        "date": "11112016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "US STOCKS-Dow chalks up best week in five years  closes at record high "
    },
    {
        "content": "* Dow down 0.02 pct  S&P down 0.34 pct  Nasdaq up 0.22 pct   (Updates to afternoon)",
        "date": "11112016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "US STOCKS-Wall St rally sputters in Dow's best week since 2011 "
    },
    {
        "content": " (This Nov. 10  2016 story was refiled to correct the quarter in paragraph 12 to \"third\" from \"second\")",
        "date": "11112016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia posts biggest quarterly revenue growth in six years; shares soar "
    },
    {
        "content": "Nov 10 Nvidia Corp reported its biggest quarterly revenue growth in more than six years as demand soared for its gaming chips used in personal computers.",
        "date": "11112016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "CORRECTED-UPDATE 2-Nvidia posts biggest qtrly revenue growth in 6 yrs; shares soar "
    },
    {
        "content": "* Nvidia announces financial results for third quarter fiscal 2017",
        "date": "11102016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia posts Q3 earnings per share $0.94 "
    },
    {
        "content": "Nov 10 Nvidia Corp reported a 53.6 percent jump in quarterly revenue  helped by strong demand for the company's graphics processing chips used in personal computers and data centers.",
        "date": "11102016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia's quarterly revenue jumps 53.6 pct "
    },
    {
        "content": "* Gaming Corps and NVIDIA sign agreement for distribution and streaming of The Descendant",
        "date": "10182016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Gaming Corps and NVIDIA sign deal for distribution and streaming of The Descendant "
    },
    {
        "content": "* On October 7 entered into a credit agreement to repay and re-borrow amounts up to $575 million - SEC filing",
        "date": "10132016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia enters into credit agreement to repay and re-borrow amounts up to $575 mln "
    },
    {
        "content": "* Nvidia and tomtom develop mapping system for Self-Driving Cars  Source text for Eikon:  Further company coverage:",
        "date": "09282016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia and TomTom develop mapping system for Self-Driving Cars "
    },
    {
        "content": "* Notes consist of $1.0 billion of 2.20% notes due 2021 and $1.0 billion of 3.20% notes due 2026",
        "date": "09142016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia announces pricing of $2 billion notes offering "
    },
    {
        "content": "Sept 12 U.S. chipmaker Nvidia Corp  showed off on Monday a smaller and more efficient artificial intelligence computer for self-driving cars  saying it would power Baidu's mapping and autonomous vehicle technology.",
        "date": "09132016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia shows off smaller artificial intelligence computer for Baidu car "
    },
    {
        "content": "* Nvidia Files for a potential mixed shelf offering; size undisclosed - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "09062016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia files for a potential mixed shelf offering - SEC filing "
    },
    {
        "content": "SEOUL Tech giant Samsung Electronics Co Ltd won a contract manufacturing order to make new graphics processing unit (GPU) products for U.S.-based Nvidia Corp  South Korea's Chosun Biz newspaper reported on Friday  citing unnamed sources.",
        "date": "08122016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Samsung Elec gets order for Nvidia's next-gen GPUs: Chosun Biz "
    },
    {
        "content": "SEOUL  Aug 12 Tech giant Samsung Electronics Co Ltd won a contract manufacturing order to make new graphics processing unit (GPU) products for U.S.-based Nvidia Corp  South Korea's Chosun Biz newspaper reported on Friday  citing unnamed sources.",
        "date": "08122016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Samsung Elec gets order for Nvidia's next-gen GPUs -Chosun Biz "
    },
    {
        "content": "Chipmaker Nvidia Corp reported its fastest quarterly sales growth in nearly five years  powered by strong demand for the company's processors used in gaming computers and in data centers.",
        "date": "08112016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Gaming  data center strength propels Nvidia to another solid quarter "
    },
    {
        "content": "* Shares up about 3 pct after market   (Adds details  CEO and analyst comments; updates shares)",
        "date": "08112016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 2-Gaming  data center strength propels Nvidia to another solid quarter "
    },
    {
        "content": "* Qtrly revenue of $1.43 billion  up 24 percent from a year ago",
        "date": "08112016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia Q2 non-GAAP earnings per share of $0.53 "
    },
    {
        "content": "Aug 11 Chipmaker Nvidia Corp reported a 23.9 percent jump in quarterly revenue  its fastest quarterly sales growth in nearly five years  powered largely by strong demand for the company's processors used in gaming computers.",
        "date": "08112016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Chipmaker Nvidia's revenue surges 23.9 pct "
    },
    {
        "content": "* Nvidia Chief Administrative Officer  David Shannon  to retire at year's end  Source text for Eikon:  Further company coverage:    (Reporting By Siddharth Cavale)",
        "date": "06212016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia CAO David Shannon to retire at year's end "
    },
    {
        "content": "* Has entered into partnership with NVIDIA for the co-marketing and development of \"Conan Exiles\"",
        "date": "06082016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Funcom partners with NVIDIA on \"Conan Exiles\" "
    },
    {
        "content": "Nvidia Corp forecast better-than-expected revenue for the current quarter as it sees robust demand for its chips that power complex computer graphics.",
        "date": "05122016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Strong demand for graphics chips to boost Nvidia's revenue "
    },
    {
        "content": "May 12 Nvidia Corp forecast better-than-expected revenue for the current quarter as it sees robust demand for its chips that power complex computer graphics.",
        "date": "05122016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 2-Strong demand for graphics chips to boost Nvidia's revenue "
    },
    {
        "content": "NEW YORK Graphics chip maker Nvidia Corp announced a settlement of a patent dispute with Samsung Electronics Co Ltd on Monday  hours before a U.S. trade agency was due to rule on a complaint that could have blocked importation of some of Nvidia's products.",
        "date": "05022016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia settles feud with Samsung over graphics patents "
    },
    {
        "content": "* Says CEO Jen-Hsun Huang's total compensation for FY 2016 was $10 million versus $9.3 million in FY 2015 - SEC Filing",
        "date": "04072016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia CEO's FY 2016 total compensation was $10 mln vs $9.3 mln in FY 2015 - SEC Filing "
    },
    {
        "content": "* Says entered into an accelerated share repurchase agreement with Barclays Bank PLC - SEC filing",
        "date": "03232016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Nvidia enters into $500 mln accelerated share repurchase agreement with Barclays Bank "
    },
    {
        "content": "NEW YORK  March 1 A former hedge fund manager who admitted to trading on non-public information about various technology companies and became a cooperating witness in a wide-ranging insider trading investigation was spared prison on Tuesday by a federal judge.",
        "date": "03012016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Hedge fund manager spared prison for insider trading "
    },
    {
        "content": "Graphics chip maker Nvidia Corp infringed one of Samsung Electronic Co Ltd's patents  the U.S. International Trade Commission said on Wednesday while announcing it would review a ruling by an administrative judge that Nvidia also infringed two others.",
        "date": "02262016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "International Trade Commission confirms Nvidia infringed one Samsung patent  reviews others "
    },
    {
        "content": "Feb 17Chipmaker Nvidia Corp reported a 12 percent rise in quarterly revenue  helped by strong demand for its chips used in gaming consoles and personal computers.",
        "date": "02172016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia revenue rises 12 pct on higher chip demand "
    },
    {
        "content": "Graphics chip maker Nvidia Corp has won a round in a bitter patent dispute with Samsung Electronics Co Ltd after a U.S. jury cleared Nvidia of infringing the Korean company's microchip technology  Nvidia said on Friday.",
        "date": "02052016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Jury clears Nvidia of infringing Samsung chip technology patent "
    },
    {
        "content": "LAS VEGAS Nvidia Corp. unveiled a new  lunchbox-size super-computer for self-driving cars and said Volvo Car Group will be the new device's first customer.",
        "date": "01062016",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia says Volvo is first customer for new autonomous drive computer "
    },
    {
        "content": "LAS VEGAS  Jan 4 Nvidia Corp. unveiled a new  lunchbox-size super-computer for self-driving cars and said Volvo Car Group will be the new device's first customer.",
        "date": "01052016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia says Volvo is first customer for new autonomous drive computer "
    },
    {
        "content": "LAS VEGAS  Jan 5 Nvidia Corp. unveiled a new  lunchbox-size super-computer for self-driving cars and said Volvo Car Group will be the new device's first customer.",
        "date": "01062016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 2-Nvidia says Volvo is first customer for new autonomous drive computer "
    },
    {
        "content": "LAS VEGAS  Jan 4 Nvidia Corp. unveiled a new  lunchbox-size super-computer for self-driving cars and said Volvo Car Group will be the new device's first customer.",
        "date": "01052016",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 1-Nvidia says Volvo is first customer for new autonomous drive computer "
    },
    {
        "content": "** Philadelphia SE Semiconductor Index gaining 1 pct in midday trade and challenging its late Oct high at 685.78",
        "date": "12012015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BUZZ-Chips quietly rip higher "
    },
    {
        "content": "* Its game 'Layers of Fear' to be distributed on Nvidia GeForce Platform Now as of Oct. 27  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "10272015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Bloober Team game distributed on Nvidia Geforce Platform Now "
    },
    {
        "content": "* Its game 'Layers of Fear' to be distributed on Nvidia GeForce platform as of Oct. 27  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "10272015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-Bloober Team game distributed on Nvidia GeForce platform "
    },
    {
        "content": "* Indexes end down: Dow 0.27 pct  S&P 0.29 pct  Nasdaq 0.26 pct   (Updates to close  adds detail on valuations  earnings)",
        "date": "08072015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "US STOCKS-Wall St drops as jobs report augurs for September rate hike "
    },
    {
        "content": "* Indexes down: Dow 0.62 pct  S&P 0.65 pct  Nasdaq 0.86 pct   (Updates to mid-afternoon)",
        "date": "08072015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "US STOCKS-Wall St falls as rosy jobs growth points to September rate hike "
    },
    {
        "content": "Nvidia Corp reported a surprise rise in second-quarter revenue and gave a better-than-expected revenue forecast for the current quarter  helped by strong demand for its graphic chips used in gaming and cars.",
        "date": "08062015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia's gaming chips drive surprise rise in revenue "
    },
    {
        "content": "* Traders pricing a 52 pct chance for Sept hike  up from 47 pct",
        "date": "08072015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "US STOCKS-Wall St falls as jobs data raises Sept rate hike chances "
    },
    {
        "content": "Aug 6 Chipmaker Nvidia Corp reported a 4.5 percent rise in quarterly revenue  helped by strong demand for its chips used in cars and for cloud computing.",
        "date": "08062015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia revenue rises 4.5 pct on strong demand for car chips "
    },
    {
        "content": "* Nvidia touches four-month high after revenue beats estimates",
        "date": "08072015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "US STOCKS-Wall St falls as jobs data supports Sept rate hike "
    },
    {
        "content": "Nvidia Corp said it was recalling some of its Shield 8-inch tablets in the United States as the battery in these devices can overheat  posing a fire hazard.",
        "date": "07312015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia recalls some Shield tablets due to battery fire fears "
    },
    {
        "content": "July 31 Nvidia Corp said it was recalling some of its Shield 8-inch tablets in the United States as the battery in these devices can overheat  posing a fire hazard.",
        "date": "07312015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "CORRECTED-UPDATE 2-Nvidia recalls some Shield tablets due to battery fire fears "
    },
    {
        "content": "July 31 Graphics chipmaker Nvidia Corp  is recalling some of its Shield 8-inch tablets as the battery in these devices can overheat  posing a fire hazard.",
        "date": "07312015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia recalls Shield tablets due to battery concerns "
    },
    {
        "content": "TAIPEI Chipmaker Nvidia Corp  said it expects cloud computing revenue to hit $1 billion in the next two to three years  as demand for big data analysis drives growth in graphics chips.",
        "date": "06012015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia says it sees revenue from cloud computing at $1 bln within two-three years "
    },
    {
        "content": "DETROIT  May 14 It took Silicon Valley chipmaker Nvidia Corp the better part of a decade to gain acceptance as a global automotive supplier  a lesson for other technology firms hoping to make a similar transition from consumer electronics to car components.",
        "date": "05142015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia wants to leap from video games to self-driving cars "
    },
    {
        "content": "* Said on Tuesday its game Brawl will debut on NVIDIA Shield platform on June 11",
        "date": "05132015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "BRIEF-Bloober Team's game Brawl to debut on NVIDIA Shield "
    },
    {
        "content": "Nvidia Corp forecast lower-than-expected revenue for the second quarter  weighed down by lower demand for its graphic processor units due to a fall in personal computer sales and a strong dollar.",
        "date": "05072015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Weak PC sales  strong dollar hurt Nvidia's second-quarter forecast "
    },
    {
        "content": "* Shares fall as much as 4.4 pct after market   (Adds analyst  CFO comments)",
        "date": "05072015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 2-Weak PC sales  strong dollar hurt Nvidia's 2nd-qtr forecast "
    },
    {
        "content": "May 5 Nvidia Corp said it would wind down its Icera modem operations  and was open to a sale of the technology or operations.",
        "date": "05052015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia to wind down Icera modem operations "
    },
    {
        "content": "May 7 Nvidia Corp forecast lower-than-expected revenue for the second quarter  weighed down by lower demand for its graphic processor units due to a fall in personal computer sales and a stronger dollar.",
        "date": "05072015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "CORRECTED-UPDATE 1-Nvidia's revenue forecast misses estimates due to lower PC sales "
    },
    {
        "content": "May 7 Nvidia Corp posted a 4.4 percent rise in quarterly revenue  as the graphics-chip maker moves beyond supplying chips for personal computers to focus on processors for cars and cloud computing.",
        "date": "05072015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia quarterly revenue rises 4.4 pct "
    },
    {
        "content": "Despite two 2014 Supreme Court decisions making it easier to award attorneys' fees in infringement cases  a U.S. appeals court has overturned a sanctions ruling against Biax Corp  a Colorado patent-holding firm currently in bankruptcy.",
        "date": "02252015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Federal Circuit says Nvidia patent case is exceptional no more "
    },
    {
        "content": "* Its game  Brawl  is accepted on Nvidia's Shield platform  and will be presented at Game Developers Conference in San Francisco  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "02252015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "BRIEF-Bloober Team's Brawl available on Nvidia Shield platform "
    },
    {
        "content": "SAN FRANCISCO Nvidia Corp  on Wednesday posted higher quarterly results that beat Wall Street expectations  sending its shares higher as the graphics chipmaker sought to sharpen its focus on high-end automobiles.",
        "date": "02112015",
        "name": "NVIDIA Corporation",
        "news_type": "topStory",
        "symbol": "NVDA",
        "title": "Nvidia's fiscal fourth-quarter results beat estimates  stock rises "
    },
    {
        "content": "SAN FRANCISCO  Feb 11 Nvidia Corp on Wednesday posted higher quarterly results that beat Wall Street expectations  sending its shares higher as the graphics chipmaker sought to sharpen its focus on high-end automobiles.",
        "date": "02112015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "UPDATE 2-Nvidia's fiscal 4th-quarter results beat estimates  stock rises "
    },
    {
        "content": "SAN FRANCISCO  Feb 11 Nvidia Corp on Wednesday posted higher fiscal fourth-quarter revenue that beat Wall Street's expectations as the graphics chipmaker increased its focus on high-end automobiles.",
        "date": "02112015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Nvidia's fiscal 4th-quarter revenue beats estimates "
    },
    {
        "content": "Jan 4 Chipmaker Nvidia on Sunday unveiled a new processor aimed at powering high-end graphics on car dashboards as well as sophisticated auto-pilot systems.",
        "date": "01052015",
        "name": "NVIDIA Corporation",
        "news_type": "normal",
        "symbol": "NVDA",
        "title": "Chipmaker Nvidia accelerates move into smarter automobiles "
    }
]