[
    {
        "content": "Nov 1 NOVO NORDISK A/S CEO LARS FRUERGAARD JORGENSEN MADE FOLLOWING COMMENTS ON AN ANALYST CALL:",
        "date": "11012017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk CEO says still looking for biopharma bolt-on acquisitions "
    },
    {
        "content": "COPENHAGEN Drugmaker Novo Nordisk forecast only muted growth in  2018 and warned that draft legislation in some U.S. states to make pricing more transparent could impact business in its largest market.",
        "date": "11012017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Drugmaker Novo Nordisk warns of U.S. legislation  cautious on 2018 "
    },
    {
        "content": "* Shares fall on cautious 2018 outlook (Writes through with CEO comments)",
        "date": "11012017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Drugmaker Novo Nordisk warns of U.S. legislation  cautious on 2018 "
    },
    {
        "content": "COPENHAGEN  Nov 1 Drugmaker Novo Nordisk said on Wednesday that new legislation being prepared in some U.S. states to improve pricing transparency could potentially impact business in its key market.",
        "date": "11012017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Drugmaker Novo Nordisk warns U.S. legislation could make business difficult "
    },
    {
        "content": "COPENHAGEN  Nov 1 Denmark's Novo Nordisk   the world's top maker of diabetes drugs  posted third-quarter operating profit slightly above forecasts on Wednesday  and said it expected low to mid single-digit sales and operating profit growth next year.",
        "date": "11012017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Diabetes drugmaker Novo Nordisk expects low to mid single-digit growth in 2018​ "
    },
    {
        "content": "* Q3 SALES ‍​26.6 BILLION DKK VERSUS 27.24 BILLION DKK SEEN IN REUTERS POLL",
        "date": "11012017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk Q3 EBIT DKK 12.04‍​ bln  slightly higher than expected "
    },
    {
        "content": "WASHINGTON/COPENHAGEN Denmark's Novo Nordisk will take aim at Eli Lilly in the growing diabetes market after an advisory panel to the U.S. Food and Drug Administration (FDA) gave the green light to its semaglutide drug.",
        "date": "10192017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk takes aim at Eli Lilly with U.S. backing of new diabetes drug "
    },
    {
        "content": "China's Q3 economic growth slows as expected  property measures bite",
        "date": "10192017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Reuters Business News Schedule at 0830 GMT/430AM ET "
    },
    {
        "content": "WASHINGTON  Oct 18 Novo Nordisk A/S's new diabetes drug semaglutide is effective  reasonably safe and should be approved  an advisory panel to the U.S. Food and Drug Administration concluded on Wednesday.",
        "date": "10182017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "U.S. FDA panel backs approval of Novo Nordisk diabetes drug "
    },
    {
        "content": "WASHINGTON/COPENHAGEN  Oct 19 Denmark's Novo Nordisk will take aim at Eli Lilly in the growing diabetes market after an advisory panel to the U.S. Food and Drug Administration (FDA) gave the green light to its semaglutide drug.",
        "date": "10192017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 3-Novo Nordisk takes aim at Eli Lilly with U.S. backing of new diabetes drug "
    },
    {
        "content": "Oct 19 NOVO NORDISK CHIEF SCIENTIFIC OFFICER MADS KROGSGAARD THOMSEN SAYS IN INTERVIEW:",
        "date": "10192017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk VP says seeks market share from Eli Lilly with semaglutide "
    },
    {
        "content": "Novo Nordisk A/S's closely watched diabetes drug semaglutide is effective  caused no heart risk  and carried only limited risk of sight problems  a preliminary review by the U.S. Food and Drug Administration concluded on Monday  sending the company's shares up 4 percent.",
        "date": "10162017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk diabetes drug works; no heart risk-FDA review "
    },
    {
        "content": "Oct 19 NOVO NORDISK CHIEF SCIENTIFIC OFFICER MADS KROGSGAARD THOMSEN SAID IN AN INTERVIEW:",
        "date": "10192017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk VP says road is paved for timely US FDA approval of semaglutide "
    },
    {
        "content": "Oct 16 Novo Nordisk A/S's closely watched diabetes drug semaglutide is effective  a preliminary review by the U.S. Food and Drug Administration concluded  sending the company's shares up 3.4 percent in premarket trading on Monday.",
        "date": "10162017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-Novo Nordisk diabetes drug effective  preliminary FDA review finds "
    },
    {
        "content": "The U.S. Food and Drug Administration on Friday approved Novo Nordisk's fast-acting insulin to treat diabetes.",
        "date": "09292017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "FDA approves Novo Nordisk fast-acting insulin Fiasp "
    },
    {
        "content": "Sept 29 The U.S. Food and Drug Administration on Friday approved Novo Nordisk's fast-acting insulin to treat diabetes.",
        "date": "09292017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "U.S. FDA approves Novo Nordisk fast-acting insulin Fiasp "
    },
    {
        "content": "* THE UNITED STATES' FOOD AND DRUG ADMINISTRATION (FDA) HAS APPROVED FIASP (FAST-ACTING INSULIN ASPART)  A NEW FAST-ACTING MEALTIME INSULIN  FOR TREATMENT OF ADULTS WITH DIABETES",
        "date": "09292017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk's fast-acting mealtime insulin Fiasp approved in the U.S. "
    },
    {
        "content": "* THE COMMITTEE FOR MEDICINAL PRODUCTS FOR HUMAN USE UNDER THE EUROPEAN MEDICINES AGENCY (EMA) HAS ENDORSED AN UPDATE OF THE EU LABEL WITH IMMEDIATE EFFECT FOR TRESIBA TO INCLUDE RESULTS FROM THE DEVOTE TRIAL ON SEVERE HYPOGLYCAEMIA",
        "date": "09292017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk gets positive opinion for label update in EU for Tresiba "
    },
    {
        "content": "* THE CHINA FOOD AND DRUG ADMINISTRATION (CFDA) HAS APPROVED NEW-GENERATION BASAL INSULIN TRESIBA (INSULIN DEGLUDEC) FOR THE TREATMENT OF DIABETES IN CHINA.",
        "date": "09272017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk's Tresiba approved in China "
    },
    {
        "content": "COPENHAGEN  Sept 12 Novo Nordisk said at the Annual Meeting of the European Association For The Study Of Diabetes:",
        "date": "09122017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk: once-weekly semaglutide reduces glucose  weight more than comparator treatments "
    },
    {
        "content": "* Consideration to Novo is 20 million shares & expenditure commitment of $2 million over 3 years",
        "date": "09192017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Calidus enters joint venture with Novo Resources "
    },
    {
        "content": "Sept 5 Novo Nordisk will pay $58.7 million to resolve claims that the drugmaker's sales staff downplayed the importance of a warning about cancer risks on its diabetes medication Victoza's label  the U.S. Justice Department said on Tuesday. (Reporting by Nate Raymond in Boston; Editing by Phil Berlowitz)",
        "date": "09052017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk settles U.S. probe over diabetes drug for $58.7 mln "
    },
    {
        "content": "* Health Canada approves Tresiba®  a new basal insulin for type 1 and 2 diabetes",
        "date": "08282017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Health Canada approves Novo Nordisk's Tresiba  a new basal insulin for type 1 and 2 diabetes "
    },
    {
        "content": "Novo Nordisk said on Friday the U.S. Food and Drug Administration (FDA) approved an expanded use of its diabetes drug to reduce the risk of cardiovascular events such as heart attack and stroke.",
        "date": "08252017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "FDA clears Novo Nordisk's diabetes drug to reduce cardiovascular risk "
    },
    {
        "content": "Aug 25 Novo Nordisk  said on Friday the U.S. Food and Drug Administration (FDA) approved an expanded use of its diabetes drug to reduce the risk of cardiovascular events such as heart attack and stroke.",
        "date": "08252017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-FDA clears Novo Nordisk's diabetes drug to reduce cardiovascular risk "
    },
    {
        "content": "Aug 25 Novo Nordisk  said on Friday the U.S. Food and Drug Administration (FDA) approved its diabetes drug as a treatment to reduce the risk of three major cardiovascular diseases.",
        "date": "08252017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "FDA clears Novo Nordisk's diabetes drug to treat heart diseases "
    },
    {
        "content": "Aug 16 Novo Nordisk A/S said on Wednesday its diabetes drug met the main goal of reducing glucose levels in patients in a key late-stage trial  setting the stage for it to become the new standard therapy for type 2 diabetes.",
        "date": "08162017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "UPDATE 1-Novo Nordisk's diabetes drug succeeds in key trial "
    },
    {
        "content": "* ‍Metacrine - entered collaboration with Novo Nordisk A/S to develop fibroblast growth factor 1 variants for glucose lowering and insulin sensitization​",
        "date": "08152017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-‍Metacrine enters collaboration with Novo Nordisk to develop FGF 1 variants for glucose lowering  insulin sensitization​ "
    },
    {
        "content": " (This version of the story corrects paragraph 8 to remove reference to absorption of insulin)",
        "date": "08172017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk's diabetes drug succeeds in key trial (Aug 16) "
    },
    {
        "content": "* Novo nordisk says semaglutide superior to dulaglutide on glucose control and weight loss in people with type 2 diabetes in sustain 7",
        "date": "08162017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk says Semaglutide superior to Dulaglutide in sustain 7 trial "
    },
    {
        "content": "Aug 16 Novo Nordisk A/S said on Wednesday its diabetes drug met the main goal of reducing glucose levels in patients in a key late-stage trial  setting the stage for it to become the new standard therapy for type 2 diabetes.",
        "date": "08172017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "CORRECTED-UPDATE 1-Novo Nordisk's diabetes drug succeeds in key trial (Aug 16) "
    },
    {
        "content": "Aug 16 Novo Nordisk A/S said on Wednesday its diabetes drug met the main goal of reducing glucose levels in patients in a key late-stage trial  setting the stage for it to become the new standard therapy for type 2 diabetes.",
        "date": "08172017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "CORRECTED-Novo Nordisk's diabetes drug succeeds in key trial (Aug 16) "
    },
    {
        "content": "* Shares jump more than 6 percent (Adds management comments  obesity drugs background  shares)",
        "date": "08092017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo Nordisk raises forecasts despite continued U.S. pressure "
    },
    {
        "content": "* Shares down 1.4 pct (Adds investor comment  company response; updates shares)",
        "date": "08082017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 3-CVS Health's dull Q3 forecast overshadows profit beat "
    },
    {
        "content": "* CEO SAYS NOVO NORDISK DO NOT INTEND TO PROVIDE EXPLICIT GUIDANCE ON PRICE IN THE FUTURE",
        "date": "08092017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk CEO says won't provide explicit guidance on price "
    },
    {
        "content": "OSLO  Aug 9 The following stocks may be affected by newspaper reports and other factors on Wednesday:",
        "date": "08092017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "NORDIC STOCKS - Factors to watch on August 9 "
    },
    {
        "content": "COPENHAGEN  Aug 9 Denmark's Novo Nordisk   the world's top maker of diabetes drugs  posted second-quarter operating profit above forecasts  but said prices in its key U.S. market after rebates would be lower next year.",
        "date": "08092017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk Q2 beats forecast; lifts outlook but sees lower U.S. prices in 2018 "
    },
    {
        "content": "COPENHAGEN  Aug 2 U.S. pharmacy benefit manager (PBM)  CVS Health  said late Tuesday it had kept Novo Nordisk's key drugs on its 2018 list  removing some uncertainty over the U.S. market for the world's top insulin maker.",
        "date": "08022017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Two biggest U.S. drug purchasers keep key Novo Nordisk drugs on 2018 list "
    },
    {
        "content": "* Novo Holdings A/S reports 12.03 percent stake in HTG Molecular Diagnostics Inc as on July 3  2017 - sec filing‍​",
        "date": "07202017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Holdings reports 12.03 pct stake in HTG Molecular Diagnostics as on July 3 "
    },
    {
        "content": "* REG-ISSUANCE BY INNATE PHARMA OF 3 343 748 ORDINARY SHARES TO NOVO NORDISK A/S IN CONSIDERATION FOR RIGHTS IN ANTI-C5AR",
        "date": "07132017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Innate Pharma issues 3 343 748 ordinary shares "
    },
    {
        "content": "A New Jersey federal judge has narrowed a lawsuit filed by Sanofi SA accusing Novo Nordisk of falsely claiming that Sanofi's insulin drugs would no longer be available to many U.S. patients so that it could promote its competing drug.",
        "date": "07112017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Sanofi lawsuit over Novo Nordisk diabetes drug marketing narrowed "
    },
    {
        "content": "Danish drugmaker Novo Nordisk  said on Wednesday it was initiating a recall of insulin cartridge holders used in some NovoPen Echo insulin pen devices distributed in the United States because the holders may crack or break if exposed to certain chemicals  including certain cleaning agents.",
        "date": "07052017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk recalls faulty cartridge holders in insulin pens "
    },
    {
        "content": "July 5 Danish drugmaker Novo Nordisk said on Wednesday it was initiating a recall of insulin cartridge holders used in some NovoPen Echo insulin pen devices distributed in the United States because the holders may crack or break if exposed to certain chemicals  including certain cleaning agents.",
        "date": "07052017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-Novo Nordisk recalls faulty cartridge holders in insulin pens "
    },
    {
        "content": "* Novo Nordisk recalls cartridge holders in certain NovoPen Echo insulin delivery devices due to potential health risks",
        "date": "07052017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk recalls cartridge holders in certain NovoPen Echo insulin delivery devices "
    },
    {
        "content": "July 5 Danish drugmaker Novo Nordisk warned on Wednesday that the insulin cartridge holder in some of its insulin pen devices might crack or break if exposed to certain chemicals  including some cleaning agents.",
        "date": "07052017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk warns of faulty insulin pens in Canada "
    },
    {
        "content": "COPENHAGEN Danish drugmaker Novo Nordisk said on Friday a phase 2 trial for its big hope in tackling obesity  an improved GLP-1 drug called semaglutide  showed a weight loss of up to 13.8 percent in people with severe conditions.",
        "date": "06232017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk says obesity drug helps up to 13.8 percent weight loss in phase 2 trial "
    },
    {
        "content": "COPENHAGEN  June 23 Danish drugmaker Novo Nordisk said on Friday a phase 2 trial for its big hope in tackling obesity  an improved GLP-1 drug called semaglutide  showed a weight loss of up to 13.8 percent in people with severe conditions.",
        "date": "06232017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk says obesity drug helps up to 13.8 pct weight loss in phase 2 trial "
    },
    {
        "content": "* Submits application in the EU for including data from the DEVOTE trial in the Tresiba label Source text for Eikon: Further company coverage: (Reporting by Stine Jacobsen)",
        "date": "06142017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "CORRECTED-BRIEF-Novo Nordisk submits EU application for Tresiba label update "
    },
    {
        "content": "COPENHAGEN  June 10 Danish diabetes drugmaker Novo Nordisk on Saturday presented its findings from the real-world study EU-TREAT at the American Diabetes Association's 77th Scientific Sessions.",
        "date": "06102017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk reveals results from real-world study of Tresiba drug "
    },
    {
        "content": "* tresiba showed no increased risk of major cardiovascular events and significant reduction in rates of severe hypoglycaemia compared to insulin glargine",
        "date": "06122017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk says Tresiba showed significant reduction in rates of severe hypoglycaemia compared to insulin glargine "
    },
    {
        "content": "* Says the European Commission has granted marketing authorisation for Refixia for treatment of adolescents and adults with haemophilia B",
        "date": "06062017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk gets EU approval for haemophilia drug "
    },
    {
        "content": "* Innate Pharma acquires anti-c5ar  a first-in-class clinical-stage antibody  from Novo Nordisk A/S",
        "date": "06022017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Innate Pharma acquires anti-c5ar from Novo Nordisk A/S "
    },
    {
        "content": "* Innate Pharma acquires anti-C5aR  a first-in-class clinical-stage antibody  from Novo Nordisk A/S",
        "date": "06022017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Innate Pharma acquires anti-C5aR from Novo Nordisk "
    },
    {
        "content": "COPENHAGEN  June 2 Novo Nordisk  the world's biggest maker of diabetes drugs  will focus on growing volumes rather than price in its key European market where it has lost ground to competitors in recent years  a senior executive said on Friday.",
        "date": "06022017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk looks to shore up European market share "
    },
    {
        "content": "* Novo Nordisk submits application in the US for including data from the DEVOTE trial in the Tresiba label",
        "date": "05292017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk submits U.S. application for Tresiba label update "
    },
    {
        "content": "COPENHAGEN  May 22 Danish drugmaker Novo Nordisk is looking to expand its obesity business in Latin America on the back of \"phenomenal\" performance by its new anti-obesity injection Saxenda  a senior company official said on Monday.",
        "date": "05222017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk looks to expand Latin American obesity business "
    },
    {
        "content": "May 16 Danish drugmaker Novo Nordisk said on Tuesday the chief executive of Canadian biotech company Novelion Therapeutics had left its board with immediate effect due to \"a potential conflict of interest\".",
        "date": "05162017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novelion CEO quits Novo Nordisk board due to NASH conflict "
    },
    {
        "content": "* Says Mary Szela steps down from Novo Nordisk's board of directors with immediate effect",
        "date": "05162017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk: Novelion CEO leaves board to avoid potential conflict of interest "
    },
    {
        "content": "LONDON Hit by pricing pressure in its core insulin business  Danish drugmaker Novo Nordisk is looking at new treatments for obesity - a major cause of diabetes - to help revive its growth.",
        "date": "05112017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk bets on new obesity drug recipes "
    },
    {
        "content": "* SAID ON THURSDAY ENTERED INTO A 6-YEAR-AGREEMENT WITH NOVO NORDISK  REPLACING AN EXISTING CORPORATE CORE IT INFRASTRUCTURE OUTSOURCING CONTRACT",
        "date": "05052017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk renews agreement with NNIT "
    },
    {
        "content": "* Launches Xultophy® 100/3.6 (insulin degludec and liraglutide injection) in United States Source text for Eikon: Further company coverage:",
        "date": "05032017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk launches Xultophy® 100/3.6 (insulin degludec and liraglutide injection) in U.S. "
    },
    {
        "content": "COPENHAGEN Shares in Novo Nordisk   the world's biggest maker of diabetes drugs  surged on Wednesday as the Danish firm beat operating profit forecasts for the first quarter and nudged up its full-year target.",
        "date": "05032017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Danish drugmaker Novo Nordisk nudges up forecasts after first-quarter result "
    },
    {
        "content": "* Novo's share price up 6 pct (Adds detail on peers  outlook for pricing pressure  analyst  updates share price)",
        "date": "05032017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Danish drugmaker Novo Nordisk nudges up forecasts after Q1 result "
    },
    {
        "content": "April 27 Danish drug maker Novo Nordisk A/S says:",
        "date": "04272017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk: FDA approves label update for obesity drug Saxenda "
    },
    {
        "content": "May 3 Danish drugmaker Novo Nordisk's chief executive Lars Fruergaard Jorgensen made following comments on a call for journalists  following the firm's first-quarter results:",
        "date": "05032017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk CEO sees lower U.S. political risk "
    },
    {
        "content": "COPENHAGEN  May 3 Denmark's Novo Nordisk   the world's biggest diabetes drug maker  reported forecast-beating operating profit for the first quarter and nudged up its 2017 operating profit growth outlook.",
        "date": "05032017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Drugmaker Novo Nordisk beats Q1 operating profit forecast  nudges up FY outlook range "
    },
    {
        "content": "* Increased reported operating profit by 10 percent in the first three months of 2017",
        "date": "05032017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Drugmaker Novo Nordisk Q1 profit beats forecast  nudges up 2017 outlook "
    },
    {
        "content": "* Xoma -on april 20  2017 co received notice from Novo Nordisk a/s  relating to termination of exclusive license agreement with co due to strategic and business reasons",
        "date": "04212017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Xoma receieves notice to terminate license agreement from Novo Nordisk "
    },
    {
        "content": "* Says once-weekly semaglutide demonstrated consistent bloodglucose reductions and weight loss regardless of background oral antidiabetic treatment",
        "date": "04032017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo's once-weekly semaglutide shows consistent bloodglucose reductions "
    },
    {
        "content": "* Says has resubmitted the new drug application (NDA) for fast-acting insulin aspart as a class II re-submission to the United States Food and Drug Administration (FDA)",
        "date": "03292017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk resubmits new drug application for fast-acting insulin aspart in the U.S "
    },
    {
        "content": "* Says Fiasp  a new  fast-acting mealtime insulin for the treatmentof diabetes in adults  has been launched in Canada on Monday  Further company coverage:   (Reporting by Stine Jacobsen)",
        "date": "03272017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk launches Fiasp-drug in Canada "
    },
    {
        "content": "March 23 The CEO of Novo Nordisk's  the world's biggest diabetes company  made the following comments at the firm's annual general meeting on Thursday:",
        "date": "03232017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Denmark's Novo Nordisk will not turn into big M&A machine-CEO "
    },
    {
        "content": "A panel of the European Medicines Agency said it recommended granting marketing approval to Danish drugmaker Novo Nordisk's hemophilia B drug.",
        "date": "03242017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "EMA panel backs Novo Nordisk's hemophilia B drug "
    },
    {
        "content": "* Says will in cooperation with Bigadan build a large-scale biogas plant",
        "date": "03232017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Dong Energy to build biogas plant for Novo Nordisk  Novozymes residues "
    },
    {
        "content": "March 24 A panel of the European Medicines Agency said it recommended granting marketing approval to Danish drugmaker Novo Nordisk's haemophilia B drug.",
        "date": "03242017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-EMA panel backs Novo Nordisk's haemophilia B drug "
    },
    {
        "content": "March 24 A panel of the European Medicines Agency said it recommended granting marketing approval to Danish drugmaker Novo Nordisk's haemophilia B drug.",
        "date": "03242017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "EMA panel backs Novo Nordisk's haemophilia B drug "
    },
    {
        "content": "* Recommends approval of Novo Nordisk's Nonacog Beta Pegol drug for treatment of haemophilia",
        "date": "03242017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-EU recommends approval of Novo Nordisk's haemophilia drug "
    },
    {
        "content": "* The Committee for Medicinal Products for Human Use (CHMP)  under the European Medicines Agency (EMA)  has issued a positive opinion  recommending an update of the label for Tresiba (insulin degludec) to include data from the SWITCH 1 and 2 clinical trials",
        "date": "03242017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk gets positive opinion for label update in EU for Tresiba "
    },
    {
        "content": "* CVS Health Corp says will launch reduced RX  a prescription savings program that will offer discounts on certain medications",
        "date": "03162017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-CVS Health to launch reduced RX "
    },
    {
        "content": "Novo Nordisk's  new chief executive is looking at making acquisitions to broaden the Danish drugmaker's product line-up  in a change of tack that reflects a need for fresh sources of growth at the world's biggest diabetes company.",
        "date": "03092017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk's new CEO turns to deals to help revive growth "
    },
    {
        "content": "Danish drugmaker Novo Nordisk A/S  has approached Global Blood Therapeutics Inc   a U.S. biotechnology company focused on serious blood disorders  to discuss a potential acquisition  people familiar with the matter said.",
        "date": "03082017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Exclusive: Novo Nordisk in bid for Global Blood Therapeutics - sources "
    },
    {
        "content": "COPENHAGEN  March 1 Novo Nordisk  the world's largest insulin maker  said on Wednesday the head of its North American operations Jakob Riis has resigned  casting doubt over its strategy on a market that accounts for about half its sales.",
        "date": "03012017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk replaces head of North American operations "
    },
    {
        "content": "* Novo Nordisk on Tuesday announced the submission of a New Drug Application (NDA) to the Japanese Ministry of Health  Labour and Welfare for semaglutide  a new glucagon-like peptide-1 (GLP-1) analogue administrated once-weekly  for the treatment of adults with type 2 diabetes  Source text for Eikon: Further company coverage:   (Reporting by Jacob Gronholt-Pedersen)",
        "date": "02282017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk files for regulatory approval of once-weekly semaglutide in Japan "
    },
    {
        "content": "* Disappointed to have missed out on top job at Novo   (Recasts with comments from Riis)",
        "date": "03012017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo Nordisk North American head quits for top job at Falck "
    },
    {
        "content": "* Outgoing Novo Nordisk North America head Riis said he taking the role of Chief Executive of Danish emergency services group Falck",
        "date": "03012017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "REFILE-BRIEF-Riis says to head Falck after leaving Novo Nordisk "
    },
    {
        "content": "* Says the board of directors proposes election of Kasim Kutay and Helge Lund as new members of the board of directors at the annual general meeting",
        "date": "02242017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk proposes Novo A/S CEO and former BG chief as board members "
    },
    {
        "content": "COPENHAGEN Novo Nordisk  shares took another hit on Thursday as the world's top maker of diabetes drugs disappointed investors with a lower 2017 sales and profit growth forecast due to price pressure and U.S. political uncertainty.",
        "date": "02022017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Drugmaker Novo Nordisk cautious over unpredictable U.S. politics "
    },
    {
        "content": "COPENHAGEN  Feb 2 Novo Nordisk shares took another hit on Thursday as the world's top maker of diabetes drugs disappointed investors with a lower 2017 sales and profit growth forecast due to price pressure and U.S. political uncertainty.",
        "date": "02022017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Drugmaker Novo Nordisk cautious over unpredictable U.S. politics "
    },
    {
        "content": "LONDON  Feb 2 European shares fell on Thursday after disappointing company updates  with Denmark's Novo Nordisk  leading the market down and Finnish retailer Kesko  weakening on lower-than-expected sales.",
        "date": "02022017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "European shares edge lower on disappointing company updates "
    },
    {
        "content": "Feb 2 Drugmaker Novo Nordisk CEO Lars Fruergaard Jorgensen made the following comments during a call with journalists:",
        "date": "02022017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk CEO: We are not concerned about Trump "
    },
    {
        "content": "COPENHAGEN  Feb 2 Denmark's Novo Nordisk   the world's top maker of diabetes drugs  said fourth-quarter operating profit came in a touch below forecasts and lowered its 2017 operating profit and sales growth outlook measured in local currency terms.",
        "date": "02022017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Drugmaker Novo Nordisk lowers 2017 sales  profit outlook "
    },
    {
        "content": "* Says 2017 sales growth is expected to be in the range of a decline of 1 percent to a growth of 4 percent measured in local currencies",
        "date": "02022017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk cuts 2017 sales  profit outlook in local currencies "
    },
    {
        "content": "LONDON  Jan 31 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "01312017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Stock futures signal slightly higher market open. For more see the European equities LiveMarkets blog "
    },
    {
        "content": "NEW YORK  Jan 30 Three of the biggest makers of diabetes treatments  Sanofi SA  Novo Nordisk  and Eli Lilly & Co  were named in a class action lawsuit about price fixing filed by a group of patients.",
        "date": "01302017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Sanofi  Novo Nordisk and Lilly named in patients' price fixing suit "
    },
    {
        "content": "* Says enters collaboration with University of Oxford on type 2 diabetes and invests 115 million pounds ($144.52 million)in new research centre",
        "date": "01302017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk to invest $144 mln in University of Oxford research centre "
    },
    {
        "content": "LONDON  Jan 30 Novo Nordisk  the world's top maker of diabetes drugs  is investing 115 million pounds ($145 million) in a new research centre in Britain  undeterred by Brexit.",
        "date": "01302017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Drugmaker Novo Nordisk bets $145 mln on post-Brexit UK science "
    },
    {
        "content": "COPENHAGEN Danish drugmaker Novo Nordisk's  shares fell more than 5 percent on Thursday following the filing of a lawsuit against the company in the United States and also in response to U.S. President-elect Donald Trump's criticism of drug prices.",
        "date": "01122017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk shares hit by U.S. lawsuit  Trump comments "
    },
    {
        "content": "* Novo shares down 5.4 pct while Europe drug stocks down 2 pct   (Adds comments from Novo Nordisk  Trump and analyst  details)",
        "date": "01122017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-Novo Nordisk shares hit by US lawsuit  Trump comments "
    },
    {
        "content": "* The European Commission has granted marketing authorisation for Fiasp (fast-acting insulin aspart) for treatment of diabetes in adults",
        "date": "01102017",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk's Fiasp approved in Europe "
    },
    {
        "content": "COPENHAGEN  Jan 12 A U.S. law firm has filed a securities class action lawsuit on behalf of Lehigh County Employees' Retirement System against Danish drugmaker Novo Nordisk.",
        "date": "01122017",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "U.S. law firm files class action suit against Novo Nordisk "
    },
    {
        "content": "France's Sanofi has filed a lawsuit in the United States accusing Novo Nordisk of falsely claiming that Sanofi insulin drugs would no longer be available for many U.S. patients so it could promote its competing drug.",
        "date": "12272016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Sanofi sues Novo Nordisk over diabetes drugs in the U.S. "
    },
    {
        "content": "OSLO Danish Novo Nordisk said on Monday it has filed for the European Union and the U.S. approval of semaglutide to treat adults with type 2 diabetes.",
        "date": "12052016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk seeks EU and U.S. approval for new diabetes treatment "
    },
    {
        "content": "COPENHAGEN Novo Nordisk's long-acting insulin blockbuster Tresiba has a safe cardiovascular profile and reduces episodes of severely low blood glucose levels in patients with type 2 diabetes  the Denmark-based company said on Tuesday.",
        "date": "11292016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk reports Tresiba insulin achieves target in study "
    },
    {
        "content": "COPENHAGEN  Nov 29 Novo Nordisk's  long-acting insulin blockbuster Tresiba has a safe cardiovascular profile and reduces episodes of severely low blood glucose levels in patients with type 2 diabetes  the Denmark-based company said on Tuesday.",
        "date": "11292016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-Novo Nordisk reports Tresiba insulin achieves target in study "
    },
    {
        "content": "COPENHAGEN  Nov 29 Novo Nordisk's  long-acting insulin blockbuster Tresiba has a safe cardiovascular profile in patients with type 2 diabetes  results released by the company on Tuesday showed.",
        "date": "11292016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk says Tresiba insulin achieves target in DEVOTE study "
    },
    {
        "content": "COPENHAGEN  Nov 29 Danish telecoms group TDC  has lost a major contract in Denmark after one of the country's biggest employers  Novo Nordisk  said it chose Norway's Telenor as its telecoms supplier.",
        "date": "11292016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-TDC loses major contract with Novo Nordisk to Telenor "
    },
    {
        "content": "Rivals Novo Nordisk and Sanofi have won U.S. approval for new combination drugs to treat diabetes  sparking a fresh battle for sales in a fiercely competitive market.",
        "date": "11222016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo  Sanofi go head to head as FDA clears new diabetes drugs "
    },
    {
        "content": "COPENHAGEN  Nov 29 Danish telecoms group TDC  has lost a major contract in Denmark after one of the country's biggest employers  Novo Nordisk  said it chose Norway's Telenor as its telecoms supplier.",
        "date": "11292016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "TDC loses major contract with Novo Nordisk to Telenor "
    },
    {
        "content": "* Companies to sell two-drug products at discount   (Adds detail on pricing  quote from Novo Nordisk executive)",
        "date": "11222016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo  Sanofi go head to head as FDA clears new diabetes drugs "
    },
    {
        "content": "* Says it will begin negotiations with buyers of its combination diabetes drug Xultophy in the United States by offering a 20 percent discount to the combined price of Tresiba and Victoza.",
        "date": "11222016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk to offer discount on Xultophy in U.S. "
    },
    {
        "content": "LONDON  Nov 16 Commercial rather than technical hurdles ultimately torpedoed Novo Nordisk's bid to make an oral form of insulin  its chief executive said on Wednesday  underscoring the impact of U.S. price pressure on the world's top insulin supplier.",
        "date": "11162016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "How drug price pressure helped sink Novo's insulin pill "
    },
    {
        "content": "* Says receives positive opinion from the European regulatory authorities  Committee for Medicinal Products for Human Use (CHMP)  for Fiasp (fast-acting insulin aspart) for the treatment of adults with type 1 and type 2 diabetes",
        "date": "11112016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk receives positive opinion for Fiasp-drug in EU "
    },
    {
        "content": "* Says Novo Nordisk submits application to the European Medicines Agency (EMA) for including data from the two SWITCH trials in the Tresiba label",
        "date": "11102016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk applies for label update in EU for Tresiba-drug "
    },
    {
        "content": "* Says Tresiba demonstrated lower day-to-day and within-day variability in glucose-lowering effect compared with insulin glargine u300",
        "date": "11122016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo's Tresiba shows lower variability in glucose-lowering effect in study "
    },
    {
        "content": "COPENHAGEN Danish diabetes drug maker Novo Nordisk on Friday defended its pricing of diabetes drugs after facing allegations of pricing collusion by U.S. senators.",
        "date": "11042016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk defends U.S. diabetes drug pricing "
    },
    {
        "content": "NOVO NORDISK SHARES DOWN 3.1 PCT ",
        "date": "11042016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "NOVO NORDISK SHARES DOWN 3.1 PCT "
    },
    {
        "content": "COPENHAGEN Top insulin maker Novo Nordisk  slashed its long-term profit growth forecast on Friday  signaling no let-up in its struggles to crack the U.S. market to which its chief executive said its commitment would not waver.",
        "date": "10282016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk slashes long-term growth view on U.S. market woes "
    },
    {
        "content": "* Novo Nordisk shares fall up to 19 percent   (Adds CEO comments)",
        "date": "10282016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 4-Novo Nordisk slashes long-term growth view on U.S. market woes "
    },
    {
        "content": "COPENHAGEN Novo Nordisk  remains committed come what may to the U.S. insulin market  where price pressure are likely to continue into 2019  Chief Executive Lars Rebien Sorensen said on Friday.",
        "date": "10282016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk will stay in U.S. insulin market 'whatever it costs': CEO "
    },
    {
        "content": "COPENHAGEN  Oct 28 Novo Nordisk  remains committed come what may to the U.S. insulin market  where price pressure are likely to continue into 2019  Chief Executive Lars Rebien Sorensen said on Friday.",
        "date": "10282016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk will stay in U.S. insulin market \"whatever it costs\" - CEO "
    },
    {
        "content": "LONDON  Oct 28 European equities fell to their lowest in more than a week on Friday  with companies such as insulin maker Novo Nordisk and digital security firm Gemalto slumping more than 10 percent after their quarterly results.",
        "date": "10282016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "European shares slip as earnings disappointments bite  Novo slides "
    },
    {
        "content": "* Says Novo Nordisk received complete response letter from U.S. Food and Drug Administration (FDA) regarding New Drug Application for faster-acting insulin aspart.",
        "date": "10082016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk says U.S. FDA requests more information on faster-acting insulin aspart "
    },
    {
        "content": "Oct 6 Novo A/S  holding company for the Novo Group",
        "date": "10062016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk holding company Novo A/S appoints new CFO "
    },
    {
        "content": "COPENHAGEN The world's largest insulin maker  Novo Nordisk  is cutting 1 000 jobs as a part of a plan to reduce costs as it faces a challenging environment in 2017  especially in the large U.S. market  the company said on Thursday.",
        "date": "09292016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk to ax 1 000 jobs in cost-cutting drive "
    },
    {
        "content": "COPENHAGEN  Sept 29 The world's largest insulin maker  Novo Nordisk  is to cut 1 000 jobs as a part of a plan to reduce costs as it faces a challenging competitive environment in 2017  especially in the large U.S. market  the company said on Thursday.",
        "date": "09292016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk to axe 1 000 jobs in cost-cutting drive "
    },
    {
        "content": "* Staff to go from R&D  headquarters  commercial operations   (Adds analyst reaction  background)",
        "date": "09292016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-Novo Nordisk to axe 1 000 jobs in cost-cutting drive "
    },
    {
        "content": "* Says has submitted a supplemental application to the US Food and Drug Administration (FDA) for including results from its two SWITCH trials in insulin drug Tresiba's label",
        "date": "09232016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo submits label application in the US for insulin drug Tresiba "
    },
    {
        "content": "NEW YORK  Sept 21 Danish drugmaker Novo Nordisk A/S on Wednesday pledged to provide insulin at steeply discounted prices in the world's least-developed nations in what it is calling its \"access to insulin commitment.\"",
        "date": "09212016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk to supply insulin at discount to poorest nations "
    },
    {
        "content": "NEW YORK  Sept 21 Danish drugmaker Novo Nordisk A/S pledged on Wednesday to provide insulin at steeply discounted prices in the world's least-developed nations in what it is calling its \"access to insulin commitment.\"",
        "date": "09212016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-Novo Nordisk to supply insulin at discount to poorest nations "
    },
    {
        "content": "COPENHAGEN Novo Nordisk's experimental injectable diabetes drug semaglutide reduced cardiovascular risk by 26 percent  according to results released on Friday  paving the way for a new and bigger study on the drug's benefits.",
        "date": "09162016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo plans larger study after encouraging semaglutide results "
    },
    {
        "content": "COPENHAGEN  Sept 16 Novo Nordisk's  experimental injectable diabetes drug semaglutide reduced cardiovascular risk by 26 percent  according to results released on Friday  paving the way for a new and bigger study on the drug's benefits.",
        "date": "09162016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo plans larger study after encouraging semaglutide results "
    },
    {
        "content": "COPENHAGEN  Sept 16 Novo Nordisk's  experimental injectable diabetes drug semaglutide reduced cardiovascular risk by 26 percent in a keenly awaited clinical  according to results released on Friday.",
        "date": "09162016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk says diabetes drug semaglutide cuts heart risk by 26 percent "
    },
    {
        "content": "LONDON  Sept 9 European stock markets fell on Friday  weighed down by a drop in the shares of healthcare companies  while the latest nuclear test conducted by North Korea also rattled markets.",
        "date": "09092016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "European shares slip as healthcare stocks lose ground "
    },
    {
        "content": "COPENHAGEN Novo Nordisk's long-serving chief executive Lars Rebien Sorensen is to step down early  it was announced on Thursday  at a time when the world's largest insulin maker has said it faces increased competition in the U.S. market where it generates about half its revenues.",
        "date": "09012016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk's veteran CEO Lars Rebien Sorensen to step down "
    },
    {
        "content": "* Move is acknowledgement of serious U.S. challenges - analyst   (Adds comments by CEO  chairman)",
        "date": "09012016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 3-Novo Nordisk's veteran CEO Lars Rebien Sorensen to step down "
    },
    {
        "content": "Sept 1 Chief Executive Lars Rebien Sorensen  Novo Nordisk A/S :",
        "date": "09012016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk CEO questions if company has the right R&D strategy "
    },
    {
        "content": "COPENHAGEN  Sept 1 Danish insulin maker Novo Nordisk's Chief Executive Lars Rebien Sorensen will step down by the end of 2016 after 16 years in the position  it said on Thursday.",
        "date": "09012016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "RPT-Novo Nordisk CEO Lars Rebien Sorensen to step down by end 2016 "
    },
    {
        "content": "COPENHAGEN  Sept 1 Danish insulin maker Novo Nordisk's Chief Executive Lars Rebien Sorensen will step down by the end of 2016 after 16 years in the position  it said on Thursday.",
        "date": "09012016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk CEO Lars Rebien Sorensen to step down by end 2016 "
    },
    {
        "content": "July 26 Eli Lilly and Co on Tuesday reported better-than-expected quarterly sales  fueled by newer drugs  and predicted average annual revenue growth of at least 5 percent through the end of the decade due to its growing roster of medicines.",
        "date": "07262016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 3-Lilly sales beat estimates  helped by newer drugs "
    },
    {
        "content": "COPENHAGEN Novo Nordisk  shares fell 8 percent on Friday after the Danish drugmaker cut its forecast for full-year profit growth and said it expected tough competition in the United States to pressure prices next year.",
        "date": "08052016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk shares fall as cuts forecasts on tough U.S. market "
    },
    {
        "content": "* Outlook disappoints  shares fall 8 percent   (Adds further analyst comment on new products and pricing)",
        "date": "08052016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 3-Novo Nordisk shares fall as cuts forecasts on tough U.S market "
    },
    {
        "content": "* Caverion delivers a project for Novo Nordisk's new insulin production facility in Hillerød  Denmark",
        "date": "08052016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Caverion delivers project for Novo Nordisk's new insulin production facility "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Friday:",
        "date": "08052016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "NORDIC STOCKS - Factors to watch on Aug 5 "
    },
    {
        "content": "COPENHAGEN  Aug 5 Denmark's Novo Nordisk  narrowed its full-year profit growth guidance towards the lower end of a previously indicated target range  and said it sees intensified competition in the United States.",
        "date": "08052016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk trims 2016 guidance  sees tough U.S. competition "
    },
    {
        "content": "* Danish pharmaceutical company Novo Nordisk is investing 400 million Danish crowns ($59.70 million) in a 500 square meter extension of the world's largest insulin production plant in Kalundborg  it said on Monday.",
        "date": "07042016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk invests $60 mln to expand insulin plant in Kalundborg "
    },
    {
        "content": "* Collaborates with Novo Nordisk to provide new solutions in insulin pump therapy  Source text: http://bit.ly/293IVRQ Further company coverage:    (Gdynia Newsroom)",
        "date": "06282016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Ypsomed Holding collaborates with Novo Nordisk "
    },
    {
        "content": "* Says appoints Kasim Kutay as new CEO from September 1  2016",
        "date": "06212016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo A/S  main owner of Novo Nordisk  appoints Kasim Kutay as new CEO "
    },
    {
        "content": "Novo Nordisk's  top-selling diabetes drug Victoza cut the risk of heart attack  stroke and cardiovascular death by 13 percent in a closely watched study  but the result disappointed investors who had hoped for more.",
        "date": "06142016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo diabetes drug cuts heart risks by less-than-hoped 13 percentage "
    },
    {
        "content": "* Says semaglutide demonstrated superior improvements in glycaemic control vs rivals sitagliptin and exenatide ER in two clinical trials in adults with type 2 diabetes",
        "date": "06122016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk reports positive results from semaglutide trial "
    },
    {
        "content": "* Investors had hoped for bigger benefit  shares off 5 pct   (Adds further reaction  latest shares)",
        "date": "06142016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo diabetes drug cuts heart risks by less-than-hoped 13 pct "
    },
    {
        "content": "May 24 A U.S. advisory panel on Tuesday recommended approval of a new diabetes drug made by Novo Nordisk A/S that combines two of its existing treatments in a fixed-dose combination designed to be both effective and convenient.",
        "date": "05242016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "UPDATE 2-U.S. FDA panel recommends approval of Novo Nordisk diabetes drug "
    },
    {
        "content": "A preliminary review by the U.S. Food and Drug Administration questioned the usefulness of a combination diabetes drug made by Sanofi SA's and said it was unclear whether one component  lixisenatide  contributed to its benefit.",
        "date": "05232016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "FDA staff question usefulness of Sanofi diabetes drugs "
    },
    {
        "content": "May 23 A preliminary review by the U.S. Food and Drug Administration questioned the usefulness of a combination diabetes drug made by Sanofi SA's and said it was unclear whether one component  lixisenatide  contributed to its benefit.",
        "date": "05232016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-FDA staff question usefulness of Sanofi diabetes drugs "
    },
    {
        "content": "One day after recommending approval of a new diabetes drug made by Novo Nordisk A/S  a U.S. advisory panel on Wednesday recommended approval of a similar product made by Sanofi SA.",
        "date": "05252016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "U.S. panel backs approval of Sanofi combination diabetes drug "
    },
    {
        "content": "May 25 One day after recommending approval of a new diabetes drug made by Novo Nordisk A/S  a U.S. advisory panel on Wednesday recommended approval of a similar product made by Sanofi SA.",
        "date": "05252016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-U.S. panel backs approval of Sanofi combination diabetes drug "
    },
    {
        "content": "LONDON  May 25 European shares climbed to a new four-week high on Wednesday  with Novo Nordisk  leading the market higher after a U.S. advisory panel recommended approval of its new diabetes drug  while higher copper prices lifted miners.",
        "date": "05252016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "European shares hit new 4-week high  Novo Nordisk leads "
    },
    {
        "content": "A U.S. advisory panel on Tuesday recommended approval of a new diabetes drug made by Novo Nordisk A/S that combines two of its existing treatments in a fixed-dose combination designed to be both effective and convenient.",
        "date": "05252016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "FDA panel recommends approval of Novo Nordisk diabetes drug "
    },
    {
        "content": "* Announced the submission to the US Food and Drug Administration (FDA) of the Biologics License Application for the approval of long-acting factor IX  nonacog beta pegol.",
        "date": "05162016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk files for US approval of Haemophilia B treatment "
    },
    {
        "content": "A preliminary review by the U.S. Food and Drug Administration of Novo Nordisk A/S's experimental diabetes drug  IDegLira  questioned the interpretability of the study findings and practical use of the treatment  according to a review posted on the agency's website on Friday.",
        "date": "05202016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "FDA staff question utility  trials of Novo Nordisk diabetes drug "
    },
    {
        "content": "May 24 A U.S. advisory panel on Tuesday recommended approval of a new diabetes drug made by Novo Nordisk A/S that combines two of its existing treatments in a fixed-dose combination designed to be both effective and convenient.",
        "date": "05252016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "RPT-UPDATE 2-U.S. FDA panel recommends approval of Novo Nordisk diabetes drug "
    },
    {
        "content": "May 20 A preliminary review by the U.S. Food and Drug Administration of Novo Nordisk A/S's experimental diabetes drug  IDegLira  questioned the interpretability of the study findings and practical use of the treatment  according to a review posted on the agency's website on Friday.",
        "date": "05202016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-FDA staff question utility  trials of Novo Nordisk diabetes drug "
    },
    {
        "content": "* Says the United States Food and Drug Administration (FDA) has published the briefing documents ahead of the 24 May 2016 Advisory Committee meeting to discuss the New Drug Application (NDA) for IDegLira   Source text for Eikon:  Further company coverage:    (Copenhagen newsroom)",
        "date": "05202016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo says FDA posts briefing materials on ideglira diabetes drug "
    },
    {
        "content": " (This April 28 story corrects the fifth paragraph to say that two  not one  other diabetes drugs have positive cardiovascular side-effects)",
        "date": "04292016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Diabetes drug test results boost Novo Nordisk "
    },
    {
        "content": "April 29 Denmark's Novo Nordisk  posted slightly stronger-than-expected first-quarter operating profit but trimmed its 2016 guidance due to lower currency exchange rates.",
        "date": "04292016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk trims 2016 guidance on lower currency exchange rates "
    },
    {
        "content": "* Says semaglutide significantly reduces the risk of major adverse cardiovascular events in Sustain 6 trial",
        "date": "04282016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk announces positive results from semaglutide trial "
    },
    {
        "content": "March 29 - The following stocks may be affected by newspaper reports and other factors on Tuesday:",
        "date": "03292016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "NORDIC STOCKS-Factors to watch on March 29 "
    },
    {
        "content": "LONDON  March 1 Novo Nordisk and AstraZeneca  two drugmakers whose financial outlooks disappointed investors last month  are both hoping for a boost in the coming weeks from results of two closely watched clinical trials.",
        "date": "03012016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk and AstraZeneca seek tonic from key drug trials "
    },
    {
        "content": "COPENHAGEN  Feb 12 Novo A/S  the parent company behind the world's largest insulin maker Novo Nordisk  said on Friday Chief Executive Eivind Kolding will step down at the end of the month.",
        "date": "02122016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "CEO of Novo Nordisk's biggest shareholder steps down "
    },
    {
        "content": "* Novo Nordisk A/S: proposed changes in composition of the board of directors of Novo Nordisk",
        "date": "02122016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk says Kolding to not seek re-election for board "
    },
    {
        "content": "COPENHAGEN  Jan 28 Denmark's Novo Nordisk  is expected to announce a 44 pct rise in annual operating profits in its earnings report on Wednesday  as investors await crucial drug test results.",
        "date": "01282016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo's operating profits expected to jump  key drugs data ahead "
    },
    {
        "content": "COPENHAGEN  Feb 3 Novo Nordisk on Wednesday lowered its target for long-term profit growth after a slightly weaker than expected fourth quarter.",
        "date": "02032016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "EXECUTIVE VIEW -Novo optimistic about uptake of Tresiba in the U.S "
    },
    {
        "content": "* Long-acting Tresiba U-200 now available for adults living with diabetes",
        "date": "01262016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk launches Tresiba in the United States "
    },
    {
        "content": "COPENHAGEN Danish drugs firm Novo Nordisk  cut its long-term profit growth target on Wednesday  surprising overseas investors who sold the stock  sending it 4 percent lower.",
        "date": "02032016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Drugmaker Novo surprises with long-term profit target cut "
    },
    {
        "content": "* Novo cuts long-term EBIT growth target to 10 pct from 15 pct",
        "date": "02032016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Drugmaker Novo surprises with long-term profit target cut "
    },
    {
        "content": "COPENHAGEN  Feb 3 Novo Nordisk  specified its 2016 guidance and lowered its target for long-term profit growth after a slightly weaker than expected fourth quarter.",
        "date": "02032016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk's Q4 EBIT misses slightly  lowers long-term growth target "
    },
    {
        "content": "DAVOS/LONDON  Jan 21 Danish drugmaker Novo Nordisk  the world's top insulin supplier  expects to be ahead of the pack now nuclear sanctions are lifted in Iran  thanks to a continuous presence and a pre-emptive investment plan.",
        "date": "01212016",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo aims to be ahead of pharma pack with Iran investment "
    },
    {
        "content": "* Says files for regulatory approval of long acting factor IX  nonacog beta pegol  in the EU for the treatment of haemophilia B",
        "date": "01072016",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk files for EU approval of haemophilia B treatment "
    },
    {
        "content": "COPENHAGEN  Dec 4 Danish insulin maker Novo Nordisk has filed for regulatory approval of faster-acting insulin drug aspart in the EU to the European authorities  the company said on Friday.",
        "date": "12042015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk files for EU approval of faster-acting diabetes drug "
    },
    {
        "content": "* Says new findings from a network meta-analysis show that treatment with Victoza provides a greater HbA1c reduction and an improved likelihood of reaching glycaemic goals compared to SGLT-2 inhibitors",
        "date": "12012015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk presents new Victoza  Ryzodeg results "
    },
    {
        "content": "* Announces nanobody drug discovery collaboration with Novo Nordisk A/S",
        "date": "11252015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Ablynx announces nanobody drug discovery collaboration with Novo Nordisk "
    },
    {
        "content": "* Says data showed Saxenda treatment in combination with a reduced-calorie diet and increased physical activity demonstrated significant and sustained weight loss over three years compared with placebo",
        "date": "11042015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk says positive results in 3a Saxenda SCALE study "
    },
    {
        "content": "LONDON Novo Nordisk is considering options ahead of key heart safety data for its diabetes drug Victoza and could run a further clinical study if necessary  the Danish company's research head said on Wednesday.",
        "date": "11042015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo weighs options before crucial Victoza heart study data "
    },
    {
        "content": "* Novo Nordisk invests DKK 2.1 billion in new insulin filling facility in Denmark  creating 450 new jobs",
        "date": "11042015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk says to invest 2.1 bln in Danish insulin facility "
    },
    {
        "content": "* Novo expects sales and operating profit to grow 5-9 pct in 2016",
        "date": "10292015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo's 2016 outlook disappoints as Sanofi stokes diabetes fears "
    },
    {
        "content": "COPENHAGEN  Oct 29 Denmark's Novo Nordisk  said on Thursday it saw mid to high single-digit percent growth in operating profit in local currencies next year  outlining its preliminary forecasts for 2016.",
        "date": "10292015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk sees 2016 mid to high single-digit percent EBIT growth "
    },
    {
        "content": "LONDON  Oct 20 AstraZeneca opened a new $224 million drug manufacturing and packaging factory in Russia on Tuesday in a move Chief Executive Pascal Soriot said reinforced its long-term commitment to the country.",
        "date": "10202015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "AstraZeneca opens new $224 mln drug factory in Russia "
    },
    {
        "content": "COPENHAGEN Shares in Novo Nordisk  rose as much as 5 percent on Monday after the U.S. Food and Drug Administration (FDA) approved the diabetes drug Tresiba  allowing the Danish drugmaker to prepare its largest ever drug launch.",
        "date": "09282015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo shares jump ahead of its largest ever drug launch "
    },
    {
        "content": "The U.S. Food and Drug Administration on Friday approved Danish drugmaker Novo Nordisk's diabetes drug Tresiba  two years after rejecting the long-acting form of insulin.",
        "date": "09252015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "FDA approves Novo Nordisk's long-awaited diabetes drug "
    },
    {
        "content": "Sept 25 The U.S. Food and Drug Administration on Friday approved Danish drugmaker Novo Nordisk's  diabetes drug Tresiba  two years after rejecting the long-acting form of insulin.",
        "date": "09252015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 3-FDA approves Novo Nordisk's long-awaited diabetes drug "
    },
    {
        "content": "COPENHAGEN Danish drug maker Novo Nordisk will invest 70 million euros ($78 million) to build a manufacturing plant in Iran  joining a small group of European companies to announce concrete deals there since the Islamic Republic reached a nuclear deal in July.",
        "date": "09222015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Drug maker Novo Nordisk to build $78 million plant in Iran "
    },
    {
        "content": "COPENHAGEN  Sept 25 Danish pharmaceutical company Novo Nordisk has successfully completed the second phase 3a trial with its diabetes drug semaglutide  it said on Friday.",
        "date": "09252015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk successfully completes diabetes drug phase 3a trial "
    },
    {
        "content": "COPENHAGEN  Sept 22 Danish drug maker Novo Nordisk will invest 70 million euros ($78 million) to build a manufacturing plant in Iran  joining a small group of European companies to announce concrete deals there since the Islamic Republic reached a nuclear deal in July.",
        "date": "09222015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 3-Drug maker Novo Nordisk to build $78 mln plant in Iran "
    },
    {
        "content": "COPENHAGEN  Sept 15 Analysts are confident the U.S. Food and Drug Administration (FDA) will soon approve Novo Nordisk's new long-lasting insulin drug Tresiba -- just as they were before the drug was first rebuffed two years ago.",
        "date": "09152015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Analysts bet Novo's insulin drug will get U.S. green light "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Friday:",
        "date": "09182015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "NORDIC STOCKS - Factors to watch on Sept 18 "
    },
    {
        "content": "* Says new data confirm Tresiba U200 delivers significantly lower rates of confirmed hypoglycaemia versus insulin glargine U100",
        "date": "09152015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk releases new diabetes drug studies "
    },
    {
        "content": "* Says company is investing 500 million Danish crowns ($75.6 million) in a new 19 000 m2 warehouse in Hillerød  Denmark.",
        "date": "09032015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk invests $76 mln in raw material warehouse "
    },
    {
        "content": "ZURICH  Sept 4 Roche said on Friday it had won breakthrough therapy designation from the U.S. Food and Drug Administration for an experimental haemophilia medicine  aiming for a piece of the $11 billion haemophilia drug market.",
        "date": "09042015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Roche haemophilia drug wins fast-track FDA designation "
    },
    {
        "content": "COPENHAGEN Novo Nordisk  said on Thursday it has agreed to buy  two private biopharmaceutical research companies specializing in diabetes Calibrium LLC and MB2 LLC.",
        "date": "08272015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk to buy two private pharma research firms "
    },
    {
        "content": "COPENHAGEN  Aug 26 Novo Nordisk said on Wednesday it would begin a Phase III trial of its treatment for diabetes that would be taken orally rather than by injection after \"encouraging\" results in previous trials.",
        "date": "08262015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo to begin Phase III trial of oral diabetes treatment "
    },
    {
        "content": "COPENHAGEN  Aug 26 Novo Nordisk said on Wednesday it would begin a Phase III trial of its treatment for diabetes that could be taken orally rather than by injection after \"encouraging\" results in previous trials.",
        "date": "08262015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-Novo to begin Phase III trial of oral diabetes treatment "
    },
    {
        "content": "* Enters commercial license agreement with Novo Nordisk  for Duobody technology",
        "date": "08142015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Genmab in license agreement with Novo Nordisk "
    },
    {
        "content": "COPENHAGEN Strong sales of diabetes drug Victoza proved a bright spot for Denmark's Novo Nordisk  in a second quarter hit by price pressures in the United States and declining sales in China.",
        "date": "08062015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk's Victoza sales up despite price pressure and China slowdown "
    },
    {
        "content": "LONDON  Aug 6 The Chinese market is getting tougher for Western pharmaceutical companies as Beijing bears down on a rising healthcare bill and prices come under pressure.",
        "date": "08062015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "China gets tougher for Western drugmakers "
    },
    {
        "content": "* Shares down 2 pct after initial rise to record high   (Adds CEO  analyst  details)",
        "date": "08062015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo Nordisk's Victoza sales up despite price pressure and China slowdown "
    },
    {
        "content": "COPENHAGEN  Aug 6 Novo Nordisk  the world's largest insulin maker  was impacted by price pressure in the United States in the first half of 2015  its chief executive said.",
        "date": "08062015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk impacted by U.S. price pressure in H1 -CEO "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Thursday:",
        "date": "08062015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "NORDIC STOCKS - Factors to watch on Aug 6 "
    },
    {
        "content": "COPENHAGEN  Aug 6 Denmark's Novo Nordisk's  second-quarter operating profit beat market expectations as strong sales growth of its Victoza diabetes drug offset price pressure in the United States.",
        "date": "08062015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk lifts full-year profit outlook after strong Q2 "
    },
    {
        "content": "COPENHAGEN  July 1 Denmark's Novo Nordisk   the world's biggest insulin producer  is to stop selling its new long-acting insulin drug Tresiba in Germany following a row over pricing.",
        "date": "07012015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk to end German sales of new insulin drug after price row "
    },
    {
        "content": "* Combined businesses to benefit from geography  outsourcing   (Adds Cinven  BC Partners comment)",
        "date": "06262015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-Cinven agrees to buy majority stake in German Synlab "
    },
    {
        "content": "** Says that the company has decided to cease distribution of its once-daily basal insulin Tresiba (insulin degludec) in Germany following a negative outcome of price negotiations with the GKV-Spitzenverband  the German national association of statutory health insurance funds.",
        "date": "07012015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk to stop sale of insulin Tresiba in Germany "
    },
    {
        "content": "COPENHAGEN  June 8 The following stocks may be affected by newspaper reports and other factors on Monday:",
        "date": "06082015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "NORDIC STOCKS - Factors to watch on June 8 "
    },
    {
        "content": "* Treatment with obesity drug Saxenda for three years reduced risk of developing type 2 diabetes compared with placebo",
        "date": "05222015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk says 3-year Saxenda treatment reduced diabetes risk "
    },
    {
        "content": "COPENHAGEN Novo Nordisk is looking into recent clinical trial data that show its diabetes drug Victoza has potential as a treatment for fatty liver disease  a hot area for pharmaceutical development.",
        "date": "05182015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk weighs diabetes drug's use in fatty liver disease "
    },
    {
        "content": "COPENHAGEN  May 18 Novo Nordisk is looking into recent clinical trial data that show its diabetes drug Victoza has potential as a treatment for fatty liver disease  a hot area for pharmaceutical development.",
        "date": "05182015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "REFILE-Novo Nordisk weighs diabetes drug's use in fatty liver disease "
    },
    {
        "content": "Novo Nordisk on Wednesday rejected claims by Baxter International that its drug used substances developed by the U.S. rival  following the launch this week of a U.S. investigation into possible patent infringement.",
        "date": "05202015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk  Baxter clash over haemophilia drug patent "
    },
    {
        "content": "COPENHAGEN Novo Nordisk on Wednesday rejected claims by Baxter International that its drug used substances developed by the U.S. rival  following the launch this week of a U.S. investigation into possible patent infringement.",
        "date": "05202015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk  Baxter clash over hemophilia drug patent "
    },
    {
        "content": "COPENHAGEN  May 20 Novo Nordisk on Wednesday rejected claims by Baxter International that its drug used substances developed by the U.S. rival  following the launch this week of a U.S. investigation into possible patent infringement.",
        "date": "05202015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-Novo Nordisk  Baxter clash over haemophilia drug patent "
    },
    {
        "content": "COPENHAGEN  May 20 Novo Nordisk said on Wednesday it rejected claims by U.S. rival Baxter International that it had infringed patents on drugs to treat the bleeding disorder haemophilia  the Danish company said on Wednesday.",
        "date": "05202015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk rejects Baxter patent claim over Novoeight "
    },
    {
        "content": "* Says Janssen Biotech Inc will acquire licence to further develop and commercialise a clinical programme focused on therapy within auto-immune diseases",
        "date": "05202015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk sells auto-immune licence to J&J unit "
    },
    {
        "content": "COPENHAGEN  May 12 IT services business NNIT   a unit of drugmaker Novo Nordisk until its March listing  reported a rise in operating profit in its first earnings report as a publicly listed company on the Copenhagen stock exchange.",
        "date": "05122015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Former Novo Nordisk IT unit reports jump in profit after IPO "
    },
    {
        "content": "* Says new data demonstrated Saxenda provides benefits beyond weight loss",
        "date": "05082015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk says Saxenda provides benefits beyond weight loss "
    },
    {
        "content": "COPENHAGEN  May 6 Drugmaker Lundbeck  named Kaare Schultz as its new chief a week after the respected executive quit Novo Nordisk  a coup for the struggling smaller firm that sent its shares up 25 percent.",
        "date": "05062015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "UPDATE 1-Denmark's Lundbeck lands Novo Nordisk heavyweight as CEO "
    },
    {
        "content": "COPENHAGEN  May 4 Denmark's Novo Nordisk   the world's biggest insulin producer  said on Monday it would invest 1.5 billion Danish crowns ($225 million) in new haemophilia treatment manufacturing facility in Denmark.",
        "date": "05042015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk to invest $225 mln in factory in Denmark "
    },
    {
        "content": "COPENHAGEN  May 6 Danish drug company Lundbeck  named Kaare Schultz as its new chief on Wednesday just a week after the respected industry executive quit Novo Nordisk  when that firm's boss decided to stay on.",
        "date": "05062015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Former Novo Nordisk executive gets top job at Denmark's Lundbeck "
    },
    {
        "content": "COPENHAGEN  April 30 Novo Nordisk's  chief operating officer  a 26-year company veteran who had been expected to become CEO  quit unexpectedly after the board said the current chief should stay until 2019.",
        "date": "04302015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "UPDATE 3-Novo Nordisk's CEO hopeful quits  chief stays on for stability "
    },
    {
        "content": "COPENHAGEN  April 30 Novo Nordisk's  chairman does not expect to extend the contract with current Chief Executive Lars Rebien Sorensen  who will leave the world's top insulin maker by 2019.",
        "date": "04302015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk chairman says CEO's contract unlikely to be extended "
    },
    {
        "content": "LONDON  April 30 European shares were seen opening mixed after a two-day slide on Thursday as investors sifted through a host of corporate earnings  including profit beats from French bank BNP Paribas and insulin maker Novo Nordisk and disappointing numbers from Finland's Nokia.",
        "date": "04302015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "European Factors to Watch-Shares seen mixed as BNP beats  Nokia misses "
    },
    {
        "content": "STOCKHOLM  April 30 The following stocks may be affected by newspaper reports and other factors on Thursday:",
        "date": "04302015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "NORDIC STOCKS - Factors to watch on April 30 "
    },
    {
        "content": "COPENHAGEN  April 30 Novo Nordisk NOVOb.CO  the world's largest insulin maker  said on Thursday Chief Executive Lars Rebien Sorensen will remain in his role until he approaches the end of his contract  which expires in 2019.",
        "date": "04302015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk CEO to stay in office to 2019  COO leaves "
    },
    {
        "content": "COPENHAGEN Novo Nordisk has launched its Saxenda obesity drug in the United States  it said on Wednesday  a long-awaited milestone that will provide a new revenue stream for the Danish drugmaker.",
        "date": "04222015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo launches Saxenda in U.S.  sees more launches in 2015 "
    },
    {
        "content": "COPENHAGEN  April 22 Novo Nordisk has launched its Saxenda obesity drug in the United States  it said on Wednesday  a long-awaited milestone that will provide a new revenue stream for the Danish drugmaker.",
        "date": "04222015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo launches Saxenda in US  sees more launches in 2015 "
    },
    {
        "content": "COPENHAGEN  April 22 Novo Nordisk's  new obesity drug Saxenda  which has been launched in the United States on Wednesday  will cost $1 068 per month in the country  the company told Reuters in an email on Wednesday.",
        "date": "04222015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk says Saxenda obesity drug to cost $1 068 per month "
    },
    {
        "content": "COPENHAGEN  April 22 Novo Nordisk  said on Wednesday it had launched its Saxenda obesity drug in the United States  a long-awaited milestone that will provide a new revenue stream for the Danish drugmaker.",
        "date": "04222015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk launches Saxenda obesity drug in United States "
    },
    {
        "content": "COPENHAGEN  April 22 Novo Nordisk A/S :  * Reduction in share capital by the cancellation of treasury shares  * Volume will be reduced by 50 000 000 shares to 2 062 564 000 shares",
        "date": "04222015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk - reduction in share capital by the cancellation of treasury shares "
    },
    {
        "content": "Denmark's Novo Nordisk A/S said the U.S. Food and Drug Administration accepted a resubmitted application for its key insulin drug  Tresiba  based on interim analysis data from a clinical trial.",
        "date": "04072015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "FDA accepts Novo Nordisk's resubmitted application for insulin drug "
    },
    {
        "content": "April 7 Denmark's Novo Nordisk A/S  said the U.S. Food and Drug Administration accepted a resubmitted application for its key insulin drug  Tresiba  based on interim analysis data from a clinical trial.",
        "date": "04072015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-FDA accepts Novo Nordisk's resubmitted application for insulin drug "
    },
    {
        "content": "March 24 Bristol-Myers Squibb said on Tuesday it had agreed to acquire rights to a Novo Nordisk  immune system research programme  which the Danish company is divesting as it focuses further on diabetes care.",
        "date": "03242015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Bristol-Myers buys rights to Novo Nordisk immune system project "
    },
    {
        "content": "* FTSEurofirst 300 up 0.2 pct after losing 1.9 pct in two days",
        "date": "03272015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "European shares post 2015's biggest weekly fall despite Novo Nordisk surge "
    },
    {
        "content": "Denmark's Novo Nordisk said on Thursday it had decided to submit interim analysis data from a clinical trial of its crucial new insulin drug Tresiba to U.S. regulators within the next month.",
        "date": "03262015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk filing move brings Tresiba closer to U.S. market "
    },
    {
        "content": "COPENHAGEN  March 24 The European Commission has approved a formulation of Novo Nordisk's diabetes drug  liraglutide  for treating patients of obesity  a disease that affects approximately 10 to 30 percent of adults in the European Union.",
        "date": "03242015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "European Commission approves Novo Nordisk's injectable drug for obesity "
    },
    {
        "content": "* Euro zone shares recover as euro falls back   (Recasts  adds quotes)",
        "date": "03272015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "European shares set for 2015's biggest weekly fall despite Novo Nordisk surge "
    },
    {
        "content": "March 26 Denmark's Novo Nordisk said on Thursday it had decided to submit interim analysis data from a clinical trial of its crucial new insulin drug Tresiba to U.S. regulators within the next month.",
        "date": "03262015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1 -Novo Nordisk filing move brings Tresiba closer to U.S. market "
    },
    {
        "content": "LONDON Other big drugmakers may be reshaping their businesses but Novo Nordisk's focus on diabetes will get even bigger in the coming decade  according to the man most likely to be the Danish company's next boss.",
        "date": "03172015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk CEO apparent sees even more focus on diabetes "
    },
    {
        "content": "* Euro zone shares recover as euro falls back   (Adds quote  detail  updates prices)",
        "date": "03272015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk surge buoys European shares after two-day slide "
    },
    {
        "content": "March 26 Denmark's Novo Nordisk said on Thursday it had decided to submit interim analysis data from a clinical trial of its crucial new insulin drug Tresiba to U.S. regulators within the next month.",
        "date": "03262015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk to submit interim data on Tresiba drug in U.S. "
    },
    {
        "content": "PARIS  March 27 European stocks rose in early trade on Friday  halting a sharp two-day retreat as a renewed fall in the euro helped boost exporters' shares.",
        "date": "03272015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Europe shares snap two-day slide; Novo Nordisk rallies "
    },
    {
        "content": "* Has decided to resubmit the new drug applications of Tresiba and Ryzodeg in the U.S.Source text for Eikon:    Further company coverage:    (Reporting By Ben Hirschler)",
        "date": "03262015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk to resubmit U.S. new drug applications for Tresiba and Ryzodeg "
    },
    {
        "content": "Denmark's Novo Nordisk is to resubmit its new insulin Tresiba to U.S. regulators based on interim analysis data from a clinical trial  bringing its biggest new drug hope closer to the world's top market.",
        "date": "03272015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk surges on plan to resubmit rejected insulin in U.S. "
    },
    {
        "content": "* Following settlement of the Overallotment Option  Novo Nordisk has a direct holding of shares in NNIT of 6 375 000 shares in total of a nominal value of 10 Danish crowns each  corresponding to 25.5 pct of the share capital and 25.5 pct of the voting rights in NNIT  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "03262015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-NNIT: Novo Nordisk has direct holding of shares corresponding to 25.5 pct share capital "
    },
    {
        "content": "* Shares in Danish group hit all-time high   (Updates with shares  analyst reaction)",
        "date": "03272015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo Nordisk surges on plan to resubmit rejected insulin in U.S. "
    },
    {
        "content": "PARIS  March 27 European stocks rose in early trade on Friday  halting a sharp two-day retreat as a renewed fall in the euro currency helped boost the shares of exporting companies.",
        "date": "03272015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "European shares snap two-day slide; Novo Nordisk rallies "
    },
    {
        "content": "COPENHAGEN Shares in NNIT  Danish drugmaker Novo Nordisk's IT services business  soared in price on their debut on the Copenhagen stock market on Friday  rising by as much as 44 percent after a much anticipated initial public offering.",
        "date": "03062015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk IT unit's shares soar in market debut "
    },
    {
        "content": "* Says new data in adults with obesity losing at least 5 percent body weight with Saxenda showed improvement in blood glucose  CV risk factors and quality of life outcomes  Source text for Eikon:  Further company coverage:",
        "date": "03092015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk's Saxenda improves blood glucose -data "
    },
    {
        "content": "COPENHAGEN  March 6 Shares in NNIT  Danish drugmaker Novo Nordisk's IT services business  soared in price on their debut on the Copenhagen stock market on Friday  rising by as much as 44 percent after a much anticipated initial public offering.",
        "date": "03062015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo Nordisk IT unit's shares soar in market debut "
    },
    {
        "content": "COPENHAGEN  March 2 Denmark's Novo Nordisk  has increased the price range for the initial public offering of its IT services unit NNIT   NNIT said on Monday.",
        "date": "03022015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk increases NNIT offer price range "
    },
    {
        "content": "COPENHAGEN  March 6 Shares in Denmark's Novo Nordisk's IT services business NNIT soared on their debut on the Copenhagen stock market on Friday  rising by as much as 44 percent after a much anticipated initial public offering.",
        "date": "03062015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "EXECUTIVE VIEW-Novo to remain large NNIT shareholder  bourse hopes for more IPOs "
    },
    {
        "content": "COPENHAGEN  March 6 Shares in Denmark's Novo Nordisk's IT services unit NNIT were priced at 125 Danish crowns ($18) per share at its initial public offering on the Copenhagen stock exchange on Friday.",
        "date": "03062015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "NNIT shares priced at 125 DKK per share at IPO "
    },
    {
        "content": "COPENHAGEN Danish drugmaker Novo Nordisk  expects to raise between 1.7 billion and 2.2 billion Danish crowns ($259-335 million) from a stock market listing for NNIT [IPO-NNIT.CO]  its information technology services subsidiary.",
        "date": "02232015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk to raise up to $335 million from IT subsidiary's IPO "
    },
    {
        "content": "COPENHAGEN  Feb 20 Danish drugmaker Novo Nordisk   the world's biggest insulin maker  said on Friday it had received positive results from a Phase II trial of an oral version of a long-acting GLP-1 drug for treatment of people with type 2 diabetes.",
        "date": "02242015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "CORRECTED-UPDATE 1-Novo Nordisk has positive trial results for oral diabetes drug  shares jump "
    },
    {
        "content": "COPENHAGEN  Feb 23 Danish drugmaker Novo Nordisk  expects to raise between 1.7 billion and 2.2 billion Danish crowns ($259-335 million) from a stock market listing for NNIT  its information technology services subsidiary.",
        "date": "02232015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo Nordisk to raise up to $335 mln from IT subsidiary's IPO "
    },
    {
        "content": "COPENHAGEN  Feb 20 Danish drugmaker Novo Nordisk   the world's biggest insulin maker  said on Friday it had received positive results from a phase 2 trial of an oral version of a long-acting GLP-1 for treatment of people with type 2 diabetes.",
        "date": "02242015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "CORRECTED-Novo Nordisk has positive trial results for oral GLP-1 drug  shares jump "
    },
    {
        "content": "COPENHAGEN Danish drugmaker Novo Nordisk  the world's biggest insulin maker  said on Friday it had received positive results from a Phase II trial of an oral version of a long-acting GLP-1 drug for treatment of people with type 2 diabetes.",
        "date": "02202015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk has positive trial results for oral diabetes drug  shares jump "
    },
    {
        "content": "COPENHAGEN  Feb 20 Danish drugmaker Novo Nordisk   the world's biggest insulin maker  said on Friday it had received positive results from a Phase II trial of an oral version of a long-acting GLP-1 drug for treatment of people with type 2 diabetes.",
        "date": "02202015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 1-Novo Nordisk has positive trial results for oral diabetes drug  shares jump "
    },
    {
        "content": "COPENHAGEN  Feb 20 Danish drugmaker Novo Nordisk   the world's biggest insulin maker  said on Friday it had received positive results from a phase 2 trial of an oral version of a long-acting GLP-1 for treatment of people with type 2 diabetes.",
        "date": "02202015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "CORRECTED-Novo Nordisk has positive trial results for oral GLP-1 drug  shares jump "
    },
    {
        "content": "** Says it has successfully completed phase 2 trial for OG217SC; an oral formulation of long-acting glp-1 analogue semaglutide",
        "date": "02202015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk completes phase 2 for an oral formulation of long-acting GLP-1 "
    },
    {
        "content": "* Says Novo Nordisk CEO Lars Rebien Sørensen will be proposed to join board to replace Deputy Chairman Jess Søderberg  Source text for Eikon:  Further company coverage:    (Reporting By Martinne Geller)",
        "date": "02112015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Carlsberg to propose Novo Nordisk CEO as deputy chairman "
    },
    {
        "content": "* IPO could value IT business at up to $760 mln   (Adds chairman and CEO quotes  analysts  background)",
        "date": "02092015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo Nordisk plans market listing for IT business within five weeks "
    },
    {
        "content": "COPENHAGEN  Feb 9 Denmark's Novo Nordisk  plans to list its IT services unit NNIT on Copenhagen's stock exchange within the coming four to five weeks  it said on Monday.",
        "date": "02092015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk's IT unit to be listed in 4-5 weeks - CFO "
    },
    {
        "content": "STOCKHOLM  Feb 9 The following stocks may be affected by newspaper reports and other factors on Monday:",
        "date": "02092015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "NORDIC STOCKS - Factors to watch on Feb 9 "
    },
    {
        "content": "COPENHAGEN  Feb 9 Danish drug maker Novo Nordisk  has decided to list its IT services unit NNIT separately on the Copenhagen stock exchange NASDAQ OMX Copenhagen  it said in a press release on Monday.",
        "date": "02092015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk to list its IT service unit "
    },
    {
        "content": "PARIS  Feb 3 Sanofi launched an inhalable insulin in the United States on Tuesday in a potential boost for its flagging diabetes drug sales and for patient quality of life.",
        "date": "02032015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Sanofi launches inhaled insulin for diabetics "
    },
    {
        "content": "COPENHAGEN Danish insulin maker Novo Nordisk  said it not expect significant pressure this year on its business in the United States  where rivals are fighting for its market share  after reporting on Friday a stronger fourth quarter than expected.",
        "date": "01302015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo bullish on 2015 goals  untroubled by U.S. competition "
    },
    {
        "content": "COPENHAGEN  Jan 30 Danish insulin maker Novo Nordisk said it not expect significant pressure this year on its business in the United States  where rivals are fighting for its market share  after reporting on Friday a stronger fourth quarter than expected.",
        "date": "01302015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "UPDATE 2-Novo bullish on 2015 goals  untroubled by U.S. competition "
    },
    {
        "content": "COPENHAGEN  Jan 30 Novo Nordisk does not expect pressure on prices for its drugs in the United States  the world's largest pharmaceutical market  Chief Executive Lars Rebien Sorensen told reporters on a conference call on Friday.",
        "date": "01302015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk CEO says sees little U.S. pricing pressures "
    },
    {
        "content": "STOCKHOLM  Jan 30 The following stocks may be affected by newspaper reports and other factors on Friday:",
        "date": "01302015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "NORDIC STOCKS - Factors to watch on Jan 30 "
    },
    {
        "content": "COPENHAGEN  Jan 30 Denmark's Novo Nordisk  maintained its financial guidance for 2015  giving a more detailed number for its sales growth  after a stronger fourth quarter than expected.",
        "date": "01302015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "RPT-Novo Nordisk keeps 2015 guidance after strong Q4 "
    },
    {
        "content": "COPENHAGEN  Jan 23 Novo Nordisk  the world's biggest insulin maker  said on late Thursday it has received a positive opinion from the European regulatory authorities for its obesity treatment Saxenda.",
        "date": "01232015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "Novo Nordisk to launch obesity treatment in EU markets in 2015 "
    },
    {
        "content": "COPENHAGEN  Jan 30 Denmark's Novo Nordisk  maintained its financial guidance for 2015  giving a more detailed number for its sales growth  after a stronger fourth quarter than expected.",
        "date": "01302015",
        "name": "Novo Nordisk A/S",
        "news_type": "normal",
        "symbol": "NVO",
        "title": "Novo Nordisk keeps 2015 guidance after strong Q4 "
    },
    {
        "content": "Jan 19 Novo Nordisk A/S :  ** Says Switzerland first country to launch Xultophy (IDegLira) for people with type 2 diabetes  ** Says expects to make Xultophy available in other countries throughout Europe in 2015   Source text for Eikon:",
        "date": "01192015",
        "name": "Novo Nordisk A/S",
        "news_type": "topStory",
        "symbol": "NVO",
        "title": "BRIEF-Novo Nordisk says Switzerland first country to launch Xultophy "
    }
]