[
    {
        "content": "LONDON  Nov 16 Pfizer and Novartis have agreed price cuts for their rival breast cancer drugs Ibrance and Kisqali to ensure they can be used routinely within Britain's state-funded health service.",
        "date": "11162017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Pfizer  Novartis agree UK price cuts for new breast cancer drugs "
    },
    {
        "content": "ZURICH  Nov 10 Novartis's bid to move in on Bayer's and Regeneron's eye-drug turf was buoyed on Friday by data showing patients on the Swiss drugmaker's new RTH258 drug showed less disease activity than those on its rivals' drug Eylea.",
        "date": "11102017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis posts eye drug data amid play for Eylea's turf "
    },
    {
        "content": "ZURICH  Nov 13 Novartis plans to plow through doubts over its canakinumab drug by asking regulators this year to approve the medicine as a treatment for a group of heart attack survivors that the Swiss drugmaker says is most likely to benefit.",
        "date": "11132017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis launches heart drug counter-offensive "
    },
    {
        "content": "ZURICH Swiss drugmaker Novartis has submitted its cell therapy Kymriah for European approval in two forms of blood cancer  seeking to expand the use of a new treatment it hopes will eventually become a $1 billion-a-year seller.",
        "date": "11062017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis seeks European approval for cell therapy Kymriah "
    },
    {
        "content": "ZURICH New data from Novartis's  breast cancer drug Kisqali underscored its effectiveness in pre-menopausal women  the Swiss drugmaker said  amid efforts to muscle in on turf dominated by rival Pfizer's Ibrance.",
        "date": "11082017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis takes fight to Pfizer's Ibrance with new Kisqali data "
    },
    {
        "content": "* Competition is growing  with Gilead drug also on US market (Adds comment from Novartis  details about rival market)",
        "date": "11062017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis seeks European approval for cell therapy Kymriah "
    },
    {
        "content": "* Cosentyx is now Novartis's No. 3 drug (Adds details about Cosentyx competition  comment from Novartis)",
        "date": "11062017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis pitches new Cosentyx data as immunology crowd grows "
    },
    {
        "content": "Nov 8 Regeneron Pharmaceuticals Inc on Wednesday reported third-quarter profit that sailed past Wall Street estimates on the strength of increased demand for flagship eye treatment Eylea and its new eczema drug Dupixent  boosting its shares almost 7 percent.",
        "date": "11082017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 3-Regeneron Q3 profit easily tops Street view on Eylea  Dupixent sales "
    },
    {
        "content": "* Class of CDK4/6 cancer drugs getting crowded (Adds details  company and analyst comment)",
        "date": "11082017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis takes fight to Pfizer's Ibrance with new Kisqali data "
    },
    {
        "content": "ZURICH  Nov 13 The Swiss blue-chip SMI was seen opening 0.3 percent higher at 9 159 points on Monday  according to premarket indications by bank Julius Baer .",
        "date": "11132017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Swiss stocks - Factors to watch on Nov 13 "
    },
    {
        "content": "BERLIN/FRANKFURT  Nov 13 The following are some of the factors that may move German stocks on Monday:",
        "date": "11132017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "German stocks - Factors to watch on November 13 "
    },
    {
        "content": "ZURICH  Nov 6 Swiss drugmaker Novartis said on Monday it submitted an application for its cell therapy Kymriah to be approved in Europe for two forms of blood cancer.",
        "date": "11062017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis seeks European approval of cell therapy Kymriah "
    },
    {
        "content": "ZURICH  Nov 6 Novartis on Monday stepped up its defence of Cosentyx  amid rising competition from other immunology medicines  with data indicating the drug halted damage to ankylosing spondylitis (AS) patients' spines after four years of treatment.",
        "date": "11062017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis pitches new Cosentyx data as immunology crowd grows "
    },
    {
        "content": "ZURICH  Nov 8 Novartis drug Kisqali was shown effective in a late-stage trial in treating advanced or metastatic breast cancer  the Swiss drugmaker said on Wednesday.",
        "date": "11082017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis cancer drug Kisqali succeeds in late-stage trial "
    },
    {
        "content": "* ARRAY BIOPHARMA REPORTS FINANCIAL RESULTS FOR THE FIRST QUARTER OF FISCAL 2018",
        "date": "10312017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-ARRAY BIOPHARMA REPORTS Q1 LOSS PER SHARE $0.22 "
    },
    {
        "content": "* Amgen and Novartis announce expanded collaboration with Banner Alzheimer's Institute in pioneering prevention program",
        "date": "11022017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Amgen  Novartis announce expanded collaboration with Banner Alzheimer's Institute "
    },
    {
        "content": "ZURICH Novartis has agreed to buy French-based Advanced Accelerator Applications (AAA) for $3.9 billion  giving it a platform in radiopharmaceuticals and access to a new therapy for the kind of cancer that killed Steve Jobs.",
        "date": "10302017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis to buy French cancer specialist AAA for $3.9 billion "
    },
    {
        "content": "* Novartis submits application to FDA for Kymriah™ (Tisagenlecleucel) in adult patients with R/R DLBCL  seeking second indication for first-ever FDA approved Car-T therapy",
        "date": "10312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis submits application to FDA for Kymriah™ (tisagenlecleucel) in adult patients with R/R DLBCL "
    },
    {
        "content": "Nov 2 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "11022017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Q3 focus turns on banks (Adds detail  updates prices at close)",
        "date": "10302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-European shares tick higher as earnings roll in  Spain rebounds "
    },
    {
        "content": "ZURICH Swiss drugmaker Novartis  is seeking U.S. regulators' blessing for its Kymriah cell therapy to be used against a second form of blood cancer after winning initial approval for the treatment earlier this year.",
        "date": "10312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis asks FDA to expand Kymriah's use against blood cancer "
    },
    {
        "content": "* Novartis is said to weigh sale of dermatology generics business which could fetch up to $1.5 billion - Bloomberg citing sources Source text - https://bloom.bg/2il88uk Further company coverage:",
        "date": "11012017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis said to weigh sale of dermatology generics business - Bloomberg "
    },
    {
        "content": "LONDON/FRANKFURT Swiss drugmaker Novartis  is working with Centerview to review options for its dermatology business  including a possible sale  as it trims non-core assets  two sources familiar with the matter told Reuters.",
        "date": "11022017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis picks Centerview to explore sale of dermatology unit: sources "
    },
    {
        "content": "* French company had first-half sales of $78 mln (Adds Breakingviews link  further detail on Novartis cancer drugs)",
        "date": "10302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 3-Novartis to buy French cancer specialist AAA for $3.9 bln "
    },
    {
        "content": "LONDON  Oct 30 Spanish equities opened 1.4 percent higher on Monday  reassured by weekend demonstrations for a unified Spain and a poll showing  a lead for parties opposed to Catalan independence.",
        "date": "10302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "European shares open sideways as earning roll in  Spain rebounds "
    },
    {
        "content": "ZURICH  Oct 31 Swiss drugmaker Novartis is seeking U.S. regulators' blessing for its Kymriah cell therapy to be used against a second form of blood cancer after winning initial approval for the treatment earlier this year.",
        "date": "10312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis asks FDA to expand Kymriah's use against blood cancer "
    },
    {
        "content": "LONDON  Nov 1 Bayer is weighing legal action and Novartis has expressed concern at plans by doctors in the north of England to defy official guidance by using a cancer medicine as a cheap eye drug.",
        "date": "11012017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Bayer  Novartis clash with UK doctors over use of cheap eye drug "
    },
    {
        "content": "LONDON/FRANKFURT  Nov 2 Swiss drugmaker Novartis is working with Centerview to review options for its dermatology business  including a possible sale  as it trims non-core assets  two sources familiar with the matter told Reuters.",
        "date": "11022017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis picks Centerview to explore sale of dermatology unit -sources "
    },
    {
        "content": "LONDON  Nov 2 GlaxoSmithKline received a boost for its oncology research on Thursday when an experimental drug for blood cancer received a \"breakthrough\" designation from U.S. regulators.",
        "date": "11022017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "GSK gets boost for early cancer hopes with breakthrough status "
    },
    {
        "content": "ZURICH  Oct 30 Swiss drugmaker Novartis on Monday said it was buying France's Advanced Accelerator Applications (AAA) in a  $3.9 billion cash deal to strengthen the oncology portfolio at the world's biggest maker of prescription medicines.",
        "date": "10302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis to buy France's Advanced Accelerator for $3.9 bln "
    },
    {
        "content": "* Novartis says Sandoz proposed biosimilar pegfilgrastim accepted by EMA for regulatory review Source text for Eikon: Further company coverage: (Reporting By Zurich newsroom)",
        "date": "10272017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Biosimilar pegfilgrastim accepted by EMA for regulatory review - Novartis "
    },
    {
        "content": "* Novartis confirms leadership in multiple sclerosis (ms) with scientific advancements and new data presented at ECTRIMS",
        "date": "10252017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis confirms leadership in multiple sclerosis (ms) with scientific advancements and new data presented "
    },
    {
        "content": "ZURICH  Oct 23 Novartis on Monday said the U.S. Food and Drug Administration has granted breakthrough therapy status to the combination of Tafinlar and Mekinist to treat patients with BRAF V600-positive stage III melanoma following surgery.",
        "date": "10232017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis gets FDA breakthrough status for Tafinlar  Mekinist combination "
    },
    {
        "content": "* Advanced accelerator applications announces $3.9 billion all cash proposed tender offer by Novartis",
        "date": "10302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Advanced Accelerator announces $3.9 bln all cash proposed tender offer by Novartis "
    },
    {
        "content": "Oct 25 GlaxoSmithKline CEO Emma Walmsley tells reporters:",
        "date": "10252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-GSK will look at Pfizer  Merck consumer assets if offered for sale "
    },
    {
        "content": "* CEO Joe Jimenez says focusing on bolt-on acquisitions  larger acquisition \"not on strategy\"",
        "date": "10242017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis CEO: No plans for Sandoz exit  big acquisitions "
    },
    {
        "content": "ZURICH  Oct 24 Novartis's European launch of a copy of Roche's $7 billion-per-year Rituxan was better than expected  Chief Executive Joe Jimenez said on Tuesday as his generic and cancer sales forces combined to win business from their Swiss rival.",
        "date": "10242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis CEO: Rituxan copy beat expectations after Europe launch "
    },
    {
        "content": "ZURICH Swiss drugmaker Novartis is moving closer to spinning off the ailing Alcon eyecare business it bought from Nestle for $50 billion in 2010  but said on Tuesday a final decision would depend on the unit's continued sales growth.",
        "date": "10242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis aims to beef up Alcon before possible 2019 spin off "
    },
    {
        "content": "* Entresto sales miss expectations (Adds comment from CEO  analysts  shares)",
        "date": "10242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Novartis aims to beef up Alcon before possible 2019 spin off "
    },
    {
        "content": "ZURICH  Oct 19 Swiss drugmaker Novartis is to cut 450 jobs in the United States over the next two years as it gradually shuts a generics manufacturing plant in Colorado and discontinues some products in the face of intense price pressures.",
        "date": "10192017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis to shut U.S. generics plant  cut 450 jobs "
    },
    {
        "content": "* Q3 2017 net sales of $101 million for ultibro ® breezhaler ® and $37 million for seebri ® breezhaler​",
        "date": "10242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Vectura confident on outlook for Novartis inhaler products "
    },
    {
        "content": "* Ceo says wants to time alcon exit when market is strong  expects strong market to continue - cnbc",
        "date": "10242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis CEO: Alcon spinoff 'probably direction we are headed' - CNBC "
    },
    {
        "content": "* CEO Joe Jimenez says expects U.S. price pressure on generics business to remain",
        "date": "10242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis CEO: Novartis shareholders would get Alcon shares in listing "
    },
    {
        "content": "ZURICH  Oct 24 Novartis's third-quarter core net income rose 4 percent at constant currencies  beating analyst expectations  as the Swiss drugmaker said it made \"significant progress\" in preparing its Alcon eyecare unit for a possible spinoff by the first half of 2019.",
        "date": "10242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis boosts Q3 profit  pushes Alcon decision to 2019 "
    },
    {
        "content": "Oct 11 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "10112017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "ZURICH  Oct 11 Novartis has decided not to sell its roughly $14 billion  33 percent voting stake in Roche following a review  Chairman Joerg Reinhardt said in an interview published on Wednesday in Swiss newspaper HandelsZeitung.",
        "date": "10112017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis decides not to sell Roche stake chairman tells newspaper "
    },
    {
        "content": "* Argentum Pharmaceuticals says succeeds in starting patent cancellation trial against Novartis' AFINITOR",
        "date": "09292017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Argentum Pharmaceuticals succeeds in starting patent cancellation trial against Novartis' AFINITOR "
    },
    {
        "content": "ZURICH  Sept 28 Novartis's research head expects an alliance with a University of California chemistry lab to produce drug candidates within three years as the Swiss company accelerates its hunt for new medicines.",
        "date": "09282017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis forges UC Berkeley pact  sees drug hopefuls in 3 years "
    },
    {
        "content": "NEW YORK  Sept 21Pop quiz: What percentage of long-term stock market returns are thanks to the humble dividend? Five? 10? 20?",
        "date": "09212017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "RPT-YOUR MONEY-Three tips for smart dividend ETF plays "
    },
    {
        "content": "ZURICH  Sept 20 Swiss drugmaker Novartis on Wednesday said it had won European Union approval for Rydapt to be used against a mutated form of acute myeloid leukemia (AML) and other rare diseases  adding to U.S. approvals it secured in April.",
        "date": "09202017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis's Rydapt wins EU approval for AML  other diseases "
    },
    {
        "content": "NEW YORK  Sept 21Pop quiz: What percentage of long-term stock market returns are thanks to the humble dividend? Five? 10? 20?",
        "date": "09212017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "YOUR MONEY-Three tips for smart dividend ETF plays "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  September 18 (Fitch) Fitch Ratings has revised Switzerland-based pharmaceutical company Novartis AG's Outlook to Negative from Stable. Its Long-Term Issuer Default Rating (IDR) and senior secured rating have been affirmed at 'AA' and Short-Term IDR at 'F1+'. Fitch has also affirmed at 'AA' the unsecured rating of the notes issued by Novartis Finance S.A.  Novartis Capital Corp.   and Novartis Securities Investments Ltd.  all gua",
        "date": "09182017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Fitch Revises Novartis' Outlook to Negative; 'AA' Affirmed "
    },
    {
        "content": "ZURICH  Sept 20 Swiss drugmaker Novartis on Wednesday won European Union approval for Rydapt to be used against a mutated form of acute myeloid leukemia (AML) and other rare diseases  adding to U.S. approvals the medicine secured in April.",
        "date": "09202017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis's Rydapt wins EU approval for AML  other diseases "
    },
    {
        "content": "LONDON  Sept 18 The long-heralded threat of cut-price competition to its top-selling biological cancer medicines is finally becoming a reality for Roche  the world's biggest maker of oncology treatments.",
        "date": "09182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Biosimilar cancer drug threat closing in for Roche "
    },
    {
        "content": "ZURICH  Sept 18 The Swiss blue-chip SMI was seen opening 0.3 percent higher at 9 054 points on Monday  according to premarket indications by bank Julius Baer .",
        "date": "09182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Swiss stocks - Factors to watch on Sept 18 "
    },
    {
        "content": "* Says proposed biosimilar adalimumab matches reference biologic Humira in terms of efficacy and safety in long-term study Source text for Eikon: [ID:https://www.novartis.com/news/media-releases/sandoz-proposed-biosimilar-adalimumab-matches-reference-biologic-terms-efficacy ] Further company coverage: (Reporting By Zurich newsroom)",
        "date": "09142017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says biosimilar adalimumab matches Humira in study "
    },
    {
        "content": "* Says cosentyx shows sustained skin clearance rates at 5 years in phaseiii study in psoriasis",
        "date": "09132017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says Cosentyx sustains skin clearance at 5 years "
    },
    {
        "content": "ZURICH  Sept 12 Novartis AG said on Tuesday its biosimilar rituximab to treat blood cancers and immunological diseases such as rheumatoid arthritis was accepted for review by the U.S. Food and Drug Administration (FDA).",
        "date": "09122017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis says biosimilar rituximab accepted for review by FDA "
    },
    {
        "content": "* Teva shares up 16 pct in New York  Lundbeck falls 13 pct (Adds comments  details)",
        "date": "09112017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 3-Drugmaker Teva hires Lundbeck CEO Schultz to restore its health "
    },
    {
        "content": "ZURICH/MADRID  Sept 11 Swiss drugmaker Novartis notched a trial win for its drug cocktail against skin cancer on Monday  while a rival treatment from Roche with slipping sales failed in a separate study with a similar patient group.",
        "date": "09102017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis posts a win  Roche a flop in skin cancer trials "
    },
    {
        "content": "ZURICH Novartis  CEO Joe Jimenez will step down on Feb. 1 and hand over to drug development chief Vas Narasimhan to decide the fate of $50 billion in assets and make good on a pledge to return the Swiss company to sales growth. | Video ",
        "date": "09042017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis names drugs chief as CEO to deliver return to growth "
    },
    {
        "content": "* Novartis shares ease  in line with sector (Adds company  analyst comments  detail  background  shares)",
        "date": "09042017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Novartis names drugs chief as CEO to deliver return to growth "
    },
    {
        "content": "ZURICH  Aug 31 Novartis's new gene-modifying cancer therapy's $475 000-per-patient sticker price has drawn fire from advocate groups calling for cheaper drugs  but analysts said the Swiss drugmaker could initially struggle to break even.",
        "date": "08312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Profit on $475 000 Novartis cancer drug could be a while coming "
    },
    {
        "content": "Aug 30 Novartis AG on Wednesday won highly anticipated U.S. approval for the first of a new type of potent gene-modifying immunotherapy for leukemia  a $475 000 treatment that marks the start of a potential new treatment paradigm for some cancers.",
        "date": "08302017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "UPDATE 3-Novartis gene therapy approval signals new cancer treatment era "
    },
    {
        "content": "ZURICH  Aug 31 Novartis's new gene-modifying cancer therapy's $475 000-per-patient sticker price has drawn fire from advocate groups calling for cheaper drugs  but analysts said the Swiss drugmaker could initially struggle to break even.",
        "date": "09012017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "RPT-Profit on $475 000 Novartis cancer drug could be a while coming "
    },
    {
        "content": "ZURICH  Aug 28 Investors shrugged off Novartis's optimism that its new anti-inflammatory drug will make inroads into treating heart-attack survivors and sent its shares lower on Monday as some experts called new data unconvincing.",
        "date": "08282017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis shares slip after mixed heart drug data "
    },
    {
        "content": "ZURICH  Aug 27 Novartis will seek regulatory approval this year for a new kind of anti-inflammatory heart drug  though some experts fear fatal infection risks and a high price may overshadow the medicine's limited benefits.",
        "date": "08272017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis hopeful for novel heart drug  despite 'modest' benefit "
    },
    {
        "content": "* Chairman says no change to novartis strategy for the moment  no news on alcon",
        "date": "09042017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis CEO: Considering all Alcon from keeping business to capital markets exit "
    },
    {
        "content": "* Novartis receives first ever FDA approval for a CAR-T cell therapy  Kymriah™ (tisagenlecleucel  CTL019)  for children and young adults with B-cell ALL that is refractory or has relapsed at least twice Source text for Eikon: Further company coverage:",
        "date": "08302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis receives FDA approval for CAR-T cell therapy Kymriah "
    },
    {
        "content": "Aug 30 The U.S. Food and Drug Administration (FDA) on Wednesday approved Novartis AG's keenly anticipated  leukemia treatment  marking the first gene therapy approval in the United States.",
        "date": "08302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis gene therapy for leukemia wins U.S. approval "
    },
    {
        "content": "* Novartis plans Q4 filing with regulators (Adds analyst comment on pricing)",
        "date": "08272017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis hopeful for novel heart drug  despite 'modest' benefit "
    },
    {
        "content": "ZURICH  Sept 4 Novartis Chief Executive Joseph Jimenez will retire in 2018  with chief drug developer Vasant Narasimhan taking over as CEO starting in February  the Swiss drugmaker said on Monday.",
        "date": "09042017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis's Jimenez stepping down  Narasimhan named new CEO "
    },
    {
        "content": "* Xoma announces transformational license agreements for gevokizumab and its IL-1 beta intellectual property portfolio",
        "date": "08252017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Xoma announces transformational license agreements for gevokizumab and its IL-1 beta intellectual property portfolio "
    },
    {
        "content": "LONDON  Aug 24 Novartis has appointed a senior retail expert to the new post of chief digital officer  following a similar move by GlaxoSmithKline last month  underscoring how drugmakers are grappling with the impact of new technology.",
        "date": "08242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis picks retail expert for new role of digital chief "
    },
    {
        "content": "LONDON  Aug 23 After 20 years of losses  gene therapy specialist Oxford BioMedica is at last close to achieving its first profit thanks to the success of Novartis with a pioneering cancer treatment.",
        "date": "08232017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Profit finally in sight for gene therapy specialist Oxford Bio "
    },
    {
        "content": "Aug 22 U.S. SAYS U.S. BIOSERVICES ARRANGED TO RECEIVE MORE PATIENT REFERRALS AND RELATED BENEFITS IN RETURN FOR ACHIEVING HIGHER PRESCRIPTION REFILL RATE FOR EXJADE U.S. SEEKS TRIPLE DAMAGES AND CIVIL PENALTIES FROM U.S. BIOSERVICES  IN LAWSUIT FILED IN MANHATTAN FEDERAL COURT U.S. SAYS ACCREDO HEALTH  BIOSCRIP HAVE ALSO SETTLED RELATED CASES U.S. FILES FALSE CLAIMS ACT LAWSUIT AGAINST U.S. BIOSERVICES CORP OVER ALLEGED KICKBACK RELATIONSHIP WITH NOVARTIS  WHICH PREVIOUSLY SETTLED RE",
        "date": "08222017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-U.S. files lawsuit against US Bioservices related to kickbacks  Novartis' Exjade "
    },
    {
        "content": "LONDON  Aug 21 Novartis is taking aim at drug-resistant malaria – a growing global problem – by launching clinical trials of the first new antimalarial medicine for many years in nine countries across Africa and Asia.",
        "date": "08212017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "New Novartis drug takes aim at tough-to-treat malaria "
    },
    {
        "content": "ZURICH Novartis AG said its drug Kisqali (ribociclib) received European Union approval as first-line treatment for a tough-to-treat breast cancer  bolstering the Swiss drugmaker's bid to challenge U.S. rival Pfizer's Ibrance.",
        "date": "08242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis receives EU approval for breast cancer drug Kisqali "
    },
    {
        "content": "ZURICH  Aug 24 Novartis AG said its drug Kisqali (ribociclib) received European Union approval as first-line treatment for a tough-to-treat breast cancer  bolstering the Swiss drugmaker's bid to challenge U.S. rival Pfizer's Ibrance.",
        "date": "08242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis receives EU approval for breast cancer drug Kisqali "
    },
    {
        "content": "Aug 22 Specialty pharmacy firm US Bioservices Corp has agreed to pay $13.4 million to settle U.S. government claims that it pushed patients to refill prescriptions of Novartis AG's iron overload drug Exjade in exchange for referrals from the Swiss drugmaker.",
        "date": "08222017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "US Bioservices to resolve kickback claims for $13.4 mln -filing "
    },
    {
        "content": "ZURICH  Aug 24 Novartis AG said its drug Kisqali (ribociclib) received European Union approval as first-line treatment for a tough-to-treat breast cancer  bolstering the Swiss drugmaker's bid to challenge rival Pfizer's Ibrance.",
        "date": "08242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis says receives EU approval for breast cancer drug Kisqali "
    },
    {
        "content": "Aug 3 Bristol-Myers Squibb Co said it would buy privately held IFM Therapeutics for an upfront payment of $300 million  as the drugmaker looks to bolster its cancer portfolio after losing ground to Merck & Co's rival treatment Keytruda.",
        "date": "08032017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Bristol-Myers to buy IFM Therapeutics to strengthen cancer pipeline "
    },
    {
        "content": "* Cryoport - Novartis signed agreement contracting co over an initial three-year term for cryogenic logistics support of CTL019/CD19 CAR-T cell therapy Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Cryoport says Novartis signed agreement contracting co over an initial three-year term for cryogenic logistics support "
    },
    {
        "content": "* EU Medicines Agency recommends approval of Pfizer Inc and Merck KGAA Avelumab drug for cell carcinoma‍​",
        "date": "07212017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-EU Medicines Agency recommends approval of Novartis' leukaemia drug "
    },
    {
        "content": "BOSTON  July 21 Amphastar Pharmaceuticals Inc on Friday won a trial in a lawsuit claiming that the drugmaker through its production of a generic version of the blood-thinner Lovenox infringed a patent held by Momenta Pharmaceuticals Inc.",
        "date": "07212017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "U.S. jury sides with Amphastar over Momenta in drug patent trial "
    },
    {
        "content": "BOSTON  July 21 A federal jury handed Amphastar Pharmaceuticals Inc a big win on Friday after it was accused of infringing on a patent held by Momenta Pharmaceuticals Inc through its production of a generic version of the blood-thinner Lovenox.",
        "date": "07212017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-U.S. jury sides with Amphastar over Momenta in drug patent trial "
    },
    {
        "content": "ZURICH A European Medicines Agency (EMA) panel recommended on Friday approval of a new Novartis drug to be used against a tough-to-cure form of blood cancer as the Swiss drugmaker makes headway on refreshing its oncology portfolio.",
        "date": "07212017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "EU medicines agency recommends approval of Novartis leukaemia drug Rydapt "
    },
    {
        "content": "VIENNA  July 17 BAWAG PSK  the Austrian bank owned by private equity group Cerberus Capital Management  bought German regional lender Suedwestbank for an undisclosed price to expand its network in western Europe  BAWAG said on Monday.",
        "date": "07172017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Austria's BAWAG PSK buys Germany's Suedwestbank "
    },
    {
        "content": "ZURICH Sales growth at Alcon  Novartis's  struggling eye care unit  accelerated in the second quarter  boosting options for the business including a possible sale  Chief Executive Joe Jimenez said on Tuesday.",
        "date": "07182017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis sees Alcon recovery opening door to spin-off IPO "
    },
    {
        "content": "* Sandoz hit again by U.S. price pressure (Updates shares  adds detail about SEC  DOJ investigation)",
        "date": "07182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Novartis sees Alcon recovery opening door to spin-off IPO "
    },
    {
        "content": "* Says generic dermatology portfolio was hit more severely by u.s. Price pressure as competitors introduced",
        "date": "07182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis 'cooperating fully' with DOJ  SEC probe of Alcon's Russia  Asia business "
    },
    {
        "content": "* Ceo reiterates entresto sales seen hitting $500 million in 2017",
        "date": "07182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis CEO says growth at Alcon boosts options for eye surgery unit "
    },
    {
        "content": "ZURICH  July 18 Novartis on Tuesday reiterated its forecast that sales would start growing again in 2018 and slightly lifted the full-year outlook for its Alcon eyecare division  as sales of surgical equipment finally ended a string of declines.",
        "date": "07182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis sticks to 2018 growth target  lifts Alcon outlook "
    },
    {
        "content": "* Novartis confirms 5 year data for first and only fully-human il-17a inhibitor cosentyx® reinforcing sustained efficacy and safety profile in psoriasis Source text for Eikon: Further company coverage:",
        "date": "07142017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis confirms 5 year data for first  only fully-human IL-17A inhibitor Cosentyx reinforcing sustained efficacy  safety profile in psoriasis "
    },
    {
        "content": "Novartis AG's  pioneering new cancer drug won enthusiastic support from a federal advisory panel on Wednesday  paving the way for approval of the first U.S. gene therapy.",
        "date": "07122017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "FDA panel backs Novartis' pioneering new cancer gene therapy "
    },
    {
        "content": "* Novartis CAR-T cell therapy CTl019 unanimously (10-0) recommended for approval by FDA advisory committee to treat pediatric  young adult r/r B-cell ALL",
        "date": "07132017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says CAR-T cell therapy unanimously recommended for approval by FDA advisory committee "
    },
    {
        "content": "DUESSELDORF/FRANKFURT  July 14 German biotech group Morphosys expects to receive royalties from psoriasis drug guselkumab for five months this year  its Chief Executive Simon Moroney said  after its licensee received U.S. regulatory approval.",
        "date": "07142017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "REFILE-UPDATE 3-Morphosys sees revenue boost from Janssen psoriasis drug "
    },
    {
        "content": "DUESSELDORF/FRANKFURT German biotech group Morphosys expects to receive royalties from psoriasis drug guselkumab for five months this year  its Chief Executive Simon Moroney said  after its licensee received U.S. regulatory approval.",
        "date": "07142017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Morphosys sees revenue boost from Janssen psoriasis drug "
    },
    {
        "content": "FRANKFURT  July 14 Shares in Morphosys jumped 11 percent in pre-market trade on Friday after a licensee won U.S. approval for psoriasis drug guselkumab  bringing the German biotech group a step closer to launching its first antibody drug onto the market.",
        "date": "07142017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Morphosys jumps pre-market as FDA approves antibody drug "
    },
    {
        "content": "July 12 Novartis AG's pioneering new cancer drug won enthusiastic support from a federal advisory panel on Wednesday  paving the way for approval of the first U.S. gene therapy.",
        "date": "07122017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-U.S. FDA panel backs Novartis' pioneering new cancer gene therapy "
    },
    {
        "content": "ZURICH Two decades ago in a Memphis  Tenn.  hospital lab  cancer scientist Dario Campana and his team were hunting for a new way to fight deadly acute lymphoblastic leukemia (ALL).",
        "date": "07112017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis readies for FDA review of $1 billion CAR-T child cancer hope "
    },
    {
        "content": "July 12 Novartis AG's pioneering cancer drug won the backing of a federal advisory panel on Wednesday  paving the way for the first gene therapy to be approved in the United States.",
        "date": "07122017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Pioneering cancer gene therapy by Novartis backed by U.S. panel "
    },
    {
        "content": "ZURICH  July 11 Two decades ago in a Memphis  Tenn.  hospital lab  cancer scientist Dario Campana and his team were hunting for a new way to fight deadly acute lymphoblastic leukemia (ALL).",
        "date": "07112017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis readies for FDA review of $1 bln CAR-T child cancer hope "
    },
    {
        "content": "July 10 The U.S. Food and Drug Administration will ask a panel of advisors to focus on the safety of Novartis AG's experimental gene therapy drug when it meets to review the leukemia treatment on Wednesday.",
        "date": "07102017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "FDA panel to focus on safety of Novartis gene therapy drug "
    },
    {
        "content": "July 10 The U.S. Food and Drug Administration will ask a panel of advisors to focus on the safety of Novartis AG's experimental gene therapy drug when it meets to review the product on Wednesday.",
        "date": "07102017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-FDA panel to focus on safety of Novartis gene therapy drug "
    },
    {
        "content": "* Conatus Pharmaceuticals - exclusive license with Novartis for global development and commercialization of emricasan has become effective under terms",
        "date": "07062017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Conatus announces effectiveness of exclusive license with Novartis "
    },
    {
        "content": "* Ophthotech - on July 3  co and Novartis Pharma entered into a letter agreement with respect to licensing and commercialization agreement  dated May 19  2014",
        "date": "07102017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Ophthotech and Novartis Pharma enters into a letter agreement with respect to licensing and commercialization agreement "
    },
    {
        "content": "LONDON  July 6 Novartis has signed a major contract with Oxford BioMedica that could earn the British company more than $100 million over three years for supplying the Swiss drugmaker with material for its novel cell therapy CTL019.",
        "date": "07062017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Oxford BioMedica wins big contract for Novartis cell therapy "
    },
    {
        "content": "ZURICH  July 6 Novartis said that the Committee for Medicinal Products for Human Use (CHMP) has approved a label update for Cosentyx (secukinumab)  the first interleukin-17A (IL-17A) approved to treat psoriasis.",
        "date": "07062017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis receives EU approval for Cosentyx label update "
    },
    {
        "content": "June 28 Vectura Group Plc said on Wednesday it has signed an exclusive deal with Sandoz AG  a unit of Swiss drugmaker Novartis  to develop a generic copy of an existing combined lung therapy for the U.S. market.",
        "date": "06282017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Vectura signs deal with Novartis for generic U.S. lung therapy "
    },
    {
        "content": "LONDON Novartis and Merck have both surprised experts in the past week by finding new ways to tackle heart disease  although the jury remains out as to whether this scientific success will translate into blockbuster sales.",
        "date": "06292017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Sales hopes for new Novartis  Merck heart drugs under microscope "
    },
    {
        "content": "* But questions over likely scale of clinical benefits (Recasts with sales forecasts and comments from experts)",
        "date": "06292017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Sales hopes for new Novartis  Merck heart drugs under microscope "
    },
    {
        "content": "ZURICH  June 29 The European Commission has approved expanding the use of Zykadia (ceritinib) to include the first-line treatment of patients with advanced non-small cell lung cancer (NSCLC) whose tumours are anaplastic lymphoma kinase (ALK)-positive  Swiss drugmaker Novartis said on Thursday.",
        "date": "06292017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis gets wider EU approval for Zykadia in lung cancer "
    },
    {
        "content": "FRANKFURT  June 23 Germany's Merck KGaA has won a key recommendation to become a late entrant to the market for oral multiple sclerosis (MS) drugs in Europe  six years after its first attempt to launch the cladribine pill failed.",
        "date": "06242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "CORRECTED-Germany's Merck gets EU backing for oral MS drug "
    },
    {
        "content": "* Novartis achieves important regulatory milestone for amg 334 (erenumab) in migraine prevention with ema filing acceptance",
        "date": "06212017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says EMA accepts filing for AMG 334 for preventing migraine "
    },
    {
        "content": "ZURICH  June 27 Novartis's generics unit Sandoz said the European Commission approved Erelzi  its biosimilar to Amgen's Enbrel  to treat inflammatory diseases such as rheumatoid arthritis  psoriasis  and psoriatic arthritis.",
        "date": "06272017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis gets European OK for biosimilar of Amgen's Enbrel "
    },
    {
        "content": "* Novartis combination targeted therapy tafinlar + mekinist receives FDA approval for BRAF V600E mutant metastatic non-small cell lung cancer (NSCLC)",
        "date": "06222017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis combination targeted therapy Tafinlar + Mekinist receives FDA approval for BRAF V600E mutant metastatic NSCLC "
    },
    {
        "content": "ZURICH A European Medicines Agency (EMA) panel recommended on Friday approving Novartis's Kisqali drug  bolstering the Swiss drugmaker's bid to challenge rival Pfizer's Ibrance against tough-to-treat breast cancer.",
        "date": "06232017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis breast cancer drug Kisqali wins European panel backing "
    },
    {
        "content": "* Regeneron details royalty agreement with novartis for canakinumab (acz885)",
        "date": "06222017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Regeneron details royalty agreement with Novartis for canakinumab "
    },
    {
        "content": "ZURICH  June 23 A European Medicines Agency (EMA) panel recommended on Friday approving Novartis's Kisqali drug  bolstering the Swiss drugmaker's bid to challenge rival Pfizer's Ibrance against tough-to-treat breast cancer.",
        "date": "06232017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis breast cancer drug Kisqali wins European panel backing "
    },
    {
        "content": "ZURICH  June 23 A European Medicines Agency (EMA) panel recommended on Friday approving Novartis's Kisqali drug  bolstering the Swiss drugmaker's bid to challenge rival Pfizer's Ibrance against tough-to-treat breast cancer.",
        "date": "06232017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis breast cancer drug Kisqali wins European panel nod "
    },
    {
        "content": "ZURICH/LONDON A Novartis anti-inflammatory drug cut cardiovascular risk for heart attack survivors in a pivotal trial  potentially changing ideas about treatment.",
        "date": "06222017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis heart drug success opens up new care option "
    },
    {
        "content": "ZURICH Switzerland's Novartis increased pressure on Roche's ageing stable of big-selling drugs on Monday by becoming the latest company to win European approval for a cut-price version of Rituxan for blood cancer and immunological diseases.",
        "date": "06192017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis throws down gauntlet to Roche with Rituxan copy "
    },
    {
        "content": "* Boosts pipeline hopes  two days after good eye drug data (Adds analyst comments  details throughout  updates shares)",
        "date": "06222017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Novartis heart drug success opens up new care option "
    },
    {
        "content": "* Says Cosentyx shows sustained improvements in signs and symptoms for both active ankylosing spondylitis and psoriatic arthritis in up to 80 percent of patients at 3 years Source text for Eikon: [ID:file:///C:/Users/g195632/AppData/Local/Fastwire/Download/-67 1638335/Body.Html] Further company coverage: (Reporting By Zurich newsroom)",
        "date": "06152017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says Cosentyx helped arthritis patients at 3 years "
    },
    {
        "content": "* Novartis also plans 2017 U.S. filing for Rixathon (Recasts to focus on threat to Roche  adds analyst comment)",
        "date": "06192017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis throws down gauntlet to Roche with Rituxan copy "
    },
    {
        "content": "* Aims to present canakinumab data at european society of cardiology congress in august although presentation could be later in 2017 - spokesman Source text for Eikon: Further company coverage: (Reporting by John Miller)",
        "date": "06222017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis aims to present canakinumab data at ESC in August "
    },
    {
        "content": "ZURICH A Novartis drug to treat a leading cause of vision loss in people over 65 does not need to be injected as frequently as a rival medicine from Regeneron Pharmaceuticals to be effective  clinical trials showed on Tuesday.",
        "date": "06202017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis eye drug works with fewer injections than rival "
    },
    {
        "content": "TEL AVIV Israel's Gamida Cell  which is developing cellular therapies to treat cancer and rare genetic diseases  said on Monday it raised $40 million to finance the advanced trial of its product NiCord to facilitate bone marrow transplants.",
        "date": "06192017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Israel's Gamida Cell raises $40 million for bone marrow trial "
    },
    {
        "content": "TEL AVIV  June 19 Israel's Gamida Cell  which is developing cellular therapies to treat cancer and rare genetic diseases  said on Monday it raised $40 million to finance the advanced trial of its product NiCord to facilitate bone marrow transplants.",
        "date": "06192017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Israel's Gamida Cell raises $40 mln for bone marrow trial "
    },
    {
        "content": "ZURICH  June 20 A Novartis drug to treat a leading cause of vision loss in people over 65 does not need to be injected as frequently as a rival medicine from Regeneron Pharmaceuticals to be effective  clinical trials showed on Tuesday.",
        "date": "06202017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "REFILE-UPDATE 2-Novartis eye drug works with fewer injections than rival "
    },
    {
        "content": "ZURICH  June 19 Swiss drugmaker Novartis on Monday said it had won European approval for its biosimilar version of Roche's blockbuster Rituxan as the crosstown rivals go head-to-head on a drug to treat blood cancers and immunological diseases.",
        "date": "06192017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis wins European approval for biosimilar version of Roche's MabThera "
    },
    {
        "content": "LONDON  June 20 Forecasts for global sales of pharmaceuticals have declined for the first time in a decade as continuing pressure on prices in the key U.S. market has caused analysts to moderate revenue expectations  according to a report on Tuesday.",
        "date": "06202017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Worldwide drug sale forecasts fall as pricing pressures mount "
    },
    {
        "content": "ZURICH  June 20 A drug developed by Novartis to treat vision loss in people over 65 does not need to be injected as frequently as a rival medicine from Regeneron to be effective  clinical trials showed on Tuesday.",
        "date": "06202017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "CORRECTED-UPDATE 1-Novartis eye drug works with fewer injections than rivals "
    },
    {
        "content": "ZURICH  June 20 Novartis eye drug RTH258 works as well as a rival product from Regeneron and at less frequent dosing in clinical trials  the Swiss drugmaker said on Tuesday  boosting its shares.",
        "date": "06202017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis eye drug works at less frequent dosing than rival's "
    },
    {
        "content": "WASHINGTON  June 12 The U.S. Supreme Court on Monday cut the time it will take for copycat versions of biologic drugs to get to the market in a pivotal ruling about an expensive class of medicines that can yield billions of dollars in sales for drug companies.",
        "date": "06122017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "UPDATE 4-U.S. Supreme Court speeds copycat biologic drugs to market "
    },
    {
        "content": "* Novartis says presents data demonstrating efficacy of amg 334 (erenumab) in migraine prevention at the american headache society annual meeting Source text for Eikon: Further company coverage: (Reporting By Zurich newsroom)",
        "date": "06092017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says data back AMG 334 (erenumab) in migraine "
    },
    {
        "content": "* Novartis says rth258 (brolucizumab) demonstrates robust visual gains in namd patients with a majority on a 12-week injection interval",
        "date": "06202017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says RTH258 met endpoints in late-stage trials "
    },
    {
        "content": "ZURICH  June 7 Novartis on Wednesday touted new data from its T-cell therapy CTL019  saying it is on a par with results of experimental molecules from Kite Pharma and Juno Therapeutics that also target aggressive blood cancers.",
        "date": "06072017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis touts new T-cell therapy data in race for FDA approval "
    },
    {
        "content": "* Says FDA sets advisory committee meeting on July 12 for CTL019 Car-T therapy for pediatric b-cell acute lymphoblastic leukemia",
        "date": "06062017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says FDA sets advisory committee meeting CTL019 "
    },
    {
        "content": "* Novartis drug Tasigna receives EU approval for inclusion of treatment-free remission (TFR) data in product label Source text for Eikon: Further company coverage: (Reporting By Zurich newsroom)",
        "date": "06062017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says Tasigna receives EU approval for inclusion of TFR data in product label "
    },
    {
        "content": "* Bristol-Myers Squibb announces new collaboration to evaluate combination therapy in colorectal cancer",
        "date": "06052017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Bristol-Myers Squibb announces new collaboration to evaluate combination therapy in colorectal cancer "
    },
    {
        "content": "* Novartis announces clinical collaboration with Bristol-Myers Squibb to evaluate potential treatments in metastatic colorectal cancer Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis announces clinical collaboration with Bristol-Myers Squibb "
    },
    {
        "content": "ZURICH Novartis  does not need a big acquisition to kick-start growth  Chief Executive Joe Jimenez told investors on Wednesday  playing down suggestions he could use proceeds from a slew of asset sales for a significant takeover.",
        "date": "05312017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis CEO sees no need for big takeover "
    },
    {
        "content": "ZURICH  June 5 Novartis has agreed to work with IBM Watson Health to explore ways to use patient data and advanced analysis to glean insights on the likely outcomes of breast cancer treatments  the Swiss drugmaker said on Monday.",
        "date": "06052017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis  IBM Watson Health team up for breast cancer project "
    },
    {
        "content": "* Expects Trump proposals on drug prices in 3 months (Recasts to focus on M&A)",
        "date": "05312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Novartis CEO sees no need for big takeover "
    },
    {
        "content": "* Novartis CEO Joe Jimenez says there has been no change to plans for the Swiss drugmaker's Roche stake",
        "date": "05312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says book value of current Alcon division is around $21 bln "
    },
    {
        "content": "* Says 2017 u.s. Launch of ms drug glatopa 40 mg still possible  but unlikely after facility problems",
        "date": "05312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says BAF312 filing planned for H1 2018 in relapsing MS "
    },
    {
        "content": "ZURICH As Novartis  considers asset sales that could raise $50 billion  investors are worried any cash raised may give the Swiss drugmaker firepower for another unsuccessful megadeal.",
        "date": "05312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis has assets to sell  investors wary of what it might buy "
    },
    {
        "content": "ZURICH  May 31 Novartis continues to review \"all options\" for its struggling Alcon eyecare unit  with a status update over what it will do with the business still expected by the end of the year  it said on Wednesday.",
        "date": "05312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis continues to review 'all options' for Alcon unit "
    },
    {
        "content": "* Novartis says  car-t cell therapy ctl119 combined with ibrutinib in pilot study shows high rate of responses in cll patients Source text for Eikon: Further company coverage: (Reporting by John Miller)",
        "date": "05312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis: CAR-T therapy CTL119 combo had high response rate in CLL "
    },
    {
        "content": "ZURICH  May 30  As Novartis considers asset sales that could raise $50 billion  investors are worried any cash raised may give the Swiss drugmaker firepower for another unsuccessful megadeal.",
        "date": "05302017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "RPT-Novartis has assets to sell  investors wary of what it might buy "
    },
    {
        "content": "* Novartis receives FDA approval for expanded use of zykadia® in first-line alk-positive metastatic non-small cell lung cancer (nsclc) Source text for Eikon: Further company coverage:",
        "date": "05262017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis' Zykadia wins FDA approval as initial therapy for type of lung cancer "
    },
    {
        "content": "ZURICH  May 30  As Novartis considers asset sales that could raise $50 billion  investors are worried any cash raised may give the Swiss drugmaker firepower for another unsuccessful megadeal.",
        "date": "05302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis has assets to sell  investors wary of what it might buy "
    },
    {
        "content": "ZURICH  May 30 The Swiss blue-chip SMI was seen opening 0.1 percent lower at 9 024 points on Tuesday  according to premarket indications by bank Julius Baer .",
        "date": "05302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Swiss stocks - Factors to watch on May 30 "
    },
    {
        "content": "* Novartis' new analyses reinforce the potential of Ultibro Breezhaler for COPD patients historically treated with steroids Source text for Eikon: Further company coverage: (Reporting By Zurich newsroom)",
        "date": "05232017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says analyses reinforce potential of Ultibro Breezhaler for COPD patients "
    },
    {
        "content": "ZURICH  May 19 Novartis's push to win approval for Zykadia as an initial treatment for a type of lung cancer got a lift on Friday with a positive recommendation from the European Medicines Agency's Committee for Medicinal Products for Human Use (CHMP).",
        "date": "05192017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "CHMP backs Novartis's Zykadia for first-line use in lung cancer "
    },
    {
        "content": "ZURICH  May 18 Novartis plans to cut or transfer around 500 traditional production and development jobs at Swiss sites over the next 18 months and add 350 others  mostly in its biotech business  the drugmaker said on Thursday.",
        "date": "05182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis to cut around 500 jobs in Switzerland  add 350 "
    },
    {
        "content": "* Novartis -data at ASCO  ICML and EHA meetings demonstrate meaningful advancements in cancer care- updated analyses from Kisqali pivotal phase iii monaleesa-2 trial Source text for Eikon: Further company coverage:",
        "date": "05182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis updates analyses from Kisqali pivotal late-stage trial "
    },
    {
        "content": "* Novartis receives FDA approval for first-of-its-kind Kisqali® Femara® co-pack for initial treatment of hr+/her2- advanced or Metastatic breast cancer Source text for Eikon: Further company coverage:",
        "date": "05082017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis receives FDA approval for first-of-its-kind kisqali femara co-pack for initial treatment of hr+/her2- advanced or metastatic breast cancer "
    },
    {
        "content": "May 8 Durect Corp said on Monday it signed an up to $293 million deal with Swiss drugmaker Novartis AG's Sandoz unit to develop and market Durect's experimental non-opioid pain relief therapy  posimir  in the United States.",
        "date": "05082017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "CORRECTED-Durect  Novartis' Sandoz ink deal to develop non-opioid pain drug "
    },
    {
        "content": "* Celyad grants to Novartis a non-exclusive license for its allogeneic TCR-Deficient CAR-T Cells Patents",
        "date": "05022017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Celyad grants to Novartis a non-exclusive license for its allogeneic TCR-Deficient CAR-T Cells Patents "
    },
    {
        "content": "ZURICH  May 4 Novartis is exercising its option with Conatus Pharmaceuticals for an exclusive license for the global development and commercialization of emricasan for treating liver disease NASH  the Swiss drugmaker said.",
        "date": "05042017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis exercises option with Conatus for NASH product "
    },
    {
        "content": "May 4 French gene therapy start-up Vivet Therapeutics said on Thursday it had raised 37.5 million euros ($41 million) in an initial financing round  with backing from the venture arms of Swiss drugmakers Novartis and Roche .",
        "date": "05042017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis  Roche back French gene therapy start-up Vivet "
    },
    {
        "content": "April 28 The U.S. Food and Drug Administration on Friday approved Novartis AG's Rydapt as an initial treatment for acute myeloid leukemia (AML).",
        "date": "04282017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "U.S. FDA approves Novartis' leukemia treatment "
    },
    {
        "content": "April 28 The U.S. Food and Drug Administration approved Novartis AG's Rydapt as an initial treatment for acute myeloid leukemia (AML) as well as certain other blood disorders  the agency said on Friday.",
        "date": "04282017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-U.S. FDA approves Novartis' leukemia treatment "
    },
    {
        "content": "ZURICH  April 25 Novartis said on Tuesday it would accelerate its bid to win approval for its experimental multiple sclerosis (MS) drug BAF312 and said it was now targeting patients at an earlier stage of the neurological disease.",
        "date": "04252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis to speed up bid for MS drug approval  changes target "
    },
    {
        "content": "* Amgen announces expanded commercial collaboration with Novartis for erenumab in migraine",
        "date": "04242017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Amgen announces expanded commercial collaboration with Novartis for erenumab in migraine "
    },
    {
        "content": "ZURICH Novartis reported better-than-expected first-quarter profits on Tuesday with Chief Executive Joe Jimenez saying he remained confident the Swiss drugmaker would return to growth in 2018 as spending to promote new drugs pays off.",
        "date": "04252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis sets sights on return to growth in 2018 "
    },
    {
        "content": "April 24 Eli Lilly and Co said the combination of its experimental breast cancer drug and a commonly used treatment met the main goal of a late-stage study in an interim analysis  setting the stage for a regulatory submission later this year.",
        "date": "04242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Lilly reports positive interim data on breast cancer combo drug "
    },
    {
        "content": "* Advances MS drug BAF312 filing date to 2018 from 2019 (Adds $200 mln hit from drug trial failure  closing share price)",
        "date": "04252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 3-Novartis sets sights on return to growth in 2018 "
    },
    {
        "content": "SAO PAULO  April 24 Johnson & Johnson  Novartis AG and Takeda Pharmaceutical Co Ltd are in talks with the controlling bloc of Brazilian drugmaker Hypermarcas SA for a buyout  two people with knowledge of the matter said on Monday.",
        "date": "04242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "J&J  Novartis and Takeda in talks for Brazil's Hypermarcas  sources say "
    },
    {
        "content": "* CFO Harry Kirsch says sales of the Swiss drugmaker's newly approved breast cancer drug Kisqali to be modest in the first half of 2017 before accelerating in the final six months",
        "date": "04252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis's Sandoz head says sees generics price pressure in China "
    },
    {
        "content": "* CEO Joe Jimenez says thinks with Cosentyx \"we can hold our own\" against lilly drug taltz",
        "date": "04252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis CEO says takeover prices have risen  focusing on early-stage targets "
    },
    {
        "content": "ZURICH  April 25 Novartis's first-quarter core net income fell 4 percent  it said on Tuesday  as the Swiss drugmaker's spending to kick start sales at its eyecare unit Alcon and for its heart failure drug Entresto weighed again on earnings.",
        "date": "04252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis Q1 profit slips as spending on Alcon  Entresto continue "
    },
    {
        "content": "Swiss drugmaker Novartis AG will go to court on Monday to defend its blockbuster multiple sclerosis drug Gilenya against would-be generic competitors.",
        "date": "04212017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis to defend Gilenya patent rights against generic challengers "
    },
    {
        "content": "* Parvus therapeutics announces exclusive worldwide license and collaboration agreement for development and commercialization of its lead nanomedicine to treat type 1 diabetes",
        "date": "04192017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Parvus Therapeutics announces license and collaboration agreement of its lead nanomedicine to treat type 1 diabetes "
    },
    {
        "content": "April 19 Verily  Alphabet Inc's life sciences business  said it was launching a four-year study with about 10 000 participants to understand how people transition from being healthy to becoming sick  and to identify additional risk factors for diseases.",
        "date": "04192017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Alphabet's Verily unit launches study to track health data "
    },
    {
        "content": "ZURICH  April 18 Novartis's push into oncology and liver disease  two of its treatment priorities  advanced on Monday as the Swiss drugmaker won a second U.S. breakthrough tag for its cancer gene therapy while striking a separate pact with Allergan.",
        "date": "04182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis advances with push on cancer and liver disease "
    },
    {
        "content": "* Announced it has entered into a clinical trial agreement with Novartis to conduct a phase 2b study  using Allergan's Cenicriviroc",
        "date": "04182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Allergan says it has entered into a clinical trial agreement with Novartis to conduct a phase 2b study "
    },
    {
        "content": "* Novartis car-t cell therapy ctl019 receives FDA breakthrough therapy designation for treatment of adult patients with r/r DLBCL",
        "date": "04182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis' Cart-T Therapy CTl019 gets FDA breakthrough therapy designation "
    },
    {
        "content": "* Torrent Pharmaceuticals clarifies on news item 'torrent close to buying women healthcare portfolio of Swiss pharma major Novartis'",
        "date": "04112017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Torrent Pharma says it had signed deals with Novartis AG to buy generic pharmaceutical products "
    },
    {
        "content": "In a win for three generic drugmakers  a federal appeals court on Wednesday held that Novartis’ patent on the blockbuster multiple sclerosis drug Gilenya was invalid.",
        "date": "04122017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Federal Circuit rules Novartis multiple sclerosis drug patent invalid "
    },
    {
        "content": "A federal appeals court on Tuesday upheld a decision that invalidated Novartis AG's patents on the Exelon skin patch for Alzheimer's disease  clearing the way for Noven Pharmaceuticals Inc to launch a generic version of the drug.",
        "date": "04042017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Appeals court nixes Novartis patents on dementia treatment "
    },
    {
        "content": "ZURICH  April 4 The Swiss blue-chip SMI was seen opening 0.2 percent higher at 8 651 points on Tuesday  according to premarket indications by bank Julius Baer .",
        "date": "04042017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Swiss stocks - Factors to watch on April 4 "
    },
    {
        "content": "Novartis AG on Friday filed a patent infringement lawsuit seeking to block Mylan Inc from launching a generic version of cancer drug Afinitor.",
        "date": "04072017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis sues Mylan over generic version of cancer drug Afinitor "
    },
    {
        "content": "* Novartis to strengthen research and development pipeline by in-licensing ECF843 for ophthalmic indications",
        "date": "04062017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis to in-license ECF843 for ophthalmic indications "
    },
    {
        "content": "* Sunovion Pharmaceuticals  US licensee of group's partner Novartis AG launched Utibron Neohaler in US",
        "date": "04032017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Vectura says US licensee of group's partner Novartis AG launched Utibron Neohaler in US "
    },
    {
        "content": "* Novartis drug combination Tafinlar + Mekinist receives EU approval for BRAF v600-positive advanced non-small cell lung cancer (NSCLC) Source text for Eikon: [https://www.marktpuls.ch/artikel/permalink/219713 ] Further company coverage: (Reporting by Zurich Newsroom)",
        "date": "04032017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says drug combination Tafinlar + Mekinist receives EU approval "
    },
    {
        "content": "ZURICH A new leukemia treatment from Novartis for children and young adults will get priority review from the U.S. Food and Drug Administration (FDA)  putting the Swiss drugmaker ahead of rivals working on similar cancer therapies.",
        "date": "03302017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis wins speedy U.S. review of new leukemia drug "
    },
    {
        "content": "* CTL019's complex logistics likely to slow sales - analysts (Adds shares of Oxford BioMedica  analyst comment)",
        "date": "03302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis wins speedy U.S. review of new leukaemia drug "
    },
    {
        "content": "* Oxford Biomedica notes acceptance by FDA of a biologics license application (BLA) filing for CTL019",
        "date": "03302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Oxford Biomedica notes acceptance by FDA of a biologics license application filing for CTL019 "
    },
    {
        "content": "ZURICH  March 30 Novartis AG on Wednesday said the U.S. Food and Drug Administration (FDA) has agreed to accelerate its review of the Swiss drugmaker's CTL019 therapy for young patients with B-cell acute lymphoblastic leukemia.",
        "date": "03302017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis says U.S. regulator grants speedy review of CAR-T cell therapy "
    },
    {
        "content": "ZURICH Novartis's heart failure drug serelaxin flopped in a late-stage trial by not cutting cardiovascular death or slowing disease progression  marking the likely demise of a drug hopeful the Swiss firm had promoted as a potential blockbuster.",
        "date": "03222017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis heart drug portfolio hit by failed serelaxin study "
    },
    {
        "content": "* Analysts say failure puts added pressure on Entresto franchise",
        "date": "03222017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Novartis heart drug portfolio hit by failed serelaxin study "
    },
    {
        "content": "ZURICH Novartis has won U.S. Food and Drug Administration approval for Kisqali to treat postmenopausal women who have a difficult-to-treat form of breast cancer  challenging U.S. rival Pfizer's Ibrance.",
        "date": "03142017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis wins U.S. approval for breast cancer drug; to compete with Pfizer's Ibrance "
    },
    {
        "content": "ZURICH  March 13 Novartis on Monday won U.S. Food and Drug Administration approval for Kisqali to treat postmenopausal women with a difficult-to-treat form of breast cancer  challenging Pfizer's fast-growing Ibrance.",
        "date": "03132017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis wins FDA approval for breast cancer drug aiming for Pfizer's Ibrance "
    },
    {
        "content": "March 13 Novartis AG said on Monday that the U.S. Food and Drug Administration had approved the company's experimental drug  kisqali  as a first-line treatment for a type of breast cancer in postmenopausal women  in combination with another breast cancer drug.",
        "date": "03132017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "FDA approves Novartis drug as first-line treatment for breast cancer "
    },
    {
        "content": "* Consensus forecasts point to sales of $1.5 bln by 2022   (Adds analyst comment  Novartis response  Astex Pharma role)",
        "date": "03142017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis wins U.S. approval for breast cancer drug; to compete with Pfizer's Ibrance "
    },
    {
        "content": "ZURICH Novartis is making progress in its bid to catch rivals developing drugs that harness the immune system to fight cancer  one of its top research scientists and latest recruit from Harvard University told Reuters in an interview.",
        "date": "03012017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis cancer division races to catch up with rivals "
    },
    {
        "content": "* Chairman Joerg Reinhardt told shareholders at the Swiss drugmaker's annual general meeting that he sees Google lens project as \"high risk project\"",
        "date": "02282017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis Chairman: No decision yet on Alcon's future "
    },
    {
        "content": "ZURICH  Feb 24 Swiss drugmaker Novartis's  drugs Tafinlar and Mekinist edged closer to approval in Europe to be used together against a type of lung cancer after a key committee on Friday published a recommendation to expand the combination's indications.",
        "date": "02242017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis wins CHMP nod for drug combo against some lung cancers "
    },
    {
        "content": "ZURICH  Feb 23 The U.S. Food and Drug Administration (FDA) has granted priority review to Novartis  drug Zykadia as a first-line treatment for some lung cancer patients  the Swiss drugmaker said on Thursday.",
        "date": "02232017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis cancer drug Zykadia gets FDA priority review "
    },
    {
        "content": "* Novartis drug zykadia receives fda priority review for first-line use in patients with alk+ metastatic nsclc",
        "date": "02232017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says Zykadia drug gets FDA priority review "
    },
    {
        "content": "Feb 14 Merck & Co Inc said on Tuesday it will halt a late-stage trial of an Alzheimer's drug after it was determined that it had no chance of working  marking the latest in a long line of crushing disappointments in efforts to find an effective treatment for the mind-wasting disease.",
        "date": "02142017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Merck stopping late stage study as another Alzheimer's drug fails "
    },
    {
        "content": "LONDON  Feb 6 Emma Walmsley  GlaxoSmithKline's  incoming CEO  will take over Britain's biggest drugmaker at a challenging time but the 47-year-old also inherits the flexibility to do deals and make key choices on new drugs.",
        "date": "02062017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "New GlaxoSmithKline CEO prepares for R&D choices  potential deals "
    },
    {
        "content": "ZURICH  Jan 26 Moody's cut Novartis's  debt rating outlook on Thursday to negative from stable  saying the Swiss drugmaker's borrowing capacity would be weakened by its debt-financed share buyback at a time of stagnating sales.",
        "date": "01262017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Moody's puts Novartis on notice over debt-funded buyback plan "
    },
    {
        "content": "ZURICH Novartis has broadened the indications for its Votubia drug  the company said on Tuesday  when the European Union approved its use to treat refractory partial-onset seizures in patients with tuberous sclerosis complex.",
        "date": "01312017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis says Votubia receives EU approval for new indication "
    },
    {
        "content": "* Says Alcon launches new trifocal toric intraocular lens for patients with astigmatism undergoing cataract surgery   Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "01262017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says Alcon launches new lens for astigmatism "
    },
    {
        "content": "ZURICH  Jan 31 Novartis has broadened the indications for its Votubia drug  the company said on Tuesday  when the European Union approved its use to treat refractory partial-onset seizures in patients with tuberous sclerosis complex.",
        "date": "01312017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "REFILE-Novartis says Votubia receives EU approval for new indication "
    },
    {
        "content": "* Says elevates cart therapy ctl019 to group of drugs it expects will be blockbusters  with at least $1 billion in annual sales",
        "date": "01252017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis expects CART therapy CTL019 to exceed $1 bln in annual sales "
    },
    {
        "content": "DAVOS  Switzerland Donald Trump's plans to cut U.S. corporate tax rates could trigger increased investment in the United States by Novartis  its chief executive told Reuters  despite the president-elect's recent harsh words on drug prices.",
        "date": "01182017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Trump tax cuts could mean more Novartis investment in U.S. "
    },
    {
        "content": "* Alcon unit head says fixing supply  service issues 'more challenging than originally imagined'",
        "date": "01252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis's Alcon head expects op. profit to hit trough in 2017 "
    },
    {
        "content": "* Novartis CEO Jimenez tells CNBC there is going to be downward pressure on pharma prices",
        "date": "01182017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis CEO says sees downward pressure on pharma prices -CNBC "
    },
    {
        "content": "ZURICH  Jan 25 The Novartis copy of Amgen's blockbuster psoriasis drug Enbrel will not go on sale before 2018 at the earliest because of the U.S. company's patent protection challenge  the Swiss drugmaker's head of generics told Reuters.",
        "date": "01252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis says court battle will delay its Enbrel copy until 2018 at least "
    },
    {
        "content": "* Cfo says plans to finance $5 billion share buyback with debt",
        "date": "01252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis CEO plans to meet with US President Trump  no date set "
    },
    {
        "content": "BASEL  Switzerland Swiss drugmaker Novartis  said on Wednesday it will buy back up to $5 billion worth of shares over the next 12 months and may spin off the Alcon eye care business as it navigates a tough year before an expected return to growth in 2018.",
        "date": "01252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis launches $5 billion share buyback  mulls Alcon spin-off "
    },
    {
        "content": "ZURICH Novartis  Chief Executive Joe Jimenez said prices for large acquisitions are looking expensive  pushing the company to instead seek smaller targets with early-stage drugs that the Swiss pharmaceutical group hopes will supplement its pipeline.",
        "date": "01252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis CEO: 'The bigger the target  the higher the premium' "
    },
    {
        "content": "Jan 25 Novartis  lagging some other big drugmakers in the first wave of immunotherapy drugs that are revolutionising cancer treatment  hopes to catch up by focusing on the next wave of immune system-boosting medicines.",
        "date": "01252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis chases rivals with next wave of cancer immunotherapy "
    },
    {
        "content": "BASEL  Switzerland  Jan 25 Swiss drugmaker Novartis said on Wednesday it will buy back up to $5 billion worth of shares over the next 12 months and may spin off the Alcon eye care business as it navigates a tough year before an expected return to growth in 2018.",
        "date": "01252017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 3-Novartis launches $5 bln share buyback  mulls Alcon spin-off "
    },
    {
        "content": "ZURICH  Jan 6 Novartis has agreed with Ionis Pharmaceuticals Inc and its affiliate Akcea Therapeutics Inc to license two experimental treatments that aim to reduce cardiovascular risk in patients with high levels of lipoproteins  the Swiss drugmaker said on Friday.",
        "date": "01062017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis joins forces with Ionis on cardiovascular treatments "
    },
    {
        "content": "ATHENS Greek prosecutors have raided the Athens offices of Swiss drugmaker Novartis  as part of a probe into bribery allegations  a court official told Reuters on Wednesday.",
        "date": "01042017",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Greek prosecutor raids Novartis Athens offices in bribery probe "
    },
    {
        "content": "ZURICH  Jan 6 Novartis has agreed with Ionis Pharmaceuticals Inc and its affiliate Akcea Therapeutics Inc to license two experimental cardiovascular treatments in a deal which Ionis said could eventually be worth more than $1 billion.",
        "date": "01062017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis joins forces with Ionis on cardiovascular treatments "
    },
    {
        "content": "ZURICH Gilead Sciences has hired a top cancer specialist from Swiss drugmaker Novartis as the U.S. healthcare group sharpens its focus on oncology.",
        "date": "01042017",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Gilead poaches Novartis cancer specialist Riva "
    },
    {
        "content": "Swiss drug maker Novartis AG said on Tuesday it had reached a definitive agreement to acquire Fort Worth  Texas-based Encore Vision  which is focused on developing a novel treatment in presbyopia  or far-sightedness.",
        "date": "12202016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis reaches agreement to buy Texas-based Encore Vision "
    },
    {
        "content": "Swiss drugmaker Novartis on Monday said it signed a licensing deal to co-develop a fatty liver disease drug with Conatus Pharmaceuticals Inc  under which the small U.S. company will receive $50 million up front.",
        "date": "12192016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Conatus to receive $50 million in liver drug deal with Novartis "
    },
    {
        "content": "ZURICH Novartis is buying privately held drugmaker Ziarco Group for an undisclosed sum to gain access to its investigational eczema medicine  the Swiss pharmaceutical giant said on Friday.",
        "date": "12162016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis says buys Ziarco Group to expand skin care portfolio "
    },
    {
        "content": "ZURICH Novartis's bid to bolster its eye drug portfolio suffered a setback on Monday when it announced combining Lucentis with Fovista in patients with neovascular age-related macular degeneration (nAMD) did not produce better outcomes than treatment with Lucentis alone.",
        "date": "12122016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis eye drug franchise hit by failed Fovista studies "
    },
    {
        "content": "Novartis AG said its cancer drug  Zykadia  was twice as effective as chemotherapy in slowing the progression of a rare form of lung cancer in a late-stage study.",
        "date": "12062016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis' drug tops chemotherapy in untreated lung cancer patients "
    },
    {
        "content": "Pfizer Inc said on Monday its cancer drug  Bosulif  was found superior to Novartis AG's Gleevec in a late-stage study on untreated patients with a form of blood and bone marrow cancer characterized by abnormal white blood cells production.",
        "date": "12052016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Pfizer blood cancer drug tops standard therapy for untreated patients "
    },
    {
        "content": "ZURICH Novartis is in talks about the sale of some older neuroscience drugs  people close to the matter said  as the Swiss drugmaker clears the decks to concentrate on promising new medicines it hopes will help to restore sales growth.",
        "date": "12062016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Exclusive: Novartis in talks to sell some central nervous system drugs - sources "
    },
    {
        "content": "VIENNA Novartis Chief Executive Joe Jimenez has played down suggestions the Swiss drugmaker could bid for Swiss biotech group Actelion  which is in talks with U.S. healthcare group Johnson & Johnson about a transaction.",
        "date": "12042016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis CEO plays down prospects for Actelion bid: Blick "
    },
    {
        "content": "An experimental cancer therapy being developed by Novartis AG eliminated an aggressive form of blood cancer in 82 percent of children and young adults treated with modified immune cells in a mid-stage trial  the company said on Saturday.",
        "date": "12042016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis says 82 percent of leukemia patients in remission after CAR-T "
    },
    {
        "content": "ZURICH/FRANKFURT U.S. healthcare company Johnson & Johnson  said on Friday it was in preliminary talks with Actelion  about a potential takeover of Europe's largest biotech firm  currently valued at about $20 billion.",
        "date": "11262016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Johnson & Johnson approaches Actelion about takeover deal "
    },
    {
        "content": "ZURICH Novartis  is buying U.S.-based Selexys Pharmaceuticals in a deal worth up to $665 million  the Swiss drugmaker said on Monday  expanding its pipeline of medicines to combat blood diseases.",
        "date": "11212016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis buys U.S. blood disease drugmaker in $665 million deal "
    },
    {
        "content": "ZURICH/FRANKFURT  Nov 25 U.S. healthcare company Johnson & Johnson said on Friday it was in preliminary talks with Actelion about a potential takeover of Europe's largest biotech firm  currently valued at about $20 billion.",
        "date": "11262016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 4-Johnson & Johnson approaches Actelion about takeover deal "
    },
    {
        "content": "* Study results for drug being acquired due Dec. 4   (Adds analyst comment  details  background  shares)",
        "date": "11212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis buys US blood disease drugmaker in $665 mln deal "
    },
    {
        "content": "ZURICH  Nov 21 Novartis said on Monday it was buying U.S.-based Selexys Pharmaceuticals in a deal worth up to $665 million  as the Swiss drugmaker expands its pipeline of medicines to combat blood diseases.",
        "date": "11212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis says to pay up to $665 mln for U.S. blood disease drugmaker "
    },
    {
        "content": "MILAN  Nov 21 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "11212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "European shares seen slightly higher. For stock movers and more see the LiveMarkets blog "
    },
    {
        "content": "Amgen Inc and Novartis said late on Wednesday that episodic migraine sufferers reported fewer debilitating headaches per month after using the companies' investigational drug erenumab  compared to trial participants who got a placebo.",
        "date": "11172016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Amgen  Novartis aim for big  crowded migraine market after new drug data "
    },
    {
        "content": "ZURICH  Nov 14 Signals from Swiss drugmaker Novartis that it could unload its struggling Alcon eyecare business is the latest step in dismantling former leader Dan Vasella's vision of building a European healthcare giant.",
        "date": "11142016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "The Novartis house that Vasella built gets extreme makeover "
    },
    {
        "content": "VIENNA  Nov 13 Drugmaker Novartis is considering to sell its struggling Alcon eye care division  its chairman said in an interview with Swiss weekly SonntagsZeitung.",
        "date": "11132016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis chairman says considering sale of Alcon eye care division "
    },
    {
        "content": "ZURICH  Nov 15 Signals from Swiss drugmaker Novartis that it could unload its struggling Alcon eyecare business is the latest step in dismantling former leader Dan Vasella's vision of building a European healthcare giant.",
        "date": "11152016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "RPT-The Novartis house that Vasella built gets extreme makeover "
    },
    {
        "content": "ZURICH  Nov 18 Novartis has abandoned a 2016 goal to start testing its autofocus contact lens on people  though it said the groundbreaking product it is making with internet giant Google is \"progressing steadily.\"",
        "date": "11182016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis backs off from 2016 date for testing Google autofocus lens "
    },
    {
        "content": "Nov 16 Amgen Inc and Novartis  said late on Wednesday that episodic migraine sufferers reported fewer debilitating headaches per month after using the companies' investigational drug erenumab  compared to trial participants who got a placebo.",
        "date": "11172016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Amgen  Novartis aim for big  crowded migraine market after new drug data "
    },
    {
        "content": "* Says EMA also accepted PKC412 (midostaurin) file for review",
        "date": "11142016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis drug PKC412 granted FDA priority review for newly-diagnosed flt3-mutated aml and advanced systemic mastocytosis "
    },
    {
        "content": "* Says innovative study with three treatment switches confirms sandoz biosimilar etanercept has equivalent efficacy to originator  Source text for Eikon:  Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "11182016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis - study confirms etanercept has equivalent efficacy to originator "
    },
    {
        "content": "ZURICH Novartis's investigational drug PKC 412 won U.S. Food and Drug Administration priority review  the Swiss drugmaker said on Monday  keeping up momentum after the prospective treatment for a fast-growing form of leukemia garnered breakthrough therapy status this year.",
        "date": "11142016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis leukemia drug wins FDA priority review "
    },
    {
        "content": "ZURICH  Nov 14 Novartis's  investigational drug PKC 412 won U.S. Food and Drug Administration priority review  the Swiss drugmaker said on Monday  keeping up momentum after the prospective treatment for a fast-growing form of leukaemia garnered breakthrough therapy status this year.",
        "date": "11142016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis leukaemia drug wins FDA priority review "
    },
    {
        "content": "ZURICH  Nov 10 Shares in Swiss-listed drugmaker Cosmo Pharmaceuticals jumped more than 10 percent on Thursday after it reported its dye tablets helped doctors detect intestinal growths during colonoscopies.",
        "date": "11102016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "CORRECTED-Cosmo shares jump on colonoscopy trial results "
    },
    {
        "content": "* Says cosentyx data shows long-lasting efficacy in psoriatic arthritis over 3 years including patient-reported pain  Source text for Eikon:  Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "11142016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says Cosentyx data shows long-lasting efficacy "
    },
    {
        "content": "* Says pkc412 (midostaurin) granted FDA priority review for newly-diagnosed flt3-mutated aml and advanced systemic mastocytosis",
        "date": "11142016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis gets FDA priority review status for PKC412 "
    },
    {
        "content": "LONDON  Nov 10 U.S. drugmaker Pfizer  said on Wednesday it had won approval from the European Union for its best-selling breast cancer drug Ibrance  making it the first medicine of its kind to reach the European market.",
        "date": "11102016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Pfizer wins EU's approval for Ibrance as Novartis readies rival drug "
    },
    {
        "content": "LONDON  Nov 10 Novartis and Pfizer  have won approval for two cancer drugs to be used routinely on Britain's National Health Service after offering bigger price discounts.",
        "date": "11102016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis  Pfizer cut prices to win UK approval for cancer drugs "
    },
    {
        "content": "* Announced reduction in force of approximately 48% percent  which company expects to be substantially completed by end of 2016",
        "date": "11032016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Cerulean Pharma reports Q3 2016 financial results "
    },
    {
        "content": "ZURICH The U.S. Food and Drug Administration gave fast-track review status to Novartis's medication ribociclib in first-line treatment of postmenopausal women with advanced breast cancer as the Swiss company seeks to challenge Pfizer's Ibrance drug.",
        "date": "11012016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis breast cancer drug gets FDA fast track  takes on Pfizer "
    },
    {
        "content": "ZURICH  Nov 1 The U.S. Food and Drug Administration gave fast-track review status to Novartis's  medication ribociclib in first-line treatment of postmenopausal women with advanced breast cancer as the Swiss company seeks to challenge Pfizer's Ibrance drug.",
        "date": "11012016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis breast cancer drug gets FDA fast track  takes on Pfizer "
    },
    {
        "content": "ZURICH  Nov 1 The U.S. Food and Drug Administration has granted priority review status for Novartis  drug LEE011 (ribociclib) as a first-line treatment of postmenopausal women with hormone-receptor positive  human epidermal growth factor receptor-2 negative (HR+/HER2-) advanced or metastatic breast cancer in combination with letrozole  the Swiss drugmaker said on Tuesday.",
        "date": "11012016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis's LEE011 gets FDA fast track in advanced breast cancer "
    },
    {
        "content": "ZURICH Novartis'  struggling Alcon eye care division will take longer to turn around than expected  the Swiss drugmaker's Chief Executive Joe Jimenez warned on Tuesday as he reported a smaller than forecast fall in third quarter net income.",
        "date": "10252016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis focus on still-ailing Alcon shifts to 2017 "
    },
    {
        "content": "* Q3 sales down 1 pct at $12.1 bln  lagging poll   (Recasts  adds CEO comment  analysts  background)",
        "date": "10252016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Novartis focus on still-ailing Alcon shifts to 2017 "
    },
    {
        "content": "ZURICH  Oct 25 Swiss drugmaker Novartis  said on Tuesday third-quarter core net income fell 4 percent  as sales of cancer drug Gleevec continued to decline after patent expiration  and amid efforts to rejuvenate its slumping Alcon eye care division.",
        "date": "10252016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis says Q3 profit slipped 4 percent  hurt by Alcon "
    },
    {
        "content": "* Cerulean Pharma Inc says company has entered into a strategic collaboration with Novartis",
        "date": "10192016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Cerulean Pharma and Novartis enter strategic collaboration "
    },
    {
        "content": "COPENHAGEN  Oct 8 An experimental Novartis  pill given with an older drug kept advanced breast cancer in check far longer than standard treatment alone  putting it on track to challenge Pfizer's blockbuster Ibrance  data showed on Saturday.",
        "date": "10082016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis challenges Pfizer with strong breast cancer drug data "
    },
    {
        "content": "* Study leader says both drugs show very similar results   (Adds further comment from study leader  more on sales prospects)",
        "date": "10082016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis challenges Pfizer with strong breast cancer drug data "
    },
    {
        "content": "ZURICH Novartis's psoriasis drug Cosentyx showed long-term efficacy in keeping patients' skin clear  the Swiss drugmaker said on Saturday  citing a study it hopes will ultimately help the company to win business from rival medicines made by Amgen and Johnson & Johnson.",
        "date": "10012016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis psoriasis drug maintains efficacy after four years: study "
    },
    {
        "content": "ZURICH  Oct 1 Novartis's psoriasis drug Cosentyx showed long-term efficacy in keeping patients' skin clear  the Swiss drugmaker said on Saturday  citing a study it hopes will ultimately help the company to win business from rival medicines made by Amgen and Johnson & Johnson .",
        "date": "10012016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis psoriasis drug maintains efficacy after 4 years - study "
    },
    {
        "content": "LONDON  Sept 29 GlaxoSmithKline has promoted a former Novartis executive to lead its consumer healthcare business  following the appointment last week of the unit's previous head  Emma Walmsley  as CEO designate of the drugmaker.",
        "date": "09292016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "After CEO move  GSK picks ex-Novartis exec to head consumer unit "
    },
    {
        "content": "ZURICH Novartis is closing  some of its research operations  in Switzerland and China and cutting 175 jobs  part of the Swiss drug maker's effort to centralize control over its drug discovery programs and contain costs.",
        "date": "10052016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis reshapes research  closes some Swiss  Chinese units "
    },
    {
        "content": "Sept 29 Amgen Inc said on Thursday it would buy a stake in Arrowhead Pharmaceuticals Inc and collaborate with the company to develop gene-silencing therapies for heart disease.",
        "date": "09292016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Amgen  Arrowhead team up on gene-therapies for heart disease "
    },
    {
        "content": "* Tropical disease research moves to California from Singapore   (Updates with job loss figures  comment from Novartis about Shanghai research centre)",
        "date": "10052016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis reshapes research  closes some Swiss  Chinese units "
    },
    {
        "content": "ZURICH  Sept 29 The Swiss blue-chip SMI  was seen opening 0.6 percent higher at 8 273 points on Thursday  according to premarket indications by bank Julius Baer .",
        "date": "09292016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Swiss stocks - Factors to watch on Sept. 29 "
    },
    {
        "content": "* Tropical disease research moves to California from Singapore",
        "date": "10052016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis closes Swiss  Chinese centres in research revamp "
    },
    {
        "content": "* Says receives three new approvals from the U.S. Food and Drug Administration for expanded use of Ilaris treating rare periodic fever syndrome conditions.",
        "date": "09232016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says receives three new FDA approvals for expanded use of Ilaris treating rare periodic fever syndrome conditions "
    },
    {
        "content": "ZURICH  Sept 23 Novartis's Zykadia drug performed well against a rare form of lung cancer  the Swiss company said on Friday  citing a study it hopes will help it win expanded regulatory approval for the use of the drug.",
        "date": "09232016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "CORRECTED-UPDATE 1-Novartis's Zykadia gets positive results  faces Roche pressure "
    },
    {
        "content": "ZURICH Novartis's Zykadia drug performed well against a rare form of lung cancer  the Swiss company said on Friday  citing a study it hopes will help it win expanded regulatory approval for the use of the drug.",
        "date": "09232016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis's Zykadia gets positive results  faces Roche pressure "
    },
    {
        "content": "ZURICH  Sept 23 Novartis cancer drug Zykadia showed positive results in a phase III clinical trial in treating patients with a form of lung cancer  the Swiss drugmaker said on Friday.",
        "date": "09232016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis drug Zykadia gets positive trial results "
    },
    {
        "content": "ZURICH  Sept 19 Novartis on Monday intensified its bid to convince doctors to prescribe its heart failure drug Entresto  releasing an analysis that concluded the medicine contributed to higher quality of life scores compared with an older drug.",
        "date": "09192016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis intensifies Entresto push with new analysis "
    },
    {
        "content": "ZURICH  Sept 15 Novartis cannot rule out selling its Alcon eye care and surgery equipment division  its chief lawyer said on Thursday  helping fan speculation the Swiss drug company could offload a business that has been struggling to revitalise sales.",
        "date": "09152016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis says 'never say never' to Alcon disposal "
    },
    {
        "content": "Sept 15 Teva Pharmaceutical Industries Ltd  said on Thursday it was collaborating with Intel Corp  to develop a wearable technology platform to track the progression of disease in patients with Huntington's  a fatal degenerative disorder.",
        "date": "09152016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Teva  Intel to develop wearable tech for Huntington's disease "
    },
    {
        "content": "* Novartis has informed Genvec that it remains engaged on CGF166 program",
        "date": "09012016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Genvec says Novartis informed co that it remains engaged on CGF166 program "
    },
    {
        "content": "* Swiss drugmaker fighting Amgen on patents  regulatory hurdles",
        "date": "08312016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis bid to sell new biosimilar crimped by U.S. court battles "
    },
    {
        "content": "WASHINGTON The U.S. Food and Drug Administration on Tuesday approved Novartis AG's biosimilar version of Amgen Inc's arthritis drug Enbrel.",
        "date": "08302016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "FDA approves Novartis biosimilar to Amgen's Enbrel "
    },
    {
        "content": "WASHINGTON The U.S. Food and Drug Administration on Tuesday approved Novartis AG's biosimilar version of Amgen Inc's arthritis drug Enbrel.",
        "date": "08302016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "U.S. FDA approves Novartis biosimilar to Amgen's Enbrel "
    },
    {
        "content": "WASHINGTON  Aug 30 The U.S. Food and Drug Administration on Tuesday approved Novartis AG's  biosimilar version of Amgen Inc's arthritis drug Enbrel.",
        "date": "08302016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-U.S. FDA approves Novartis biosimilar to Amgen's Enbrel "
    },
    {
        "content": "ZURICH  Aug 25 Novartis AG said a late-stage study showed its oral  once-daily BAF312  or siponimod  reduced the risk of disability progression in a severe form of multiple sclerosis.",
        "date": "08252016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis announces positive phase III results for MS drug siponimod "
    },
    {
        "content": "ISTANBUL/ZURICH Turkey's investigation into Novartis is \"ongoing\"  a Turkish health ministry official told Reuters on Thursday  after the Swiss drugmaker said last week it was not under investigation over bribery allegations in Turkey.",
        "date": "08172016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Turkey's investigation into drugmaker Novartis 'ongoing': official "
    },
    {
        "content": "* Novartis says still sees matter as closed  making checks   (Updates to show Novartis no longer seeking information from Turkey)",
        "date": "08172016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 3-Turkey's investigation into drugmaker Novartis 'ongoing' -official "
    },
    {
        "content": "* Jacobs awarded contract for Novartis Biotechnology Center expansion in France",
        "date": "08112016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Jacobs wins contract for Novartis Biotechnology Center expansion "
    },
    {
        "content": "Canadian drugmaker Valeant Pharmaceuticals International Inc  on Monday named a new general counsel and announced the departure of its public relations head.",
        "date": "08082016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Valeant names new general counsel  says PR head to leave "
    },
    {
        "content": "ZURICH  Aug 3 Novartis AG breast cancer pill LEE011 has won breakthrough therapy designation from U.S. regulators as a first-line treatment for a form of advanced breast cancer  the Swiss drugmaker said on Wednesday.",
        "date": "08032016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis pill gets U.S. breakthrough designation in breast cancer "
    },
    {
        "content": "* Uses miniaturised implants attached to individual nerves   (Adds interview with executive  further details)",
        "date": "08012016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-GSK and Google parent forge $715 mln bioelectronic medicines firm "
    },
    {
        "content": "ZURICH Novartis warned on Tuesday its profit may decline this year as it ramps up marketing spending on new heart failure drug Entresto following a disappointing start for the medicine. | Video ",
        "date": "07192016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis warns 2016 profit may fall on higher heart drug spending "
    },
    {
        "content": "Novartis  is happy with the performance of its consumer health joint venture with GlaxoSmithKline   in which the Swiss drugmaker has a minority stake  and is in no rush to exit the collaboration early  its chief executive said.",
        "date": "07192016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis in no rush to sell down stake on GSK consumer venture "
    },
    {
        "content": "ZURICH  July 19 Switzerland's Novartis  the world's biggest maker of prescription drugs  will continue to invest in Britain  despite the country's decision to leave the European Union  its chief executive said on Tuesday.",
        "date": "07192016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis  world's top drugmaker  plays down Brexit threat "
    },
    {
        "content": "* Q2 net income $2.93 bln vs $2.83 bln consensus   (Adds further CEO and analyst comment  shares)",
        "date": "07192016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Novartis warns 2016 profit may fall on higher heart drug spending "
    },
    {
        "content": "Novartis AG's cheaper version of Amgen Inc's arthritis drug Enbrel is highly similar in potency and safety to the original and should be approved  an advisory panel to the U.S. Food and Drug Administration concluded on Wednesday.",
        "date": "07132016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "FDA panel supports Novartis version of Amgen arthritis drug "
    },
    {
        "content": "Novartis AG's cheaper version of Amgen Inc's blockbuster arthritis drug Enbrel is highly similar in potency and safety to the original  according to a review by Food and Drug Administration staff.",
        "date": "07112016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis copy of Amgen arthritis drug highly similar: FDA staff "
    },
    {
        "content": "July 13 Novartis AG's cheaper version of Amgen Inc's arthritis drug Enbrel is highly similar in potency and safety to the original and should be approved  an advisory panel to the U.S. Food and Drug Administration concluded on Wednesday.",
        "date": "07132016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-U.S. FDA panel supports Novartis version of Amgen arthritis drug "
    },
    {
        "content": "Novartis AG's cheaper version of Amgen Inc's blockbuster arthritis drug Enbrel is highly similar in potency and safety to the original  according to a review by Food and Drug Administration staff.",
        "date": "07112016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis copy of Amgen arthritis drug highly similar - FDA staff "
    },
    {
        "content": "July 11 Novartis AG's cheaper version of Amgen Inc's blockbuster arthritis drug Enbrel is highly similar in potency and safety to the original  according to a review by Food and Drug Administration staff.",
        "date": "07112016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 3-Novartis copy of Amgen arthritis drug highly similar -FDA staff "
    },
    {
        "content": "* Shares rise 4.4 percent at open following Novartis milestone payment for clinical trial  Source text for Eikon:  Further company coverage:",
        "date": "07042016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Morphosys shares up 4.4 pct after Novartis milestone payment "
    },
    {
        "content": "* Morphosys receives clinical milestone for start of phase 1 trial in prevention of thrombosis with novel antibody",
        "date": "07042016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Morphosys gets Novartis milestone payment for phase 1 trial "
    },
    {
        "content": "* Xencor announces strategic collaboration for bispecific programs  including XMAB 14045 and XMAB 13676",
        "date": "06282016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Xencor enteres into collaboration and license agreement with Novartis "
    },
    {
        "content": "* Roche Holding Ag says key priority is to ensure that UK environment continues to support scientific innovation and speedy access of innovative medicines for patients",
        "date": "06242016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis  Roche say too early to predict impact of Brexit vote "
    },
    {
        "content": "LONDON  June 16 Roche's two-drug combination of Cotellic and Zelboraf for melanoma was rejected by Britain's healthcare cost agency NICE as \"too expensive\" on Thursday  in contrast to the green light given in April to a rival cocktail from Novartis.",
        "date": "06162016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Roche skin cancer drugs \"too expensive\"  says UK cost agency "
    },
    {
        "content": "ZURICH  June 10 The Swiss blue-chip SMI  was seen opening unchanged at 8079 points on Friday  according to premarket indications by bank Julius Baer.",
        "date": "06102016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Swiss stocks - Factors to watch on June 10 "
    },
    {
        "content": "* Announces agreement with Medicines for Malaria Venture over terms and conditions for development of anti-malaria drug kaf156 and future availability to patients",
        "date": "06152016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis forges pact with Medicines for Malaria on new drug "
    },
    {
        "content": "BOGOTA Colombia will set a new price for the Novartis cancer drug imatinib in a bid to cut healthcare costs after price negotiations with the Swiss company broke down  the health minister said on Thursday.",
        "date": "06092016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Colombia to set new price for Novartis cancer drug: minister "
    },
    {
        "content": "BOGOTA  June 9 Colombia will set a new price for the Novartis cancer drug imatinib in a bid to cut healthcare costs after price negotiations with the Swiss company broke down  the health minister said on Thursday.",
        "date": "06092016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Colombia to set new price for Novartis cancer drug -minister "
    },
    {
        "content": "ZURICH  June 9 The Swiss blue-chip SMI  was seen opening 0.12 percent down at 8133.93 points on Thursday  according to premarket indications by bank Julius Baer .",
        "date": "06092016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Swiss stocks - Factors to watch on June 9 "
    },
    {
        "content": "* Reports 13.6 pct passive stake in Merus NV as of May 24  2016 SEC fiilng  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06032016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis reports 13.6 pct passive stake in Merus NV as of May 24  2016 "
    },
    {
        "content": "A Novartis trial of two drugs against an aggressive lung cancer bodes well for broadening their use beyond melanoma  the Swiss drugmaker told the American Society of Clinical Oncology's conference in Chicago on Monday. Novartis's Tafinlar and Mekinist combination shrank tumours in 63 percent of the trial's 57 people with BRAF V600E-mutation positive non-small cell lung cancer who had failed on chemotherapy  the company said  citing a Phase II study.",
        "date": "06062016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis study shows skin cancer combo also works on lungs "
    },
    {
        "content": "LONDON  June 6    Mereo BioPharma Group  a British company trialing three drugs developed by Novartis   said it would list on London's junior AIM market to raise capital to develop its drugs and give it more financial flexibility for further deals.",
        "date": "06052016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "British biopharma start-up Mereo to list in London "
    },
    {
        "content": "June 6 A Novartis trial of two drugs against an aggressive lung cancer bodes well for broadening their use beyond melanoma  the Swiss drugmaker told the American Society of Clinical Oncology's conference in Chicago on Monday.",
        "date": "06062016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "CORRECTED-Novartis study shows skin cancer combo also works on lungs "
    },
    {
        "content": "ZURICH  May 30 Switzerland's biggest drugmakers are clashing over cheaper copies of pricey biotech drugs - one reason why Novartis is considering selling its $14 billion stake in cross-town rival Roche.",
        "date": "05302016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Roche and Novartis face off in biosimilar drug battle "
    },
    {
        "content": "* Under terms   Novartis and Eisai sales representatives will promote availability of this combination regimen to oncologists nationwide",
        "date": "06022016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Eisai and Novartis enter deal to co-promote Lenvima with Everolimus in U.S. "
    },
    {
        "content": "ZURICH  June 2 Efforts by Novartis to defend its blockbuster cancer drug Afinitor against competitors got a boost on Thursday from European regulators  who approved it for use on certain types of advanced gastrointestinal and lung neuroendocrine tumours.",
        "date": "06022016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Facing rival drugs  Novartis gets win with Afinitor in Europe "
    },
    {
        "content": "* Says collaboration partner Novartis will start Phase III studies of ofatumumab in relapsing multiple sclerosis (MS)",
        "date": "06022016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Genmab announces phase III studies of sclerosis drug "
    },
    {
        "content": "* Sandoz' biosimilar rituximab regulatory submission accepted by European Medicines Agency  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "05242016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis: Sandoz' biosimilar rituximab regulatory submission accepted by European Medicines Agency "
    },
    {
        "content": "* said Afinitor receives EU approval to treat certain types of advanced gastrointestinal (gi) and lung neuroendocrine tumors  Source text for Eikon:  Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "06022016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis's Afinitor gets EU approval for GI  lung neuroendocrine tumors "
    },
    {
        "content": "* Seven top execs leave inside five months  including drugs chief",
        "date": "05232016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis executive exodus complicates drugmaker's rebuilding job "
    },
    {
        "content": "ZURICH  May 23 Novartis on Monday stuck to its full-year forecast of $200 million in revenue from its new heart failure medicine Entresto \"as of right now\"  even as analysts raised their estimates following an endorsement in global medical guidelines.",
        "date": "05232016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis sticks to $200 million FY Entresto f'cast after recommendation "
    },
    {
        "content": "LONDON New global guidelines on the treatment of heart failure strongly endorse the use of Novartis' Entresto  boosting the prospects for a drug that has struggled to gain traction since its launch last year.",
        "date": "05212016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Struggling Novartis heart drug boosted by new medical guidelines "
    },
    {
        "content": "ZURICH With seven departures in the space of five months  Novartis's  top management is in upheaval just as CEO Joe Jimenez tries to tackle a list of challenges that have seen the drug firm's share price fall 25 percent since July.",
        "date": "05232016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis executive exodus complicates drugmaker's rebuilding job "
    },
    {
        "content": "* Amgen's Corlanor also added to guideline list   (Adds comment from Novartis chief medical officer)",
        "date": "05212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Struggling Novartis heart drug boosted by new medical guidelines "
    },
    {
        "content": "LONDON  May 20 New global guidelines on the treatment of heart failure endorse the use of Novartis'  Entresto  boosting the prospects for a drug that has struggled to gain traction since its launch last year.",
        "date": "05212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "CORRECTED-New medical guidelines back use of Novartis heart failure drug "
    },
    {
        "content": "ZURICH  May 19 Novartis's heart failure drug Entresto will be subjected to a battery of new trials as the Swiss drugmaker  seeks to boost the medicine after a disappointing introduction.",
        "date": "05192016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis launches new Entresto trials in bid to boost sales "
    },
    {
        "content": "* Alcon chief Michael Ball says he is only focused on restoring sales growth  concedes spending on turnaround efforts will have negative impact on margins",
        "date": "05252016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis eyecare chief sees contact lense growth opportunities "
    },
    {
        "content": "BOGOTA The door remains open for Swiss pharmaceutical company Novartis to reach a deal with Colombia to lower the cost of cancer drug imatinib and prevent the Andean country from allowing generic production of the medication  the health minister said.",
        "date": "05182016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Deal still possible in Colombia-Novartis cancer drug talks : minister "
    },
    {
        "content": "ZURICH Swiss drugmaker Novartis  is ready to sell its near $14 billion stake in rival Roche  without demanding a premium  Chief Executive Joe Jimenez said on Wednesday.",
        "date": "05252016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis willing to sell Roche stake without demanding premium - CEO "
    },
    {
        "content": "May 18 A clinical trial testing an experimental breast cancer pill from Novartis has been stopped early because of good results  boosting the Swiss company's efforts to build up its oncology business.",
        "date": "05182016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis breast cancer drug set to take on Pfizer's Ibrance "
    },
    {
        "content": "* Says lee011 (ribociclib) stopped due to positive efficacy results at interim analysis in hr+/her2- advanced breast cancer  Source text for Eikon:  Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "05182016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis halts lee011 trial due to positive efficacy in hr+/her2- advanced breast cancer "
    },
    {
        "content": "* Says announces investment in FortiHFy clinical programme of Entresto and heart failure",
        "date": "05192016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis announces FortiHFy clinical programme of Entresto "
    },
    {
        "content": "ZURICH  May 25 Swiss drugmaker Novartis  is ready to sell its near $14 billion stake in rival Roche  without demanding a premium  Chief Executive Joe Jimenez said on Wednesday.",
        "date": "05252016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis willing to sell Roche stake without demanding premium - CEO "
    },
    {
        "content": "* Novartis CEO Joe Jimenez says no change in approach to Roche stake  which is financial investment  will look at opportuinities that arise",
        "date": "05252016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis CEO: Willing to sell Roche stake without premium "
    },
    {
        "content": "ZURICH  May 25 Novartis remains confident that sales for its new heart failure medicine Entresto will peak at around $5 billion  the Swiss drugmaker said in a presentation for an investor event on Wednesday.",
        "date": "05252016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis says confident in peak Entresto sales of around $5 bln "
    },
    {
        "content": "NEW YORK  May 11 Cigna Corp signed deals that will pay the makers of two potent but pricey cholesterol-lowering treatments based on how well their customers respond to the medications  the health insurer said on Wednesday.",
        "date": "05112016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 3-Cigna makes deals with Amgen  Sanofi for pricey cholesterol drugs "
    },
    {
        "content": "* u.s. Launch of hydralazine hydrochloride injection usp  20 mg/ml  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "05052016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Mylan launches generic version of Novartis' hypertension drug "
    },
    {
        "content": "* Novartis says afinitor\u007f recommended by chmp for european union approval to treat select gi and lung neuroendocrine tumors  Source text for Eikon:  Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "04292016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says Afinitor gets nod in EU for some GI  lung neuroendocrine tumors "
    },
    {
        "content": "ZURICH  April 27 A $471 million UBS  venture fund aims to generate annual returns \"north of 10 percent\" for its European and Asian investors by financing new cancer drugs  helping speed them from the lab to the point where drug companies buy their rights.",
        "date": "04282016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "OFFICIAL CORRECTION-UBS  MPM team up on $471 mln cancer fund to speed drug development "
    },
    {
        "content": "* Novartis receives three FDA breakthrough therapy designations for Ilaris to treat rare types of periodic fever syndromes",
        "date": "04272016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis receives three FDA breakthrough therapy designations for Ilaris "
    },
    {
        "content": "LONDON/ZURICH Novartis  is discussing options with banks for selling its near $14 billion stake in rival Roche   potentially providing cash for new deals  though a sale is not imminent  according to two people familiar with the situation.",
        "date": "04252016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis could refuel M&A machine with $14 billion Roche stake sale "
    },
    {
        "content": "VIENNA Drugmaker Novartis  aims to dispose of a 13.5 billion  Swiss franc ($13.8 billion) stake in its local rival Roche  and has already hired banks to support the selling process  a Swiss paper reported on Sunday.",
        "date": "04242016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis to prepare the sale of its Roche stake: Sonntagszeitung "
    },
    {
        "content": "* Novartis could use cash to buy new products   (Adds analyst comment  background)",
        "date": "04252016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis could refuel M&A machine with $14 bln Roche stake sale "
    },
    {
        "content": "LONDON/ZURICH  April 25 Novartis is discussing options with banks for selling its 13.5 billion Swiss franc ($13.8 billion) stake in rival Roche  though a sale is not imminent  according to two people familiar with the situation.",
        "date": "04252016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis discussing Roche stake sale  but not imminent -sources "
    },
    {
        "content": "VIENNA  April 24 Drugmaker Novartis  aims to dispose of a 13.5 billion  Swiss franc ($13.8 billion) stake in its local rival Roche and has already hired banks to support the selling process  a Swiss paper reported on Sunday.",
        "date": "04242016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis to prepare the sale of its Roche stake - Sonntagszeitung "
    },
    {
        "content": "* Says Afinitor\u007f significantly reduces seizures in phase iii study of patients with tuberous sclerosis complex  Source text for Eikon:  Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "04202016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis says Afinitor cuts seizures in patients with tuberous sclerosis complex "
    },
    {
        "content": "ZURICH Roche  sales in the first three months of the year beat analyst forecasts  setting a pace that Swiss local rival Novartis  and others in the drug industry could  struggle to match.",
        "date": "04192016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Roche sales set hard challenge for drug industry rivals "
    },
    {
        "content": "ZURICH A strong performance by its older medicines helped Novartis  beat profit forecasts on Thursday  making up for its struggling eyecare business and the extra costs of a poor start for a new heart failure drug.",
        "date": "04212016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis overcomes eyecare  heart drug pain with older drugs "
    },
    {
        "content": "* Sets high bar at start of drug industry reporting season   (Recasts  adds comments from analysts  pharma chief and CFO)",
        "date": "04192016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Roche sales set hard challenge for drug industry rivals "
    },
    {
        "content": "* Novartis AG reports a 17.2% pct passive stake in Aeglea Biotherapeutics Inc as of April 6  2016 - SEC Filing  Source text - http://1.usa.gov/1YwbYhd Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04142016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-Novartis AG reports a 17.2% pct passive stake in Aeglea Biotherapeutics Inc as of April 6  2016 - SEC Filing "
    },
    {
        "content": "ZURICH Novartis  Chief Executive Joe Jimenez said on Thursday bribery allegations against the drugmaker were legacy issues and it had set aside enough money to cover any penalties.",
        "date": "04212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis CEO says \"legacy\" bribery allegations provisioned for "
    },
    {
        "content": "ZURICH  April 21 Novartis Chief Executive Joe Jimenez said on Thursday bribery allegations against the drugmaker were legacy issues and it had set aside enough money to cover any penalties.",
        "date": "04212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "CORRECTED-Novartis CEO says \"legacy\" bribery allegations provisioned for "
    },
    {
        "content": "* Drug unit head says remains confident that Entresto sales will reach $5 billion per annum  Source text for Eikon:  Further company coverage:    (Reporting by John Miller)",
        "date": "04212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis still confident Entresto sales will reach $5 bln/year "
    },
    {
        "content": "* Ceo says sees lack of urgency among U.S. doctors to switch patients to entresto  'still bullish' on heart drug",
        "date": "04212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis CEO 'still bullish' on heart drug despite MD resistance "
    },
    {
        "content": "* Shares initially jump 1.3 percent  but taper gains   (Recasts  adds analyst and share price reaction)",
        "date": "04212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Novartis overcomes eyecare  heart drug pain with older drugs "
    },
    {
        "content": "LONDON  April 21 New heart drugs hailed as breakthrough treatments by researchers are struggling to gain traction among prescribing doctors  posing a headache for makers such as Novartis  which reported more weak sales for its Entresto medicine on Thursday.",
        "date": "04212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "New heart drugs struggle to win sales as doctors hold back "
    },
    {
        "content": "* Says expects 2016 entresto sales of about $200 million  Source text for Eikon:  Further company coverage:    (Reporting by John Miller)",
        "date": "04212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "BRIEF-Novartis sees 2016 Entresto sales of about $200 mln "
    },
    {
        "content": "ZURICH  April 21 Swiss drugmaker Novartis  said first-quarter core net income fell 13 percent as it continues to suffer from patent expiries  a struggling eyecare business and lackluster sales of its new heart medicine.",
        "date": "04212016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis Q1 core net income falls 13 pct "
    },
    {
        "content": "* Says receives EU approval for Revolade as first-in-class therapy for children aged 1 year and above with chronic ITP  Source text for Eikon:  Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "04072016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "BRIEF-EU approves Novartis's Revolade for children with chronic ITP "
    },
    {
        "content": "ISTANBUL  March 31 Turkey's health ministry said it has launched an investigation into allegations a drugmaker  which it did not name  secured $85 million in business advantages through bribery.",
        "date": "03312016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "UPDATE 1-Turkish ministry says investigating drugmaker over bribe allegations "
    },
    {
        "content": "ZURICH  April 2 Novartis took its campaign to invigorate sluggish sales of its new heart-failure medicine Entresto to a U.S. cardiologists meeting on Saturday  telling attendees that even clinically stable patients can benefit from the drug.",
        "date": "04022016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis takes Entresto case to U.S. cardiologist meeting "
    },
    {
        "content": "LONDON An anonymous whistleblower has accused Swiss drugmaker Novartis  of paying bribes in Turkey through a consulting firm to secure business advantages worth an estimated $85 million  according to a Feb. 17 email seen by Reuters. | Video ",
        "date": "03302016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Exclusive: Novartis investigating $85 million bribery allegations in Turkey "
    },
    {
        "content": "ISTANBUL The Ankara Chief Prosecutor has launched an investigation into the Turkish unit of Swiss drugmaker Novartis  the prosecutor's office said on Friday  after allegations the company benefited from bribery.",
        "date": "04012016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Turkish prosecutor opens bribery probe into drugmaker Novartis "
    },
    {
        "content": "ZURICH  March 31 Swiss drugmaker Novartis AG  reiterated its 2016 group outlook when releasing on Thursday updated 2015 financial data under a new divisional structure it had announced in January.",
        "date": "03312016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis reiterates 2016 outlook under new structure "
    },
    {
        "content": "ISTANBUL  April 1 The Ankara Chief Prosecutor has launched an investigation into the Turkish unit of Swiss drugmaker Novartis  the prosecutor's office said on Friday  after allegations the company benefited from bribery.",
        "date": "04012016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 2-Turkish prosecutor opens bribery probe into drugmaker Novartis "
    },
    {
        "content": "ISTANBUL An initial investigation into the Turkish unit of Swiss drugmaker Novartis over allegations it benefited from bribery has not revealed any problems  a senior official for Turkey's health ministry said on Friday.",
        "date": "04012016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "No problems seen in initial Novartis investigation: Turkish official "
    },
    {
        "content": "ISTANBUL  April 1 The Ankara Chief Prosecutor has launched an investigation into the Turkish unit of Swiss drugmaker Novartis  Turkish broadcasters reported on Friday  after allegations it benefitted from bribery.",
        "date": "04012016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Ankara prosecutor launches investigation into Novartis -Turkish TV "
    },
    {
        "content": "ISTANBUL  April 1 An initial investigation into the Turkish unit of Swiss drugmaker Novartis over allegations it benefitted from bribery has not revealed any problems  a senior official for Turkey's health ministry said on Friday.",
        "date": "04012016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "CORRECTED-No problems seen in initial Novartis investigation -Turkish official "
    },
    {
        "content": "Drugmaker Novartis AG agreed on Wednesday to pay more than $25 million to the U.S. government to settle civil charges that it bribed healthcare professionals in China to boost sales there  the U.S. Securities and Exchange Commission said.",
        "date": "03232016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Novartis settles civil charges alleging bribery in China - SEC "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  March 22 (Fitch) Fitch Ratings has affirmed Switzerland-based  pharmaceutical company Novartis AG's (Novartis) Long-term Issuer Default Rating  (IDR) and senior unsecured rating at 'AA' and its Short-term IDR at 'F1+'. The  Outlook is Stable.  Fitch has also affirmed the unsecured rating of the notes issued by Novartis  Finance S.A. and guaranteed by Novartis AG at 'AA'. In addition Fitch has  assigned an unsecured rating of 'AA",
        "date": "03222016",
        "name": "Novartis AG",
        "news_type": "topStory",
        "symbol": "NVS",
        "title": "Fitch Affirms Novartis at 'AA'; Stable Outlook "
    },
    {
        "content": "Drugmaker Novartis AG agreed on Wednesday to pay more than $25 million to the U.S. government to settle civil charges that it bribed healthcare professionals in China to boost sales there  the U.S. Securities and Exchange Commission said.",
        "date": "03232016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis settles civil charges alleging bribery in China: SEC "
    },
    {
        "content": "March 23 Drugmaker Novartis AG agreed on Wednesday to pay more than $25 million to the U.S. government to settle civil charges that it bribed healthcare professionals in China to boost sales there  the U.S. Securities and Exchange Commission said.",
        "date": "03232016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "UPDATE 1-Novartis settles civil charges alleging bribery in China - SEC "
    },
    {
        "content": "March 23 Drugmaker Novartis AG agreed on Wednesday to pay more than $25 million to the U.S. government to settle civil charges that it bribed healthcare professionals in China to boost sales there  the U.S. Securities and Exchange Commission said.",
        "date": "03232016",
        "name": "Novartis AG",
        "news_type": "normal",
        "symbol": "NVS",
        "title": "Novartis settles charges alleging bribery in China - SEC "
    }
]