[
    {
        "content": "SYDNEY  Sept 7 A business partner of News Corp Co-Chairman Lachlan Murdoch filed a motion in an Australian court on Thursday seeking to stop a vote on CBS Corp's planned buyout of a struggling local television station.",
        "date": "09072017",
        "name": "News Corporation",
        "news_type": "topStory",
        "symbol": "NWSA",
        "title": "Lachlan Murdoch partner in court to delay vote on CBS TV station buyout "
    },
    {
        "content": "Sept 5 Tronc Inc  owner of the Chicago Tribune and the Los Angeles Times newspapers  has gained entry into the United States' top media market by acquiring the New York Daily News from publishing and property mogul Mort Zuckerman.",
        "date": "09052017",
        "name": "News Corporation",
        "news_type": "normal",
        "symbol": "NWSA",
        "title": "REFILE-Tronc buys New York Daily News in push into No. 1 media market "
    },
    {
        "content": "* Interim dividend of HK2 cents per  share Source text for Eikon: Further company coverage:",
        "date": "08282017",
        "name": "News Corporation",
        "news_type": "topStory",
        "symbol": "NWSA",
        "title": "BRIEF-Sing Tao News Corp says HY revenue HK$734.3 million "
    },
    {
        "content": "LONDON The boss of Rupert Murdoch's News Corp  said the timing of the U.S. group's offer for talkSPORT-owner Wireless  after the post-Brexit drop in the pound was \"auspicious\"  although the companies had been in talks for some time.",
        "date": "06302016",
        "name": "News Corporation",
        "news_type": "topStory",
        "symbol": "NWSA",
        "title": "News Corp CEO says drop in pound 'auspicious' for $295 million Wireless deal "
    },
    {
        "content": "Rupert Murdoch's News Corp said rumors about the company's interest in buying microblogging site Twitter Inc or building a stake in it were untrue.",
        "date": "01202016",
        "name": "News Corporation",
        "news_type": "topStory",
        "symbol": "NWSA",
        "title": "News Corp denies rumors of Twitter bid "
    },
    {
        "content": "LONDON Media mogul Rupert Murdoch and former supermodel Jerry Hall got engaged over the weekend  announcing their plans to tie the knot in a classified ad on Tuesday in the Times newspaper  which is owned by Murdoch's News Corp. | Video ",
        "date": "01122016",
        "name": "News Corporation",
        "news_type": "topStory",
        "symbol": "NWSA",
        "title": "Rupert Murdoch  ex-model Jerry Hall announce engagement "
    },
    {
        "content": "NEW YORK Several top investors in Twenty-First Century Fox Inc are pressing for the right to swap their voting shares for ordinary shares  which are trading at an unusual premium  even though the move could hand even more control of the company to Rupert Murdoch  according to people familiar with the matter.",
        "date": "02072015",
        "name": "News Corporation",
        "news_type": "topStory",
        "symbol": "NWSA",
        "title": "Exclusive: Top Fox investors seek to convert voting shares  Murdoch may benefit "
    },
    {
        "content": "News Corp   owner of the Wall Street Journal and HarperCollins  reported quarterly revenue and a profit just above analysts' consensus forecast as its book publishing and real estate businesses offset dwindling print revenue.",
        "date": "02052015",
        "name": "News Corporation",
        "news_type": "topStory",
        "symbol": "NWSA",
        "title": "Books  digital real estate assets lift News Corp results "
    },
    {
        "content": "Feb 5 News Corp  owner of the Wall Street Journal and HarperCollins  reported quarterly revenue and a profit just above analysts' consensus forecast as its book publishing and real estate businesses offset dwindling print revenue.",
        "date": "02052015",
        "name": "News Corporation",
        "news_type": "normal",
        "symbol": "NWSA",
        "title": "UPDATE 2-Books  digital real estate assets lift News Corp results "
    },
    {
        "content": "Feb 5 News Corp  which publishes the New York Post  reported a 1.9 percent rise in quarterly revenue  helped by its book publishing and real estate businesses.",
        "date": "02052015",
        "name": "News Corporation",
        "news_type": "normal",
        "symbol": "NWSA",
        "title": "News Corp posts 1.9 pct rise in revenue "
    },
    {
        "content": "Twenty-First Century Fox Inc cut its profit forecast for the next financial year after the dollar strengthened and as more viewers and advertisers swap its broadcast networks for on-demand TV. | Video ",
        "date": "02052015",
        "name": "News Corporation",
        "news_type": "normal",
        "symbol": "NWSA",
        "title": "Fox says dollar  shifting viewers to weigh on 2016 profit "
    },
    {
        "content": "The United States Department of Justice has decided not to prosecute News Corp  or its sister company Twenty-First Century Fox  after completing an investigation of scandals in Great Britain involving phone hacking and alleged bribery of public officials.",
        "date": "02022015",
        "name": "News Corporation",
        "news_type": "topStory",
        "symbol": "NWSA",
        "title": "Justice Department drops News Corp probe related to phone hacking "
    },
    {
        "content": "Feb 2 The United States Department of Justice has decided not to prosecute News Corp or its sister company Twenty-First Century Fox after completing an investigation of scandals in Great Britain involving phone hacking and alleged bribery of public officials.",
        "date": "02022015",
        "name": "News Corporation",
        "news_type": "normal",
        "symbol": "NWSA",
        "title": "U.S. Justice Dept drops News Corp probe related to phone hacking "
    },
    {
        "content": "Twenty-First Century Fox Inc's quarterly profit beat analysts' estimates  helped by higher affiliate and advertising revenue in its cable business and the box-office success of \"The Maze Runner\" and \"Gone Girl\".",
        "date": "02042015",
        "name": "News Corporation",
        "news_type": "topStory",
        "symbol": "NWSA",
        "title": "Cable business  films help Fox beat estimates "
    },
    {
        "content": "DUBAI Saudi Arabia's Kingdom Holding   the investment firm owned by billionaire Prince Alwaleed bin Talal  sold most of its stake in media giant News Corp  as part of a portfolio review  it said on Wednesday.",
        "date": "02042015",
        "name": "News Corporation",
        "news_type": "normal",
        "symbol": "NWSA",
        "title": "Saudi's Kingdom Holding sells 5.6 percent stake in News Corp "
    },
    {
        "content": "DUBAI  Feb 4 Saudi Arabia's Kingdom Holding   the investment firm owned by billionaire Prince Alwaleed bin Talal  reduced the size of its stake in media giant News Corp by 5.6 percent  it said on Wednesday.",
        "date": "02042015",
        "name": "News Corporation",
        "news_type": "normal",
        "symbol": "NWSA",
        "title": "Saudi's Kingdom Holding says sells 5.6 pct stake in News Corp "
    }
]