[
    {
        "content": "* NEW YORK COMMUNITY BANCORP  INC. REPORTS THIRD QUARTER 2017 DILUTED EARNINGS PER COMMON SHARE OF $0.21",
        "date": "10252017",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-NEW YORK COMMUNITY BANCORP REPORTS Q3 DILUTED EARNINGS PER COMMON SHARE OF $0.21 "
    },
    {
        "content": "* New york community bancorp  inc. Reports second quarter 2017 diluted earnings per common share of $0.22",
        "date": "07262017",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-New York Community Bancorp Q2 earnings per share $0.22 "
    },
    {
        "content": "* New York Community Bancorp  Inc. announces strategic sale of mortgage banking business and residential assets covered under FDIC loss share agreement",
        "date": "06272017",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-New York Community Bancorp announces strategic sale of mortgage banking business and residential assets covered under FDIC loss share agreement "
    },
    {
        "content": "* New York Community Bancorp Inc announces proposed offering of depositary shares representing ownership interests in non-cumulative perpetual preferred stock  Source text for Eikon:  Further company coverage:",
        "date": "03062017",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-New York Community Bancorp announces proposed offering of depositary shares "
    },
    {
        "content": "* New York Community Bancorp Inc reports Q4 2016 diluted EPS of $0.23 and 2016 diluted EPS of $1.01",
        "date": "01252017",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-New York Community Bancorp Q4 earnings per share $0.23 "
    },
    {
        "content": "* Does not expect to receive regulatory approvals required to consummate proposed merger with astoria financial corp",
        "date": "11092016",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-New York Community Bancorp updates status of Astoria Financial merger "
    },
    {
        "content": "* New york community bancorp  inc. Reports 1q 2017 diluted earnings per common share of $0.21",
        "date": "04262017",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-New York Community Bancorp Q1 adjusted profit $0.21/shr "
    },
    {
        "content": "* New york Community Bancorp  Inc. Reports 3Q 2016 diluted earnings per share of $0.26",
        "date": "10262016",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-New york community bancorp  inc. reports 3Q 2016 "
    },
    {
        "content": "* Net interest margin rose 35 basis points from year-earlier measure to 2.99% in q2 of 2016",
        "date": "07272016",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-New York Community Bancorp Q2 gaap earnings per share $0.26 "
    },
    {
        "content": "* Amended certificate of incorporation to increase authorized shares of common stock  from 600 million to 900 million  Source text for Eikon: [(http://1.usa.gov/24jwYvm )] Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04272016",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-New York Community Bancorp amends certificate of incorporation "
    },
    {
        "content": "* New york community bancorp  inc. Reports Q1 2016 diluted gaap earnings per share of $0.27",
        "date": "04202016",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "BRIEF-New york community bancorp reports Q1 gaap share $0.27 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 03 (Fitch) Fitch Ratings affirms the Long-term Issuer Default  Rating (IDR) of New York Community Bancorp (NYCB) at 'BBB+' following the  announcement of NYCB's merger with Astoria Financial Group  Inc. (AF). NYCB's.  NYCB's Rating Outlook remains Stable.  Fitch has placed AF's 'BBB-' long-term IDR on Rating Watch Positive. Upon  completion of the merger (expected to close 4Q16)  Fitch expects to upgrade AF's  ratings",
        "date": "11032015",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "Fitch Affs New York Community Bancorp on Merger with Astoria Financial; Astoria on Positive Watch "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  April 07 (Fitch) Fitch Ratings has affirmed the ratings for New York  Community Bancorp  Inc. (NYCB) at 'BBB+/F2'. The Rating Outlook remains Stable.  . A full list of rating actions follows at the end of this release. Fitch reviewed NYCB as part of its Niche Bank Peer Review  which also includes  Astoria Financial Corporation  Inc.  Dime Community Bancshares  Inc. and  Emigrant Bancorp Inc. Niche banks are defined by their na",
        "date": "04072015",
        "name": "New York Community Bancorp Inc",
        "news_type": "topStory",
        "symbol": "NYCB",
        "title": "Fitch Affirms New York Community's Ratings at 'BBB+'; Outlook Stable "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  April 07 (Fitch) Fitch Ratings has affirmed the long- and short-term  Issuer Default Ratings (IDRs) of Astoria Financial Corporation and its principal  banking subsidiary  Astoria Bank  at 'BBB-'/'F3'. The Rating Outlook is Stable.  A full list of ratings actions is provided at the end of this release. Fitch reviewed AF as part of its Niche Bank Peer Review  which also includes  Dime Community Bancshares  Inc.  Emigrant Bancor",
        "date": "04072015",
        "name": "New York Community Bancorp Inc",
        "news_type": "normal",
        "symbol": "NYCB",
        "title": "Fitch Affirms Astoria Fin'l's IDRs at 'BBB-'/'F3' Following Peer Review; Outlook Stable "
    }
]