[
    {
        "content": "BARCELONA  Nov 16 Orange's Spanish business will post core operating profit growth of at least 15 percent in the second half of this year  Chief Financial Officer Ramon Fernandez said on Thursday.",
        "date": "11162017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange's Spanish business to produce profit growth of at least 15 pct in H2-CFO "
    },
    {
        "content": "WARSAW  Nov 14 Polish unit of France's Orange has started negotiations with trade unions on voluntary redundancies and salaries  the company said on Tuesday.",
        "date": "11142017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Poland's Orange starts talks with trade unions on voluntary redundancies "
    },
    {
        "content": "* OUR TELEKOM TO ROLL OUT 4G/LTE NETWORK AND HIGH-SPEED BROADBAND IN SOLOMON ISLANDS WITH SES NETWORKS‍​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "11162017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-SES says Our Telekom to use SES Networks‍​ for 4G/LTE Network and high-speed broadband "
    },
    {
        "content": "LAVAL  France  Nov 9 Orange Chief Executive Stephane Richard said on Thursday an exit of the French state as a shareholder of the telecom operator was likely to be gradual and manageable and was not on \"today's agenda\".",
        "date": "11092017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange CEO says French state's exit as shareholder not imminent "
    },
    {
        "content": "LONDON  Nov 8 British financial technology firm Revolut said on Wednesday it has applied for a European banking licence  as it bids to join a growing number of digital-only banks looking to win away customers from larger  traditional lenders.",
        "date": "11082017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Revolut becomes latest UK fintech firm to seek banking licence "
    },
    {
        "content": "LAVAL  France  Nov 9 Orange Chief Executive Stephane Richard said on Thursday an exit of the French state from the capital of the telecom operator did not seem to be on \"today's agenda\".",
        "date": "11092017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange CEO says French state's exit from Orange not on \"today's agenda\" "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  November 02 (Fitch) Fitch Ratings has affirmed Orange S.A.'s Long-Term Issuer Default Rating (IDR) and senior unsecured rating at 'BBB+'. The Outlook is Stable. A full list of rating actions is below. Orange's rating is underpinned by the telecom group's strong domestic position in France  which represented 59% of the group's adjusted EBITDA minus capex at end-2016. A convergence-based strategy across its main European operation",
        "date": "11022017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Fitch Affirms Orange at 'BBB+'; Outlook Stable "
    },
    {
        "content": "WARSAW  Oct 25 Poland's largest telecoms operator Orange Polska raised its full-year core earnings guidance on Wednesday  citing a rebound in its fixed broadband business.",
        "date": "10252017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange's Polish arm lifts 2017 earnings guidance "
    },
    {
        "content": "WARSAW  Oct 25 Poland's largest telecoms operator Orange Polska  a unit of France's Orange   said its third quarter net profit fell 24 percent from a year earlier to 28 million zlotys ($7.8 million).",
        "date": "10252017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange Polska's Q3 net profit drops 24 pct "
    },
    {
        "content": "* EU roaming rules impacted Q3 core operating profit (Adds background  details)",
        "date": "10262017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-Telecoms group Orange's results lifted by stronger sales in France and Spain "
    },
    {
        "content": "PARIS  Oct 26 France's Orange reported third-quarter results that met expectations  with sales increases in its home country and Spain helping to drive up its core operating profit.",
        "date": "10262017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Telecoms group Orange's Q3 results meet expectations on higher sales in France  Spain "
    },
    {
        "content": "PARIS French telecoms group Orange  plans to launch an online banking service on Nov. 2 as it seeks to add another source of revenue to its core services.",
        "date": "10032017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange to launch online banking service on Nov. 2 "
    },
    {
        "content": "* Lawmakers vote to limit regulatory rewards for co-investment",
        "date": "10022017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-European telecoms companies' hopes of lighter regulation dashed by EU "
    },
    {
        "content": "PARIS  Oct 5 Iliad  Bouygues Telecom and SFR Group are likely to see the monthly rent they pay to access Orange's fixed copper network drop in 2018  according to proposals from French telecoms regulator Arcep on Thursday.",
        "date": "10052017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange's copper network rental costs to drop in 2018-regulator "
    },
    {
        "content": "* Lawmakers vote to limit regulatory rewards for co-investment",
        "date": "10022017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European telecoms companies' hopes of lighter regulation dashed by EU "
    },
    {
        "content": "PARIS  Sept 28 The chief executive of French telecoms company Orange said he did not see at present opportunities for large pan-European mergers and ruled out buying a stake in media group Vivendi  according to remarks published on Thursday.",
        "date": "09282017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "France's Orange CEO sees little prospects for pan-European mergers - Les Echos "
    },
    {
        "content": "CAIRO  Sept 27 Orange Egypt is set to receive the wireless frequency it needs to deliver 4G mobile services on Thursday  the company said.",
        "date": "09272017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange Egypt to receive 4G frequency on Thursday "
    },
    {
        "content": "WARSAW  Sept 14 The French government is likely to reduce its 23 percent stake in telecommunications company Orange  the company's head of European operations said on Thursday.",
        "date": "09142017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "France likely to cut Orange stake  executive says "
    },
    {
        "content": "WARSAW  Sept 4 Orange Polska  part of France's Orange  sees room for a dividend payout in 2020  the company's Chief Financial Officer Maciej Nowohonski said on Monday.",
        "date": "09042017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange Polska has room to pay dividend in 2020 "
    },
    {
        "content": "MILAN Top shareholder Vivendi  has no plans to merge Telecom Italia  with Orange  nor to make it French  Chief Executive Arnaud de Puyfontaine told newspaper La Stampa in an interview published on Saturday.",
        "date": "07292017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Telecom Italia will not become French or merge with Orange: Vivendi CEO to paper "
    },
    {
        "content": "MILAN  July 29 Top shareholder Vivendi has no plans to merge Telecom Italia with Orange nor to make it French  Chief Executive Arnaud de Puyfontaine told newspaper La Stampa in an interview published on Saturday.",
        "date": "07292017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Telecom Italia will not become French or merge with Orange -Vivendi CEO to paper "
    },
    {
        "content": "LONDON  July 28 Britain's BT posted a 42 percent drop in first-quarter pretax profit due to a settlement with investors Deutsche Telekom and Orange over an Italian accounting scandal.",
        "date": "07282017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Investor settlement over Italian scandal hits BT profits "
    },
    {
        "content": "MILAN  July 29 Top shareholder Vivendi has no plans to merge Telecom Italia with Orange nor to make it French  Chief Executive Arnaud de Puyfontaine told newspaper La Stampa in an interview published on Saturday.",
        "date": "07292017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Telecom Italia will not become French  won't merge with Orange -Vivendi CEO to paper "
    },
    {
        "content": "* Telekom Austria now has rival offering combined services (Adds detail  quotes  background)",
        "date": "07282017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 3-Hutchison's Drei buys Tele2 to rival Carlos Slim in Austria "
    },
    {
        "content": "* Orange has not received any information so far about the potential change of the 23 percent controlling stake held by the French government in the company  chief executive Stephane Richard says",
        "date": "07272017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange has no information on possible change of state holdings in the group-CEO "
    },
    {
        "content": "WARSAW  July 26 Poland's largest telecoms operator Orange Polska  a unit of France's Orange   reported a second quarter net profit of 71 million zlotys ($19.6 million) on Wednesday mainly on lower depreciation.",
        "date": "07262017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange Polska's second-quarter profit beats forecasts "
    },
    {
        "content": "* Orange CEO Stephane Richard says group will hold investor day in fall to review its 2020 strategic plan and capital expenditures policy.",
        "date": "07272017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Orange to review strategic plan and capex policy in the fall-CEO "
    },
    {
        "content": "PARIS  July 27 Orange said on Thursday that the French market returned to growth in the second-quarter for the first time in eight years.",
        "date": "07272017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange says French market returns to growth in Q2 "
    },
    {
        "content": "BISSAU Guinea Bissau has agreed a memorandum of understanding with the World Bank  Orange and MTN for a $47 million project to link the country to a submarine telecoms cable connecting Africa with Europe  the government said on Wednesday.",
        "date": "07192017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Guinea Bissau reaches $47 million deal on submarine cable "
    },
    {
        "content": "BISSAU  July 19 Guinea Bissau has agreed a memorandum of understanding with the World Bank  Orange and MTN for a $47 million project to link the country to a submarine telecoms cable connecting Africa with Europe  the government said on Wednesday.",
        "date": "07192017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Guinea Bissau reaches $47 mln deal on submarine cable "
    },
    {
        "content": "* SIGNS SEK 300 000 DEAL WITH ORANGE LABS TO TEST TERRANET'S PATENTED SERVICE Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "07172017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-TerraNet Holding signs SEK 300 000 deal with Orange Labs "
    },
    {
        "content": "* Altice enters into an agreement to acquire leading Portuguese media group Media Capital",
        "date": "07142017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Altice NV enters deal to buy Media Capital "
    },
    {
        "content": "PARIS France's biggest telecoms operator Orange  said on Tuesday it had deepened its commercial ties with Vivendi's  pay-TV Canal Plus in a bid to lure more customers with premium movies  sports and other TV content.",
        "date": "07112017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange and Vivendi's pay-TV arms strengthen commercial ties "
    },
    {
        "content": "* Aiming to double Orange/Canal Plus customer numbers (Adds comments comments from Orange  Canal Plus CEOs  details)",
        "date": "07112017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange and Vivendi's pay-TV arms strengthen commercial ties "
    },
    {
        "content": "* No new obligations in consumer segment (Adds comment from Orange CEO)",
        "date": "07112017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 2-French telecoms regulator to impose new constraints on Orange "
    },
    {
        "content": "PARIS  July 11 France's biggest telecoms operator Orange said on Tuesday that it had deepened its commercial ties with Vivendi's pay-TV Canal Plus in a bid to lure more customers with premium movie  sports and other TV content.",
        "date": "07112017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange and Vivendi's pay-TV arm strengthen commercial ties "
    },
    {
        "content": "PARIS  June 19 French telecoms company Orange could get 900 million pounds ($1.15 billion) by reducing its stake in British rival BT Group from 4 percent to as little as 1.33 percent  it said on Monday.",
        "date": "06192017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-France's Orange says it could get $1.15 bln by cutting stake in BT "
    },
    {
        "content": "PARIS French telecoms company Orange plans to reduce its stake in British rival BT Group from 4 percent to as little as 1.33 percent  it said on Monday.",
        "date": "06192017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "France's Orange to cut stake in BT Group "
    },
    {
        "content": "PARIS  June 19 French telecoms firm Orange said on Monday it was reducing its stake in Britain's BT Group to about 2.66 percent from 4 percent  and could cut it further to as little as 1.33 percent.",
        "date": "06192017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "France's Orange to cut stake in BT Group to 2.66 pct or less "
    },
    {
        "content": "* Richard to make his case to the board for a new term in autumn-source",
        "date": "06102017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "CORRECTED-UPDATE 1-Orange's Stephane Richard to apply for a third term as CEO from 2018-sources "
    },
    {
        "content": "* ORANGE ENTERS EXCLUSIVE NEGOTIATIONS TO ACQUIRE BUSINESS & DECISION TO ACCELERATE ORANGE BUSINESS SERVICES' GROWTH IN DATA INTELLIGENCE",
        "date": "05182017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange enters exclusive negotiations to acquire Business & Decision "
    },
    {
        "content": "* Holds 580 625 treasury shares Further company coverage: ($1 = 278.29 forints) (Reporting by Gergely Szakacs)",
        "date": "05172017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Magyar Telekom buys another 270 000 own shares "
    },
    {
        "content": "PARIS  May 9 France's second-biggest telecoms operator SFR is seeking 2.4 billion euros ($2.6 billion) in damages from bigger rival Orange in an antitrust litigation tied to the corporate market in the country.",
        "date": "05092017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "SFR seeks $2.6 bln in damages from Orange in antitrust litigation "
    },
    {
        "content": "May 10 Magyar Telekom Tavkozlesi Nyrt Q1 earnings statement:",
        "date": "05102017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Magyar Telekom quarterly net profit below forecast  maintains 2017 targets "
    },
    {
        "content": "PARIS France's second-biggest telecoms operator SFR is seeking 2.4 billion euros ($2.6 billion) in damages from bigger rival Orange in an antitrust litigation tied to the corporate market in the country.",
        "date": "05092017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "SFR seeks $2.6 billion in damages from Orange in antitrust litigation "
    },
    {
        "content": "* Core operating profit rises 2 percent (Adds share price  background)",
        "date": "04272017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-Telecoms group Orange gets closer to stabilising revenues in France "
    },
    {
        "content": "WARSAW  April 26 Poland's largest telecoms operator Orange Polska  a unit of France's Orange   posted a net profit of 39 million zlotys ($10 million) in the first quarter  beating the expectations of analysts who expected a 15 million zloty loss.",
        "date": "04262017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange Polska posts 39 mln zloty net profit in Q1  beats estimates "
    },
    {
        "content": "PARIS  April 27 French telecoms network operator Orange said first-quarter core operating profit rose by 2 percent on a comparable basis  helped by higher revenues from Spain and Poland.",
        "date": "04272017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Telecoms group Orange Q1 core operating profits edge up 2 pct "
    },
    {
        "content": "* Orange said it signed a 2017 wage agreement for France  representing average wage increase of 2.3 percent Further company coverage: (Reporting by Mathieu Rosemain)",
        "date": "04262017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Orange signs 2017 wage agreement for France  with average increase of 2.3 percent "
    },
    {
        "content": "PARIS  April 20 French telecoms company Orange plans to launch its online banking service nationwide on July 6  aiming to take on traditional banks with a low-cost offering that will eventually expand into loans and insurance.",
        "date": "04202017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange bank to go online across France on July 6 "
    },
    {
        "content": "* Orange's new banking service  dubbed Orange Bank  will first be offered to group employees from mid-May and then fully launched for customers on July 6  chief executive Stephane Richard said in a conference on Thursday.",
        "date": "04202017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Orange CEO says online banking service to be launched July 6 "
    },
    {
        "content": "* Orange to create new entity dedicated to \"orange content\"  reporting directly to ceo - richard",
        "date": "03212017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-orange working to strengthen its partnership with canal+ "
    },
    {
        "content": "* FY 2016 revenue at 4.1 million euros ($4.34 million) versus 3.2 million euros a year ago",
        "date": "02282017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Baltic Telekom FY 2016 net profit down at 23 960 euros "
    },
    {
        "content": "PARIS Leading French telecoms company Orange  said it was interested in working with Canal Plus on acquiring sports rights rather than trying to buy a stake in the pay TV business.",
        "date": "02232017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange ready to play ball with Canal Plus on sports rights "
    },
    {
        "content": "* Orange wants to partner with Canal Plus rather than buy stake",
        "date": "02232017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 3-Orange ready to play ball with Canal Plus on sports rights "
    },
    {
        "content": "PARIS  Feb 23 French telecoms group Orange  reported a 1.3 percent increase of its yearly core operating profit on Thursday  helped by a strong sales momentum in Spain and a reduction in labour expenses.",
        "date": "02232017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Telecoms group Orange 2016 core operating profit up 1.3 pct  raises dividend "
    },
    {
        "content": "* says appoints head of France's Banque Publique d'Investissement Nicolas Dufourcq to its board of directors  Further company coverage:   (Paris Newsroom)",
        "date": "02152017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange appoints head of France's state investment bank to its board "
    },
    {
        "content": "* Wins tender to provide mobile services to public institutions.",
        "date": "02062017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-BRIEF-Magyar Telekom wins 5 bln forint mobile tender "
    },
    {
        "content": "* Wins tender to provide mobile services to public institutions",
        "date": "02062017",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Magyar Telekom wins 5 bln forint mobile tender "
    },
    {
        "content": "* Chairman and CEO says Orange will launch French mobile banking arm in few weeks time",
        "date": "01252017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange to launch mobile banking arm in France in few weeks time "
    },
    {
        "content": "* Considers its 4G high-speed mobile internet network advertisements objective  will appeal competition watchdog fine -statement",
        "date": "01192017",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Magyar Telekom says to appeal competition watchdog fine "
    },
    {
        "content": "PARIS French telecoms boss Stephane Richard was sharply criticized by one of the judges and by a witness during the negligence trial of IMF chief Christine Lagarde in Paris this week.",
        "date": "12162016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange CEO under fire at Tapie affair trial of IMF's Lagarde "
    },
    {
        "content": "PARIS A French ex-treasury official told a court trying IMF chief Christine Lagarde for negligence on Wednesday that he had been shocked at how quickly the government had given up on contesting a huge state payout to business tycoon Bernard Tapie in 2008.",
        "date": "12142016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Trial of IMF's Lagarde hears that payout decision was rushed through "
    },
    {
        "content": "PARIS France's Vivendi denied on Saturday it was discussing a cross-ownership deal with telecoms operator Orange  insisting that any potential talks between the two groups were focused on its pay-TV unit Canal Plus.",
        "date": "12102016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Vivendi says not part of potential Canal Plus-Orange talks "
    },
    {
        "content": "SKHIRAT  Morocco France's Orange  would consider bidding for Vivendi's pay-TV Canal Plus if it came up for sale  Chief Executive Officer Stephane Richard said on Thursday.",
        "date": "12082016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange would consider bid for Vivendi's pay-TV if for sale - CEO "
    },
    {
        "content": "BERLIN Leading German politicians have called for IT and telecoms equipment makers to be held liable for cyber attacks  after a failed attempt to hijack consumer router devices caused widespread disruption for Deutsche Telekom customers.",
        "date": "11302016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Calls grow to make IT equipment makers liable after D.Telekom attack "
    },
    {
        "content": "* America Movil CEO Hajj says no capital increase planned for Telekom Austria -newspaper Die Presse",
        "date": "10272016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-America Movil says no capital increase planned for Telekom -paper "
    },
    {
        "content": "PARIS  Oct 26 France's state holding agency does not intend to significantly change its stake in telecoms operator Orange  its chief Martin Vial said on Wednesday.",
        "date": "10262016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "RPT-France's state holding agency to keep blocking minority in Orange "
    },
    {
        "content": "* Chief Financial Officer at Orange Polish unit Orange Polska said on Tuesday the company will try to accelerate the sale of its real estate assets.",
        "date": "10252016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Polish Orange unit to accelerate real estate sales "
    },
    {
        "content": "LONDON  Oct 25 European shares rose on Tuesday  as gains in Randstad  Orange and major mining companies lifted the region's stock markets.",
        "date": "10252016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European stocks lifted by Randstad  Orange and miners "
    },
    {
        "content": "* Confirms full-year guidance for 2016   (Adds details  CFO quote)",
        "date": "10252016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange profit rises on strong sales in Spain  Africa "
    },
    {
        "content": "PARIS  Oct 25 French telecoms operator Orange  reported a quarterly core operating profit that beat expectactions on Tuesday  as strong sales growth in Spain offset declining revenue at home  where fierce competition in the mobile market continued to trim margins.",
        "date": "10252016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange Q3 restated core profit rises with strong Spanish sales "
    },
    {
        "content": "* Says Ericsson and Orange are working on the development and test of selected 5G use cases based on Orange's network and Ericsson 5G technology    Source text for Eikon:  Further company coverage:    (Stockholm Newsroom)",
        "date": "10062016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Ericsson says partners up with Orange on 5G "
    },
    {
        "content": "PARIS  Sept 16 Orange Chief Executive Officer Stephane Richard told investors last week in London that preliminary consolidation talks have resumed between SFR   Iliad and Bouygues  a spokesman said on Friday.",
        "date": "09162016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange CEO said initial SFR  Bouygues  Iliad talks have resumed -spokesman "
    },
    {
        "content": "Sept 6 Traffic tolling and traffic management firm Q-Free ASA :",
        "date": "09062016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-Q-Free signs Slovenia truck tolling contract worth $57 mln  eyeing Indonesia "
    },
    {
        "content": "PARIS Vivendi's pay-TV unit Canal Plus is holding talks with French telecoms firm Iliad about new distribution offers as it tries to stem subscription losses in the country  newspaper Les Echos reported on Tuesday  without citing a source.",
        "date": "08302016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Vivendi's pay-TV discusses distribution offers with Iliad in France: media "
    },
    {
        "content": "PARIS  Aug 31 French telecoms operator Orange  is in negotiations with Mobile Telecommunication Company of Iran (MCI)  the country's largest mobile operator  \"regarding a number of areas of potential cooperation and business topics \" a spokesman said.",
        "date": "08312016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-France's Orange says in talks with Iran's MCI on potential cooperation "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  August 18 (Fitch) This rating action commentary replaces the version  published on 27 July to correct Orange's FFO adjusted net leverage at end-2015  to 3.3x from 3.2x in the fifth paragraph of Key Rating Drivers. Fitch Ratings has affirmed Orange S.A.'s Long-Term Issuer Default Rating (IDR)  and senior unsecured rating at 'BBB+'. The Outlook is Stable. A full list of  ratings actions is below. The ratings are supported by the s",
        "date": "08182016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Correction: Fitch Affirms Orange at 'BBB+'; Outlook Stable "
    },
    {
        "content": "TEL AVIV  Aug 17 Israeli mobile operator Partner Communications Wednesday reported a jump in second-quarter profit boosted by a payment from French firm Orange.",
        "date": "08172016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Israel's Partner Comms Q2 profit up on Orange payout "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  July 27 (Fitch) Fitch Ratings has affirmed Orange S.A.'s Long-Term  Issuer Default Rating (IDR) and senior unsecured rating at 'BBB+'. The Outlook  is Stable. A full list of ratings actions is below. The ratings are supported by the strong domestic operations of Orange in France   which accounted for around 60% of the group's restated EBITDA minus capex in  1H16  and by a leverage position that is comfortably within its 'BBB+' r",
        "date": "07272016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Fitch Affirms Orange at 'BBB+'; Outlook Stable "
    },
    {
        "content": "PARIS  July 26 Orange shares fell on Tuesday after second-quarter results from France's leading telecoms operator highlighted pressure on profitability stemming from a price war in the company's home mobile market.",
        "date": "07262016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-Orange shares fall as French mobile price war intensifies "
    },
    {
        "content": "* Has an open mind regarding the potential of a future Telecom Italia-Mediaset merger but nothing on the table at the moment",
        "date": "07262016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Vivendi CEO has open mind on potential Telecom Italia-Mediaset merger "
    },
    {
        "content": "BRUSSELS  July 20 Belgian telecoms group Orange Belgium on Wednesday reported second-quarter core profit that beat analysts' expectations  as it moved more clients to a monthly contract  and said it was a appointing a new chief executive to replace Jean-Marc Harion  leaving to head up its French parent firm Orange's operations in Egypt.",
        "date": "07202016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange Belgium beats Q2 expectations  appoints new CEO "
    },
    {
        "content": "* Orange completes acquisition of mobile operator Airtel in Sierra Leone  Source text for Eikon:  Further company coverage:    (Reporting by Paris Newsroom)",
        "date": "07192016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange completes acquisition of Airtel in Sierra Leone "
    },
    {
        "content": "PARIS Paris prosecutors want France Telecom  the former monopoly now known as Orange  and its former boss Didier Lombard to go on trial for psychological harassment in connection with a wave of staff suicides in 2008-2009  sources said on Thursday.",
        "date": "07072016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Prosecutor seeks France Telecom trial over wave of suicides: sources "
    },
    {
        "content": "PARIS  July 7 Paris prosecutors want France Telecom  the former monopoly now known as Orange  and its former boss Didier Lombard to go on trial for psychological harassment in connection with a wave of staff suicides in 2008-2009  sources said on Thursday.",
        "date": "07072016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Prosecutor seeks France Telecom trial over wave of suicides -sources "
    },
    {
        "content": "* Reg-Press release: orange completes acquisition of mobile operator airtel in burkina faso  Source text for Eikon:  Further company coverage:",
        "date": "06222016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange sa reg-press release orange completes acquisition of mobile operator airtel in burkina faso "
    },
    {
        "content": "LONDON  June 15 European equity futures on Wednesday  marking a slight stabilisation after five previous sessions of losses that were caused by nervousness before next week's vote in Britain on its European Union membership.",
        "date": "06152016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European Factors to Watch-Equity futures rise "
    },
    {
        "content": "LONDON  June 15 European stocks were seen opening higher on Wednesday  marking a slight stabilisation after five previous sessions of losses that were caused by nervousness before next week's vote in Britain on its European Union membership.",
        "date": "06152016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European Factors to Watch-Shares seen opening higher "
    },
    {
        "content": "* Reg-Orange completes the sale of telkom kenya to helios investment partners  Source text for Eikon:  Further company coverage:",
        "date": "06102016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange sa reg-orange completes the sale of telkom kenya to helios investment partners "
    },
    {
        "content": "PARIS  June 14 French number one telecoms operator Orange is open to merger moves in Europe with the aim to become one of the two biggest regional companies in the sector  Chief Executive Officer Stephane Richard said on Tuesday.",
        "date": "06142016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange is open to M&A moves in Europe  CEO says "
    },
    {
        "content": "PARIS The French state is not considering a sale of its 23 percent stake in telecoms group Orange  the head of France's APE state holding agency said on Wednesday.",
        "date": "06012016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "French state has no plan to sell Orange stake: holding agency "
    },
    {
        "content": "PARIS  June 1 The French state is not considering a sale of its 23 percent stake in telecoms group Orange  the head of France's APE state holding agency said on Wednesday.",
        "date": "06012016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "French state has no plan to sell Orange stake - holding agency "
    },
    {
        "content": "BRUSSELS  May 10 French telecom group Orange  has no plans to change its stake in its Belgian unit  its chief executive said on Tuesday.",
        "date": "05102016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange CEO says no plans to change stake in Belgian unit "
    },
    {
        "content": "* Merger talks in France likely to resume \"at some point in time\"   (Recasts  adds analyst comment  shares)",
        "date": "04262016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-Orange not looking at big cross-border telecom deals "
    },
    {
        "content": "DAKAR  April 21 Orange has completed the $160 million acquisition of Democratic of Congo mobile operator subsidiary Tigo DRC from Millicom  the French company said on Thursday  one of four African purchases it has made this year.",
        "date": "04212016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange completes acquisition of Congo mobile operator Tigo DRC "
    },
    {
        "content": "LAGOS  April 5 French telecommunications company Orange is to invest 75 million euro ($85 million) in Nigerian e-commerce group Africa Internet Group (AIG) and become a shareholder  the two companies said on Tuesday.",
        "date": "04052016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange to invest in Nigerian e-commerce group Africa Internet "
    },
    {
        "content": "* Announces the acquisition of a 75 million euro equity interest in Africa Internet Group  joining AXA  Goldman Sachs and longstanding investors MTN Group  Millicom and Rocket Internet  Source text for Eikon:  Further company coverage:    (Reporting by Paris Newsroom)",
        "date": "04052016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Orange buys 75 mln eur stake in Africa Internet Group "
    },
    {
        "content": "PARIS  April 1 Merger talks between French state-controlled telecoms group Orange and smaller rival Bouygues Telecom have failed  a source close to Bouygues told Reuters  confirming an earlier report by Le Figaro newspaper on Friday.",
        "date": "04012016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange-Bouygues telecom merger talks fail - source "
    },
    {
        "content": "PARIS Orange  and Bouygues  have given themselves until Sunday to salvage a merger between France's dominant telecom operator and Bouygues Telecom  citing lack of progress ahead of a Thursday deadline.",
        "date": "03312016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Bouygues sets Sunday deadline to save Orange telecoms deal "
    },
    {
        "content": "PARIS French telecom company Orange  plans to continue to look for opportunities to consolidate and enter new markets in Europe  as well as to grow in Africa and the Middle East after talks to buy Bouygues Telecom  collapsed  its head told Bloomberg. | Video ",
        "date": "04042016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange to expand in Europe  Middle East  Africa after Bouygues talks end: Bloomberg "
    },
    {
        "content": "PARIS Orange  and Bouygues  will extend their talks on the sale of Bouygues's telecom unit beyond the set deadline of March 31 because key issues of value and governance remain unresolved  two sources close to the matter said on Wednesday.",
        "date": "03302016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "No deal yet on sale of Bouygues Telecom to Orange: sources "
    },
    {
        "content": "PARIS/LONDON  April 1 Merger talks between Orange and Bouygues Telecom are hung up on a stand-off between billionaire Martin Bouygues and French Economy Minister Emmanuel Macron about the clout the businessman would gain in the former state monopoly if a deal is reached  sources close to the matter told Reuters.",
        "date": "04012016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 2-Dispute over Bouygues role in Orange hampers telecom merger progress - sources "
    },
    {
        "content": "BORDEAUX  France  April 1 Orange Chief Executive Officer Stephane Richard said on Friday that there was no particular stumbling block to the acquisition of Bouygues'  telecoms unit but that certain legal and financial aspects needed to be resolved.",
        "date": "04012016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange CEO sees no stumbling block to Bouygues Telecom deal "
    },
    {
        "content": "* French Economy Minister's demands unacceptable to Bouygues-sources",
        "date": "04032016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Suspicion and soured relationships sank Bouygues Telecom's deal "
    },
    {
        "content": "PARIS  March 31 Orange and Bouygues  have given themselves until Sunday to salvage a merger between France's dominant telecom operator and Bouygues Telecom  citing lack of progress ahead of a Thursday deadline.",
        "date": "03312016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 2-Bouygues sets Sunday deadline to save Orange telecoms deal "
    },
    {
        "content": "PARIS  April 4 French telecom company Orange  plans to continue to look for opportunities to consolidate and enter new markets in Europe  as well as to grow in Africa and the Middle East after talks to buy Bouygues Telecom collapsed  its head told Bloomberg.",
        "date": "04042016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange to expand in Europe  Middle East  Africa after Bouygues talks end-Bloomberg "
    },
    {
        "content": "PARIS  March 30 Orange and Bouygues  will extend their talks on the sale of Bouygues's telecom unit beyond the set deadline of March 31 because key issues of value and governance remain unresolved  two sources close to the matter said on Wednesday.",
        "date": "03302016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-No deal yet on sale of Bouygues Telecom to Orange -sources "
    },
    {
        "content": "PARIS  April 4 France's biggest telecom stocks all fell sharply on Monday following the breakdown of tie-up talks between Orange and Bouygues that would have reduced the number of competing operators in the country from four to three.",
        "date": "04042016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "French telecom stocks plunge on Orange-Bouygues talks failure "
    },
    {
        "content": "LONDON  April 4 European shares were likely to open slightly lower on Monday after slipping to a one-month low in the previous session  with weaker metals and crude oil prices seen putting pressure on resource-related stocks.",
        "date": "04042016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European Factors to Watch-Shares seen lower  focus on telecoms "
    },
    {
        "content": "* French Economy Minister's demands unacceptable to Bouygues-sources",
        "date": "04042016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "RPT-Suspicion and soured relationships sank Bouygues Telecom's deal "
    },
    {
        "content": "** French Economy Ministry agrees to allow Bouygues  to have a 12 percent stake in Orange if Orange acquires Bouygues Telecom  French news channel BFM Business reports on its website",
        "date": "03242016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "MEDIA-France to allow Bouygues to own 12 pct of Orange - BFM Business "
    },
    {
        "content": "PARIS  March 16 Orange Chief Executive Officer Stephane Richard said on Wednesday that he was about to reach an agreement with rivals SFR and Iliad  on the dividing up of Bouygues Telecom's assets.",
        "date": "03162016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange close to deal with SFR  Iliad on Bouygues Telecom assets "
    },
    {
        "content": "PARIS  March 13 Talks about the sale of Bouygues Telecom to Orange  which could prompt rivals Iliad and Numericable SFR to take on some Bouygues assets  are making good progress  with a deal on these asset sales nearing  the French daily Les Echos reported.",
        "date": "03132016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Deal on Bouygues Tel asset sales to SFR  Iliad nears - report "
    },
    {
        "content": "MILAN A potential merger between Italy's Telecom Italia  and French peer Orange  is a \"fantasy by the press\"  Telecom Italia's chairman  Giuseppe Recchi  said on Friday.",
        "date": "03112016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Telecom Italia's chairman says a merger with Orange is fantasy "
    },
    {
        "content": "MILAN  March 11 A potential merger between Italy's Telecom Italia and French peer Orange  is a \"fantasy by the press\"  Telecom Italia's chairman  Giuseppe Recchi  said on Friday.",
        "date": "03112016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Telecom Italia's chairman says a merger with Orange is fantasy "
    },
    {
        "content": "PARIS  March 10 Iliad Chief Financial Officer Thomas Reynaud said on Thursday that talks about the sale of Bouygues Telecom to Orange  which could see it take on some Bouygues assets  were complex but still continuing.",
        "date": "03102016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Iliad CFO says Bouygues Telecom-Orange talks complex "
    },
    {
        "content": "CAIRO Orange Chief Executive Officer Stephane Richard has said he might look into the possibility of a merger deal with Telecom Italia if French billionaire Vincent Bollore invited him to  but does not think that would happen.",
        "date": "03082016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange CEO says needs invite from Bollore to look at Telecom Italia "
    },
    {
        "content": "CAIRO  March 8 Orange Chief Executive Officer Stephane Richard has said he might look into the possibility of a merger deal with Telecom Italia if French billionaire Vincent Bollore invited him to  but does not think that would happen.",
        "date": "03082016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 2-Orange CEO says needs invite from Bollore to look at Telecom Italia "
    },
    {
        "content": "CAIRO  March 8 Orange Chief Executive Officer Stephane Richard said he would look into the possibility of merging with Telecom Italia if French billionaire Vincent Bollore invited him to.",
        "date": "03082016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange needs invite from Bollore to look into Telecom Italia tie-up "
    },
    {
        "content": "PARIS An improved performance  by its telecoms business helped French conglomerate Bouygues  beat operating profit forecasts  potentially strengthening its hand in its talks over a sale of the telecoms business to larger rival Orange .",
        "date": "02242016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Improved earnings strengthen Bouygues' hand in Orange talks "
    },
    {
        "content": "* CEO says 10-15 pct stake in Orange would be fine   (Adds Bouygues clarifies its seeks 15 pct of Orange)",
        "date": "02242016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 4-Improved earnings strengthen Bouygues' hand in Orange talks "
    },
    {
        "content": "Feb 22 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "02222016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "BARCELONA Orange's  credit rating is unlikely to be impacted by the potential acquisition of Bouygues Telecom  Chief Financial Officer Ramon Fernandez said in an interview with Reuters on Wednesday.",
        "date": "02242016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange says Bouygues Telelcom acquisition unlikely to impact credit rating "
    },
    {
        "content": "BARCELONA  Spain Feb 22 Orange and Bouygues are discussing different deal structures about the sale of the construction group's Bouygues Telecom unit to the French telecoms operator  Orange Chief Executive Officer Stephane Richard said Monday.",
        "date": "02222016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange says needs time to negotiate Bouygues Telecom deal "
    },
    {
        "content": "PARIS Bouygues  is still seeking a stake of about 15 percent in Orange  after tie-up  a spokesman said on Wednesday  clarifying an earlier statement from the company's chief executive officer.",
        "date": "02242016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Bouygues still seeks 15 percent of Orange after tie-up: spokesman "
    },
    {
        "content": "PARIS  Feb 24 Bouygues is still seeking a stake of about 15 percent in Orange after tie-up  a spokesman said on Wednesday  clarifying an earlier statement from the company's chief executive officer.",
        "date": "02242016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Bouygues still seeks 15 percent of Orange after tie-up -spokesman "
    },
    {
        "content": "Feb 24 Bouygues CEO Martin Bouygues tells a news conference: Commenting on tie-up talks between Bouygues Telecom and Orange:",
        "date": "02242016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Bouygues CEO says holding 10-15 pct stake in Orange would fe fine "
    },
    {
        "content": "PARIS  Feb 16 Bouygues' potential stake in French telecoms operator Orange would be around 10 to 15 percent if both groups reach an agreement on the sale of Bouygues' telecom unit  Orange Chief Executive Officer Stephane Richard said on Tuesday.",
        "date": "02162016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange CEO sees potential Bouygues' stake in 10-15 pct range "
    },
    {
        "content": "PARIS Orange  and Bouygues  are likely to reach an initial agreement on the sale of Bouygues's telecoms unit in March at the earliest  amid wrangling over terms that would make Bouygues the second biggest shareholder in Orange after the French state  sources close to the matter said.",
        "date": "02152016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange and Bouygues Telecom seen reaching a deal in March - sources "
    },
    {
        "content": "PARIS  Feb 14 A deal for French telecoms group Orange to take over its rival Bouygues is imminent and a preliminary agreement could be presented on Tuesday when Orange publishes its 2015 earnings  French weekly le Journal du Dimanche (JDD) reported on Sunday.",
        "date": "02142016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange  SFR  Free deal on Bouygues imminent - newspaper "
    },
    {
        "content": "PARIS  Feb 16 French telecoms operator Orange  has no plans to merge with Telecom Italia  Orange Chief Executive Officer Stephane Richard said on Tuesday.",
        "date": "02162016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange CEO says has no plans to merge with Telecom Italia "
    },
    {
        "content": "* Says potential deal with Bouygues Telecom would not lead to a market repair  Further company coverage:    (Reporting by Paris Newsroom)",
        "date": "02162016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Orange CEO says Bouygues Telecom deal wouldn't lead to market repair "
    },
    {
        "content": "* Bouygues' potential stake in Orange under scrutiny -sources",
        "date": "02152016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange and Bouygues Telecom seen reaching a deal in March - sources "
    },
    {
        "content": "PARIS  Feb 15 French telecoms group Orange  denied on Monday that any deal had been reached to divide up Bouygues Telecom assets after weekend press reports that a preliminary agreement could be presented on Tuesday when Orange publishes full-year earnings.",
        "date": "02152016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange says Bouygues Telecom talks continuing  no deal reached "
    },
    {
        "content": "* Says Orange needs several consecutive quarters of growth of its EBITDA to be able to consider increasing its dividend",
        "date": "02162016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Orange CEO says needs several quarters of growth to raise dividend "
    },
    {
        "content": "PARIS France's biggest telecoms operator  Orange  said labor cost cuts and stable revenue helped it return to core profit growth a year earlier than planned in 2015  and forecast a further rise in 2016.",
        "date": "02162016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange forecasts return to core profit growth  pursues Bouygues talks "
    },
    {
        "content": "PARIS  Feb 16 France's biggest telecoms operator  Orange  said labour cost cuts and stable revenue helped it return to core profit growth a year earlier than planned in 2015  and forecast a further rise in 2016.",
        "date": "02162016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange forecasts return to core profit growth  pursues Bouygues talks "
    },
    {
        "content": "* Says Orange and Millicom signed an agreement leading to Orange's acquisition of Millicom's operations in the Democratic Republic of the Congo\u007f\u007f  Source text for Eikon:  Further company coverage:    (Reporting by Paris Newsroom)",
        "date": "02082016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange to buy Millicom's subsidiary in DRC "
    },
    {
        "content": "LONDON  Feb 16 European equity futures rose on Tuesday  tracking gains in Asian equities while telecoms stocks could again come into focus after a deal between British phone network operator Vodafone Plc and John Malone's cable company Liberty Global Plc.",
        "date": "02162016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European Factors to Watch-Futures rise  Vodafone and Liberty seal deal "
    },
    {
        "content": "PARIS The boss of French telecoms group Orange  said on Wednesday that tie-up talks with rival Bouygues  should conclude by the end of February or early March and reiterated previous declarations that the chances of a deal were 50-50.",
        "date": "02032016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange CEO says 'positive dynamic' in talks with Bouygues "
    },
    {
        "content": "PARIS  Feb 3 The boss of French telecoms group Orange said on Wednesday that tie-up talks with rival Bouygues should conclude by the end of February or early March and reiterated previous declarations that the chances of a deal were 50-50.",
        "date": "02032016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange CEO says \"positive dynamic\" in talks with Bouygues "
    },
    {
        "content": "* \u007fSays completes sale of its shares in mobile operator EE to BT\u007f",
        "date": "01292016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange completes sale of its stake in EE to BT "
    },
    {
        "content": "YAOUNDE  Jan 20 The local units of Orange  and MTN owe Cameroon nearly 100 billion CFA francs ($166 million) in unpaid taxes  including on games  the Central African nation's corruption board said on Wednesday.",
        "date": "01202016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "CORRECTED-UPDATE 1-Orange  MTN owe $166 mln in taxes to Cameroon - graft watchdog "
    },
    {
        "content": "PARIS French telecommunications operator Orange  has started informal talks with rivals Numericable-SFR  and Iliad  on possible asset sales to satisfy competition concerns in case it acquires Bouygues Telecom  sources close to the matter said.",
        "date": "01152016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange talking to rivals about selling Bouygues Telecom assets: sources "
    },
    {
        "content": "* Potential Orange  Bouygues deal could be reached before Feb. 16   (Adds comments on EE sale  regulatory screening of the deal)",
        "date": "01152016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 2-Orange talking to rivals about selling Bouygues Telecom assets -sources "
    },
    {
        "content": "PARIS  Jan 15 French telecommunications operator Orange has started informal talks with rivals Numericable-SFR and Iliad on possible asset sales to satisfy competition concerns in case it acquires Bouygues Telecom  sources close to the matter said.",
        "date": "01152016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange talking to rivals about selling Bouygues Telecom assets -sources "
    },
    {
        "content": "PARIS  Jan 12 Orange Chief Executive Stephane Richard said on Tuesday that a merger with rival French telecoms operator Bouygues would have to create value for the company and safeguard jobs in the sector.",
        "date": "01122016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange CEO says Bouygues merger would have to create value "
    },
    {
        "content": "PARIS The boss of France's biggest telecoms firm Orange has been ordered to appear before a special disciplinary tribunal next week in connection with a financial scandal while he was chief of staff to the country's finance minister.",
        "date": "01132016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "French telecoms boss Richard to face tribunal over Tapie affair "
    },
    {
        "content": "PARIS  Jan 15 Orange  France's biggest telecommunications firm  has started informal talks with rivals Numericable-SFR and Iliad on possible asset sales in case it would acquire Bouygues' telecoms unit  sources close to the matter said.",
        "date": "01152016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange talking to rivals about selling Bouygues Telecom assets-sources "
    },
    {
        "content": "* Orange CEO says consolidation needed in French telecoms sector",
        "date": "01122016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange CEO says Bouygues merger would have to create value "
    },
    {
        "content": "PARIS  Jan 13 The boss of France's biggest telecoms firm Orange has been ordered to appear before a special disciplinary tribunal next week in connection with a financial scandal while he was chief of staff to the country's finance minister.",
        "date": "01132016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "REFILE-French telecoms boss Richard to face tribunal over Tapie affair "
    },
    {
        "content": "PARIS French mobile telecom operator Coriolis in interested in taking over the business telecommunications arm of Bouygues Telecom  which is in merger talks with France's number one operator orange  Les Echos newspaper reported on Monday.",
        "date": "01112016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "French operator Coriolis interested in Bouygues business telecom arm: Les Echos "
    },
    {
        "content": "* Acquisition realized through\u007f its subsidiary Orange Côte d'Ivoire\u007f\u007f  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "01122016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Orange acquires 100% of mobile operator Cellcom Liberia\u007f "
    },
    {
        "content": "PARIS Plans to cut the number of players in the French telecoms industry were firmly back on the table on Tuesday after Orange  revived talks with Bouygues Telecom to create a giant with more than half of the country's fixed-line and mobile markets. | Video ",
        "date": "01052016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange  Bouygues Telecom revive French merger plans "
    },
    {
        "content": "PARIS France's state-controlled telecoms group Orange  signed a confidentiality agreement with conglomerate Bouygues  with a view to buying its telecoms arm for 10 billion euros  ($10.86 billion) in cash and shares  a French newspaper said on Sunday.",
        "date": "01032016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange-Bouygues tie-up talks in France advancing: report "
    },
    {
        "content": "* Orange CEO says merger must not destroy jobs   (Adds comments by Orange's CEO  French official; closing share prices)",
        "date": "01052016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 3-Orange  Bouygues Telecom revive French merger plans "
    },
    {
        "content": "* Says \u007fGroupama and Orange enter exclusive negotiations for creation of \"Orange Bank\"",
        "date": "01042016",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange says in talks with Groupama to create \"Orange Bank\"\u007f "
    },
    {
        "content": "PARIS  Jan 3 France's state-controlled telecoms group Orange signed a confidentiality agreement with conglomerate Bouygues with a view to buying its telecoms arm for 10 billion euros  ($10.86 billion) in cash and shares  a French newspaper said on Sunday.",
        "date": "01032016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange-Bouygues tie-up talks in France advancing - report "
    },
    {
        "content": "LONDON  Jan 4 European equity futures fell sharply on Monday  as weak Chinese economic data weighed on world stock markets.",
        "date": "01042016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European Factors to Watch-Equity futures fall sharply "
    },
    {
        "content": "LONDON  Jan 4 European stocks were seen opening lower on Monday  tracking a pullback on Asian and U.S. equity markets  while weak Chinese economic data was also expected to weigh on shares.",
        "date": "01042016",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European Factors to Watch-Shares seen opening lower "
    },
    {
        "content": "LONDON  Dec 30 European stocks were seen steady at the open on Wednesday  although a pullback in oil prices could weigh on the shares of energy companies.",
        "date": "12302015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European Factors to Watch-Shares expected to be steady at open "
    },
    {
        "content": "Dec 29 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "12292015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON  Dec 11 European equity futures fell on Friday  with a leading regional equity index set for a weekly loss  as falling commodity prices put pressure on markets before a widely expected rise in U.S. interest rates next week.",
        "date": "12112015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European Factors to Watch-Equity futures fall "
    },
    {
        "content": "LONDON  Dec 11 European stocks were seen opening lower on Friday  with a leading regional equity index set for a weekly loss  as falling commodity prices put pressure on markets before a widely expected rise in U.S. interest rates next week.",
        "date": "12112015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European Factors to Watch-Shares seen slightly weaker at open "
    },
    {
        "content": "France's largest telecom operator  Orange SA  is in talks to buy telecommunication and media assets from Bouygues SA  Bloomberg reported on Monday  citing sources.",
        "date": "12072015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "France's Orange in talks to buy Bouygues telecom  media assets: Bloomberg "
    },
    {
        "content": "PARIS  Dec 10 France's Economy Minister said he did not oppose in principle a consolidation of the country's telecoms sector to three operators from four  as state-controlled telecoms group Orange started talks about possibly buying a stake in Bouygues Telecom.",
        "date": "12102015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-France eases telecom merger stance as Bouygues back in play "
    },
    {
        "content": "PARIS Orange said on Wednesday it did not need additional provisions to cover an antitrust case in France after a newspaper report said the French telecoms group faced a fine of more than 500 million euros ($530 million).",
        "date": "12022015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange says no need for more provisions in French antitrust case "
    },
    {
        "content": "PARIS  Nov 30 French telecoms group Orange  said on Monday it was not in talks with Italian peer Telecom Italia but had hired advisory banks to finetune its assessment of the European telecoms sector.",
        "date": "11302015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange says not in talks with Telecom Italia  studying sector "
    },
    {
        "content": "PARIS  Dec 2 Orange said on Wednesday it did not need additional provisions to cover an antitrust case in France after a newspaper report said the French telecoms group faced a fine of more than 500 million euros ($530 million).",
        "date": "12022015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange says no need for more provisions in French antitrust case "
    },
    {
        "content": "ROME  Nov 30 Telecom Italia has had no contacts with France's Orange or any other telecoms operators  the Italian phone company's Chief Executive Marco Patuano said on Monday.",
        "date": "11302015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Telecom Italia CEO says no contacts with Orange  other operators "
    },
    {
        "content": "PARIS  Dec 2 France's competition watchdog could fine telecommunications company Orange more than 500 million euros ($528 million) for abusing a dominant position in the business segment  Le Figaro reported on its website on Wednesday.",
        "date": "12022015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange may face antitrust fine of more than 500 mln eur-Le Figaro "
    },
    {
        "content": "* Orange signs an agreement with Helios Investment Partners for sale of its stake in Telkom Kenya",
        "date": "11092015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange to sell its 70 percent stake in Telkom Kenya. "
    },
    {
        "content": "* New core profit goal of 12.3 bln euros or more   (Adds shares  explanation for guidance increase  analyst comment)",
        "date": "10222015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-Orange raises annual profit target as recovery takes hold "
    },
    {
        "content": "* Local media says buyer likely to be Helios Partners   (Updates with reports of potential buyer)",
        "date": "10012015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange in final talks to sell Kenyan mobile stake - minister "
    },
    {
        "content": "NAIROBI  Oct 1 France's Orange SA is in the final round of negotiations with an unidentified party to sell its 70 percent stake in Orange Kenya  Kenya's finance minister said.",
        "date": "10012015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange in final talks to sell Kenyan mobile stake -minister "
    },
    {
        "content": "TEL AVIV  Sept 16 Israel-based Hola  a video distribution network for publishers  said on Wednesday it raised $17 million in a funding round led by Iris Capital  a strategic partnership between France's Orange  and Publicis Groupe.",
        "date": "09162015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange  Publicis invest in Israeli video distributor Hola "
    },
    {
        "content": "PARIS  Sept 13 French Culture Minister Fleur Pellerin has ruled out allowing prime time advertising on public TV broadcasters  saying an increase in their funding should come from a slight increase in the TV tax.",
        "date": "09132015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-French culture minister rules out prime time ads on public TV "
    },
    {
        "content": "PARIS  Sept 7 Orange Chief Executive Stephane Richard has told French daily Les Echos that consolidation could return to focus in the telecoms sector next year following the sale of new 4G frequencies.",
        "date": "09072015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange CEO says sector consolidation may return in 2016 -paper "
    },
    {
        "content": "SANTANDER  Spain  Sept 2 French telecom group Orange will consider listing its Spanish business but has taken no decision on timing  the head of the company's Spanish operations said on Wednesday.",
        "date": "09022015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange Spain CEO says company will consider listing Spanish unit "
    },
    {
        "content": "* Says completed Jazztel squeeze-out process on remaining 5.25 percent of share capital at 13 euros a share  Jazztel to be delisted on Aug. 19  Further company coverage:",
        "date": "08182015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange says completed Jazztel squeeze-out "
    },
    {
        "content": "JERUSALEM  Aug 12 Partner Communications Co Ltd   Israel's second-largest mobile phone operator which operates under the Orange brand name  has reported an 80 percent drop in quarterly profit  citing intense competition.",
        "date": "08122015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "CORRECTED-UPDATE 1-Israel's Orange 2nd-quarter profit slides 80 pct "
    },
    {
        "content": "JERUSALEM  Aug 12 Partner Communications Co Ltd   Israel's second-largest mobile phone operator which operates under the Orange brand name  has reported an 80 percent drop in quarterly profit  citing intense competition.",
        "date": "08122015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Israel's Orange 2nd-quarter profit slides 80 pct "
    },
    {
        "content": "* Orange SA and Masmovil agree on fixed broadband asset allocation on favorable terms: sale of fiber network and wholesale access to xDSL",
        "date": "08102015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Masmovil Ibercom and Orange agree on fixed broadband asset allocation "
    },
    {
        "content": "* Signs an agreement with Ucom for sale of 100 pct of its shares in Orange Armenia",
        "date": "08072015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange to divest Orange Armenia to Ucom "
    },
    {
        "content": "* Signs deal to extend Mobile Virtual Network Operator (MVNO) contract on with Orange till 2022",
        "date": "08062015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Masmovil Ibercom extends MVNO contract with Orange till 2022 "
    },
    {
        "content": "PARIS  July 29 France's Bpifrance public investment bank said Wednesday it is selling 2 percent of French telecom operator Orange shares in a deal a banking source said was worth about 805 million euros ($887.43 million).",
        "date": "07292015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Bpifrance selling 2 pct stake in Orange "
    },
    {
        "content": "* Shares rise as much as 3 percent   (Adds shares  analyst  debt comments)",
        "date": "07282015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-Orange confirms annual targets as recovery signs grow "
    },
    {
        "content": "PARIS  July 28 France's largest telecom operator Orange inched closer to a long-awaited recovery in the second quarter as customers shifted to high-speed mobile and broadband services  allowing it to confirm its annual profit  debt and dividend targets.",
        "date": "07282015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange confirms annual targets as recovery takes hold "
    },
    {
        "content": "PARIS  July 24 French telecoms group Orange  will open a bank in France at the beginning of next year with a partner from the banking sector  its chief executive said in an interview with Le Figaro on Friday.",
        "date": "07242015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange to open bank in France  CEO tells Le Figaro "
    },
    {
        "content": "MUMBAI  July 21 Bharti Airtel Ltd  the biggest Indian cellphone carrier  said on Tuesday it had no plans to exit Africa  despite beginning exclusive talks with France's Orange to sell four of its units there.",
        "date": "07212015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Bharti Airtel says no plan to exit Africa  despite Orange talks "
    },
    {
        "content": "PARIS  July 24 French telecom operator Orange  said on Friday it had acquired an additional 9 percent stake in Moroccan operator Meditel  raising its total holding to 49 percent.",
        "date": "07242015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "France's Orange builds 49 pct stake in Moroccan telecom firm Meditel "
    },
    {
        "content": "LONDON  July 2 Telecom operator Orange  aims to grow revenue from its Africa and Middle East operation by about 5 percent a year through 2018 and is looking for expansion opportunities in the region  Chief Financial Officer Ramon Fernandez said.",
        "date": "07022015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange aims for growth in Africa  Middle East "
    },
    {
        "content": "BRUSSELS  July 2 The European Union's second highest court on Thursday found a shareholder loan given to France Telecom  now named Orange  was not state aid and therefore was legal.",
        "date": "07022015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Shareholder loan given to Orange was not state aid-EU court "
    },
    {
        "content": "PARIS  June 30 French telecoms group Orange  and Israeli mobile phone operator Partner Communications said on Tuesday they had agreed terms to end their licensing deal following a public row in Israel  but Orange said it was still committed to Israel.",
        "date": "06302015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange  Partner Communications set terms to end brand deal "
    },
    {
        "content": "PARIS  June 30 French telecoms group Orange  said it had signed a agreement with Partner Communications that gave both companies the right to terminate their Orange brand license agreement.",
        "date": "06302015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange  Partner Communications sign deal to end brand agreement "
    },
    {
        "content": "PARIS Orange   France's largest telecoms company  will continue to play a leading role in creating pan-European networks through acquisitions  its chief executive told the Financial Times in an interview given last week and published on Tuesday.",
        "date": "06232015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange 'has role to play' in European telecoms industry consolidation: FT "
    },
    {
        "content": "PARIS  June 23 Orange  France's largest telecoms company  will continue to play a leading role in creating pan-European networks through acquisitions  its chief executive told the Financial Times in an interview given last week and published on Tuesday.",
        "date": "06232015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange 'has role to play' in European telecoms industry consolidation-FT "
    },
    {
        "content": "MADRID French telecom group Orange  said on Friday it would take Spanish rival Jazztel  private after its $3.8 billion takeover was overwhelmingly backed by Jazztel shareholders.",
        "date": "06262015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange to delist Jazztel after shareholders overwhelmingly back bid "
    },
    {
        "content": "* Reaches deal with Orange SA to access its 4G network  allowing to complement Masmovil offer for mobile and multi-play broadband  Source text: http://bit.ly/1GkxhZp",
        "date": "06232015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Masmovil Ibercom reaches deal with Orange to access its 4G network "
    },
    {
        "content": "MADRID  June 26 French telecom group Orange  said on Friday it would take Spanish rival Jazztel  private after its $3.8 billion takeover was overwhelmingly backed by Jazztel shareholders.",
        "date": "06262015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 2-Orange to delist Jazztel after shareholders overwhelmingly back bid "
    },
    {
        "content": "MADRID  June 26 France's Orange on Friday said it would launch an obligatory buyout offer for the remaining 5.25 percent of Jazztel it did not get during the voluntary acceptance period of its takeover bid for the Spanish group.",
        "date": "06262015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange launches compulsory buyout for rest of Spain's Jazztel "
    },
    {
        "content": "MADRID  June 26 The takeover bid of French telecoms group Orange of Spain's Jazztel was accepted by 95 percent of shareholders of the Spanish group  business daily Expansion said on Friday.",
        "date": "06262015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange bid for Jazztel accepted by 95 pct of shareholders -report "
    },
    {
        "content": "* Orange Digital Ventures invests 3 million euros ($3.4 million) in Actility",
        "date": "06162015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Orange Digital Ventures invests 3 mln euros in Actility "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  June 09 (Fitch) Fitch Ratings has revised Orange S.A.'s Outlook to  Stable from Negative  while affirming its Long-term Issuer Default Rating (IDR)  at 'BBB+'. Fitch has also assigned a rating of 'BBB-' to Orange's deeply  subordinated fixed-rate notes (hybrid securities). A full list of rating actions  is available below. The revision of the Outlook to Stable is driven by our expectations of  stabilising operational trends with",
        "date": "06092015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Fitch Revises Orange S.A.'s Outlook to Stable; Affirms at 'BBB+' "
    },
    {
        "content": "JERUSALEM  June 12 The chief executive of French telecoms group Orange told Prime Minister Benjamin Netanyahu on Friday he profoundly regretted remarks he made last week which he said were misinterpreted to make it sound as if he supported a boycott of Israel.",
        "date": "06122015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange CEO tells Netanyahu firm will deepen Israel ties "
    },
    {
        "content": "JERUSALEM  June 11 Orange chief executive Stephane Richard  whose remarks about ending a licensing deal have caused anger in Israel  will meet Prime Minister Benjamin Netanyahu on Friday during a visit to the country  a company spokeswoman said.",
        "date": "06112015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange CEO arrives in Israel after diplomatic spat "
    },
    {
        "content": "JERUSALEM/PARIS Orange's CEO Stephane Richard has accepted an invitation from Prime Minister Benjamin Netanyahu to visit Israel as he tries to end a diplomatic row sparked by his remarks about ending a licensing deal there.",
        "date": "06082015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Israel talks tough in row over 'hostile' remarks by Orange CEO "
    },
    {
        "content": "JERUSALEM/PARIS  June 8 Orange's CEO Stephane Richard has accepted an invitation from Prime Minister Benjamin Netanyahu to visit Israel as he tries to end a diplomatic row sparked by his remarks about ending a licensing deal there.",
        "date": "06082015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Israel talks tough in row over 'hostile' remarks by Orange CEO "
    },
    {
        "content": "JERUSALEM  June 7 Orange's CEO Stephane Richard should come to Israel to explain his \"hostile\" remarks about ending the telecom company's licensing deal in the country  Prime Minister Benjamin Netanyahu was quoted as saying on Sunday.",
        "date": "06072015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Israel talks tough in row over 'hostile' remarks by Orange CEO "
    },
    {
        "content": "* Sees Tunisia as potential growth market   (Adds details  background)",
        "date": "06032015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange to adjust Egypt  Morocco investments in North Africa growth push "
    },
    {
        "content": "PARIS  June 5 France's foreign minister sought to calm a row with Israel on Friday  saying Paris opposed any boycott of the Jewish state  but stressed telecom firm Orange  which plans to end its licence deal there  was free to define its own policy.",
        "date": "06052015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 3-France \"opposed\" to Israel boycott amid Orange row "
    },
    {
        "content": "* Israeli company has used Orange brand name since 1998   (Adds Netanyahu urging France to renounce Orange's plans)",
        "date": "06042015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-France's Orange plans to end brand licensing deal in Israel "
    },
    {
        "content": "* Says board recommends acceptance of France's Orange's  takeover offer",
        "date": "06022015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Spain's Jazztel board recommends accepting Orange takeover offer "
    },
    {
        "content": "MADRID  May 27 French telecoms group Orange  said on Wednesday it saw no need to buy further assets in Spain following a takeover of Spanish rival Jazztel  which was approved by the Spanish regulator on Tuesday.",
        "date": "05272015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange sees no need for more Spanish assets after Jazztel buy "
    },
    {
        "content": "* Names internal executive Fabienne Dulac to run France business  its biggest unit",
        "date": "05272015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Orange names Fabienne Dulac to run France business "
    },
    {
        "content": "LONDON  May 18 BT  seeking regulatory approvals for its 12.5 billion-pound ($20 billion) deal to acquire UK mobile network operator EE from Orange and Deutsche Telekom  has asked the British competition authorities to move straight to a full investigation  avoiding a preliminary review.",
        "date": "05182015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BT seeks speedier UK competition probe into EE acquisition "
    },
    {
        "content": "May 5 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "05052015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "PARIS Orange  has begun talks with several potential buyers for parts of Jazztel's  fiber network  which it has agreed to sell to get regulatory approval for the takeover of the Spanish broadband company.",
        "date": "05052015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange in talks with buyers of fiber assets to get Jazztel deal approved "
    },
    {
        "content": "PARIS  May 5 Orange has begun talks with several potential buyers for parts of Jazztel's  fibre network  which it has agreed to sell to get regulatory approval for the takeover of the Spanish broadband company.",
        "date": "05052015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange in talks with buyers of fibre assets to get Jazztel deal approved "
    },
    {
        "content": "BRUSSELS/MADRID French telecoms group Orange  is set to secure European Union approval for its 3.4-billion-euro ($3.79 billion) deal to acquire Spanish fixed line network operator Jazztel after offering to strengthen rivals in Spain  four people familiar with the matter said on Thursday.",
        "date": "04302015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Exclusive: EU regulators to clear Orange deal to buy Jazztel - sources "
    },
    {
        "content": "PARIS  April 27 An investment management company is seeking to prevent French telecommunications company Orange shifting to a system where long-term investors get two votes per share rather than one  a move that has failed in other high-profile cases.",
        "date": "04272015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Investors challenge two-for-one vote regime at France's Orange "
    },
    {
        "content": "PARIS  May 5 Orange has already begun discussions with several potential buyers for parts of Jazztel's  fibre network  which it has agreed to sell to obtain regulatory approval for the takeover of the Spanish broadband company.",
        "date": "05052015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange in talks with buyers of fibre assets to get Jazztel deal approved "
    },
    {
        "content": "* Says French telecommunications operator Orange  must give its smaller rival MasMovil access to 4G mobile network",
        "date": "05052015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Spain's competition watchdog forces Orange to share 4G network "
    },
    {
        "content": "* 2015 targets include 11.9-12.1 bln euro core profit   (Adds executive and analyst comments  details  stock move)",
        "date": "04282015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-Orange confirms 2015 targets despite weak first-quarter profit "
    },
    {
        "content": "PARIS/FRANKFURT  April 28 Orange SA  France's largest telecom operator  posted  slightly lower quarterly results on Tuesday that were largely in line with expectations as mobile subscriber growth and expense-cutting failed to offset higher network spending.",
        "date": "04282015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange confirms targets after posting in-line Q1 results "
    },
    {
        "content": "* To write down 11 mln stg of unrecoverable bills at gas unit",
        "date": "04162015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-Telecom Plus to take writedown  sees profit below market estimates "
    },
    {
        "content": "PARIS French media group Vivendi has entered exclusive talks to buy 80 percent of video-sharing website Dailymotion from telecom operator Orange for 217 million euros ($236 million)  the companies said on Tuesday.",
        "date": "04072015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Vivendi in exclusive talks to buy Orange's Dailymotion "
    },
    {
        "content": "PARIS French media group Vivendi has made a 250 million euro ($275 million) indicative offer for most of Dailymotion  the video-sharing website owned by French telecoms group Orange  a source said on Monday.",
        "date": "04062015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Vivendi offers Eur 250 million for most of Dailymotion: source "
    },
    {
        "content": "PARIS  April 3 The French state will get double voting rights at telecom group Orange in 2016  potentially allowing it to sell some of its 25 percent stake without losing influence as it takes advantage of recent legislation.",
        "date": "04032015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "France to get double vote at telecoms group Orange "
    },
    {
        "content": "PARIS  April 7 French media group Vivendi  has entered exclusive talks to buy 80 percent of video-sharing website Dailymotion from telecom operator Orange  for 217 million euros ($236 million)  the companies said on Tuesday.",
        "date": "04072015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 2-Vivendi in exclusive talks to buy Orange's Dailymotion "
    },
    {
        "content": "PARIS  April 6 French media group Vivendi  has made a 250 million euro ($275 million) indicative offer for most of Dailymotion  the video-sharing website owned by French telecoms group Orange  a source said on Monday.",
        "date": "04062015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 2-Vivendi offers Eur 250 mln for most of Dailymotion-source "
    },
    {
        "content": "PARIS  April 7 French media group Vivendi  has entered exclusive talks to buy 80 percent of video-sharing website Dailymotion from telecom operator Orange  for 217 million euros ($236 million)  the companies said in a joint statement on Tuesday.",
        "date": "04072015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Vivendi enters exclusive talks to buy Orange's Dailymotion "
    },
    {
        "content": "PARIS  April 6 Hong Kong conglomerate PCCW  said on Monday it had ended talks to form an alliance with French telecoms group Orange's Dailymotion  citing the French government's desire to see the video-sharing site remain in European hands.",
        "date": "04062015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Hong Kong's PCCW ends alliance talks with France's Dailymotion "
    },
    {
        "content": "March 31 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "03312015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "BRUSSELS  March 19 European Union antitrust regulators have suspended their investigation into French telecoms operator Orange's 3.4-billion-euro ($3.64 billion) bid for Spanish peer Jazztel because the firms failed to provide some data on the deal.",
        "date": "03192015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "EU regulators halt Orange  Jazztel probe  await data from firms "
    },
    {
        "content": "PARIS France's Orange will plow 15 billion euros ($15.9 billion) into upgrading networks until 2018 to differentiate itself from rivals in a price war in its domestic market.",
        "date": "03172015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange to boost network investments to fuel recovery by 2018 "
    },
    {
        "content": "PARIS  March 17 France's Orange will plough 15 billion euros ($15.9 billion) into upgrading networks until 2018 to differentiate itself from rivals in a price war in its domestic market.",
        "date": "03172015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange to boost network investments to fuel recovery by 2018 "
    },
    {
        "content": "* Orange expected to sign similar deal on Thursday   (Adds quotes  details from ceremony  Orange deal)",
        "date": "03112015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-Cameroon renews MTN mobile licence for 15 years  approves 3G and 4G "
    },
    {
        "content": "BRUSSELS  March 10 French telecoms group Orange  has offered concessions to European Union antitrust regulators in an attempt to ease competition concerns about its 3.4-billion-euro ($3.66 billion) deal to buy Spanish operator Jazztel.",
        "date": "03102015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Orange offers competition regulators concessions on Jazztel deal "
    },
    {
        "content": "BARCELONA  March 4 French telecoms group Orange  wants to remain in Belgium where it has a 51 percent stake in Mobistar MSTAR.BR>  the country's second biggest mobile operator  and has not been  contacted about a potential bid for Mobistar's smaller rival Base  a top executive said on Wednesday.",
        "date": "03042015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 1-Orange says will remain in Belgium as consolidation brews "
    },
    {
        "content": "* Telecom Italia shares up 1.7 pct  Orange flat   (Adds more source  Deutsche Telekom comments  updates shares)",
        "date": "03022015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 3-Telecom Italia shares hit four-year high on Orange interest "
    },
    {
        "content": "BARCELONA Telecom Italia shares rose as much as 3 percent on Monday after Orange boss Stephane Richard said a combination with the Italian company would be attractive.",
        "date": "03022015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Telecom Italia shares climb on Orange deal interest "
    },
    {
        "content": "LONDON  March 2 Europe's top European indexes made fresh multi-year highs on Monday as a boost from merger activity in the telecoms sector more than offset falls in media group Vivendi.",
        "date": "03022015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Telecoms M&A helps European shares to fresh 7-year highs "
    },
    {
        "content": "* Signs an agreement with Orange to acquire Orange's digital advertising networks in Spain  in the United States and in Mexico",
        "date": "02232015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "BRIEF-Hi Media to acquire Orange's digital advertising networks in Spain  U.S.  and Mexico "
    },
    {
        "content": "MILAN  March 2 Shares in Telecom Italia  rose in early trading on Monday after the chief executive of France's Orange said the two companies had been discussing a possible alliance.",
        "date": "03022015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Shares in Telecom Italia up after Orange signals interest "
    },
    {
        "content": "LONDON  March 2 European shares were seen kicking off March on a flat note on Monday  with many regional benchmarks hovering at multi-year highs after the best start to the year since they started trading in late 1986.",
        "date": "03022015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "European Factors to Watch-Indexes to make flat start to March "
    },
    {
        "content": "* Major Saudi mobile operators tumble as regulator caps charges",
        "date": "02232015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "MIDEAST STOCKS-Gulf markets consolidate as oil dips; telco deal boosts Egypt "
    },
    {
        "content": "PARIS Europe's big telecom firms are back to rude financial health after years of poor results and regulatory pressure  drawing crowds of new investors and protests from rivals who worry the formerly state-owned companies may rebuild their monopolies.",
        "date": "02272015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Europe's big telecoms roar back to health  worrying rivals "
    },
    {
        "content": "DUBAI  Feb 23 Telecommunications stocks boosted Egypt's equity market on Monday after French operator Orange said it would increase its stake in local firm Mobinil  while two major phone operators in Saudi Arabia fell as the regulator cut the fees they can charge.",
        "date": "02232015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 2-MIDEAST STOCKS-Telecoms boost Egypt  drag down Saudi Arabia "
    },
    {
        "content": "* Buys out Orascom Telecom Media and Technology (OTMT) participation and rights in the Egyptian Company for Mobile Services Mobinil (ECMS)",
        "date": "02232015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BRIEF-Orange buys out OTMT's participation and rights in ECMS for EUR 209.6 mln "
    },
    {
        "content": "PARIS  Feb 17 Telecoms operator Orange  predicted its operating profit would slip this year  as tough competition persists in its key home market of France  but pledged to hold the line on costs to be able to deliver a stable dividend.",
        "date": "02172015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 2-Orange pledges to tame costs to keep 2015 dividend stable "
    },
    {
        "content": "PARIS  Feb 17 France's biggest telecom operator Orange posted in-line revenue and operating profit for last year as continued cost-cutting helped it maintain profitability despite sales shrinking across its major markets amid tough competition.",
        "date": "02172015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange pledges to hold 2015 dividend stable after in-line results "
    },
    {
        "content": "* Shares up 4.6 percent to 14-year high   (Adds EE  DT comments  advisers  updates shares)",
        "date": "02052015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "UPDATE 3-BT seals EE deal to dominate British telecoms market "
    },
    {
        "content": "Feb 5 The following corporate finance-related stories were reported by media:",
        "date": "02052015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-Market Chatter-Corporate finance press digest "
    },
    {
        "content": "Feb 4 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "02042015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Feb 4 French telecoms group Orange has explored purchasing some assets in Africa including ones owned by India's top mobile phone carrier Bharti Airtel  as the company seeks to strengthen its business in Africa  Bloomberg reported  citing people familiar with the matter.",
        "date": "02042015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange eyes Bharti's African assets to create \"Orange Africa\" -Bloomberg "
    },
    {
        "content": "LONDON BT  has reached agreement with Orange  and Deutsche Telekom ‎ to buy their UK mobile network operator EE and a deal could be announced as early as Thursday morning  a person familiar with the situation said.",
        "date": "02042015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "BT finalizes deal to buy EE: source "
    },
    {
        "content": "LONDON  Feb 4 BT has reached agreement with Orange and Deutsche Telekom \u007f to buy their UK mobile network operator EE and a deal could be announced as early as Thursday morning  a person familiar with the situation said.",
        "date": "02042015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "UPDATE 1-BT finalises deal to buy EE  -source "
    },
    {
        "content": "BRUSSELS  Jan 27 Mobile operators such as Vodafone and Orange would be allowed to continue levying roaming charges over the next three years  according to an EU document  defying European lawmakers' proposal to scrap the fees by the end of this year.",
        "date": "01272015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Mobile roaming fees should remain until 2018 - EU document "
    },
    {
        "content": "BRUSSELS European Union antitrust regulators have resumed their scrutiny of Orange's bid for Spanish peer Jazztel after the French telecoms operator provided details of the 3.4-billion-euro ($3.95 billion) deal as requested.",
        "date": "01202015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "EU regulators resume Orange  Jazztel 3.4 billion euro merger scrutiny "
    },
    {
        "content": "BRUSSELS  Jan 20 European Union antitrust regulators have resumed their scrutiny of Orange's bid for Spanish peer Jazztel after the French telecoms operator provided details of the 3.4-billion-euro ($3.95 billion) deal as requested.",
        "date": "01202015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "EU regulators resume Orange  Jazztel 3.4 bln euro merger scrutiny "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  January 08 (Fitch) Fitch Ratings has affirmed Orange S.A.'s Long-term  Issuer Default Rating (IDR) at 'BBB+' with Negative Outlook. A full list of  rating actions is below. Orange continues to face a number of challenges in its domestic market  some  international operations and the Enterprise business. These have been driven by  intense competition  tariff rebalancing  regulation  the macro-economic backdrop  and increased inve",
        "date": "01082015",
        "name": "Orange",
        "news_type": "topStory",
        "symbol": "ORAN",
        "title": "Fitch Affirms Orange at 'BBB+'; Outlook Negative "
    },
    {
        "content": "PARIS  Jan 13 French telecoms group Orange hopes to close a deal to sell its stake in UK mobile operator EE to British telecoms group BT quite soon and will look at further consolidation of the French telecoms market along with other opportunities once the deal is done  its boss said on Tuesday.",
        "date": "01132015",
        "name": "Orange",
        "news_type": "normal",
        "symbol": "ORAN",
        "title": "Orange looks again to French telco consolidation after EE sale "
    }
]