[
    {
        "content": "WASHINGTON  Nov 15 Software maker Oracle Corp is backing bipartisan legislation that aims to toughen foreign investment rules amid increasing concern over Chinese efforts to buy U.S. high-tech companies  according to a letter seen by Reuters on Wednesday.",
        "date": "11152017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle backs tougher foreign investment bills aimed at China "
    },
    {
        "content": "* Everest Group PEAK Matrix assessment for life sciences clinical trial products names Oracle Health Sciences as a top leader Source text for Eikon: Further company coverage:",
        "date": "11142017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle Health Sciences says Everest Group PEAK Matrix names co as top leader "
    },
    {
        "content": "BEIJING Amazon.com Inc is selling off the hardware from its public cloud business in China  amid tightening regulation over online data that is creating a hurdle for technology firms operating in the world's second-largest economy.",
        "date": "11142017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Amazon sells off China cloud assets as tough new rules bite "
    },
    {
        "content": "* Firm will continue to sell AWS services in China (Recasts  adds detail  AWS comment and context)",
        "date": "11142017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 1-Amazon sells off China cloud assets as tough new rules bite "
    },
    {
        "content": "* Oracle Corp files a final pricing term sheet for five-‍​part offering of a total of up to $10.00 billion - SEC filing Source text for Eikon: (http://bit.ly/2zrPIlR) Further company coverage:",
        "date": "11082017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle Corp files for offering of up to $10 billion "
    },
    {
        "content": "* Oracle Corp files for ‍​potential five-part notes offering; size not disclosed - SEC Filing",
        "date": "11072017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle Corp files for ‍​potential five-part notes offering size not disclosed "
    },
    {
        "content": "* ‍Oracle prices $10 billion aggregate principal amount of investment grade notes​",
        "date": "11082017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-‍Oracle prices $10 billion aggregate principal amount of investment grade notes​ "
    },
    {
        "content": "* Oracle Corp - ‍named IBM as a strategic partner to provide business process outsourcing for human resources delivered on Oracle HCM cloud platform​ Source text for Eikon: Further company coverage:",
        "date": "10102017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle names IBM as strategic HR BPO provider "
    },
    {
        "content": "SAN FRANCISCO  Oct 2 Oracle Corp Co-Chief Executive Mark Hurd on Monday said he does not understand Trump administration immigration policies that make it difficult for foreigners to work in the United States after earning an education there.",
        "date": "10022017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle Co-CEO denounces Trump immigration policies "
    },
    {
        "content": "SAN FRANCISCO  Oct 3 Slack Technologies Inc has secured a partnership with Oracle Corp to integrate the tech giant's enterprise software products into the popular workplace messaging app  the two companies told Reuters.",
        "date": "10032017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Slack locks down Oracle partnership targeting enterprises "
    },
    {
        "content": "* Oracle says introduced Oracle Autonomous Database Cloud  a 100 percent self-driving autonomous database  and new automated cyber defense applications Source text for Eikon: Further company coverage:",
        "date": "10022017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle introduces a 100 pct self-driving autonomous database "
    },
    {
        "content": "* Oracle Corp says CEO Safra Catz‍​'s FY 2017 total compensation was $40.73 million versus $40.94 million in FY 2016 - SEC Filing",
        "date": "09282017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle Corp says CEO Safra Catz‍​'s FY 2017 total compensation was $40.73 mln - SEC Filing "
    },
    {
        "content": "SAN FRANCISCO Oracle Corp  Co-Chief Executive Mark Hurd on Monday said he does not understand Trump administration immigration policies that make it difficult for foreigners to work in the United States after earning an education here.",
        "date": "10032017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle Co-CEO questions policies on student visas "
    },
    {
        "content": "SAN FRANCISCO  Oct 2 Oracle Corp Co-Chief Executive Mark Hurd on Monday said he does not understand Trump administration immigration policies that make it difficult for foreigners to work in the United States after earning an education here.",
        "date": "10032017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "CORRECTED-UPDATE 1-Oracle Co-CEO questions policies on student visas "
    },
    {
        "content": "* Oracle Netsuite announces expansion of business operations in South Africa Source text for Eikon: Further company coverage:",
        "date": "09262017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle Netsuite announces expansion of business operations in South Africa "
    },
    {
        "content": "* Oracle Corp - in Q1 of fiscal 2018  management supplemented 2017 restructuring plan to reflect additional actions that co expects to take‍​",
        "date": "09182017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle says in Q1 of 2018  management supplemented 2017 restructuring plan to reflect additional actions that co expects to take‍​ "
    },
    {
        "content": "Oracle Corp forecast current-quarter adjusted profit largely below Wall Street's estimates and indicated to slowing growth in its soaring cloud business  sending the company's shares down as much as 5 percent in aftermarket trading.",
        "date": "09142017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle's profit  cloud growth forecasts drag down shares "
    },
    {
        "content": "Sept 14 Oracle Corp forecast current-quarter adjusted profit largely below Wall Street's estimates and indicated to slowing growth in its soaring cloud business  sending the company's shares down as much as 5 percent in aftermarket trading.",
        "date": "09142017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 3-Oracle's profit  cloud growth forecasts drag down shares "
    },
    {
        "content": "WASHINGTON  Sept 6 Cloud services company Oracle Corp on Wednesday backed a bipartisan proposal in the U.S. Congress that would make it easier to penalize operators of websites that facilitate online sex trafficking.",
        "date": "09062017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle backs online human trafficking bill  breaking with tech industry "
    },
    {
        "content": "* Oracle and Mitsubishi Electric collaborate to develop Internet of Things platform for smart manufacturing Source text for Eikon: Further company coverage:",
        "date": "08312017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle and Mitsubishi Electric collaborate to develop Internet of Things platform for smart manufacturing "
    },
    {
        "content": "A federal appeals court on Monday delivered a likely knockout blow for Oracle Corp in its long-running patent infringement case brought by software vendor Thought Inc.",
        "date": "08212017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Federal appeals court sides with Oracle in middleware patent fight "
    },
    {
        "content": "* Announced worldwide release of its oracle banking payments solution​ Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "08082017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle announces Oracle banking payments offering "
    },
    {
        "content": "* Says ‍TGI Fridays  Oracle And Mastercard announced launch of bar tab at their Leicester square location​",
        "date": "07192017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-TGI Fridays to implement bar tab from Mastercard and Oracle "
    },
    {
        "content": "FRANKFURT  July 20 Newer cloud services powered a rise in second-quarter revenue at Germany's SAP but higher costs curbed profit growth  results from Europe's most valuable technology firm showed on Thursday.",
        "date": "07202017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Cloud services lift SAP sales but costs tether profit growth "
    },
    {
        "content": "* US corporate cash pile grows to $1.84 trillion  led by tech sector",
        "date": "07192017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Moody's says U.S. corporate cash pile grows to $1.84 tln "
    },
    {
        "content": "* Equinix and Oracle offer direct access to oracle cloud in Asia Pacific Source text for Eikon: Further company coverage:",
        "date": "07052017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Equinix  Oracle offer direct access to Oracle cloud in Asia Pacific "
    },
    {
        "content": "* Bank of America selected company's cloud-based ERP and financial applications for its international general ledger and its broker-dealer systems Source text for Eikon: Further company coverage:",
        "date": "06262017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Bank of America selects Oracle Cloud for ERP and Financials "
    },
    {
        "content": "* Oracle inks new cloud deal with Bank of America - CNBC Source text - http://cnb.cx/2te1EFc Further company coverage: (Bengaluru Newsroom)",
        "date": "06262017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle inks new cloud deal with Bank of America - CNBC "
    },
    {
        "content": "HAMILTON  Bermuda Sailors usually have cast iron stomachs  but in the quest to retain the America's Cup  Oracle Team USA are leaving nothing to chance.",
        "date": "06232017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle bank on gut reaction in America's Cup "
    },
    {
        "content": "Oracle Corp's  quarterly profit blew past Wall Street estimates and the business software maker forecast an upbeat current-quarter earnings  indicating that the company's transition to cloud is starting to pay off.",
        "date": "06212017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle profit beats as cloud shift gains steam  shares at record "
    },
    {
        "content": "* Shares rise 10.6 pct after-market (Adds executive and analyst comment  current-quarter forecast; updates shares)",
        "date": "06212017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Oracle profit beats as cloud shift gains steam  shares at record "
    },
    {
        "content": "June 21 Oracle Corp's quarterly profit blew past analysts' estimates as the business software maker's big push towards cloud-based products and services paid off.",
        "date": "06212017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "CORRECTED-UPDATE 1-Oracle beats profit estimates on cloud push  shares jump "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  June 15 As the ultimate corporate insiders  board members are presented with plenty of opportunities to cash in on their sector knowledge and connections.",
        "date": "06162017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "RPT-Former Oracle board member dogged by links to China-backed chip deal "
    },
    {
        "content": "* Q4 FY17 gaap eps up 15% to $0.76 and non-gaap eps up 10% to $0.89",
        "date": "06212017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle reports Q4 earnings per share $0.76 "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  June 15 As the ultimate corporate insiders  board members are presented with plenty of opportunities to cash in on their sector knowledge and connections.",
        "date": "06162017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Former Oracle board member dogged by links to China-backed chip deal "
    },
    {
        "content": "WASHINGTON  May 10 Makan Delrahim  who was chosen by President Donald Trump to be the top U.S. antitrust regulator  said on Wednesday that he would maintain independence from the White House in enforcing antitrust law.",
        "date": "05102017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Trump U.S. antitrust nominee says will be independent of White House "
    },
    {
        "content": "* ORACLE NETSUITE GLOBAL BUSINESS UNIT SAYS PLANS TO MORE THAN DOUBLE ITS DATA CENTER FOOTPRINT FROM FIVE DATA CENTERS GLOBALLY TO 11",
        "date": "04252017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-ORACLE NETSUITE GLOBAL BUSINESS UNIT PLANS INCREASE DATA CENTER FOOTPRINT TO 11 "
    },
    {
        "content": "* Partnership enables direct connectivity to oracle network cloud service - fastconnect across megaport software defined network globally. Source text for Eikon: Further company coverage:",
        "date": "04232017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Megaport says it has launched a global partnership with Oracle "
    },
    {
        "content": "* Oracle Corp - Moat will remain an independent platform within Oracle Data Cloud Source text for Eikon: Further company coverage:",
        "date": "04182017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle buys Moat "
    },
    {
        "content": "WASHINGTON A member of President Donald Trump's transition team  Makan Delrahim  will be nominated to head the U.S. Justice Department's Antitrust Division  the White House said on Monday.",
        "date": "03282017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Delrahim to be nominated to head U.S. Justice Department's Antitrust Division "
    },
    {
        "content": "WASHINGTON  March 27 A member of President Donald Trump's transition team  Makan Delrahim  will be nominated to head the U.S. Justice Department's Antitrust Division  the White House said on Monday.",
        "date": "03282017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Delrahim to be nominated to head U.S. Justice Dept's Antitrust Division "
    },
    {
        "content": "* Oracle - Oracle Financial Services Analytical Applications has announced a collaboration with Numerix  Source text for Eikon:  Further company coverage:",
        "date": "03212017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle reports collaboration with Numerix "
    },
    {
        "content": "Oracle Corp reported better-than-expected quarterly profit and adjusted revenue as the business software maker benefits from its transition to cloud-based products.",
        "date": "03152017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle's cloud transition helps third-quarter profit beat "
    },
    {
        "content": "* Shares up 5.2 pct in extended trading   (Adds details from conference call  analysts' comments  updates shares)",
        "date": "03152017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Oracle's cloud transition helps 3rd-qtr profit beat "
    },
    {
        "content": "* Q3 FY17 GAAP EPS up 6 pct to $0.53 and non-GAAP EPS up 7 pct to $0.69",
        "date": "03152017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle Corp posts Q3 adj. earnings per share $0.69 "
    },
    {
        "content": "Oracle Corp has asked a federal appeals court to revive its $9 billion lawsuit alleging Google Inc unlawfully copied its Java programming language to create the Android operating system  which runs more than 80 percent of the world’s smartphones.",
        "date": "02142017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle pushes for 'fair use' do-over in Google copyright battle "
    },
    {
        "content": "* Oracle Corp - expanded Oracle cloud platform 's data integration offerings with launch of oracle data integrator cloud  Source text for Eikon:  Further company coverage:",
        "date": "02132017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle Corp expands Oracle cloud platform's data integration offerings with launch of Oracle data integrator cloud "
    },
    {
        "content": "TEL AVIV  Jan 16 U.S. software provider Oracle Corp said on Monday it was opening an accelerator programme in Israel for startups developing cloud technologies or whose technologies are based in the cloud.",
        "date": "01162017",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle opens start-up accelerator in Israel for cloud innovation "
    },
    {
        "content": "* Oracle corp - is currently reviewing existing Apiary product roadmap",
        "date": "01192017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle buys apiary "
    },
    {
        "content": "* Oracle and PwC team up to offer unparalleled IFRS 9 compliance expertise  Source text for Eikon:  Further company coverage:",
        "date": "01172017",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle and PwC announce global collaboration to offer premium technology "
    },
    {
        "content": "NEW YORK U.S. stocks fell on Friday  weighed by a more than 4 percent drop in Oracle shares  while recently battered stocks in the real estate and utilities sectors posted the largest gains. | Video ",
        "date": "12162016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Tech drags Wall Street lower; China tension weighs "
    },
    {
        "content": "Business software maker Oracle Corp's  adjusted revenue missed analysts' estimates for the seventh time in the last eight quarters  showing that its shift to cloud-based offerings is taking longer than Wall Street expected.",
        "date": "12152016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle's revenue growth falls short of analysts' expectations "
    },
    {
        "content": "SAN FRANCISCO Oracle Corp Chief Executive Safra Catz will join the executive committee of U.S. President-elect Donald Trump's transition team  and she will remain at the company in the process  Oracle spokeswoman Deborah Hellinger said on Thursday.",
        "date": "12152016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle CEO Catz to join Trump transition team  remain at Oracle "
    },
    {
        "content": "Nov 21 Business software maker Oracle Corp  said on Monday it would buy Dyn  a monitor of global internet performance and traffic  to allow cloud customers to optimize their infrastructure costs and increase web-driven revenue.",
        "date": "11212016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle to buy internet infrastructure provider Dyn "
    },
    {
        "content": "* Oracle Corp - signed an agreement to acquire Dyn  Source text for Eikon:  Further company coverage:",
        "date": "11212016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle buys Dyn "
    },
    {
        "content": "Nov 5 Oracle Corp said on Saturday its proposed $9.3 billion acquisition of cloud storage company NetSuite Inc will move forward after more than half of eligible NetSuite shareholders backed the bid.",
        "date": "11052016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle says majority of NetSuite holders back acquisition "
    },
    {
        "content": "* Board got letter from T. Rowe Price Associates on October 27; T. Rowe Price willing to support deal in which Oracle offers $133/share for NetSuite  Source text - (http://bit.ly/2eUYBZ7) Further company coverage:",
        "date": "10282016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-T. Rowe Price says willing to support $133/share offer by Oracle for NetSuite "
    },
    {
        "content": "* Will take responsibility for its past practices and pay a one-time fair market license fee of $35.6 million awarded to Oracle",
        "date": "10122016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Rimini Street says will take responsibility for past practices  pay Oracle $35.6 million "
    },
    {
        "content": "* Oracle -  United States District Court for District Of Nevada issued 2 rulings in Oracle's litigation against Rimini Street and its CEO Seth Ravin",
        "date": "10122016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle says court ordered Rimini to pay Oracle $27.7 mln in patent infringement case "
    },
    {
        "content": "* Oracle announces final extension of tender offer for NetSuite to expire on November 4",
        "date": "10072016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle announces final extension of tender offer for NetSuite to expire on Nov. 4 "
    },
    {
        "content": "* Has received final antitrust clearance approval necessary for acquisition of Netsuite  Inc  Source text for Eikon:  Further company coverage:",
        "date": "09272016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle has received final antitrust clearance for NetSuite deal "
    },
    {
        "content": "* CEO Mark V. Hurd's 2016 total compensation was $41.1 million versus $53.2 million in 2015",
        "date": "09232016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle Corp CEO Safra Catz's 2016 compensation $40.9 mln vs $53.2 mln in 2015 "
    },
    {
        "content": "* Court granted Oracle's motion for a permanent injunction against continued copyright infringement by Rimini Street",
        "date": "09222016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle says Court grants motion for permanent injunction against copyright infringement by Rimini Street "
    },
    {
        "content": "Oracle Corp forecast lower-than-expected quarterly profit as growth in its cloud-based business fails to make up for weakness in its traditional software offerings.",
        "date": "09152016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle's profit forecast misses estimates; shares slip "
    },
    {
        "content": "* Extended its tender offer in connection with acquisition of Netsuite Inc. until October 6  2016  Source text for Eikon:  Further company coverage:",
        "date": "09092016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle extends Netsuite related tender offer "
    },
    {
        "content": "Investment manager T. Rowe Price Group Inc expressed opposition to Oracle Corp's proposed acquisition of U.S. cloud computing company NetSuite Inc  saying the $9.3 billion deal price is too low.",
        "date": "09072016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "NetSuite shareholder T. Rowe Price opposes sale to Oracle "
    },
    {
        "content": "Sept 7 Investment manager T. Rowe Price Group Inc expressed opposition to Oracle Corp's  proposed acquisition of U.S. cloud computing company NetSuite Inc  saying the $9.3 billion deal price is too low.",
        "date": "09072016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-NetSuite shareholder T. Rowe Price opposes sale to Oracle "
    },
    {
        "content": "Sept 7 Investment firm T. Rowe Price Group  will vote against Oracle Corp's proposed takeover of NetSuite Inc and said it preferred NetSuite to remain independent.",
        "date": "09072016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "T. Rowe Price to vote against Oracle's deal for NetSuite "
    },
    {
        "content": "* Received a letter from T. Rowe Price associates Inc concerning company's pending acquisition by Oracle",
        "date": "09072016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-T Rowe price sends letter to Netsuite regarding Oracle deal "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 29 (Fitch) Fitch Ratings believes the acquisition of NetSuite   Inc. (NetSuite) does not affect the ratings for Oracle Corp. (Oracle)  including  the 'A+' Long-Term Issuer Default Rating (IDR) and 'F1' Short-Term IDR. The  Rating Outlook is Stable. A full list of current ratings follows at the end of  this release. Fitch believes the acquisition of NetSuite strengthens Oracle's cloud-based  enterprise resource planning (ER",
        "date": "07292016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Fitch: Acquisition of NetSuite Does Not Affect Oracle's 'A+/F1' Ratings "
    },
    {
        "content": "Oracle Corp  said on Thursday it would buy NetSuite Inc  for about $9.3 billion  a deal that gives it a bigger share in the fast-growing cloud computing business and also means a big payday for billionaire Larry Ellison. | Video ",
        "date": "07282016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle to gain cloud clout with NetSuite deal; Ellison profits "
    },
    {
        "content": "July 28 Oracle Corp said on Thursday it would buy NetSuite Inc for about $9.3 billion  a deal that gives it a bigger share in the fast-growing cloud computing business and also means a big payday for billionaire Larry Ellison.",
        "date": "07282016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 5-Oracle to gain cloud clout with NetSuite deal; Ellison profits "
    },
    {
        "content": "* Oracle says transaction is valued at $109.00 per share in cash  or about $9.3 billion",
        "date": "07282016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle buys Netsuite "
    },
    {
        "content": "July 28 Oracle Corp said it agreed to acquire NetSuite Inc  a cloud-based software services provider  in a deal valued at about $9.3 billion.",
        "date": "07282016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle buys NetSuite in $9.3 bln deal "
    },
    {
        "content": "* Fujitsu and Oracle team up to drive cloud computing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom)",
        "date": "07062016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Fujitsu and Oracle team up to drive cloud computing "
    },
    {
        "content": "SAN FRANCISCO A California jury ordered Oracle Corp to pay Hewlett-Packard Enterprise Co $3 billion in damages in a case over HP's Itanium servers  an Oracle spokeswoman said on Thursday.",
        "date": "07012016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle ordered to pay HP $3 bln in Itanium case "
    },
    {
        "content": "SAN FRANCISCO  June 30 A California jury ordered Oracle Corp to pay Hewlett-Packard Enterprise Co  $3 billion in damages in a case over HP's Itanium servers  an Oracle spokeswoman said on Thursday.",
        "date": "06302016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle ordered to pay HP $3 bln in Itanium case "
    },
    {
        "content": "* Prices $14 billion aggregate principal amount of investment grade notes",
        "date": "06292016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle prices $14 bln aggregate principal amount of investment grade notes "
    },
    {
        "content": "SAN FRANCISCO A California jury ordered Oracle Corp  to pay Hewlett-Packard Enterprise Co  $3 billion in damages in a case over HP's Itanium servers  an Oracle spokeswoman said on Thursday.",
        "date": "07012016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle ordered to pay HP $3 billion in Itanium case "
    },
    {
        "content": "SAN FRANCISCO  June 30 A California jury ordered Oracle Corp to pay Hewlett-Packard Enterprise Co  $3 billion in damages in a case over HP's Itanium servers  an Oracle spokeswoman said on Thursday.",
        "date": "07012016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Oracle ordered to pay HP $3 bln in Itanium case "
    },
    {
        "content": "NEW YORK  June 30 (IFR) - The US high-grade market roared back to life this week with big deals from Molson Coors and Oracle that got a warm welcome from investors clamoring for paper after a bit of a drought.",
        "date": "06302016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "US high-grade bounces back quickly after Brexit "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 29 (Fitch) Fitch Ratings has affirmed the ratings for Oracle Corp.  (Oracle)  including the Long- and Short-Term Issuer Default Ratings (IDR) at  'A+'/'F1'  respectively. The Rating Outlook is Stable. Fitch's affirmation  affects $57.1 billion of debt  including the $3 billion undrawn revolving credit  facility (RCF) expiring 2018 and $3.75 billion outstanding under a separate RCF  that was repaid at maturity in June 2016.",
        "date": "06292016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Fitch Affirms Oracle's Ratings 'A+'/'F1'; Outlook Stable "
    },
    {
        "content": "SAO PAULO Oracle Corp is selling more cloud-based business software than traditional licensed products in Latin America  executives said on Tuesday  underscoring how remote computing has spurred demand from smaller businesses in new markets.",
        "date": "06282016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle's cloud business takes lead in Latin America "
    },
    {
        "content": "SAO PAULO  June 28 Oracle Corp is selling more cloud-based business software than traditional licensed products in Latin America  executives said on Tuesday  underscoring how remote computing has spurred demand from smaller businesses in new markets.",
        "date": "06282016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 1-Oracle's cloud business takes lead in Latin America "
    },
    {
        "content": "SAO PAULO  June 28 Business software maker Oracle Corp expects to gain \"a ton\" of market share in Brazil  Chief Executive Mark Hurd said on Tuesday  adding  that hiring has become easier during the economic downturn.   (Reporting by Brad Haynes)",
        "date": "06282016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle expects to gain market share in Brazil - CEO "
    },
    {
        "content": "* Oracle announces pfizer's selection of oracle cloud for clinical data management and trial management across its clinical trial portfolio  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06202016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle announces Pfizer's selection of Oracle cloud for clinical data management "
    },
    {
        "content": "* Oracle and Snapchat measure impact of snap ads on sales in stores",
        "date": "06152016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle and Snapchat to measure impact of snap ads on sales in stores "
    },
    {
        "content": "Business software maker Oracle Corp reported a higher-than-expected quarterly revenue as sales in its cloud business surged due to more customers.",
        "date": "06162016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle's cloud strength boosts quarterly revenue "
    },
    {
        "content": "* Shares rise 3.8 pct after market   (Adds details from conference call  guidance)",
        "date": "06162016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 3-Oracle's cloud strength boosts quarterly revenue "
    },
    {
        "content": "* Total Q4 revenues were $10.6 billion  down 1 pct in U.S. Dollars and flat in constant currency",
        "date": "06162016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle Corp posts Q4 adj. earnings per share $0.81 "
    },
    {
        "content": "* Oracle Corp says on June 15  2016  board adopted amendments to oracle's amended and restated bylaws to implement proxy access",
        "date": "06162016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle says board adopted amendments to amended bylaws to implement proxy access "
    },
    {
        "content": "A magistrate judge in Texas refused to put RealTime Data's patent infringement suit against Dell  Hewlett Packard  Oracle and several other companies on hold while the defendants challenge the validity of RealTime's patents in a separate proceeding.",
        "date": "06162016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Lawsuits against Dell  HP and Oracle on data compression patents can proceed "
    },
    {
        "content": "A U.S. judge on Wednesday rejected Oracle Corp's bid to overturn a jury verdict in favor of Alphabet's Google unit over allegations that Google built the Android operating system on copyrighted software owned by Oracle.",
        "date": "06082016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle fails to dislodge pro-Google verdict in Android case "
    },
    {
        "content": "June 2 Oracle Corp spokeswoman Deborah Hellinger:",
        "date": "06022016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle \"confident\" that its cloud accounting \"proper and correct\" -spokeswoman "
    },
    {
        "content": "June 1 Oracle Corp was sued on Wednesday by a former senior finance manager who claimed she was terminated in retaliation for complaining about improper accounting practices in its cloud services business.",
        "date": "06012016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle hit with whistleblower lawsuit over cloud accounting "
    },
    {
        "content": "Oracle Corp  was sued on Wednesday by a former senior finance manager who claimed she was terminated in retaliation for complaining about improper accounting practices in Oracle's cloud services business.",
        "date": "06022016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle hit with whistleblower lawsuit over cloud accounting "
    },
    {
        "content": "Cloud-based software maker Salesforce.com Inc  said on Wednesday it would buy Demandware Inc   whose software is used by businesses to run e-commerce websites  for about $2.8 billion. | Video ",
        "date": "06012016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Salesforce takes aim at e-commerce with $2.8 billion Demandware buy "
    },
    {
        "content": "* High premium indicative of bidding war for Demandware - analyst",
        "date": "06012016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 4-Salesforce takes aim at e-commerce with $2.8 bln Demandware buy "
    },
    {
        "content": "June 1 Oracle Corp was sued on Wednesday by a former senior finance manager who claimed she was terminated in retaliation for complaining about improper accounting practices in Oracle's cloud services business.",
        "date": "06022016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 4-Oracle hit with whistleblower lawsuit over cloud accounting "
    },
    {
        "content": "SAN FRANCISCO A U.S. jury handed Google  a major victory on Thursday in a long-running copyright battle with Oracle Corp  over Android software used to run most of the world's smartphones.",
        "date": "05272016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Google beats Oracle in $9 billion Android trial "
    },
    {
        "content": "SAN FRANCISCO A U.S. jury handed Google  a major victory on Thursday in a long-running copyright battle with Oracle Corp over Android software used to run most of the world's smartphones.",
        "date": "05262016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Google beats Oracle in $9 billion Android trial "
    },
    {
        "content": "SAN FRANCISCO  May 23 Oracle Corp filed a multibillion-dollar copyright lawsuit against Google because Oracle failed in its own attempts to enter the smartphone market  a Google attorney said in closing arguments on Monday.",
        "date": "05232016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "In Oracle vs. Google retrial  lawyers make final pitches to jury "
    },
    {
        "content": "SAN FRANCISCO  May 26 A U.S. jury handed Google  a major victory on Thursday in a long-running copyright battle with Oracle Corp over Android software used to run most of the world's smartphones.",
        "date": "05262016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 4-Google beats Oracle in $9 billion Android trial "
    },
    {
        "content": "SAN FRANCISCO  May 26 A U.S. jury handed Alphabet's Google a major victory on Thursday in a long-running copyright lawsuit against Oracle Corp  saying the law allowed Google's use of Oracle's software to create its Android smartphone operating system.",
        "date": "05262016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "U.S. jury sides with Alphabet's Google in Android trial "
    },
    {
        "content": "* Jury Reaches Verdict In Oracle Vs. Google Trial-CNBC    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "05262016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Jury reaches verdict in oracle versus Google trial-CNBC "
    },
    {
        "content": "SAN FRANCISCO  May 23 Oracle Corp filed a multibillion-dollar copyright lawsuit against Google because Oracle failed in its own attempts to enter the smartphone market  a Google attorney said in closing arguments on Monday.",
        "date": "05232016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 1-In Oracle vs. Google retrial  lawyers make final pitches to jury "
    },
    {
        "content": "SAN FRANCISCO  May 19 Google did not pay to use Oracle's software in millions of smartphones  but the company believed that the intellectual property was free for anyone to use  Larry Page  chief executive of Google's parent company  told jurors in court on Thursday.",
        "date": "05192016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Larry Page spars with Oracle attorney at Android trial "
    },
    {
        "content": "Longtime customers dramatically reduced the amount of licensing revenue they paid to use Oracle products after Google stole its copyrighted software to enter the smartphone market  Oracle's co-chief executive Safra Catz told jurors on Tuesday.",
        "date": "05182016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle co-CEO says Google caused Oracle revenue to plummet "
    },
    {
        "content": "SAN FRANCISCO  May 16 Oracle Corp did not acquire Sun Microsystems in 2009 in order to launch a copyright lawsuit against Google  but rather to protect its products that relied on Sun's software  Oracle co-Chief Executive Safra Catz told jurors on Monday.",
        "date": "05162016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle co-CEO says it did not buy Sun Micro to sue Google "
    },
    {
        "content": "Here are some upcoming events of interest to the intellectual property community. All times local.",
        "date": "05162016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Week Ahead in Intellectual Property: May 16  2016 "
    },
    {
        "content": "SAN FRANCISCO Oracle Corp and Google faced off on Tuesday in a $9 billion copyright retrial  with Oracle accusing Google of stealing programming to become the world's leading smartphone player and Google saying it acted legally as a true innovator. | Video ",
        "date": "05102016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Google  Oracle compete for innovation label in Android retrial "
    },
    {
        "content": "SAN FRANCISCO  May 10 Oracle Corp and Google faced off on Tuesday in a $9 billion copyright retrial  with Oracle accusing Google of stealing programming to become the world's leading smartphone player and Google saying it acted legally as a true innovator.",
        "date": "05102016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Google  Oracle compete for innovation label in Android retrial "
    },
    {
        "content": "SAN FRANCISCO  May 10 An attorney for Oracle Corp told jurors on Tuesday that Alphabet Inc's  Google deliberately took Oracle's intellectual property without permisson  kicking off a $9 billion retrial.",
        "date": "05102016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle paints Google as unfair competitor in retrial over Android "
    },
    {
        "content": "SAN FRANCISCO  May 17 Longtime customers dramatically reduced the amount of licensing revenue they paid to use Oracle products after Google stole its copyrighted software to enter the smartphone market  Oracle's co-chief executive Safra Catz told jurors on Tuesday.",
        "date": "05172016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle co-CEO says Google caused Oracle revenue to plummet "
    },
    {
        "content": "SAN FRANCISCO Even if a jury orders Alphabet Inc's  Google to pay the full $8.8 billion sought by Oracle Corp  in an upcoming San Francisco copyright trial over the Android operating system  shareholders and analysts say it will likely have little impact on the search giant's bottom line.",
        "date": "05052016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Little risk for Google in retrial vs Oracle over Android "
    },
    {
        "content": "SAN FRANCISCO Ford Motor Co  is investing $182.2 million in San Francisco-based Pivotal Software  underscoring the pressure carmakers face to boost their technology platforms given the rise of connected and self-driving cars.",
        "date": "05052016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Ford invests $182.2 million in software company Pivotal "
    },
    {
        "content": "* To acquire opower (nyse: opwr) for $10.30 per share in cash",
        "date": "05022016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle buys Opower for $10.30 per share in cash "
    },
    {
        "content": "Oracle Corp  will buy Opower Inc   a maker of software for utilities  for about $548 million in cash.",
        "date": "05022016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle to buy utility software maker Opower "
    },
    {
        "content": "BOSTON The usually close-mouthed Capital Group is speaking up on executive pay - throwing more brickbats than bouquets.",
        "date": "05022016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Capital Group leaders look to rein in inflated CEO pay "
    },
    {
        "content": "Oracle Corp  said it would buy cloud-based payment management services provider Textura Corp  for $663 million in cash.",
        "date": "04282016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle to buy Textura for $663 million "
    },
    {
        "content": "April 28 Oracle Corp said it would buy cloud-based payment management services provider Textura Corp  for $663 million in cash.",
        "date": "04282016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "CORRECTED-Oracle to buy Textura for $663 million "
    },
    {
        "content": "* Says board of directors of Oracle has unanimously approved transaction  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04282016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle buys Textura for $663 million "
    },
    {
        "content": "STOCKHOLM  April 20 Every start-up hopes for a lucky break. Swedish company Neo Technology only found out it was getting one the day the Panama Papers made headlines around the world.",
        "date": "04202016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "How Swedish start-up Neo Technology helped crack the Panama Papers "
    },
    {
        "content": "SAN FRANCISCO Oracle Corp and Alphabet's Google unit failed to settle a long running copyright lawsuit over the Android operating system ahead of a retrial scheduled for May  according to a court docket.",
        "date": "04162016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle  Google fail to settle Android lawsuit before retrial "
    },
    {
        "content": "SAN FRANCISCO  April 15 Oracle Corp and Alphabet's Google unit failed to settle a long running copyright lawsuit over the Android operating system ahead of a retrial scheduled for May  according to a court docket.",
        "date": "04162016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 1-Oracle  Google fail to settle Android lawsuit before retrial "
    },
    {
        "content": "SEOUL South Korea's Fair Trade Commission (FTC) said on Wednesday Oracle Corp did not engage in anti-competitive behavior following a probe over its practice of packaging new software upgrades into database management service contracts.",
        "date": "04122016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "South Korea clears Oracle of anti-competitive acts after software probe "
    },
    {
        "content": "SAN FRANCISCO  April 15 Oracle Corp and Alphabet's Google unit failed to settle a long running copyright lawsuit over the Android operating system ahead of a retrial scheduled for May  according to a court docket.",
        "date": "04162016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle  Google fail to settle Android lawsuit ahead of May retrial "
    },
    {
        "content": "SEOUL  April 13 South Korea's Fair Trade Commission (FTC) said on Wednesday Oracle Corp did not engage in anti-competitive behaviour following a probe over its practice of packaging new software upgrades into database management service contracts.",
        "date": "04122016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "S.Korea clears Oracle of anti-competitive acts after software probe "
    },
    {
        "content": "* Files for potential mixed shelf offering; size not disclosed - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "03182016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle files for potential mixed shelf offering size not disclosed - SEC filing "
    },
    {
        "content": "Oracle Corp  reported a higher-than-expected quarterly profit as its cloud business gained traction  and said it was boosting its stock buyback program by $10 billion.",
        "date": "03162016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle profit beats expectations  boosts share buyback by $10 billion "
    },
    {
        "content": "* Qtrly \u007fcloud infrastructure as a service (iaas) revenues were $152 million  down 2% in u.s. dollars\u007f",
        "date": "03152016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "BRIEF-Oracle reports Q3 GAAP earnings per share $0.50 "
    },
    {
        "content": "March 15 Oracle Corp posted a 3.4 percent fall in quarterly revenue  hurt by a stronger dollar and weak sales of its traditional database software products.",
        "date": "03152016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle revenue falls 3.4 pct "
    },
    {
        "content": "* Elliott could also offer to buy the company itself - Ken Squire   (Adds Qlik no comment in last paragraph  updates Elliott's assets under management in paragraph 2)",
        "date": "03032016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Elliott buys large Qlik stake  eyeing sale to bigger buyer "
    },
    {
        "content": "TEL AVIV  Feb 23 Business software maker Oracle Corp  which is seeking to expand its cloud business  has agreed to buy Israeli cloud software company Ravello Systems  the two firms said on their websites on Tuesday.",
        "date": "02232016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle buys Israeli cloud company Ravello "
    },
    {
        "content": "SAN FRANCISCO  Jan 27 Google is asking for sanctions against Oracle Corp after one of the software developer's lawyers discussed confidential details about the search giant's relationship with Apple Inc at a court hearing earlier this month.",
        "date": "01282016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Google asks court for OK to press for sanctions against Oracle "
    },
    {
        "content": "SAN FRANCISCO Google's Android operating system has generated revenue of about $31 billion and profit of $22 billion since its release  an Oracle Corp lawyer told a U.S. court hearing the software company's copyright lawsuit against Google.",
        "date": "01222016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle lawyer says Google's Android generated $31 billion revenue "
    },
    {
        "content": "Jan 21 Google's Android operating system has generated revenue of $31 billion and profit of $22 billion  Bloomberg reported  citing a statement made by an Oracle Corp  lawyer in court.",
        "date": "01212016",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle lawyer says Google's Android generated $31 bln revenue - BBG "
    },
    {
        "content": "Google Inc  paid Apple Inc  $1 billion in 2014 to keep its search bar on the iPhone  Bloomberg reported  citing a transcript of court proceedings related to a copyright lawsuit filed by Oracle Corp  against the search giant. | Video ",
        "date": "01222016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Court filing offers rare peek at finances of Android "
    },
    {
        "content": "SAN FRANCISCO Google's Android operating system has generated revenue of about $31 billion and profit of $22 billion since its release  an Oracle Corp lawyer told a U.S. court hearing the software company's copyright lawsuit against Google.",
        "date": "01222016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle lawyer says Google's Android generated $31 bln revenue "
    },
    {
        "content": "SAN FRANCISCO  Jan 21 Google's Android operating system has generated revenue of about $31 billion and profit of $22 billion since its release  an Oracle Corp lawyer told a U.S. court hearing the software company's copyright lawsuit against Google.",
        "date": "01222016",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Oracle lawyer says Google's Android generated $31 bln revenue "
    },
    {
        "content": "TORONTO OpenText Corp said on Thursday it has tapped former Oracle Corp executive Stephen Murphy as its new president  giving Chief Executive Officer Mark Barrenechea more time to focus on strategy and the company's product road map.",
        "date": "12242015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "OpenText taps former Oracle hand as its new president "
    },
    {
        "content": "WASHINGTON  Dec 21 Oracle Corp has settled allegations by the Federal Trade Commission that it failed to notify customers about unaddressed hacking dangers when it released security updates for the estimated 850 million U.S. computers with Java SE software  the agency said on Monday.",
        "date": "12212015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle settles FTC charges that it left its customers open to hacking "
    },
    {
        "content": "Business software maker Oracle Corp on Wednesday delivered a third-quarter profit forecast that did not quite meet analysts' expectations  and the company's shares fell about 1 percent in extended trading.",
        "date": "12162015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle profit forecast fails to impress; shares fall "
    },
    {
        "content": "Dec 16 Business software maker Oracle Corp  on Wednesday delivered a third-quarter profit forecast that did not quite meet analysts' expectations  and the company's shares fell about 1 percent in extended trading.",
        "date": "12162015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Oracle profit forecast fails to impress; shares fall "
    },
    {
        "content": "Dec 16 Business software maker Oracle Corp  reported a 6.3 percent fall in quarterly revenue  hurt by a strong dollar and  weak sales of traditional software licenses.",
        "date": "12162015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle revenue falls 6.3 pct "
    },
    {
        "content": "New York state's public pension fund has sued Oracle Corp to force the tech giant to reveal how it spends its political donations  according to a court filing.",
        "date": "10282015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "N.Y. state pension fund sues Oracle for political donor info "
    },
    {
        "content": "Oct 28 New York state's public pension fund has sued Oracle Corp to force the tech giant to reveal how it spends its political donations  according to a court filing.",
        "date": "10282015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "NY state pension fund sues Oracle for political donor info "
    },
    {
        "content": "Oracle Corp's  sales fell more than expected in the first quarter  hurt by a strong dollar and a continued drop in licensed software sales and the company warned revenue could fall in the current quarter even on a constant currency basis.",
        "date": "09162015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle revenue forecast disappoints as license sales continue falling "
    },
    {
        "content": "Sept 16 Oracle Corp's sales fell more than expected in the first quarter  hurt by a strong dollar and a continued drop in licensed software sales and the company warned revenue could fall in the current quarter even on a constant currency basis.",
        "date": "09162015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 3-Oracle revenue forecast disappoints as license sales continue falling "
    },
    {
        "content": "Sept 16 Oracle Corp's quarterly sales fell a bigger-than-expected 1.7 percent  hurt by a strong dollar and as the rapid shift by customers to lower-margin cloud-based software failed to make up for waning sales of traditional packaged software.",
        "date": "09162015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle revenue falls on strong dollar  weak packaged software sales "
    },
    {
        "content": "SAN FRANCISCO Oracle Corp's  beleaguered shares jumped 1.1 percent on Wednesday after an analyst upgraded them ahead of the fiscal first-quarter report card that will shed light on the enterprise software heavyweight's shift toward cloud computing.",
        "date": "09162015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Shares of Oracle jump on upgrade ahead of quarterly report "
    },
    {
        "content": "SAN FRANCISCO  July 30 Oracle Corp's  long-running legal battle with Google Inc over Google's Android operating system for smartphones and other devices probably will not proceed to another trial until the middle of 2016  a U.S. judge said on Thursday.",
        "date": "07302015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "No end in sight for Oracle  Google legal fight over Android "
    },
    {
        "content": "FRANKFURT  July 28 Business planning software start-up Anaplan is nipping at the heels of industry leaders SAP   Oracle and IBM  with sales of its cloud-based service tripling in each of the past three years as it seeks to shake up the market.",
        "date": "07282015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Anaplan targets SAP  Oracle in fast-growing business planning market "
    },
    {
        "content": "July 22 Oracle Corp has asked a U.S. judge for permission to update its copyright lawsuit against Google Inc to include the Android operating system's current market dominance.",
        "date": "07232015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle seeks permission to update copyright lawsuit against Google "
    },
    {
        "content": "Oracle Corp  said its copyright infringement lawsuit against software support services company Rimini Street Inc and the smaller rival's Chief Executive Seth Ravin would go to trial in September.",
        "date": "07072015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle says Rimini Street copyright trial to begin in September "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO Oracle Corp  won a major legal victory on Monday in a closely watched copyright case involving the company's Java programming language as the U.S. Supreme Court declined to hear Google Inc's  appeal.",
        "date": "06292015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "U.S. top court declines to hear Google appeal in Oracle Java fight "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO  June 29 Oracle Corp  won a major legal victory on Monday in a closely watched copyright case involving the company's Java programming language as the U.S. Supreme Court declined to hear Google Inc's  appeal.",
        "date": "06292015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 3-U.S. top court declines to hear Google appeal in Oracle Java fight "
    },
    {
        "content": "WASHINGTON  June 29 The U.S. Supreme Court on Monday declined to hear Google Inc's appeal in a major software copyright case  leaving intact a ruling that would allow Oracle Corp to charge licensing fees for the use of some of its Java programming language.",
        "date": "06292015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "U.S. Supreme Court declines to hear Google appeal in Oracle software fight "
    },
    {
        "content": "June 22 Oracle Corp founder and Executive Chairman Larry Ellison said his database company is expanding its cloud-computing offerings  bringing Oracle into more direct competition with Amazon.com Inc.",
        "date": "06222015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle extends cloud offerings  looks to compete with Amazon.com "
    },
    {
        "content": "June 22 Orcle Corp founder and Executive Chairman Larry Ellison said his database company is expanding its cloud-computing offerings  bringing Oracle into more direct competition with Amazon.com Inc.",
        "date": "06222015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 1-Oracle extends cloud offerings  looks to compete with Amazon.com "
    },
    {
        "content": "June 18 Oracle Corp named David Donatelli as executive vice president of its converged infrastructure business  which includes engineered systems  servers  storage and networking products.",
        "date": "06182015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "David Donatelli joins Oracle from HP "
    },
    {
        "content": "Oracle Corp  forecast quarterly profit below analysts' estimates  and said weak sales of its traditional database software licenses were made worse by a strong U.S. dollar that lowered the value of foreign revenue. | Video ",
        "date": "06172015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle sales  profit miss estimates; shares fall "
    },
    {
        "content": "* Indexes up: Dow 0.6 pts  S&P 0.4 pts  Nasdaq 0.6 pts   (Updates to open)",
        "date": "06182015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "US STOCKS-Wall St opens higher after Fed signals slow tightening "
    },
    {
        "content": "* Futures up: Dow 66 pts  S&P 6 pts  Nasdaq 15 pts   (Adds details  comment  updates prices)",
        "date": "06182015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "US STOCKS-Wall St set to open higher as Fed signals slow tightening "
    },
    {
        "content": "LONDON  June 18 European shares fell on Thursday  with the Athens bourse touching three-year lows as the prospects of Greece reaching a quick deal with its international creditors faded.",
        "date": "06182015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "European shares weaken as Greek shares touch 3-year lows "
    },
    {
        "content": "June 17 Oracle Corp forecast quarterly profit below analysts' estimates  and said weak sales of its traditional database software licenses were made worse by a strong U.S. dollar that lowered the value of foreign revenue.",
        "date": "06172015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 3-Oracle sales  profit miss estimates; shares fall "
    },
    {
        "content": "LONDON  June 18 European shares fell on Thursday  with the Athens bourse touching three-year lows as the prospects of Greece reaching a quick deal with its international creditors faded.",
        "date": "06182015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "European shares slide as Greek shares touch 3-year lows "
    },
    {
        "content": "* Indexes up: Dow 0.17 pct  S&P 0.2 pct  Nasdaq 0.18 pct   (Updates to close)",
        "date": "06172015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "US STOCKS-Wall St ends higher in choppy post-Fed trading "
    },
    {
        "content": "June 17 Oracle Corp  a business software and database company   reported a 5.4 percent fall in quarterly revenue  hurt by a strong dollar.",
        "date": "06172015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "CORRECTED-Oracle revenue falls 5.4 pct hurt by a stronger dollar "
    },
    {
        "content": "LONDON  June 18 European shares fell in early deals on Thursday as hopes of a deal between Greece and its creditors at a planned meeting later in the day receded  further straining investor nerves after weeks of fruitless negotiations.",
        "date": "06182015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "European shares fall amid receding hopes of imminent Greek deal "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO The Obama administration on Tuesday sided against Google Inc and said the U.S. Supreme Court should not hear the company's appeal in a case against Oracle Corp with wide implications for the technology industry  according to a court filing.",
        "date": "05262015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Obama administration asks U.S. top court to decline Google copyright appeal "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO  May 26 The Obama administration on Tuesday sided against Google Inc and said the U.S. Supreme Court should not hear the company's appeal in a case against Oracle Corp with wide implications for the technology industry  according to a court filing.",
        "date": "05262015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Obama administration asks U.S. top court to decline Google copyright appeal "
    },
    {
        "content": "SAN FRANCISCO/WASHINGTON The Obama administration has been locked in internal wrangling over what position to take in high profile litigation between two American technology giants  Google and Oracle  according to multiple sources familiar with the discussions. It faces an end-of-May deadline to decide whether to take sides in a case before the U.S. Supreme Court that will have wide implications for the technology industry.",
        "date": "05152015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Google versus Oracle case exposes differences within Obama administration "
    },
    {
        "content": "SAN FRANCISCO/WASHINGTON  May 15 The Obama administration has been locked in internal wrangling over what position to take in high profile litigation between two American technology giants  Google and Oracle  according to multiple sources familiar with the discussions. It faces an end-of-May deadline to decide whether to take sides in a case before the U.S. Supreme Court that will have wide implications for the technology industry.",
        "date": "05152015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "INSIGHT-Google versus Oracle case exposes differences within Obama administration "
    },
    {
        "content": "SAN FRANCISCO/WASHINGTON  May 15 The Obama administration has been locked in internal wrangling over what position to take in high profile litigation between two American technology giants  Google and Oracle  according to multiple sources familiar with the discussions. It faces an end-of-May deadline to decide whether to take sides in a case before the U.S. Supreme Court that will have wide implications for the technology industry.",
        "date": "05152015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "RPT-INSIGHT-Google versus Oracle case exposes differences within Obama administration "
    },
    {
        "content": "SEOUL South Korea's antitrust body said on Tuesday that it is investigating U.S. database firm Oracle Corp over whether its practice of bundling new software offerings into maintenance services contracts is anticompetitive behavior.",
        "date": "04282015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "South Korea investigating Oracle over software bundling "
    },
    {
        "content": "REDWOOD CITY  Calif. Oracle Corp  Chief Executive Safra Catz said her company could benefit if Microsoft Corp  or another rival bought online customer relationship management firm Salesforce.com Inc .",
        "date": "04302015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle CEO sees benefit if rival buys Salesforce.com "
    },
    {
        "content": "SEOUL  April 28 South Korea's antitrust body said on Tuesday that it is investigating U.S. database firm Oracle Corp over whether its practice of bundling new software offerings into maintenance services contracts is anticompetitive behaviour.",
        "date": "04282015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 1-S.Korea investigating Oracle over software bundling "
    },
    {
        "content": "REDWOOD CITY  Calif.  April 30 Oracle Corp  Chief Executive Safra Catz said her company could benefit if Microsoft Corp or another rival bought online customer relationship management firm Salesforce.com Inc .",
        "date": "04302015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Oracle CEO sees benefit if rival buys Salesforce.com "
    },
    {
        "content": "REDWOOD CITY  Calif.  April 30 Oracle Corp  Chief Executive Safra Catz on Thursday declined comment on whether Oracle had made an offer to buy online customer relationship management rival Salesforce.com Inc.",
        "date": "04302015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle CEO Safra Catz declines comment on Salesforce.com "
    },
    {
        "content": "SEOUL  April 28 South Korea's antitrust body said on Tuesday that it is investigating U.S. database services provider Oracle Corp for bundling its new software offerings into maintenance services contracts with customers.",
        "date": "04282015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "S.Korea antitrust body investigating Oracle for software bundling "
    },
    {
        "content": "BEIJING China's Tencent Holdings Ltd for the first time hit a market cap of more than $200 billion on Monday  making it more valuable than U.S. tech firms like Amazon.com Inc  IBM Corp and Oracle Corp.",
        "date": "04132015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "China's Tencent hits $200 billion market cap for first time "
    },
    {
        "content": "BEIJING  April 13 China's Tencent Holdings Ltd  for the first time hit a market cap of more than $200 billion on Monday  making it more valuable than U.S. tech firms like Amazon.com Inc  IBM Corp and Oracle Corp .",
        "date": "04132015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "China's Tencent hits $200 bln market cap for first time "
    },
    {
        "content": "While a highly contentious copyright dispute between Oracle Corp and Google Inc gets most of the attention  the battle over patents between the tech heavyweights continues as a U.S. appeals court on Friday resurrected part of an Oracle patent that had been successfully invalidated by Google.",
        "date": "03202015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Federal Circuit revives part of Oracle patent used to sue Google "
    },
    {
        "content": "SEATTLE Oracle Corp posted flat third-quarter revenue and slightly lower profit as the U.S. dollar strengthened  but the business software maker on Tuesday raised its quarterly dividend 25 percent to 15 cents a share. | Video ",
        "date": "03172015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Oracle sales flat  lifts dividend; shares rise "
    },
    {
        "content": "SEATTLE  March 17 Oracle Corp posted flat third-quarter revenue and slightly lower profit as the U.S. dollar strengthened  but the business software maker on Tuesday raised its quarterly dividend 25 percent to 15 cents a share.",
        "date": "03172015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 2-Oracle sales flat  lifts dividend; shares rise "
    },
    {
        "content": "SAN FRANCISCO Onetime highflying tech executive Ray Lane testified on Monday during a sex discrimination trial involving his former employer  Kleiner Perkins Caufield & Byers  that he made a mistake in judgment involving the harassment of a female venture capitalist at the firm.",
        "date": "03022015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Former HP chairman admits 'mistake' in venture firm sexism trial "
    },
    {
        "content": "NEW YORK Every Tuesday and Wednesday at around 2 pm  Larry Ellison  the founder of Oracle Corp  gathers his lieutenants in the board room on the top floor of the software giant's headquarters in Redwood City  California to hear engineers present new products and strategies.",
        "date": "01122015",
        "name": "Oracle Corporation",
        "news_type": "topStory",
        "symbol": "ORCL",
        "title": "Ellison's backing helps Kurian's star to rise at Oracle "
    },
    {
        "content": "* Q4 op profit up 1 pct  broadly in line with Reuters poll avg",
        "date": "01122015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "UPDATE 3-SAP profit holds up in fourth quarter as cloud shift accelerates "
    },
    {
        "content": "NEW YORK  Jan 8 Oracle Corp has promoted executive Thomas Kurian to the role of president  overseeing the tech company's software development  according to an internal memo seen by Reuters.",
        "date": "01082015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "Oracle's Kurian promoted to president  will lead software "
    },
    {
        "content": "WASHINGTON  Jan 12 The Supreme Court on Monday asked the U.S. government to weigh in on whether the justices should hear a closely watched copyright dispute between Google Inc and Oracle Corp over software used to design Google's Android smartphone operating system.",
        "date": "01122015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "U.S. justices seek Obama administration views on Google-Oracle dispute "
    },
    {
        "content": "NEW YORK  Jan 12 Every Tuesday and Wednesday at around 2 pm  Larry Ellison  the founder of Oracle Corp  gathers his lieutenants in the board room on the top floor of the software giant's headquarters in Redwood City  California to hear engineers present new products and strategies.",
        "date": "01122015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "RPT-INSIGHT-Ellison's backing helps Kurian's star to rise at Oracle "
    },
    {
        "content": "NEW YORK  Jan 12 Every Tuesday and Wednesday at around 2 pm  Larry Ellison  the founder of Oracle Corp  gathers his lieutenants in the board room on the top floor of the software giant's headquarters in Redwood City  California to hear engineers present new products and strategies.",
        "date": "01122015",
        "name": "Oracle Corporation",
        "news_type": "normal",
        "symbol": "ORCL",
        "title": "INSIGHT-Ellison's backing helps Kurian's star to rise at Oracle "
    }
]