[
    {
        "content": "Sept 7 Grupo Aeroportuario Del Pacifico Sab De Cv",
        "date": "09072017",
        "name": "Grupo Aeroportuario Del Pacifico SA de CV",
        "news_type": "topStory",
        "symbol": "PAC",
        "title": "BRIEF-Grupo Aeroportuario Del Pacifico Sab De Cv: During August terminal passengers increased 9.9% YOY "
    },
    {
        "content": "Jan 9 Grupo Aeroportuario Del Pacifico Sab De Cv  :",
        "date": "01092017",
        "name": "Grupo Aeroportuario Del Pacifico SA de CV",
        "news_type": "topStory",
        "symbol": "PAC",
        "title": "BRIEF-Grupo Aeroportuario Del Pacifico Sab De Cv load factor for Dec. rose by 1.7 pct points  from 77.7% in Dec. 2015 to 79.4% "
    },
    {
        "content": "* Load factor for month rose by 1 percentage point  from 74.1 percent in September 2015 to 75.1 percent in September 2016",
        "date": "10062016",
        "name": "Grupo Aeroportuario Del Pacifico SA de CV",
        "news_type": "topStory",
        "symbol": "PAC",
        "title": "BRIEF-Grupo Aeroportuario registered a 19.2 pct increase in number of seats available in Sept. 2016 compared to Sept. 2015 "
    },
    {
        "content": "Aug 12 Grupo Aeroportuario del Pacifico SAB de CV :",
        "date": "08122016",
        "name": "Grupo Aeroportuario Del Pacifico SA de CV",
        "news_type": "topStory",
        "symbol": "PAC",
        "title": "BRIEF-Grupo Aeroportuario del Pacifico sets dividend payment date "
    },
    {
        "content": "MEXICO CITY  April 23 Grupo Aeroportuario del Pacifico (GAP)  which operates 12 airports along Mexico's Pacific Coast  on Thursday said its first-quarter profit rose 3 percent on higher passenger traffic.",
        "date": "04232015",
        "name": "Grupo Aeroportuario Del Pacifico SA de CV",
        "news_type": "topStory",
        "symbol": "PAC",
        "title": "Mexican airport operator GAP reports higher 1st-qtr profit "
    },
    {
        "content": "MADRID  April 17 Spanish infrastructure firm Abertis said on Friday it had reached a deal to sell its remaining stakes in airports to Mexico's Grupo Aeroportuario del Pacifico (GAP) for 177 million euros ($190.5 million).",
        "date": "04172015",
        "name": "Grupo Aeroportuario Del Pacifico SA de CV",
        "news_type": "topStory",
        "symbol": "PAC",
        "title": "Spain's Abertis sells out of airports business with DCA disposal "
    },
    {
        "content": "MEXICO CITY  April 6 Railroad and mining company Grupo Mexico has further trimmed its stake in Mexican airport operator Grupo Aeroportuario del Pacifico  to 23.6 percent  from the 24.8 percent it reported in October  according to a regulatory filing published on Monday.",
        "date": "04062015",
        "name": "Grupo Aeroportuario Del Pacifico SA de CV",
        "news_type": "topStory",
        "symbol": "PAC",
        "title": "Grupo Mexico sells more shares in airport operator GAP "
    }
]