[
    {
        "content": "* Offers public cloud security services in collaboration with Palo Alto Networks​",
        "date": "10242017",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "BRIEF-Tata Consultancy Services offers public cloud security services in collaboration with Palo Alto Networks​ "
    },
    {
        "content": "Palo Alto Networks Inc reported higher-than-expected quarterly results as the cybersecurity firm added a record number of customers in the wake of the recent global ransomware attack.",
        "date": "08312017",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "Cybersecurity firm Palo Alto beats on record customer additions "
    },
    {
        "content": "Aug 31 - Palo Alto Networks Inc reported higher-than-expected quarterly profit and revenue  as it added a record number of customers  sending the cybersecurity firm's shares up about 5 percent after the bell on Thursday.",
        "date": "08312017",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "UPDATE 2-Cybersecurity firm Palo Alto beats on record customer additions "
    },
    {
        "content": "Aug 31 - Palo Alto Networks Inc reported a 27 percent rise in quarterly revenue as the cybersecurity company added more customers to its cloud-based security services.",
        "date": "08312017",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "CORRECTED-Palo Alto Networks posts 27 pct rise in quarterly revenue "
    },
    {
        "content": "* Reports fiscal fourth quarter and fiscal year 2017 financial results",
        "date": "08312017",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "BRIEF-Palo Alto Networks reports quarterly non-GAAP earnings per share $0.92 "
    },
    {
        "content": "* Palo Alto Networks Inc - ‍On August 29  Steffan Tomlinson EVP  chief financial officer  notified company of his intention to retire and resign​",
        "date": "08312017",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "BRIEF-Palo Alto Networks CFO  Steffan Tomlinson notifies co of his intention to retire​ "
    },
    {
        "content": "* Palo Alto Networks Inc says ‍is forming a $20 million security venture fund​",
        "date": "06132017",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "BRIEF-Palo Alto Networks forms a $20 mln security venture fund​ "
    },
    {
        "content": "Cybersecurity company Palo Alto Networks Inc's results and forecast topped expectations  helped by a near record number of customer additions that also eased concerns about its sales execution at a time of heightened cyber security awareness in the wake of the recent WannaCry ransomware attack.",
        "date": "05312017",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "Cybersecurity firm Palo Alto's third quarter report eases sales fears  shares jump "
    },
    {
        "content": "May 31 Cybersecurity company Palo Alto Networks Inc's results and forecast topped expectations  helped by a near record number of customer additions that also eased concerns about its sales execution at a time of heightened cyber security awareness in the wake of the recent WannaCry ransomware attack.",
        "date": "05312017",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "UPDATE 2-Cybersecurity firm Palo Alto's Q3 report eases sales fears  shares jump "
    },
    {
        "content": "* Palo Alto Networks reports fiscal third quarter 2017 financial results",
        "date": "05312017",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "BRIEF-Palo Alto Networks Q3 non-gaap EPS $0.61 "
    },
    {
        "content": "May 31 Cybersecurity company Palo Alto Networks Inc reported a better-than-expected adjusted profit for the third quarter  driven by expansion within its existing customer base as well as new customer additions.",
        "date": "05312017",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "Palo Alto's adjusted profit tops estimates  shares jump "
    },
    {
        "content": "Feb 28 Cybersecurity company Palo Alto Networks Inc forecast third-quarter revenue and profit well below analysts' estimates  sending its shares down 18 percent after the bell on Tuesday.",
        "date": "02282017",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "UPDATE 1-Cybersecurity firm Palo Alto's forecasts miss estimates "
    },
    {
        "content": "* Palo alto networks extends safe application enablement and breach prevention from the network to the cloud with enhancements to its next-generation security platform  Source text for Eikon:  Further company coverage:",
        "date": "02072017",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "BRIEF-Palo Alto Networks provides details on its security platform "
    },
    {
        "content": "* Jennison Associates LLC reports 5.8 percent passive stake in Palo Alto Networks Inc as of December 31  2016 - SEC filing  Source text: (http://bit.ly/2l3UcFk) Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "02032017",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "BRIEF-Jennison Associates reports 5.8 pct passive stake in Palo Alto Networks - SEC filing "
    },
    {
        "content": "* Palo Alto Networks reports fiscal first quarter 2017 financial results",
        "date": "11212016",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "BRIEF-Palo Alto Networks reports Q1 GAAP loss per share $0.69 "
    },
    {
        "content": "* Palo Alto Networks appoints Mary Pat Mccarthy to board of directors  Source text for Eikon:  Further company coverage:",
        "date": "10242016",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "BRIEF-Palo alto networks appoints Mary Pat Mccarthy to its board "
    },
    {
        "content": "Cyber security firm Palo Alto Networks Inc forecast current-quarter revenue and profit below analysts' estimates  sending its shares down 3 percent in extended trading on Tuesday.",
        "date": "08302016",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "Palo Alto forecasts revenue below estimates  shares drop "
    },
    {
        "content": "Aug 30 Cyber security firm Palo Alto Networks Inc forecast current-quarter revenue and profit below analysts' estimates  sending its shares down 3 percent in extended trading on Tuesday.",
        "date": "08302016",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "UPDATE 1-Palo Alto forecasts revenue below estimates  shares drop "
    },
    {
        "content": "Aug 30 Palo Alto Networks Inc's  quarterly revenue jumped 41 percent as spending by companies and governments on cyber security stayed strong after a spate of major attacks in the past few years.",
        "date": "08302016",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "Cyber security firm Palo Alto's quarterly revenue jumps 41 pct "
    },
    {
        "content": "Palo Alto Networks Inc  forecast fourth-quarter revenue and an adjusted profit that disappointed Wall Street  overshadowing the cyber security company's better-than-expected 48 percent jump in third-quarter revenue.",
        "date": "05262016",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "Cyber security firm Palo Alto's forecast disappoints Wall Street "
    },
    {
        "content": "* Peers FireEye  Fortinet also trade lower   (Adds forecast details; updates shares)",
        "date": "05262016",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "UPDATE 2-Cyber security firm Palo Alto's forecast disappoints Wall St "
    },
    {
        "content": "* Q4 earnings per share view $0.50  revenue view $389.5 million -- Thomson Reuters I/B/E/S",
        "date": "05262016",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "BRIEF-Palo Alto Networks posts Q3 non-gaap EPS of $0.42 "
    },
    {
        "content": "May 26 Palo Alto Networks Inc reported a 47.7 percent jump in quarterly revenue as it gained new customers for its cyber security products  particularly in its burgeoning services unit.",
        "date": "05262016",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "Cyber security firm Palo Alto's revenue jumps 47.7 pct "
    },
    {
        "content": "Feb 25 Cyber security company Palo Alto Networks Inc reported a 54 percent jump in quarterly revenue  boosted by higher spending by companies and governments to protect themselves from cyber attacks.",
        "date": "02252016",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "Palo Alto's revenue surges 54 pct on higher cyber security spending "
    },
    {
        "content": "Cyber security company Palo Alto Networks Inc  forecast current quarter sales that beat market expectations and reported higher-than-expected quarterly revenue as companies and governments spent more to protect themselves from cyber attacks.",
        "date": "11232015",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "Palo Alto forecast beats Street on higher cyber security spend "
    },
    {
        "content": "Nov 23 Cyber security company Palo Alto Networks Inc forecast current quarter sales that beat market expectations and reported higher-than-expected quarterly revenue as companies and governments spent more to protect themselves from cyber attacks.",
        "date": "11232015",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "UPDATE 1-Palo Alto forecast beats Street on higher cyber security spend "
    },
    {
        "content": "Nov 23 Cyber security company Palo Alto Networks Inc reported a 54.6 percent jump in quarterly revenue as companies and governments spent more to protect themselves from cyber attacks.",
        "date": "11232015",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "Palo Alto revenue jumps on strong demand for cyber security "
    },
    {
        "content": "Cyber security company Palo Alto Networks Inc  reported its strongest revenue growth in 10 quarters and forecast better-than-expected growth in the current quarter as governments and companies spend more to protect themselves from cyber attacks.",
        "date": "09092015",
        "name": "Palo Alto Networks Inc",
        "news_type": "topStory",
        "symbol": "PANW",
        "title": "Palo Alto Networks posts biggest revenue rise in 10 quarters "
    },
    {
        "content": "* Shares up 5 percent in extended trading   (Adds CEO and analyst comments  details; updates shares)",
        "date": "09092015",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "UPDATE 2-Palo Alto Networks posts biggest revenue rise in 10 quarters "
    },
    {
        "content": "Sept 9 Cyber security company Palo Alto Networks Inc reported a 59.3 percent jump in quarterly revenue as companies and governments spent more to protect their networks amid  sophisticated cyber attacks.",
        "date": "09092015",
        "name": "Palo Alto Networks Inc",
        "news_type": "normal",
        "symbol": "PANW",
        "title": "Palo Alto revenue jumps as companies boost cyber security spending "
    }
]