[
    {
        "content": "* People's United Financial reports third quarter net income of $90.8 million  or $0.26 per common share",
        "date": "10192017",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United Financial reports Q3 earnings $0.26/shr "
    },
    {
        "content": "* People's United Financial  Inc. Names Jane Chwick to board of directors",
        "date": "09222017",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United Financial  Inc. Names Jane Chwick to board of directors "
    },
    {
        "content": "* People's United Bank acquires Leaf Commercial Capital  Inc.  one of the largest  independent commercial equipment finance companies in the U.S.",
        "date": "07192017",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United Bank acquires Leaf Commercial Capital "
    },
    {
        "content": "* People's United Financial reports second quarter net income of $69.3 million  or $0.19 per common share",
        "date": "07202017",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United Financial Q2 net income $69.3 million "
    },
    {
        "content": "* People's United Financial reports first quarter net income of $70.8 million  or $0.22 per common share  and announces common dividend increase",
        "date": "04202017",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United Financial Q1 net income $70.8 million "
    },
    {
        "content": "* People's United Financial reports fourth quarter net income of $75.9 million  or $0.24 per common share",
        "date": "01192017",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United Financial reports Q4 non-gaap operating EPS $0.24 "
    },
    {
        "content": "* Says priced public offering of 10 million shares of fixed-to-floating rate non-cumulative perpetual preferred stock  series a  par value $0.01/share  Source text for Eikon:  Further company coverage:",
        "date": "10242016",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United announces pricing of offering of preferred stock "
    },
    {
        "content": "Oct 24 Wall Street signaled skepticism on Monday that AT&T Inc would secure the government approvals needed to carry out its planned $85.4 billion acquisition of Time Warner Inc  with shares of both companies falling as analysts scrutinized the deal.",
        "date": "10242016",
        "name": "People&#39;s United Financial Inc",
        "news_type": "normal",
        "symbol": "PBCT",
        "title": "UPDATE 5-AT&T  Time Warner shares dip with worries about deal clearance "
    },
    {
        "content": "* Suffolk shareholders approve the proposed merger of suffolk bancorp and people's united financial  inc.  Source text for Eikon:  Further company coverage:",
        "date": "10132016",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-Suffolk shareholders approve proposed merger of Suffolk Bancorp and People's United "
    },
    {
        "content": "* Files for mixed shelf by selling securityholders; amount undisclosed  Source text for Eikon:  Further company coverage:",
        "date": "09202016",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United Financial files for mixed shelf by selling securityholders amount undisclosed "
    },
    {
        "content": "* People's United Financial Inc sees 2016 net interest income growth in the range of 5% to 7% -SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom : +1-646-223-8780)",
        "date": "07222016",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United Financial Inc sees 2016 net interest income growth of 5-7 pct "
    },
    {
        "content": "* Q2 net interest margin decreased four basis points from 1Q to 2.79%",
        "date": "07212016",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United Financial Q2 earnings per share $0.23 "
    },
    {
        "content": "* People's United Financial  Inc. to acquire Suffolk Bancorp; transaction valued at approximately $402 million",
        "date": "06272016",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "BRIEF-People's United Financial  Inc. to acquire Suffolk Bancorp "
    },
    {
        "content": "* Indexes down: Dow 1 pct  S&P 1 pct  Nasdaq 1.07 pct   (Updates to late afternoon)",
        "date": "02232016",
        "name": "People&#39;s United Financial Inc",
        "news_type": "normal",
        "symbol": "PBCT",
        "title": "US STOCKS-Wall St slides as oil prices hit again "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 06 (Fitch) Fitch Ratings plans to withdraw the ratings on People's  United Financial  Inc. and subsidiaries on or about Aug. 6  2015  for commercial  reasons.  Fitch currently rates People's United Financial  Inc. as follows:  People's United Financial  Inc. --Long-term Issuer Default Rating (IDR) 'BBB+';  --Viability rating 'bbb+';  --Senior unsecured 'BBB+'; --Short-term IDR 'F2'. People's United Bank --Long-term IDR 'BB",
        "date": "07062015",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "Fitch Plans to Withdraw Ratings of People's United Financial  Inc. and Subsidiaries "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 30 (Fitch) Fitch Ratings has downgraded People's United  Financial's (PBCT) ratings to 'BBB+/F2'. The Rating Outlook is revised to Stable  from Negative. The downgrade reflects PBCT's declining capital levels  elevated  commercial loan growth and profitability well below its rated peers.  The rating action follows a periodic review of the mid-tier regional banking  group  which includes BOK Financial Corp. (BOKF)  Cath",
        "date": "01302015",
        "name": "People&#39;s United Financial Inc",
        "news_type": "topStory",
        "symbol": "PBCT",
        "title": "Fitch Downgrades People's United Financial's Ratings to 'BBB+/F2'; Outlook Stable "
    }
]