[
    {
        "content": "* PBF Energy reports third quarter 2017 results  declares dividend of $0.30 per share",
        "date": "11022017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-PBF Energy Q3 earnings per share $2.85 "
    },
    {
        "content": "NEW YORK/HOUSTON PBF Energy has turned to Iraq to help replace Venezuelan barrels at its East Coast refineries after suspending direct purchases of heavy oil from Venezuela's PDVSA amid U.S. sanctions  according to Thomson Reuters Eikon data.",
        "date": "10252017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "Iraq emerges as early winner in U.S.-Venezuela oil dispute "
    },
    {
        "content": "HOUSTON PBF Energy was restarting its 190 000 barrel-per-day (bpd) Chalmette  Louisiana  refinery on Sunday after it was knocked out of production by a morning power outage  said sources familiar with plant operations.",
        "date": "10232017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "PBF Chalmette refinery restarting after power outage: sources "
    },
    {
        "content": "HOUSTON The fifth largest U.S. buyer of Venezuelan crude  PBF Energy Inc  has halted direct purchases from state-run oil company PDVSA  according to four sources  deepening a rift amid sanctions on the OPEC-member country.",
        "date": "10112017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "Exclusive: PBF's split with PDVSA grows as U.S. refiner halts direct deals "
    },
    {
        "content": "HOUSTON PBF Energy and Royal Dutch Shell Plc were preparing their Louisiana refineries to keep running during Tropical Storm Nate  which is forecast to make landfall in the state on Sunday  sources familiar with plant operations said on Thursday.",
        "date": "10052017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "PBF  Shell prep Louisiana refineries to keep running in storm: sources "
    },
    {
        "content": "HOUSTON  Oct 5 PBF Energy and Royal Dutch Shell Plc were preparing their Louisiana refineries to keep running during Tropical Storm Nate  which is forecast to make landfall in the state on Sunday  sources familiar with plant operations said on Thursday.",
        "date": "10052017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "UPDATE 2-PBF  Shell prep Louisiana refineries to keep running in storm: sources "
    },
    {
        "content": "MEXICO CITY  Aug 31 Mexican billionaire Carlos Slim has taken a 5.4 percent stake in refiner PBF Energy Inc   his second energy investment this month  according to a filing with the U.S. Securities and Exchange Commision.",
        "date": "08312017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "Mexican tycoon Slim takes stake in PBF Energy "
    },
    {
        "content": "NEW YORK  Aug 29 U.S. refiners in the Midwest will be among the biggest winners after Hurricane Harvey dealt a blow to their competitors on the U.S. Gulf Coast.",
        "date": "08292017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "U.S. Midwest refiners eye best quarter in two years as Harvey hits rivals "
    },
    {
        "content": "    By Alexandra Ulmer and Marianna Parraga     CARACAS/HOUSTON  Aug 30 U.S. sanctions on the finance boss of Venezuela's oil company PDVSA have led to some exports to the United States being blocked as banks and investment funds refuse to provide letters of credit to potential buyers  three financial sources said.     U.S. businesses are barred from dealing with a sanctioned person or company and one of the sources said the sanctions on PDVSA's Finance Vice President Simon Zerpa wer",
        "date": "08302017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "U.S. sanctions on Venezuela oil company CFO tangle financial deals -sources "
    },
    {
        "content": "CARACAS  Aug 18 A U.S.-led \"blockade\" has hurt Venezuelan state oil company PDVSA's capacity to undertake routine financial transactions  and forced it to rely on political allies like China and Russia  the company's president said on Friday.",
        "date": "08182017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "UPDATE 1-Venezuelan oil company PDVSA blasts 'financial blockade' "
    },
    {
        "content": "* Says company's board of directors now consists of nine members  including eight independent directors - SEC Filing​ Source text: (http://bit.ly/2wfrTcW) Further company coverage:",
        "date": "08042017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-PBF Energy Inc says board now consists of 9 members - SEC Filing​ "
    },
    {
        "content": "    July 18 The following is a list of refinery incidents reported in the United States on July 18:           * Marathon Texas City refinery idled by crude unit leak -sources                                 * Shell reports process unit upset at Deer Park  Texas facility                                 * Marathon Galveston Bay residual HTU operating normally -sources                               * Marathon reports RHU compressor issue at Galveston Bay  Texas refinery                 ",
        "date": "07192017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "DIARY-U.S. refinery operations-Marathon Texas City refinery idled by crude unit leak "
    },
    {
        "content": "NEW YORK Refiners from the Midwest United States are fighting for access to a vital Pennsylvania pipeline – a move that could cripple their East Coast competitors and redraw the map for international flows of crude and fuel into coveted coastal markets.",
        "date": "06022017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "Pennsylvania pipeline fight could upend international oil flows "
    },
    {
        "content": "NEW YORK  June 2 Refiners from the Midwest United States are fighting for access to a vital Pennsylvania pipeline – a move that could cripple their East Coast competitors and redraw the map for international flows of crude and fuel into coveted coastal markets.",
        "date": "06022017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "INSIGHT-Pennsylvania pipeline fight could upend international oil flows "
    },
    {
        "content": "NEW YORK  June 2 Refiners from the Midwest United States are fighting for access to a vital Pennsylvania pipeline – a move that could cripple their East Coast competitors and redraw the map for international flows of crude and fuel into coveted coastal markets.",
        "date": "06022017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "RPT-INSIGHT-Pennsylvania pipeline fight could upend international oil flows "
    },
    {
        "content": "* Pbf energy announces pricing of $725 million of 7.25% senior notes due 2025",
        "date": "05222017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-PBF energy prices senior notes due 2025 "
    },
    {
        "content": "* PBF Energy announces cash tender offer by PBF Holding Company for any and all of its outstanding 8.25% senior secured notes due 2020",
        "date": "05222017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "BRIEF-PBF Energy announces cash tender offer by PBF Holding Company "
    },
    {
        "content": "* Pbf energy reports first quarter 2017 results  declares dividend of $0.30 per share",
        "date": "05042017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-PBF Energy Q1 loss per share $0.29 "
    },
    {
        "content": "HOUSTON  March 29 An aging California refinery is testing PBF Energy Inc's reputation as a turnaround whiz  with mounting production woes and costly repairs at the 88-year-old plant throwing a wrench into efforts to quickly revive profits.",
        "date": "03292017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "Troubled California oil refinery puts PBF's turnaround skills to the test "
    },
    {
        "content": "HOUSTON  March 29 An aging California refinery is testing PBF Energy Inc's reputation as a turnaround whiz  with mounting production woes and costly repairs at the 88-year-old plant throwing a wrench into efforts to quickly revive profits.",
        "date": "03292017",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "RPT-Troubled California oil refinery puts PBF's turnaround skills to the test "
    },
    {
        "content": "* PBF Energy reports fourth quarter 2016 results  declares dividend of $0.30 per share",
        "date": "02162017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-PBF Energy reports Q4 adj. loss per share $0.71 "
    },
    {
        "content": "HOUSTON Production at Exxon  PBF  Phillips 66 and Motiva refineries in southeast Louisiana were unaffected by severe weather on Tuesday that spawned tornadoes  the companies and Gulf Coast market sources said.",
        "date": "02072017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "Production at five Louisiana refineries unaffected by tornadoes "
    },
    {
        "content": "* PBF Holding Company LLC announces extension of exchange offer for 7.00 pct senior secured notes due 2023",
        "date": "01062017",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-PBF Holding Company LLC extends exchange offer for 7.00 pct senior secured notes due 2023 "
    },
    {
        "content": "HOUSTON PBF Energy is in the process of changing the alkylation tower at its Torrance refinery and has moved up planned work at the facility originally slated for January  a source familiar with the matter said on Friday.",
        "date": "12022016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "PBF Energy changing Torrance alkylation tower  moves up planned work "
    },
    {
        "content": "NEW YORK  Oct 28 PBF Energy Inc plans to increase product exports in the upcoming months to help reduce its exposure to the rising costs of meeting U.S. renewable fuel standards  its chief executive officer said during an earnings call on Friday.",
        "date": "10282016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "UPDATE 1-PBF Energy plans to increase fuel exports to reduce renewable fuel costs "
    },
    {
        "content": "* PBF Energy reports third quarter 2016 results  declares dividend of $0.30 per share",
        "date": "10282016",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "BRIEF-PBF Energy Q3 adjusted loss $0.16 per share "
    },
    {
        "content": "HOUSTON  Oct 14 PBF Energy Inc has received a violation notice from air regulators for excessive flaring at its Torrance refinery in Los Angeles  just days after an outage at a local utility knocked the facility offline yet again.",
        "date": "10142016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "UPDATE 2-PBF Energy cited for excessive flaring at Torrance  Calif.  refinery "
    },
    {
        "content": "* Has approximately $149.2 million of available repurchase authorization under program going forward",
        "date": "09302016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "REFILE-BRIEF-PBF Energy board approves two-year extension to existing share repurchase program "
    },
    {
        "content": "NEW YORK  Sept 9 U.S. oil refiners  beset by the weakest profit margins in six years  have been laying off workers  revamping operations and ratcheting up pressure on regulators and lawmakers to tweak the renewable fuel program  whose costs have ballooned.",
        "date": "09092016",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "U.S. refiners revamp operations as renewable fuel costs surge "
    },
    {
        "content": "* PBF Logistics announces intent to acquire Torrance Valley Pipeline interest",
        "date": "08112016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-PBF Logistics to acquire Torrance Valley Pipeline interest "
    },
    {
        "content": "HOUSTON  July 29 PBF Energy Inc on Friday said its newly acquired Torrance refinery near Los Angeles had been running above its historic throughput rates for the last month after it took ownership of the facility from ExxonMobil on July 1.",
        "date": "07292016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-PBF Energy's Torrance refinery running above historic average "
    },
    {
        "content": "* PBF Energy reports second quarter 2016 results  declares dividend of $0.30 per share",
        "date": "07292016",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "BRIEF-PBF Energy posts Q2 earnings of $1.06/share "
    },
    {
        "content": "HOUSTON  July 13 PBF Energy was in the process of restarting a hydrotreater and fluid catalytic cracking unit (FCC) at its newly-acquired Torrance refinery near Los Angeles on Wednesday  a source familiar with the matter said.",
        "date": "07132016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "PBF Energy restarting hydrotreater and FCC at Torrance refinery "
    },
    {
        "content": "HOUSTON  July 1 U.S. refiner PBF Energy  took ownership on Friday of a Los Angeles-area refinery purchased from Exxon Mobil Corp for $537.5 million  clearing the way for it to focus on further North American acquisitions.",
        "date": "07012016",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "PBF takes over Los Angeles-area Exxon refinery after setbacks "
    },
    {
        "content": "* PBF Energy completes acquisition of Torrance Refinery and related logistics assets",
        "date": "07012016",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "BRIEF-PBF Energy completes acquisition of Torrance Refinery "
    },
    {
        "content": "NEW YORK PBF Energy  has delayed plans to build a $100 million hydrogen plant at its refinery in Delaware City  Delaware  due to weak earnings dragged down in part by unexpected problems at the facility  according to a source familiar with the plant's operations.",
        "date": "06022016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "Stung by weak profits  PBF delays hydrogen project at Delaware refinery: source "
    },
    {
        "content": "* Pbf energy and pbf logistics announce retirement of thomas d. O'malley",
        "date": "05272016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-PBF energy and PBF logistics says Thomas O'malley to retire "
    },
    {
        "content": "* Says ceo thomas o'malley's fy 2015 total compensation $8.3 million versus $8.1 million in fy 2014 - sec filing  Source text : http://1.usa.gov/1RwOVUx Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "03222016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-Pbf Energy CEO Thomas O'malley's 2015 total compensation was $8.3 mln "
    },
    {
        "content": "HOUSTON  March 18 A power failure on Wednesday at Exxon Mobil's 149 500 barrel per day Torrance refinery in Los Angeles is delaying restart activities that must be complete before PBF Energy acquires the facility this year.",
        "date": "03182016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "BRIEF-Upset at Exxon's Torrance refinery delays critical startup activities "
    },
    {
        "content": "Feb 2 U.S. refiner PBF Energy's logistics arm is doubling its nationwide fuel storage capacity with over 4 million barrels of tanks in the Philadelphia area  giving it greater freedom to trade in a key market.",
        "date": "02022016",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "UPDATE 1-PBF doubles E.Coast fuel tank space  keeping a third for itself "
    },
    {
        "content": "NEW YORK  Oct 29 PBF Energy expects rail volumes of Bakken crude oil at its East Coast refineries to drop significantly next year  calling rail deliveries \"price challenged \" the company said on Thursday.",
        "date": "10292015",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "UPDATE 1-PBF Energy expects significant slowdown in East Coast rail volumes -CEO "
    },
    {
        "content": "NEW YORK  Oct 29 PBF Energy is expecting rail volumes of Bakken crude oil at its East Coast refineries to drop significantly next year  calling rail deliveries \"price challenged \" the company said on Thursday.",
        "date": "10292015",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "REFILE-PBF Energy expects significant slowdown in East Coast rail volumes - CEO "
    },
    {
        "content": "Oct 1 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "10012015",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "PBF Energy Inc  agreed to buy Exxon Mobil Corp's  refinery in Torrance  California  for $537.5 million  completing Executive Chairman Tom O'Malley's vision to have PBF plants coast to coast.",
        "date": "09302015",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "PBF Energy buys Torrance refinery in bid for national footprint "
    },
    {
        "content": "HOUSTON  Oct 1 PBF Energy Inc's purchase of Exxon Mobil Corp's California refinery marks Chairman Tom O'Malley's biggest bet yet on U.S. refining in the country's toughest market.",
        "date": "10012015",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "RPT-California could be PBF's biggest refinery challenge yet "
    },
    {
        "content": "Sept 30 PBF Energy Inc agreed to buy Exxon Mobil Corp's refinery in Torrance  California  for $537.5 million  completing Executive Chairman Tom O'Malley's vision to have PBF plants coast to coast.",
        "date": "09302015",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "UPDATE 1-PBF Energy buys Torrance refinery in bid for national footprint "
    },
    {
        "content": "HOUSTON  Oct 1 PBF Energy Inc's purchase of Exxon Mobil Corp's California refinery marks Chairman Tom O'Malley's biggest bet yet on U.S. refining in the country's toughest market.",
        "date": "10012015",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "California could be PBF's biggest refinery challenge yet "
    },
    {
        "content": "Sept 30 PBF Energy Inc said it would buy Exxon Mobil Corp's refinery in Torrance  California and restore it to full working order before the deal closes in the second quarter of 2016.",
        "date": "09302015",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "PBF Energy to buy Exxon Mobil's Torrance refinery "
    },
    {
        "content": "HOUSTON  Sept 14 PBF Energy Inc plans to restart a 20 000 barrel-per-day (bpd) hydrocracking unit  perhaps as early as late 2016  at the 192 500-bpd refinery in Chalmette  Louisiana  of which the company is scheduled to take possession by the end of this year  said sources familiar with PBF's plans.",
        "date": "09152015",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "UPDATE 1-PBF planning to restart Chalmette refinery hydrocracker -sources "
    },
    {
        "content": "NEW YORK  Aug 24 A key gasoline-making unit at PBF Energy Inc's 182 200-barrel-per-day (bpd) Delaware City  Delaware  refinery is expected to be shut for at least a month - and possibly much longer - following an explosion and fire on Friday  a source familiar with plant operations said on Sunday.",
        "date": "08242015",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "PBF's Delaware City catalytic cracker shut for at least a month -source "
    },
    {
        "content": "NEW YORK U.S. oil refiner PBF Energy Inc is shipping a cargo of crude from Western Canada to supply its plant on the other side of the continent  a rare move traders say is a sign steep discounts for oil sands are upending age-old trade routes.",
        "date": "08062015",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "In rare move  PBF snaps up oil cargo from Western Canada "
    },
    {
        "content": "June 18 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "06182015",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "June 18 PBF Energy Inc agreed to buy the 189 000 barrel-a-day Chalmette  Louisiana  refinery for $322 million from Exxon Mobil Corp and Petroleos de Venezuela SA  marking the New Jersey-based company's Gulf Coast debut.",
        "date": "06182015",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "UPDATE 3-PBF Energy to buy Chalmette refinery from Exxon  PDVSA "
    },
    {
        "content": "June 18 PBF Energy Inc said it will buy the 189 000-barrel-per-day Chalmette oil refinery in Louisiana and related assets from Exxon Mobil Corp and Venezuela's national oil company  Petroleos de Venezuela SA (PDVSA)  for $322 million.",
        "date": "06182015",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "PBF Energy to buy Chalmette refinery from Exxon and PDVSA "
    },
    {
        "content": "NEW YORK  June 3 PBF Energy has extended its offtake agreement at its East Coast refineries with the commodity trading arm of Goldman Sachs  the company disclosed in a federal filing Wednesday.",
        "date": "06032015",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "PBF extends offtake accord with Goldman at East Coast refineries "
    },
    {
        "content": "NEW YORK  April 30 PBF Energy executives said on Thursday they have yet to deliver on plans to grow the company through acquisitions but remained hopeful.",
        "date": "04302015",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "UPDATE 1-PBF Energy hopeful on acquisitions  keen on West Coast refineries "
    },
    {
        "content": "NEW YORK PBF Energy  executives said on Thursday they have yet to deliver on plans to grow the company through acquisitions but remained hopeful.",
        "date": "04302015",
        "name": "PBF Energy Inc",
        "news_type": "normal",
        "symbol": "PBF",
        "title": "PBF Energy says acquisitions possible in the future "
    },
    {
        "content": "NEW YORK  Feb 12 PBF Energy Inc's three refineries will not be affected by the strike by United Steelworkers union workers currently impacting 11 plants  the company said during a conference call with analysts on Thursday.",
        "date": "02122015",
        "name": "PBF Energy Inc",
        "news_type": "topStory",
        "symbol": "PBF",
        "title": "PBF Energy says its refineries will not be affected by strike "
    }
]