[
    {
        "content": "* Puma Biotechnology reports third quarter 2017 financial results",
        "date": "11092017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "BRIEF-Puma Biotechnology reports Q3 adj. loss per share $1.36 "
    },
    {
        "content": "* Puma Biotechnology secures $100 million term loan from Silicon Valley Bank and Oxford Finance",
        "date": "11022017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "BRIEF-Puma Biotechnology secures $100 mln term loan from Silicon Valley Bank and Oxford Finance "
    },
    {
        "content": "BOSTON  Nov 2 A former Puma Biotechnology Inc executive pleaded guilty on Thursday to U.S. charges that he traded on inside information ahead of announcements by the biopharmaceutical company about a drug it was developing to treat breast cancer.",
        "date": "11022017",
        "name": "Puma Biotechnology Inc",
        "news_type": "normal",
        "symbol": "PBYI",
        "title": "Former Puma Biotech executive pleads guilty to insider trading "
    },
    {
        "content": "* Puma Biotechnology reports second quarter 2017 financial results",
        "date": "08092017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "BRIEF-Puma Biotechnology reports Q2 loss per share $2.10 "
    },
    {
        "content": "July 17 The U.S. Food and Drug Administration (FDA) on Monday approved Puma Biotechnology Inc's lead drug to treat patients with a type of early-stage breast cancer.",
        "date": "07172017",
        "name": "Puma Biotechnology Inc",
        "news_type": "normal",
        "symbol": "PBYI",
        "title": "U.S. FDA approves Puma Biotech's breast cancer treatment "
    },
    {
        "content": "July 17 The U.S. Food and Drug Administration (FDA) on Monday approved Puma Biotechnology Inc's experimental breast cancer drug that lowers the risk of the disease returning after initial treatment.",
        "date": "07172017",
        "name": "Puma Biotechnology Inc",
        "news_type": "normal",
        "symbol": "PBYI",
        "title": "UPDATE 2-U.S. FDA approves Puma Biotech's breast cancer treatment "
    },
    {
        "content": "* U.S. Food and Drug Administration approves Puma's Nerlynx (neratinib) for extended adjuvant treatment of HER2-positive early stage breast cancer",
        "date": "07172017",
        "name": "Puma Biotechnology Inc",
        "news_type": "normal",
        "symbol": "PBYI",
        "title": "BRIEF-U.S. FDA approves Puma's Nerlynx for extended adjuvant treatment of HER2-positive early stage breast cancer "
    },
    {
        "content": "* U.S. Food and Drug Administration - approved Nerlynx (neratinib) for the extended adjuvant treatment of early-stage  her2-positive breast cancer",
        "date": "07172017",
        "name": "Puma Biotechnology Inc",
        "news_type": "normal",
        "symbol": "PBYI",
        "title": "BRIEF-FDA approves Puma Biotech's new treatment to reduce risk of breast cancer returning "
    },
    {
        "content": "* Partner Fund Management LP reports 8.1 percent passive stake in Puma Biotechnology Inc as of May 24 Source text: (http://bit.ly/2sKtGnE) Further company coverage:",
        "date": "06052017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "BRIEF-Partner Fund Management reports 8.1 pct passive stake in Puma Biotechnology "
    },
    {
        "content": "WASHINGTON  May 24 Puma Biotechnology Inc's experimental breast cancer drug reduces the risk of the disease's recurrence and should be approved  a U.S. Food and Drug Administration advisory committee concluded on Wednesday  sending the stock up as much as 30 percent.",
        "date": "05242017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "UPDATE 3-U.S. FDA panel backs Puma Biotech's breast cancer drug; stock soars "
    },
    {
        "content": "WASHINGTON Puma Biotechnology Inc's experimental breast cancer drug reduces the risk of disease recurrence and should be approved  an advisory committee to the U.S. Food and Drug Administration concluded on Wednesday.",
        "date": "05242017",
        "name": "Puma Biotechnology Inc",
        "news_type": "normal",
        "symbol": "PBYI",
        "title": "U.S. FDA panel backs Puma Biotech's breast cancer drug "
    },
    {
        "content": "* Puma biotechnology receives fda advisory committee support for neratinib",
        "date": "05242017",
        "name": "Puma Biotechnology Inc",
        "news_type": "normal",
        "symbol": "PBYI",
        "title": "BRIEF-Puma Biotechnology receives FDA advisory committee support for Neratinib "
    },
    {
        "content": "Puma Biotechnology Inc's experimental breast cancer drug neratinib appears to be effective  though there is some uncertainty as to the magnitude of the benefit  a preliminary review by the U.S. Food and Drug Administration concluded.",
        "date": "05222017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "Puma Biotech shares jump after initial FDA review of cancer drug "
    },
    {
        "content": "May 22 Puma Biotechnology Inc's experimental breast cancer drug neratinib appears to be effective  though there is some uncertainty as to the magnitude of the benefit  a preliminary review by the U.S. Food and Drug Administration concluded.",
        "date": "05222017",
        "name": "Puma Biotechnology Inc",
        "news_type": "normal",
        "symbol": "PBYI",
        "title": "UPDATE 2-Puma Biotech shares jump after initial FDA review of cancer drug "
    },
    {
        "content": "May 22 Shares of Puma Biotechnology Inc surged about 80 percent on Monday after the U.S. Food and Drug Administration staffers concluded after a preliminary review that the company's experimental breast cancer drug was effective.",
        "date": "05222017",
        "name": "Puma Biotechnology Inc",
        "news_type": "normal",
        "symbol": "PBYI",
        "title": "FDA staff finds Puma Biotech's cancer drug effective  shares soar "
    },
    {
        "content": "* Based On Sensitivity Analyses Conducted  Results Appear To Be Generally Similar To Primary Analysis Results  Supporting Effect Of Puma Biotechnology Inc's Neratinib",
        "date": "05222017",
        "name": "Puma Biotechnology Inc",
        "news_type": "normal",
        "symbol": "PBYI",
        "title": "BRIEF-Fda staff says results supporting effect of Puma Biotechnology's neratinib "
    },
    {
        "content": "* Puma Biotechnology reports first quarter 2017 financial results",
        "date": "05102017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "BRIEF-Puma Biotechnology Q1 adjusted non-GAAP loss per share $1.16 "
    },
    {
        "content": "* Puma Biotechnology - on April 28  Robert Charnas  senior VP  regulatory affairs and project management  notified co that he will be resigning for health reasons Source text for Eikon: (http://bit.ly/2q4pLVy) Further company coverage:",
        "date": "05042017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "BRIEF-Puma Biotechnology's Robert Charnas resigns "
    },
    {
        "content": "* Puma Biotechnology announces FDA advisory committee to review neratinib for the extended adjuvant treatment of HER2-positive early stage breast cancer",
        "date": "04172017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "BRIEF-Puma Biotechnology announces FDA advisory committee to review neratinib for extended adjuvant treatment of HER2-positive early stage breast cancer "
    },
    {
        "content": "* Puma Biotechnology presents interim results of Phase II CONTROL trial of PB272 in extended adjuvant treatment of HER2-positive early stage breast cancer at the 2017 AACR annual meeting",
        "date": "04042017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "BRIEF-Puma Biotechnology presents interim results of Phase II CONTROL trial of PB272 "
    },
    {
        "content": "* Puma Biotechnology provides update on review of marketing authorisation application for PB272",
        "date": "03012017",
        "name": "Puma Biotechnology Inc",
        "news_type": "topStory",
        "symbol": "PBYI",
        "title": "BRIEF-Puma Biotechnology provides update on review of marketing authorisation application for PB272 "
    }
]