[
    {
        "content": "* Says updating 2017 guidance for projected GAAP earnings to the range of $3.36 to $3.56 per share‍​",
        "date": "11022017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Corp Q3 operating revenue $4 517 million "
    },
    {
        "content": "* ‍PG&E nears electric restoration completion; gas restoration more than 60 percent complete in communities impacted by northern california wildfires​",
        "date": "10172017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-‍PG&E nears electric restoration completion "
    },
    {
        "content": "* ‍PG&E responds to devastating  wind-driven wildfires in North Bay​",
        "date": "10102017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-‍PG&E responds to wind-driven wildfires in North Bay​ "
    },
    {
        "content": "Shares of PG&E  fell for the third straight day on Friday on investor concerns the company may have to pay damages after authorities suggested power lines toppled by strong winds may have sparked the worst wildfire in California's history.",
        "date": "10132017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "PG&E falls as California wildfires spark investor concerns "
    },
    {
        "content": "* Says co's parent company plans to offer a takeover bid for 618 080 shares (or no less than 618 080 shares) of the co's stock  at the price of 1 100 yen per share",
        "date": "09012017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-Parent company says TOB for shares of Yagami "
    },
    {
        "content": "* Qtrly gaap net income was $0.79 per share; qtrly non-gaap earnings from operations were $0.86 per share‍​‍​",
        "date": "07272017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E reaffirms FY forecsat for non-gaap EPS of $3.55-$3.75 "
    },
    {
        "content": "* PARENT COMPANY H1 PRELIM PRODUCTION VALUE EUR 14.7 MILLION VERSUS EUR 10.6 MILLION YEAR AGO",
        "date": "07252017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-Mondo TV parent company H1 prelim net profit up at EUR 5.9 mln YoY "
    },
    {
        "content": "* DEMANDS AND RECEIVES OPENING OF SAFEGUARD PROCEDURE OF PARENT COMPANY FROM TRIBUNAL DE COMMERCE DE BORDEAUX FOLLOWING BAD H1 2017 PERFORMANCE",
        "date": "07062017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-Actiplay announces opening of safeguard procedure of parent company "
    },
    {
        "content": "* PG&E Corporation raises common stock dividend  shareholders elect former secretary of homeland security Jeh C. Johnson to boards of directors",
        "date": "05312017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Corp raises common stock dividend "
    },
    {
        "content": "* PG&E Corp - adjusts FY 2017 gaap earnings per share view to $3.57 to $3.82",
        "date": "05022017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Corp q1 non-gaap operating earnings per share $1.06 "
    },
    {
        "content": "* PG&E Corp - Former-CEO  current executive chair of board Anthony Earley Jr's 2016 compensation was $11.7 million versus $12.2 million in 2015 - SEC filing Source text: (http://bit.ly/2pehzBs) Further company coverage:",
        "date": "04182017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Corp former-CEO Anthony Earley Jr's 2016 compensation was $11.7 mln "
    },
    {
        "content": "* PG&E CREATES NEW CALIFORNIA EXTERNAL AFFAIRS ORGANIZATION AS PART OF BROADER REALIGNMENT OF THE COMPANY'S STRATEGY  POLICY AND OUTREACH EFFORTS",
        "date": "02162017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E CREATES NEW CALIFORNIA EXTERNAL AFFAIRS ORGANIZATION "
    },
    {
        "content": "* PG&E Corp files to say it may offer and sell shares of co's common stock of up to $275 million - SEC Filing  Source text: [http://bit.ly/2l3aKPX] Further company coverage:",
        "date": "02172017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Corp files to say it may offer and sell shares of co's common stock of up to $275 mln - SEC Filing "
    },
    {
        "content": "* PG&E Corp issues statement in reaction to a sentence handed down by U.S. District court in San Francisco in connection with its 2016 trial",
        "date": "01262017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Corp issues statement on 2016 trial sentence "
    },
    {
        "content": "* PG&E streamlining management  implementing efficiency measures to keep customer bills affordable while investing in the future",
        "date": "01112017",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Corp says will eliminate about 450 support services jobs from more than a dozen functional areas across Company "
    },
    {
        "content": "* Board of directors of PG&E Corporation today elected Geisha Williams as chief executive officer",
        "date": "11142016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E board appointed Geisha Williams as CEO "
    },
    {
        "content": "* PG&E Corporation releases third-quarter 2016 financial results",
        "date": "11042016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Corporation posts Q3 net income of $0.77/share "
    },
    {
        "content": "The Nuclear Regulatory Commission will discuss PG&E Corp's  failure to adequately maintain the emergency core cooling system at the 2 240-megawatt Diablo Canyon nuclear power plant in California on Nov. 15.",
        "date": "10282016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "NRC to discuss potential PG&E violation at Diablo Canyon nuclear plant "
    },
    {
        "content": "* PG&E Corporation board of directors elects Eric Mullins as a director",
        "date": "09212016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Corp's board elects Eric Mullins as a director "
    },
    {
        "content": "* Sets regular quarterly cash dividend of $0.49 per share  Source text for Eikon:  Further company coverage:",
        "date": "09212016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "normal",
        "symbol": "PCG",
        "title": "BRIEF-PG&E sets regular quarterly cash dividend of $0.49 per share "
    },
    {
        "content": "* Pg&E corporation announces pricing of public offering of common stock",
        "date": "08162016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-Pg&E prices public offering of common stock "
    },
    {
        "content": "* Expects to contribute all of net proceeds from offering to its regulated utility subsidiary  Pacific Gas and Electric Company  Source text for Eikon:  Further company coverage:",
        "date": "08152016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Corporation announces public offering of common stock "
    },
    {
        "content": "* PG&E appoints Kevin J. Dasso as vice president  electric asset management  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08032016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E appoints Kevin Dasso as vice president  electric asset management "
    },
    {
        "content": "* Maintaining its previously issued 2016 guidance for non-GAAP earnings from operations in range of $3.65 to $3.85 per share",
        "date": "07282016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Q2 earnings per share $0.41 "
    },
    {
        "content": "* PG&E says co  labor and environmental groups to continue ongoing discussions with select parties on Diablo Canyon joint proposal  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07262016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E  labor and environmental groups to continue talks on Diablo Canyon "
    },
    {
        "content": "July 8 Northern California power and gas company Pacific Gas & Electric (PG&E) said on Friday its McDonald Island gas storage facility in San Joaquin County remained out of service after the company detected small methane leaks from some of its wells in June.",
        "date": "07082016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "CORRECTED-PG&E California natgas storage facility shut due to small leaks "
    },
    {
        "content": "June 21 California's only functioning nuclear power plant will close by 2025 and be replaced by renewables  energy efficiency and storage under an agreement announced on Tuesday by its owner  PG&E Corp  labor unions and environmental groups.",
        "date": "06212016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "California's last operating nuclear power plant to close by 2025 "
    },
    {
        "content": "* Thomason was also appointed vice president  chief financial officer and controller of corporation's unit pacific gas and electric company",
        "date": "05242016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E names David Thomason as Vice President  Controller "
    },
    {
        "content": "* Raising its quarterly common stock dividend to 49 cents per share  an increase of 3.5 cents per share",
        "date": "05242016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "normal",
        "symbol": "PCG",
        "title": "BRIEF-PG&E raises qtrly common stock dividend to 49 cents per share "
    },
    {
        "content": "* Board of directors of PG&E Corporation adopted a new annual common stock cash dividend of $1.96 per share",
        "date": "05232016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E says board adopts new annual common stock cash dividend of $1.96/shr "
    },
    {
        "content": "* pg&e corp qtrly total operating revenues $3.97 billion versus $3.90 billion",
        "date": "05042016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-PG&E Q1 operating earnings per share $0.82 excluding items "
    },
    {
        "content": "* Opened an investigation into Nancy McFadden's failure to report dates and times of stock sales in pg&e",
        "date": "03252016",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "BRIEF-FPPC opens investigation into governor's top aide for failure to disclose timing of stock sales in PG&E "
    },
    {
        "content": "WARSAW  Sept 2 Poland's biggest power firm PGE  may consider selling its telecom business as part of a divestment plan designed to cope with rising CO2 emission costs and tough competition  Puls Biznesu quoted Chief Executive Marek Woszczyk as saying on Wednesday.",
        "date": "09022015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "Poland's PGE may sell telecoms unit-Puls Biznesu "
    },
    {
        "content": "WARSAW  Aug 31 Poland's biggest power producer PGE posted a net loss of 5.06 billion zlotys ($1.34 billion) in the first half of 2015 because of the 8.8 billion zlotys impairment charge it announced last week  the company said late on Monday.",
        "date": "08312015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "Poland's PGE confirms H1 net loss of $1.34 bln "
    },
    {
        "content": "WARSAW  July 22 Poland has persuaded at least three major companies to contribute to a bailout of troubled coal miner Kompania Weglowa  despite some executives' misgivings about the commercial logic of getting involved  sources with knowledge of the matter said.",
        "date": "07222015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "UPDATE 1-Poland persuades three blue-chip firms to help rescue coal sector: sources "
    },
    {
        "content": "WARSAW  July 22 Polish copper miner KGHM   utility PGE and chemicals firm Grupa Azoty  have offered to contribute to a state-run fund which will be used  in part  to bail out troubled coal miners  sources with knowledge of the matter said.",
        "date": "07222015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "normal",
        "symbol": "PCG",
        "title": "Poland's PGE  KGHM  Azoty to help in mine bailout:sources "
    },
    {
        "content": "WARSAW  July 6 The European Investment Bank (EIB) is in advanced talks to lend more than 2 billion zlotys ($526 million) to Poland's biggest power producer PGE  to help finance its investments  the head of the EIB's Warsaw office told Reuters.",
        "date": "07072015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "CORRECTED-EIB in talks to lend more than $500 mln to Polish power firm PGE "
    },
    {
        "content": "WARSAW  July 8 Poland's biggest power producer PGE could transfer its telecom arm Exatel to a special fund managed by state investment vehicle PIR to help it raise rescue funds for troubled miner Kompania Weglowa  Puls Biznesu daily said.",
        "date": "07082015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "Poland's PGE to offer telecom arm to KW miner rescue fund-Puls Biznesu "
    },
    {
        "content": "WARSAW  July 6 The European Investment Bank (EIB) is in advanced talks to lend more than 2 billion zlotys ($526 million) to Poland's biggest power producer PGE  to help finance its investments  the head of the EIB's Warsaw office told Reuters.",
        "date": "07062015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "EIB in talks to lend more than $500 mln to Polish power firm PGE "
    },
    {
        "content": "BIELSKO-BIALA  Poland  June 29 Poland plans to trim its stakes at state-controlled bank PKO BP  insurer PZU and power producer PGE by end-October to provide financing for the state investment vehicle Polskie Inwestycje  the treasury minister said.",
        "date": "06292015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "Poland to trim stakes in PKO  PZU and PGE by end-October - minister "
    },
    {
        "content": "WARSAW  May 12 Poland's biggest power producer PGE has extended the maintenance at its 858 megawatt (MW) lignite coal-fuelled unit at the Belchatow power plant for 20 hours until Tuesday midnight  data from the Polish power exchange showed.",
        "date": "05122015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "Poland's PGE extends outage at 858 MW Belchatow unit by 20 hours "
    },
    {
        "content": "April 15 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "04152015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "WARSAW  April 14 Plans to build Poland's first nuclear power plant will be delayed by at least another two years  sources said  after the decision late last year by state-run utility PGE to take on site research itself and cancel a consultancy contract.",
        "date": "04142015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "Poland's nuclear project pushed back at least another 2 years: sources "
    },
    {
        "content": "* Company cites numerous safety improvements since blast   (Adds PG&E still faces trial on criminal charges  more than $1 billion in penalties if convicted; adds civil settlements; utility's new safety measures)",
        "date": "04102015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "UPDATE 2-PG&E fined record $1.6 bln for deadly California pipeline blast "
    },
    {
        "content": "WARSAW  March 11 Poland will unveil details of its plan to consolidate the country's four biggest power firms - PGE  Tauron  Enea and Energa  - by mid 2015  the treasury minister supervising the industry told Reuters.",
        "date": "03112015",
        "name": "Pacific Gas & Electric Co",
        "news_type": "topStory",
        "symbol": "PCG",
        "title": "Poland to unveil power sector consolidation plan by mid-2015 -minister "
    }
]