[
    {
        "content": "* PepsiCo says on Nov 14  co's unit intends to redeem all 500 outstanding shares of 5.90% cumulative preferred stock  Series A at price of $100 721.11‍​",
        "date": "11142017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico unit intends to redeem all 500 outstanding shares of 5.90% cumulative preferred stock  Series A at $100 721.11‍​ "
    },
    {
        "content": "TOKYO Suntory Beverage & Food Ltd  said on Thursday it has agreed to set up in Thailand a soft drink joint venture with PepsiCo Inc  in March  as it looks to expand in the Southeast Asian country.",
        "date": "11022017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Suntory Beverage  PepsiCo to form Thai soft drinks JV "
    },
    {
        "content": "TORONTO  Nov 1 A jump in maple bond issuance this year is improving chances the instruments will be added to a key benchmark debt index  with more foreign companies expected to tap the Canadian dollar debt market as investor interest in diversifying holdings drives demand  some fund managers said.",
        "date": "11012017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Investor demand boosts Canada maple bond outlook  case for index inclusion "
    },
    {
        "content": "TOKYO  Nov 2 Suntory Beverage & Food Ltd said on Thursday it has agreed to set up in Thailand a soft drink joint venture with PepsiCo Inc in March  as it looks to expand in the Southeast Asian country.",
        "date": "11022017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-Suntory Beverage  PepsiCo to form Thai soft drinks JV "
    },
    {
        "content": "* unit to buy 51 percent of Thai beverage company from PepsiCo unit",
        "date": "11022017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-Suntory Beverage: To invest $290 mln in Thai JV with PepsiCo "
    },
    {
        "content": "TOKYO  Nov 2 Suntory Beverage & Food Ltd and PepsiCo Inc plan to set up a soft drink joint venture in Thailand next spring  a person with knowledge of the matter said  declining to be identified because the decision is not yet public.",
        "date": "11022017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Suntory Beverage  PepsiCo to form Thai soft drinks JV - source "
    },
    {
        "content": "Coca-Cola Co  topped profit and revenue estimates for the third quarter on a 3 percent rise in North American sales  gaining market share over arch rival PepsiCo Inc  as it sold more Sprite  teas and coffees.",
        "date": "10252017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Coke's North American sales rise fuels market share gains over Pepsi "
    },
    {
        "content": "MEXICO CITY  Oct 25 Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Wednesday its third-quarter net profit surged 39.2 percent from the year-earlier period  as sales increased.",
        "date": "10252017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 2-Mexico's Coca-Cola Femsa reports 39 pct jump in profit "
    },
    {
        "content": "* 3rd-qtr N.America sales propped up by Sprite  teas  coffees",
        "date": "10252017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 3-Coke's N.American sales rise fuels market share gains over Pepsi "
    },
    {
        "content": "SAN FRANCISCO Uber Technologies Inc [UBER.UL] said on Friday it hired a new chief legal officer to guide the company through its many legal quandaries  filling one of the crucial vacancies in its leadership.",
        "date": "10272017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Uber hires Pepsi's Tony West as new chief legal officer "
    },
    {
        "content": "SAN FRANCISCO  Oct 27 Uber Technologies Inc said on Friday it hired a new chief legal officer to guide the company through its many legal quandaries  filling one of the crucial vacancies in its leadership.",
        "date": "10272017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-Uber hires Pepsi's Tony West as new chief legal officer "
    },
    {
        "content": "* Pepsico names Dave Yawman executive vice president  government affairs  general counsel and corporate secretary",
        "date": "10272017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico names Dave Yawman senior executive "
    },
    {
        "content": "PARIS Danone  veteran Franck Riboud is stepping down as chairman  with Chief Executive Emmanuel Faber taking on both top roles in a move the French group said would ensure continuity in its strategy of focusing on the health-food sector.",
        "date": "10182017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Danone CEO assumes dual leadership role as chairman Riboud steps down "
    },
    {
        "content": "* Danone to maintain focus on 2020 targets -Faber (Adds Danone statement and quotes  detail and context)",
        "date": "10182017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 2-Danone CEO assumes dual leadership role as chairman Riboud steps down "
    },
    {
        "content": "* Sanjeev Chadha  CEO of PepsiCo's Asia  Middle East and North Africa division  is taking a short term medical leave from Pepsico​",
        "date": "10132017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-CEO of PepsiCo AMENA division on short term medical leave "
    },
    {
        "content": "* Pepsico Inc - Pepsico president Ramon Laguarta reports sale of 21 449 shares at average of $110.51/share on Oct 10‍​ Source text: (http://bit.ly/2z4iCow) Further company coverage:",
        "date": "10122017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico Inc president Ramon Laguarta reports sale of 21 449 shares "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 06 (Fitch) Fitch Ratings has assigned an 'A' rating to PepsiCo  Inc.'s $4 billion multi-tranche offering. The Rating Outlook is Stable. Proceeds will be used for general corporate purposes including the repayment of commercial paper. PepsiCo had approximately $3.8 billion of commercial paper at the end of the third quarter 2017. The notes will be issued by PepsiCo under the indenture dated May 21  2007 and will rank equ",
        "date": "10062017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Fitch Rates PepsiCo's $4B Notes Issuance 'A'; Outlook Stable "
    },
    {
        "content": "PepsiCo Inc  on Wednesday said weak demand for Gatorade and marketing missteps led to a drop in quarterly beverage sales in North America for the first time in two years  prompting it to trim its full-year organic revenue growth forecast.",
        "date": "10042017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo North American beverage sales take hit on weak Gatorade demand "
    },
    {
        "content": "* Shares recoup losses to trade up 0.6 pct (Adds analyst comment  updates share price)",
        "date": "10042017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 3-PepsiCo North American beverage sales take hit on weak Gatorade demand "
    },
    {
        "content": "* CEO on conf call- there was a marked slowdown in the c store channel in Q3",
        "date": "10042017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo CEO on conf call- There was a marked slowdown in convenience store channel in Q3 "
    },
    {
        "content": "* Pepsico Inc Q3 earnings per share view $1.43  revenue view $16.31 bln -- Thomson Reuters I/B/E/S",
        "date": "10042017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico reports Q3 core earnings per share of $1.48 "
    },
    {
        "content": "Oct 4 PepsiCo Inc reported a 7.6 percent rise in quarterly profit  helped by higher demand for its snacks sold under the Frito-Lay brand in North America as well as lower costs.",
        "date": "10042017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo reports 7.6 pct rise in quarterly profit "
    },
    {
        "content": "Where there is Pepsi  there is music  but showing the joy of Pepsi and how nothing else is a Pepsi might require the company that makes it to find its own way to help people catch that Pepsi spirit and make it the choice of a new generation.",
        "date": "09272017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo must face lawsuit claiming it stole Super Bowl ad "
    },
    {
        "content": "* PEPSICO SELECTS ESKER TO ENHANCE ITS ORDER PROCESSING AND BETTER SERVE ITS CUSTOMERS‍​ Source text: http://bit.ly/2waCae1 Further company coverage: (Gdynia Newsroom)",
        "date": "09142017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo selects Esker to enhance its order processing "
    },
    {
        "content": "NEW YORK  Aug 29 (Thomson Reuters Foundation) - Food and beverage companies face the risk of forced labor in countries where they obtain sugarcane but most fall short in efforts to tackle the problem that threatens millions of workers  according to a study released on Tuesday.",
        "date": "08292017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-Cereal  drinks companies often overlook risk of forced labor in sugarcane - study "
    },
    {
        "content": "PARIS Shares in French food group Danone  rose on Monday after the New York Post newspaper said in a report over the weekend that Danone could be a takeover target. (http://nyp.st/2vxjSjj) | Video ",
        "date": "08142017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "French food group Danone's shares rise after bid speculation report "
    },
    {
        "content": "* Says Washington redskins & co announce long-term partnership making co official & exclusive non-alcoholic beverage  snack provider for team  FedExField",
        "date": "07252017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo announces long-term partnership with Washington Redskins "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 21 (Fitch) Fitch Ratings has affirmed the Issuer Default Ratings (IDRs) and the debt ratings of PepsiCo  Inc. (PepsiCo) at 'A/F1'. A full list of rating actions follows at the end of the press release. The Rating Outlook is Stable. PepsiCo's ratings reflect its considerable financial flexibility  substantial cash flow  significant scale  geographic reach  product diversification provided by its high-margin Frito-Lay North ",
        "date": "07212017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Fitch Affirms PepsiCo's IDRs at 'A/F1'; Outlook Stable "
    },
    {
        "content": "* PepsiCo Inc - on July 14  Ramon Laguarta  was appointed president of PepsiCo - SEC filing‍​ Source text: (http://bit.ly/2uCKIsx) Further company coverage:",
        "date": "07202017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo appoints Ramon Laguarta president "
    },
    {
        "content": "* Increases quarterly dividend by 7 percent to $0.805 per share Source text for Eikon: Further company coverage:",
        "date": "07142017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico increases quarterly dividend by 7 pct "
    },
    {
        "content": "PepsiCo Inc's  second-quarter profit topped estimates  as the company sold more higher-margin healthier foods such as baked chips and raised prices on its drinks in North America. | Video ",
        "date": "07122017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Higher prices  healthier snacks drive PepsiCo profit beat "
    },
    {
        "content": "* CEO on conf call- have seen a lower rate of year-to-date growth in the c store channel compared to last year",
        "date": "07112017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo CFO- Expect to see operating margin improvement strengthen in back half of year "
    },
    {
        "content": "* Adj. profit of $1.44/shr vs. est. $1.40/shr (Adds details and background  updates shares)",
        "date": "07112017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 4-Higher prices  healthier snacks drive PepsiCo profit beat "
    },
    {
        "content": "July 11 PepsiCo Inc's quarterly profit beat estimates as higher pricing of sodas and snack foods in North America paid off and as the company sold its minority stake in British bottler Britvic Plc.",
        "date": "07112017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "CORRECTED-UPDATE 2-PepsiCo's quarterly profit beats on higher pricing "
    },
    {
        "content": "July 11 PepsiCo Inc's second-quarter profit rose 5 pct  helped by higher sales in its Frito-Lay North America business and    the sale of its minority stake in British bottler Britvic Plc.",
        "date": "07112017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo's quarterly profit rises 5 pct "
    },
    {
        "content": "* Pepsico entered into a new $3.75 billion five-year unsecured revolving credit agreement‍​ - SEC filing",
        "date": "06062017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico enters into a new $3.75 bln 5 year unsecured revolving credit agreement‍​ "
    },
    {
        "content": "Soft drink maker PepsiCo Inc  is in talks to acquire All Market Inc  the owner of coconut water brand Vita Coco  whose celebrity investors include Madonna and Matthew McConaughey  people familiar with the matter said on Friday.",
        "date": "05262017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo in bid to acquire Vita Coco owner: sources "
    },
    {
        "content": "May 26 Soft drink maker PepsiCo Inc is in talks to acquire All Market Inc  the owner of coconut water brand Vita Coco  whose celebrity investors include Madonna and Matthew McConaughey  people familiar with the matter said on Friday.",
        "date": "05262017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo in bid to acquire Vita Coco owner - sources "
    },
    {
        "content": "* Pepsico joins new plastics economy initiative as core partner",
        "date": "05182017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico joins new plastics economy initiative as core partner "
    },
    {
        "content": "* Says has set up a new unit for manufacturing of Pepsi range of products at Uttar Pradesh  commercial production has started Source text: (http://bit.ly/2qIfESj) Further company coverage:",
        "date": "05042017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Varun Beverages sets up unit in Uttar Pradesh for manufacturing Pepsi products "
    },
    {
        "content": "* Pepsico Inc - Quarterly dividend of $0.8050 per share of pepsico common stock  a 7.0 percent increase versus comparable year-earlier period. Source text for Eikon: Further company coverage:",
        "date": "05022017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico declares quarterly dividend "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 28 (Fitch) Fitch Ratings has assigned an 'A' rating to PepsiCo  Inc.'s (PepsiCo) $3 billion multi-tranche offering. The Rating Outlook is Stable. Proceeds will be used for general corporate purposes including the repayment of commercial paper. PepsiCo had approximately $4.5 billion of commercial paper at the end of the first quarter 2017. The notes will be issued by PepsiCo under the indenture dated May 21  2007 and will ",
        "date": "04282017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Fitch Rates PepsiCo's $3B Notes Issuance 'A'; Outlook Stable "
    },
    {
        "content": "CAIRO  April 27 In green fields near Egypt's Mediterranean coast  PepsiCo is harvesting its first crop of potatoes produced from local seeds to make a leading brand of chips.",
        "date": "04282017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "RPT-Manufacturers in Egypt turn to local sourcing as prices soar "
    },
    {
        "content": "CAIRO  April 27 In green fields near Egypt's Mediterranean coast  PepsiCo is harvesting its first crop of potatoes produced from local seeds to make a leading brand of chips.",
        "date": "04272017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Manufacturers in Egypt turn to local sourcing as prices soar "
    },
    {
        "content": "* Papa John's International and Pepsico extend and expand global beverage partnership",
        "date": "04272017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-Papa John's International  Pepsico extend and expand beverage partnership "
    },
    {
        "content": "* Pepsico Inc files for potential senior notes offering  size undisclosed - sec filing Source text (http://bit.ly/2q9Rz7K) Further company coverage:",
        "date": "04272017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico files for potential senior notes offering  size undisclosed "
    },
    {
        "content": "PepsiCo Inc's quarterly revenue and profit beat estimates on demand for its healthier drinks and snacks and higher pricing in North America  but a contraction in the company's gross margins weighed on shares. | Video ",
        "date": "04262017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo profit beats but lower margins weigh on shares "
    },
    {
        "content": "* Shares fall as much as 2.3 pct (Adds comments from conf call; updates shares)",
        "date": "04262017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 3-PepsiCo profit beats but lower margins weigh on shares "
    },
    {
        "content": "* CEO on conf call- the delay of u.s. Income tax refunds dampened Q1 consumer spending across virtually every consumer category",
        "date": "04262017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo CEO on conf call- Delay of U.S. income tax refunds dampened Q1 consumer spending "
    },
    {
        "content": "* Q1 earnings per share view $0.92  revenue view $11.98 billion -- Thomson Reuters I/B/E/S",
        "date": "04262017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo reports Q1 earnings per share $0.91 "
    },
    {
        "content": "April 26 PepsiCo Inc reported a 41.6 percent jump in quarterly profit  helped by higher demand for its healthier drinks and snacks and as the company kept a tight leash on costs.",
        "date": "04262017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo's quarterly profit surges 41.6 pct "
    },
    {
        "content": "PepsiCo pulled a commercial featuring model Kendall Jenner on Wednesday after the ad prompted outrage and ridicule from those who said it trivialized rights protests and public unrest in the United States.",
        "date": "04062017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Pepsi pulls Kendall Jenner ad after social media backlash "
    },
    {
        "content": "* Pepsico Inc releases statement regarding ad featuring Kendall Jenner",
        "date": "04052017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico releases statement regarding ad featuring Kendall Jenner "
    },
    {
        "content": "WASHINGTON  March 24 (Thomson Reuters Foundation) - C oca-Cola and PepsiCo's efforts to stop illegal land seizures by sugar suppliers in Brazil have made progress but Coke has had the greater impact and its competitor needs to do more  a World Bank conference heard this week.",
        "date": "03242017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Coke and Pepsi get mixed reviews in bid to clean up Brazil sugar supplies "
    },
    {
        "content": "* CFO Hugh Johnston's FY 2016 total compensation $10.3 million versus $8.56 million in FY 2015 - SEC filing",
        "date": "03172017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico CEO Indra Nooyi 2016 total compensation was $29.8 mln vs $26.4 mln in 2015 - SEC filing "
    },
    {
        "content": "SAO PAULO PepsiCo Inc  has bid to acquire Brazilian dairy company Fábrica de Produtos Alimentícios Vigor SA  according to reports published in two Brazilian newspapers on Wednesday.",
        "date": "03082017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo bidding for Brazilian dairy company Vigor: newspapers "
    },
    {
        "content": "SAO PAULO  March 8 PepsiCo Inc has bid to acquire Brazilian dairy company Fábrica de Produtos Alimentícios Vigor SA  according to reports published in two Brazilian newspapers on Wednesday.",
        "date": "03082017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-PepsiCo bidding for Brazilian dairy company Vigor -newspapers "
    },
    {
        "content": "SAO PAULO  March 8 PepsiCo Inc has bid to acquire Brazilian dairy company Fábrica de Produtos Alimentícios Vigor SA  according to reports published in two Brazilian newspapers on Wednesday.",
        "date": "03082017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo bidding for Brazilian dairy company Vigor -newspapers "
    },
    {
        "content": "March 1 PepsiCo Inc said on Wednesday it would cut 80 to 100 jobs in Philadelphia as the city's new sugar-sweetened beverage tax hurts demand for its products.",
        "date": "03012017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo to cut jobs in Philly as sales lose fizz after soda tax "
    },
    {
        "content": "* Intend to eliminate 80-100 positions  including frontline and supervisory roles  in Philadelphia over the next few months  Further company coverage:",
        "date": "03012017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo to eliminate 80-100 positions in Philadelphia over next few months "
    },
    {
        "content": "LONDON Food and drink firm PepsiCo plans to shut a Walkers crisp factory in northern England  the company said on Wednesday  putting almost 400 jobs at risk.",
        "date": "03012017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo to close British plant  threatening nearly 400 jobs "
    },
    {
        "content": "* At CAGNY conf- will have to go more aggressively on low calorie beverages than we are going now",
        "date": "02222017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo at CAGNY conf- Will have to go more aggressively on low calorie beverages than we are going now "
    },
    {
        "content": "* Files for potential mixed shelf  size not disclosed - SEC filing  Source text: http://bit.ly/2lRSYNe Further company coverage:",
        "date": "02152017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo files for potential mixed shelf  size not disclosed "
    },
    {
        "content": "Procter & Gamble Co   maker of Tide detergent and Gillette razors  will face ever greater pressure to slice costs and slow-growing divisions now that activist investor Trian Partners is a major shareholder.",
        "date": "02152017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Trian's P&G stake raises investor hopes of break-up  cost cuts "
    },
    {
        "content": "Feb 15 Procter & Gamble Co  maker of Tide detergent and Gillette razors  will face ever greater pressure to slice costs and slow-growing divisions now that activist investor Trian Partners is a major shareholder.",
        "date": "02152017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 2-Trian's P&G stake raises investor hopes of break-up  cost cuts "
    },
    {
        "content": "PepsiCo Inc forecast 2017 adjusted earnings below analysts' estimates  citing weakness in its international markets  particularly in developing regions such as Asia  Middle East and North Africa.",
        "date": "02152017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Pepsi blames global macro concerns for weak outlook; shares fall "
    },
    {
        "content": "* Shares fall 2 pct   (Adds conference call details  analyst comment; updates share)",
        "date": "02152017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 2-Pepsi blames global macro concerns for weak outlook; shares fall "
    },
    {
        "content": "* PepsiCo Inc CEO- demonetization had a significant impact on our India Q4 results  still has a lingering effect",
        "date": "02152017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo CFO - 3 pct revenue guidance for 2017 reflects a cautious outlook "
    },
    {
        "content": "* Q4 GAAP earnings per share $0.97; Q4 core earnings per share $1.20; Q4 revenue $19.52 billion  up 5 percent",
        "date": "02152017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo reports Q4 core eps of $1.20 "
    },
    {
        "content": "Feb 15 PepsiCo Inc reported a 5 percent rise in quarterly revenue on Wednesday  as the company benefited from higher demand for its healthier beverages and snacks in North America.",
        "date": "02152017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo revenue rises 5 pct on demand for healthy drinks  snacks "
    },
    {
        "content": "* Pepsico Inc says declared a quarterly dividend of $0.7525 per share of pepsico common stock  Source text for Eikon:  Further company coverage:",
        "date": "02022017",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico Inc declared quarterly dividend of $0.7525 per share of Pepsico common stock "
    },
    {
        "content": "Jan 24 PepsiCo said on Tuesday it will use its pricey spot during next month's Super Bowl to unveil a premium bottled water brand  Lifewtr  as the beverage industry faces declining consumption of sugary sodas.",
        "date": "01242017",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo using Super Bowl to launch new premium water brand "
    },
    {
        "content": "WASHINGTON Elon Musk  the chairman and chief executive of SpaceX and Tesla as well as Uber Technologies CEO and co-founder Travis Kalanick and PepsiCo Chairman and CEO Indra Nooyi have joined U.S. President-elect Donald Trump's advisory council  Trump's transition team said on Wednesday.",
        "date": "12142016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Uber  SpaceX/Tesla  and PepsiCo execs join Trump business council "
    },
    {
        "content": "Dr Pepper Snapple Group Inc  and PepsiCo  on Tuesday both announced plans to buy alternative drinks makers  the latest examples of beverage companies branching into products perceived as healthier as soda sales decline.",
        "date": "11222016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Dr Pepper Snapple  Pepsi buy drinks makers in bid to diversify "
    },
    {
        "content": "Nov 22 Dr Pepper Snapple Group Inc and PepsiCo on Tuesday both announced plans to buy alternative drinks makers  the latest examples of beverage companies branching into products perceived as healthier as soda sales decline.",
        "date": "11222016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "WRAPUP 1-Dr Pepper Snapple  Pepsi buy drinks makers in bid to diversify "
    },
    {
        "content": "Nov 22 PepsiCo Inc said on Tuesday it would buy health beverage maker KeVita Inc  in an effort to diversify its soft drinks business and tap health conscious consumers.",
        "date": "11222016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo to buy probiotic drinks maker KeVita "
    },
    {
        "content": "* Kevita will continue to operate independently with its production and bottling facilities located in Oxnard  California",
        "date": "11222016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico announces definitive agreement to acquire Kevita "
    },
    {
        "content": "* Declared a quarterly dividend of $0.7525 per share of pepsico common stock",
        "date": "11172016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico declares quarterly dividend of $0.7525 per share "
    },
    {
        "content": "LONDON  Oct 17 PepsiCo Inc has set a target for reducing the amount of sugar in its soft drinks around the world as part of a suite of goals aimed at tackling problems ranging from obesity to climate change.",
        "date": "10172016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo sets global target for sugar reduction "
    },
    {
        "content": "* On october 6  2016  pepsico  inc. And bottling group  llc called for redemption all outstanding securities of some notes series  Source text - http://bit.ly/2dOl4G2 Further company coverage:",
        "date": "10062016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico says called for redemption of outstanding securities of some notes "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 04 (Fitch) Fitch Ratings has assigned an 'A' rating to PepsiCo   Inc.'s (PepsiCo) $4.5 billion multi-tranche offering. The Rating Outlook is  Stable. Proceeds will be used for general corporate purposes including the  potential redemption of all or a portion of the 7.90% $1.5 billion senior notes  due Nov. 1  2018 issued by PepsiCo and the 5.125% $750 million senior notes due  Jan. 15  2019 issued by Bottling Group  LLC",
        "date": "10042016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Fitch Rates PepsiCo's $4.5 billion Notes Issuance 'A'; Outlook Stable "
    },
    {
        "content": "* Files for 1-part dollar-denominated senior notes offering  Source text: [http://bit.ly/2dkWXmM] Further company coverage:",
        "date": "10032016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico files for 1-part dollar-denominated senior notes offering "
    },
    {
        "content": "* Has amended its sweet taste program collaboration agreement with PepsiCo Inc for three additional years  through September 2019  Source text for Eikon:  Further company coverage:",
        "date": "09302016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Senomyx to amend its sweet taste program collaboration agreement with PepsiCo Inc "
    },
    {
        "content": "PepsiCo Inc  reported better-than-expected quarterly net revenue and profit on Thursday  helped by higher demand in North America for its lineup of beverages and snacks with fewer calories and more natural ingredients.",
        "date": "09292016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo sales helped by demand for healthier snacks and drinks "
    },
    {
        "content": "* Full-year adj. profit forecast raised to $4.78/shr from $4.71",
        "date": "09292016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 3-PepsiCo sales helped by demand for healthier snacks and drinks "
    },
    {
        "content": "* CEO - compared to 2006  have reduced average sodium in our food products by 11% per serving and removed more than 2 300 metric tons of sodium from key food brands in key countries",
        "date": "09292016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo CEO -  45 pct of net revenue from \"guilt free\" products "
    },
    {
        "content": "* Q3 GAAP earnings per share $1.37; Q3 core earnings per share $1.40; Q3 net revenue $16.03 billion  down 2 percent",
        "date": "09292016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico posts Q3 GAAP earnings per share of $1.37 "
    },
    {
        "content": "Sept 29 PepsiCo Inc reported better-than-expected quarterly net revenue  helped by higher demand for beverages and Frito-Lay snacks in North America.",
        "date": "09292016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo sales beat estimates on higher demand for snacks  drinks "
    },
    {
        "content": "* In advance of Barclays back-to-school consumer conference in boston  PepsiCo reaffirmed its full-year fiscal 2016 guidance  Source text for Eikon:  Further company coverage:",
        "date": "09062016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo reaffirms  full-year fiscal 2016 guidance "
    },
    {
        "content": "* Will secure featured placement in #stickers library in ten countries across five continents",
        "date": "08152016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo announced as Twitter launch partner for promoted #stickers "
    },
    {
        "content": "* Entered letter agreement with pepsico  inc. To extend research period under collaborative research and development license agreement dated aug 16  2010",
        "date": "07282016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Senomyx enters letter agreement with Pepsico Inc to extend research period "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 13 (Fitch) Fitch Ratings has assigned an 'A' rating to PepsiCo   Inc.'s (PepsiCo) EUR750 million 12-year notes offering. The Rating Outlook is  Stable.  Net proceeds from the offering will be used for general corporate purposes   including the repayment of commercial paper (CP). PepsiCo had approximately  $35.6 billion of total debt including $3.6 billion of CP at the end of the  second quarter 2016. The notes will be issu",
        "date": "07132016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Fitch Rates PepsiCo's EUR750MM Sr. Notes Issuance 'A'; Outlook Stable "
    },
    {
        "content": "NEW YORK  July 8 Flat beverages are helping overall sales at Coca-Cola Co and PepsiCo Inc  stay fizzy in Mexico despite a tax on sodas.",
        "date": "07082016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "RPT-PepsiCo  Coca-Cola still sparkle in Mexico after fizzy drinks tax "
    },
    {
        "content": "NEW YORK  July 8 Flat beverages are helping overall sales at Coca-Cola Co and PepsiCo Inc  stay fizzy in Mexico despite a tax on sodas.",
        "date": "07082016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo  Coca-Cola still sparkle in Mexico after fizzy drinks tax "
    },
    {
        "content": "PepsiCo Inc  reported a better-than-expected profit for the second quarter on Thursday  buoyed by lower raw material costs and higher demand for Frito-Lay snacks and new beverages in North America  lifting shares to a record in early trading. | Video ",
        "date": "07072016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo profit beats expectations on North American demand; stock rises "
    },
    {
        "content": "July 7 PepsiCo Inc reported a better-than-expected profit for the second quarter on Thursday  buoyed by lower raw material costs and higher demand for Frito-Lay snacks and new beverages in North America  lifting shares to a record in early trading.",
        "date": "07072016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 3-PepsiCo profit beats expectations on North American demand; stock rises "
    },
    {
        "content": "July 7 PepsiCo Inc reported slightly better-than-expected quarterly revenue  helped by strong demand for Frito-Lay snacks and new beverages in North America.",
        "date": "07072016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "New products help PepsiCo inch past revenue estimates "
    },
    {
        "content": "The company is officially bringing back Crystal Pepsi  a clear cola drink that was hugely popular for a brief period during the early 1990s.",
        "date": "06292016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Crystal Pepsi: the 'clear' 90s hit makes a return "
    },
    {
        "content": "June 27 PepsiCo Inc plans to bring back aspartame  an artificial sweetener it removed from Diet Pepsi in the United States last year  in a bid to revive falling cola sales.",
        "date": "06272016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo to bring back aspartame in Diet Pepsi "
    },
    {
        "content": "* Cola co - now expects items to be a 5 to 6 point headwind on net revenues and a 4 to 5 point headwind on income before taxes in q2",
        "date": "06162016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Coca-Cola now expects items to be a 5-6 point headwind on net revenues "
    },
    {
        "content": "PepsiCo Inc's 2016 Super Bowl commercial  which begins with an old-school jukebox spinning a record from the 1960s  was both colorful and catchy  but according to a new lawsuit  it was also swiped from a Connecticut advertising agency without payment or credit.",
        "date": "06072016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo accused of stealing concept for Super Bowl ad "
    },
    {
        "content": "LOS ANGELES  June 2 Anheuser-Busch and Starbucks announced a deal on Thursday to produce  bottle  distribute and market Teavana ready-to-drink teas in the United States  with products expected to be available in the first half of next year.",
        "date": "06022016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "UPDATE 1-Starbucks  Anheuser-Busch to partner on bottled Teavana teas "
    },
    {
        "content": "June 2 Former PepsiCo Inc Chief Executive Officer Roger Enrico  a noted marketer who pioneered using celebrities including pop star Michael Jackson to help sell soda  died at the age of 71  Pepsi said on Thursday.",
        "date": "06022016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Former PepsiCo CEO Roger Enrico dies at age 71 "
    },
    {
        "content": "* Recommended to tribunal that Anheuser-Busch InBev-SABMiller deal be approved with conditions",
        "date": "05312016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-S.Africa's Competition Commission recommends conditional approval of ABInBev-SabMiller deal "
    },
    {
        "content": "LOS ANGELES  June 2 Anheuser-Busch and Starbucks on Thursday announced a deal to produce  bottle  distribute and market Teavana ready-to-drink teas in the United States  with products expected to be available in the first half of next year.",
        "date": "06022016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Starbucks  Anheuser-Busch to partner on bottled Teavana teas "
    },
    {
        "content": "The Quaker Oats Company  a unit of PepsiCo Inc  on Monday announced a voluntary U.S. recall of a small quantity of its Quaker Quinoa Granola Bars due to the possible risk of Listeria contamination.",
        "date": "05162016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Quaker recalls quinoa bars due to Listeria worry "
    },
    {
        "content": "May 16 The Quaker Oats Company  a unit of PepsiCo Inc  on Monday announced a voluntary U.S. recall of a small quantity of its Quaker Quinoa Granola Bars due to the possible risk of Listeria contamination.",
        "date": "05162016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-Quaker recalls quinoa bars due to Listeria worry "
    },
    {
        "content": "NEW YORK Trian Fund Management sold its position in PepsiCo Inc  a regulatory filing said on Friday  ending a profitable if sometimes strained relationship between the activist hedge fund and the parent of Pepsi  Frito-Lay and Tropicana.",
        "date": "05132016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Trian exits stake in PepsiCo Inc: filing "
    },
    {
        "content": "New York  May 13 Ray Dalio's Bridgewater Associates hedge fund firm sold off its stakes in Amazon.com Inc   Coca-Cola Inc  and Gap Inc during the first quarter and added new stakes in Alphabet Inc and McDonald's Corp  according to the latest regulatory filings.",
        "date": "05132016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Dalio's Bridgewater Associates dumps Amazon.com  Coca-Cola -filing "
    },
    {
        "content": "NEW YORK  May 13 Trian Fund Management sold its position in PepsiCo Inc  a regulatory filing said on Friday  ending a profitable if sometimes strained relationship between the activist hedge fund and the parent of Pepsi  Frito-Lay and Tropicana.",
        "date": "05132016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-Trian exits stake in PepsiCo Inc - filing "
    },
    {
        "content": "NEW YORK  May 13 Trian Fund Management LP  the activist hedge fund  has sold out of its position in PepsiCo Inc.  according to a regulatory filing on Friday.",
        "date": "05132016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Trian exits stake in PepsiCo Inc. -filing "
    },
    {
        "content": "* Trian Fund Management dissolves share stake in PepsiCo - SEC Filing  Source text for quarter ended March 31 - http://1.usa.gov/1TSZ37R Source text for quarter ended Dec 31 - http://1.usa.gov/1Xpoa5r",
        "date": "05132016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-Trian Fund Management dissolves share stake in PepsiCo "
    },
    {
        "content": "* Shareholder proposal regarding establishment of board committee on sustainability was defeated at annual meeting of shareholders",
        "date": "05092016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico announces results of annual meeting of shareholders "
    },
    {
        "content": "* Today declared a quarterly dividend of $0.7525 per share of Pepsico common stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05032016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico declares qtrly dividend of $0.7525/shr "
    },
    {
        "content": "NEW YORK  April 25 (Thomson Reuters Foundation) - E nvironmental activists attempted to shame multinational PepsiCo on Monday by draping its iconic New York City billboard with a banner in protest at its use of palm oil.",
        "date": "04262016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "UPDATE 1-Activists unfurl banner on iconic NYC Pepsi sign in palm oil protest "
    },
    {
        "content": "NEW YORK  April 25 (Thomson Reuters Foundation) - E nvironmental activists attempted to shame multinational PepsiCo on Monday by draping its iconic New York City billboard with a banner in protest at its use of palm oil.",
        "date": "04252016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Activists unfurl banner on iconic NYC Pepsi sign in palm oil protest "
    },
    {
        "content": "* S&P On Pepsico Inc - Pepsico inc. Outlook revised to positive on improved operating margins; 'A' rating affirmed",
        "date": "04212016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-S&P - Pepsico inc. Outlook revised to positive on improved operating margins; 'A' rating affirmed "
    },
    {
        "content": "* Q1 earnings per share view $0.44 -- Thomson Reuters I/B/E/S",
        "date": "04202016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Coca-Cola reports Q1 earnings per share of $0.34 "
    },
    {
        "content": "PepsiCo Inc  reported a better-than-expected quarterly profit as it trimmed costs and demand rose in North America for its snacks  which include Cheetos and Lay's chips.",
        "date": "04182016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo benefits from cost cuts  strong North America snack sales "
    },
    {
        "content": "* Cola co -refranchising north american bottling operations  with expanded territories for 3 bottlers and addition of a new  independent bottler",
        "date": "04202016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-Coca-Cola says refranchising North American bottling operations  with expanded territories for 3 bottlers and addition of a new  independent bottler "
    },
    {
        "content": "* Cost of sales fall 6.4 pct   (Adds details from conference call  graphic link; updates shares)",
        "date": "04182016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 3-PepsiCo benefits from cost cuts  strong N America snack sales "
    },
    {
        "content": "* Q1 earnings per share $0.64  Q1 core earnings per share $0.89; Q1 net revenue $11.86 billion versus $12.22 billion last year",
        "date": "04182016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "BRIEF-PepsiCo reports 1st-qtr core earnings of $0.89/shr "
    },
    {
        "content": "April 18 PepsiCo Inc's quarterly sales fell 2.9 percent  the sixth straight quarter of decline  hurt by a strong dollar and weak revenue in some markets including Latin America and Europe.",
        "date": "04182016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo quarterly sales fall 3 pct "
    },
    {
        "content": "March 30 PepsiCo Inc said Al Carey  the head of its North America beverages business  has been appointed chief executive of the region and will oversee the company's beverages  Frito-Lay and Quaker Foods divisions there.",
        "date": "03302016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Pepsi reshuffles North America top management "
    },
    {
        "content": "March 30 PepsiCo Inc promoted the head of its North America beverages business to chief executive for the region and said the head of its Frito-Lay snacks business there was leaving the company.",
        "date": "03302016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-Pepsi reshuffles North America top management "
    },
    {
        "content": "* Says CEO Indra Nooyi's FY 2015 total compensation $26.4 million versus $22.5 million in FY 2014 - SEC filing",
        "date": "03182016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pepsico announces 2015 CEO  CFO total compensation "
    },
    {
        "content": "* Announces the acquisition of PepsiCo bottling facility in Germany",
        "date": "02242016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Refresco Gerber announces the acquisition of PepsiCo bottling facility in Germany "
    },
    {
        "content": "PepsiCo Inc  reported better-than-expected quarterly net revenue on Thursday as higher sales of snacks and non-fizzy beverages such as Gatorade in North America helped reduce the impact of a strong dollar.",
        "date": "02112016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo revenue beats estimates as sales rise in North America "
    },
    {
        "content": "Feb 5 Greek-yogurt maker Chobani LLC  founded by billionaire Hamdi Ulukaya  said on Friday it had rejected offers from beverage giant PepsiCo Inc and other investors.",
        "date": "02062016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Yogurt maker Chobani rejects PepsiCo's offer for stake in company "
    },
    {
        "content": "Feb 11 PepsiCo Inc reported better-than-expected quarterly net revenue on Thursday as higher sales of snacks and non-fizzy beverages such as Gatorade in North America helped reduce the impact of a strong dollar.",
        "date": "02112016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 4-PepsiCo revenue beats estimates as sales rise in North America "
    },
    {
        "content": "Feb 11 PepsiCo Inc reported better-than-expected quarterly net revenue  as higher sales of snacks and beverages in North America helped reduce the impact of a strong dollar.",
        "date": "02112016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "CORRECTED-UPDATE 1-PepsiCo revenue beats estimates as N America sales rise "
    },
    {
        "content": "Feb 11 PepsiCo Inc reported better-than-expected quarterly net revenue  as higher sales of snacks and beverages in North America helped reduce the impact of a strong dollar.",
        "date": "02112016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo's quarterly revenue beats estimates "
    },
    {
        "content": "KIEV Ukrainian prosecutors have launched a criminal investigation into the online publication by U.S. drinks companies Coca-Cola and Pepsico of a map that showed Crimea as a part of Russia  a Ukrainian lawmaker said on Thursday.",
        "date": "01212016",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Ukraine investigates Coca-Cola and Pepsico over Crimea map row: MP "
    },
    {
        "content": "KIEV  Jan 21 Ukrainian prosecutors have launched a criminal investigation into the online publication by U.S. drinks companies Coca-Cola and Pepsico of a map that showed Crimea as a part of Russia  a Ukrainian lawmaker said on Thursday.",
        "date": "01212016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Ukraine investigates Coca-Cola and Pepsico over Crimea map row -MP "
    },
    {
        "content": "BOSTON  Jan 19 A slew of major  U.S. corporations are likely to announce in the next few weeks whether they will take big writedowns for their troubled Venezuela operations  and some may say they are leaving the country altogether.",
        "date": "01192016",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "INSIGHT-U.S. companies likely to take further big hits from Venezuela economic turmoil "
    },
    {
        "content": "CARACAS  Dec 19 Several employees of Pepsi-Cola Venezuela have been detained in an \"arbitrary\" manner after halting operations at one plant for lack of raw materials  according to food company Empresas Polar  which owns the local Pepsi operation.",
        "date": "12202015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Venezuela food company Polar slams detention of local Pepsi workers "
    },
    {
        "content": "Dec 10 PepsiCo Inc and German dairy company Theo Muller Group said on Thursday they had stopped production at their Batavia yogurt plant in upstate New York  without providing a reason.",
        "date": "12112015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Pepsi  Theo Muller stop production at Batavia yogurt plant "
    },
    {
        "content": "* Coca-Cola to cash out 17.4 percent stake   (Adds details on JAB coffee strategy  management  market share vs Nestle)",
        "date": "12072015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 6-JAB-led investor group to buy K-Cup maker Keurig for $13.9 bln "
    },
    {
        "content": "* Increased group turnover by 6 pct (7 pct excluding Pepsi and biscuits)",
        "date": "10292015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Pioneer Food sees FY HEPS to rise between 13.8 pct and 17.8 pct "
    },
    {
        "content": " ((story corrects paragraph 5 to say PepsiCo would present  not release a smartphone on Oct. 20))",
        "date": "10152015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo says to market mobile phones  accessories in China "
    },
    {
        "content": "Oct 12 PepsiCo Inc said on Monday it is working with a licensing partner to market a line of mobile phones and accessories in China in the next few months.",
        "date": "10152015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "CORRECTED-UPDATE 1-PepsiCo says to market mobile phones  accessories in China "
    },
    {
        "content": "Coca-Cola Co  has ended talks to invest in Chobani LLC after deciding that the maker of Greek yogurt was not the best fit for its portfolio  people familiar with the matter said on Wednesday.",
        "date": "10142015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Coca-Cola drops pursuit of Chobani: sources "
    },
    {
        "content": "PepsiCo Inc  and Coca-Cola Co  are in talks to invest in Chobani LLC  in a deal that the Greek yogurt maker hopes could value it at as much $3 billion  including debt  according to people familiar with the matter.",
        "date": "10122015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Exclusive: Pepsi  Coca-Cola competing for investment in Chobani "
    },
    {
        "content": "PepsiCo Inc said on Monday it is working with a licensing partner to market a line of mobile phones and accessories in China in the next few months.",
        "date": "10122015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo says to market mobile phones  accessories in China "
    },
    {
        "content": "Oct 12 PepsiCo Inc said on Monday it is working with a licensing partner to market a line of mobile phones and accessories in China in the next few months.",
        "date": "10122015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-PepsiCo says to market mobile phones  accessories in China "
    },
    {
        "content": "PepsiCo Inc on Tuesday reported a better-than-expected quarterly profit as its commodity costs fell and demand for its snacks and non-carbonated beverages rose in North America.",
        "date": "10062015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo profit beats as costs fall  North America sales rise "
    },
    {
        "content": "* North America non-carbonated beverage sales volumes up 10 percent",
        "date": "10062015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 3-PepsiCo profit beats as costs fall  N.America sales rise "
    },
    {
        "content": "* Raises 2015 adjusted profit growth forecast   (Adds details  background; updates shares)",
        "date": "10062015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 2-PepsiCo profit beats as costs fall  N America sales rise "
    },
    {
        "content": "Oct 6 PepsiCo Inc reported better-than-expected quarterly net revenue  helped by higher sales of snacks and beverages in North America.",
        "date": "10062015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo revenue beats estimates as North America sales rise "
    },
    {
        "content": "PepsiCo Inc  said it would offer caps filled with Pepsi and Sierra Mist drink mixes for at-home soda machines made by SodaStream International Ltd  on more platforms as it tests the homemade beverages market for its products.",
        "date": "09112015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo expands availability of soda caps for SodaStream machines "
    },
    {
        "content": "Sept 11 PepsiCo Inc said it would offer caps filled with Pepsi and Sierra Mist drink mixes for at-home soda machines made by SodaStream International Ltd on more platforms as it tests the homemade beverages market for its products.",
        "date": "09112015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-PepsiCo expands availability of soda caps for SodaStream machines "
    },
    {
        "content": "Sept 11 PepsiCo Inc said it will expand its partnership with at-home soda machine maker SodaStream International Ltd to offer caps filled with Pepsi and Sierra Mist to flavor water carbonated by SodaStream machines.",
        "date": "09112015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo deepens ties with SodaStream for homemade products "
    },
    {
        "content": "* Starbucks Corp  PepsiCo enter into agreement for marketing  sale  distribution of Starbucks Ready-To-Drink coffee  energy beverages in Latin America",
        "date": "07232015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Starbucks  PepsiCo sign agreement for Ready-To-Drink coffee  energy beverages in Latin America "
    },
    {
        "content": "PepsiCo Inc  reported better-than-expected quarterly profit and sales and recorded revenue growth in its Americas beverages business for just the second time in nearly four years  helped by higher demand and an increase in prices.",
        "date": "07092015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo profit  revenue beat estimates as higher pricing pays off "
    },
    {
        "content": "* Q2 net revenue $15.92 bln vs est $15.80 bln   (Adds details from conference call  analyst comment; updates shares)",
        "date": "07092015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 2-PepsiCo profit  revenue beat estimates as higher pricing pays off "
    },
    {
        "content": "* Futures up: Dow 1.01 pct  S&P 1.12 pct  Nasdaq 1.16 pct   (Adds details  comment  updates prices)",
        "date": "07092015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "US STOCKS-Wall St set to open higher as China stems rout "
    },
    {
        "content": "July 9 PepsiCo Inc reported better-than-expected quarterly profit and revenue due to strong demand for its snacks and beverages in North America.",
        "date": "07092015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo Q2 profit  revenue beat estimates "
    },
    {
        "content": "PepsiCo Inc  plans to introduce a line of fountain craft sodas called \"Stubborn Soda\" for soft drink dispensers in the United States as early as this summer.",
        "date": "06042015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo to launch new line of fountain craft sodas "
    },
    {
        "content": "June 4 PepsiCo Inc plans to introduce a line of fountain craft sodas called \"Stubborn Soda\" for soft drink dispensers in the United States as early as this summer.",
        "date": "06042015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-PepsiCo to launch new line of fountain craft sodas "
    },
    {
        "content": "June 4 PepsiCo Inc plans to introduce a line of fountain craft sodas called \"Stubborn Soda \" Beverage-Digest reported  citing sources.",
        "date": "06042015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Pepsi to introduce fountain craft sodas - Beverage-Digest "
    },
    {
        "content": "LONDON  May 21 The consumer goods world has long been dominated by marketing whiz kids raised through the ranks of Procter & Gamble or PepsiCo  but the executives now in demand come from a new school that values cost-cutting and mergers over marketing.",
        "date": "05212015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "INSIGHT-New breed of food execs raised on mergers  not marketing "
    },
    {
        "content": "Owens-Illinois Inc   which makes bottles for Corona and Pepsi  is to buy Mexico's Vitro SAB's glass container business for about $2.15 billion to strengthen its operations in a country that houses numerous distilleries and bottlers.",
        "date": "05132015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Owens-Illinois to buy Mexico's Vitro's glass container business "
    },
    {
        "content": "* O-I shares rise 10.7 pct  Vitro hits record high   (Updates with Vitro share price)",
        "date": "05132015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 3-Owens-Illinois to buy Mexico's Vitro's glass container business "
    },
    {
        "content": "* Orkla ASA has signed an agreement with PepsiCo to become the primary go-to-market partner for PepsiCo's juice  cereals  and snacks products in the Nordics  including the brands Tropicana  Quaker  and Lay's.",
        "date": "04272015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Orkla expands Nordic partnership deal with PepsiCo "
    },
    {
        "content": "April 24 PepsiCo Inc said it would replace its current Diet Pepsi offerings in the United States with those free of aspartame  an artificial sweetener that has come under scrutiny from health-conscious consumers.",
        "date": "04242015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo to launch aspartame-free Diet Pepsi in U.S. "
    },
    {
        "content": "* Indexes: Dow  S&P  Nasdaq up 0.3 pct   (Updates to early afternoon)",
        "date": "04232015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "US STOCKS-Wall St up with Nasdaq briefly topping all-time closing high "
    },
    {
        "content": "* Indexes: Dow off 0.1 pct; S&P 500 and Nasdaq flat   (Updates to open)",
        "date": "04232015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "US STOCKS-Wall St flat as energy offsets weak data  earnings "
    },
    {
        "content": "PepsiCo Inc reported better-than-expected first-quarter profit  helped by stronger demand for its Frito-Lay snacks in North America and price increases in its beverage business.",
        "date": "04232015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo profit beats estimates on stronger Frito-Lay demand "
    },
    {
        "content": "April 23 PepsiCo Inc reported better-than-expected first-quarter profit  helped by stronger demand for its Frito-Lay snacks in North America and price increases in its beverage business.",
        "date": "04232015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 2-PepsiCo profit beats estimates on stronger Frito-Lay demand "
    },
    {
        "content": "* Futures down: Dow 66 pts  S&P 6 pts  Nasdaq 9 pts   (Adds comment  data  updates prices)",
        "date": "04232015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "US STOCKS-Wall St to open lower on weak data  earnings "
    },
    {
        "content": "April 23 PepsiCo Inc said its quarterly revenue fell 3.2 percent  largely due to a strong dollar.",
        "date": "04232015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo quarterly revenue falls 3.2 pct on strong dollar "
    },
    {
        "content": "PepsiCo Inc is taking over league sponsorship rights for the National Basketball Association  ending a 28-year partnership that the league has had with Coca-Cola Co.",
        "date": "04132015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Pepsi takes over NBA sponsorship rights from Coke "
    },
    {
        "content": "* Terms of the deal were not disclosed   (Changes sourcing  adds details)",
        "date": "04132015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 2-Pepsi takes over NBA sponsorship rights from Coke "
    },
    {
        "content": "TOKYO Misao Okawa  a Japanese woman recognized as the world's oldest person who credited her longevity to \"eating delicious things\" and getting plenty of rest  died at the age of 117 on Wednesday  Japanese media reported. | Video ",
        "date": "04012015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "The world's oldest person  Misao Okawa  dies at age 117: media "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO/LONDON  March 27 (Fitch) Fitch Ratings has published its new Rating  Navigators for: --The Coca-Cola Company --Coca-Cola Enterprises Inc. --PepsiCo Inc. --Coca-Cola Icecek --Coca-Cola FEMSA SAB --Corporacion Lindley --Embotelladora Andina --Grupo Embotellador Atic --Ajecorp  These reports should be read in conjunction with the 'Introducing Rating  Navigators for Corporates' report dated Nov. 5  2014 and 'Non-Alcoholic  Beverages",
        "date": "03272015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Fitch Publishes Ratings Navigator for 9 Non-Alcoholic Beverage Companies "
    },
    {
        "content": "SHANGHAI  March 23 China's largest food and beverage maker Tingyi (Cayman Islands) Holding Corp  said net profit fell 2 percent in 2014  while a slowing economy and fierce competition dragged sales down for the first time in almost two decades.",
        "date": "03232015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "CORRECTED-China food maker Tingyi 2014 net profit down 2 pct  lags forecast "
    },
    {
        "content": "SHARM EL SHEIKH  Egypt PepsiCo  will invest $500 million in Egypt this year to expand production  its business unit manager for North East Africa said on Saturday.",
        "date": "03142015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo to invest $500 million in Egypt this year "
    },
    {
        "content": "SHARM EL SHEIKH  Egypt  March 14 PepsiCo  will invest $500 million in Egypt this year to expand production  its business unit manager for North East Africa said on Saturday.",
        "date": "03142015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-PepsiCo to invest $500 mln in Egypt this year "
    },
    {
        "content": "SHARM EL SHEIKH  Egypt  March 14 PepsiCo  will invest $500 million in Egypt this year to expand production  its business unit manager for North East Africa said on Saturday.",
        "date": "03142015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo to invest $500 mln in Egypt this year "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 03 (Fitch) Fitch Ratings has affirmed the ratings of PepsiCo   Inc. (PepsiCo)  Pepsi-Cola Metropolitan Bottling Company  Inc.  and Bottling  Group  LLC at 'A'.  The Rating Outlook is Stable. PepsiCo had approximately  $28.9 billion of total debt at the end of 2014. A full list of rating actions follows at the end of the press release. KEY RATING DRIVERS  Brand Strength and Scale PepsiCo's ratings reflect its considerable ",
        "date": "03032015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Fitch Affirms PepsiCo's IDRs at 'A/F1'; Outlook Stable "
    },
    {
        "content": "Feb 24 Donald Keough  Coca-Cola Co's COO and president during the company's intense \"cola war\" days with PepsiCo Inc in the '80s  has died at the age of 88.",
        "date": "02242015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Former Coca-Cola executive Donald Keough dies "
    },
    {
        "content": "NEW YORK  Feb 10 Coca-Cola Co raised the overall prices it charges its retail customers in North America 4 percent in the latest quarter  the company said on Tuesday  a signal to industry watchers that soft-drink rival PepsiCo  probably raised prices too.",
        "date": "02102015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "Coke's price increase encourages beverage company shareholders "
    },
    {
        "content": "* Indexes: Dow off 0.04 pct  S&P flat  Nasdaq up 0.28 pct   (Updates to late afternoon  adds commentary)",
        "date": "02112015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "US STOCKS-Wall St ends flat while investors await Greece  Ukraine news "
    },
    {
        "content": "* Indexes down: Dow 0.55 pct  S&P 0.45 pct  Nasdaq 0.08   (Updates to afternoon  adds commentary)",
        "date": "02112015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "US STOCKS-Wall St dips as investors eye Greece and Ukraine talks "
    },
    {
        "content": "AIRPORT CITY  Israel  Feb 9 Facing new competition from the expected launch of Keurig Green Mountain Inc's at-home soda machine in 2015  top player SodaStream International is seeking to appeal to increasingly health-oriented consumers.",
        "date": "02092015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "SodaStream looks to flavoured waters as consumers shun sugary drinks "
    },
    {
        "content": "PepsiCo Inc  on Wednesday reported a higher-than-expected quarterly  profit  helped by increased sales at its Frito-Lay snack business  and said it would buy back up to $12 billion in stock by 2018. | Video ",
        "date": "02112015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo profit beats estimates; $12 billion buyback planned "
    },
    {
        "content": "* Indexes: Dow off 0.23 pct  S&P off 0.01 pct  Nasdaq up 0.39 pct   (Updates to late morning  updates earnings data)",
        "date": "02112015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "US STOCKS-Wall St flat before Greek deal talks; Apple lifts Nasdaq "
    },
    {
        "content": "Feb 11 PepsiCo Inc on Wednesday reported a higher-than-expected quarterly  profit  helped by increased sales at its Frito-Lay snack business  and said it would buy back up to $12 billion in stock by 2018.",
        "date": "02112015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 3-PepsiCo profit beats estimates; $12 billion buyback planned "
    },
    {
        "content": "* Indexes off: Dow off 0.28 pct  S&P 0.07 pct  Nasdaq up 0.21 pct   (Updates to market open)",
        "date": "02112015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "US STOCKS-Wall St little changed ahead of Greek deal talks "
    },
    {
        "content": "* Futures: Dow down 30 pts  S&P off 1.5 pts  Nasdaq up 2 pts   (Adds quote  updates prices)",
        "date": "02112015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "US STOCKS-Wall St set for flat open; Greek deal talks on tap "
    },
    {
        "content": "NEW YORK  Feb 11 U.S. stock index futures were little changed on Wednesday  after the S&P 500 climbed to its highest level of the year and ahead of a meeting of euro zone finance ministers to discuss plans for Greece's debt.",
        "date": "02112015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "US STOCKS-Futures little changed ahead of Greek debt talks "
    },
    {
        "content": "Feb 11 PepsiCo Inc  the maker of Mountain Dew and Tropicana beverages  reported a 1 percent fall in quarterly revenue as a stronger dollar hurt revenue from international markets.",
        "date": "02112015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo quarterly revenue falls 1 pct "
    },
    {
        "content": "CHICAGO (Reuters Breakingviews) - Nelson Peltz has brought his activist record full circle. At the billionaire activist's recommendation  PepsiCo has agreed to add Bill Johnson to its board. The former Heinz boss tussled with Peltz in 2006 but later became an adviser to his Trian fund. Johnson's evolution from adversary to ally shows why even activists should try to win friends  not make enemies.",
        "date": "01212015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "Breakingviews: Former Peltz adversary comes full circle at Pepsi "
    },
    {
        "content": "PepsiCo Inc said it had elected an adviser at Nelson Peltz's Trian Fund Management to its board  signaling a truce between the company and the activist investor following his two- year push to split the snack and beverage maker.",
        "date": "01172015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo elects Trian adviser to board  signaling truce "
    },
    {
        "content": "PepsiCo Inc said it had elected William Johnson  an advisory partner at Trian Fund Management  to its board  following a recent push by Trian to split the company.",
        "date": "01162015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "PepsiCo elects Trian Fund advisory partner to board "
    },
    {
        "content": "Jan 16 PepsiCo Inc said it had elected an adviser at Nelson Peltz's Trian Fund Management to its board  signaling a truce between the company and the activist investor following his two- year push to split the snack and beverage maker.",
        "date": "01172015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 2-PepsiCo elects Trian adviser to board  signaling truce "
    },
    {
        "content": "Jan 16 PepsiCo Inc said it had elected William Johnson  an advisory partner at Trian Fund Management  to its board  following a recent push by Trian to split the company.",
        "date": "01162015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "UPDATE 1-PepsiCo elects Trian Fund advisory partner to board "
    },
    {
        "content": "Jan 16 PepsiCo Inc said it had elected William Johnson  an advisory partner at Nelson Peltz-led Trian Fund Management to its board.",
        "date": "01162015",
        "name": "Pepsico Inc",
        "news_type": "normal",
        "symbol": "PEP",
        "title": "PepsiCo elects Trian Fund's nominee to board "
    },
    {
        "content": "* Says the company's Belarusian subsidiary OAO Lidskoe Pivo has entered into a co-operation agreement concerning Belarusian market with Pepsico",
        "date": "01122015",
        "name": "Pepsico Inc",
        "news_type": "topStory",
        "symbol": "PEP",
        "title": "BRIEF-Olvi to start co-operation with PepsiCo in Belarus "
    }
]