[
    {
        "content": "The U.S. Food and Drug Administration on Thursday approved the use of Pfizer Inc's cancer drug Sutent to help prevent kidney cancer from returning following surgical removal of a kidney.",
        "date": "11162017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "FDA expands approval for Pfizer cancer drug Sutent "
    },
    {
        "content": "Nov 16 The U.S. Food and Drug Administration on Thursday approved the use of Pfizer Inc's cancer drug Sutent to help prevent kidney cancer from returning following surgical removal of a kidney.",
        "date": "11162017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "U.S. FDA expands approval for Pfizer cancer drug Sutent "
    },
    {
        "content": "LONDON  Nov 16 Pfizer and Novartis have agreed price cuts for their rival breast cancer drugs Ibrance and Kisqali to ensure they can be used routinely within Britain's state-funded health service.",
        "date": "11162017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer  Novartis agree UK price cuts for new breast cancer drugs "
    },
    {
        "content": "NEW YORK Drugmaker Pfizer Inc  has promoted Albert Bourla to the newly created post of chief operating officer  freeing up Chief Executive Officer Ian Read to focus more on long-term strategy and engaging with government and industry leaders.",
        "date": "11132017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer creates chief operating officer role for Bourla "
    },
    {
        "content": "NEW YORK  Nov 13 Drugmaker Pfizer Inc has promoted Albert Bourla to the newly created post of chief operating officer  freeing up Chief Executive Officer Ian Read to focus more on long-term strategy and engaging with government and industry leaders.",
        "date": "11132017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer creates chief operating officer role for Bourla "
    },
    {
        "content": "* Pfizer - ‍albert Bourla has been group president of co's innovative health business since beginning of 2016​",
        "date": "11132017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer names Albert Bourla chief operating officer "
    },
    {
        "content": "Nov 10 Pfizer Inc said on Friday it has sold its 49 percent stake to exit a joint venture it had set up with China's Zhejiang Hisun Pharmaceuticals in 2012 to develop and market generic drugs.",
        "date": "11102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer exits China joint venture for generic drugs "
    },
    {
        "content": "* Spark Therapeutics and Pfizer amend license agreement for investigational SPK-9001 in hemophilia B",
        "date": "11072017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Spark Therapeutics and Pfizer amend license agreement for investigational SPK-9001 in hemophilia B "
    },
    {
        "content": "* 2017 EPS at favourable end of low to mid teens decline (Adds further CEO comments  reaction)",
        "date": "11092017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-AstraZeneca sales decline slows as it waits for medicine to work "
    },
    {
        "content": "* Class of CDK4/6 cancer drugs getting crowded (Adds details  company and analyst comment)",
        "date": "11082017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 1-Novartis takes fight to Pfizer's Ibrance with new Kisqali data "
    },
    {
        "content": "* Sales  profit to hit lower end of target ranges on strong eur",
        "date": "11092017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Merck KGaA tones down outlook but consumer health shines "
    },
    {
        "content": "ZURICH  Nov 8 Novartis drug Kisqali was shown effective in a late-stage trial in treating advanced or metastatic breast cancer  the Swiss drugmaker said on Wednesday.",
        "date": "11082017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Novartis cancer drug Kisqali succeeds in late-stage trial "
    },
    {
        "content": "NEW YORK Pfizer Inc  the largest U.S. drugmaker  expects no shortage of suitors for its consumer health business and said it would decide whether to sell  spin off or retain the unit next year. | Video ",
        "date": "10312017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer expects broad interest for consumer health business "
    },
    {
        "content": "NEW YORK  Oct 31 Pfizer Inc  the largest U.S. drugmaker  expects no shortage of suitors for its consumer health business and said it would decide whether to sell  spin off or retain the unit next year.",
        "date": "10312017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 4-Pfizer expects broad interest for consumer health business "
    },
    {
        "content": "* Pfizer CEO says expects broad interest from potential acquirers for consumer health business  sees decision in 2018",
        "date": "10312017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer sees broad interest for consumer health "
    },
    {
        "content": "* Pfizer Inc - qtrly worldwide total lyrica revenue $ 1 150 million versus $1 049 million",
        "date": "10312017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says qtrly worldwide total lyrica revenue $ 1 150 mln versus $1 049 ln "
    },
    {
        "content": "Oct 31 Pfizer Inc's third-quarter profit more than doubled  while revenue remained largely flat.",
        "date": "10312017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer's quarterly profit more than doubles "
    },
    {
        "content": "LONDON Pfizer plans to kick off an auction process for its consumer healthcare business in November  paving the way for a potential $15 billion-plus sale of the headache pill to lip balm business  sources close to the matter told Reuters.",
        "date": "10262017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Exclusive: Pfizer to launch consumer health sale in November - sources "
    },
    {
        "content": "Oct 25 GlaxoSmithKline CEO Emma Walmsley tells reporters:",
        "date": "10252017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-GSK will look at Pfizer  Merck consumer assets if offered for sale "
    },
    {
        "content": "* Pfizer Inc reports 5.4 percent passive stake in Rhythm Pharmaceuticals Inc as of October 10  2017 - ‍​SEC filing Source text: (http://bit.ly/2ywc5E7) Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "10182017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer reports 5.4 pct passive stake in Rhythm Pharmaceuticals - ‍​SEC filing "
    },
    {
        "content": "* Pfizer presents full results from Phase 2 study of next-generation investigational ALK-inhibitor lorlatinib in ALK-positive and ROS1-positive advanced non-small cell lung cancer",
        "date": "10162017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer presents results from Phase 2 study of investigational ALK-inhibitor lorlatinib "
    },
    {
        "content": "* Pfizer Inc - ‍U.S. FDA approves Lyrica CR extended-release tablets CV​",
        "date": "10122017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-FDA approves Pfizer's Lyrica® CR extended-release tablets CV "
    },
    {
        "content": "* Nestle declines comment on any interest in Pfizer's consumer healthcare business  says does not comment on rumours as a matter of policy Source text for Eikon: Further company coverage: (Reporting By Zurich newsroom)",
        "date": "10112017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Nestle has no comment on Pfizer's consumer healthcare business "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Painkillers and pile cream: these are either the recipe for a terrible night in  or a potentially good corporate deal. Pfizer  the $215 billion U.S. drugmaker  has tasked investment banks with looking into a spinoff or sale of its consumer-goods division  which makes Advil and Preparation H. New GlaxoSmithKline boss Emma Walmsley would be well placed to offer a home.",
        "date": "10102017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Breakingviews - Pfizer and Glaxo may find romance over the counter "
    },
    {
        "content": "Pfizer said on Tuesday it was considering the sale or spin-off of its consumer healthcare business  shaking up the industry and potentially putting a headache pill to lip balm operation worth some $15 billion up for grabs.",
        "date": "10102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer weighs $15 billion sale of consumer healthcare business "
    },
    {
        "content": "* Possible buyers include existing OTC drugmakers and Nestle (Adds Breakingviews link)",
        "date": "10102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 4-Pfizer weighs $15 bln sale of consumer healthcare business "
    },
    {
        "content": "Oct 10 Pfizer Inc said on Tuesday it was reviewing strategic alternatives for its consumer healthcare business  including a full or partial separation of the unit.",
        "date": "10102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer mulling sale of consumer healthcare business "
    },
    {
        "content": "* Pfizer reviewing strategic alternatives for Consumer Healthcare business",
        "date": "10102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer reviewing strategic alternatives for Consumer Healthcare business "
    },
    {
        "content": "WASHINGTON  Oct 4 The Trump administration will keep for now an Obama-era rule that helped halt a wave of U.S. corporations moving abroad via tax-driven corporate inversion deals  it said on Wednesday  but added that it expected tax reform to obviate the rule.",
        "date": "10052017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-Trump to keep Obama rule curbing corporate tax inversion deals "
    },
    {
        "content": "Pfizer Inc has filed a lawsuit seeking to block a generic manufacturer from selling a cheaper version of leukemia drug Bosulif.",
        "date": "09282017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer sues Sun Pharmaceuticals to block generic Bosulif "
    },
    {
        "content": "* ‍Moody's says biosimilars market adoption faces hurdles but development continues apace​",
        "date": "09282017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-‍Moody's says biosimilars market adoption faces hurdles but development continues apace​ "
    },
    {
        "content": "* Pfizer declares 32-cent fourth-quarter 2017 dividend Source text for Eikon: Further company coverage:",
        "date": "09272017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer declares 32-cent fourth-quarter 2017 dividend "
    },
    {
        "content": "FRANKFURT  Sept 21 European regulators on Thursday granted market approval for Merck KGaA and Pfizer's immuno-oncology drug Bavencio to treat a rare and aggressive type of skin cancer called Merkel cell carcinoma.",
        "date": "09212017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Merck KGaA  Pfizer's cancer drug Bavencio gets EU nod "
    },
    {
        "content": "Drugmaker Pfizer Inc on Wednesday filed a lawsuit against Johnson & Johnson  saying its rival's contracts with health insurers for blockbuster rheumatoid arthritis drug  Remicade  were anticompetitive and blocked sales of Pfizer's new biosimilar.",
        "date": "09202017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer files suit against J&J over Remicade contracts "
    },
    {
        "content": "Sept 20 Drugmaker Pfizer Inc on Wednesday filed a lawsuit against Johnson & Johnson  saying its rival's contracts with health insurers for blockbuster rheumatoid arthritis drug  Remicade  were anticompetitive and blocked sales of Pfizer's new biosimilar.",
        "date": "09202017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Pfizer files suit against J&J over Remicade contracts "
    },
    {
        "content": "* Pfizer announces outcome of FDA advisory committee meeting for Sutent in patients at high risk of recurrent renal cell carcinoma after surgery",
        "date": "09192017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces outcome of FDA advisory committee meeting for Sutent "
    },
    {
        "content": "Sept 20 Pfizer Inc on Wednesday filed a lawsuit against Johnson & Johnson  saying that the drugmaker's anticompetitive contracts with health insurers prevented biosimilar competition to its blockbuster rheumatoid arthritis drug  Remicade.",
        "date": "09202017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer sues Johnson & Johnson over Remicade biosimilar "
    },
    {
        "content": "* ‍Pfizer says filed suit in U.S. District Court for Eastern District of Pennsylvania against Johnson & Johnson​",
        "date": "09202017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-‍Pfizer files lawsuit against Johnson & Johnson​ "
    },
    {
        "content": "Pfizer Inc and Japan's Astellas Pharma Inc said on Thursday their blockbuster prostate cancer drug met the main goal of a key study that tested it for treating the disease in its early stages.",
        "date": "09142017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer  Astellas prostate cancer drug promising in late-stage trial "
    },
    {
        "content": "MADRID  Sept 10 A combination of two Bristol-Myers Squibb immunotherapy drugs cut the risk of death by 37 percent in a key group of kidney cancer patients  data from a closely watched clinical trial showed on Sunday.",
        "date": "09102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Bristol's drug cocktail cuts kidney cancer death risk 37 pct "
    },
    {
        "content": "* Pfizer's shares up 1.8 pct (Adds analysts' comments  details on drug's potential market; updates shares)",
        "date": "09142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Pfizer  Astellas prostate cancer drug promising in late-stage trial "
    },
    {
        "content": "MADRID  Sept 10 A combination of two Bristol-Myers Squibb immunotherapy drugs cut the risk of death by 37 percent in a key group of kidney cancer patients  data from a closely watched clinical trial showed on Sunday.",
        "date": "09102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Bristol kidney cancer drug cut death risk 37 pct in key patients "
    },
    {
        "content": "* Pfizer Inc - ‍results indicated a numerical improvement in OS for patients treated with first-line xalkori compared with chemotherapy​",
        "date": "09112017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says ‍results indicated a improvement in OS for patients "
    },
    {
        "content": "Sept 14 Pfizer Inc and Japan's Astellas Pharma Inc said on Thursday their prostate cancer drug met the main goal of a trial testing it for a more common form of the disease.",
        "date": "09142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-UPDATE 2-Pfizer  Astellas prostate cancer drug succeeds key trial "
    },
    {
        "content": "FRANKFURT/LONDON  Sept 8 Germany's Merck KGaA has hired JP Morgan to sell its consumer health business  which includes brands such as Seven Seas vitamins and could be worth around $4.5 billion.",
        "date": "09112017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "RPT-UPDATE 1-Germany's Merck hires JP Morgan to sell consumer health "
    },
    {
        "content": "Pfizer Inc and Astellas Pharma Inc said on Thursday their drug to treat a type of prostate cancer met the main goal in a late-stage trial.",
        "date": "09142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer  Astellas prostate cancer drug clears late-stage trial "
    },
    {
        "content": "Sept 14 Pfizer Inc and Astellas Pharma Inc said on Thursday their drug to treat a type of prostate cancer met the main goal of improving overall survival in a late-stage trial.",
        "date": "09142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-Pfizer  Astellas prostate cancer drug clears late-stage trial "
    },
    {
        "content": "* Co and Pfizer Inc announced that the Phase 3 PROSPER trial evaluating XTANDI®(enzalutamide) plus androgen deprivation therapy (ADT) versus ADT alone in patients with non-metastatic (M0) CastrationResistant Prostate Cancer (CRPC) met its primary endpoint of improved metastasis-free survival (MFS)",
        "date": "09142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Astellas Pharma and Pfizer say positive top-line results from phase 3 prosper trial of XTANDI (enzalutamide) "
    },
    {
        "content": "* Pfizer and Astellas announce positive top-line results from phase 3 prosper trial of XTANDI (enzalutamide) in patients with non-metastatic castration-resistant prostate cancer",
        "date": "09142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer  Astellas report positive top-line results from phase 3 PROSPER trial of XTANDI "
    },
    {
        "content": "Sept 1 The U.S. Food and Drug Administration (FDA) on Friday approved Pfizer Inc's drug  Mylotarg  for certain patients with acute myeloid leukemia (AML).",
        "date": "09012017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "FDA approves Pfizer's leukemia drug "
    },
    {
        "content": "* Pfizer receives FDA approval for MYLOTARG (gemtuzumab ozogamicin) Source text for Eikon: Further company coverage:",
        "date": "09012017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer receives FDA approval for MYLOTARG (gemtuzumab ozogamicin) "
    },
    {
        "content": "* U.S. FDA approves Pfizer's Mylotarg for treatment of acute myeloid leukemia",
        "date": "09012017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-U.S. FDA approves Pfizer's Mylotarg for treatment of acute myeloid leukemia "
    },
    {
        "content": "* Sangamo and Pfizer announce first patient receives treatment in Phase 1/2 clinical trial evaluating SB-525 investigational gene therapy for Hemophilia A Source text for Eikon: Further company coverage:",
        "date": "08252017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer and Sangamo updates on early stage trial on its blood disorder therapy "
    },
    {
        "content": "ZURICH Novartis AG said its drug Kisqali (ribociclib) received European Union approval as first-line treatment for a tough-to-treat breast cancer  bolstering the Swiss drugmaker's bid to challenge U.S. rival Pfizer's Ibrance.",
        "date": "08242017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Novartis receives EU approval for breast cancer drug Kisqali "
    },
    {
        "content": "ZURICH  Aug 24 Novartis AG said its drug Kisqali (ribociclib) received European Union approval as first-line treatment for a tough-to-treat breast cancer  bolstering the Swiss drugmaker's bid to challenge U.S. rival Pfizer's Ibrance.",
        "date": "08242017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Novartis receives EU approval for breast cancer drug Kisqali "
    },
    {
        "content": "ZURICH  Aug 24 Novartis AG said its drug Kisqali (ribociclib) received European Union approval as first-line treatment for a tough-to-treat breast cancer  bolstering the Swiss drugmaker's bid to challenge rival Pfizer's Ibrance.",
        "date": "08242017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Novartis says receives EU approval for breast cancer drug Kisqali "
    },
    {
        "content": "* Pfizer receives U.S. FDA approval for BESPONSA (inotuzumab ozogamicin) Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer receives FDA approval for BESPONSA (inotuzumab ozogamicin) "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Tesla Inc - SEC filing",
        "date": "08142017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Tesla  Pfizer  ConocoPhillips "
    },
    {
        "content": "The U.S. Food and Drug Administration (FDA) said on Thursday it approved Pfizer Inc's rare blood cancer drug  Besponsa  with a boxed warning.",
        "date": "08172017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "FDA approves Pfizer's drug for rare blood cancer "
    },
    {
        "content": "* Paulson & Co dissolves share stake in Pfizer- SEC filing ‍​",
        "date": "08142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Paulson & Co dissolves share stake in Pfizer  ups in Valeant ‍​ "
    },
    {
        "content": "* Appaloosa Lp dissolves class a share stake in Snap Inc - SEC Filing",
        "date": "08142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Appaloosa dissolves share stake in Snap Inc  Pfizer Inc "
    },
    {
        "content": "* Based on typical duration of treatment  drug to cost $168 300",
        "date": "08172017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-FDA approves Pfizer's drug for rare blood cancer "
    },
    {
        "content": "* U.S. FDA approved Besponsa (inotuzumab ozogamicin) for the treatment of adults with relapsed or refractory B-cell precursor acute lymphoblastic leukemia ‍​",
        "date": "08172017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-U.S. FDA approves Pfizer's leukemia drug Besponsa ‍​ "
    },
    {
        "content": "* Pfizer Inc - as of July 2017  U.S. DOJ's antitrust division is investigating co's greenstone generics business - SEC Filing‍​ Source text: (http://bit.ly/2vJKobY ) Further company coverage:",
        "date": "08102017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer Inc - U.S. DOJ's antitrust division is investigating co's greenstone generics business -  SEC Filing‍​ "
    },
    {
        "content": "* ‍56 PERCENT INCREASE IN TOTAL H1 REVENUE  AMOUNTING TO CHF 46.2 MILLION​",
        "date": "08102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Basilea Pharmaceutica H1 net loss narrows to CHF 20.6 million​ "
    },
    {
        "content": "* Avara Pharmaceutical Services acquires sterile facility from Pfizer in Italy",
        "date": "08082017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Avara Pharmaceutical buys Pfizer's Italy sterile facility "
    },
    {
        "content": "LONDON  Aug 8 The science of gene therapy is finally delivering on its potential  and drugmakers are now hoping to produce commercially viable medicines after tiny sales for the first two such treatments in Europe.",
        "date": "08082017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Drugmakers' hopes for gene therapy rise despite tiny sales in Europe "
    },
    {
        "content": "* SAID ON WEDNESDAY FIRST AML PATIENT TREATED WITH UCART123 ENROLLMENT ONGOING",
        "date": "08032017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Cellectis reports Q2 operating loss of 18.0 million euros "
    },
    {
        "content": "* Spark therapeutics reports second quarter 2017 financial results and recent business progress",
        "date": "08022017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Spark Therapeutics posts Q2 loss per share of $2.40 "
    },
    {
        "content": "* Q2 earnings per share view $0.66 -- Thomson Reuters I/B/E/S",
        "date": "08022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-BRIEF-Pfizer reports second-quarter results (Aug 1) "
    },
    {
        "content": "Pfizer Inc's  chief executive said on Tuesday he would prefer to wait for clarity on U.S. tax reform before engaging in any big deals in order to get a better understanding of any potential acquisition target's value. | Video ",
        "date": "08012017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer delays major M&A as it awaits U.S. tax reform clarity "
    },
    {
        "content": "* Merck gains  Bristol-Myers falls in reaction to news (Adds Merck and Bristol share moves  CEO comment on dividend)",
        "date": "07272017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 7-AstraZeneca lung cancer failure sparks 16 percent share fall "
    },
    {
        "content": "* Raises 2017 adjusted profit midpoint by 2 cents (Rewrites with company comment  updates shares)",
        "date": "08012017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 4-Pfizer delays major M&A as it awaits U.S. tax reform clarity "
    },
    {
        "content": "A federal judge has dismissed 20 lawsuits against Bristol-Myers Squibb and Pfizer Inc claiming that people who took its blood thinner Eliquis suffered severe internal bleeding  leaving just a single case in the consolidated litigation over the drug.",
        "date": "07282017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Federal judge tosses most Eliquis cases vs. Bristol-Myers  Pfizer "
    },
    {
        "content": "* Q2 worldwide Ibrance revenue $853 million versus $514 million",
        "date": "08012017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer reports Q2 worldwide Ibrance revenue $853 mln vs $514 mln "
    },
    {
        "content": "* Q2 earnings per share view $0.66 -- Thomson Reuters I/B/E/S",
        "date": "08012017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer Q2 earnings per share $0.51 "
    },
    {
        "content": "Aug 1 Pfizer Inc reported a nearly 2 percent drop in quarterly revenue on Tuesday  driven by lower demand for its rheumatoid arthritis treatment Enbrel and pneumonia vaccine Prevnar.",
        "date": "08012017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer quarterly revenue slips 2 percent "
    },
    {
        "content": "    July 28 Diary of U.S. (.SPX) corporate earnings for the week ahead.         ** Please Note - All times given are in U.S. EST unless otherwise stated **                  U.S. EARNINGS    Start Date   Start      Company                         RIC      Event Name               Time                                                  31-Jul-2017  BMO        Roper Technologies Inc          ROP.N    Q2 2017 Roper Technologies Inc Earnings Release  31-Jul-2017  BMO        Affiliated Manag",
        "date": "07282017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "DIARY-U.S. earnings week ahead "
    },
    {
        "content": "* Pfizer announces positive top-line results from the comparative reflections B7391003 study for PF-06439535  a potential biosimilar to avastin®1 (bevacizumab)",
        "date": "07242017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces positive top-line results "
    },
    {
        "content": "* BASILEA ANNOUNCES COMPLETION OF THE LICENSE AGREEMENT WITH PFIZER FOR ANTIFUNGAL CRESEMBA® FOR EUROPE  RUSSIA  TURKEY AND ISRAEL",
        "date": "07202017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Basilea completes license agreement with Pfizer for Cresemba "
    },
    {
        "content": "NEW YORK  July 25 A Long Island  New York  investment adviser accused of engaging in insider trading after being tipped off about Pfizer Inc's $3.6 billion acquisition of King Pharmaceuticals Inc pleaded guilty on Tuesday  federal prosecutors said.",
        "date": "07252017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Adviser charged with insider trading on Pfizer-King deal pleads guilty "
    },
    {
        "content": "* EMA’S CHMP ISSUES POSITIVE OPINION FOR AVELUMAB FOR THE TREATMENT OF METASTATIC MERKEL CELL CARCINOMA",
        "date": "07212017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Merck KGaA and Pfizer: CHMP recommends approval of avelumab "
    },
    {
        "content": "July 21 European regulators on Friday recommended approving Pfizer Inc and Merck KGaA's immuno-oncology drug Bavencio to treat a rare type of skin cancer called Merkel cell carcinoma.",
        "date": "07212017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer  Merck KGaA skin cancer drug gets EMA nod for approval "
    },
    {
        "content": "LONDON AstraZeneca Chief Executive Pascal Soriot  responding to rumors he might leave the drugmaker to join rival Teva Pharmaceutical Industries  has told staff he expects to work together with employees to see the company succeed.",
        "date": "07212017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "AstraZeneca CEO reassures staff  aims to be at September cancer meet "
    },
    {
        "content": "LONDON  July 21 AstraZeneca Chief Executive Pascal Soriot  responding to rumours he might leave the drugmaker to join rival Teva Pharmaceutical Industries   has told staff he expects to work together with employees to see the company succeed.",
        "date": "07212017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-AstraZeneca CEO reassures staff  aims to be at Sept cancer meet "
    },
    {
        "content": "* Pfizer Inc. reports 9.8 percent passive stake in Mersana Therapeutics Inc as of July 3 - sec filing Source text for Eikon: Further company coverage:",
        "date": "07132017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Mersana Therapeutics says Pfizer reports 9.8 percent passive stake in Mersana as of July 3 - SEC Filing "
    },
    {
        "content": "* Pfizer announces FDA accepts supplemental new drug application for xeljanz® (tofacitinib citrate) for the treatment of adult patients with moderately to severely active ulcerative colitis",
        "date": "07132017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says FDA accepted supplemental NDA for ulcerative colitis treatment "
    },
    {
        "content": "* FDA Advisory Committee votes in favor of Pfizer'S Mylotarg (gemtuzumab ozogamicin) for acute myeloid leukemia",
        "date": "07112017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-FDA Advisory Committee votes in favor of Pfizer's Mylotarg for acute myeloid leukemia "
    },
    {
        "content": "LONDON Shares in AstraZeneca fell more than 5 percent on Thursday after the company declined to deny a media report that Chief Executive Pascal Soriot was about to defect to Israel-based Teva Pharmaceutical Industries.",
        "date": "07132017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "AstraZeneca slumps on report CEO is heading to Teva "
    },
    {
        "content": "PARIS  July 11 French drugmaker and healthcare group Sanofi is to buy privately-held U.S vaccines biotech company Protein Sciences for an initial amount of $650 million  as Sanofi steps up its acquisition programme after recently missing two large deals.",
        "date": "07112017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Sanofi to buy vaccines biotech group Protein Sciences "
    },
    {
        "content": "LONDON  July 13 Shares in AstraZeneca fell more than 5 percent on Thursday after the company declined to deny a media report that Chief Executive Pascal Soriot was about to defect to Israel-based Teva Pharmaceutical Industries .",
        "date": "07132017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "REFILE-UPDATE 1-AstraZeneca slumps on report CEO is heading to Teva "
    },
    {
        "content": "SAO PAULO  July 4 Pfizer Inc has agreed to exit Laboratório Teuto Brasileiro SA for a token amount after failing to find a buyer for the 40 percent stake it held in the Brazilian generic drugmaking joint venture  two people with knowledge of the matter said on Tuesday.",
        "date": "07042017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer receives token payment to exit Brazil venture  sources say "
    },
    {
        "content": "* Besponsa® approved in the EU for adult patients with relapsed or refractory B-cell precursor acute lymphoblastic leukemia",
        "date": "06302017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says Besponsa approved in the EU for adult patients with relapsed or refractory B-cell precursor acute lymphoblastic leukemia "
    },
    {
        "content": "* Pfizer Inc- Expects to hire an additional 80 employees over coming years to support research at new research and development facility in Chesterfield  Missouri",
        "date": "06272017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer expects to hire an additional 80 employees over coming years to support research at new research and development facility in Chesterfield  Missouri "
    },
    {
        "content": "ZURICH A European Medicines Agency (EMA) panel recommended on Friday approving Novartis's Kisqali drug  bolstering the Swiss drugmaker's bid to challenge rival Pfizer's Ibrance against tough-to-treat breast cancer.",
        "date": "06232017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Novartis breast cancer drug Kisqali wins European panel backing "
    },
    {
        "content": "ZURICH  June 23 A European Medicines Agency (EMA) panel recommended on Friday approving Novartis's Kisqali drug  bolstering the Swiss drugmaker's bid to challenge rival Pfizer's Ibrance against tough-to-treat breast cancer.",
        "date": "06232017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Novartis breast cancer drug Kisqali wins European panel nod "
    },
    {
        "content": "* Sets quarterly dividend of $0.32 per share Source text for Eikon: Further company coverage:",
        "date": "06222017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer sets quarterly dividend of $0.32 per share "
    },
    {
        "content": "LONDON/ZURICH  June 22 Nestle's Gerber baby food business could make  acquisitions and sign partnerships with innovative startups to fuel growth in its home market  the United States  and in the fast-growing Chinese market  the division's head told Reuters",
        "date": "06222017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Nestle's Gerber baby food unit on the lookout for acquisitions "
    },
    {
        "content": "* Pfizer receives expanded Health Canada approval for ibrance in hr+  her2- metastatic breast cancer Source text for Eikon: Further company coverage:",
        "date": "06212017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer receives Health Canada approval for Ibrance in hr+  her2- metastatic breast cancer "
    },
    {
        "content": "* Effector Therapeutics to collaborate with Pfizer and Merck KGAA to evaluate a novel immuno-oncology combination in microsatellite stable colorectal cancer",
        "date": "06202017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Effector Therapeutics to collaborate with Pfizer and Merck to evaluate immuno-oncology combination in microsatellite stable colorectal cancer "
    },
    {
        "content": "* Pfizer begins Phase 1 clinical trial to evaluate investigational Group B streptococcus vaccine",
        "date": "06192017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer begins Phase 1 clinical trial to evaluate investigational Group B streptococcus vaccine "
    },
    {
        "content": "* Says it is aware of the ongoing shortage situation affecting several injectable drugs  manufactured by Hospira  a Pfizer company",
        "date": "06152017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-U.S. FDA updates on Pfizer drug shortages "
    },
    {
        "content": "* Basilea announces license agreement with Pfizer for antifungal Cresemba® (isavuconazole) for Europe  Russia  Turkey And Israel",
        "date": "06142017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Basilea announces license agreement with Pfizer for antifungal Cresemba "
    },
    {
        "content": "* Aspen denies any wrong doing  committed to constructive engagement",
        "date": "06132017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 2-Pfizer  Roche and Aspen face South African probe into cancer drug prices "
    },
    {
        "content": "* Pfizer receives exclusive commercialization rights in Europe for CRESEMBA  a novel treatment for potentially life-threatening fungal infections among immunocompromised patients",
        "date": "06142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer to have exclusive rights to distribute  commercialize CRESEMBA in Europe "
    },
    {
        "content": "* Pfizer and Lilly receive FDA fast track designation for Tanezumab",
        "date": "06132017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer and Lilly receive FDA fast track designation for Tanezumab "
    },
    {
        "content": "PRETORIA South Africa's competition watchdog has launched an investigation into three drug companies accused of over-charging for cancer medicines  the agency's chief said on Tuesday.",
        "date": "06142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer  Roche and Aspen face South African probe into cancer drug prices "
    },
    {
        "content": "* Astellas and Pfizer announce amendment to clinical research protocol for phase 3 prosper trial of enzalutamide in patients with non-metastatic castration-resistant prostate cancer",
        "date": "06092017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Astellas  Pfizer announce amendment to clinical research protocol for phase 3 prosper trial of enzalutamide "
    },
    {
        "content": "* Upadacitinib  a JAK inhibitor  more effective than a placebo",
        "date": "06072017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-UPDATE 3-AbbVie's rheumatoid arthritis drug succeeds in trial "
    },
    {
        "content": "* Pfizer receives FDA fast track designation for tafamidis for transthyretin cardiomyopathy",
        "date": "06062017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer receives FDA fast track designation for Tafamidis for transthyretin cardiomyopathy "
    },
    {
        "content": "* Sangamo Therapeutics and Pfizer announce that SB-525 investigational hemophilia A gene therapy receives orphan medicinal product designation from the European medicines agency",
        "date": "06072017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Sangamo Therapeutics updates on SB-525 investigational hemophilia A gene therapy "
    },
    {
        "content": "June 2 Pfizer Inc has hiked the price of nearly a hundred drugs by an average of 20 percent so far this year in the United States  the Financial Times reported on Friday.",
        "date": "06022017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "REFILE-Pfizer hikes U.S. prices of 91 drugs by average 20 pct in 2017-FT "
    },
    {
        "content": "* European commission approves pfizer’s trumenba® to help prevent meningococcal group b disease in adolescents and adults",
        "date": "05302017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-EU approves Pfizer’s Trumenba to help prevent meningococcal group B disease in adolescents and adults "
    },
    {
        "content": "Pfizer Inc  has hiked the price of nearly a hundred drugs by an average of 20 percent so far this year in the United States  the Financial Times reported on Friday.",
        "date": "06022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer hikes U.S. prices of 91 drugs by average 20 percent in 2017: Financial Times "
    },
    {
        "content": "Pfizer Inc on Friday defeated an effort to revive more than 300 lawsuits alleging that its antidepressant Zoloft causes cardiac birth defects in children when taken by women during early pregnancy.",
        "date": "06022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer defeats appeals linking Zoloft to birth defects "
    },
    {
        "content": "June 2 Pfizer Inc on Friday defeated an effort to revive more than 300 lawsuits alleging that its antidepressant Zoloft causes cardiac birth defects in children when taken by women during early pregnancy.",
        "date": "06022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Pfizer defeats appeals linking Zoloft to birth defects "
    },
    {
        "content": "June 2 A federal appeals court on Friday upheld the dismissal of more than 300 lawsuits against Pfizer Inc   which alleged that its antidepressant Zoloft caused cardiac birth defects in children when taken by women during early pregnancy.",
        "date": "06022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer defeats appeals over Zoloft birth defects "
    },
    {
        "content": "June 2 u.s. Appeals court upholds dismissal of lawsuits against pfizer claiming that its antidepressant zoloft causes birth defects--ruling 3RD U.S. CIRCUIT COURT OF APPEALS SAYS LOWER COURT JUDGE ACTED WITHIN HER DISCRETION IN EXCLUDING TESTIMONY FROM PLAINTIFFS' EXPERT APPEALS COURT SAYS CASE INVOLVED 315 CLAIMS AGAINST PFIZER  ALLEGING THAT ZOLOFT CAUSES CARDIAC BIRTH DEFECTS WHEN TAKEN DURING EARLY PREGNANCY",
        "date": "06022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer defeats appeal over Zoloft "
    },
    {
        "content": "* Pfizer Inc reports 4.7 percent stake in pSivida Corp  as of May 15  2017 - SEC filing",
        "date": "05262017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer reports 4.7 pct stake in pSivida Corp as of May 15 - SEC filing "
    },
    {
        "content": "Pfizer Inc has lost a bid to remove from California state to federal court lawsuits by about 4 800 women who claim they developed diabetes as a result of taking the blockbuster anti-cholesterol drug Lipitor.",
        "date": "05242017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer must face Lipitor injury lawsuits in California state court - judge "
    },
    {
        "content": "* FDA Advisory Committee recommends approval of Pfizer's proposed biosimilar to Epogen®/Procrit® across all indications",
        "date": "05252017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-FDA committee recommends approval of Pfizer's epoetin alfa biosimilar "
    },
    {
        "content": "* Pfizer recommends shareholders reject the below-market mini-tender offer by TRC Capital Corporation",
        "date": "05242017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer recommends shareholders reject below-market mini-tender offer by TRC Capital "
    },
    {
        "content": "* Sees 2017 adjusted earnings of 4.4 bln-4.6 bln euros (Adds analyst  CFO quotes  details on crystals  cancer drug)",
        "date": "05182017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Merck KGaA TV crystals sales decline raises stakes for cancer drug "
    },
    {
        "content": "ZURICH  May 19 Novartis's push to win approval for Zykadia as an initial treatment for a type of lung cancer got a lift on Friday with a positive recommendation from the European Medicines Agency's Committee for Medicinal Products for Human Use (CHMP).",
        "date": "05192017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CHMP backs Novartis's Zykadia for first-line use in lung cancer "
    },
    {
        "content": "A breast cancer drug that Pfizer Inc acquired with its $14 billion purchase of Medivation showed promising anti-tumor activity following prior treatments and a modest ability to hold the disease in check  according to data from a mid-stage study released on Wednesday.",
        "date": "05172017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer drug from Medivation deal shows promise in breast cancer: study "
    },
    {
        "content": "May 17 A breast cancer drug that Pfizer Inc acquired with its $14 billion purchase of Medivation showed promising anti-tumor activity following prior treatments and a modest ability to hold the disease in check  according to data from a mid-stage study released on Wednesday.",
        "date": "05172017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer drug from Medivation deal shows promise in breast cancer -study "
    },
    {
        "content": "* Paulson & Co Inc takes share stake of 3.5 million shares in Dish Network Corp",
        "date": "05152017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Paulson & Co Inc takes share stake in Dish Network  Monsanto "
    },
    {
        "content": "* Pfizer says in connection with Hospira acquisition  expects to incur costs of about $1 billion for up to three-year period post-acquisition-sec filing",
        "date": "05112017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says in connection with Hospira acquisition  expects to incur costs of about $1 bln for up to 3-yr period post-acquisition "
    },
    {
        "content": "* Co  the  Bill & Melinda Gates Foundation  Children's Investment Fund Foundation announced multi-year extension of collaboration",
        "date": "05082017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says multi-year extension of collaboration with Bill & Melinda Gates Foundation  Children's Investment Fund Foundation "
    },
    {
        "content": "NEW YORK  May 10 U.S. drugmaker Pfizer Inc said on Wednesday it reached an agreement with Sangamo Therapeutics Inc for rights to its gene therapy programs to treat the rare blood-clotting disorder hemophilia A  under which Pfizer will pay $70 million upfront.",
        "date": "05102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer strikes deal with Sangamo  broadening hemophilia pipeline "
    },
    {
        "content": "A federal judge has dismissed for a second time a lawsuit against Bristol-Myers Squibb and Pfizer Inc by a man who claimed he suffered severe internal bleeding after taking their blood thinner Eliquis.",
        "date": "05092017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Bristol-Myers  Pfizer beat amended Eliquis case over bleeding risks "
    },
    {
        "content": "May 9 U.S. health regulators on Tuesday granted accelerated approval for Pfizer Inc's immuno-oncology drug Bavencio to treat advanced bladder cancer  marking the second approval in less than two months for the treatment developed along with Germany's Merck KGaA.",
        "date": "05092017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer immuno-oncology drug wins U.S. approval for bladder cancer "
    },
    {
        "content": "* Sangamo Therapeutics and Pfizer announce collaboration for Hemophilia A gene therapy",
        "date": "05102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Sangamo Therapeutics and Pfizer announce collaboration for Hemophilia A gene therapy "
    },
    {
        "content": "May 9 U.S. health regulators on Tuesday granted accelerated approval for Pfizer Inc's immuno-oncology drug Bavencio to treat advanced bladder cancer  marking the second approval in less than two months for the treatment developed along with Germany's Merck KGaA.",
        "date": "05092017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer immuno-oncology drug wins U.S. approval for bladder cancer "
    },
    {
        "content": "PARIS Sanofi is currently looking at several external growth opportunities  after having failed to clinch two large deals recently  but feels it has no urgent need to make acquisitions  the drugmaker's chairman told shareholders on Wednesday.",
        "date": "05102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Sanofi says has no \"absolute need\" to do acquisitions "
    },
    {
        "content": "PARIS Sanofi  is currently looking at several external growth opportunities  after having failed to clinch two large deals recently  but feels it has no urgent need to make acquisitions  the drugmaker's chairman told shareholders on Wednesday.",
        "date": "05102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Sanofi says has no 'absolute need' to do acquisitions "
    },
    {
        "content": "PARIS  May 10 Sanofi is currently looking at several external growth opportunities  after having failed to clinch two large deals recently  but feels it has no urgent need to make acquisitions  the drugmaker's chairman told shareholders on Wednesday.",
        "date": "05102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Sanofi says has no \"absolute need\" to do acquisitions "
    },
    {
        "content": "Pfizer Inc posted basically flat first-quarter earnings  prompting suggestions that the largest U.S. drugmaker needs to do deals in order to improve its growth prospects.",
        "date": "05022017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Prescription for growth at Pfizer? Analysts say  deals "
    },
    {
        "content": "Pfizer Inc  posted basically flat first-quarter earnings  prompting suggestions that the largest U.S. drugmaker needs to do deals in order to improve its growth prospects.",
        "date": "05022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Prescription for growth at Pfizer? Analysts say deals "
    },
    {
        "content": "A New York state appeals court has revived a lawsuit by New York University seeking royalties on sales of Pfizer Inc's cancer drug Xalkori.",
        "date": "05032017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "New York appeals court revives NYU royalty case against Pfizer "
    },
    {
        "content": "May 2 Pfizer Inc posted basically flat first-quarter earnings  prompting suggestions that the largest U.S. drugmaker needs to do deals in order to improve its growth prospects.",
        "date": "05022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 4-Prescription for growth at Pfizer? Analysts say deals "
    },
    {
        "content": "* Pfizer announces U.S. FDA filing acceptance of supplemental new drug application for Xeljanz (tofacitinib citrate) for the treatment of adult patients with active psoriatic arthritis",
        "date": "05032017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces U.S. FDA filing acceptance of supplemental new drug application for Xeljanz "
    },
    {
        "content": "* Q1 earnings per share view $0.67 -- Thomson Reuters I/B/E/S",
        "date": "05022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer Q1 adjusted earnings per share $0.69 "
    },
    {
        "content": "May 2 Drugmaker Pfizer Inc reported a 2.7 percent rise in quarterly profit  helped by higher sales of breast cancer drug Ibrance.",
        "date": "05022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer's quarterly profit rises 2.7 pct "
    },
    {
        "content": "* Declared a 32-cent second-quarter 2017 dividend on company's common stock Source text for Eikon: Further company coverage:",
        "date": "04272017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer Inc declared a 32-cent Q2 2017 dividend on co's common stock "
    },
    {
        "content": "* Insphero announces agreement with Pfizer to develop novel assays for predicting drug-induced liver injury",
        "date": "04272017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-InSphero announces agreement with Pfizer to develop novel assays for predicting drug-induced liver injury "
    },
    {
        "content": "* Aquinnah Pharmaceuticals receives $10 million investment from Pfizer and Abbvie to research breakthrough approach to neurodegenerative disease",
        "date": "04252017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Aquinnah receives $10 mln investment from Pfizer  Abbvie "
    },
    {
        "content": "BOSTON  April 19 Pfizer Inc has received grand jury subpoenas from the U.S. Justice Department in connection with an antitrust investigation focusing on drugmakers that market intravenous saline solutions.",
        "date": "04202017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 3-Pfizer subpoenaed in U.S. intravenous saline solution probe "
    },
    {
        "content": "* EU Medicines Agency recommends approval granting of a marketing authorisation for Sandoz's Rixathon Non-Hodgkin's Lymphoma (NHL)  chronic lymphocytic leukaemia",
        "date": "04212017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-EU Medicines Agency recommendations for April 2017 "
    },
    {
        "content": "* Hitgen and Pfizer enter research collaboration and license agreement to build and screen novel dna-encoded libraries",
        "date": "04182017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Hitgen  Pfizer enter research collaboration and license agreement to build and screen novel DNA-encoded libraries "
    },
    {
        "content": "BOSTON  April 19 Pfizer Inc said on Wednesday that the company had received grand jury subpoenas from the U.S. Justice Department amid an antitrust investigation focused on drugmakers that market intravenous saline solution.",
        "date": "04192017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer receives subpoenas in U.S. intravenous saline solution probe "
    },
    {
        "content": "BOSTON Pfizer Inc has received grand jury subpoenas from the U.S. Justice Department in connection with an antitrust investigation focusing on drugmakers that market intravenous saline solutions.",
        "date": "04192017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer subpoenaed in U.S. intravenous saline solution probe "
    },
    {
        "content": "ZURICH  April 10 Roche's Alecensa kept people with a specific lung cancer alive longer without their disease progressing than Pfizer's Xalkori  the Swiss drugmaker said on Monday  as it seeks to move in on the U.S. company's share of early treatment of the disease.",
        "date": "04102017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Roche's Alecensa notches trial win against Pfizer's Xalkori "
    },
    {
        "content": "Next week  Pfizer Inc will urge the 8th U.S. Circuit Court of Appeals to limit the jurisdiction of a St. Louis  Missouri state court that has become a magnet for mass product liability lawsuits.",
        "date": "03302017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer takes fight over Missouri court's reach to 8th Circuit "
    },
    {
        "content": "* Mylan provides update on meridian medical technologies'  a Pfizer company  expanded voluntary worldwide recall of epipen® auto-injector",
        "date": "03312017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Mylan provides update on Meridian Medical Technologies'  expands voluntary worldwide recall of epipen auto-injector "
    },
    {
        "content": "* First drug approved under Chinese priority review pathway   (Adds further details on drug  executive comment)",
        "date": "03272017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Chinese drug approval boosts AstraZeneca's lung cancer hopes "
    },
    {
        "content": "* Suda enters feasibility agreement with Pfizer Source text for Eikon: Further company coverage:",
        "date": "03292017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Suda enters feasibility agreement with Pfizer "
    },
    {
        "content": "March 23 U.S. health regulators on Thursday approved a drug developed by Merck KGaA and Pfizer Inc  that helps the immune system to fight a rare form of skin cancer once it has spread to other parts of the body.",
        "date": "03232017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "FDA approves Pfizer  German Merck immunotherapy for skin cancer "
    },
    {
        "content": "SAO PAULO U.S. private equity firm Advent International Corp has withdrawn from a bidding process to acquire Pfizer Inc's Brazilian generic drugs joint venture  leaving rival Bain Capital LP as the only contender for the company  two people with direct knowledge of the matter said on Thursday.",
        "date": "03222017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Exclusive: Advent pulls bid for Pfizer's Brazil venture - sources "
    },
    {
        "content": "NEW YORK  March 15 A former partner at a major law firm was convicted on Wednesday of insider trading charges for having tipped a Long Island  New York investment adviser about Pfizer Inc's plan to buy King Pharmaceuticals Inc in 2010.",
        "date": "03152017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "NY jury convicts ex-law firm partner of insider trading on Pfizer-King deal "
    },
    {
        "content": "A former investment adviser at an Oppenheimer Holdings Inc was sentenced to six months' imprisonment Wednesday after he pleaded guilty to insider trading based on information from a childhood friend working at Pfizer Inc.",
        "date": "03162017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Ex-Oppenheimer adviser gets six months in U.S. insider trading case "
    },
    {
        "content": "NEW YORK A former partner at a major law firm was convicted on Wednesday of insider trading charges for having tipped a Long Island  New York investment adviser about Pfizer Inc's plan to buy King Pharmaceuticals Inc in 2010.",
        "date": "03162017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "NY jury convicts ex-law firm partner of insider trading on Pfizer-King deal "
    },
    {
        "content": "ZURICH  March 13 Novartis on Monday won U.S. Food and Drug Administration approval for Kisqali to treat postmenopausal women with a difficult-to-treat form of breast cancer  challenging Pfizer's fast-growing Ibrance.",
        "date": "03132017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Novartis wins FDA approval for breast cancer drug aiming for Pfizer's Ibrance "
    },
    {
        "content": "ZURICH Novartis has won U.S. Food and Drug Administration approval for Kisqali to treat postmenopausal women who have a difficult-to-treat form of breast cancer  challenging U.S. rival Pfizer's Ibrance.",
        "date": "03142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Novartis wins U.S. approval for breast cancer drug; to compete with Pfizer's Ibrance "
    },
    {
        "content": "March 15 A former investment adviser at an Oppenheimer Holdings Inc was sentenced to six months' imprisonment Wednesday after he pleaded guilty to insider trading based on information from a childhood friend working at Pfizer Inc.",
        "date": "03162017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-Ex-Oppenheimer adviser gets six months in U.S. insider trading case "
    },
    {
        "content": "* Consensus forecasts point to sales of $1.5 bln by 2022   (Adds analyst comment  Novartis response  Astex Pharma role)",
        "date": "03142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Novartis wins U.S. approval for breast cancer drug; to compete with Pfizer's Ibrance "
    },
    {
        "content": "* Pfizer announces approval by the China Food and Drug Administration of XELJANZ®  the first oral jak inhibitor for adult patients with moderately to severely active rheumatoid arthritis  Source text for Eikon:  Further company coverage:",
        "date": "03162017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces approval by China FDA of XELJANZ "
    },
    {
        "content": "* Pfizer launches zavicefta (ceftazidime-avibactam) in the U.K. and Germany  a new antibiotic to treat complicated infections caused by gram-negative bacteria",
        "date": "03142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer launches zavicefta in UK  Germany "
    },
    {
        "content": "* Servier and Pfizer announce FDA clearance of IND application for UCART19 in adult relapsed/refractory acute lymphoblastic leukemia",
        "date": "03092017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Servier  Pfizer announce FDA clearance of IND application for UCART19 "
    },
    {
        "content": "* Drug seen as dictating future of pharma business   (Adds study adjustment  shares)",
        "date": "03092017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Development costs to keep Merck KGaA profit flat this year "
    },
    {
        "content": "* Merck and Pfizer announce U.S. Fda and EMA filing acceptances of 3 marketing applications for ertugliflozin-containing medicines for adults with type 2 diabetes",
        "date": "03062017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Merck and pfizer announce U.S. Fda and EMA filing acceptances "
    },
    {
        "content": "LONDON  March 3 (IFR) - Coca-Cola and Pfizer broke new ground in the European corporate market this week  pricing the first above par floating-rate notes as the sector adapts to the deeply negative rates sparked by eurozone monetary policy.",
        "date": "03032017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Corporates break new ground to cope with negative rates "
    },
    {
        "content": "* Spark therapeutics and Pfizer announce that SPK-9001  an investigational hemophilia B medicine  has been granted access to the priority medicines (prime) program by the European Medicines Agency  Source text for Eikon:  Further company coverage:",
        "date": "03012017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Spark Therapeutics  Pfizer say SPK-9001 granted access to priority medicines program "
    },
    {
        "content": "Feb 28 The U.S. Food and Drug Administration said Pfizer Inc's process for manufacturing sterile injectable drugs at a plant in McPherson  Kansas  was \"out of control\" and put patients at risk  according to a warning letter made public on Tuesday.",
        "date": "02282017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 1-FDA warns Pfizer over contaminated drugs at Kansas plant "
    },
    {
        "content": "March 1 A federal appeals court in Manhattan ordered a rare second round of arguments on Wednesday as former SAC Capital Advisors portfolio manager Mathew Martoma tries to overturn his insider trading conviction.",
        "date": "03012017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Rare re-argument ordered in insider trading appeal of SAC's Martoma "
    },
    {
        "content": "Feb 28 The U.S. Food and Drug Administration said Pfizer Inc's process for manufacturing sterile injectable drugs at a plant in McPherson  Kansas was \"out of control\" and put patients at risk  according to a warning letter made public on Tuesday.",
        "date": "02282017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "FDA warns Pfizer over contaminated drugs at Kansas plant "
    },
    {
        "content": "Pfizer Inc said it received subpoenas from the U.S. Attorney's Office for the District of Massachusetts related to its support for organizations that provide financial help to Medicare patients.",
        "date": "02272017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer subpoenaed in U.S. over patient assistance plans "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 01 (Fitch) Fitch Ratings has assigned an 'A+' rating to Pfizer's  senior unsecured Euro notes offering. The net proceeds of the issuance will be  used for general corporate purposes including the repayment of a portion of the  company's commercial paper borrowings. The ratings apply to roughly $42.1 billion of debt outstanding at Dec. 31  2016.  A full list of ratings follows at the end of this release.  KEY RATING DRIVER",
        "date": "03012017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Fitch Rates Pfizer's Euro Notes Offering 'A+'; Outlook Stable "
    },
    {
        "content": "FRANKFURT  Feb 28 German drugmaker Merck KGaA  and U.S. partner Pfizer have been granted priority review status in the United States as they seek to widen the use of immunotherapy drug avelumab to include bladder cancer.",
        "date": "02282017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Merck KGaA  Pfizer get priority review for bladder cancer drug "
    },
    {
        "content": "* Blaylock was also appointed to corporate governance and science and technology committees of Pfizer's board  Source text for Eikon: Further company coverage:",
        "date": "02232017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Ronald Blaylock elected to Pfizer's board of directors "
    },
    {
        "content": "Pfizer Inc said it received subpoenas from the U.S. Attorney's Office for the District of Massachusetts related to its support for organizations that provide financial help to Medicare patients.",
        "date": "02252017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer subpoenaed in U.S. over patient assistance plans "
    },
    {
        "content": "Feb 24 Pfizer Inc said it received subpoenas from the U.S. Attorney's Office for the District of Massachusetts related to its support for organizations that provide financial help to Medicare patients.",
        "date": "02252017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer subpoenaed in U.S. over patient assistance plans "
    },
    {
        "content": "* Pfizer Inc - FDA has set a prescription drug user fee act (PDUFA) target action date of august 27  2017  for Avelumab in this indication",
        "date": "02282017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says FDA accepts Biologics License Application for Avelumab for priority review "
    },
    {
        "content": "* Applied to United Kingdom Listing Authority to cancel standard listing of company's common stock",
        "date": "02222017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer to cancel listing in the United Kingdom "
    },
    {
        "content": "* Said six swiss exchange approved its application to delist its shares from the six swiss exchange  Further company coverage:   (Reporting by Silke Koltrowitz)",
        "date": "02222017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer said SIX swiss exchange approved delisting of its shares "
    },
    {
        "content": "* Momenta Pharmaceuticals announces FDA warning letter to contracted glatopa (glatiramer acetate injection) fill/finish manufacturer",
        "date": "02182017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Momenta Pharmaceuticals announces FDA warning letter to contracted Glatopa "
    },
    {
        "content": "NEW YORK  Feb 17 Managers of BlackRock Inc's  largest mutual fund  fearing Trump administration policies could hurt technology companies with hefty foreign revenue streams  have reshuffled their top holdings  and it appears one of the first casualties is Google.",
        "date": "02172017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BlackRock's largest mutual fund sours on Google "
    },
    {
        "content": "* Pfizer announces top-line results from the oral strategy trial of xeljanz (tofacitinib citrate) compared to humira(adalimumab)",
        "date": "02162017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces top-line results from oral strategy trial of Xeljanz compared to Humira "
    },
    {
        "content": "WASHINGTON U.S. President Donald Trump will meet on Wednesday with the chief executives of eight large retailers  including Target Corp   Best Buy Co Inc  and J.C. Penney Company Inc   to discuss tax reform and infrastructure improvements  according to people with knowledge of the meeting. | Video ",
        "date": "02152017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Exclusive: Retail CEOs to meet Trump in bid to kill U.S. border tax "
    },
    {
        "content": "* Pfizer Inc  reports  16.4 pct stake in ICU Medical Inc as of Feb. 3   Source text: (http://bit.ly/2kpY8il) Further company coverage:",
        "date": "02132017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer Inc reports  16.4 pct stake in ICU Medical "
    },
    {
        "content": "* Paulson & Co ups share stake in Pfizer Inc by 39.8 percent to 352 200 shares - SEC filing",
        "date": "02142017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Paulson & Co ups share stake in Pfizer "
    },
    {
        "content": "* Appaloosa lp  dissolves share stake in bank of america corp",
        "date": "02142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Appaloosa LP dissolves share stake in Citigroup  Bank of America - SEC Filing "
    },
    {
        "content": "WASHINGTON Chief executives of some of America's largest retailers  including Target Corp  and Best Buy Co Inc   are headed to Washington this week to make their case that a controversial tax on imports would raise consumer prices and hurt their businesses  according to people familiar with the plan.",
        "date": "02142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Exclusive: Retail CEOs head to Washington to try to kill U.S. border tax - sources "
    },
    {
        "content": "LONDON  Feb 14 Gilead Sciences has thrown down a challenge to GlaxoSmithKline with good clinical trial results for an experimental HIV drug that works in the same way as the British group's successful dolutegravir.",
        "date": "02142017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Gilead challenges GSK with strong HIV drug data "
    },
    {
        "content": "U.S. biopharmaceutical company Tesaro Inc  is discussing its options with investment banks after receiving acquisition interest from several drugmakers  according to people familiar with the matter.",
        "date": "02082017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Exclusive: Cancer drugmaker Tesaro attracts takeover interest - sources "
    },
    {
        "content": "LONDON  Feb 8 GlaxoSmithKline and Gilead Sciences will vie for business in treating HIV patients next week when both companies unveil clinical trial results at a medical meeting in Seattle.",
        "date": "02082017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "GlaxoSmithKline and Gilead to face off at HIV meeting next week "
    },
    {
        "content": "PARIS France's biggest drugmaker  Sanofi   which missed out to Johnson & Johnson  on buying Actelion  last month  said it was no rush to do deals as it forecast stable or slightly lower 2017 earnings.",
        "date": "02082017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Drugmaker Sanofi in no hurry for deals as signals stable 2017 "
    },
    {
        "content": "PARIS  Feb 8 France's biggest drugmaker  Sanofi   which missed out to Johnson & Johnson on buying Actelion last month  said it was no rush to do deals as it forecast stable or slightly lower 2017 earnings.",
        "date": "02082017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Drugmaker Sanofi in no hurry for deals as signals stable 2017 "
    },
    {
        "content": "* Pfizer inc - accelerated share repurchase assumed in Pfizer's 2017 financial guidance issued on January 31  2017",
        "date": "02032017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer commences $5 billion accelerated share repurchase "
    },
    {
        "content": "* Icu Medical completes the acquisition of Hospira Infusion Systems from Pfizer  Source text for Eikon:  Further company coverage:",
        "date": "02062017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-ICU Medical completes the acquisition of Hospira Infusion Systems from Pfizer "
    },
    {
        "content": "Pfizer Inc  is exploring sale of a group of treatments in cardiology  urology and primary care  Bloomberg reported on Thursday  citing people familiar with the matter.",
        "date": "02022017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer hires JPMorgan to weigh sale of some drugs: Bloomberg "
    },
    {
        "content": "Feb 2 Pfizer Inc is exploring sale of a group of treatments in cardiology  urology and primary care  Bloomberg reported on Thursday  citing people familiar with the matter.",
        "date": "02022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer hires JPMorgan to weigh sale of some drugs - Bloomberg "
    },
    {
        "content": "* Pfizer said to hire JPMorgan to weigh $2 billion portfolio sale - Bloomberg  citing sources",
        "date": "02022017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer said to hire JPMorgan to weigh $2 bln portfolio sale - Bloomberg  citing sources "
    },
    {
        "content": "NEW YORK Pfizer Inc  Chief Executive Ian Read said on Tuesday the company would not change its philosophy on pricing of its medicines or when it takes price increases  bucking a recent trend by some rivals of the largest U.S. drugmaker.",
        "date": "01312017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer CEO says no need to alter its drug pricing practices "
    },
    {
        "content": "NEW YORK  Jan 31 Pfizer Inc Chief Executive Ian Read said on Tuesday the company would not change its philosophy on pricing of its medicines or when it takes price increases  bucking a recent trend by some rivals of the largest U.S. drugmaker.",
        "date": "01312017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 4-Pfizer CEO says no need to alter its drug pricing practices "
    },
    {
        "content": "* Pfizer CEO says M&A focus on opportunities that contribute immediate or near-term revenue growth",
        "date": "01312017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer sees 2017 Prevnar sales flat to slightly down "
    },
    {
        "content": "* Says Q4 revenue was $13.6 billion versus $14.05 billion a year ago",
        "date": "01312017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer Inc reports Q4 reported diluted EPS of $0.13 "
    },
    {
        "content": "* Q4 worldwide Lyrica IH revenue $1 057 million versus $955 million",
        "date": "01312017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer's Q4 Lyrica IH revenue was $1.06 bln vs $955 mln yr ago "
    },
    {
        "content": "Jan 31 Pfizer Inc  which closed its $14 billion acquisition of Medivation Inc in September  reported a 3 percent fall in quarterly revenue  due to a strong dollar and fewer selling days compared to the year-ago quarter.",
        "date": "01312017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer quarterly revenue slips 3 percent "
    },
    {
        "content": "* Pfizer announces positive top-line results from phase 2 study of investigational clostridium difficile vaccine for the prevention of c. Difficile infection",
        "date": "01262017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer reports positive top-line results from phase 2 study of investigational clostridium difficile vaccine "
    },
    {
        "content": "* Pfizer receives positive CHMP opinion in europe for xeljanz\u007f (tofacitinib citrate) for the treatment of moderate to severe active rheumatoid arthritis  Source text for Eikon:  Further company coverage:",
        "date": "01272017",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer receives positive CHMP opinion in Europe for Xeljanz "
    },
    {
        "content": "Jan 24 BlackRock Inc will scrutinize how companies plan to use the cash they bring back to the United States as part of a tax holiday backed by U.S. President Donald Trump  CEO Larry Fink said in a letter distributed on Tuesday.",
        "date": "01242017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-BlackRock to ask if companies spend cash from tax holiday on growth "
    },
    {
        "content": "Jan 24 BlackRock Inc will scrutinize how companies plan to use the cash they bring back to the United States as part of a tax holiday backed by U.S. President Donald Trump  CEO Larry Fink said in a letter distributed on Tuesday.",
        "date": "01242017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BlackRock to ask if companies spend cash from tax holiday on growth "
    },
    {
        "content": "* Investors growing impatient after it fails to land acquisitions",
        "date": "01202017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "INSIGHT-Sanofi's M&A misses frustrate some investors in drugmaker "
    },
    {
        "content": "NEW YORK  Jan 13 BlackRock Inc CEO Larry Fink on Friday criticized a policy backed by U.S. President-elect Donald Trump to entice U.S. companies to bring their swelling overseas cash piles home  saying a tax holiday may do little to boost growth.",
        "date": "01132017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BlackRock CEO says Trump 'tax holiday' may do little for U.S. growth -CNBC "
    },
    {
        "content": "NEW YORK  Jan 12 Investors in large U.S. pharmaceutical and biotech companies are counting on strong dividends  reasonable stock valuations and new products to help ride out a storm of political uncertainty as the incoming Trump administration dives into healthcare policy.",
        "date": "01122017",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Investors in big pharma  biotech look to ride out Trump storm "
    },
    {
        "content": "OPKO Health Inc said its experimental drug for growth hormone deficiency (GHD) in adults failed to provide a statistically significant benefit over a placebo in a late-stage study  sending its shares down about 17 percent on Friday.",
        "date": "12302016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Growth hormone deficiency drug from OPKO and Pfizer fails study "
    },
    {
        "content": "AUSTIN  Texas The number of U.S. executions fell to a quarter-century low in 2016 as new death sentences plummeted  indicating capital punishment is on the decline  a study released on Wednesday showed.",
        "date": "12212016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "U.S. executions hit 25-year low as capital punishment wanes: study "
    },
    {
        "content": "LONDON GlaxoSmithKline's already fast-growing HIV drug business has received an important boost after two major clinical studies successfully tested a new two-drug treatment regimen to control the virus that causes AIDS.",
        "date": "12202016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "GSK's two-drug HIV therapy shines in two big studies "
    },
    {
        "content": "U.S. health regulators on Friday allowed Pfizer Inc to remove a serious warning from the label of its smoking cessation treatment  Chantix  giving a new lease of life to the controversial drug that was approved a decade ago.",
        "date": "12162016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "FDA drops black box warning on Pfizer's anti-smoking drug "
    },
    {
        "content": "A late-stage trial found that continuing treatment with Pfizer Inc's cancer drug Xtandi in addition to a regimen of Zytiga and a steroid worked no better than the two other drugs alone in patients with advanced prostate cancer whose disease had worsened  the company said on Wednesday.",
        "date": "12142016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer's Xtandi fails in progression trial vs. J&J's Zytiga "
    },
    {
        "content": "A Pfizer Inc  ointment to treat mild to moderate cases of the itchy skin condition eczema  or atopic dermatitis  won U.S. approval for use in patients aged two years and older  the Food and Drug Administration said on Wednesday.",
        "date": "12142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "FDA approves Pfizer ointment for chronic itchy skin condition "
    },
    {
        "content": "Pfizer Inc said on Monday its cancer drug  Bosulif  was found superior to Novartis AG's Gleevec in a late-stage study on untreated patients with a form of blood and bone marrow cancer characterized by abnormal white blood cells production.",
        "date": "12052016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer blood cancer drug tops standard therapy for untreated patients "
    },
    {
        "content": "LONDON GlaxoSmithKline said on Monday that Dominique Limet would step down at the end of March 2017 as head of the drugmaker's majority-owned HIV business ViiV Healthcare  to be replaced by GSK insider Deborah Waterhouse.",
        "date": "12052016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "GSK insider Waterhouse to head drugmaker's HIV unit ViiV "
    },
    {
        "content": "Pfizer Inc said on Wednesday its experimental biosimilar of Roche Holding AG's blockbuster breast cancer treatment Herceptin was found comparable with the branded version in a key study.",
        "date": "11302016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer's Herceptin biosimilar succeeds in key breast cancer study "
    },
    {
        "content": "* FDA accepts the biologics license application for Avelumab for the treatment of metastatic merkel cell carcinoma for priority review",
        "date": "11292016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-FDA accepts the Biologics' license application for Avelumab for priority review "
    },
    {
        "content": "FRANKFURT  Nov 29 German drugmaker Merck KGaA  and U.S. partner Pfizer have been granted priority review status in the United States as they seek approval to fight a rare and aggressive form of skin cancer with immunotherapy drug avelumab.",
        "date": "11292016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "German Merck  Pfizer get FDA priority review for cancer drug "
    },
    {
        "content": "Pfizer Inc has sued Texas' health agency  claiming it violated state and federal law by releasing the company's confidential Medicaid rebate information to two state senators.",
        "date": "11192016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer sues Texas health agency for releasing confidential information "
    },
    {
        "content": "* Quintilesims forms new collaboration with Bristol-Myers Squibb  Lilly  Merck Kgaa  Darmstadt  Germany  and Pfizer to generate real world insights on usage of anti-cancer therapies across Europe  Source text for Eikon:  Further company coverage:",
        "date": "11222016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-QuintilesIMS forms new Collaboration with Bristol-Myers Squibb  Lilly  Merck KGaA  Darmstadt  Germany  and Pfizer to generate real world insights on usage of anti-cancer therapies across Europe "
    },
    {
        "content": "* Pfizer announces pricing of tender offer for any and all of its 6.200 pct senior notes due March 15  2019  Source text for Eikon:  Further company coverage:",
        "date": "11182016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces pricing of tender offer for any and all of its 6.200 pct senior notes due March 15  2019 "
    },
    {
        "content": "* Paulson & Co Inc raises share stake in Facebook Inc by 47.3 percent to 212 700 Class A shares",
        "date": "11142016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Paulson & Co cuts share stake in Pfizer  raises share stake in Facebook "
    },
    {
        "content": "NEW YORK  Nov 14 Healthcare stocks  including insurers  have jumped since Donald Trump won the U.S. presidential election last week and some hedge fund managers may see further gains in after making new bets in the sector in the third quarter.",
        "date": "11142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Some hedge funds bet big on health insurers before Trump vote "
    },
    {
        "content": "U.S. stocks closed little changed on Monday after rising dramatically the week before and a decline in the technology sector offset a steep rise in financial stocks as investors bet on higher interest rates. | Video ",
        "date": "11142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Wall Street ends flat as financials' rise offsets tech drop "
    },
    {
        "content": "* Move follows similar by rival drugmaker GSK   (Adds response from MSF  background on pressure)",
        "date": "11112016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer offers cut-price pneumonia shot for humanitarian crises "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 15 (Fitch) Fitch Ratings has assigned an 'A+(EXP)' rating to  Pfizer's senior unsecured notes offering. The net proceeds of the issuance will  be used to fund the purchase of the company's 6.2% notes due March 15  2019. The ratings apply to roughly $42.3 billion of debt outstanding at July 3  2016.  A full list of ratings follows at the end of this release.  KEY RATING DRIVERS Little Leverage Flexibility: Despite Fitch",
        "date": "11152016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Fitch Rates Pfizer's Notes Offering 'A+(exp)'; Outlook Stable "
    },
    {
        "content": "NEW YORK  Nov 14 Healthcare stocks  including insurers  are primed for a shot in the arm from a Trump presidency and some hedge fund managers stand to reap the gains after making new bets in the sector in the third quarter.",
        "date": "11142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Some hedge funds bet big on health insurers before Trump vote "
    },
    {
        "content": "* Pfizer inc - tender offer will expire at 5:00 p.m.  new york city time  on november 18  2016",
        "date": "11142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says announces tender offer "
    },
    {
        "content": "* Pfizer-To collaborate with NCI's center for cancer research to conduct preclinical  clinical trials to evaluate 3 investigational immunotherapy agents",
        "date": "11142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer to collaborate with National Cancer Institute "
    },
    {
        "content": "LONDON  Nov 11 U.S. pharmaceuticals giant Pfizer  is to offer its pneumococcal vaccine at the lowest possible price to non-governmental organisations seeking to protect vulnerable people from illness in humanitarian crises.",
        "date": "11112016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer offers cut-price pneumonia shot for humanitarian crises "
    },
    {
        "content": "LONDON  Nov 15 Two of Europe's biggest drugmakers warned on Tuesday there would be no let up in pressure on U.S. medicine prices after last week's presidential election win for Republican Donald Trump  which sent pharmaceutical and biotech shares soaring.",
        "date": "11152016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Sanofi  GSK expect further price pressure  more M&A under Trump "
    },
    {
        "content": "* Bristol-Myers Squibb and Pfizer to deliver 12 new Eliquis (apixaban) presentations at American Heart Association (AHA) scientific sessions 2016  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Bristol-Myers Squibb and Pfizer to deliver 12 new Eliquis (apixaban) presentations at American Heart Association (AHA) scientific sessions 2016 "
    },
    {
        "content": "* Opal Broaden and Opal beyond met their primary efficacy endpoints",
        "date": "11152016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces results from phase 3 Opal clinical development program investigating Xeljanz "
    },
    {
        "content": "* Pfizer announces major expansion of humanitarian assistance program",
        "date": "11112016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces major expansion of humanitarian assistance program "
    },
    {
        "content": "LONDON Drugmaker AstraZeneca  expects major U.S. healthcare changes after Donald Trump's election victory but its chief executive warned on Thursday that pricing pressures in the world's biggest drugs market would not go away.",
        "date": "11102016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "AstraZeneca sees big healthcare changes under Trump "
    },
    {
        "content": "* Q3 core EPS $1.32 vs consensus 97 cents   (Adds comments by CEO on U.S. market  analyst's comment  updates share price)",
        "date": "11102016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-AstraZeneca sees big healthcare changes under Trump "
    },
    {
        "content": "U.S. drugmaker Pfizer Inc is evaluating a potential sale or spin-off of its consumer health division that could value the unit at as much as $14 billion  people familiar with the matter said on Wednesday.",
        "date": "11092016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Exclusive: Pfizer weighs sale or spin-off of consumer health unit - sources "
    },
    {
        "content": "LONDON  Nov 10 U.S. drugmaker Pfizer  said on Wednesday it had won approval from the European Union for its best-selling breast cancer drug Ibrance  making it the first medicine of its kind to reach the European market.",
        "date": "11102016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer wins EU's approval for Ibrance as Novartis readies rival drug "
    },
    {
        "content": "LONDON  Nov 10 Novartis and Pfizer  have won approval for two cancer drugs to be used routinely on Britain's National Health Service after offering bigger price discounts.",
        "date": "11102016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Novartis  Pfizer cut prices to win UK approval for cancer drugs "
    },
    {
        "content": "* Pfizer to present additional research for XELJANZ\u007f (tofacitinib citrate) in rheumatologic diseases  including rheumatoid arthritis and psoriatic arthritis  Source text for Eikon:  Further company coverage:",
        "date": "11072016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer to present additional research for XELJANZ in rheumatologic diseases "
    },
    {
        "content": "* Regeneron CEO says it is \"early for us to comment on the expected timeline for potential sarilumab approval\": conf call",
        "date": "11042016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Regeneron CEO says Eylea rivals offering discounts  rebates: conf call "
    },
    {
        "content": "* Spark Therapeutics Inc - first seven participants did not need infusions of factor ix concentrates to prevent bleeding",
        "date": "11032016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Spark Therapeutics and Pfizer report updated data from hemophilia b phase 1/2 trial "
    },
    {
        "content": "* Pfizer received approval from chinese fda to market its pneumococcal 13-valent conjugate vaccine  prevenar 13 in china",
        "date": "11022016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer's says Prevenar 13 receives approval for use in in China "
    },
    {
        "content": "Nov 2 Allergan Plc reported a 4.4 percent rise in quarterly revenue  lifted by higher demand for key products such as Botox and Restatis eye drops  and the company expanded its share buyback program by $5 billion to $15 billion.",
        "date": "11022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Allergan revenue rises 4.4 pct; company expands buyback "
    },
    {
        "content": "SHANGHAI Chinese regulators have approved Pfizer Inc's blockbuster vaccine Prevenar 13  the U.S. drugmaker said on Wednesday  a breakthrough for the firm after it was forced to shut its vaccine business in China last year.",
        "date": "11022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "China approves Pfizer vaccine Prevenar "
    },
    {
        "content": "* Breakthrough after being forced to shut China vaccine business",
        "date": "11022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-China approves Pfizer vaccine Prevenar "
    },
    {
        "content": "SHANGHAI  Nov 2 Chinese regulators have approved Pfizer Inc's blockbuster vaccine Prevenar 13  the U.S. drugmaker said in a statement on Wednesday  a breakthrough for the firm after it was forced to shut its vaccine business in China last year.",
        "date": "11022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer vaccine Prevenar gains approval in China "
    },
    {
        "content": "Pfizer Inc  scrapped its high-profile cholesterol fighter after its effectiveness waned over time in large clinical trials  sending its shares 2 percent lower and prompting the company to trim its 2016 earnings forecast. | Video ",
        "date": "11012016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer cholesterol drug fizzles  hitting shares "
    },
    {
        "content": "Nov 1 Pfizer Inc scrapped its high-profile cholesterol fighter after its effectiveness waned over time in large clinical trials  sending its shares 2 percent lower and prompting the company to trim its 2016 earnings forecast.",
        "date": "11012016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 4-Pfizer cholesterol drug fizzles  hitting shares "
    },
    {
        "content": "* Q3 worldwide prevnar/prevenar 13 revenue $1 536 million versus $1 576 million last year",
        "date": "11012016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer Q3 worldwide Ibrance revenue $550 mln vs.$230 mln last year "
    },
    {
        "content": "* Narrows certain 2016 financial guidance ranges and incorporates impact of decision to discontinue global development of bococizumab",
        "date": "11012016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer Q3 adjusted EPS $0.61 "
    },
    {
        "content": "* Pfizer discontinues global development of Bococizumab  its investigational pcsk9 inhibitor",
        "date": "11012016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer discontinues global development of Bococizumab  its investigational pcsk9 inhibitor "
    },
    {
        "content": "Nov 1 Pfizer Inc  the largest U.S. drugmaker  reported a 38 percent fall in quarterly net income on Tuesday  largely due to an impairment charge related to the pending sale of its Hospira infusion therapy business.",
        "date": "11012016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer quarterly profit falls 38 pct "
    },
    {
        "content": "ZURICH The U.S. Food and Drug Administration gave fast-track review status to Novartis's medication ribociclib in first-line treatment of postmenopausal women with advanced breast cancer as the Swiss company seeks to challenge Pfizer's Ibrance drug.",
        "date": "11012016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Novartis breast cancer drug gets FDA fast track  takes on Pfizer "
    },
    {
        "content": "Bristol-Myers Squibb Co   whose high-profile Opdivo immunotherapy failed an important lung-cancer trial last summer  sharply raised its 2016 profit forecast after strong quarterly sales of other leading medicines.",
        "date": "10272016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Bristol hikes 2016 profit forecast as top drugs deliver  shares jump "
    },
    {
        "content": "ZURICH  Nov 1 The U.S. Food and Drug Administration gave fast-track review status to Novartis's  medication ribociclib in first-line treatment of postmenopausal women with advanced breast cancer as the Swiss company seeks to challenge Pfizer's Ibrance drug.",
        "date": "11012016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Novartis breast cancer drug gets FDA fast track  takes on Pfizer "
    },
    {
        "content": "* Debiopharm International SA announces clinical collaboration with Merck KGaA  Darmstadt  Germany  and Pfizer in cancer immunotherapy",
        "date": "10202016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Debiopharm reports clinical collaboration with Merck KGaA and Pfizer "
    },
    {
        "content": "NEW YORK A former investment adviser at an Oppenheimer Holdings Inc unit pleaded guilty on Tuesday to charges that he engaged in an insider trading scheme based on information supplied by a childhood friend working at Pfizer Inc.",
        "date": "10252016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Ex-Oppenheimer adviser pleads guilty to U.S. insider trading charges "
    },
    {
        "content": "SAO PAULO  Oct 21 Bain Capital LP  Advent International Corp and Torrent Capital Investment Corp are on a shortlist of suitors for a Brazilian generic drug making joint-venture in which Pfizer Inc has a 40 percent stake  two people with direct knowledge of the situation said on Friday.",
        "date": "10212016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Advent  Bain gain edge in bid for Pfizer's Brazil venture -sources "
    },
    {
        "content": "NEW YORK  Oct 25 A former investment adviser at an Oppenheimer Holdings Inc unit pleaded guilty on Tuesday to charges that he engaged in an insider trading scheme based on information supplied by a childhood friend working at Pfizer Inc.",
        "date": "10252016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Ex-Oppenheimer adviser pleads guilty to U.S. insider trading charges "
    },
    {
        "content": "NEW YORK  Oct 25 A former investment adviser at an Oppenheimer Holdings Inc unit plans to plead guilty on Tuesday to charges that he traded on inside information supplied by a childhood friend working at Pfizer Inc  according to his lawyer.",
        "date": "10252016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Ex-Oppenheimer adviser to plead guilty in U.S. to insider trading "
    },
    {
        "content": "* CDC Advisory Committee on Immunization Practices votes to recommend new dosing schedule for vaccination with trumenba\u007f (meningococcal Group B vaccine)",
        "date": "10192016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-CDC's ACIP votes to recommend new dosing schedule for vaccination with Pfizer's trumenba "
    },
    {
        "content": "* Pfizer awarded grant to evaluate vaccine to protect newborns against Group B Streptococcus Infection",
        "date": "10192016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer awarded grant to evaluate vaccine for newborns "
    },
    {
        "content": "Booming pharmaceutical sales drove strong quarterly results for Johnson & Johnson   but the company's shares fell more than 2 percent on worries that its blockbuster Remicade arthritis drug would soon face cheaper competition.",
        "date": "10182016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "J&J shares lose ground on fears of Pfizer's answer to Remicade "
    },
    {
        "content": "* U.S. Remicade sales rise 9.4 pct   (Adds analyst comments  updates shares)",
        "date": "10182016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 4-J&J shares lose ground on fears of Pfizer's answer to Remicade "
    },
    {
        "content": "* U.S. Remicade sales rise 9.4 pct   (Adds CFO comment  context on Remicade patent battle with Pfizer)",
        "date": "10182016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-J&J says pharma future bright  despite threat to Remicade "
    },
    {
        "content": "* Futures up: Dow 98 pts  S&P 14.5 pts  Nasdaq 37.25 pts   (Adds details  comments  updates prices)",
        "date": "10182016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St set to open higher on Goldman  Netflix results "
    },
    {
        "content": "Pfizer Inc  said on Monday it will begin shipping its biosimilar version of Johnson & Johnson's  blockbuster rheumatoid arthritis drug Remicade in late November at a 15 percent discount to current wholesale prices.",
        "date": "10172016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer to start shipping biosimilar version of J&J's Remicade in November "
    },
    {
        "content": "* ICU Medical - Termination rights in connection of Hospira infusion systems deal include payment of $75 million from Pfizer under some conditions- SEC filing  Source: (http://bit.ly/2e5kmnK) Further company coverage:",
        "date": "10132016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Icu Medical says termination rights in connection of Hospira deal include payment of $75 mln from Pfizer "
    },
    {
        "content": "Oct 17 Pfizer Inc said on Monday it will begin shipping its biosimilar version of Johnson & Johnson's  blockbuster rheumatoid arthritis drug Remicade in late November at a 15 percent discount to current wholesale prices.",
        "date": "10172016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Pfizer to start shipping biosimilar version of J&J's Remicade in November "
    },
    {
        "content": "WASHINGTON  Oct 13 The Obama administration  in its latest bid to prevent American companies from minimizing U.S. taxes by rebasing abroad  issued final rules on Thursday to combat a key tax-reduction technique known as earnings stripping.",
        "date": "10132016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-U.S. targets corporate tax-reduction strategy with new regulation "
    },
    {
        "content": "LONDON  Oct 13 Pfizer suffered a setback in Britain on Thursday when the Court of Appeal in London ruled against it in a patent case over the use of its $5 billion-a-year drug Lyrica for pain relief.",
        "date": "10132016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer loses appeal in UK patent case over use of Lyrica drug for pain "
    },
    {
        "content": "Oct 17 Pfizer Inc said on Monday it plans to begin shipping its biosimilar version of Johnson & Johnson's blockbuster rheumatoid arthritis drug Remicade in late November at a 15 percent discount to current wholesale prices.",
        "date": "10172016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer set to start shipping Remicade biosimilar next month "
    },
    {
        "content": "LONDON  Oct 13 Pfizer suffered a setback in Britain on Thursday when the Court of Appeal in London ruled against it in a patent case over the use of its $5 billion-a-year drug Lyrica for pain relief.",
        "date": "10132016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer loses appeal in UK patent case over use of Lyrica drug for pain "
    },
    {
        "content": "* Transgene announces collaboration with Merck KGaA  Darmstadt  Germany  and Pfizer to evaluate the combination of TG4001 with Avelumab in HPV-positive head & neck cancer in a phase 1/2 study",
        "date": "10112016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Transgene announces collaboration with Merck KGaA  Darmstadt  Germany and Pfizer to evaluate the combination of TG4001 with Avelumab "
    },
    {
        "content": "* Press release - first positive phase 3 results in adjuvant setting for renal cell carcinoma show sutent (sunitinib) extended disease free survival after surgical removal",
        "date": "10102016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces results from Phase 3 S-TRAC clinical trial "
    },
    {
        "content": "* Study leader says both drugs show very similar results   (Adds further comment from study leader  more on sales prospects)",
        "date": "10082016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 1-Novartis challenges Pfizer with strong breast cancer drug data "
    },
    {
        "content": "COPENHAGEN  Oct 8 An experimental Novartis  pill given with an older drug kept advanced breast cancer in check far longer than standard treatment alone  putting it on track to challenge Pfizer's blockbuster Ibrance  data showed on Saturday.",
        "date": "10082016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Novartis challenges Pfizer with strong breast cancer drug data "
    },
    {
        "content": "* Amendment extends term of agreement from its prior termination date of December 31  2017 to December 31  2020 - SEC filing",
        "date": "10042016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Theravance Biopharma's unit enters into fourth amendment with Pfizer "
    },
    {
        "content": "Pfizer Inc  the largest U.S. drugmaker  said on Thursday it aims to sell its world headquarters buildings in midtown Manhattan by the end of 2017 and begin moving into more modern facilities in Manhattan no sooner than the first half of 2019.",
        "date": "10062016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer to seek more modern headquarters in Manhattan "
    },
    {
        "content": "Oct 6 Pfizer Inc  the largest U.S. drugmaker  said on Thursday it aims to sell its world headquarters buildings in midtown Manhattan by the end of 2017 and begin moving into more modern facilities in Manhattan no sooner than the first half of 2019.",
        "date": "10062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Pfizer to seek more modern headquarters in Manhattan "
    },
    {
        "content": "Pfizer Inc said on Thursday it would sell its global infusion therapy business to ICU Medical Inc for $1 billion in cash and stock that will give it a major stake in the smaller company.",
        "date": "10062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to sell infusion business to ICU Medical  take stake "
    },
    {
        "content": "Oct 6 Pfizer Inc said on Thursday it would sell its global infusion therapy business to ICU Medical Inc for $1 billion in cash and stock that will give it a major stake in the smaller company.",
        "date": "10062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 4-Pfizer to sell infusion business to ICU Medical  take stake "
    },
    {
        "content": "* Pfizer to sell NYC HQ by end of 2017  majority of employees to remain in Manhattan and will seek new building in NYC no sooner than 2019 - CNBC  citing DJ    Source text: http://bit.ly/2cUOZQ3",
        "date": "10062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer to sell NYC HQ by end of 2017 - CNBC  citing DJ "
    },
    {
        "content": "Oct 6 Medical device maker ICU Medical Inc  said it would buy Pfizer Inc's global infusion therapy business  Hospira Infusion Systems (HIS)  for $1 billion in cash and stock.",
        "date": "10062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "ICU Medical to buy Pfizer's infusion therapy business for $1 bln "
    },
    {
        "content": "* ICU Medical Inc to acquire the Hospira Infusion Systems business from Pfizer Inc for $1 billion in cash and stock",
        "date": "10062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-ICU Medical to buy Hospira Infusion Systems business from Pfizer for $1 bln in cash  stock "
    },
    {
        "content": "* Completes acquisition of Medivation  Source text for Eikon:  Further company coverage:",
        "date": "09282016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer completes acquisition of Medivation "
    },
    {
        "content": "NEW YORK Pfizer Inc   which was considering splitting itself for more than two years  said on Monday it would not do so  prompting shareholders to expect more deals that could bolster its roster of new medicines. | Video ",
        "date": "09272016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer decides against split-up; more deals seen likely "
    },
    {
        "content": "* Pfizer to showcase progress of broad-based oncology portfolio at European Society for Medical Oncology (ESMO) 2016 Congress",
        "date": "09282016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer to showcase progress of broad-based oncology portfolio at ESMO 2016 Congress "
    },
    {
        "content": "* Fitch: Pfizer's scrapped split decision won't affect ratings  Source text for Eikon:  Further company coverage:",
        "date": "09272016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Fitch says Pfizer's scrapped split decision will not affect ratings "
    },
    {
        "content": "NEW YORK  Sept 26 Pfizer Inc  which was considering splitting itself for more than two years  said on Monday it would not do so  prompting shareholders to expect more deals that could bolster its roster of new medicines.",
        "date": "09262016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 4-Pfizer decides against split-up; more deals seen likely "
    },
    {
        "content": "* Moody's affirms Pfizer's ratings; changes outlook to stable",
        "date": "09262016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Moody's changes outlook on Pfizer's to stable from negative  affirms ratings "
    },
    {
        "content": "* Pfizer announces expiration of Hart-Scott-Rodino waiting period for proposed acquisition of medivation",
        "date": "09232016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces expiration of Hart-Scott-Rodino waiting period for acquisition of medivation "
    },
    {
        "content": "U.S. drugmaker Pfizer Inc  which has been considering a split into two companies for more than two years  said on Monday it would not do so because the move would not create any shareholder value.",
        "date": "09262016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer abandons plan to split into two companies "
    },
    {
        "content": "* Indexes down: Dow 0.56 pct  S&P 0.46 pct  Nasdaq 0.61 pct   (Adds details  comments  updates prices)",
        "date": "09262016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St drops as Pfizer falls; presidential debate eyed "
    },
    {
        "content": "Sept 26 U.S. drugmaker Pfizer Inc said on Monday it had decided not to separate into two publicly traded companies at this time.",
        "date": "09262016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer says not to split into two "
    },
    {
        "content": "* Company to continue to operate as one company with two distinct and complementary businesses",
        "date": "09262016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says it will not pursue splitting into two separate publicly traded companies "
    },
    {
        "content": "* Pfizer declares 30-cent fourth-quarter 2016 dividend  Source text for Eikon:  Further company coverage:",
        "date": "09222016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer declares 30-cent fourth-quarter 2016 dividend "
    },
    {
        "content": "Allergan Plc  CEO Brent Saunders calls them \"stepping stones\" - small  bolt-on acquisitions  as opposed to the mega-deals common in the drug industry. And they're expected to boost dealmaking in sectors ranging from neurology to skin care.",
        "date": "09202016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Allergan pays top dollar for 'stepping stones' from neurology to dermatology "
    },
    {
        "content": "* Results confirm similar efficacy of PF-06438179 (Infliximab-pfizer) to Remicade(REG) (Infliximab)  in combination with Methotrexate",
        "date": "09162016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer reports positive top-line results from reflections B537-02 study for PF-06438179 "
    },
    {
        "content": "U.S. drugmaker Pfizer Inc's breast cancer drug  Ibrance  should be given marketing approval  an advisory committee at the European Medicines Agency recommended.",
        "date": "09162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "EMA panel recommends nod for Pfizer's breast cancer drug "
    },
    {
        "content": "Sept 16 U.S. drugmaker Pfizer Inc's  breast cancer drug  Ibrance  should be given marketing approval  an advisory committee at the European Medicines Agency recommended.",
        "date": "09162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-EMA panel recommends nod for Pfizer's breast cancer drug "
    },
    {
        "content": "* Oncoimmune announces option and license agreement with Pfizer Inc.",
        "date": "09152016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Oncoimmune announces option and license agreement with Pfizer Inc "
    },
    {
        "content": "Sept 16 U.S. drugmaker Pfizer Inc's  breast cancer drug  Ibrance  should be given marketing approval  an advisory committee at the European Medicines Agency recommended.",
        "date": "09162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "EMA advisory panel recommends nod for Pfizer's breast cancer drug "
    },
    {
        "content": "* Merck and pfizer announce investigational Ertugliflozin met primary endpoint of A1C reduction when added to Sitagliptin and Metformin in people with type 2 diabetes",
        "date": "09152016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Merck  Pfizer say investigational Ertugliflozin met primary endpoint "
    },
    {
        "content": "* Says on Sept 7  Pfizer and Medivation filed premerger notification and report form with FTC and antitrust division - SEC filing",
        "date": "09092016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Medivation and Pfizer file premerger notification "
    },
    {
        "content": "Pfizer Inc's chief executive on Thursday said recent proposals by Democratic presidential candidate Hillary Clinton to curb \"unjustified\" U.S. drug prices would dampen investment in innovative new drugs and ultimately hurt consumers.",
        "date": "09082016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer CEO says Clinton plan to curb drug prices would hurt consumers "
    },
    {
        "content": "Sept 8 Pfizer Inc's chief executive on Thursday said recent proposals by Democratic presidential candidate Hillary Clinton to curb \"unjustified\" U.S. drug prices would dampen investment in innovative new drugs and ultimately hurt consumers.",
        "date": "09082016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer CEO says Clinton plan to curb drug prices would hurt consumers "
    },
    {
        "content": "* Antolrx  Inc. announces Series A equity funding from Pfizer  JDRF and Orion Equity Partners  LLC to develop targeted Nanoparticle Tolerance Therapeutics",
        "date": "09082016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Antolrx announces series a equity funding from Pfizer  JDRF and Orion Equity Partners "
    },
    {
        "content": "Pfizer Inc's  trial data on Chantix  a drug to help people quit smoking  failed to impress U.S. Food and Drug Administration scientists  in a blow to the company's attempts to have a serious warning removed from the drug's label.",
        "date": "09122016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "FDA staff flags concerns about Pfizer's quit-smoking drug study "
    },
    {
        "content": "Sept 12 Pfizer Inc's trial data on Chantix  a drug to help people quit smoking  failed to impress U.S. Food and Drug Administration scientists  in a blow to the company's attempts to have a serious warning removed from the drug's label.",
        "date": "09122016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-FDA staff flags concerns about Pfizer's quit-smoking drug study "
    },
    {
        "content": "* Pfizer appoints chief scientific officer for Neuroscience Research",
        "date": "09072016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer appoints Chief Scientific Officer for Neuroscience Research "
    },
    {
        "content": "Generic drugmaker Actavis Inc is asking a federal court to invalidate four Tris Pharma Inc patents on the attention deficit hyperactivity disorder drug Quillichew ER  sold by Tris partner Pfizer Inc.",
        "date": "09072016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Actavis seeks to invalidate Tris patents on chewable ADHD drug "
    },
    {
        "content": "* Entered into first amendment to license agreement between Clovis and Pfizer  Inc.",
        "date": "08302016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Clovis enters into first amendment to license agreement between Clovis and pfizer "
    },
    {
        "content": "LONDON Pharmaceutical company AstraZeneca  has agreed to sell its small molecule antibiotics business to Pfizer Inc  in a deal that could be valued at more than $1.5 billion. | Video ",
        "date": "08242016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer to buy antibiotics business from AstraZeneca "
    },
    {
        "content": "* Says deal fits strategy of focusing on cancer and other areas",
        "date": "08242016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer to buy antibiotics business from AstraZeneca "
    },
    {
        "content": "LONDON  Aug 24 Pharmaceutical company AstraZeneca said it had agreed to sell its small molecule antibiotics business to Pfizer in a deal that could reach more than $1.5 billion.",
        "date": "08242016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "AstraZeneca to sell antibiotics business to Pfizer "
    },
    {
        "content": "Aug 21 Pfizer Inc is in advanced talks to acquire U.S. cancer drug company Medivation Inc for close to $14 billion  as it seeks to boost its oncology portfolio  people familiar with the matter said on Sunday.",
        "date": "08212016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer nears deal to acquire Medivation for close to $14 bln -sources "
    },
    {
        "content": "Aug 21 Pfizer Inc is in advanced talks to acquire U.S. cancer drug company Medivation Inc for close to $14 billion  as it seeks to boost its oncology portfolio  a person familiar with the matter said on Sunday.",
        "date": "08212016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer nears $14 billion deal for Medivation-source "
    },
    {
        "content": "* FDA approves TROXYCA\u007f ER (oxycodone hydrochloride and naltrexone hydrochloride) extended-release CAPSULES CII with abuse-deterrent properties for the management of pain  Source text for Eikon:  Further company coverage:",
        "date": "08192016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-FDA approves Pfizer's TROXYCA ER extended-release capsules CII for pain management "
    },
    {
        "content": "Pfizer Inc   beating out numerous other bidders  said it agreed to buy U.S. cancer drug company Medivation Inc  for $14 billion in cash  adding its blockbuster prostate cancer drug Xtandi to the company's growing oncology roster. | Video ",
        "date": "08222016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer boosts cancer drug roster with $14 billion Medivation deal "
    },
    {
        "content": "* Futures down: Dow 34 pts  S&P 3.25 pts  Nasdaq 6.25 pts   (Adds details  comments  updates prices)",
        "date": "08222016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St set to open lower as oil prices drop "
    },
    {
        "content": "* Upon termination  Medivation will pay Pfizer a termination fee of $510 million  Source text: (http://bit.ly/2bbItyC) Further company coverage:",
        "date": "08222016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Medivation to pay fee of $510 mln  upon Pfizer deal termination "
    },
    {
        "content": "PARIS  Aug 22 French pharmaceutical group Sanofi  reacted to Pfizer's roughly $14 billion cash deal for Medivation Inc by saying it had appreciated the chance to engage in talks with Medivation in past weeks.",
        "date": "08222016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Sanofi says talked with Medivation  but will be \"disciplined\" acquirer "
    },
    {
        "content": "Aug 22 U.S. stock index futures were lower on Monday as oil prices fell the most in four weeks and dollar strengthened in anticipation of an interest rate increase this year.",
        "date": "08222016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Futures lower as oil prices drop "
    },
    {
        "content": "* Medivation agrees to transaction valued at $81.50 per Medivation share in cash  for a total enterprise value of approximately $14 billion",
        "date": "08222016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer to acquire Medivation for about $14 bln "
    },
    {
        "content": "Aug 22 Pfizer Inc said it would buy U.S. cancer drug company Medivation Inc in a deal valued at about $14 billion to boost its oncology portfolio.",
        "date": "08222016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to buy Medivation in $14 bln deal "
    },
    {
        "content": "Johnson & Johnson said a U.S. court had held its patent for autoimmune drug Remicade invalid  ruling in favor of two companies seeking to bring a cheaper version of the blockbuster drug to market.",
        "date": "08172016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "J&J says court finds Remicade patent invalid "
    },
    {
        "content": "A federal appeals court has upheld a patent on Pfizer Inc's antibiotic Tygacil against a challenge by generic drugmaker Apotex Inc  which has sought approval to make a generic version of the drug.",
        "date": "08162016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Circuit rejects Apotex challenge to Pfizer antibiotic patent "
    },
    {
        "content": "* Appaloosa LP cuts share stake in general motors by 41.7 percent to 1.4 million shares",
        "date": "08122016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Appaloosa LP dissolves share stake in Pfizer  United Rentals - SEC FILING "
    },
    {
        "content": "A former partner at Hunton & Williams indicted this week on charges that he engaged in an insider trading scheme ahead of a 2010 deal involving Pfizer Inc said he did nothing wrong and plans to fight the charges.",
        "date": "08122016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Ex-Hunton & Williams partner denies role in insider trading scheme "
    },
    {
        "content": "* As of July 3  aggregate notional amount of foreign exchange derivative financial instruments hedging or offsetting foreign currency exposures was $31.5 billion  Source: (http://bit.ly/2aNiKMq ) Further company coverage:",
        "date": "08112016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says as of July 3 offsetting foreign currency exposures was $31.5 bln "
    },
    {
        "content": "NEW YORK A Long Island investment adviser and a former partner at a major law firm have been indicted on charges that they engaged in insider trading ahead of Pfizer Inc's acquisition of King Pharmaceuticals Inc in 2010  prosecutors said on Wednesday.",
        "date": "08102016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "N.Y. investment adviser  lawyer indicted for insider trading "
    },
    {
        "content": "* Paulson & co inc  cuts share stake in pfizer inc by 63% to 0.51 million shares",
        "date": "08152016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Paulson & Co cuts stake in Pfizer "
    },
    {
        "content": "* Jana Partners takes sole share stake of 4.1 million shares in Hewlett Packard Enterprise Co - SEC filing",
        "date": "08152016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Jana Partners dissolves sole share stake in Pfizer  NXP Semiconductors "
    },
    {
        "content": "WASHINGTON  Aug 4 A U.S. advisory panel on Thursday recommended approval of Egalet Corp's  long-acting opioid painkiller  Arymo ER  saying it dulls pain and could deter abuse by addicts seeking a quick high.",
        "date": "08042016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 1-U.S. panel backs approval of Egalet's abuse-resistant painkiller "
    },
    {
        "content": "Pfizer Inc  reported better-than-expected quarterly results  driven by lower taxes and sales of generic medicines  but revenue from its branded patent-protected medicines brought disappointment.",
        "date": "08022016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer beats estimates  but branded drugs disappoint "
    },
    {
        "content": "Aug 2 Pfizer Inc reported better-than-expected quarterly results  driven by lower taxes and sales of generic medicines  but revenue from its branded patent-protected medicines brought disappointment.",
        "date": "08022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 5-Pfizer beats estimates  but branded drugs disappoint "
    },
    {
        "content": "NEW YORK Pfizer Inc  on Tuesday said it has reached a $486 million settlement of litigation accusing it of causing big losses for shareholders by concealing safety risks associated with its Celebrex and Bextra pain-relieving drugs. | Video ",
        "date": "08022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer in $486 million settlement of Celebrex  Bextra litigation "
    },
    {
        "content": "* Sanofi  Pfizer  Gilead & Celgene interested in Medivation as company asks for indications of interest by mid-August - CNBC citing sources   Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07292016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Sanofi  Pfizer  Gilead & Celgene interested in Medivation - CNBC citing sources "
    },
    {
        "content": "NEW YORK  Aug 2 Pfizer Inc on Tuesday said it has reached a $486 million settlement of litigation accusing it of causing big losses for shareholders by concealing safety risks associated with its Celebrex and Bextra pain-relieving drugs.",
        "date": "08022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer in $486 mln settlement of Celebrex  Bextra litigation "
    },
    {
        "content": "NEW YORK  Aug 2 Pfizer Inc on Tuesday said it has reached a $486 million settlement of litigation accusing it of causing big losses for shareholders by concealing safety risks associated with its Celebrex and Bextra pain-relieving drugs.",
        "date": "08022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Pfizer in $486 mln settlement of Celebrex  Bextra litigation "
    },
    {
        "content": "* Says amendment to increase the purchase price of the acquisition to $40 million",
        "date": "07282016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Bind Therapeutics says it entered into an asset purchase agreement with Pfizer "
    },
    {
        "content": "FRANKFURT Bayer   the German drugmaker trying to acquire U.S. seed company Monsanto   surpassed second-quarter earnings expectations and raised its guidance for the year as strong gains in stroke prevention pill Xarelto offset sluggish farming pesticides markets.",
        "date": "07272016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Bayer drugs secure earnings beat  offset weak crop chems "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.23 pct  Nasdaq 0.33 pct   (Updates to open)",
        "date": "08022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St opens lower; Pfizer weighs on Dow "
    },
    {
        "content": "* Plans to disclose additional terms of its agreement with Pfizer upon court approval.",
        "date": "07262016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Bind Therapeutics determines Pfizer's $40 mln bid highest "
    },
    {
        "content": "* No new or unexpected safety findings for Tofacitinib were observed in study",
        "date": "07282016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces positive top-line results from Phase 3 Maintenance Trial of Oral XELJANZ "
    },
    {
        "content": "* Pfizer and Western Oncolytics announce immuno-oncology research collaboration to investigate novel oncolytic virus technology",
        "date": "07282016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer and Western Oncolytics announce immuno-oncology research collaboration "
    },
    {
        "content": "* Shares seen up 0.7 pct in premarket trades   (Adds details on Xarelto  Eylea  Crop Chemicals unit  background on Monsanto)",
        "date": "07272016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Bayer drugs secure earnings beat  offset weak crop chems "
    },
    {
        "content": "Aug 2 Pfizer Inc on Tuesday said it has reached a $486 million settlement of nationwide litigation relating to its Celebrex and Bextra pain-relieving drugs.",
        "date": "08022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer reaches $486 mln settlement of Celebrex  Bextra litigation "
    },
    {
        "content": "SAO PAULO Teva Pharmaceutical Industries Ltd and Mylan NV have shown preliminary interest in a Brazilian generic drugmaking joint-venture in which Pfizer Inc has a 40 percent stake  two people familiar with the process said.",
        "date": "07262016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Exclusive: Teva  Mylan eye Pfizer's Brazil venture  sources say "
    },
    {
        "content": "LONDON Generic competition to cholesterol buster Crestor in the U.S. market pushed second-quarter core earnings down by nearly a third at drugmaker AstraZeneca  which is now banking on new cancer medicines to revive its fortunes.",
        "date": "07282016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "AstraZeneca helped by new drugs as cholesterol pill fades "
    },
    {
        "content": "* New drug Tagrisso sold better-than-expected $92 mln in Q2   (Adds CEO comments on upcoming clinical data and M&A)",
        "date": "07282016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-AstraZeneca helped by new drugs as cholesterol pill fades "
    },
    {
        "content": "* Spark Therapeutics and Pfizer announce updated data from first cohort in Hemophilia B phase 1/2 trial demonstrating consistent  sustained therapeutic levels of factor ix activity",
        "date": "07252016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Spark Therapeutics and Pfizer announce data from first cohort in Hemophilia B Phase 1/2 trial "
    },
    {
        "content": "Aug 2 Pfizer Inc's quarterly revenue rose about 11 percent  driven by sales of newer drugs and the acquisition of hospital products company Hospira last year.",
        "date": "08022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer revenue rises 11 percent "
    },
    {
        "content": "LONDON  July 28 AstraZeneca declined to comment on Thursday on whether the drugmaker could become a takeover target once more  two years after it saw off a bid from Pfizer.",
        "date": "07282016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "AstraZeneca a takeover target again? CEO not commenting "
    },
    {
        "content": "* Bids are in addition to pfizer inc.'s initial stalking horse bid of approximately $20 million under section 363 of u.s. Bankruptcy code",
        "date": "07252016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Bind Therapeutics says two bidders join Pfizer's stalking horse bid "
    },
    {
        "content": "* Pfizer receives world health organization prequalification for multi-dose vial presentation of Prevenar 13",
        "date": "07192016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer gets WHO prequalification for multi-dose vial presentation of Prevenar 13 "
    },
    {
        "content": "July 19 Some of the world's largest drug companies are taking out their checkbooks for acquisitions of smaller peers whose cancer drugs have the potential to cure not just patients  but corporate growth prospects as well.",
        "date": "07192016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "DEALTALK-Old pharma sees new profit cure in cancer drugs "
    },
    {
        "content": "Some of the world's largest drug companies are taking out their checkbooks for acquisitions of smaller peers whose cancer drugs have the potential to cure not just patients  but corporate growth prospects as well.",
        "date": "07192016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Old pharma sees new profit cure in cancer drugs "
    },
    {
        "content": "TOKYO/LONDON Japan's SoftBank  will buy Britain's most valuable technology company ARM  for $32 billion in cash  an audacious attempt to lead the next wave of digital innovation with a chip designer that powers the global mobile phone industry. | Video ",
        "date": "07192016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "SoftBank to buy UK chip designer ARM in $32 billion cash deal "
    },
    {
        "content": "* Pfizer announces publication of final results from two pivotal Phase 3 studies of crisaborole topical ointment in patients with mild to moderate atopic dermatitis",
        "date": "07132016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer publishes results from two Pivotal phase 3 studies of crisaborole topical ointment "
    },
    {
        "content": "July 12 Pfizer Inc said on Tuesday the U.S. Food and Drug Administration had expanded the use of its best-selling pneumonia vaccine  Prevnar  to adults aged 18 through 49.",
        "date": "07122016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "FDA expands use of Pfizer's best-selling pneumonia vaccine "
    },
    {
        "content": "Bankrupt Bind Therapeutics Inc won a court order on Thursday for its plan for selling its assets  which involves a stalking-horse offer by Pfizer Inc to set a floor on a sales price.",
        "date": "07072016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Court approves bankrupt Bind's sale plan following Pfizer offer "
    },
    {
        "content": "* Pfizer announces positive top-line results from phase 3 S-TRAC trial of sutent (sunitinib) as adjuvant therapy in patients at high risk of recurrent renal cell carcinoma",
        "date": "07082016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces positive top-line results from phase 3 S-TRAC trial "
    },
    {
        "content": "* Pfizer receives FDA approval for Prevnar 13\u007f in adults age 18 through 49  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07122016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer receives FDA approval for Prevnar 13 "
    },
    {
        "content": "* Merck KGaA and Pfizer initiate phase III trial to evaluate avelumab as first-line treatment for ovarian cancer",
        "date": "07072016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "REFILE-BRIEF-Pfizer and Germany's Merck KGaA initiate phase III trial "
    },
    {
        "content": "Here are some upcoming events of interest to the health law community. All times local.",
        "date": "07052016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Week Ahead in Health: July 5  2016 "
    },
    {
        "content": "Pfizer Inc and German drugmaker Merck KGaA on Wednesday said they had begun a late-stage trial of their immuno-oncology drug avelumab in combination with standard treatment for ovarian cancer.",
        "date": "07062016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer  Germany's Merck begin large ovarian cancer trial "
    },
    {
        "content": "U.S. cancer drug company Medivation Inc  said on Tuesday it had agreed to provide confidential information to French pharmaceutical company Sanofi SA  as part of exploring a sale that would be open to other bidders. | Video ",
        "date": "07062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Medivation agrees to open its books to Sanofi "
    },
    {
        "content": "* Bind Therapeutics files motion for sale of assets after accepting stalking horse bid from Pfizer Inc",
        "date": "07012016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Bind Therapeutics files motion for sale of assets after accepting stalking horse bid from Pfizer "
    },
    {
        "content": "SHANGHAI Pfizer Inc  will invest $350 million to build a biotech center in China  the latest in a series of moves by pharma industry giants to set up shop in the world's no. 2 drugs market with the aim of securing faster approvals for their products.",
        "date": "06282016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer to invest $350 million in China biotech hub  first in Asia "
    },
    {
        "content": "SHANGHAI  June 28 Pfizer Inc will invest $350 million to build a biotech centre in China  the latest in a series of moves by pharma industry giants to set up shop in the world's no. 2 drugs market with the aim of securing faster approvals for their products.",
        "date": "06282016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to invest $350 mln in China biotech hub  first in Asia "
    },
    {
        "content": "* Continues to expect transaction to be slightly dilutive to adjusted diluted earnings per share in 2017  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "06242016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer completes acquisition of Anacor "
    },
    {
        "content": "* Pfizer declares 30-cent third-quarter 2016 dividend  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06232016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer declares Q3 2016 $0.30 dividend "
    },
    {
        "content": "* Oracle announces pfizer's selection of oracle cloud for clinical data management and trial management across its clinical trial portfolio  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06202016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Oracle announces Pfizer's selection of Oracle cloud for clinical data management "
    },
    {
        "content": "* Pfizer has right to extend term for up to an additional two years.",
        "date": "06102016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-ICON signed new three-year agreement with Pfizer Inc. "
    },
    {
        "content": "Irish drugmaker Shire Plc said it would buy the rights to an experimental bowel drug from Pfizer Inc to bolster its pipeline of gastrointestinal treatments.",
        "date": "06142016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Shire buys bowel drug rights from Pfizer "
    },
    {
        "content": "June 14 Irish drugmaker Shire Plc said it would buy the rights to an experimental bowel drug from Pfizer Inc to bolster its pipeline of gastrointestinal treatments.",
        "date": "06142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Shire buys bowel drug rights from Pfizer "
    },
    {
        "content": "June 14 Irish drugmaker Shire Plc said on Tuesday it would buy from Pfizer Inc the rights to an experimental drug  designed to treat moderate-to-severe inflammatory bowel disease.",
        "date": "06142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Drugmaker Shire buys bowel drug rights from Pfizer "
    },
    {
        "content": "* Shire to license PF-00547659 from Pfizer  adding to established and leading gastrointestinal portfolio",
        "date": "06142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Shire to license investigational gastric drug from Pfizer "
    },
    {
        "content": "* Said on Wednesday DKSH and Pfizer expanded collaboration in Thailand",
        "date": "06092016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-DKSH and Pfizer expand collaboration in Thailand "
    },
    {
        "content": "* Pfizer announces positive top-line results from second phase 3 trial of oral Xeljanz\u007f (tofacitinib citrate) in adults with psoriatic arthritis",
        "date": "06072016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer announces positive top-line results from second Phase 3 oral Xeljanz trial "
    },
    {
        "content": "NEW YORK  June 3 A former investment adviser at Oppenheimer & Co Inc has been arrested on charges that he traded on inside information supplied by a Pfizer Inc employee about potential acquisitions it was considering  federal prosecutors said Friday.",
        "date": "06032016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Ex-Oppenheimer adviser arrested for trading on Pfizer employee's tips "
    },
    {
        "content": "WASHINGTON  June 2 Some major U.S. drug companies have hired their own auditors to perform compliance reviews mandated in government settlements over alleged civil violations  such as paying kickbacks or off-label drug promotion  according to federal records reviewed by Reuters.",
        "date": "06022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Independence of compliance reviews is questioned in drug firm settlements "
    },
    {
        "content": "Pfizer Inc's  experimental long-acting opioid painkiller has some abuse-resistant properties but addicts can still extract oxycodone from the drug using certain solvents  a preliminary review by the U.S. Food and Drug Administration concluded on Monday.",
        "date": "06062016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer's opioid painkiller can be manipulated for abuse: FDA "
    },
    {
        "content": "* Say pivotal avelumab study shows positive results in metastatic merkel cell carcinoma",
        "date": "06062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-BRIEF-Merck KGaA  Pfizer present positive mid-stage data on merkel cell carcinoma drug at ASCO "
    },
    {
        "content": "FRANKFURT  June 6 German healthcare supplier Fresenius and British engineering company Smiths Group  have emerged as the final bidders for Pfizer's  infusion pumps business in a possible deal worth close to $1.5 billion  people familiar with the matter said.",
        "date": "06062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Fresenius  Smiths in 2-way race for Pfizer infusion pumps-sources "
    },
    {
        "content": "* Intends to use net offering proceeds for general corporate purposes  including to repay a portion of its outstanding commercial paper",
        "date": "05312016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer prices $5.0 billion debt offering "
    },
    {
        "content": "* Biorap technologies says entered into a research collaboration  option and license agreement with Pfizer inc.",
        "date": "05312016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Biorap Technologies enters into an agreement with Pfizer "
    },
    {
        "content": "French drugmaker Sanofi  named eight candidates to replace the entire board of Medivation Inc  on Wednesday  stepping up pressure on the U.S. cancer drug company which has rejected its $9.3 billion takeover approach.",
        "date": "05252016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Sanofi moves to oust Medivation board in $9.3 billion takeover fight "
    },
    {
        "content": "* Cancer drug company says $52.50 a share inadequate   (Adds details on Medivation bylaws)",
        "date": "05252016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Sanofi moves to oust Medivation board in $9.3 bln takeover fight "
    },
    {
        "content": "Anacor Pharmaceuticals Inc had received an offer from a third party before it agreed to be bought by Pfizer Inc in a $5.2 billion deal last week  regulatory filings showed.",
        "date": "05262016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Anacor received rival bid before Pfizer deal - filing "
    },
    {
        "content": "Anacor Pharmaceuticals Inc  had received an offer from a third party before it agreed to be bought by Pfizer Inc  in a $5.2 billion deal last week  regulatory filings showed.",
        "date": "05262016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Anacor received rival bid before Pfizer deal: filing "
    },
    {
        "content": "May 26 Anacor Pharmaceuticals Inc had received an offer from a third party before it agreed to be bought by Pfizer Inc in a $5.2 billion deal last week  regulatory filings showed.",
        "date": "05262016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Anacor received rival bid before Pfizer deal - filing "
    },
    {
        "content": "May 26 Anacor Pharmaceuticals Inc said it had received a takeover bid from a third party before it struck a $5.2 billion deal with Pfizer Inc last week.",
        "date": "05262016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Anacor reveals receiving rival bid before Pfizer deal - filing "
    },
    {
        "content": "* As part of update  black triangle symbol  which indicated additional safety monitoring for champix in EU was required  has been removed",
        "date": "05232016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfozer- Champix EU label updated to include new data from EAGLES clinical trial "
    },
    {
        "content": "May 24 Eli Lilly and Co on Tuesday said it and partner Pfizer Inc aim to seek approval by 2018 for a new type of pain drug that could be an alternative to opioids for osteoarthritis  chronic back pain and cancer pain.",
        "date": "05242016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Lilly says new type of pain drug could lessen need for opioids "
    },
    {
        "content": "* Pfizer announces European Medicines Agency acceptance for review of marketing authorization application for Trumenba\u007f (Meningococcal Group B Vaccine)  Source text for Eikon:  Further company coverage:",
        "date": "05202016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says EMA acceptance for Trumenba marketing authorization application review "
    },
    {
        "content": "* Spark therapeutics and pfizer announce data from initial subjects in hemophilia b trial demonstrating consistent therapeutic levels of factor ix expression",
        "date": "05192016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Spark Therapeutics  Pfizer announce data from initial subjects in hemophilia B trial "
    },
    {
        "content": "A federal appeals court has tossed a whistleblower lawsuit by a doctor accusing Pfizer Inc  his former employer  of promoting unnecessary  off-label prescriptions of its popular cholesterol-lowering drug Lipitor.",
        "date": "05182016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "2nd Circuit rejects doctor's whistleblower case over Pfizer's Lipitor "
    },
    {
        "content": "May 18 A clinical trial testing an experimental breast cancer pill from Novartis has been stopped early because of good results  boosting the Swiss company's efforts to build up its oncology business.",
        "date": "05182016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Novartis breast cancer drug set to take on Pfizer's Ibrance "
    },
    {
        "content": "More than 20 U.S. states that use a combination of drugs to carry out lethal injections will find it harder to conduct executions due to Pfizer's ban on sales of its chemicals  but the move will have little impact on the handful that rely on a single drug.",
        "date": "05172016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer ban on lethal drug sales complicates executions in 20 states "
    },
    {
        "content": "May 17 More than 20 U.S. states that use a combination of drugs to carry out lethal injections will find it harder to conduct executions due to Pfizer's ban on sales of its chemicals  but the move will have little impact on the handful that rely on a single drug.",
        "date": "05172016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer ban on lethal drug sales complicates executions in 20 U.S. states "
    },
    {
        "content": "LONDON AstraZeneca's  drive to rebuild its portfolio of new medicines received a boost with positive results for an experimental biotech drug for severe asthma that the company previously flagged as a potential $2 billion-a-year seller.",
        "date": "05172016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "AstraZeneca asthma drug hits goal  to enter competitive market "
    },
    {
        "content": "NEW YORK - Pfizer Inc has taken steps to ensure that none of its products are used in lethal injections  the largest U.S. drugmaker said on Friday.",
        "date": "05142016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer blocks its drugs from use in lethal injections "
    },
    {
        "content": "NEW YORK Pfizer Inc's  purchase of Anacor Pharmaceuticals Inc  heralds an approaching wave of potentially safer and more effective treatments for millions who suffer from eczema  a common skin condition which causes infection-prone rashes that can feel like having poison ivy 24 hours a day.",
        "date": "05172016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer's Anacor deal showcases new wave of eczema therapies "
    },
    {
        "content": "Pfizer Inc  is buying Anacor Pharmaceuticals Inc  in a $5.2 billion deal to add an eczema gel to its portfolio  just a month after the U.S. drug major scrapped plans to acquire Allergan Plc . | Video ",
        "date": "05172016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to buy Anacor in $5.2 billion deal for access to eczema gel "
    },
    {
        "content": "NEW YORK  May 13 Seth Klarman's Baupost Group took a new stake in the first quarter in Allergan Plc  before the drugmaker's $160 billion merger with Pfizer Inc  was terminated last month.",
        "date": "05132016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Baupost took $461 mln Allergan stake before Pfizer deal collapsed "
    },
    {
        "content": "* Pfizer Inc Reports 8 Pct Passive Stake In Wave Life Sciences Ltd As Of May 5  2016 - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05122016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer reports 8 pct passive stake in Wave Life Sciences "
    },
    {
        "content": "* On track to file two investigational new drug applications in late 2016 for its 2 lead allele-specific antisense programs",
        "date": "05162016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Wave Life Sciences says cash resources with $40 mln in payments from Pfizer will fund expenses into 2019 "
    },
    {
        "content": "NEW YORK  May 13 Pfizer Inc has taken steps to ensure that none of its products are used in lethal injections  the largest U.S. drugmaker said on Friday.",
        "date": "05132016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer blocks its drugs from use in lethal injections "
    },
    {
        "content": "NEW YORK  May 16 Former SAC executive Gabe Plotkin's Melvin Capital took a new position in streaming video service Netflix Inc  buying 950 000 shares and a call option for 1.45 million shares  according to regulatory filings on Monday. Hoplite Capital also took a new position in Netflix  buying 236 456 shares  while Blue Ridge took a new position  buying 1.4 million shares.",
        "date": "05162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "HIGHLIGHTS-Top U.S. hedge funds bet on Netflix  Yahoo  consumer stocks "
    },
    {
        "content": "WASHINGTON  May 13 Pharmaceutical company Pfizer Inc has imposed controls on its products to ensure that none are used in lethal injections  the New York Times said on Friday.",
        "date": "05132016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer blocks its drugs from use in lethal injections -NY Times "
    },
    {
        "content": "* Equity value of deal is $4.45 bln   (Adds graphic link; updates shares)",
        "date": "05162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 5-Pfizer to buy Anacor in $5.2 bln deal for access to eczema gel "
    },
    {
        "content": "* Moody's Affirms Pfizer's A1/P-1 Ratings; Outlook Now Negative  Source text for Eikon:  Further company coverage:",
        "date": "05162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Moody's affirms Pfizer's A1/P-1 ratings "
    },
    {
        "content": "* Omega Advisors Dissolves Class A Shares Stake In Terraform Global",
        "date": "05162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Omega Advisors dissolves share stake in Amazon  Citigroup "
    },
    {
        "content": "* In connection with termination of merger agreement  Anacor will pay Pfizer a termination fee of $180.8 million - SEC filing  Source text - http://1.usa.gov/1NvupSZ Further company coverage:",
        "date": "05162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Anacor-Pfizer merger agreement includes $180.8 mln termination fee - SEC filing "
    },
    {
        "content": "* Commencement of phase 1 study triggers a $2 million milestone payment to MacroGenics under companies' October 2010 agreement.",
        "date": "05102016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-First dosing of Pfizer DART candidate in phase 1 study triggers milestone payment to MacroGenics "
    },
    {
        "content": "* Pfizer will acquire anacor for $99.25 per anacor share  in cash  for a total transaction value  net of cash  of approximately $5.2 billion",
        "date": "05162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer to buy Anacor in $5.2 bln deal "
    },
    {
        "content": "May 16 Pfizer Inc will buy Anacor Pharmaceuticals Inc in a deal valued at $5.2 billion  net of cash  for access to Anacor's non-steroidal topical gel to treat eczema.",
        "date": "05162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to buy Anacor Pharma in $5.2 bln deal "
    },
    {
        "content": "May 10 Allergan Plc  whose $160 billion merger with Pfizer Inc fell apart last month  reported a 48 percent rise in quarterly revenue  led by a strong performance by its branded drugs business  which includes Botox and the eye drug Restasis.",
        "date": "05102016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Allergan reports 48 pct rise in quarterly revenue "
    },
    {
        "content": "NEW YORK After a planned purchase of Allergan Plc  was scuttled by the U.S. government  Pfizer  Chief Executive Ian Read on Tuesday said he would consider another merger of any size  at any time  as long as the deal makes sense.",
        "date": "05032016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer CEO still interested in deals after losing Allergan "
    },
    {
        "content": "* CEO says company does not expect to seek any tax-inversion deals in the near term",
        "date": "05032016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says does not expect to seek tax-inversion deals in near term "
    },
    {
        "content": "Pfizer Inc  which last month abandoned its $160 billion quest for Allergan Inc  reported quarterly results that blew past analyst estimates on sales of its new cancer and arthritis treatments and the acquisition last year of hospital products company Hospira.",
        "date": "05032016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "New drugs fuel strong Pfizer results; company raises 2016 forecasts "
    },
    {
        "content": "* The agreement has been extended until Dec 31  2023  Source text for Eikon:  Further company coverage:",
        "date": "04292016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Sobi extends manufacturing agreements with Pfizer "
    },
    {
        "content": "* Declares $0.30 second-quarter 2016 dividend  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "04282016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer Inc declares $0.30 second-quarter 2016 dividend "
    },
    {
        "content": "NEW YORK  April 27 (Thomson Reuters Foundation) - Global charity Medecins Sans Frontieres delivered a petition with hundreds of thousands of signatures to pharmaceutical giant Pfizer Inc on Wednesday  asking the drugmaker to slash the price of its pneumonia vaccine for poor children.",
        "date": "04282016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Charity urges price cut for pneumonia vaccine for poor children "
    },
    {
        "content": "WASHINGTON  April 27 Pfizer Inc has agreed to pay $784.6 million to resolve allegations that Wyeth  which it acquired in 2009  underpaid drug rebates to Medicaid  the Justice Department said Wednesday.",
        "date": "04272016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to pay $784.6 million to resolve Wyeth false claims lawsuit "
    },
    {
        "content": "WASHINGTON  April 27 Pfizer Inc has agreed to pay $784.6 million to resolve allegations that Wyeth  which it acquired in 2009  underpaid drug rebates to Medicaid  the federal health insurance program  the Justice Department said on Wednesday.",
        "date": "04272016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Pfizer to pay $784.6 million to resolve Wyeth false claims lawsuit "
    },
    {
        "content": "A federal appeals court on Tuesday revived a class-action lawsuit accusing Pfizer Inc of causing tens of billions of dollars of losses for shareholders by misleading them about the safety of its Celebrex and Bextra pain-relieving drugs.",
        "date": "04122016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer must face revived Celebrex  Bextra safety lawsuit "
    },
    {
        "content": "April 12 A federal appeals court on Tuesday revived a class-action lawsuit accusing Pfizer Inc of causing tens of billions of dollars of losses for shareholders by misleading them about the safety of its Celebrex and Bextra pain-relieving drugs.",
        "date": "04122016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Pfizer must face revived Celebrex  Bextra safety lawsuit "
    },
    {
        "content": "April 12 A federal appeals court on Tuesday revived a long-running lawsuit accusing Pfizer Inc of misleading investors about the safety of its Celebrex and Bextra pain-relieving drugs.",
        "date": "04122016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Lawsuit vs Pfizer over Celebrex  Bextra safety is revived "
    },
    {
        "content": "NEW YORK Pfizer Inc  Chief Executive Ian Read has investors standing behind him even after his second attempt at a huge tax-saving deal collapsed this week.",
        "date": "04082016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Investors stick with Pfizer CEO after Allergan deal scrapped "
    },
    {
        "content": "April 7 Britain's FTSE 100 index is seen opening up 8 points  or 0.13 percent  on Thursday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed up 70.40 points  or 1.2 percent  on Wednesday at 6 161.63  boosted by pharmaceuticals companies as Pfizer  pulled out of a deal for Allergan  prompting speculation over other merger and acquisition activity in the sector.      * BP: Shareholder advisor",
        "date": "04072016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UK Stocks-Factors to watch on April 7 "
    },
    {
        "content": "Drugmaker Pfizer Inc  is leaning toward abandoning its $160 billion agreement to buy Allergan Plc  in light of the U.S. Treasury's new measures to curb such tax evading deals  a source familiar with the situation said on Tuesday. | Video ",
        "date": "04052016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Exclusive: Pfizer leaning toward abandoning deal with Allergan - source "
    },
    {
        "content": "U.S. drugmaker Pfizer Inc  and Ireland-based Allergan Plc  walked away from their $160 billion merger on Wednesday  a major win for President Barack Obama  who has been pushing to curb deals in which companies move overseas to cut taxes. | Video ",
        "date": "04062016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer  Allergan scrap $160 billion deal after U.S. tax rule change "
    },
    {
        "content": "NEW YORK The U.S. Treasury Department's proposed new tax regulations threw a series of corporate mergers into question on Tuesday  fanning a hot political situation and pushing Pfizer Inc closer to a decision to walk away from buying Botox maker Allergan Plc.",
        "date": "04052016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "U.S. Treasury rules put Pfizer-Allergan deal in question "
    },
    {
        "content": "NEW YORK  April 5 Shares in Allergan Plc  opened down more than 15 percent on Tuesday  a day after the U.S. Treasury Department proposed new tax regulations that analysts said could kill its $160 billion agreement to be bought by Pfizer Inc.",
        "date": "04052016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Allergan shares fall as investors bet on Pfizer deal collapse "
    },
    {
        "content": "* Moody's affirms Pfizer's A1/Prime-1 ratings; Stable outlook",
        "date": "04062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Moody's affirms Pfizer's A1/Prime-1 ratings "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.5 pct  Nasdaq 1 pct   (Updates to after Fed minutes)",
        "date": "04062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St rises with healthcare; oil rallies "
    },
    {
        "content": "LONDON Hedge funds which bet on mergers and acquisitions were hurt by the collapse of a $160 billion tie-up between pharmaceutical companies Pfizer  and Allergan  - although the effects could have been even worse.",
        "date": "04062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Mega-deal collapse a second-quarter wake-up for merger-arb hedge funds "
    },
    {
        "content": "April 6 U.S. drugmaker Pfizer Inc and Ireland-based Allergan Plc walked away from their $160 billion merger on Wednesday  a major win for President Barack Obama  who has been pushing to curb deals in which companies move overseas to cut taxes.",
        "date": "04062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Pfizer  Allergan scrap $160 bln deal after U.S. tax rule change "
    },
    {
        "content": "* Indexes up: Dow 0.39 pct  S&P 0.65 pct  Nasdaq 1.02 pct   (Updates to early afternoon)",
        "date": "04062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St pushed higher by healthcare  energy stocks "
    },
    {
        "content": "NEW YORK  April 6 The collapse of one pharmaceutical mega-merger could beget many smaller deals - at least that is the hope of biotech investors.",
        "date": "04062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Biotech shares rally as Pfizer-Allergan deal collapses "
    },
    {
        "content": "April 6 Democratic presidential candidates Hillary Clinton and Bernie Sanders on Wednesday cheered the end of U.S. drugmaker Pfizer Inc's $160 billion merger with Ireland-based Allergan Plc.",
        "date": "04062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Democratic White House hopefuls cheer end of Pfizer  Allergan deal "
    },
    {
        "content": "* Conducting a review of u.s. Department of Treasury's actions announced today",
        "date": "04042016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer and Allergan say conducting a review of U.S. Department of Treasury's actions "
    },
    {
        "content": "* Govt encouraging pharma R&D  but wants to curb medical costs",
        "date": "04012016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Drugmakers say Japan R&D spending at risk after government forces price cuts "
    },
    {
        "content": "A federal judge in Philadelphia dismissed more than 300 lawsuits against Pfizer Inc alleging that its antidepressant Zoloft caused birth defects in children born to women who took the drug while pregnant.",
        "date": "04062016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer beats hundreds of lawsuits alleging Zoloft birth defects "
    },
    {
        "content": "WASHINGTON Pfizer is conducting a review of the U.S. Treasury Department's latest actions to curb tax-avoiding \"inversion\" deals in which a U.S. company reincorporates overseas following the purchase of a foreign company.",
        "date": "04042016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer says won't speculate on impact of U.S. Treasury's inversion move "
    },
    {
        "content": "* Cancer metabolism company Metabomed completes $18 million series A financing",
        "date": "04042016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Cancer metabolism company Metabomed completes $18 mln series A financing "
    },
    {
        "content": "MUMBAI/NEW DELHI An Indian court granted U.S. drugmaker Pfizer   an interim injunction on a ban on its popular cough syrup Corex  days after the government ordered it to be prohibited citing a potential risk to humans.",
        "date": "03142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Indian court grants Pfizer temporary relief on cough syrup ban "
    },
    {
        "content": "* Pfizer says banned syrup brought in $26 mln in Apr-Dec   (Adds statement from Pfizer's India unit)",
        "date": "03142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 4-Indian court grants Pfizer temporary relief on cough syrup ban "
    },
    {
        "content": "MUMBAI/NEW DELHI  March 14 An Indian court granted U.S. pharmaceuticals firm Pfizer Inc's   Indian unit a stay order on Monday  pending a further hearing  on a government ban on its popular cough syrup Corex  two lawyers representing the drugmaker told Reuters.",
        "date": "03142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-UPDATE 3-Indian court grants Pfizer stay on ban of popular cough syrup "
    },
    {
        "content": "MUMBAI  March 14 U.S. pharmaceutical giant Pfizer Inc's India unit said on Monday it had stopped selling its popular Corex cough syrup  after regulators banned it saying it was likely to pose a risk to humans.",
        "date": "03142016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer stops selling popular Corex cough syrup in India after ban "
    },
    {
        "content": "March 11 The United States Food and Drug Administration on Friday approved the expanded use of Pfizer Inc's drug to treat a type of lung cancer.",
        "date": "03112016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "FDA approves Pfizer's lung cancer drug for expanded use "
    },
    {
        "content": "MUMBAI  March 11 The charity Medicins Sans Frontieres has formally opposed U.S. firm Pfizer Inc's  application for an Indian patent on a highly effective pneumonia vaccine  saying it could deprive many developing nations of cheaper copies of the drug.",
        "date": "03112016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Medecins Sans Frontieres files to block Pfizer patent on pneumonia vaccine in India "
    },
    {
        "content": "Allergan Plc  reported better-than-expected quarterly revenue  helped by strong performance in its U.S. brands segment  and said it continues to expect its takeover by Pfizer Inc  to close in the second half 2016.",
        "date": "02222016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Allergan's revenue beats on higher U.S. brand sales "
    },
    {
        "content": "Feb 22 Allergan Plc reported better-than-expected quarterly revenue  helped by strong performance in its U.S. brands segment  and said it continues to expect its takeover by Pfizer Inc to close in the second half 2016.",
        "date": "02222016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Allergan's revenue beats on higher U.S. brand sales "
    },
    {
        "content": "Pfizer Inc said its Wyeth unit has agreed to pay $784.6 million to settle cases related to the calculation of Medicaid rebates for a gastric drug between 2001 and 2006.",
        "date": "02162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer unit to pay $784.6 mln in Medicaid rebate settlement "
    },
    {
        "content": "Feb 16 Pfizer Inc said its Wyeth unit has agreed to pay $784.6 million to settle cases related to the calculation of Medicaid rebates for a gastric drug between 2001 and 2006.",
        "date": "02162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer unit to pay $784.6 mln in Medicaid rebate settlement "
    },
    {
        "content": "Feb 16 Pfizer Inc said its Wyeth unit has agreed to pay $784.6 million to settle cases related to the calculation of Medicaid rebates for a drug between 2001 and 2006.",
        "date": "02162016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-Pfizer unit to pay $784.6 mln in Medicaid rebate settlement "
    },
    {
        "content": "* Says \u007fsandoz strengthens its biosimilars portfolio with acquisition of pfizer's biosimilar infliximab in eea\u007f",
        "date": "02122016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Novartis says Sandoz buys Pfizer's biosimilar infliximab in EEA "
    },
    {
        "content": "Pfizer Inc   which agreed to buy Allergan Plc  for $160 billion last year  unveiled its management line up for the combined company  once the deal closes in the second half of 2016.",
        "date": "02082016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer unveils management line up for combined company "
    },
    {
        "content": "Feb 8 Pfizer Inc  which agreed to buy Allergan Plc for $160 billion last year  unveiled its management line up for the combined company  once the deal closes in the second half of 2016.",
        "date": "02082016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer unveils management line up for combined company "
    },
    {
        "content": "Feb 8 Pfizer Inc  which agreed to buy Allergan Plc for $160 billion last year  said it will create a new operating unit to house its consumer healthcare and Allergan's opthalmology and Botox units once the deal closes in the second half of 2016.",
        "date": "02082016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to create operating unit after Allergan deal closes "
    },
    {
        "content": "* Q4 revenue $6.40 billion vs consensus $6.29 billion   (Adds details on management incentives  further reaction)",
        "date": "02042016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-AstraZeneca warns on profits in 2016 as Crestor patent loss weighs "
    },
    {
        "content": "U.S. drugmaker Pfizer Inc  on Tuesday forecast 2016 revenue and earnings below analysts' estimates  largely because of the strong dollar.",
        "date": "02022016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer 2016 forecast disappoints "
    },
    {
        "content": "Feb 2 U.S. drugmaker Pfizer Inc on Tuesday forecast 2016 revenue and earnings below analysts' estimates  largely because of the strong dollar.",
        "date": "02022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 4-Pfizer 2016 forecast disappoints "
    },
    {
        "content": "Feb 2 Pfizer Inc  which has agreed to buy Botox-maker Allergan Plc for $160 billion  reported a 7 percent rise in quarterly revenue  helped by its Hospira acquisition and demand for its pneumonia vaccine.",
        "date": "02022016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer revenue rises as pneumonia vaccine sales jump "
    },
    {
        "content": "Pfizer Inc's patent on a targeted cancer drug undergoing clinical trials will expire more than six months earlier than it had expected after a U.S. appeals court on Friday upheld the way the U.S. Patent and Trademark Office calculated the lifespan of the patent.",
        "date": "01222016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer loses cancer drug patent term fight at Federal Circuit "
    },
    {
        "content": "Jan 13 Drugmaker Pfizer Inc is thinking about selling hospital products maker Hospira's infusion pump business for about $2 billion  Bloomberg reported  citing people familiar with the matter.",
        "date": "01142016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer weighing sale of Hospira's pump business -Bloomberg "
    },
    {
        "content": "A federal appeals court has upheld the validity of Pfizer Inc's patents on its cancer drug Sutent  blocking Mylan Pharmaceuticals Inc from launching a generic version of the drug.",
        "date": "01132016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Court upholds patents on Pfizer cancer drug Sutent "
    },
    {
        "content": "NEW YORK  Jan 13 Pfizer Inc aims to drive profits in coming years with more-responsive and easier-to-manufacture new cancer treatments.",
        "date": "01132016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer says its CAR T cancer therapy could outshine rivals "
    },
    {
        "content": "NEW YORK  Jan 12 The research chiefs of betrothed drugmakers Pfizer Inc and Allergan say the proposed combination of their experimental drugs deserves more credit  including potential blockbuster treatments for schizophrenia and depression.",
        "date": "01122016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer  Allergan say combined drug pipeline 'underappreciated' "
    },
    {
        "content": "Pfizer Inc   which plans a $160-billion merger with Ireland-based Allergan Plc  to slash its U.S. tax bill  on Jan. 1 raised U.S. prices for more than 100 of its drugs  some by as much as 20 percent  according to statistics compiled by global information services company Wolters Kluwer.",
        "date": "01092016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer hikes U.S. prices for over 100 drugs on January 1 "
    },
    {
        "content": "* Pfizer says its experimental off-the-shelf CAR T cell therapies for cancer may have major advantages over personalized CAR T cells",
        "date": "01122016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Allergan research chief says Pfizer immuno-oncology pipeline underappreciated "
    },
    {
        "content": "* List price does not reflect discounts on offer  company says",
        "date": "01092016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer hikes U.S. prices for over 100 drugs on January 1 "
    },
    {
        "content": "Jan 8 Pfizer Inc  which plans a $160 billion merger with Ireland-based Allergan Plc to slash its U.S. tax bill  on Jan. 1 raised U.S. prices for more than 100 of its drugs  some by as much as 20 percent  according to statistics compiled by global information services company Wolters Kluwer.",
        "date": "01082016",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer hikes U.S. prices for over 100 drugs on January 1 "
    },
    {
        "content": "Pfizer Inc does not owe New York University any royalties on the lung cancer drug Xalkori  a New York state judge ruled in an opinion issued Friday.",
        "date": "12232015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer defeats NYU claim for cancer drug royalties "
    },
    {
        "content": "Pfizer Inc can go forward with a lawsuit seeking the right to advertise that its infant Advil has the same digestive side effects as infant Tylenol  a federal judge has ruled.",
        "date": "12142015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer suit over Advil marketing gets green light "
    },
    {
        "content": "Pfizer has dealt a blow to plaintiffs suing over Zoloft by convincing a federal judge in Pennsylvania to bar a biostatistics expert from testifying that the antidepressant can cause cardiac birth defects.",
        "date": "12032015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer blocks key plaintiffs' expert in Zoloft MDL "
    },
    {
        "content": "* Guggenheim named Pfizer's lead adviser on $160 bln Allergan deal",
        "date": "11272015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "RPT-Two-decade Pfizer mission pays off for Guggenheim's deal king "
    },
    {
        "content": "BOSTON  Dec 1 Daniel Loeb's main portfolio at hedge fund Third Point is nearly flat for the year  putting the billionaire investor far ahead of some industry rivals who have suffered heavy losses this year.",
        "date": "12012015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Loeb's Third Point Offshore hedge fund nearly flat for year-sources "
    },
    {
        "content": "Nov 25 Pfizer Inc said its blockbuster pain drug  Lyrica  had failed to show benefit in patients suffering from a type of post-traumatic nerve pain  in a late-stage study.",
        "date": "11252015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer's Lyrica shows no relief from post-traumatic nerve pain "
    },
    {
        "content": "NEW YORK Pfizer Inc on Monday said it would buy Botox maker Allergan Plc in a deal worth $160 billion to slash its U.S. tax bill  rekindling a fierce political debate over the financial maneuver. | Video ",
        "date": "11242015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer to buy Allergan in $160 billion deal "
    },
    {
        "content": "* Guggenheim named Pfizer's lead adviser on $160 bln Allergan deal",
        "date": "11262015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Two-decade Pfizer mission pays off for Guggenheim's deal king "
    },
    {
        "content": "WASHINGTON U.S. politicians condemned Pfizer Inc's deal with Allergan Plc as a tax dodge on Monday  bringing another round of hand-wringing in Washington over the corporate tax code  though legislative action before 2017 is unlikely.",
        "date": "11242015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Politicians slam tax-avoiding Pfizer-Allergan deal "
    },
    {
        "content": "BERLIN  Nov 24 German Finance Minister Wolfgang Schaeuble said the global community needs to ensure that its tax base does not erode due to corporate tax loopholes  pointing to Pfizer's $160 billion deal to buy Botox maker Allergan .",
        "date": "11242015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Germany's Schaeuble says need to ensure tax base doesn't erode "
    },
    {
        "content": "A federal appeals court has upheld a jury verdict in favor of Pfizer Inc against a man who said he developed a potentially fatal lung condition from Pondimin  one of the drugs sold by Pfizer's predecessor American Home Products Corp as part of the once-popular \"fen-phen\" diet treatment.",
        "date": "03282016",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Appeals court upholds verdict for Pfizer in diet drug case "
    },
    {
        "content": "NEW YORK Pfizer Inc  on Monday said it would buy Botox maker Allergan Plc  in a deal worth $160 billion to slash its U.S. tax bill  rekindling a fierce political debate over the financial maneuver. | Video ",
        "date": "11232015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to buy Allergan in $160 billion deal "
    },
    {
        "content": "WASHINGTON  Nov 23 U.S. politicians condemned Pfizer Inc's deal with Allergan Plc as a tax dodge on Monday  bringing another round of hand-wringing in Washington over the corporate tax code  though legislative action before 2017 is unlikely.",
        "date": "11242015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-U.S. politicians slam tax-avoiding Pfizer-Allergan deal "
    },
    {
        "content": "Pfizer Inc  was due to secure formal board approval on Sunday for its acquisition of Botox maker Allergan Plc  for more than $150 billion  creating the world's biggest drug maker  according to people familiar with the matter.",
        "date": "11222015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer set to buy Allergan for more than $150 billion "
    },
    {
        "content": "NEW YORK  Nov 23 Pfizer Inc on Monday said it would buy Botox maker Allergan Plc in a deal worth $160 billion to slash its U.S. tax bill  rekindling a fierce political debate over the financial maneuver.",
        "date": "11232015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 5-Pfizer to buy Allergan in $160 billion deal "
    },
    {
        "content": "WASHINGTON U.S. politicians condemned Pfizer Inc's deal with Allergan Plc as a tax dodge on Monday  bringing another round of hand-wringing in Washington over the corporate tax code  though legislative action before 2017 is unlikely.",
        "date": "11232015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Politicians slam tax-avoiding Pfizer-Allergan mega-deal "
    },
    {
        "content": "Pfizer Inc and Allergan Inc chief executives have agreed on the roles they would assume in a combined company  removing one of the last hurdles to the largest ever healthcare merger  people familiar with the matter said.",
        "date": "11202015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Exclusive: Pfizer  Allergan CEOs agree on combined company roles - sources "
    },
    {
        "content": "U.S. stock indexes closed slightly lower in a quiet trading day on Wall Street after last week's strong gains  while a big healthcare deal failed to impress investors on Monday. | Video ",
        "date": "11242015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Wall Street falls after strong week; Pfizer and Allergan drag "
    },
    {
        "content": "Nov 22 Pfizer Inc was due to secure formal board approval on Sunday for its acquisition of Botox maker Allergan Plc for more than $150 billion  creating the world's biggest drug maker  according to people familiar with the matter.",
        "date": "11222015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Pfizer set to buy Allergan for more than $150 bln-sources "
    },
    {
        "content": "U.S. Republican presidential candidate Donald Trump said on Monday it was \"disgusting\" that Pfizer Inc will move its tax base overseas as part a deal to buy Allergan Plc.",
        "date": "11232015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Republican Trump calls Pfizer deal to move tax base overseas 'disgusting' "
    },
    {
        "content": "Nov 23 U.S. Republican presidential candidate Donald Trump said on Monday it was \"disgusting\" that Pfizer Inc  will move its tax base overseas as part a deal to buy Allergan Plc.",
        "date": "11232015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "U.S. Republican Trump calls Pfizer deal to move tax base overseas 'disgusting' "
    },
    {
        "content": "Pfizer Inc  is negotiating a 2-3 percent break-up fee with Allergan Plc  that would be in line with most deals  people familiar with the matter said  a sign of confidence that such a merger could overcome regulatory hurdles.",
        "date": "11202015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Exclusive: Pfizer negotiating 2-3 percent Allergan break-up fee - sources "
    },
    {
        "content": "Nov 20 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11202015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "PRESS DIGEST - Wall Street Journal - Nov 20 "
    },
    {
        "content": "WASHINGTON/NEW YORK The U.S. Treasury Department on Thursday took steps to clamp down on tax-avoiding \"inversion\" deals with new rules  though there was scarce evidence they would stop the biggest inversion of them all  between Pfizer Inc  and Allergan Plc .",
        "date": "11202015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "U.S. unveils new inversion rules; unlikely to thwart Pfizer "
    },
    {
        "content": "Nov 22 Pfizer Inc's and Allergan Plc's  boards of directors were due to approve their merger agreement on Sunday  in the healthcare sector's largest ever deal  according to people familiar with the matter.",
        "date": "11222015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer and Allergan to approve merger agreement on Sunday-sources "
    },
    {
        "content": "WASHINGTON  Nov 23 U.S. politicians condemned Pfizer Inc's deal with Allergan Plc as a tax dodge on Monday  bringing another round of hand-wringing in Washington over the corporate tax code  though legislative action before 2017 is unlikely.",
        "date": "11232015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Politicians slam tax-avoiding Pfizer-Allergan mega-deal "
    },
    {
        "content": "WASHINGTON/NEW YORK  Nov 19 The U.S. Treasury Department on Thursday took steps to clamp down on tax-avoiding \"inversion\" deals with new rules  though there was scarce evidence they would stop the biggest inversion of them all  between Pfizer Inc and Allergan Plc.",
        "date": "11202015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-U.S. unveils new inversion rules; unlikely to thwart Pfizer "
    },
    {
        "content": "* Merck KGAA and Pfizer receive FDA breakthrough therapy designation for Avelumab in metastatic merkel cell carcinoma",
        "date": "11182015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Merck KGAA and Pfizer receive FDA breakthrough status for Avelumab "
    },
    {
        "content": "Former U.S. Representative Eric Cantor helped Moelis & Co   the investment bank he joined last year  secure an advisory role with Pfizer Inc  on its merger talks with Allergan Plc   three people familiar with the matter said.",
        "date": "11162015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Exclusive: Moelis clinches Pfizer advisory role with help from Eric Cantor - sources "
    },
    {
        "content": "U.S. stock indexes closed slightly lower in a quiet trading day on Wall Street after last week's strong gains  while a big healthcare deal failed to impress investors on Monday.",
        "date": "11232015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Wall Street falls after strong week; Pfizer and Allergan drag "
    },
    {
        "content": "* Indexes down: Dow 0.17 pct  S&P 0.12 pct  Nasdaq 0.05 pct   (Updates to afternoon  adds commentary changes byline)",
        "date": "11232015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St falls after strong week; Pfizer and Allergan drag "
    },
    {
        "content": "Pfizer Inc  is negotiating a 2-3 percent break-up fee with Allergan Plc  that would be in line with most deals  people familiar with the matter said  a sign of confidence that such a merger could overcome regulatory hurdles.",
        "date": "11192015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Exclusive: Pfizer negotiating 2-3 percent Allergan break-up fee - sources "
    },
    {
        "content": "Pfizer Inc  and Allergan Plc  are in final stages of talks over an all-stock deal  CNBC tweeted  citing sources.",
        "date": "11192015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer  Allergan in final stage of merger talks: CNBC "
    },
    {
        "content": "Nov 19 Pfizer Inc and Allergan Plc  are in final stages of talks over an all-stock deal  CNBC tweeted  citing sources.",
        "date": "11192015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer  Allergan in final stage of merger talks - CNBC "
    },
    {
        "content": "WASHINGTON Pfizer Inc's  buyout bid for Allergan Plc  has financial markets on edge over a possible new move by the U.S. Treasury Department against tax-inversion deals  but the outlook for any such steps was still unclear on Friday.",
        "date": "11132015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer-Allergan deal refocuses market on U.S. tax-inversion rules "
    },
    {
        "content": "NEW YORK/WASHINGTON Pfizer Inc's  talks to acquire Allergan Plc  in a $150 billion deal that would see the U.S. drug giant redomicile in Ireland accelerated on Wednesday  as the U.S. Treasury prepared to clamp down further on such tax inversions.",
        "date": "11192015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer-Allergan talks accelerate amid new inversion clamp-down "
    },
    {
        "content": "WASHINGTON  Nov 13 Pfizer Inc's buyout bid for Allergan Plc has financial markets on edge over a possible new move by the U.S. Treasury Department against tax-inversion deals  but the outlook for any such steps was still unclear on Friday.",
        "date": "11132015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer-Allergan deal refocuses market on US tax-inversion rules "
    },
    {
        "content": "Nov 19 U.S. drugmaker Pfizer and France's Servier have snapped up rights to a promising cell therapy developed by French biotech firm Cellectis to fight blood cancers.",
        "date": "11192015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Servier and Pfizer get rights to Cellectis cancer cell therapy "
    },
    {
        "content": "WASHINGTON  Nov 9 Tax-driven \"inversion\" deals that let companies flee the U.S. tax system by relocating abroad  if only on paper  would be curbed under legislation introduced in Congress  as Pfizer Inc pursues such a deal with rival Allergan Plc.",
        "date": "11092015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Democrat targets corporate tax-avoidance deals in U.S. Congress "
    },
    {
        "content": "* Servier exercises exclusive worldwide licensing option with Cellectis for UCART19  an allogeneic CAR-T cell therapy for hematological malignancies",
        "date": "11192015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Servier exercises exclusive licensing option for Cellectis UCART19 "
    },
    {
        "content": "Pfizer Inc  is in talks to acquire Allergan Plc  for $370-$380 per share  according to a person familiar with the matter  valuing the potential deal at around $150 billion  the healthcare sector's biggest.",
        "date": "11192015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer discussing Allergan offer at $370-$380 per share: source "
    },
    {
        "content": "NEW YORK/WASHINGTON  Nov 18 Pfizer Inc's  talks to acquire Allergan Plc in a $150 billion deal that would see the U.S. drug giant redomicile in Ireland accelerated on Wednesday  as the U.S. Treasury prepared to clamp down further on such tax inversions.",
        "date": "11192015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Pfizer-Allergan talks accelerate amid new inversion clamp-down "
    },
    {
        "content": "Nov 18 Pfizer Inc is in talks to acquire Allergan Plc for $370-$380 per share  according to a person familiar with the matter  valuing the potential deal at around $150 billion  the healthcare sector's biggest.",
        "date": "11192015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer discussing Allergan offer at $370-$380 per share-source "
    },
    {
        "content": "* Q3 revenue $5.95 bln vs $5.97 bln consensus   (Adds further detail on drugs  latest share price  Breakingviews link)",
        "date": "11052015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-AstraZeneca lifts 2015 forecasts despite tough times "
    },
    {
        "content": "WASHINGTON  Nov 6 Pfizer Chief Executive Ian Read  who has been lobbying Congress regularly for a corporate tax cut  is trying for the second time in as many years to do a deal with a foreign company that could produce the savings he has been unable to extract from Washington.",
        "date": "11062015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "RPT-After big spending and hard lobbying  Pfizer eyes new tax home "
    },
    {
        "content": "The proposed corporate tie-up between Pfizer Inc and Allergan Plc  both drug makers  is refocusing attention in Washington on tax-driven corporate inversion transactions.",
        "date": "11022015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Factbox: Pfizer-Allergan puts focus on U.S. tax inversion rules "
    },
    {
        "content": "Nov 6 A Pfizer Inc merger with Ireland-based Allergan  in addition to providing tax benefits  would bolster the U.S. drugmaker's growth prospects should it decide to sell or spin off its portfolio of products that have gone off patent.",
        "date": "11062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "RPT-Pfizer-Allergan deal would set up US company for a split "
    },
    {
        "content": "NEW YORK/LONDON Investment banks Guggenheim Partners LLC and JPMorgan Chase & Co  have secured key roles in Pfizer Inc's  merger negotiations with Allergan Plc   according to people familiar with the matter  in what would be the biggest ever deal in the pharmaceutical sector.",
        "date": "11022015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Exclusive: Guggenheim  JPMorgan clinch key roles in Pfizer-Allergan talks "
    },
    {
        "content": "WASHINGTON  Nov 6 Pfizer Chief Executive Ian Read  who has been lobbying Congress regularly for a corporate tax cut  is trying for the second time in as many years to do a deal with a foreign company that could produce the savings he has been unable to extract from Washington.",
        "date": "11062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "After big spending and hard lobbying  Pfizer eyes new tax home "
    },
    {
        "content": "A Pfizer Inc  merger with Ireland-based Allergan   in addition to providing tax benefits  would bolster the U.S. drugmaker's growth prospects should it decide to sell or spin off its portfolio of products that have gone off patent.",
        "date": "11062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer-Allergan deal would set up U.S. company for a split "
    },
    {
        "content": "LONDON  Nov 3 GlaxoSmithKline's chief executive declined to comment on Tuesday on a report that Pfizer  had approached the British drugmaker about a possible takeover in recent weeks but was rebuffed.",
        "date": "11032015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "GSK boss silent on report drugmaker rebuffed Pfizer "
    },
    {
        "content": "Nov 6 A Pfizer Inc merger with Ireland-based Allergan  in addition to providing tax benefits  would bolster the U.S. drugmaker's growth prospects should it decide to sell or spin off its portfolio of products that have gone off patent.",
        "date": "11062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer-Allergan deal would set up US company for a split "
    },
    {
        "content": "Nov 3 A cocktail of Johnson & Johnson's  HIV compound and an experimental drug from ViiV Healthcare met the main goal of a mid-stage study  becoming the second combination to do so.",
        "date": "11032015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Johnson & Johnson HIV combination succeeds in mid-stage study "
    },
    {
        "content": "WASHINGTON  Oct 29 Pfizer Inc faces political risks in Washington if it proceeds with a bid for Allergan  but with little chance of legislation to curb such tax inversion deals  the Obama administration may be able to throw up only limited obstacles.",
        "date": "10302015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "RPT-Pfizer-Allergan sparks fresh tax inversion angst on Capitol Hill "
    },
    {
        "content": " (In Oct 27 story  paragraph 9 corrects number of Ibrance patients to 15 000 from 50 000)",
        "date": "10282015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Top U.S. drugmakers ride new products to strong results "
    },
    {
        "content": "Pfizer Inc  the No. 1 U.S. drugmaker  and Botox maker Allergan Plc said they were in friendly talks to create a pharmaceutical colossus but the prospect that the company would seek to avoid U.S. taxes sounded political alarm bells. | Video ",
        "date": "10302015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer  Allergan drug merger talks raise tax hackles in U.S. "
    },
    {
        "content": "NEW YORK  Oct 27 Growing sales of expensive new cancer drugs and other newer medicines propelled top U.S. drugmakers Pfizer Inc  Merck & Co and Bristol-Myers Squibb Co to stronger-than-expected third-quarter profits.",
        "date": "10282015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-WRAPUP 1-Top U.S. drugmakers ride new products to strong results "
    },
    {
        "content": "CAPE TOWN  Nov 3 Global pharmaceutical company  Pfizer  has partnered with South Africa's Biovac Institute to produce a potentially life-saving pneumonia vaccine for infants  a cabinet minister said on Tuesday.",
        "date": "11032015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer partners with South Africa to produce pneumococcal vaccine "
    },
    {
        "content": "NEW YORK  Oct 27 Growing sales of expensive new cancer drugs and other newer medicines propelled top U.S. drugmakers Pfizer Inc  Merck & Co and Bristol-Myers Squibb Co to stronger-than-expected third-quarter profits.",
        "date": "10272015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "WRAPUP 1-Top U.S. drugmakers ride new products to strong results "
    },
    {
        "content": "Pfizer Inc  the No. 1 U.S. drugmaker  and Botox maker Allergan Plc said they were in friendly talks to create a pharmaceutical colossus but the prospect that the company would seek to avoid U.S. taxes sounded political alarm bells. | Video ",
        "date": "10292015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer  Allergan drug merger talks raise tax hackles in U.S. "
    },
    {
        "content": "PARIS  Oct 26 Sanofi's new chief executive is expected to show how he aims to get France's most valuable company back on track   after being hit by lagging diabetes sales and boardroom rows    when he presents his five-year strategic plan on Nov. 6.",
        "date": "10262015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Sanofi's new CEO set to deliver revival plan after falling diabetes sales "
    },
    {
        "content": "Nov 3 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11032015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "PRESS DIGEST- Financial Times - Nov 3 "
    },
    {
        "content": "* Says to begin human trials this year of oral form of pcsk9 inhibitor to treat cholesterol",
        "date": "10272015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer says to begin human trials this year of oral form of pcsk9 inhibitor to treat cholesterol "
    },
    {
        "content": "WASHINGTON  Oct 29 Pfizer Inc faces political risks in Washington if it proceeds with a bid for Allergan  but with little chance of legislation to curb such tax inversion deals  the Obama administration may be able to throw up only limited obstacles.",
        "date": "10292015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer-Allergan sparks fresh tax inversion angst on Capitol Hill "
    },
    {
        "content": "NEW DELHI Indian regulators are privately pressuring major drug firms to better police how they sell popular codeine-based cough syrups to tackle smuggling and addiction  a move that is reducing supplies of a medicine doctors say is an effective treatment. | Video ",
        "date": "10272015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Exclusive: India battles big pharma over cough syrup abuse  reducing supplies "
    },
    {
        "content": "U.S. stocks ended slightly lower on Thursday as the market digested disappointing tech earnings reports and the potential for an interest rate hike in December.",
        "date": "10292015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Wall St. slips on tech results  chances of Fed hike "
    },
    {
        "content": "Oct 27 U.S. drugmaker Pfizer Inc  reported a much better-than-expected quarterly profit  mainly helped by demand for its pneumonia vaccine and breast cancer drug  Ibrance.",
        "date": "10272015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer profit beats as vaccine sales rise "
    },
    {
        "content": "* Indexes down: Dow .13 pct  S&P .04 pct  Nasdaq .42 pct   (Updates close with Valeant down after the bell; LinkedIn up)",
        "date": "10292015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St slips on tech results  chances of Fed hike "
    },
    {
        "content": "Oct 27 U.S. drugmaker Pfizer Inc  reported a 2.2 percent fall in quarterly revenue  hurt by a strong dollar.",
        "date": "10272015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer revenue falls about 2 pct on strong dollar "
    },
    {
        "content": "Oct 29 Pfizer Inc  the No. 1 U.S. drugmaker  and Botox maker Allergan Plc said they were in friendly talks to create a pharmaceutical colossus but the prospect that the company would seek to avoid U.S. taxes sounded political alarm bells.",
        "date": "10292015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 5-Pfizer  Allergan drug merger talks raise tax hackles in U.S. "
    },
    {
        "content": "* Indexes down: Dow .13 pct  S&P .04 pct  Nasdaq .42 pct   (Updates to close)",
        "date": "10292015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St ticks down as investors digest Fed  earnings "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.11 pct  Nasdaq 0.36 pct   (Updates to late afternoon)",
        "date": "10292015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St slips with eye on Fed rate hike in Dec "
    },
    {
        "content": " ",
        "date": "10292015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Pfizer  Allergan in talks to forge world's biggest drugmaker "
    },
    {
        "content": "* Indexes down: Dow 0.26 pct  S&P 0.13 pct  Nasdaq 0.34 pct   (Updates to early afternoon)",
        "date": "10292015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St lower as Fed puts Dec rate hike in play "
    },
    {
        "content": "NEW DELHI Indian regulators are privately pressuring major drug firms to better police how they sell popular codeine-based cough syrups to tackle smuggling and addiction  a move that is reducing supplies of a medicine doctors say is an effective treatment.",
        "date": "10132015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Exclusive: India battles big pharma over cough syrup abuse  reducing supplies "
    },
    {
        "content": "Oct 14 U.S. health regulators declined to approve Pfizer Inc's oral rheumatoid arthritis drug Xeljanz to treat moderate to severe cases of the scaly skin condition plaque psoriasis  the drugmaker said on Wednesday.",
        "date": "10142015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "FDA declines to expand approval of Pfizer arthritis drug "
    },
    {
        "content": "* Only a handful of Indian firms making biosimilars for US  EU",
        "date": "10142015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "India risks missing boat as biosimilars shake up drug industry "
    },
    {
        "content": "NEW DELHI Indian regulators are privately pressuring major drug firms to better police how they sell popular codeine-based cough syrups to tackle smuggling and addiction  a move that is reducing supplies of a medicine doctors say is an effective treatment.",
        "date": "10142015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Exclusive: India battles big pharma over cough syrup abuse  reducing supplies "
    },
    {
        "content": "WASHINGTON  Oct 6 The 500 largest American companies hold more than $2.1 trillion in accumulated profits offshore to avoid U.S. taxes and would collectively owe an estimated $620 billion in U.S. taxes if they repatriated the funds  according to a study released on Tuesday.",
        "date": "10062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "REFILE-Big U.S. firms hold $2.1 trillion overseas to avoid taxes -study "
    },
    {
        "content": "* Says it started investigating a novel  potential first-in- class bi-functional immunotherapy in clinical trials",
        "date": "10012015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Corrected-Merck KGaA says avelumab alliance with Pfizer on track "
    },
    {
        "content": "* Says it and Pfizer started  investigating a novel  potential first - in - class bi - functional  immunotherapy in clinical trials",
        "date": "10012015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Merck KGaA says avelumab alliance with Pfizer on track "
    },
    {
        "content": "Sept 30 Drugmaker Pfizer Inc raised its full-year revenue and adjusted profit forecast to reflect its recently closed deal for hospital products maker Hospira Inc.",
        "date": "09302015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer lifts FY adjusted profit forecast on Hospira buy "
    },
    {
        "content": "A federal judge in Pennsylvania on Wednesday threw out negligence and fraud claims in a products liability lawsuit filed by two Mexican poultry companies against Pfizer Inc and its former animal-health subsidiary Zoetis but declined to dismiss the action in its entirety.",
        "date": "09182015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Judge trims poultry-vaccine suit against Zoetis  Pfizer "
    },
    {
        "content": "* Evotec enters into licence and collaboration agreement with Pfizer Inc. in tissue fibrosis",
        "date": "09092015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-Evotec enters into licence and collaboration agreement with Pfizer "
    },
    {
        "content": "MUMBAI  Sept 7 India has again denied Pfizer Inc  a patent on its rheumatoid arthritis drug tofacitinib  the latest setback for a multinational drugmaker seeking to enforce its intellectual property rights in the country.",
        "date": "09072015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "India rejects patent on Pfizer's arthritis drug "
    },
    {
        "content": "BRUSSELS  Aug 18 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08182015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "EU mergers and takeovers (Aug 18) "
    },
    {
        "content": "A Manhattan federal judge has awarded plaintiffs' attorneys in a securities class action against drugmaker Pfizer Inc over off-label marketing more than $67 million in fees and expenses from a $400 million settlement reached in January.",
        "date": "08122015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Plaintiffs' attorneys to get $67 mln in Pfizer securities deal "
    },
    {
        "content": "* Baxalta CEO says can get to Shire bid value on its own   (Adds Baxalta CEO comments  paragraphs 4  13 and 14)",
        "date": "08102015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 1-Shire steps up drive to get Baxalta talking after $30 bln bid "
    },
    {
        "content": "LONDON  Aug 10 Shire Chief Executive Flemming Ornskov is stepping up his campaign to get Baxalta  to the negotiating table as he pushes the benefits a $30 billion takeover offer to the U.S. biotech company's shareholders.",
        "date": "08102015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Shire CEO steps up drive to get Baxalta board talking "
    },
    {
        "content": "Britain's competition watchdog has accused Pfizer and Flynn Pharma of breaching UK and European law by ramping up the cost of an epilepsy drug  given to more than 50 000 British patients  by as much as 2 600 percent.",
        "date": "08062015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Britain raps Pfizer over huge jump in epilepsy drug price "
    },
    {
        "content": "BRUSSELS U.S. drugmaker Pfizer  gained European Union antitrust approval on Tuesday for its proposed $15 billion acquisition of U.S. rival Hospira  after pledging to sell some drugs to allay competition concerns.",
        "date": "08042015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer wins EU approval for $15 billion Hospira buy "
    },
    {
        "content": "BRUSSELS  Aug 5 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08052015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "EU mergers and takeovers (Aug 5) "
    },
    {
        "content": "* Pfizer says drug had previously been unprofitable   (Adds Pfizer comment on drug's profitability)",
        "date": "08062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 3-Britain raps Pfizer over huge jump in epilepsy drug price "
    },
    {
        "content": "BRUSSELS  Aug 4 U.S. drugmaker Pfizer  gained European Union antitrust approval on Tuesday for its proposed $15 billion acquisition of U.S. rival Hospira  after pledging to sell some drugs to allay competition concerns.",
        "date": "08042015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "CORRECTED-Pfizer wins EU approval for $15 bln Hospira buy "
    },
    {
        "content": "BRUSSELS  Aug 3 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08032015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "EU mergers and takeovers (Aug 3) "
    },
    {
        "content": "Pfizer Inc on Tuesday reported better-than-expected second-quarter profit and revenue  helped by strong demand for its pneumonia vaccine and new breast cancer drug  sending its shares up 1 percent.",
        "date": "07282015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer's revenue  profit beat as vaccine sales rise "
    },
    {
        "content": "July 27 Eli Lilly and Co on Monday said it would continue a large study of its high-profile experimental drug to raise \"good\" HDL cholesterol and lower \"bad\" LDL cholesterol  acting on the recommendation of a data monitoring committee.",
        "date": "07272015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Lilly continues test of HDL cholesterol drug  on panel's advice "
    },
    {
        "content": "July 28 Pfizer Inc on Tuesday reported better-than-expected second-quarter profit and revenue  helped by strong demand for its pneumonia vaccine and new breast cancer drug  sending its shares up 1 percent.",
        "date": "07282015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Pfizer's revenue  profit beat as vaccine sales rise "
    },
    {
        "content": "* Futures up: Dow 71 pts  S&P 10 pts  Nasdaq 18 pts   (Adds details  comment  updates prices)",
        "date": "07282015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St set to open higher ahead of Fed meeting "
    },
    {
        "content": "July 28 U.S. drugmaker Pfizer Inc  reported a 7 percent fall in quarterly revenue  hurt by a strong dollar.",
        "date": "07282015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer revenue falls 7 percent "
    },
    {
        "content": "BRUSSELS  July 24 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "07242015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "EU mergers and takeovers (July 24) "
    },
    {
        "content": "July 15 Pfizer Ltd :  * Intimated the concerned authorities that it intends to effect closure of its plant situated at thane belapur road  navi Mumbai  * Decision To close the plant is based on an assessment of its long term viability and its ability to achieve the needed production  * Closure will not impact the supply of any of the company's medicines to patients  * There has practically been no production activity at this plant since 2013  * Source text: http://bit.ly/1f2pgRU  * F",
        "date": "07152015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "REFILE-BRIEF-Pfizer's Indian unit intends to close Navi Mumbai plant "
    },
    {
        "content": "July 14 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "07142015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "BRUSSELS  July 14 U.S. drugmaker Pfizer  has offered concessions in a bid to win European Union regulatory approval for its $15 billion takeover of U.S. rival Hospira  the European Commission said on Tuesday.",
        "date": "07142015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer offers concessions in bid to win EU okay for Hospira deal "
    },
    {
        "content": "MUMBAI The U.S. Food and Drug Administration has banned drug imports from an India manufacturing unit of Emcure Pharmaceuticals Ltd over violations of standard manufacturing practices  the latest in a series of Indian firms to face such action.",
        "date": "07142015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "U.S. FDA bans Emcure Pharma's India plant over manufacturing issues "
    },
    {
        "content": "MUMBAI  July 14 The U.S. Food and Drug Administration has banned drug imports from an India manufacturing unit of Emcure Pharmaceuticals Ltd over violations of standard manufacturing practices  the latest in a series of Indian firms to face such action.",
        "date": "07142015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US FDA bans Emcure Pharma's India plant over manufacturing issues "
    },
    {
        "content": "Pfizer Inc is seeking to strike a major blow to litigation over its antidepressant Zoloft by asking a federal judge  for a second time  to disqualify a key expert witness that plaintiffs say can show the drug causes birth defects.",
        "date": "07072015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Zoloft plaintiffs  Pfizer set to spar in second hearing on expert witnesses "
    },
    {
        "content": "Canada-based drugmaker Valeant Pharmaceuticals International Inc   has approached to buy Zoetis Inc   an animal-health company  the Wall Street Journal reported.",
        "date": "06252015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Canada's Valeant approaches to buy Zoetis: WSJ "
    },
    {
        "content": "LONDON  June 22 GlaxoSmithKline has agreed to sell two meningitis vaccines to Pfizer to satisfy antitrust concerns after its recent acquisition of vaccines business of Novartis.",
        "date": "06222015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "GSK sells two vaccines to Pfizer to ease competition concerns "
    },
    {
        "content": "NEW YORK A U.S. jury on Thursday said Pfizer Inc was not responsible for birth defects in a young girl whose mother took its antidepressant Zoloft while pregnant  the second straight win for the company out of hundreds of similar lawsuits.",
        "date": "06112015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "U.S. jury clears Pfizer in second trial alleging Zoloft birth defects "
    },
    {
        "content": "NEW YORK  June 11 A U.S. jury on Thursday said Pfizer Inc was not responsible for birth defects in a young girl whose mother took its antidepressant Zoloft while pregnant  the second straight win for the company out of hundreds of similar lawsuits.",
        "date": "06112015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-U.S. jury clears Pfizer in second trial alleging Zoloft birth defects "
    },
    {
        "content": "NEW YORK  June 11 A U.S. jury on Thursday found Pfizer Inc not liable in a lawsuit claiming its antidepressant Zoloft caused birth defects in an eight-year old girl whose mother took the drug while pregnant  according to a company spokeswoman.",
        "date": "06112015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "U.S. jury clears Pfizer in second trial over Zoloft "
    },
    {
        "content": "FRANKFURT  June 1 The head of Merck KGaA's  healthcare division said she expected its cancer drug avelumab  jointly developed with Pfizer  to be among the first two or three to market in a field of immunotherapy pharmaceuticals that harness the power of the immune system in a range of cancer types.",
        "date": "06012015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Merck KGaA sees immunotherapy drug holding its own in cancer race "
    },
    {
        "content": "CHICAGO May 30 A Phase III trial of Pfizer Inc's  drug Ibrance showed that  in combination with hormone therapy  the drug more than doubled the duration of disease control for women with the most common type of breast cancer.",
        "date": "05302015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer's Ibrance drug slows progression of breast cancer "
    },
    {
        "content": "CHICAGO May 30 A Phase III trial of Pfizer Inc's  Ibrance showed that  in combination with hormone therapy  the drug more than doubled the duration of disease control for women with the most common type of breast cancer.",
        "date": "05302015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer's Ibrance drug slows progression of breast cancer "
    },
    {
        "content": "Shares in French cancer drugmaker Cellectis  hit an all-time high on Friday on hopes it would be the latest in a string of bid targets in the healthcare sector  after reported interest from companies including Pfizer .",
        "date": "05292015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "French biotech firm Cellectis jumps on takeover hopes "
    },
    {
        "content": "May 29 Shares in French cancer drugmaker Cellectis hit an all-time high on Friday on hopes it would be the latest in a string of bid targets in the healthcare sector  after reported interest from companies including Pfizer .",
        "date": "05292015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-French biotech firm Cellectis jumps on takeover hopes "
    },
    {
        "content": "French cancer drugmaker Cellectis  is in potential sale talks with a few suitors  including U.S. based Pfizer Inc   the Financial Times reported citing people familiar with the matter.",
        "date": "05282015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "French drugmaker Cellectis in sale talks: FT "
    },
    {
        "content": "May 28 French cancer drugmaker Cellectis  is in potential sale talks with a few suitors  including U.S. based Pfizer Inc  the Financial Times reported citing people familiar with the matter.",
        "date": "05282015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "French drugmaker Cellectis in sale talks -FT "
    },
    {
        "content": "WASHINGTON  May 28 The U.S. Food and Drug Administration on Thursday approved the first drug to treat a rare  progressive lung disease that mainly affects women of childbearing age.",
        "date": "05282015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-FDA approves Pfizer drug to treat very rare lung disease "
    },
    {
        "content": "A drug being developed by Roche Holding AG was shown in pivotal trials to shrink tumors in patients with advanced lung cancer with a specific gene mutation who had stopped responding to crizotinib  another drug in the same class.",
        "date": "05132015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Roche drug shrinks tumors in half of patients with lung cancer mutation "
    },
    {
        "content": "Three major business groups have asked a U.S. appeals court to uphold the dismissal of a former Pfizer Inc sales representative's suit claiming the pharmaceutical giant violated federal law by refusing to provide her with a full-time driver when she became legally blind.",
        "date": "05132015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Business groups say ADA doesn't entitle blind Pfizer worker to driver "
    },
    {
        "content": "May 11 Mylan NV's Chairman Robert Coury said he may sweeten the company's offer for Perrigo Co Plc  by adding terms that will reduce risk to Perrigo's shareholders  sources told Bloomberg on Monday.",
        "date": "05122015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Mylan chairman said to consider Perrigo sweeteners to make deal -Bloomberg "
    },
    {
        "content": "NEW YORK  May 11 It wasn't long ago that politics  like religious orientation or sexual preference  was a taboo topic in the American workplace. Political beliefs were considered a private affair - off limits to the boss.",
        "date": "05112015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "INSIGHT-The new US office politics: funding your boss's political causes "
    },
    {
        "content": "NEW YORK  May 11 It wasn't long ago that politics  like religious orientation or sexual preference  was a taboo topic in the American workplace. Political beliefs were considered a private affair - off limits to the boss.",
        "date": "05112015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "RPT-INSIGHT-The new US office politics: funding your boss's political causes "
    },
    {
        "content": "Animal health products maker Zoetis Inc said it plans to cut up to a quarter of its workforce and exit nearly 40 percent of its manufacturing plants in its first major restructuring since being spun off from Pfizer Inc two years ago.",
        "date": "05052015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Zoetis to cut up to 2 500 jobs  shut storage units "
    },
    {
        "content": "* Shares up 0.6 pct in afternoon trading   (Adds CEO comments  analyst comments  details; updates shares)",
        "date": "05052015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Zoetis to cut up to 2 500 jobs  shut storage units "
    },
    {
        "content": "NEW YORK/LONDON Pfizer Inc  is the mystery bidder for Swedish Orphan Biovitrum AB   the rare disease specialist which disclosed this week that a potential buyer had made a preliminary offer  people with knowledge of the situation said.",
        "date": "04302015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Exclusive: Pfizer is mystery bidder for rare disease drugmaker Sobi - sources "
    },
    {
        "content": "* CEO says no comment on Pfizer  completely focused on developing pipeline",
        "date": "04242015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "BRIEF-AstraZeneca open to acquisitions  smaller deals more likely "
    },
    {
        "content": "U.S. drugmaker Pfizer Inc  cut its full-year revenue and profit forecast  blaming a stronger dollar.",
        "date": "04282015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer cuts full-year forecast on stronger dollar "
    },
    {
        "content": "April 28 U.S. drugmaker Pfizer Inc cut its full-year revenue and profit forecast  blaming a stronger dollar.",
        "date": "04282015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer cuts full-year forecast on stronger dollar "
    },
    {
        "content": "April 28 Pfizer Inc reported a 4 percent fall in quarterly revenue  hurt by a stronger dollar.",
        "date": "04282015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer quarterly revenue falls on stronger dollar "
    },
    {
        "content": "April 15 Pfizer Inc said on Wednesday the first formal late-stage trial of its approved treatment for advanced breast cancer  Ibrance  was stopped early after the medicine met its goal of delaying progression of the disease in previously treated patients.",
        "date": "04152015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Approved Pfizer breast cancer drug impresses in latest study "
    },
    {
        "content": "Pfizer Inc scored a key victory Friday when it was cleared of liability in the first U.S. trial involving claims that its antidepressant Zoloft can cause birth defects in children born to women who take the drug while pregnant.",
        "date": "04172015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer wins first U.S. trial over Zoloft birth-defect risk "
    },
    {
        "content": "* New drugs make progress  high hopes in lung cancer treatment",
        "date": "04152015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "AstraZeneca science is on the move  one year on from Pfizer bid "
    },
    {
        "content": "April 17 Pfizer Inc scored a key victory Friday when it was cleared of liability in the first U.S. trial involving claims that its antidepressant Zoloft can cause birth defects in children born to women who take the drug while pregnant.",
        "date": "04172015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Pfizer wins first U.S. trial over Zoloft birth-defect risk "
    },
    {
        "content": "A large study of Bristol-Myers Squibb Co's Opdivo treatment has been halted after proving the drug is effective against the most common form of lung cancer  the company said  positioning the medicine for far wider use than its already approved lung cancer and melanoma indications.",
        "date": "04172015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Bristol's Opdivo proves effective against second type of lung cancer "
    },
    {
        "content": "April 17 A large study of Bristol-Myers Squibb Co's Opdivo treatment has been halted after proving the drug is effective against the most common form of lung cancer  the company said  positioning the medicine for far wider use than its already approved lung cancer and melanoma indications.",
        "date": "04172015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Bristol's Opdivo proves effective against second type of lung cancer "
    },
    {
        "content": "Pfizer Inc has asked a federal judge in Pennsylvania to reject plaintiffs' request for more time to find a new expert who can testify that its antidepressant Zoloft can cause birth defects in children born to women who took the drug while pregnant.",
        "date": "04142015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer spars with Zoloft plaintiffs over deadline for new expert "
    },
    {
        "content": "Drugmaker Mylan N.V said it settled a patent litigation with Pfizer Inc related to Viagra  paving the way for the launch of the drug's generic version in the United States once approved.",
        "date": "04132015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Mylan settles Viagra patent litigation with Pfizer "
    },
    {
        "content": "April 13 Drugmaker Mylan N.V said it settled a patent litigation with Pfizer Inc related to Viagra  paving the way for the launch of the drug's generic version in the United States once approved.",
        "date": "04132015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Mylan settles Viagra patent litigation with Pfizer "
    },
    {
        "content": "Hospira Inc  which agreed in February to be bought by Pfizer Inc  said the U.S. Food and Drug Administration had sent it another warning letter detailing violations in standard drug manufacturing practices at one of its facilities.",
        "date": "04072015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Hospira gets FDA warning letter for Italian facility "
    },
    {
        "content": "April 7 Hospira Inc  which agreed in February to be bought by Pfizer Inc  said the U.S. Food and Drug Administration had sent it another warning letter detailing violations in standard drug manufacturing practices at one of its facilities.",
        "date": "04072015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Hospira gets FDA warning letter for Italian facility "
    },
    {
        "content": "April 3    -- Source link: (http://on.ft.com/1P5flsH)",
        "date": "04032015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "MEDIA- Pfizer halts China vaccine sales after import license not renewed -FT "
    },
    {
        "content": "SHANGHAI  April 2 U.S. drugmaker Pfizer Inc  said on Thursday it will cease its vaccines sales operations in China after an import licence for one of its top-selling treatments  the only vaccine it sold in the country  was not renewed.",
        "date": "04022015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer to shutter vaccines sales business in China "
    },
    {
        "content": "Pfizer Inc and Eli Lilly and Co will resume  late-stage studies of their drug tanezumab for chronic pain after the U.S. Food and Drug Administration lifted a partial hold on trials of it and similar medicines.",
        "date": "03232015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer  Lilly to resume study testing pain drug "
    },
    {
        "content": "March 23 Pfizer Inc and Eli Lilly and Co  will resume  late-stage studies of their drug tanezumab for chronic pain after the U.S. Food and Drug Administration lifted a partial hold on trials of it and similar medicines.",
        "date": "03232015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 2-Pfizer  Lilly to resume study testing pain drug "
    },
    {
        "content": "San Diego  March 15 Studies of a new class of experimental cholesterol-lowering drugs signal that they can reduce by half the risk of heart attack and other major cardiovascular problems compared to standard treatment alone.",
        "date": "03152015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 1-Experimental cholesterol drugs cut heart risk  but questions remain "
    },
    {
        "content": "* Backers include British govt  GSK  J&J  Pfizer  Lilly  Biogen",
        "date": "03172015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 1-Dementia drug research aided by $100 mln venture capital fund "
    },
    {
        "content": "LONDON Pfizer is seeking new vaccine opportunities across the age spectrum as it broadens its portfolio by delivering shots into the arms of adolescents and the elderly  as well as infants.",
        "date": "03122015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer hunts for new vaccines to protect young and old "
    },
    {
        "content": "The U.S. Food and Drug Administration warned on Monday that Pfizer Inc's quit-smoking drug  Chantix  has been associated with seizures and that some patients who drink while taking the drug may become aggressive or black out.",
        "date": "03102015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "FDA warns of seizure  alcohol risk with Pfizer's Chantix "
    },
    {
        "content": "LONDON/LOS ANGELES  March 6 A revolution is brewing in healthcare with lower-cost copies of complex biotech drugs finally set to reach the United States  nine years after so-called biosimilars were launched in Europe.",
        "date": "03062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "INSIGHT-Copy me: Europe shows U.S. a path to cheaper biotech drugs "
    },
    {
        "content": "The U.S. Food and Drug Administration warned on Monday that Pfizer Inc's quit-smoking drug  Chantix  has been associated with seizures and that some patients who drink while taking the drug may become aggressive or black out.",
        "date": "03092015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "U.S. FDA warns of seizure  alcohol risk with Pfizer's Chantix "
    },
    {
        "content": "March 9 The U.S. Food and Drug Administration warned on Monday that Pfizer Inc's quit-smoking drug  Chantix  has been associated with seizures and that some patients who drink while taking the drug may become aggressive or black out.",
        "date": "03092015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-U.S. FDA warns of seizure  alcohol risk with Pfizer's Chantix "
    },
    {
        "content": "The U.S. Food and Drug Administration has declined to reduce the severity of its warning about neuropsychiatric side effects associated with Pfizer Inc's  quit-smoking drug Chantix  the agency said on Monday.",
        "date": "03092015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "FDA declines to remove serious warning on Pfizer's Chantix "
    },
    {
        "content": "March 9 The U.S. Food and Drug Administration has declined to reduce the severity of its warning about neuropsychiatric side effects associated with Pfizer Inc's  quit-smoking drug Chantix  the agency said on Monday.",
        "date": "03092015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "U.S. FDA declines to remove serious warning on Pfizer's Chantix "
    },
    {
        "content": "PARIS  Feb 20 Sanofi's new boss Olivier Brandicourt could earn up to 4.2 million euros ($4.8 million) a year at the drugs group and  pocket an extra 4 million euros within 12 months as a one-off golden handshake.",
        "date": "02202015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "UPDATE 1-Sanofi's new boss could earn more than Total's  less than Pfizer's "
    },
    {
        "content": "NEW YORK  Feb 10 U.S. stocks rose on Tuesday on hopes that Greek debt negotiations could result in a deal that stabilizes Europe although a drop in oil prices limited the advance.",
        "date": "02102015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "REFILE-US STOCKS-Wall St rises on Greek deal hopes even as energy drops "
    },
    {
        "content": "Drugmaker Pfizer Inc  said it entered into an agreement with Goldman  Sachs & Co to buy back $5 billion of its stock.",
        "date": "02092015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer in $5 billion accelerated buyback deal with Goldman  Sachs & Co "
    },
    {
        "content": "Feb 9 Drugmaker Pfizer Inc said it entered into an agreement with Goldman  Sachs & Co to buy back $5 billion of its stock.",
        "date": "02092015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer in $5 bln accelerated buyback deal with Goldman  Sachs & Co "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 06 (Fitch) Fitch Ratings has affirmed Pfizer Inc.'s (Pfizer's)  ratings  including the 'A+' Issuer Default Rating (IDR). The rating action  follows Pfizer's announcement that it will acquire Hospira  Inc. (HSP) for  roughly $17 billion which includes approximately $1.7 billion in HSP debt. The  rating action applies to approximately $38.9 billion of consolidated debt  outstanding as of Sept. 28  2014. The Rating Outloo",
        "date": "02062015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Fitch Affirms Pfizer's IDR at 'A+'; Outlook Stable "
    },
    {
        "content": "NEW YORK  Feb 5 Pfizer Inc's $15 billion deal to buy Hospira Inc will allow the largest U.S. drugmaker to benefit from specialty generic medicines that are commanding far higher prices than traditional off-patent pills  industry investors and analysts said.",
        "date": "02062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "RPT-Pfizer's Hospira deal bets on price spike for specialty generics "
    },
    {
        "content": "By Caroline Humer  Ransdell Pierson  Vidya L Nathan and Natalie Grover | Video ",
        "date": "02062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to buy Hospira for $15 billion to bolster hospital products "
    },
    {
        "content": "NEW YORK - U.S. stocks climbed on Thursday as energy shares bounced with oil prices  while news Pfizer Inc would buy Hospira Inc in a massive deal further boosted the market.",
        "date": "02062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "India Morning Call-Global Markets "
    },
    {
        "content": "NEW YORK Pfizer Inc's $15 billion deal to buy Hospira Inc will allow the largest U.S. drugmaker to benefit from specialty generic medicines that are commanding far higher prices than traditional off-patent pills  industry investors and analysts said.",
        "date": "02062015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer's Hospira deal bets on price spike for specialty generics "
    },
    {
        "content": "Feb 3 The U.S. Food and Drug Administration on Tuesday said it had approved Pfizer Inc's experimental breast cancer drug Ibrance  a regulatory decision that came more than two months earlier than expected.",
        "date": "02032015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "U.S. FDA approves Pfizer's high profile breast cancer drug "
    },
    {
        "content": "NEW YORK  Feb 5 Pfizer Inc's $15 billion deal to buy Hospira Inc will allow the largest U.S. drugmaker to benefit from specialty generic medicines that are commanding far higher prices than traditional off-patent pills  industry investors and analysts said.",
        "date": "02052015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer's Hospira deal bets on price spike for specialty generics "
    },
    {
        "content": "NEW YORK U.S. stocks climbed on Thursday as energy shares bounced with oil prices  while news Pfizer would buy Hospira in a massive deal further boosted the market. | Video ",
        "date": "02052015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Wall St climbs with energy rebound  Pfizer deal "
    },
    {
        "content": "* Indexes up: Dow 1.2 pct  S&P 1 pct  Nasdaq 1 pct   (Updates to close)",
        "date": "02052015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St climbs with energy rebound  Pfizer deal "
    },
    {
        "content": "Pfizer Inc  said it would buy Hospira Inc  for about $15 billion to boost its portfolio of generic injectable drugs and copies of biotech medicines. | Video ",
        "date": "02052015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to buy Hospira for $15 billion to bolster hospital products "
    },
    {
        "content": "Feb 5 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "02052015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  Feb 5 (IFR) - Merck & Co's US$8bn jumbo bond is just the tip of the iceberg of debt supply from the healthcare sector in the months ahead with brand names like Novartis and Pfizer set to compete for investor cash.",
        "date": "02052015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Low rates  M&A spur flood of pharma debt deals "
    },
    {
        "content": "* Indexes up: Dow 0.9 pct  S&P 0.8 pct  Nasdaq 0.6 pct   (Updates to afternoon)",
        "date": "02052015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St climbs with energy bounce  Pfizer deal "
    },
    {
        "content": "(Reuters Breakingviews) - Pfizer has made more than its share of value-destroying acquisitions. The pharmaceutical giant's $15 billion purchase of Hospira could reverse that history. The injectable-drug maker's strength in non-branded medications should boost Pfizer's own generics unit - and open the way for spinning it off.",
        "date": "02052015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Breakingviews: Pfizer's generics injection lifts mood for breakup "
    },
    {
        "content": "* Indexes up: Dow 0.9 pct  S&P 0.8 pct  Nasdaq 0.6 pct   (Updates to midday  changes byline)",
        "date": "02052015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Wall St gains with energy bounce  Pfizer deal "
    },
    {
        "content": "NEW YORK  Jan 27 Pfizer Inc said on Tuesday it agreed to pay $400 million to avert a trial in a class action lawsuit accusing the pharmaceutical giant of misleading investors in connection with off-label marketing.",
        "date": "01272015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer to pay $400 million to avert investor class action trial "
    },
    {
        "content": "LONDON Pfizer is to cut the price of its pneumococcal vaccine Prevenar 13 by 6 percent to $3.10 per dose in poor countries as part of a commitment to the GAVI global vaccines alliance  the U.S. drugmaker said on Monday.",
        "date": "01262015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer cuts vaccine price for poor as GAVI group seeks $7.5 billion "
    },
    {
        "content": "Jan 27 Pfizer Inc reported stronger-than-expected quarterly results as sales of vaccines and cancer drugs increased  but the company forecast 2015 earnings below Wall Street expectations  citing patent expirations and the stronger dollar.",
        "date": "01272015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer's 2015 forecast disappoints  crimped by generics  dollar "
    },
    {
        "content": "LONDON  Jan 26 Pfizer is to cut the price of its pneumococcal vaccine Prevenar 13 by 6 percent to $3.10 per dose in poor countries as part of a commitment to the GAVI global vaccines alliance  the U.S. drugmaker said on Monday.",
        "date": "01262015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer cuts vaccine price for poor as GAVI group seeks $7.5 bln "
    },
    {
        "content": "Jan 27 Pfizer Inc :  * CEO says company doesn't need to do a big deal  would consider worthwhile",
        "date": "01272015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "BRIEF-Pfizer CEO says company doesn't need to do a big deal "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)  Apple Inc is expected to report one of its strongest quarters ever  helped by strong unit sales of its larger-screen iPhone 6 and 6 Plus. The new iPhones are helping Apple chip away at Samsung Electronics' dominant position in its home turf of South K",
        "date": "01262015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "What to Watch in the Day Ahead - Tuesday  Jan. 27 "
    },
    {
        "content": "NEW YORK  Jan 26 A new wave of experimental cancer drugs that directly recruit the immune system's powerful T cells are proving to be immensely effective weapons against tumors  potentially transforming the $100 billion global market for drugs that fight the disease.",
        "date": "01262015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "RPT - INSIGHT-Safety concerns cloud early promise of powerful new cancer drugs "
    },
    {
        "content": "Jan 27 Pfizer Inc reported stronger-than-expected quarterly sales due to cost cuts and demand for its vaccines and cancer drugs  but the company forecast 2015 earnings below Wall Street expectations  citing patent expirations and the stronger dollar.",
        "date": "01272015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "UPDATE 1-Pfizer's 2015 forecast disappoints  crimped by generics  dollar "
    },
    {
        "content": "NEW YORK A new wave of experimental cancer drugs that directly recruit the immune system's powerful T cells are proving to be immensely effective weapons against tumors  potentially transforming the $100 billion global market for drugs that fight the disease.",
        "date": "01262015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Safety concerns cloud early promise of powerful new cancer drugs "
    },
    {
        "content": "NEW YORK  Jan 27 U.S. stock index futures fell on Tuesday  weighed by company earnings results including those of Microsoft  while concerns lingered over Greece's new anti-bailout government and its implications for the euro zone.",
        "date": "01272015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "US STOCKS-Futures fall with Microsoft  Greek worries linger "
    },
    {
        "content": "NEW YORK  Jan 26 A new wave of experimental cancer drugs that directly recruit the immune system's powerful T cells are proving to be immensely effective weapons against tumors  potentially transforming the $100 billion global market for drugs that fight the disease.",
        "date": "01262015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "INSIGHT-Safety concerns cloud early promise of powerful new cancer drugs "
    },
    {
        "content": "Jan 20 Johnson & Johnson surprised investors by detailing the degree to which a strong dollar will hurt sales abroad this year  and industry watchers say Wall Street is underestimating the likely hit to other U.S.-based rivals such as Pfizer Inc and Merck & Co.",
        "date": "01202015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Johnson & Johnson's forex warning a sign for rival drugmakers "
    },
    {
        "content": "LONDON  Jan 20 the international charity Medecins Sans Frontieres urged drugmakers GlaxoSmithKline  and Pfizer on Tuesday to slash the price of their pneumococcal vaccines to $5 per child in poor countries.",
        "date": "01202015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "MSF slams expensive vaccines  urges GSK and Pfizer to cut prices "
    },
    {
        "content": "Pfizer Inc  one of several drugmakers racing to commercialize a new class of cholesterol-lowering injections  is also developing an oral pill and vaccine that target the \"bad\" cholesterol protein  PCSK9  according to Mikael Dolsten  the company's research and development chief.",
        "date": "01132015",
        "name": "Pfizer Inc",
        "news_type": "topStory",
        "symbol": "PFE",
        "title": "Pfizer developing PCSK9 pill  vaccine to lower cholesterol "
    },
    {
        "content": "Jan 12 Privately held 23andMe Inc said Pfizer Inc would have access to its research services  helping the pharmaceutical giant better understand the lupus disease.",
        "date": "01122015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer partners with DNA research firm to study lupus disease "
    },
    {
        "content": "Jan 8 Pfizer Inc said Thursday it has begun talks with the U.S. Food and Drug Administration to finalize the prescription label of its breast cancer drug palbociclib  in an indication the drug was likely closer to regulatory approval.",
        "date": "01082015",
        "name": "Pfizer Inc",
        "news_type": "normal",
        "symbol": "PFE",
        "title": "Pfizer  FDA in talks on prescription details for key breast cancer drug "
    }
]