[
    {
        "content": "Philips and Zoll Medical Corp have disclosed that they are nearing a settlement in a long-running patent lawsuit that would avoid an appeal by Philips of a jury's August decision to award it only a fraction of the $217 million it sought at trial.",
        "date": "11062017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips  Zoll Medical near settlement in defibrillator patent lawsuit "
    },
    {
        "content": "* ‍REITERATES ITS TARGETS OF 4% - 6% COMPARABLE SALES GROWTH FOR 2017 - 2020 PERIOD​",
        "date": "11022017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips ‍reiterates its targets for 2017 - 2020 period​ "
    },
    {
        "content": "* COLLABORATES WITH THANH VU MEDIC GENERAL HOSPITAL IN VIETNAM‍​",
        "date": "11012017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips collaborates with Thanh Vu Medic General Hospital in Vietnam‍​ "
    },
    {
        "content": "WASHINGTON  Oct 31 A federal court barred Philips North America LLC and two of its executives from distributing certain medical devices  including some of the company's external defibrillators  until the company takes remedial steps  the Department of Justice said on Tuesday.",
        "date": "10312017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "U.S. court bars Philips from selling some defibrillators "
    },
    {
        "content": "* INITIATES SHARE REPURCHASE PROGRAM FOR AN AMOUNT OF UP TO EUR 150 MILLION",
        "date": "10302017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips starts share repurchase program for up to 150 million euros "
    },
    {
        "content": "AMSTERDAM Strong demand for its electric toothbrushes in China helped Dutch healthcare technology company Philips to a 4 percent rise in sales in the third quarter  on track to hit its full-year target  the company said on Monday.",
        "date": "10232017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips growth spurred by toothbrush demand in China "
    },
    {
        "content": "* Philips sales grow 4 percent in Q3 on strong demand in China",
        "date": "10232017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips growth spurred by toothbrush demand in China "
    },
    {
        "content": "* Q3 SALES INCREASED TO EUR 4.1 BILLION  WITH COMPARABLE SALES GROWTH OF 4%‍​",
        "date": "10232017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips Q3 sales rise to 4.1 billion euros‍​ "
    },
    {
        "content": "AMSTERDAM  Oct 23 Dutch health technology company Philips said on Monday  its core profits in the third quarter rose 12 percent to 532 million euros  ($626.11 million)  as strong growth in China pushed sales up 4 percent.",
        "date": "10232017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips Q3 core profit rises 12 pct "
    },
    {
        "content": "AMSTERDAM Health technology company Philips is suspending the manufacture of some defibrillators in the United States and will make others under heightened scrutiny following criticisms from U.S. regulators  in a move it said would dent profits.",
        "date": "10112017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips sees profit hit from U.S. defibrillator blow "
    },
    {
        "content": "* Latest in a series of disputes with U.S. regulators (Updates with CEO comments  background  shares)",
        "date": "10112017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips sees profit hit from U.S. defibrillator blow "
    },
    {
        "content": "* PHILIPS REACHES AGREEMENT WITH THE U.S. GOVERNMENT ON A CONSENT DECREE FOCUSING ON THE COMPANY’S DEFIBRILLATOR MANUFACTURING IN THE U.S.",
        "date": "10112017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Philips' subsidiary Philips North America LLC reaches agreement with U.S. DoJ  representing FDA "
    },
    {
        "content": "* ‍PHILIPS AND INDONESIAN SILOAM HOSPITALS SIGN MULTIYEAR PARTNERSHIP AGREEMENT​",
        "date": "10052017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips and Indonesian Siloam Hospitals sign multi-year partnership agreement "
    },
    {
        "content": "* RECLASSIFICATION EFFECTIVE AS OF OPENING OF EUROPEAN MARKETS ON SEPTEMBER 1  2017 Source text: http://philips.to/2gxBNPI Further company coverage: (Gdynia Newsroom:)",
        "date": "09042017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips reclassified to health care sector by MSCI‍​ "
    },
    {
        "content": "A federal jury on Thursday ordered medical equipment maker Zoll Medical Corp to pay Philips a net verdict of $7.1 million for infringing three patents covering technology related to external defibrillators  far less than the Dutch lighting and electronics company had sought.",
        "date": "08042017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips nets $7.1 million in patent verdict against Zoll Medical "
    },
    {
        "content": "* Says the company files a third trial appeal against Royal Philips of the Netherlands with Intellectual Property Court  on July 31  regarding DVD optical disk patent infringement case",
        "date": "07312017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Gigastorage files third trial appeal against Royal Philips of the Netherlands "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA  July 28 (Fitch) Fitch Ratings has affirmed Royal Philips' (Philips) Long-Term Issuer Default Rating (IDR) and senior unsecured ratings at 'A-'. The Outlook is Stable. The affirmation is driven by Fitch's expectation that Philips' credit profile will remain in line with the group's ratings  following the announcement of multiple acquisitions  including Spectranetics for EUR1.9 billion  and a new shareholder buyback programme t",
        "date": "07282017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Fitch Affirms Royal Philips at 'A-'; Outlook Stable "
    },
    {
        "content": "AMSTERDAM  July 25 Dutch paint maker Akzo Nobel on Tuesday said it would hold an extra shareholders meeting on Sept 8  on the appointment of a new CEO and to explain its rejection of a 26.3 billion euro ($30.63 billion) takeover bid by U.S. rival PPG Industries. (Reporting by Bart Meijer; Editing by Himani Sarkar)",
        "date": "07252017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Akzo Nobel will hold extra shareholders' meeting on Sept. 8 "
    },
    {
        "content": "* Philips adjusted earnings before interest  taxes  and amortisation (EBITA) rise 15 percent in Q2",
        "date": "07242017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips upbeat after U.S. business rebounds "
    },
    {
        "content": "* Q2 NET INCOME FROM CONTINUING OPERATIONS AMOUNTED TO EUR 161 MILLION  COMPARED TO EUR 118 MILLION IN Q2 2016",
        "date": "07242017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Philips Q2 net income from continuing operations rises to 161 million euros "
    },
    {
        "content": "AMSTERDAM  July 24 Dutch health technology company Philips on Monday said its core profit in the second quarter rose to 439 million euros  ($512.31 million)  in line with expectations  as sales grew 4 percent and its order intake was \"strong\".",
        "date": "07242017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips reports Q2 profit growth with strong order intake "
    },
    {
        "content": "* SIGNED AN AGREEMENT TO ACQUIRE TOMTEC IMAGING SYSTEMS GMBH‍​",
        "date": "07182017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips signes an agreement to acquire TomTec Imaging Systems‍​ "
    },
    {
        "content": "* PHILIPS AND WEST PHYSICS SIGN EXCLUSIVE PARTNERSHIP TO PROVIDE HEALTHCARE ORGANIZATIONS WITH A COMPREHENSIVE RADIATION DOSE MANAGEMENT PROGRAM Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "07172017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips and West Physics sign partnership to provide healthcare organizations "
    },
    {
        "content": "* PHILIPS EXPANDS ITS UGROW DIGITAL PARENTING PLATFORM WITH ACQUISITION OF HEALTH & PARENTING LTD Source text: http://philips.to/2sl7Qaz Further company coverage: (Gdynia Newsroom)",
        "date": "07042017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Royal Philips acquires Health & Parenting Ltd "
    },
    {
        "content": "* PHILIPS AND SINGAPORE INSTITUTE OF ADVANCED MEDICINE HOLDINGS SIGN AGREEMENT TO OPEN FIRST-OF-ITS-KIND ONCOLOGY CENTER IN SINGAPORE",
        "date": "07062017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips and Singapore institute of advanced medicine sign agreement to open oncology center in Singapore "
    },
    {
        "content": "AMSTERDAM Dutch healthcare company Philips  has agreed to buy U.S.-based Spectranetics Corp   a maker of devices to treat heart disease  for 1.9 billion euros ($2.16 billion) including debt  as it expands its image-guided therapy business. | Video ",
        "date": "06282017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips to buy medical device maker Spectranetics for 1.9 billion euros "
    },
    {
        "content": "* Profound Medical -Philips to transfer Sonalleve MR-HIFU assets to profound for upfront consideration of 7.4 million common shares of profound at C$1.10/share",
        "date": "06302017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Profound Medical announces agreement with Royal Philips to acquire Sonalleve MR-HIFU Business "
    },
    {
        "content": "AMSTERDAM  June 28 Dutch healthcare company Philips has agreed to buy U.S.-based Spectranetics Corp   a maker of devices to treat heart disease  for 1.9 billion euros ($2.16 billion) including debt  as it expands its image-guided therapy business.",
        "date": "06282017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips to buy medical device maker Spectranetics for 1.9 bln euros "
    },
    {
        "content": "* WILL BE INITIATING A SHARE BUYBACK PROGRAM FOR AN AMOUNT OF UP TO EUR 1.5 BILLION SOURCE TEXT FOR EIKON: FURTHER COMPANY COVERAGE: (Gdynia Newsroom:)",
        "date": "06282017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips to initiate share buyback program for up to 1.5 billion euros "
    },
    {
        "content": "AMSTERDAM  June 1 Dutch healthcare technology company Philips said Thursday it had reached deals with New York's Memorial Sloan Kettering Cancer Center (MSK) and Utah-based Intermountain Healthcare for them to use its genomics platform for cancer research and treatment.",
        "date": "06012017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips in deals with U.S. hospitals on use of its gene data platform for cancer research "
    },
    {
        "content": "AMSTERDAM The adoption of connected technologies in healthcare remains limited and is progressing slowly  despite the promise they hold for cutting medical costs by preventing illness  the chief executive of Philips said on Wednesday.",
        "date": "05172017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips CEO: uptake of connected care products progressing slowly "
    },
    {
        "content": "* PHILIPS TO EXPAND ITS SLEEP & RESPIRATORY CARE BUSINESS WITH ACQUISITION OF US-BASED RESPIRTECH",
        "date": "05222017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips acquires US-based Respirtech "
    },
    {
        "content": "* Announces intended sale of part of its stake in Philips Lighting",
        "date": "04252017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips to sell part of its stake in Philips Lighting "
    },
    {
        "content": "AMSTERDAM  April 24 Philips  the maker of medical devices and healthcare products  reported on Monday better than expected core earnings of 442 million euros ($480 million) for the first quarter  up 18 percent  despite weak sales growth.",
        "date": "04242017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips core earnings up 18 pct despite soft sales growth "
    },
    {
        "content": "* Q1 net income amounted to EUR 259 million  compared to EUR 37 million in q1 2016",
        "date": "04242017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Philips Q1 net income jumps to 259 million euros "
    },
    {
        "content": "* Signed an agreement with a consortium of sixteen banks for a new 1 billion euros  ($1.07 billion) revolving credit facility",
        "date": "04192017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips couples sustainability performance to interest rate of its new 1 billion euro revolving credit facility "
    },
    {
        "content": "* Receives clearance from the U.S. Food and Drug Administration (FDA) to market Philips Intellisite pathology solution for primary diagnostic use in the U.S. Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "04132017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips receives FDA clearance to market pathology solution in the U.S. "
    },
    {
        "content": "* Appointment of Jasper Westerink as chief executive officer (market leader) for Philips Africa based out of Johannesburg Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "04032017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips appoints Jasper Westerink as CEO Philips Africa "
    },
    {
        "content": "* Said on Monday it has signed an agreement to acquire Australian Pharmacy Sleep Services (APSS)  a pharmacy sleep testing company",
        "date": "03282017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips to acquire Australian pharmacy sleep services company "
    },
    {
        "content": "* Koninklijke Philips N.V. Reports 15.5 percent stake in Corindus Vascular Robotics Inc  as of February 28  2017 - sec filing",
        "date": "03102017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips reports 15.5 pct stake in Corindus Vascular Robotics "
    },
    {
        "content": "* Philips teams up with German startup Onelife Health to expand its digital health services in mother and child care",
        "date": "02272017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips partners with German startup Onelife Health in mother and child care "
    },
    {
        "content": " (This version of the story has been refiled to remove extraneous word from headline)",
        "date": "02222017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips upbeat on prospects for new image-guided therapy platform "
    },
    {
        "content": "AMSTERDAM  Feb 22 Philips on Wednesday announced the introduction of a new platform for image guided therapy which enables doctors to combine the use of several medical scanners  imaging data and large screen displays as they perform minimally-invasive surgeries.",
        "date": "02222017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "REFILE-Philips upbeat on prospects for new image-guided therapy platform "
    },
    {
        "content": "* Philips lighting intends to repurchase 3.5 million shares from Royal Philips",
        "date": "02082017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips Lighting intends to repurchase 3.5 mln shares from Royal Philips "
    },
    {
        "content": "* And Banner Health sign 15-year agreement to extend successful connected healthcare programs  transforming care and lowering costs  while improving quality  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "01232017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips and Banner Health sign 15-year agreement "
    },
    {
        "content": "AMSTERDAM Medical equipment maker Philips  missed forecasts for fourth-quarter earnings on Tuesday and disclosed a dispute with the U.S. Justice Department over heart defibrillators it had sold until 2016  but said the matter would not alter its medium term outlook.",
        "date": "01242017",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips misses fourth-quarter forecasts  discloses US defibrillator dispute "
    },
    {
        "content": "* Shares down 2.8 pct   (Updates after press conference; Removes background material on 2012 defibrillator recall as incidents are not related; raises paragraphs on earnings  adds analyst comment; adds that shares have regained some losses.)",
        "date": "01242017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 3-Philips misses Q4 forecasts  discloses US defibrillator dispute "
    },
    {
        "content": "AMSTERDAM  Jan 24 Medical equipment maker Philips on Tuesday disclosed a conflict with the U.S. government over defibrillators it sold prior to 2015  along with fourth quarter earnings in which it missed analysts' estimates.",
        "date": "01242017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips discloses conflict with US over defibrillators along with Q4 earnings "
    },
    {
        "content": "* Q4 sales 7.2 billion euros ($7.74 billion) versus 7.30 billion euros in Reuters poll",
        "date": "01242017",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips Q4 sales up at 7.2 billion euros "
    },
    {
        "content": "AMSTERDAM Philips  will sell an 80.1 percent stake in Lumileds  its LED components and car lighting business  to U.S. investor Apollo  receiving $1.5 billion in cash  it said on Monday.",
        "date": "12122016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips to sell Lumileds stake to U.S. investor Apollo for $1.5 billion "
    },
    {
        "content": "* Philips and Masimo corporation announced a wide-ranging  multi-year business partnership involving both companies' innovations in patient monitoring and therapy solutions",
        "date": "11072016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Masimo and Philips to end all pending lawsuits "
    },
    {
        "content": "* Distribution agreement with Philips for Australia and New Zealand will expire on 31 May 2017",
        "date": "11032016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Breville Group says agreement with Philips to expire in May 2017 "
    },
    {
        "content": "* Philips: targets 4-6 percent sales growth annually for next 3-4 years",
        "date": "11042016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips mid-term guidance: sales growth of 4-6 percent "
    },
    {
        "content": "AMSTERDAM Dutch healthcare technology and services company Philips  reported a 14 percent rise in underlying earnings for the third quarter on Monday and a strong order book  sending its shares to their highest since April last year.",
        "date": "10242016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips' quarterly earnings rise but bumps ahead in Europe "
    },
    {
        "content": "* Company reports 14 pct rise in adjusted EBITA   (Updates with CEO comment  share movement  analyst comment)",
        "date": "10242016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips' quarterly earnings rise but bumps ahead in Europe "
    },
    {
        "content": "AMSTERDAM  Oct 24 Dutch healthcare technology and services company Philips said on Monday third-quarter earnings grew by nearly half  though slightly below estimates  as sales rose and margins improved.",
        "date": "10242016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips reports Q3 earnings just below expectations; sales rise "
    },
    {
        "content": "* Company concerned about Brexit uncertainty   (Adds CEO interview  share price)",
        "date": "07252016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips on course to hit profitability target as margins improve "
    },
    {
        "content": "* Q2 sales 5.86 billion euros ($6.43 billion) versus 5.93 billion euros in Reuters poll",
        "date": "07252016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips Q2 net profit beats estimates "
    },
    {
        "content": "* Fitch ratings says has revised outlook on royal philips to stable from negative",
        "date": "07142016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Fitch revises outlook on Royal Philips to stable from negative "
    },
    {
        "content": "* Philips expands its digital pathology solutions portfolio with the acquisition of PathXL  Source text for Eikon:  Further company coverage:",
        "date": "06212016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Royal Philips acquires PathXL "
    },
    {
        "content": "* Co  royal philips jointly sold tulsa-pro system in united kingdom to ucl and uclh  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06202016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Profound Medical says co  Royal Philips jointly sold TULSA-PRO system in UK "
    },
    {
        "content": "* Amsterdam attracting a series of new listings   (Updates with quotes after news conference with new CEO)",
        "date": "05272016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "UPDATE 1-Philips Lighting shines in stock market debut "
    },
    {
        "content": "AMSTERDAM  May 25 Shares in the initial public offering of Philips'  Lighting division could price above 20 euros  people familiar with the matter said on Wednesday.",
        "date": "05252016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "UPDATE 1-Philips Lighting IPO price may top 20 euros - sources "
    },
    {
        "content": "AMSTERDAM Philips  said on Thursday it has set pricing in the initial public offering of its lighting division at 20 euros per share.",
        "date": "05262016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips Lighting unit valued at 3.0 billion euros in IPO "
    },
    {
        "content": "AMSTERDAM  May 25 Shares in the initial public offering of Philips'  Lighting division could price above 20 euros  people familiar with the matter said on Wednesday.",
        "date": "05252016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips Lighting IPO price may top 20 euros - sources "
    },
    {
        "content": "AMSTERDAM  May 26 Philips said on Thursday it has set pricing in the initial public offering of its lighting division at 20 euros per share.",
        "date": "05262016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 1-Philips Lighting unit valued at 3.0 billion euros in IPO "
    },
    {
        "content": "AMSTERDAM  May 25 Philips has narrowed the indicative price range for shares on offer in the initial public offering of its Lighting division to 19-20 euros per share  people familiar with the matter said on Wednesday.",
        "date": "05252016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "CORRECTED-Philips Lighting IPO pricing narrowed to 19-20 euros -sources "
    },
    {
        "content": "* Partners with Heart Hospital Tampere to collaborate on a Finnish center of excellence for cardiac care",
        "date": "05252016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips partners with Heart Hospital Tampere "
    },
    {
        "content": "* Announce together with a consortium of leading European healthcare regions  companies  universities and hospitals the start of the first large scale care coordination and telehealth program in the European Union to support tens of thousands of people living with chronic conditions  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "05172016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips leads large scale eHealth initiative "
    },
    {
        "content": "* Royal Philips and Philips Lighting  announce indicative price range and offer size of planned IPO of Philips Lighting and publication of prospectus",
        "date": "05162016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips sets indicative price range of Lighting IPO at EUR 18.50-22.50 per share "
    },
    {
        "content": "AMSTERDAM/FRANKFURT  May 10 Philips'  decision to float its lighting business will offer investors a radical alternative to its closest independent competitor in the lucrative illumination market  Osram Licht  itself spun off by Siemens three years ago.",
        "date": "05102016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips  Osram lighting spin-offs diverge on LED challenge "
    },
    {
        "content": "AMSTERDAM Philips  plans to sell at least 25 percent of its lighting business  the world's largest maker of lights  on the stock market to focus on its larger medical equipment operations  it said on Tuesday.",
        "date": "05032016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips to sell at least 25 percent of lighting arm in IPO "
    },
    {
        "content": "* Offering would consist of a sale of existing shares only held by royal philips",
        "date": "05032016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Philips Lighting division to launch IPO  list on Euronext Amsterdam "
    },
    {
        "content": "AMSTERDAM  May 3 Medical equipment and technology firm Philips said on Tuesday it will spin off its lighting division  the world's largest maker of lights  in an initial public offering of shares.",
        "date": "05032016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips to seek IPO for Philips Lighting "
    },
    {
        "content": "AMSTERDAM  April 26 Philips said on Tuesday an arbitration court had ordered Japan's Funai Electric  to pay it 135 million euros ($152 million) over the 2013 collapse of a deal for the Japanese firm to buy a business from the Dutch company.",
        "date": "04262016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Court orders Japan's Funai to pay Philips 135 mln euros over failed 2013 deal "
    },
    {
        "content": "AMSTERDAM Philips  said it was likely to list its lighting division on the stock market  creating a standalone company that would be the world's largest maker of lights.",
        "date": "04252016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips likely to list lighting business on stock market "
    },
    {
        "content": "* Philips separating lighting to focus on healthcare tech   (Adds details on Philips Lighting and lighting market)",
        "date": "04252016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips likely to list lighting business on stock market "
    },
    {
        "content": "* Q1 adjusted EBITA amounted to 374 million euros ($420.34 million)  or 6.8 percent of sales  compared to 6.1 percent of sales in Q1 2015",
        "date": "04252016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips Q1 comparable sales up 3 pct at EUR 5.5 BLN "
    },
    {
        "content": "AMSTERDAM  April 25 Dutch medical equipment and services company Philips on Monday said it will likely seek an initial public offering of shares for its lighting division  which would be the world's largest lighting maker as a standalone company.",
        "date": "04252016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips likely to seek IPO for lighting; 1Q earnings beat expectations "
    },
    {
        "content": "Chinese investor GO Scale Capital  whose bid for Philips's  lighting-components business was blocked by the U.S. government in January  is bidding for the company's other lighting division  Bloomberg reported  citing people familiar with the matter.",
        "date": "02292016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Chinese investor bidding for Philips lighting division: Bloomberg "
    },
    {
        "content": "* Philips Respironics   a business of Royal Philips  receives 510(k) clearance from the U.S. Food and Drug Administration (FDA) of Care Orchestrator  a cloud-based clinical management software for patients with sleep and respiratory conditions  Source text: http://philips.to/1QpMi4t Further company coverage:    (Gdynia Newsroom:)",
        "date": "03012016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips receives 510(k) clearance of Care Orchestrator "
    },
    {
        "content": "Feb 29 Chinese investor GO Scale Capital  whose bid for Philips's lighting-components business was blocked by the U.S. government in January  is bidding for the company's other lighting division  Bloomberg reported  citing people familiar with the matter.",
        "date": "02292016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Chinese investor bidding for Philips lighting division-Bloomberg "
    },
    {
        "content": "* Chinese  Japanese are aggressively bidding for foreign assets",
        "date": "02232016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "DEALTALK-Hunt for foreign assets pits Japan Inc vs China "
    },
    {
        "content": "* Announced a collaboration with  Hitachi data systems  wholly-owned subsidiary of Hitachi  Ltd \u007f\u007f",
        "date": "02182016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips to collaborate with Hitachi Data Systems\u007f\u007f "
    },
    {
        "content": "* Secures 510(k) clearance to market new patient monitoring solution to bring bedside quality monitoring to the MR suite\u007f\u007f  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "02102016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips secures 510(k) clearance to market new patient monitoring solution "
    },
    {
        "content": "AMSTERDAM Strong orders for its healthcare business helped to boost shares in Philips   the Dutch company which is seeking to focus on scanners and medical technology and shed its traditional lighting operations.",
        "date": "01262016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips bolstered by outlook for healthcare business "
    },
    {
        "content": "* Company seeking to shift away from traditional lighting business",
        "date": "01262016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips bolstered by outlook for healthcare business "
    },
    {
        "content": "AMSTERDAM  Jan 26 Dutch medical equipment and lighting group Philips is likely to sell its Lumileds division in the second half of this year at a lower price than the $3.3 billion it had initially envisaged  Chief Executive Frans van Houten said on Tuesday.",
        "date": "01262016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips CEO sees Lumileds disposal this year for less than $3.3 bln "
    },
    {
        "content": "* Says Q4 comp sales growth of 2 pct at 7.1 billion euros  ($7.7 billion)",
        "date": "01262016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Philips Q4 comp sales up 2% at 7.1 bln euro "
    },
    {
        "content": "* Says scraps plan to acquire Philips' spin-off Lumileds after deal is blocked by the u.s.",
        "date": "01252016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-China's Dongguan Kingsun scraps plan to acquire Philips' spin-off Lumileds "
    },
    {
        "content": "AMSTERDAM Philips's plan to shed its lighting businesses suffered a setback on Friday when a $3.3 billion deal to offload the components division to Asian buyers was blocked by the United States on security grounds.",
        "date": "01222016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "U.S. blocks Philips' $3.3 billion sale of Lumileds to Asian buyers "
    },
    {
        "content": "* Philips will push ahead with Lighting sale  or IPO   (Adds reaction from GO Scale Capital and U.S. experts on possible reason for the block)",
        "date": "01222016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 3-U.S. blocks Philips' $3.3 bln sale of Lumileds to Asian buyers "
    },
    {
        "content": "AMSTERDAM  Jan 22 Philips said on Friday its $3.3 billion deal to sell its Lumileds division to a group of Asian investors has foundered over objections by the U.S. government.",
        "date": "01222016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips' $3.3 billion sale of Lumileds fails on U.S. objections "
    },
    {
        "content": "* Signs agreement with Indonesian Sijunjung Regency for full-scale implementation of new telehealth service in region   Further company coverage:    (Gdynia Newsroom)",
        "date": "01142016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips signs deal with Indonesian Sijunjung Regency "
    },
    {
        "content": "* Philips and Banyan Biomarkers partner to develop and commercialize new handheld blood test to detect and evaluate concussions  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom:)",
        "date": "01072016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips and Banyan Biomarkers partner on handheld blood test for concussions "
    },
    {
        "content": "FRANKFURT Companies interested in lighting assets will be able to bid for top European brands Philips and Osram in two separate auctions starting this month  industry sources on Friday.",
        "date": "01082016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips  Osram lighting bidders to line up this month: sources "
    },
    {
        "content": "* \u007fTechnicolor and Philips join forces to co-develop high dynamic range (HDR) distribution technologies\u007f",
        "date": "01052016",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Technicolor and Philips join forces "
    },
    {
        "content": "* Buyout groups to bid for Philips lamps unit end-Jan - sources",
        "date": "01082016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips  Osram lighting bidders to line up this month - sources "
    },
    {
        "content": "FRANKFURT  Jan 8 Companies interested in lighting assets will have the opportunity to bid for Europe's best-known brands Philips and Osram in two separate auctions starting this month.",
        "date": "01082016",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips  Osram lighting bidders to line up this month - sources "
    },
    {
        "content": "AMSTERDAM  Dec 9 Philips has entered strategic partnerships with Cisco  SAP and Bosch  under which the Dutch company will become a preferred supplier of networked lights.",
        "date": "12092015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips in lighting partnerships with Cisco  SAP and Bosch "
    },
    {
        "content": "* Philips estimates office lighting market at 1 bln euros a year   (Recasts first paragraph to clarify deals are partnerships  not supply deals)",
        "date": "12092015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 3-Philips in lighting partnerships with Cisco  SAP and Bosch "
    },
    {
        "content": "AMSTERDAM Philips said on Tuesday it has won a C$300 million ($226 mln) long-term contract to act as medical technology supplier and consultant to Canadian healthcare provider Mackenzie Health.",
        "date": "11102015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips healthcare wins C$300 million contract in Canada "
    },
    {
        "content": "AMSTERDAM  Nov 10 Philips said on Tuesday it has won a C$300 million ($226 mln) long-term contract to act as medical technology supplier and consultant to Canadian healthcare provider Mackenzie Health.",
        "date": "11102015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips healthcare wins C$300 mln contract in Canada "
    },
    {
        "content": "* Signs agreement resulting in settlement of its entire UK pension plan obligations",
        "date": "11052015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips settles entire UK pension plan obligations "
    },
    {
        "content": "* Announced on Thursday that the municipality of Eindhoven has selected Heijmans and Philips to jointly detail the Eindhoven Urban Lighting Roadmap 2030 Project",
        "date": "10232015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Heijmans and Philips to jointly detail the Eindhoven Urban Lighting Roadmap 2030 Project "
    },
    {
        "content": "AMSTERDAM Dutch healthcare systems and lighting group Philips  warned on Monday that the planned sale of its Lumileds division  valued at $3.3 billion  is in doubt due to U.S. national security concerns.",
        "date": "10262015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips faces U.S. national security objections to Lumileds sale "
    },
    {
        "content": "MILAN/LONDON  Oct 26 European shares drifted lower on Monday as the effect of China's rate cut faded  although German stocks outperformed after a business sentiment survey came in better than expected.",
        "date": "10262015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "European shares dip  Germany's DAX outperforms "
    },
    {
        "content": "* Today's European research round-up    (Adds quote  detail  recasts)",
        "date": "10262015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "European shares steady  Germany's DAX outperforms "
    },
    {
        "content": "* CEO says Lumileds deal still likely to succeed   (Adds CEO comments  details  share price move)",
        "date": "10262015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips faces U.S. national security objections to Lumileds sale "
    },
    {
        "content": "MILAN  Oct 26 European shares edged lower on Monday as the effect of China's rate cut faded and some relatively good earnings reports failed to provide support.",
        "date": "10262015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "European shares edge lower as effect of China rate cut fades "
    },
    {
        "content": "MILAN  Oct 26 European shares edged lower at the open on Monday  with China's rate-cut effect fading slightly in Europe after markets rallied to two-month highs last week on signs of more central bank support.",
        "date": "10262015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "European shares fall at open as rate-cut effect fades "
    },
    {
        "content": "AMSTERDAM  Oct 26 Philips on Monday reported better-than-expected quarterly profits on cost cutting and strong orders for its  U.S. healthcare business  but said the sale of its Lumileds division  worth $3.3 billion  is in doubt.",
        "date": "10262015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "RPT-Philips beats on Q3 profit  but sale of Lumileds in doubt "
    },
    {
        "content": "AMSTERDAM  Oct 26 Philips on Monday reported better-than-expected quarterly profits on cost cutting and strong orders for its  U.S. healthcare business  but said the sale of its Lumileds division  worth $3.3 billion  is in doubt.",
        "date": "10262015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips beats on Q3 profit  but sale of Lumileds in doubt "
    },
    {
        "content": "AMSTERDAM Philips  said on Monday the sale of its $3.3-billion Lumileds business to Go Scale Capital was uncertain  due to U.S. government concerns.",
        "date": "10262015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips $3.3-billion sale of Lumileds to Go Scale in doubt "
    },
    {
        "content": "ZURICH  Oct 12 LafargeHolcim named a new chief financial officer on Monday  recruiting Ron Wirahadiraksa from Dutch electronics group Philips as the cement giant reshapes its management under new chief executive Eric Olsen.",
        "date": "10122015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "UPDATE 2-LafargeHolcim replaces CFO with finance chief from Philips "
    },
    {
        "content": "AMSTERDAM  Oct 12 Philips NV said on Monday it had appointed Abhijit Bhattacharya as chief financial officer with immediate effect to succeed the departing Ron Wirahadiraksa.",
        "date": "10122015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 1-Philips names lighting executive Bhattacharya as CFO "
    },
    {
        "content": "ZURICH  Oct 12 LafargeHolcim hired a new chief financial officer  luring a long-time executive away from medical technology and electronics maker Philips.",
        "date": "10122015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "LafargeHolcim hires new CFO away from Philips "
    },
    {
        "content": "* To expand its health care consulting services in the US with the acquisition of Blue Jay Consulting",
        "date": "10062015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips acquires US based Blue Jay Consulting "
    },
    {
        "content": "* Abhijit Bhattacharya succeeds Ron Wirahadiraksa as CFO  Further company coverage:    (Gdynia Newsroom)",
        "date": "10122015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips: Abhijit Bhattacharya succeeds Ron Wirahadiraksa as CFO "
    },
    {
        "content": "* Appoints Jan Kimpen as chief medical officer  Source text: http://philips.to/1Z2ZoYQ Further company coverage:    (Gdynia Newsroom)",
        "date": "10052015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips appoints Jan Kimpen as chief medical officer "
    },
    {
        "content": "* Legal & General America announces it has entered into an agreement with U.S. subsidiary of Royal Philips",
        "date": "10022015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Legal & General America unit enters annuity contract with unit of Philips "
    },
    {
        "content": "AMSTERDAM  Sept 15 Philips  said on Tuesday that it is on track to spin off its lighting division next year  but the Dutch group expects only lacklustre sales growth in 2016.",
        "date": "09152015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips forecasts \"modest\" sales growth in 2016 "
    },
    {
        "content": "* Says plans to invest $100 million in Philips' spin-off Lumileds",
        "date": "09172015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Dongguan Kingsun Optoelectronic to invest $100 mln in Philips' spin-off Lumileds "
    },
    {
        "content": "Freshman quarterback Eric Dungey replaced injured senior Terrel Hunt and tossed a pair of touchdown passes to running back Ervin Philips as Syracuse rolled to a 47-0 victory over FCS member Rhode Island on Friday at the Carrier Dome in Syracuse  N.Y.",
        "date": "09052015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Syracuse 47  Rhode Island 0 "
    },
    {
        "content": "BERLIN  Sept 4 Philips Electronics will emerge from its radical transition away from the lighting industry as a more profitable company focused on consumer healthcare  the head of the group's Personal Health business told Reuters.",
        "date": "09042015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips aims to take healthcare from hospitals into homes "
    },
    {
        "content": "* Shares rise 3.6 pct to the top of AEX index    (Adds details  analyst comment  CEO comment)",
        "date": "07272015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips' earnings easily beat forecasts  cautious on China "
    },
    {
        "content": "* Reports Q2 comparable sales growth of 3 pct to 6 billion euros ($6.6 billion)",
        "date": "07272015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips Q2 comparable sales at 6 billion euros  up 3% "
    },
    {
        "content": "FRANKFURT  July 12 Philips is still deciding on how large a stake it will sell in its lighting business when it lists the division on the stock market  the Dutch company's Germany chief said in an interview with German newspaper Welt am Sonntag.",
        "date": "07122015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips mulling size of stake in lighting unit to be listed -paper "
    },
    {
        "content": "FRANKFURT  July 12 Philips is still deciding on how large a stake it will sell in its lighting business when it lists the division on the stock market  the Dutch company's Germany chief said in an interview with German newspaper Welt am Sonntag.",
        "date": "07112015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips mulling size of stake in lighting unit to be listed -paper "
    },
    {
        "content": "TEL AVIV  July 1 Teva Pharmaceutical Industries  and Philips are together investing up to 100 million shekels ($26.5 million) over eight years in medical device and health technology start-ups in Israel.",
        "date": "07012015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Teva and Philips to jointly invest in Israeli medical device firms "
    },
    {
        "content": "* Philips and Bruynzeel Storage Systems announce collaboration",
        "date": "06152015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips and Bruynzeel Storage Systems announce collaboration "
    },
    {
        "content": "* Announces $500 million multi-year enterprise partnership with Westchester Medical Center Health Network to transform patient care",
        "date": "06162015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips announces $500 million partnership with WMCHealth "
    },
    {
        "content": "AMSTERDAM  June 16 Philips said on Tuesday it had won a $500 million contract with U.S. Westchester Medical Center Health Network.",
        "date": "06162015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips says signs $500 mln contract with U.S. hospital chain "
    },
    {
        "content": "* Extend strategic partnership with Sint Maartenskliniek hospital (Nijmegen  the Netherlands) by five years",
        "date": "06052015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips and Sint Maartenskliniek hospital extend partnership "
    },
    {
        "content": "* Koninklijke Philips and the Sint Maartenskliniek in Nijmegen strengthen strategic partnership with the extension and expansion of ultrasound and healthcare IT",
        "date": "06042015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips strengthens partnership with Sint Maartenskliniek "
    },
    {
        "content": "SAN FRANCISCO  June 1 Five companies including Samsung SDI Co Ltd and Koninklijke Philips  agreed to pay a total of $528 million to resolve a class action lawsuit alleging price fixing in the market for cathode ray tubes  according to a court filing.",
        "date": "06012015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Companies in cathode ray tube price fixing lawsuit reach $528 mln deal "
    },
    {
        "content": "* UZ Leuven and Philips collaborate to improve cancer diagnostics by digitizing pathology",
        "date": "06042015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Koninklijke Philips and UZ Leuven announce collaboration to improve cancer diagnostics "
    },
    {
        "content": "* Philips and Wilhelmina Hospital  Assen sign long-term cooperation agreement",
        "date": "05282015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips and Wilhelmina Hospital sign cooperation agreement "
    },
    {
        "content": "AMSTERDAM Go Scale  the investment fund that is purchasing Philips' lighting components unit Lumileds  said on Wednesday it would fund the acquisition in part by raising $1.93 billion (1.77 billion euros) in debt.",
        "date": "05272015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Go Scale to fund Philips lighting components buy with $1.93 billion in debt "
    },
    {
        "content": "AMSTERDAM  May 27 Go Scale  the investment fund that is purchasing Philips' lighting components unit Lumileds  said on Wednesday it would fund the acquisition in part by raising $1.93 billion (1.77 billion euros) in debt.",
        "date": "05272015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 1-Go Scale to fund Philips lighting components buy with $1.93 bln in debt "
    },
    {
        "content": "AMSTERDAM  May 27 Go Scale  the investment fund that is purchasing Philips' lighting components unit Lumileds  said on Wednesday it would fund the acquisition in part by raising $1.93 billion (1.77 billion euros) in debt.",
        "date": "05272015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Go Scale to fund Philips lighting components buy with $1.93 bln in debt "
    },
    {
        "content": "AMSTERDAM  May 21 Philips has struck its first deal to sell lights with built-in technology that can track shoppers as they move through a grocery store  beaming pop-up coupons to their smartphones.",
        "date": "05212015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips and Carrefour use lights to beam coupons to shoppers "
    },
    {
        "content": "* Philips signs five-year research alliance with Massachusetts Institute Of Technology to bring breakthrough innovations in healthtech and connected lighting",
        "date": "05202015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips signs 5 year research alliance with MIT "
    },
    {
        "content": "* Expands existing strategic partnership with Reinier de Graaf hospital with extensive 15-year agreement for ultrasound provision",
        "date": "05182015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips and Reinier de Graaf hospital extends deal for ultrasound provision "
    },
    {
        "content": "* Annual general meeting of shareholders approves separation of lighting business from Royal Philips",
        "date": "05072015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Royal Philips shareholders approve separation of lighting business "
    },
    {
        "content": "* In talks with multiple candidates for takeover lighting factory Emmen",
        "date": "04292015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Taskforce sees future for Philips factory in Emmen "
    },
    {
        "content": "AMSTERDAM Philips has reported first-quarter earnings showing continued weakness in the healthcare equipment operations that are increasingly vital for the Dutch group as it prepares to spin off its lighting operations.",
        "date": "04282015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips results weighed down by profit drop in healthcare equipment "
    },
    {
        "content": "* Philips returns to sales growth in Q1  sees full-year growth",
        "date": "04282015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips results weighed down by profit drop in healthcare equipment "
    },
    {
        "content": "* Philips appoints healthcare industry veteran Robert Cascella to lead its cluster of global imaging businesses",
        "date": "03302015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips appoints Robert Cascella as global imaging business CEO "
    },
    {
        "content": "AMSTERDAM Philips  has agreed to sell an 80.1 percent stake in its lighting components division for $2.8 billion to Go Scale Capital  a technology fund that will seek to expand the company's automotive and LED businesses.",
        "date": "03312015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Philips sells 80 percent of lighting components unit for $2.8 billion "
    },
    {
        "content": "HONG KONG  April 1 Chinese investment fund GO Scale Capital will use its $2.8 billion winning bid for Philips's lighting unit as a model to pursue other potential takeovers in areas such as biomedicine and clean energy  its executives said on Wednesday.",
        "date": "04012015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "After bagging Philips unit  China fund says to seek more deals "
    },
    {
        "content": "AMSTERDAM  March 31 Philips has agreed to sell an 80.1 percent stake in its lighting components division for $2.8 billion to Go Scale Capital  a technology fund that will seek to expand the company's automotive and LED businesses.",
        "date": "03312015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 4-Philips sells 80 pct of lighting components unit for $2.8 bln "
    },
    {
        "content": "AMSTERDAM  March 31 Philips said on Tuesday it has agreed to sell an 80.1 percent stake in its lighting components division for $2.8 billion to Go Scale Capital  a new investment fund that focuses on \"disruptive\" technologies.",
        "date": "03312015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips sells 80.1 pct of lighting components unit for $2.8 bln "
    },
    {
        "content": "* Philips to sell majority interest in combined LED components and automotive lighting business to consortium led by GO Scale Capital",
        "date": "03312015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Philips to sell 80 pct stake in lighting components arm to GO Scale Capital-led consortium "
    },
    {
        "content": "* Philips enters into collaboration with Janssen to develop new handheld blood test to support care of patients with neuropsychiatric disorders",
        "date": "03252015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips enters pact with Janssen for handheld blood test "
    },
    {
        "content": "* Proposal to appoint David Pyott as new member of supervisory board",
        "date": "03192015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Philips considers IPO for lighting business  says will review other options "
    },
    {
        "content": "FRANKFURT A surprise Asian consortium has emerged in the auction for Philips'  lighting components business worth roughly 2.5 billion euros ($2.6 billion)  two sources familiar with the matter said.",
        "date": "03152015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Surprise Asian consortium interested in Philips lighting: sources "
    },
    {
        "content": "FRANKFURT  March 15 A surprise Asian consortium has emerged in the auction for Philips' lighting components business worth roughly 2.5 billion euros ($2.6 billion)  two sources familiar with the matter said.",
        "date": "03152015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Surprise Asian consortium interested in Philips lighting -sources "
    },
    {
        "content": "LONDON/FRANKFURT A consortium of private equity firms CVC and KKR has tabled the highest bid to take control of Philips' lighting components business  though rival Bain Capital could still make a better offer  three sources familiar with the matter said.",
        "date": "03112015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "CVC-KKR ahead in battle for Philips' lighting business: sources "
    },
    {
        "content": "LONDON/FRANKFURT  March 11 A consortium of private equity firms CVC and KKR has tabled the highest bid to take control of Philips' lighting components business  though rival Bain Capital could still make a better offer  three sources familiar with the matter said.",
        "date": "03112015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "CVC-KKR ahead in battle for Philips' lighting business - sources "
    },
    {
        "content": "BERLIN The new boss of Germany's Osram Licht  has no plans at present to cut more jobs at the lighting products maker  he was quoted as saying by the Frankfurter Allgemeine Zeitung newspaper on Wednesday.",
        "date": "02252015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "New Osram CEO has no plans for further job cuts: paper "
    },
    {
        "content": "FRANKFURT Philips'  sale of the majority of its lighting components business is nearing an end as buyout groups are lining up final bids  three sources said on Monday.",
        "date": "03022015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Buyout groups line up bids for Philips' lighting business: sources "
    },
    {
        "content": "FRANKFURT  March 2 Philips' sale of the majority of its lighting components business is nearing an end as buyout groups are lining up final bids  three sources said on Monday.",
        "date": "03022015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Buyout groups line up bids for Philips' lighting business - sources "
    },
    {
        "content": "* Bookmakers' favourite for CEO job is David Potts   (Adds detail  shares)",
        "date": "02122015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "UPDATE 1-Morrisons finance chief to fill gap as CEO leaves early "
    },
    {
        "content": "LONDON  Feb 12 Britain's No. 4 supermarket Morrisons said on Thursday that chief executive Dalton Philips  ousted from the top job in January  will leave the business next week.",
        "date": "02122015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Morrisons ousted CEO to leave next week  FD takes temporary charge "
    },
    {
        "content": "* Trevor Strain will chair management board and assume Dalton Philips' executive responsibilities",
        "date": "02122015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Morrisons FD takes over as Philips prepares to leave "
    },
    {
        "content": "* Philips extends tender offer period to acquire Volcano Corp",
        "date": "02052015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BRIEF-Royal Philips extends Volcano Corp acquisition offer to Feb 17 "
    },
    {
        "content": "FRANKFURT  Feb 4 German light maker Osram  has no plans to split itself up in the way that Dutch rival Philips is dividing its lighting business in two  its chief executive said on Wednesday.",
        "date": "02042015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Osram CEO says no sense in splitting up company "
    },
    {
        "content": "LONDON  Jan 27 Renewed concern over Greece and weak results at companies such as Siemens and Philips  put an end to a winning run for European stock markets on Tuesday.",
        "date": "01272015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "European stocks driven back by Greek worries and weak corporate figures "
    },
    {
        "content": "LONDON  Jan 27 Renewed concern over Greece and weak results at companies such as Siemens and Philips  halted a winning run on European stock markets on Tuesday.",
        "date": "01272015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "European stocks driven back by Greek worries  weak corporate results "
    },
    {
        "content": "AMSTERDAM  Jan 27 The chief executive of Philips  said on Tuesday that a combined sale of its lighting business  together with its lighting components business  is \"not on the table\".",
        "date": "01272015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips CEO rules out combined lighting  components business sale "
    },
    {
        "content": "** Philips shares up 3.4 percent on local newspaper report of private equity interest in lighting division",
        "date": "01202015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "BUZZ-Philips shares up on report of private equity interest "
    },
    {
        "content": "LONDON  Jan 27 Renewed concern over Greece and weak figures from leading companies such as Siemens  and Philips halted a winning run on European stock markets on Tuesday.",
        "date": "01272015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "European equity rally halted by Greece and weak corporate figures "
    },
    {
        "content": "* CEO Van Houten to seek reappointment   (Adds CEO quotes  analyst comment  share price)",
        "date": "01272015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 2-Philips lags behind its profit targets as earnings slide "
    },
    {
        "content": "LONDON  Jan 27 European shares were little changed on Tuesday as disappointing updates by companies like Siemens and Ericsson raised concern about the coming earnings season and weakened demand for stocks after an eight-day rally.",
        "date": "01272015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "European equity rally pauses as weak results curb demand "
    },
    {
        "content": "AMSTERDAM Philips  the Dutch healthcare and lighting company  on Tuesday said it expects up to 400 million euros ($449 million) in restructuring costs this year as it prepares to spin off its lighting division.",
        "date": "01272015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips sees more costs in 2015  cuts earnings targets "
    },
    {
        "content": "AMSTERDAM  Jan 27 Philips  the Dutch healthcare and lighting company  on Tuesday reported fourth-quarter earnings in line with expectations  but said it expected new restructuring costs this year and would miss long-term sales and earnings targets by 1 percent.",
        "date": "01272015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips sees more costs in 2015  cuts targets "
    },
    {
        "content": "AMSTERDAM Philips warned on Tuesday that fourth-quarter earnings would be worse than expected because of the lengthy closure of a manufacturing plant in Cleveland  Ohio and a slowdown in some of its major markets.",
        "date": "01132015",
        "name": "Koninklijke Philips NV",
        "news_type": "topStory",
        "symbol": "PHG",
        "title": "Slowdown  U.S. problems prompt Philips profit warning "
    },
    {
        "content": "* Plant closure causes another 45 million euros damage to earnings",
        "date": "01132015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 1-Slowdown  U.S. problems prompt Philips profit warning "
    },
    {
        "content": "* Morrisons shares jump as much as 6.9 pct   (Adds analyst  company comments  detail  updates shares)",
        "date": "01132015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "UPDATE 3-Morrisons ditches CEO after Christmas sales fall "
    },
    {
        "content": "AMSTERDAM  Jan 13 Philips warned on Tuesday that fourth-quarter earnings will be lower than expected due to a market slowdown and fallout from the closure of a manufacturing plant in Cleveland  Ohio.",
        "date": "01132015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "Philips warns of lower profit due to market slowdown "
    },
    {
        "content": "* Philips resumes shipments from cleveland facility and provides update on ebita performance in q4 2014",
        "date": "01132015",
        "name": "Koninklijke Philips NV",
        "news_type": "normal",
        "symbol": "PHG",
        "title": "BRIEF-Philips sees adjusted EBITA at about 735 mln eur for Q4 of 2014 "
    }
]