[
    {
        "content": "* Consolidated core income in 9M2017 is 7 percent higher at 23.2 billion pesos‍​",
        "date": "11092017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT Inc posts 9-mnth consolidated core income of 23.2 bln pesos‍​ "
    },
    {
        "content": "* Confirms commentary on co's 2018 budget mentioned in business mirror (internet edition) article‍​ Source text for Eikon: Further company coverage:",
        "date": "11102017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT Inc confirms commentary in Business Mirror (Internet Edition) article‍​ "
    },
    {
        "content": "* Co to invest nearly 7 billion Pesos in trans-pacific cable system‍​ Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT to invest nearly 7 bln Pesos in trans-pacific cable system‍​ "
    },
    {
        "content": "* Confirms statements made by Chairman and CEO regarding expected double digit growth in revenues of Home And Enterprise businesses‍​ Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT confirms growth in revenues of business units "
    },
    {
        "content": " (Corrects to remove reference to U.S. in paragraph 5)     By Sumeet Gaikwad     Oct 4 Most Southeast Asian shares rose on Wednesday with the Philippines and Indonesia hitting record highs  tracking gains on Wall Street  while sentiment also got a boost after the World Bank raised its growth forecasts for developing East Asia and the Pacific region.       The three major U.S. stock indexes and the Russell 2000 posted record high closes for the second straight day on Tuesday  helped b",
        "date": "10042017",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "CORRECTED-SE Asia Stocks-Most rise; Philippines  Indonesia hit record highs "
    },
    {
        "content": "* Declared cash dividend of 2.4 million pesos on all outstanding shares of voting preferred stock of co for quarter ending Oct 15  2017‍​ Source text for Eikon: Further company coverage:",
        "date": "09262017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT Inc declares cash dividend "
    },
    {
        "content": "(The following statement was released by the rating agency) SINGAPORE  August 30 (Fitch) Fitch Ratings has revised the Outlook on PLDT Inc.'s Long-Term Local-Currency Issuer Default Rating (LC IDR) to Stable from Negative. The LC IDR has been affirmed at 'BBB+'. The agency has simultaneously affirmed the Philippine telco's Long-Term Foreign-Currency IDR (FC IDR) at 'BBB'  and its National Long-Term Rating at 'AAA(phl)'. The Outlook on the FC IDR and National Long-Term Rating is Stable. The Outlo",
        "date": "08302017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Fitch Revises PLDT's LC IDR Outlook to Stable; Affirms IDRs "
    },
    {
        "content": "NEW YORK  Aug 7 U.S. media company Hearst Communications Inc led a $133 million investment in iflix  the Malaysian provider of streaming video said on Monday.",
        "date": "08072017",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "Hearst invests in emerging markets streaming video provider "
    },
    {
        "content": "KUALA LUMPUR  Aug 7 Malaysia's iflix has raised $133 million in its latest funding round led by U.S. diversified media  information and services company Hearst  bringing the total investments to-date in the video-on-demand service to $303 million.",
        "date": "08072017",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "Malaysia's iflix raises $133 mln  funding led by US media firm Hearst "
    },
    {
        "content": "* Announces separation from service of Ana Maria A. Sotto  a vice president of company  effective July 26  2017 Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT announces separation from service of Ana Maria A. Sotto  a vice president of co "
    },
    {
        "content": "* Maria Josefina T. Gorres  Joseph Nelson M. Ladaban & Joselito S. Limjap resign due to manpower reduction program",
        "date": "07202017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT Inc announces resignation of Vice-Presidents "
    },
    {
        "content": "* Announces separation from service of Maria Josefina T. Gorres   Joseph Nelson M.  Ladaban and Joselito S. Limjap as vice presidents of Co Source text for Eikon: Further company coverage:",
        "date": "06142017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT Inc announces resignation of Vice-Presidents "
    },
    {
        "content": "* Qtrly consolidated ebitda amounted to 16.5 billion pesos  1% less than Q1 2016",
        "date": "05122017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT qtrly consolidated ebitda amounted to 16.5 bln pesos "
    },
    {
        "content": "* Refers to article titled \"PLDT  PAL biggest 'violators' of labor laws\" in the Manila Times",
        "date": "04202017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT Inc clarifies on article in Manila Times "
    },
    {
        "content": "* Refers to Business World Online  articles \"Smart required to conduct ipo under new franchise\" and \"PLDT eyes p68b from enterprise  home\"",
        "date": "03312017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT clarifies two Business World Online articles "
    },
    {
        "content": "MANILA  March 7 The Philippines' most valuable telecoms firm  PLDT Inc  on Tuesday said recurring income will likely grow in 2017 for the first time in three years  recovering from a price war and shift to mobile internet services that have eroded revenue from calls and texts.",
        "date": "03072017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "RPT-Philippines' PLDT forecasts first annual growth in three years "
    },
    {
        "content": "* Refers to news article entitled “Senate To Smart: Conduct Ipo And We'll Extend Franchise” posted in rappler on march 2  2017",
        "date": "03062017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT clarifies on news article posted in Rappler on March 2 2017 "
    },
    {
        "content": "MANILA  March 7 The Philippines' most valuable telecoms firm  PLDT Inc  on Tuesday said recurring income will likely grow in 2017 for the first time in three years  recovering from a price war and shift to mobile internet services that have eroded revenue from calls and texts.",
        "date": "03072017",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "Philippines' PLDT forecasts first annual growth in three years "
    },
    {
        "content": "* \"Foresee recovery in wireless consumer segment as we continue to pursue network superiority\"",
        "date": "02142017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT confirm clarifies news reports in Philippine Star (Internet Edition) on Feb 14 "
    },
    {
        "content": "* Discloses separation from service of julieta s. Tañeca  a vice president of the company  effective march 31  2017  Source text for Eikon:  Further company coverage:",
        "date": "02072017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT discloses separation from service of VP Julieta S. Tañeca "
    },
    {
        "content": "* Announces separation from service of Margarito G. Dujali  jr.  vice president of the company  Source text for Eikon:  Further company coverage:",
        "date": "01182017",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT announces separation from service of co's vice president "
    },
    {
        "content": "* First vice president Cesar M. Enriquez retires  Source text for Eikon:  Further company coverage:",
        "date": "10112016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT Inc sasy first vice president Cesar M. Enriquez retires "
    },
    {
        "content": "MANILA  Aug 30 The Philippines' Court of Appeals on Tuesday said it has halted the competition regulator's review of a $1.5 billion deal that could strengthen the duopoly of the country's two biggest telecom firms.",
        "date": "08302016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Philippine court halts regulator review of $1.5 bln PLDT  Globe Telecom deal "
    },
    {
        "content": "Aug 2 Philippine Long Distance Telephone Co (PLDT) Chairman and CEO Manuel Pangilinan says in a briefing",
        "date": "08022016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-Philippines' PLDT in talks to sell 8.7 pct stake in Meralco "
    },
    {
        "content": "Aug 2 Philippine Long Distance Telephone Co (PLDT) says",
        "date": "08022016",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "BRIEF-Philippines' PLDT Q2 net income down 33 pct y/y "
    },
    {
        "content": "* Philippine Long Distance Telecommunications Company plans to open two more data centers this year - Nikkei",
        "date": "07282016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-PLDT plans to open two data centers this year - Nikkei "
    },
    {
        "content": "MANILA  June 17 The Philippine Competition Commission said on Friday it will conduct a \"comprehensive review\" of the $1.5 billion acquisition by Philippine Long Distance Telephone Co (PLDT) and Globe Telecom Inc  of San Miguel Corp's telecoms assets.",
        "date": "06172016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Philippine anti-trust body to review $1.5 bln PLDT  Globe telecoms deal "
    },
    {
        "content": "MANILA  June 16 The Philippines' two largest telecom firms have agreed to share each others' online content and applications  company officials said on Thursday  paving the way for faster web services in a country that ranks near the bottom in Asia in internet speeds.",
        "date": "06162016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Philippines' PLDT  Globe Telecom to share content to boost internet speed "
    },
    {
        "content": "MANILA The $1.5 billion deal struck by Philippine Long Distance Telephone Co (PLDT) and Globe Telecom Inc to buy San Miguel Corp telecoms assets does not violate the country's anti-competition law  a PLDT official said.",
        "date": "06142016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "PLDT executive says telecoms deal does not violate Philippine anti-competition law "
    },
    {
        "content": "June 16 Southeast Asian stock markets were cautious on Thursday after the U.S. Federal Reserve refrained from raising interest rates and the Bank of Japan kept monetary policy steady  while Brexit fears continued to weigh.     The U.S. central bank kept policy steady as widely expected and lowered its economic projections but signalled that it still planned to raise rates twice in 2016.      A small majority of Wall Street's top banks expects the Fed to raise interest rates no more t",
        "date": "06162016",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "SE Asia Stocks-Cautious on Brexit fears "
    },
    {
        "content": "MANILA  June 14 The $1.5 billion deal struck by Philippine Long Distance Telephone Co (PLDT) and Globe Telecom Inc to buy San Miguel Corp telecoms assets does not violate the country's anti-competition law  a PLDT official said.",
        "date": "06142016",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "PLDT exec says telecoms deal does not violate Philippine anti-competition law "
    },
    {
        "content": "MANILA  June 2 The Philippines' telecoms regulator said on Thursday it has given the country's two main operators a year to boost chronically slow internet speeds or it will revoke approval to take over prized spectrum agreed as part of a $1.5 billion deal this week.",
        "date": "06022016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Philippine telecoms watchdog gives PLDT-Globe 1 year to boost internet speed "
    },
    {
        "content": "* Prospective partners deterred by legal complexities - pres   (Adds comments from company president)",
        "date": "05312016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "UPDATE 1-San Miguel: PLDT-Globe deal enough to recoup telecoms investment "
    },
    {
        "content": "MANILA  May 30 The Philippine Competition Commission said on Monday it was gathering more information on Philippine Long Distance Telephone Co (PLDT) and Globe Telecom Inc's joint agreement to buy San Miguel Corp's  telecoms operations for $1.5 billion to assess its potential impact on the market.",
        "date": "05302016",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "Philippine anti-trust body says will assess PLDT  Globe telecoms deal "
    },
    {
        "content": "MANILA  May 31 Philippines' conglomerate San Miguel Corp said on Tuesday that the price tag on its $1.5 billion sale of telecoms assets to Philippine Long Distance Telephone Co and Globe Telecom  announced on Monday  was enough to cover costs incurred in developing the business.",
        "date": "05312016",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "San Miguel says value of telecoms deal with PLDT  Globe enough to recoup costs "
    },
    {
        "content": "MANILA  May 30 Philippine Long Distance Telephone Co (PLDT) and rival Globe Telecom  will not require the approval of the Philippines' Congress to complete their agreed deal to buy the telecoms assets of conglomerate San Miguel Corp  PLDT said on Monday.",
        "date": "05302016",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "Philippines' PLDT: No need for Congress to approve purchase of San Miguel telecoms assets "
    },
    {
        "content": "MANILA  May 30 Shares of Philippine Long Distance Telephone Co and Globe Telecom will be suspended from trading for an hour after the pair announced they are jointly acquiring the telecoms business of San Miguel Corp  the exchange said on Monday.",
        "date": "05302016",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "Philippines' PLDT  Globe shares suspended from trading for 1 hour "
    },
    {
        "content": "MANILA  May 30 The Philippines' top two telecoms firms  Philippine Long Distance Telephone Co and Globe Telecom Inc said on Monday they are jointly acquiring the telecommunications assets of conglomerate San Miguel Corp .",
        "date": "05302016",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "Philippines' PLDT  Globe to acquire San Miguel's $1.5 bln telco assets "
    },
    {
        "content": "MANILA  May 30 Philippine Long Distance Telephone Co  the country's biggest telecoms firm  and Globe Telecom Inc  will jointly buy the telecommunications assets of conglomerate San Miguel Corp   the Philippine Daily Inquirer reported on Monday  quoting sources.",
        "date": "05292016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Philippines' PLDT and Globe to buy telco assets of San Miguel -Inquirer "
    },
    {
        "content": "* Sees intense competition as Australia's Telstra eyes entry   (Adds shares  milestones  comments from PLDT CEO  analyst)",
        "date": "02292016",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "UPDATE 1-Philippines' PLDT warns 2016 core profit lowest in 13 yrs  shares sink "
    },
    {
        "content": "MANILA  Feb 29 Philippine Long Distance Telephone Co (PLDT) on Monday reported a quarterly loss due to higher expenses and a weak peso  and said its core earnings will be lower in 2016 amid intense competition.",
        "date": "02292016",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "Philippines' PLDT reports net loss in Q4 "
    },
    {
        "content": "* Says sets 2016 core net income guidance at 28 billion pesos",
        "date": "02292016",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "BRIEF-Philippines' PLDT posts net loss in Q4 "
    },
    {
        "content": "MANILA  Dec 1 Philippine Long Distance Telephone Co \"",
        "date": "12012015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Philippines' PLDT Chairman Pangilinan to assume position of President  CEO as Nazareno retires "
    },
    {
        "content": "* Says Q3 net income 6.6 billion pesos  Source text for Eikon: (http://bit.ly/1Ok7SHO) Further company coverage:    (Reporting by Neil Jerome Morales)",
        "date": "11032015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-Philippines' PLDT Q3 net income falls 17 pct y/y "
    },
    {
        "content": "(The following statement was released by the rating agency) SINGAPORE  October 01 (Fitch) Fitch Ratings has downgraded Philippine Long  Distance Telephone Company's (PLDT) Long-Term Local-Currency Issuer Default  Rating (IDR) (LC IDR) to 'BBB+' from 'A-'. The agency has simultaneously  affirmed PLDT's Long-Term Foreign-Currency IDR (FC IDR) and its foreign-currency  senior unsecured rating at 'BBB'. Fitch has also affirmed the National Rating at  AAA(phl). The Outlook on the issuer ratings is St",
        "date": "10012015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Fitch Downgrades PLDT's LC IDR To 'BBB+'; Affirms FC IDR at 'BBB' "
    },
    {
        "content": "Sept 30 Philippine Long Distance Telephone Company",
        "date": "09302015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-Philippines' PLDT creates unit to connect with leading Silicon Valley firms "
    },
    {
        "content": "MANILA  Aug 4 Philippine Long Distance Telephone Co (PLDT)  the country's oldest and largest telecoms company  said 2015 revenues will slip as consumers move from traditional voice and text usage to digital media  but kept its annual profit estimate.",
        "date": "08042015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Philippines' PLDT sees full-year revenues down on digital shift "
    },
    {
        "content": "* Says H1 net income 18.7 billion pesos ($409 million)  down 6 pct from a year earlier",
        "date": "08042015",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "REFILE-BRIEF-Philippines' PLDT Q2 core net income down 4 pct y/y "
    },
    {
        "content": "Philippine Long Distance Telephone Co plans to invest up to $100 million to build a second international cable landing in the United States to support rising demand for high-speed broadband  The Standard quoted a senior company executive as saying. (http://bit.ly/1Bg9m0q)",
        "date": "06152015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "PHILIPPINES PRESS-PLDT to invest $100 mln in second cable link -Standard "
    },
    {
        "content": "MANILA  June 9 Philippine Long Distance Telephone Co (PLDT) said on Tuesday it was looking to increase spending this year to a record of more than 40 billion pesos ($890 million) to upgrade its network particularly for the fast-growing data business.",
        "date": "06092015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Philippines' PLDT sets 2015 capex at record high as data demand grows "
    },
    {
        "content": "Philippine Long Distance Telephone Co is in talks on joint venture deals involving around 10 tech start-ups overseas  the BusinessWorld reported  quoting the telecommunications firm's chairman  Manuel Pangilinan.",
        "date": "05182015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "PHILIPPINES PRESS-PLDT eyes 10 tech start-ups -BusinessWorld "
    },
    {
        "content": "MANILA  May 5 Philippine Long Distance Telephone Co  the country's second most valuable listed company  said on Tuesday its net income in the first quarter was flat at 9.4 billion pesos ($211 million) with both revenue and expenses stable.",
        "date": "05052015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "Philippines' PLDT posts flat net income in first quarter "
    },
    {
        "content": "The Philippine Long Distance Telephone Co (PLDT) is borrowing about $500 million from Japanese banks to partly fund its capital requirements  the Philippine Daily Inquirer reported  citing a company official.",
        "date": "03062015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "PHILIPPINES PRESS-PLDT to tap $500 mln loan from Japan banks - Inquirer "
    },
    {
        "content": "BANGKOK  March 3 The key Thai stock index hit a near 6-week closing low on Tuesday as index heavyweight PTT  traded ex-dividend while the Philippine main index came off highs after Philippine Long Distance Telephone (PLDT)  retreated after a weak earnings guidance.     Thai benchmark SET index dropped 1.2 percent to 1 562.84  the lowest close since Jan. 22. PTT shares  the biggest by market value  closed down 2.9 percent.     Investors trimmed their risk holdings ahead of a market ho",
        "date": "03032015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "SE Asia Stocks-Thai index touches near 6-wk low ahead of market holiday "
    },
    {
        "content": "* Rival Globe Telecom more than doubles net profit   (Adds comment from company official  details  background)",
        "date": "03032015",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "UPDATE 1-Philippines' PLDT forecasts 2015 profit drop on higher costs "
    },
    {
        "content": "MANILA  March 3 Philippine Long Distance Telephone Co (PLDT) reported on Tuesday a 5 percent decline in fourth quarter net income partly due to higher operating expenses and product subsidies.",
        "date": "03032015",
        "name": "PLDT Inc",
        "news_type": "normal",
        "symbol": "PHI",
        "title": "Philippines' PLDT Q4 income falls 5 pct from yr-ago "
    },
    {
        "content": "* Says PLDT and Rocket Internet agree to create Philippines internet group  Source text for Eikon:  Further company coverage:",
        "date": "01212015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-Rocket Internet and PLDT to create Philippines internet group "
    },
    {
        "content": "* PLDT and Rocket Internet create global joint venture for mobile-first payment solutions with a focus on emerging markets",
        "date": "01062015",
        "name": "PLDT Inc",
        "news_type": "topStory",
        "symbol": "PHI",
        "title": "BRIEF-Rocket Internet  PLDT create mobile payment joint venture "
    }
]