[
    {
        "content": "* Says China capacity cuts will continue to support steel demand",
        "date": "10262017",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 1-POSCO raises 2017 sales forecast  sees steel demand growth after Q3 profit gain "
    },
    {
        "content": "* Sees global steel demand to continue to rise (Adds executive comments in paragraph 13  third-quarter outlook)",
        "date": "07202017",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 2-POSCO Q2 profit jumps 44 pct from year ago on improved profit margins "
    },
    {
        "content": "SEOUL  July 20 South Korean steelmaker Posco said on Thursday its third-quarter operating profit was expected to improve from the previous quarter  helped by output and sales growth and a likely drop in raw materials costs.",
        "date": "07202017",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "Posco sees Q3 profit improving from Q2 on output  sales growth "
    },
    {
        "content": "SEOUL  July 20 South Korea steelmaker POSCO posted a 44.3 percent rise in operating profit for the April-to-June quarter  beating estimates.",
        "date": "07202017",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "POSCO Q2 operating profit up 44.3 pct; beats consensus "
    },
    {
        "content": "SEOUL South Korean steelmaker POSCO plans to sell a stake in KB Financial Group in a block deal worth up to 444 billion won ($383.9 million)  IFR reported on Thursday  citing a term sheet.",
        "date": "07062017",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "Posco to sell shares in KB Financial in block deal worth up to $384 million: IFR "
    },
    {
        "content": "SEOUL  July 5 A South Korean consortium backed by steelmaker POSCO is still interested in buying Australian steel company Arrium Ltd  an official at Newlake Alliance which leads the consortium told Reuters on Wednesday.",
        "date": "07052017",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "S.Korean consortium still interested in buying Arrium - Newlake source "
    },
    {
        "content": "SEOUL  July 6 South Korean steelmaker POSCO plans to sell a stake in KB Financial Group in a block deal worth up to 444 billion won ($383.9 million)  IFR reported on Thursday  citing a term sheet.",
        "date": "07062017",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "Posco to sell shares in KB Financial in block deal worth up to $384 mln-IFR "
    },
    {
        "content": "SINGAPORE  May 19 South Korea's POSCO is seeking a liquefied natural gas (LNG) cargo for delivery on June 26 to 30 via tender  trade sources with knowledge of the tender said on Friday.",
        "date": "05192017",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "POSCO seeks end-June LNG cargo via tender -trade sources "
    },
    {
        "content": "* S.Korea's trade ministry plans to raise issue at WTO meeting",
        "date": "04212017",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "RPT-UPDATE 4-S.Korea to raise issue of U.S. steel import restrictions at WTO "
    },
    {
        "content": "* S.Korea's trade ministry plans to raise issue at WTO meeting (Rewrites to add comments from trade ministry statement)",
        "date": "04212017",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "UPDATE 4-S.Korea to raise issue of U.S. steel import restrictions at WTO "
    },
    {
        "content": "* Higher costs in view; FY revenue outlook unchanged (Adds outlook on coking coal prices  earnings details)",
        "date": "04182017",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 1-POSCO says Q1 profit doubled  but braces for coking coal cost hit from Cyclone Debbie "
    },
    {
        "content": "SEOUL  March 30 South Korean steelmaker POSCO said on Thursday it estimated its first-quarter operating profit likely jumped more than four-fifths  topping analysts' expectations  underpinned by solid steel demand in China amid rising prices.",
        "date": "03302017",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 1-POSCO sees Q1 operating profit up 82 pct on China demand  higher steel prices "
    },
    {
        "content": "SEOUL  March 30 South Korean steelmaker POSCO said on Thursday it estimated its first-quarter operating profit likely jumped 82 percent  topping analysts' expectations  as rising steel prices outpaced growth in raw material costs.",
        "date": "03302017",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "POSCO Q1 operating profit jumps 82 pct on higher steel prices "
    },
    {
        "content": "* Sees 54.8 trln won 2017 revenue; slight rise in global demand",
        "date": "01252017",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 1-POSCO Q4 operating profit up 40 pct  but misses estimates "
    },
    {
        "content": "SEOUL  Jan 25 South Korean steelmaker POSCO  posted fourth-quarter operating profit that jumped 40 percent but was still well below market forecasts  according to Reuters' calculations  reflecting raw material costs that rose faster than steel prices.",
        "date": "01252017",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "POSCO Q4 operating profit climbs nearly 40 pct  but misses market forecast "
    },
    {
        "content": "SYDNEY/SEOUL  Nov 3 South Korea's POSCO  said on Thursday it has not bid to acquire Australia's Arrium Ltd steelworks  but is trying to sell the group technology  differing from comments by a senior Australian minister that said POSCO is in the running.",
        "date": "11032016",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 1-POSCO says not a bidder for Australia's Arrium steelworks "
    },
    {
        "content": "* Company cautions on Q4 due to coking coal price surge   (Add executive comments  Moody's report)",
        "date": "10262016",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 2-POSCO Q3 profit jumps to more than 4-yr high on steel price gains "
    },
    {
        "content": "SEOUL South Korean steelmaker POSCO posted a weaker-than-expected quarterly operating profit  but said it was likely to benefit in the longer term as measures to curb overcapacity in top producer China start positively impacting product prices.",
        "date": "07212016",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "POSCO posts weak second quarter; sees long-term benefit from China steel reforms "
    },
    {
        "content": "SEOUL Chief executive of POSCO  South Korea's top steelmaker  said \"protectionism\" by the United States and other countries could have an adverse impact on the company's exports  media reports showed on Friday.",
        "date": "06242016",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "POSCO CEO says steel 'protectionism' by U.S.  others to hurt exports: media "
    },
    {
        "content": "* POSCO posts smaller-than-expected drop in Q1 operating profit",
        "date": "04212016",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 2-POSCO says China steel prices to steady; cautious on oversupply "
    },
    {
        "content": "* Signs initial agreement to take 8 pct stake in $1.6 bln project",
        "date": "02292016",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 1-South Korea's POSCO signs deal to help build Iran steel mill "
    },
    {
        "content": "* Q4 consolidated oper profit 341 bln won vs 503 bln consensus",
        "date": "01282016",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 1-POSCO Q4 profit hits 3-yr-low as record China steel exports bite "
    },
    {
        "content": "SEOUL  Jan 28 South Korean steelmaker POSCO  posted its smallest quarterly operating profit in at least three years  as steel prices fell faster than raw materials costs  pressured by record exports of Chinese steel.",
        "date": "01282016",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "POSCO's Q4 operating profit down 55 pct  misses estimates "
    },
    {
        "content": "MELBOURNE  Oct 27 South Korea's POSCO  may build and help arrange financing for a graphite project in Tanzania being developed by Magnis Resources   as the Australian explorer races to start producing from the east African site by 2017.",
        "date": "10272015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "POSCO may build Magnis Resources' Tanzanian graphite project "
    },
    {
        "content": "* China sector weak  but Beijing seeking to stoke demand   (Adds restructuring  dividends  2016 investment forecast)",
        "date": "10202015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 2-POSCO profit highest in over 2 yrs  stable iron ore costs offset weak steel prices "
    },
    {
        "content": "SEOUL  Oct 20 South Korean steelmaker POSCO  said its third-quarter operating profit crept up 0.5 percent from a year earlier  beating estimates  as more stable iron ore input costs helped it absorb weak steel product prices and a continuing supply glut.",
        "date": "10202015",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "POSCO Q3 profit edges up 0.5 pct  steel supply glut continues "
    },
    {
        "content": "* Iron ore prices seen improving by the time mines start   (Adds outcome of POSCO meeting at paragraph 15)",
        "date": "08252015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 1-India to auction 20 major iron ore mines to revive industry "
    },
    {
        "content": "* Will no longer invest in Korea's Posco  Daewoo International",
        "date": "08172015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 1-Norway fund axes four Korean and Malaysian firms over palm oil "
    },
    {
        "content": "* Shares up 4 pct on dividend surprise   (Adds CEO comments  share price reaction)",
        "date": "08172015",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "UPDATE 1-Australia's Aurizon hikes dividend payout  putting growth on hold "
    },
    {
        "content": "MUMBAI South Korean steelmaker POSCO  and Shree Uttam Steel and Power Ltd have agreed to set up a 3-million-tonnes-per-year integrated steel plant in Maharashtra  the Indian firm said on Tuesday.",
        "date": "08112015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "POSCO  Uttam Galva arm to set up steel plant in India "
    },
    {
        "content": "MUMBAI  Aug 11 South Korean steelmaker POSCO  and India's Shree Uttam Steel and Power Ltd have agreed to set up a 3-million-tonnes-per-year integrated steel plant in western Maharashtra state  the Indian firm said on Tuesday.",
        "date": "08112015",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "UPDATE 1-South Korea's POSCO  Uttam Galva arm to set up steel plant in India "
    },
    {
        "content": "RIO DE JANEIRO  July 30 Brazilian mining company Vale SA said on Thursday the start up of Cia Siderurgica do Pecem (CSP)  a Brazilian steel mill being built with Korea's Posco and Dongkuk Steel Mill Co   will be delayed until the first half of 2016 from the second half of 2015 because of a strike.",
        "date": "07302015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "Vale says start of Posco  Dongkuk Brazil steel mill delayed to 2016 "
    },
    {
        "content": "SEOUL South Korea's POSCO said it would shut down unprofitable local and overseas businesses as part of a restructuring plan aimed at boosting profit growth in the world's sixth-largest steelmaker as global demand for steel remains weak.",
        "date": "07152015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "POSCO says to exit unprofitable businesses as weak steel demand caps profit growth "
    },
    {
        "content": "NEW DELHI/BHUBANESWAR  India South Korean steelmaker POSCO could scrap plans for a $12 billion project it agreed to set up in India a decade ago  after a new law made it costlier to source iron ore for the plant  a company spokesman told Reuters.",
        "date": "07162015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "POSCO may scrap planned $12 billion India steel project "
    },
    {
        "content": "NEW DELHI/BHUBANESWAR  India  July 16 South Korean steelmaker POSCO could scrap plans for a $12 billion project it agreed to set up in India a decade ago  after a new law made it costlier to source iron ore for the plant  a company spokesman told Reuters.",
        "date": "07162015",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "UPDATE 1-South Korea's POSCO may scrap planned $12 bln India steel project "
    },
    {
        "content": "SEOUL POSCO  is set to sell a stake of at least 30 percent in unlisted POSCO Engineering & Construction Co Ltd for around 1 trillion won ($920 million) to Saudi Arabia's Public Investment Fund  a South Korean newspaper reported on Monday.",
        "date": "05172015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "POSCO close to selling construction unit stake to Saudi fund: Chosun Ilbo "
    },
    {
        "content": "* West Pilbara final investment decision pushed out to late 2016",
        "date": "05112015",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "UPDATE 1-Baosteel  Aurizon delay Australia iron ore project by 18-24 months "
    },
    {
        "content": "* Sees iron ore prices remaining weak in Q2   (Add exec quotes  steel prices  iron ore outlook)",
        "date": "04212015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 2-After Q1 profit jump  POSCO says rivals' exports to squeeze steel prices "
    },
    {
        "content": "SEOUL  April 21 South Korean steelmaker POSCO  said on Tuesday its quarterly operating profit rose 20 percent  beating estimates  as lower iron ore input costs more than offset the impact of weaker steel prices.",
        "date": "04212015",
        "name": "POSCO",
        "news_type": "normal",
        "symbol": "PKX",
        "title": "POSCO Q1 profit up 20 pct  low iron ore costs outweigh weaker steel prices "
    },
    {
        "content": "SEOUL South Korean steelmaker POSCO shares fell 2 percent to their lowest levels in more than six years on Wednesday after media reports that Warren Buffett's Berkshire Hathaway Inc had sold its entire stake in the company.",
        "date": "04012015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "POSCO shares down after media reports Berkshire Hathaway sold stake "
    },
    {
        "content": "* Weak China growth weighs steel prices   (Add details  background)",
        "date": "01292015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "UPDATE 1-POSCO Q4 profit misses forecasts as China demand remains fragile "
    },
    {
        "content": "NEW DELHI  Jan 22 South Korea's POSCO  inaugurated a $709 million steel mill in western India on Thursday  looking to gradually scale up its presence in the emerging market despite having to wait for a decade to get started on a $12 billion steelmaking plant.",
        "date": "01222015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "POSCO opens India steel mill  but mega project stuck "
    },
    {
        "content": "NEW DELHI  Jan 19 India's Odisha state wants New Delhi to grant an iron ore exploration licence to South Korea's POSCO for its proposed $12 billion steel plant in the state  seeking an exception to a rule mandating auctions for all new mines.",
        "date": "01192015",
        "name": "POSCO",
        "news_type": "topStory",
        "symbol": "PKX",
        "title": "India's Odisha state pitches for iron ore licence for POSCO "
    }
]