[
    {
        "content": "(The following statement was released by the rating agency) LONDON  October 30 (Fitch) Fitch Ratings has affirmed US-based tobacco group Philip Morris International  Inc's (PMI) Long-Term Issuer Default Rating (IDR) and Senior Unsecured Long-Term Rating at 'A'. PMI's Short-Term IDR and Short-Term Debt Rating are affirmed at 'F1'. The Outlook remains Negative. The Negative Outlook reflects the risk of a downgrade in the absence of reforms to the current US tax system. This system leads PMI to bui",
        "date": "10302017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Fitch Affirms Philip Morris International at 'A'; Outlook Negative "
    },
    {
        "content": "* Revises 2017 full-year reported diluted eps forecast to a range of $4.75 to $4.80​",
        "date": "10192017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International qtrly ‍adj. EPS $1.27​ "
    },
    {
        "content": "GENEVA  Sept 28 The World Health Organization told governments on Thursday not to get involved in a foundation funded by tobacco firm Philip Morris International to look at ways of reducing the harm from smoking.",
        "date": "09282017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "UPDATE 1-WHO tells govts to reject Philip Morris-funded smoking foundation "
    },
    {
        "content": "* Martin King  currently President  Asia region will be appointed CFO​",
        "date": "09282017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International announces senior management changes "
    },
    {
        "content": "* Czech tobacco group Philip Morris CR says H1 consolidated revenues czk 5.8 billion and net income czk 1.6 billion  up 7 percent and 24.7 percent respectively",
        "date": "09262017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Czech Philip Morris reports jump in H1 profit "
    },
    {
        "content": "* Increased company's regular quarterly dividend by 2.9% to an annualized rate of $4.28 per share​",
        "date": "09132017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International increases regular quarterly dividend by 2.9 pct "
    },
    {
        "content": "* Philip morris international announces support for establishment of foundation",
        "date": "09132017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris to spend nearly $1 bln over 12 yrs to cut smoking harm "
    },
    {
        "content": "LONDON The Ferrari Formula One team and tobacco company Philip Morris International announced on Monday the renewal of one of the longest-running and least obvious sponsorships in sport.",
        "date": "09042017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Motor racing: Ferrari continue with tobacco sponsor "
    },
    {
        "content": "LONDON  Sept 4 The Ferrari Formula One team and tobacco company Philip Morris International announced on Monday the renewal of one of the longest-running and least obvious sponsorships in sport.",
        "date": "09042017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Motor racing-Ferrari continue with tobacco sponsor "
    },
    {
        "content": "* it has renewed its multi-year partnership with Philip Morris International. Source text for Eikon: Further company coverage: (Reporting by Milan newsroom)",
        "date": "09042017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "BRIEF-Ferrari renews multi-year partnership with Philip Morris International "
    },
    {
        "content": "* Reorganizes to help integrate vaping products with core business",
        "date": "08312017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "UPDATE 2-BAT restructures to help e-cigarettes go mainstream "
    },
    {
        "content": "* Says on Aug 29 co entered agreement  effective Oct 1 to extend term of $3.5 billion revolving credit facility  dated Oct 1  2015‍​ ‍​",
        "date": "08292017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International extends term of Revolving Credit Facility "
    },
    {
        "content": "* Acquisition follows Indonesian deal worth $1 bln including debt",
        "date": "08222017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "CORRECTED-UPDATE 1-Japan Tobacco to buy Philippine cigarette maker Mighty for $936 mln "
    },
    {
        "content": "The chief executive of Philip Morris International said he was \"extremely encouraged\" by the U.S. Food and Drug Administration's recent proposal to lower nicotine levels in cigarettes and nudge smokers toward less harmful alternatives such as e-cigarettes.",
        "date": "08222017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Philip Morris International CEO cheers U.S. FDA tobacco proposal "
    },
    {
        "content": "NEW DELHI The Indian government has threatened Philip Morris International Inc with \"punitive action\" over the tobacco giant's alleged violation of the country's anti-smoking laws  according to a letter sent to the company by the federal health ministry.",
        "date": "08182017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "India threatens Philip Morris with 'punitive action' over alleged violations "
    },
    {
        "content": "* Files for offering of $750 million 2.375% notes due 2022‍​ and $500 million 3.125% notes due 2027 - SEC filing",
        "date": "08162017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International announces notes offering "
    },
    {
        "content": "* Philip Morris International files prospectus supplement with U.S. SEC related to a potential two-part notes offering - SEC filing‍​ Source text for Eikon: [ID: nEOL4TBXz5] Further company coverage:",
        "date": "08142017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris files prospectus supplement with SEC related to potential two-part notes offering "
    },
    {
        "content": "TOKYO  Aug 2 Japan Tobacco Inc on Wednesday lowered its domestic cigarette sales forecast for this year as it sees more smokers defecting to \"heat-not-burn\" (HNB) tobacco products dominated by global rival Philip Morris International Inc.",
        "date": "08022017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Japan Tobacco cuts cigarette outlook as smokers shift to \"heat-not-burn\" alternatives "
    },
    {
        "content": "July 28 A U.S. move to cut nicotine levels in traditional cigarettes could prove a boon to Philip Morris International Inc  which has invested heavily in a new smoking device that heats rather than burns tobacco and may carry fewer health risks  tobacco analysts said on Friday.",
        "date": "07282017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "FDA move on nicotine could boost Philip Morris iQOS smoking device "
    },
    {
        "content": "NEW DELHI India plans to seek an explanation from Philip Morris International Inc about its marketing practices after Reuters reported that the tobacco giant used tactics that government officials say flout the country's law  a health ministry official said on Friday.",
        "date": "07212017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "India to quiz Philip Morris on marketing of Marlboro "
    },
    {
        "content": "* Says plans to invest 490 million euros ($571.19 million) to convert its cigarette factory in the Romanian city of Otopeni  near capital Bucharest into a smoke-free facility that produces HEETS  tobacco units used with electronic cigarettes.",
        "date": "07252017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris to invest 490 mln euros in Romanian factory "
    },
    {
        "content": "* Philip Morris International Inc qtrly ‍reported diluted earnings per share of $1.14​",
        "date": "07202017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International qtrly ‍adjusted diluted EPS $1.14​ "
    },
    {
        "content": "By Aditya Kalra  Paritosh Bansal  Tom Lasseter and Duff Wilson",
        "date": "07182017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Special Report: Philip Morris takes aim at young people in India  and health officials are fuming "
    },
    {
        "content": "By Aditya Kalra  Paritosh Bansal  Duff Wilson and Tom Lasseter",
        "date": "07132017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Exclusive: Documents reveal Philip Morris' campaign to subvert the world's anti-smoking treaty "
    },
    {
        "content": "LONDON  June 30 Cigarette maker Philip Morris International thinks its iQOS smokeless tobacco product can make Britain a country of non-smokers in coming years  an executive said on Friday.",
        "date": "06302017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Tobacco group Philip Morris sees iQOS as key to smokeless future in UK "
    },
    {
        "content": "LONDON  June 30 Cigarette maker Philip Morris International thinks its iQOS heated tobacco product can make Britain smoke-free in the coming years  an executive said on Friday.",
        "date": "06302017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "UPDATE 1-Tobacco group Philip Morris sees iQOS as key to smokeless future in UK "
    },
    {
        "content": "TOKYO  June 28 Japan Tobacco Inc said on Wednesday it hoped to catch up with Philip Morris International Inc in smokeless tobacco by expanding the number of smoke-free restaurants and public places that allow its vaping product.",
        "date": "06282017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Japan Tobacco tries to catch up with rival in smokeless tobacco "
    },
    {
        "content": "* Philip Morris International Inc - plans to invest approximately USD 320 million in a new high-tech facility in Dresden  Germany  to produce Heets",
        "date": "06192017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris to build smoke-free product facility in Germany "
    },
    {
        "content": "TOKYO British American Tobacco will expand sales of its \"glo\" tobacco-heating device to Tokyo and Osaka from July and roll it out nationwide by year-end  intensifying a battle with Philip Morris International for a share of Japan's vaping market.",
        "date": "05302017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "British American Tobacco to expand 'glo' smokeless tobacco sales in Japan from July "
    },
    {
        "content": "TOKYO  May 30 British American Tobacco will expand sales of its \"glo\" tobacco-heating device to Tokyo and Osaka from July and roll it out nationwide by year-end  intensifying a battle with Philip Morris International for a share of Japan's vaping market.",
        "date": "05302017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "British American Tobacco to expand \"glo\" smokeless tobacco sales in Japan from July "
    },
    {
        "content": "* Altria's statement on FDA'S filing of Philip Morris International's modified risk tobacco product application",
        "date": "05252017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Altria \"pleased\" U.S. FDA filed Philip Morris' MRTP application for electronically-heated tobacco product "
    },
    {
        "content": "MANILA  May 18 Philippine President Rodrigo Duterte has signed an executive order banning smoking in public across the second-most populous country in Southeast Asia  one of the region's strictest anti-tobacco laws.",
        "date": "05182017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Philippines' Duterte gets tough on tobacco with ban on smoking in public "
    },
    {
        "content": "* To produce cigarettes for Philip Morris at $5.8 per 1 000 cigarettes upto less than 15 billion cigarettes",
        "date": "05172017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Eastern Co updates on cigarettes production deal with Philip Morris "
    },
    {
        "content": "* began trading ex-dividend April 20 Further company coverage:",
        "date": "04282017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Czech Philip Morris AGM approves CZK 1 000/share dividend -CTK "
    },
    {
        "content": "LONDON Philip Morris International said on Friday it has applied for pre-market approval of its iQOS heated tobacco product with the U.S. Food and Drug Administration.",
        "date": "03312017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Philip Morris asks for FDA nod to sell heated tobacco device "
    },
    {
        "content": "* proposes dividend CZK 1000/share  versus CZK 920/share previous year (Reuters poll CZK 935/share)",
        "date": "03282017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Czech Philip Morris proposes higher dividend of 1 000 crowns/share "
    },
    {
        "content": "LONDON Philip Morris International said on Friday it has applied for pre-market approval of its iQOS heated tobacco product with the U.S. Food and Drug Administration.",
        "date": "03312017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Philip Morris asks for U.S. FDA nod to sell heated tobacco device "
    },
    {
        "content": "LONDON  March 31 Philip Morris International said on Friday it has applied for pre-market approval of its iQOS heated tobacco product with the U.S. Food and Drug Administration.",
        "date": "03312017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "UPDATE 1-Philip Morris asks for U.S. FDA nod to sell heated tobacco device "
    },
    {
        "content": "LONDON  March 31 Philip Morris International said on Friday it has applied for a pre-market approval of its iQOS heated tobacco product with the U.S. Food and Drug Administration.",
        "date": "03312017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Philip Morris files U.S. FDA application for heated tobacco device "
    },
    {
        "content": "* Philip Morris International (PMI) files premarket tobacco product application for its Electronically Heated Tobacco Product (EHTP) with the U.S. Food and Drug Administration (FDA)",
        "date": "03312017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International files premarket tobacco product application for EHTP with U.S.FDA "
    },
    {
        "content": "ATHENS  March 22 Marlboro maker Philip Morris  will invest 300 million euros ($323.76 million) in its Greek unit Papastratos to convert the cigarette plant into a maker of tobacco sticks for its smokeless IQOS product  executives said on Thursday.",
        "date": "03222017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "REFILE-Philip Morris to invest 300 millon euros in Greece for smoke-free product "
    },
    {
        "content": "* CEO André Calantzopoulos' total compensation for 2016 was $18.1 million versus $16.3 million in 2015 - SEC filing  Source text (http://bit.ly/2nar1Ch) Further company coverage:",
        "date": "03232017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International says CEO André Calantzopoulos' total compensation for 2016 was $18.1 mln "
    },
    {
        "content": "ATHENS Marlboro maker Philip Morris  will invest 300 million euros ($323.76 million) in its Greek unit Papastratos to convert the cigarette plant into a maker of tobacco sticks for its smokeless IQOS product  executives said on Thursday.",
        "date": "03222017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Philip Morris to invest 300 million euros in Greece for smoke-free product "
    },
    {
        "content": "* Philip Morris International announces EUR300 million investment in smoke-free product manufacturing facility in Greece",
        "date": "03222017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris announces EUR300 mln investment in smoke-free product manufacturing facility in Greece "
    },
    {
        "content": "* Philip Morris International (PMI) declares regular quarterly dividend of $1.04 per share  Source text for Eikon:  Further company coverage:",
        "date": "03092017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International declares quarterly dividend of $1.04/shr "
    },
    {
        "content": "TOKYO  March 2 Philip Morris International  said on Thursday it has more than doubled the stock of its popular iQOS tobacco device in Japan  but demand continues to outstrip supply even as  competition intensifies over smokeless products.",
        "date": "03022017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Philip Morris says it has doubled supply of iQOS tobacco device in Japan "
    },
    {
        "content": "CAIRO Egypt's top cigarette maker Eastern Company said on Thursday it had reached an agreement with its international partner Philip Morris for the tobacco giant to pay back outstanding debt and make future payments in the local currency.",
        "date": "03012017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Egypt's Eastern Co  Philip Morris reach agreement over arrears "
    },
    {
        "content": "CAIRO  March 1 Egypt's top cigarette maker Eastern Company said on Wednesday it had reached an agreement with its international partner Philip Morris for the tobacco giant to pay back outstanding debt and make future payments in the local currency.",
        "date": "03012017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "REFILE-Egypt's Eastern Co  Philip Morris reach agreement over arrears "
    },
    {
        "content": "* 2016 adjusted profit from operations up 10 pct   (Adds details from media briefing)",
        "date": "02232017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "UPDATE 3-BAT looks to double its vaping markets "
    },
    {
        "content": "* Philip Morris International Inc - file for potential debt shelf; size not disclosed - sec filing  Source text : http://bit.ly/2lH2Flm Further company coverage:",
        "date": "02142017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International - files for potential debt shelf size not disclosed "
    },
    {
        "content": "* Philip morris international inc. (pmi) reports 2016 results; provides 2017 earnings per share forecast",
        "date": "02022017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International qtrly adjusted earnings per share of $1.10 "
    },
    {
        "content": "* PHILIP MORRIS INTERNATIONAL - ENTERED INTO AGREEMENT  EFFECTIVE FEBRUARY 7  2017  TO EXTEND TERM OF ITS EXISTING $2.0 BILLION REVOLVING CREDIT FACILITY",
        "date": "01302017",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-PHILIP MORRIS INTERNATIONAL ENTERS INTO AGREEMENT TO EXTEND TERM OF ITS EXISTING $2.0 BLN REVOLVING CREDIT FACILITY "
    },
    {
        "content": "Jan 18 As tobacco and vaping companies focus on new smoking products that are potentially less harmful  the industry sees an opening for rolling back rules on these products under the Trump administration.",
        "date": "01182017",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Vape companies try to galvanize Trump administration to ease FDA rules "
    },
    {
        "content": "Philip Morris International Inc  filed a much-awaited U.S. application to market a new type of cigarette that heats rather than burns tobacco and may carry fewer health risks.",
        "date": "12062016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Philip Morris seeks U.S. approval to market alternative cigarette "
    },
    {
        "content": "LONDON Philip Morris International   the world's largest international tobacco company  said it could eventually stub out cigarette sales as it launched an alternative product in Britain on Wednesday.",
        "date": "11302016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Philip Morris looks beyond cigarettes with alternative products "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in General Motors - SEC filing",
        "date": "11142016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Soros Fund Management takes share stake in Alphabet  dissolves stake in GM - SEC filing "
    },
    {
        "content": "Nov 14 U.S. cigarette maker Reynolds American Inc is seeking a higher price from British American Tobacco Plc after rejecting its $47 billion takeover offer  a source familiar with the situation told Reuters.",
        "date": "11142016",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "UPDATE 2-Reynolds American rejects BAT's $47 bln takeover offer - source "
    },
    {
        "content": "TOKYO/LONDON  Nov 8 British American Tobacco PLC (BAT) plans to test a new tobacco-based cigarette alternative in Japan next month  it said on Tuesday  taking aim at Philip Morris International Inc's popular iQOS and Japan Tobacco Inc's Ploom Tech.",
        "date": "11082016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "CORRECTED-British American Tobacco to test tobacco e-cigarette in Japan "
    },
    {
        "content": "* Philip Morris International says in September  Thailand's Department Of Special Investigations commenced formal investigations against co",
        "date": "10252016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris says Thailand begins formal probe into imports case "
    },
    {
        "content": "* Philip Morris International Inc. (PMI) reports 2016 third-quarter results; reaffirms 2016 full-year reported diluted EPS forecast",
        "date": "10182016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International Q3 adjusted earnings per share $1.25 "
    },
    {
        "content": "* Philip Morris International Inc. Hosts Investor Day; Revises For Currency  And Narrows  2016 Full-Year Reported Diluted EPS Forecast",
        "date": "09292016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris says now expects FY earnings per share in range of $4.53 to $4.58 "
    },
    {
        "content": "LONDON  Sept 23 Japan Tobacco is aiming to start rolling out its Ploom Tech tobacco-based e-cigarette in cities across Japan next year  a senior executive said on Friday  as it fights to catch up to larger rival Philip Morris.",
        "date": "09232016",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Japan Tobacco to roll out e-cigarette next year "
    },
    {
        "content": "LONDON  Sept 23 Japan Tobacco aims to start selling its Ploom Tech tobacco-based electronic cigarette in cities across Japan next year  it said on Friday  as it fights to catch up with bigger rival Philip Morris in meeting the growing demand for  \"vaping\" products.",
        "date": "09232016",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "CORRECTED-UPDATE 1-Japan Tobacco to roll out e-cigarette next year "
    },
    {
        "content": "* Says increased company's regular quarterly dividend by 2% to an annualized rate of $4.16 per share",
        "date": "09142016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris sets quarterly dividend at $1.04 per share "
    },
    {
        "content": "* Managers cite duty to make money  not exercise moral judgment",
        "date": "09062016",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "European fund firms largely resist tobacco divestment campaign "
    },
    {
        "content": "* Philip Morris International-entered into an agreement to extend term of its existing $3.5 billion revolving credit facility  dated as of oct. 1  2015",
        "date": "08312016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International -entered into an agreement to extend term of its existing $3.5 billion revolving credit facility  dated as of Oct. 1  2015 "
    },
    {
        "content": "* Cigarette maker Philip Morris Czech Republic reports H1 net profit of CZK 1.32 billion (1.36 bln seen in Reuters poll  1.34 billion in H1 2015)",
        "date": "08192016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris Czech Republic H1 net profit CZK 1.32 bln (Reuters poll CZK 1.36 bln) "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  August 01 (Fitch) Fitch Ratings has affirmed US-based tobacco group  Philip Morris International  Inc's (PMI) Long-Term Issuer Default Rating (IDR)  and senior unsecured long-term rating at 'A'. PMI's Short-Term IDR and  short-term debt rating are affirmed at 'F1'. The Outlook on the Long-Term IDR is  Negative. The ratings reflect the strong operating profile of PMI  supported by its  leading market shares and pricing power  whi",
        "date": "08012016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Fitch Affirms Philip Morris International at 'A'; Outlook Negative "
    },
    {
        "content": "MONTEVIDEO The World Bank's International Centre for Settlement of Investment Disputes (ICSID) ruled in favor of Uruguay on Friday in a suit filed by Philip Morris International  seeking compensation for economic damages caused by the nation's anti-tobacco measures.",
        "date": "07092016",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Phillip Morris loses tough-on-tobacco lawsuit in Uruguay "
    },
    {
        "content": "MONTEVIDEO  July 8 The World Bank's International Centre for Settlement of Investment Disputes (ICSID) ruled in favor of Uruguay on Friday in a suit filed by Philip Morris International seeking compensation for economic damages caused by the nation's anti-tobacco measures.",
        "date": "07082016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Phillip Morris loses tough-on-tobacco lawsuit in Uruguay "
    },
    {
        "content": "* Comments on decision of ICSID tribunal in arbitration between PMI  Uruguay regarding 2 regulations Uruguay implemented in 2009",
        "date": "07082016",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International comments on tribunal's decision in arbitration between PMI and Uruguay "
    },
    {
        "content": "June 9 Philip Morris International Inc * Declares regular quarterly dividend of $1.02 per share Source text for Eikon: Further company coverage: ",
        "date": "06092016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International declares regular quarterly dividend of $1.02 per share "
    },
    {
        "content": "SAN FRANCISCO  June 6 Investors looking for stability and dividends have been pouring money into consumer staples stocks of late  ignoring warnings from Wall Street's analysts about pricey valuations for companies like Clorox  and Campbell Soup.",
        "date": "06062016",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Wall St pours money into consumer staples as valuations climb "
    },
    {
        "content": "* \"We are certainly disappointed but understand that English court ultimately deferred to parliament`s judgment about cigarette packaging\" - Senior Vice President",
        "date": "05192016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris Intl comments on English Court's plain packaging decision "
    },
    {
        "content": "* Philip Morris International comments on English Court's plain packaging decision",
        "date": "05192016",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International comments on English Court's plain packaging decision "
    },
    {
        "content": "* Issued EUR 500 million aggregate principal amount of its 2.000% notes due 2036 - SEC filing",
        "date": "05092016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International issues EUR500 mln of 2.000% notes due 2036 - SEC filing "
    },
    {
        "content": "* Philip Morris International comments on court of justice of European Union judgment on EU tobacco products directive  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05042016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris comments on EU tobacco products directive "
    },
    {
        "content": "* shareholders in the cigarette producer approved a dividend of 920 crowns ($38.76) per share on Friday  CTK news agency reported",
        "date": "04292016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Czech Philip Morris AGM approves CZK 920/share dividend -CTK news agency "
    },
    {
        "content": "* Philip Morris International Inc. (Pmi) Reports 2016 First quarter results; increases  for currency only  2016 full-year reported diluted eps forecast to a range of $4.40 to $4.50",
        "date": "04192016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International sees FY 2016 EPS of $4.40-$4.50 "
    },
    {
        "content": "* says board proposes dividend of CZK 920/share (previous CZK 880/share)",
        "date": "03292016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Czech Philip Morris proposes higher dividend of CZK 920/share "
    },
    {
        "content": "* Sets regular quarterly dividend of $1.02 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "03102016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Philip Morris International sets quarterly dividend of $1.02 per share "
    },
    {
        "content": "LONDON  Feb 12 Consumer companies are offering investors a small degree of relief from the turmoil in banking and resources in a results season dominated by fears about slowing economic growth.",
        "date": "02122016",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Consumer companies' outperformance no longer guaranteed by cheap oil "
    },
    {
        "content": "JAKARTA  Jan 20 PT Hanjaya Mandala Sampoerna Tbk  plans to aggressively market stronger-flavoured cigarettes this year  its top executive said  as Indonesia's biggest tobacco firm seeks to extend its dominance of one of the world's fastest growing markets for cigarettes.",
        "date": "01202016",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Philip Morris-controlled Sampoerna seeks wider Indonesia reach with stronger cigarettes "
    },
    {
        "content": "JERUSALEM  Jan 19 Cigarette giant Philip Morris International will invest about $20 million in an Israeli start-up that developed a metered-dose vaporiser of raw plants for medical use  Israeli news website Calcalist reported on Tuesday.",
        "date": "01192016",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Philip Morris to invest $20 mln in firm developing inhaler -report "
    },
    {
        "content": "* Advocate General says EU tobacco law is valid  proportionate",
        "date": "12232015",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "UPDATE 2-Big Tobacco faces blow as top court adviser backs EU law "
    },
    {
        "content": "LUXEMBOURG An adviser to Europe's highest court in Luxembourg on Wednesday said an EU law on cigarettes was valid  rebuffing a challenge from Philip Morris International  although the court still has to deliver a final ruling.",
        "date": "12232015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Adviser to top EU court says EU cigarette law is valid "
    },
    {
        "content": "SYDNEY  Dec 18 A Singapore-based court has refused a challenge by Philip Morris to Australia's landmark plain packaging legislation passed in 2011  which the tobacco giant had brought under a bi-lateral trade treaty with Hong Kong  the company said.",
        "date": "12182015",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "UPDATE 1-Australia wins court challenge to tobacco plain packaging "
    },
    {
        "content": "SYDNEY  Dec 18 A Singapore-based court has refused a challenge by Philip Morris to Australia's landmark plain packaging legislation passed in 2011  which the tobacco giant had brought under a bi-lateral trade treaty with Hong Kong  the company said.",
        "date": "12182015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Australia wins court challenge to tobacco plain packaging "
    },
    {
        "content": "* Deal to allow Reynolds American to focus on U.S.   (Recasts  adds comments from Japan Tobacco  context)",
        "date": "09292015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "UPDATE 3-Japan Tobacco agrees to buy brand rights from Reynolds American for $5 bln "
    },
    {
        "content": "Sept 17 Brewer AB InBev has approached rival SABMiller regarding what would be one of the largest mergers in history.      Reuters has compiled the list below to show how a deal  if achieved  would compare with the world's biggest takeovers.                Announced  Buyer                                 Target                                  Value(excl debt)  Sector  1   Nov 1999   Mannesmann AG (Germany)               Vodafone AirTouch PLC (UK)              $180 bln          Wirel",
        "date": "09172015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "FACTBOX-Comparing an AB InBev-SABMiller merger to the biggest ever "
    },
    {
        "content": "PRAGUE  Aug 19 Philip Morris CR  recorded a 28 percent rise in first-half net profit to 1.3 billion Czech crowns ($53.20 million)  the Czech tobacco company said on Wednesday.",
        "date": "08192015",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Philip Morris CR posts 28 pct rise in H1 profit "
    },
    {
        "content": "* Philip Morris had aimed to raise at least $1 bln by cutting stake   (Adds milestones and background)",
        "date": "08132015",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "UPDATE 1-Indonesia's Sampoerna plans $1.94 bln rights issue to meet free-float rule "
    },
    {
        "content": "JAKARTA  Aug 13 Indonesian cigarette maker PT Hanjaya Mandala Sampoerna Tbk said it is planning a rights issue to raise up to 26.7 trillion rupiah ($1.94 billion) to meet the country's minimum free-float requirement.",
        "date": "08132015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Indonesia's Sampoerna says to raise up to $1.9 bln in rights issue "
    },
    {
        "content": "LONDON  July 16 Philip Morris International  and its American counterpart Altria Group  announced on Thursday an expansion of their agreement on e-cigarettes to include research and development  as the market for tobacco alternatives continues to evolve.",
        "date": "07162015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Philip Morris expands e-cigarette deal with Altria "
    },
    {
        "content": "* Swedish Match and Philip Morris Enternational to dissolve smokeless joint venture which has been selling snus in Canada  Russia  Israel and Malaysia",
        "date": "07162015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "BRIEF-Swedish Match and Philip Morris dissolve JV after slow sales "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON/MILAN  July 10 (Fitch) Fitch Ratings has revised the US-based tobacco  group Philip Morris International  Inc's (PMI) Outlook to Negative from Stable  and affirmed the Long-term Issuer Default Rating (IDR) at 'A'. The Short-term  IDR has been affirmed at 'F1'. The revision in Outlook reflects PMI's stretched credit metrics  after profit  margins and cash flow were compressed in 2014 by specific market challenges in  Asia  foreign",
        "date": "07102015",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Fitch Revises Philip Morris's Outlook to Negative; Affirms at 'A' "
    },
    {
        "content": "JAKARTA/SINGAPORE U.S. cigarette giant Philip Morris International Inc  plans to sell a stake worth at least $1 billion in Indonesian unit PT HM Sampoerna Tbk  to comply with free-float rules  two people familiar with the matter said on Monday.",
        "date": "07062015",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Philip Morris to cut stake in Indonesian unit  could raise over $1 billion "
    },
    {
        "content": "* Philip Morris eyes stake sale in unit to comply with local rules",
        "date": "07062015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "UPDATE 1-Philip Morris to cut stake in Indonesian unit  could raise over $1 bln-sources "
    },
    {
        "content": "JAKARTA  July 6 U.S. cigarette giant Philip Morris International Inc plans to sell shares worth more than $1 billion in Indonesia's PT HM Sampoerna Tbk  the Wall Street Journal reported on Monday  citing people familiar with the matter.",
        "date": "07062015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Philip Morris seeks at least $1 bln from stake sale in Indonesia unit -WSJ "
    },
    {
        "content": "PRAGUE  May 18 Czech tobacco firm Philip Morris CR posted first-quarter revenue net of excise and value-added taxes of 2.32 billion Czech crowns ($97.01 million)  down 17.2 percent on the year  it said on Monday.",
        "date": "05182015",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Czech Philip Morris Q1 revenue falls 17 pct to 2.32 bln crowns "
    },
    {
        "content": "* AGM approves CZK 880/share dividend  Further company coverage:",
        "date": "04302015",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "BRIEF-Czech Philip Morris AGM approves CZK 880/share dividend "
    },
    {
        "content": "* Dow finishes down 0.04 pct  S&P 500 down 0.08 pct Nasdaq loses 0.06 pct",
        "date": "04162015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "US STOCKS-Wall St ends slightly lower as earnings worries linger "
    },
    {
        "content": "April 16 U.S. stocks were mixed on Thursday afternoon as soaring Wall Street debuts by online retailer Etsy and trading firm Virtu offset lingering worries about upcoming corporate earnings reports.",
        "date": "04162015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "US STOCKS-Wall St mixed as Netflix surges and investors eye earnings "
    },
    {
        "content": "April 16 Philip Morris International Inc's  shares are on track for their best day in over six years after the maker of Marlboro cigarettes raised its full-year profit forecast as it sold more cigarettes at higher prices  especially in Europe.",
        "date": "04162015",
        "name": "Philip Morris International Inc",
        "news_type": "normal",
        "symbol": "PM",
        "title": "Marlboro-maker Philip Morris raises profit view on strong Europe demand "
    },
    {
        "content": "NEW YORK  Feb 25 Three major U.S. tobacco companies - R.J. Reynolds Tobacco Co  Lorillard Inc and Altria Group's Philip Morris USA - will pay $100 million to settle hundreds of federal lawsuits over smoking  according to an announcement from plaintiffs' lawyers on Wednesday.",
        "date": "02252015",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "UPDATE 1-Tobacco companies to settle smoking lawsuits for $100 million "
    },
    {
        "content": "MANILA  Jan 13 The Philippine affiliate of Philip Morris International Inc said on Tuesday it would cut 640 jobs  or nearly 13 percent of its workforce in the country  as it restructures cigarette manufacturing operations at its Marikina plant in Manila.",
        "date": "01132015",
        "name": "Philip Morris International Inc",
        "news_type": "topStory",
        "symbol": "PM",
        "title": "Philippine affiliate of Philip Morris to trim 13 pct of country's workforce "
    }
]