[
    {
        "content": "* Emerson completes Pentair Valves & Controls acquisition Source text for Eikon: Further company coverage:",
        "date": "04282017",
        "name": "Pentair plc",
        "news_type": "topStory",
        "symbol": "PNR",
        "title": "BRIEF-Emerson completes Pentair Valves & Controls acquisition "
    },
    {
        "content": "* Recommended to Tribunal that transaction be approved  with conditions  whereby Imperial Holdings intends to buy Interstate",
        "date": "11252016",
        "name": "Pentair plc",
        "news_type": "topStory",
        "symbol": "PNR",
        "title": "BRIEF-S.Africa's Competition Commission clears Emerson  Pentair deal "
    },
    {
        "content": "* Emerson announced it has signed an agreement to purchase the Valves & Controls business of Pentair for $3.15 billion  Source text for Eikon:  Further company coverage: ",
        "date": "08182016",
        "name": "Pentair plc",
        "news_type": "topStory",
        "symbol": "PNR",
        "title": "BRIEF-Emerson to purchase Valves & Controls business of Pentair for $3.15 bln "
    },
    {
        "content": "* If deal is terminated under specified antitrust related circumstances  co to pay Pentair  cash reverse termination fee - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "08182016",
        "name": "Pentair plc",
        "news_type": "normal",
        "symbol": "PNR",
        "title": "BRIEF-Emerson Electric to pay Pentair cash reverse termination fee if deal is terminated "
    },
    {
        "content": "* Pentair explores sale of valves-and-controls business; sale could fetch more than $2 billion - WSJ  citing sources  Source text - (http://on.wsj.com/22ABnce) Further company coverage:    (Bengaluru Newsroom)",
        "date": "06022016",
        "name": "Pentair plc",
        "news_type": "topStory",
        "symbol": "PNR",
        "title": "BRIEF-Pentair explores sale of valves-and-controls business - WSJ citing sources "
    },
    {
        "content": "Johnson Controls Inc   a U.S. manufacturer of car batteries and heating and ventilation equipment  is in advanced talks to buy fire protection and security company Tyco International Plc   people familiar with the matter said.",
        "date": "01252016",
        "name": "Pentair plc",
        "news_type": "normal",
        "symbol": "PNR",
        "title": "Johnson Controls in advanced talks to acquire Tyco: sources "
    },
    {
        "content": "Pump and valve maker Pentair Plc on Tuesday said it would appoint a founding partner of Trian to its board  giving the activist hedge fund a seat inside the company following its recent purchase of a 7.2 percent stake.",
        "date": "09082015",
        "name": "Pentair plc",
        "news_type": "topStory",
        "symbol": "PNR",
        "title": "Pentair to appoint board seat to activist fund Trian "
    },
    {
        "content": "Sept 8 Pump and valve maker Pentair Plc  on Tuesday said it would appoint a founding partner of Trian to its board  giving the activist hedge fund a seat inside the company following its recent purchase of a 7.2 percent stake.",
        "date": "09082015",
        "name": "Pentair plc",
        "news_type": "normal",
        "symbol": "PNR",
        "title": "UPDATE 2-Pentair to appoint board seat to activist fund Trian "
    },
    {
        "content": "Sept 8 Pump and valve maker Pentair Plc  said it would appoint Ed Garden  founding partner of hedge fund Trian Fund Management LP  to its board.",
        "date": "09082015",
        "name": "Pentair plc",
        "news_type": "normal",
        "symbol": "PNR",
        "title": "Pentair to appoint Trian's Ed Garden to board "
    },
    {
        "content": "Pump and valve maker Pentair Plc  agreed to buy fastening products maker Erico Global Co for $1.8 billion in cash  weeks after activist investor Nelson Peltz asked the company to bulk up through deals.",
        "date": "08172015",
        "name": "Pentair plc",
        "news_type": "topStory",
        "symbol": "PNR",
        "title": "Pump maker Pentair to buy Erico Global for $1.8 billion in cash "
    },
    {
        "content": "Aug 17 Pump and valve maker Pentair Plc  agreed to buy fastening products maker Erico Global Co for $1.8 billion in cash  weeks after activist investor Nelson Peltz asked the company to bulk up through deals.",
        "date": "08172015",
        "name": "Pentair plc",
        "news_type": "normal",
        "symbol": "PNR",
        "title": "UPDATE 2-Pump maker Pentair to buy Erico Global for $1.8 bln in cash "
    },
    {
        "content": "Aug 17 Pump and valve maker Pentair Plc  said it will buy privately held fastening products maker Erico Global Co for $1.8 billion in cash  including debt.",
        "date": "08172015",
        "name": "Pentair plc",
        "news_type": "normal",
        "symbol": "PNR",
        "title": "Pump maker Pentair to buy Erico Global in $1.8 bln deal "
    },
    {
        "content": "Activist shareholder Nelson Peltz reported a stake in Pentair Plc  and asked the pump and valve maker to bulk up through deals and retain key officers  rather than agitate for a spinoff or changes in management as he usually does.",
        "date": "06302015",
        "name": "Pentair plc",
        "news_type": "topStory",
        "symbol": "PNR",
        "title": "Peltz takes stake in Pentair  asks company to bulk up "
    },
    {
        "content": "* Trian takes 7.2 pct stake; is Pentair's 3rd-biggest shareholder",
        "date": "06302015",
        "name": "Pentair plc",
        "news_type": "normal",
        "symbol": "PNR",
        "title": "UPDATE 2-Peltz takes stake in Pentair  asks company to bulk up "
    },
    {
        "content": "June 30 Nelson Peltz's Trian Fund Management LP has built a stake of 7.24 percent in Pentair Plc and asked the pump and valve maker to consider acquiring rivals to consolidate the sector  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06302015",
        "name": "Pentair plc",
        "news_type": "normal",
        "symbol": "PNR",
        "title": "Peltz's Trian Fund Management builds up 7.24 pct stake in Pentair - WSJ "
    }
]