[
    {
        "content": "* Agrium and PotashCorp announce receipt of regulatory approval in China",
        "date": "11072017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Agrium and PotashCorp receive regulatory approval in China "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 7 Canadian fertilizer producer and farm supplier Agrium Inc said on Tuesday it will sell its Idaho phosphate production facility for $100 million to fertilizer company Itafos  to address concerns of U.S. regulators about its merger with Potash Corp of Saskatchewan.",
        "date": "11072017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Agrium sells U.S. plants to ease Potash Corp merger concerns "
    },
    {
        "content": "BEIJING  Nov 7 China's commerce ministry said on Tuesday it has granted conditional regulatory approval to the proposed $25 billion merger between fertiliser companies Agrium Inc and Potash Corp of Saskatchewan Inc.",
        "date": "11072017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "China commerce ministry conditionally approves Potash-Agrium merger "
    },
    {
        "content": "* Sinochem says has had no intention to make bid for SQM stake",
        "date": "10242017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-China's Sinochem says no plans to bid for stake in Chilean lithium producer SQM "
    },
    {
        "content": "* SAYS POTASHCORP ANNOUNCES ITS PLAN TO MERGE WITH CANADIAN FERTILIZER COMPANY AGRIUM",
        "date": "10222017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Arab Potash says PotashCorp plans to merge with Agrium "
    },
    {
        "content": "Potential buyers have shown big interest in Potash Corp of Saskatchewan Inc's 32 percent stake in Chilean lithium producer SQM SA   Potash's chief executive said on Thursday  after reporting a lower than expected third-quarter profit.",
        "date": "10262017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Buyers circle Potash Corp stake in lithium producer SQM "
    },
    {
        "content": "Oct 26 Potential buyers have shown big interest in Potash Corp of Saskatchewan Inc's 32 percent stake in Chilean lithium producer SQM SA  Potash's chief executive said on Thursday  after reporting a lower than expected third-quarter profit. Canada's Potash  set to merge with rival Agrium Inc  must divest minority stakes in SQM and fertilizer companies ICL Israel Chemicals and Arab Potash Co PLC within 18 months as a condition of India's approval for the $25-billion deal.",
        "date": "10262017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 4-Buyers circle Potash Corp stake in lithium producer SQM "
    },
    {
        "content": "* Agrium and Potashcorp announce receipt of regulatory approval in India",
        "date": "10182017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Agrium and Potashcorp receive regulatory approval in India "
    },
    {
        "content": "* Potash Corp reports third-quarter earnings of $0.06 per share",
        "date": "10262017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potashcorp reports Q3 earnings per share $0.06 "
    },
    {
        "content": "Oct 26 Potash Corp of Saskatchewan   the world's biggest fertilizer company by capacity  on Thursday reported a 34.6 percent decline in quarterly profit as cost of goods rose.",
        "date": "10262017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp third-quarter profit falls "
    },
    {
        "content": "Sept 20 Potash Corp of Saskatchewan said on Wednesday it would curtail production temporarily at two Canadian mines  as part of a longstanding strategy to match supply to demand.",
        "date": "09202017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash Corp to temporarily reduce Canada potash production "
    },
    {
        "content": "SANTIAGO  Sept 23 Potash Corporation Of Saskatchewan Inc has hired Goldman Sachs and BofA Merrill Lynch to explore selling its 32 percent stake in Chile's Sociedad Quimica Y Minera (SQM)  Chilean paper La Tercera reported on Saturday.",
        "date": "09232017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-Potash Corp hires banks to explore sale of SQM stake - paper "
    },
    {
        "content": "SANTIAGO Potash Corporation Of Saskatchewan Inc has hired Goldman Sachs and BofA Merrill Lynch to explore selling its 32 percent stake in Chile's Sociedad Quimica Y Minera (SQM)   Chilean paper La Tercera reported on Saturday.",
        "date": "09232017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp hires banks to explore sale of SQM stake: La Tercera "
    },
    {
        "content": "SANTIAGO  Sept 23 Potash Corporation Of Saskatchewan Inc has hired Goldman Sachs and BofA Merrill Lynch to explore selling its 32 percent stake in Chile's Sociedad Quimica Y Minera (SQM)  Chilean paper La Tercera reported on Saturday.",
        "date": "09232017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp hires banks to explore sale of SQM stake - La Tercera "
    },
    {
        "content": "TORONTO  Sept 12 Canada's main stock index rose on Tuesday  helped by financial sector gains and moves higher in shares of Agrium Inc and Potash Corp of Saskatchewan after a competition watchdog gave their planned merger a green light.",
        "date": "09122017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "CANADA STOCKS-TSX rises with financials  Agrium-Potash Corp deal OK "
    },
    {
        "content": "* Agrium and Potashcorp receive unconditional Canadian regulatory clearance for merger",
        "date": "09112017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Agrium and Potashcorp receive Canadian regulatory clearance for merger "
    },
    {
        "content": "Fertilizer companies Agrium Inc and Potash Corp of Saskatchewan Inc said on Thursday they were told by regulators in India and China that they need to divest Potash's offshore interests for their merger to be approved.",
        "date": "09072017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "India  China regulators ask Potash to sell stake for merger with Agrium "
    },
    {
        "content": "OTTAWA  Sept 11 Canada's competition watchdog said on Monday it will not challenge a proposed merger between Agrium Inc and Potash Corp  saying the transaction was unlikely to substantially lessen competition in the fertilizer industry.",
        "date": "09112017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Canada competition watchdog will not challenge Agrium  Potash merger "
    },
    {
        "content": "Sept 7 Fertilizer companies Agrium Inc and Potash Corp of Saskatchewan Inc said on Thursday they were told by regulators in India and China that they need to divest Potash's offshore interests for their merger to be approved.",
        "date": "09072017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 1-India  China regulators ask Potash to sell stake for merger with Agrium "
    },
    {
        "content": "Sept 7 Fertilizer companies Agrium Inc and Potash Corp of Saskatchewan Inc said on Thursday they were notified by regulators in India and China to divest Potash's offshore interests for their merger approval.",
        "date": "09072017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CORRECTED-India  China regulators ask Potash to sell stake for Agrium merger "
    },
    {
        "content": "* Agrium and Potashcorp provide update for proposed merger of equals",
        "date": "09072017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Agrium and Potashcorp provide update for proposed merger of equals "
    },
    {
        "content": "* Q2 earnings per share view $0.23 -- Thomson Reuters I/B/E/S",
        "date": "08012017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Mosaic Q2 sales $1.8 billion versus $1.7 billion "
    },
    {
        "content": "July 27 Potash Corporation Of Saskatchewan Inc CEO Jochen Tilk  speaking on a conference call  said:",
        "date": "07272017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp of Saskatchewan not planning potash output cuts-CEO "
    },
    {
        "content": "TORONTO  July 27 Canada's main stock index gained on Thursday as major gold miner Barrick Gold Corp and a string of other companies reported better-than-expected earnings and oil producer Cenovus Energy Inc turned a profit.",
        "date": "07272017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CANADA STOCKS-TSX rises as Barrick earnings soar  Cenovus turns profit "
    },
    {
        "content": "July 27 Canada's Potash Corp of Saskatchewan reported bigger-than-expected revenue on Thursday as it sold more potash at higher prices compared with a year earlier  marking a slow recovery in the oversupplied market.",
        "date": "07272017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 2-Fertilizer maker Potash Corp beats revenue expectations "
    },
    {
        "content": "July 27 Canada's Potash Corp of Saskatchewan reported better-than-expected revenue on Thursday as it sold more potash at higher prices compared with last year.",
        "date": "07272017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CORRECTED-UPDATE 1-Potash Corp's Q2 revenue beats as potash sales rise "
    },
    {
        "content": "* PotashCorp reports second-quarter earnings of $0.24 per share",
        "date": "07272017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-PotashCorp Q2 earnings per share $0.24 "
    },
    {
        "content": "July 27 Canada's Potash Corp of Saskatchewan reported a 66 percent surge in quarterly profit on Thursday as it sold higher volumes of potash at better prices compared with last year.",
        "date": "07272017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp's Q2 profit jumps 66 pct as potash sales rise "
    },
    {
        "content": "WINNIPEG  Manitoba  July 21 Canpotex Ltd  the offshore sales agency for North America's biggest producers of potash fertilizer  said on Friday that it signed supply contracts with Chinese customers for shipments of 1.4 million tonnes through 2017.",
        "date": "07212017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Canpotex signs China potash supply contracts at higher price "
    },
    {
        "content": "TORONTO  July 10 Canada's main stock index rose on Monday  reversing early losses as key sectors including materials and energy rebounded.",
        "date": "07102017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CANADA STOCKS-TSX edges higher on materials  energy; Home Capital falls "
    },
    {
        "content": "JERUSALEM  July 2 Potash and fertiliser producer Israel Chemicals (ICL)  said on Sunday it cannot estimate the level of damage caused to the company or the environment by a spill at its fertiliser plant in Israel's Negev desert.",
        "date": "07022017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "ICL says level of damage caused by desert spill still unknown "
    },
    {
        "content": "JERUSALEM  July 2 Potash and fertiliser producer Israel Chemicals (ICL)  said on Sunday it cannot estimate the level of damage caused to the company or the environment by a spill at its  fertiliser plant in Israel's Negev desert.",
        "date": "07022017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 1-ICL says level of damage caused by desert spill still unknown "
    },
    {
        "content": "WINNIPEG  Manitoba  June 21 Canadian fertilizer producers Agrium Inc and Potash Corp of Saskatchewan Inc  which are seeking regulator approval to merge  said on Wednesday that the combined company would be called Nutrien.",
        "date": "06212017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Agrium-Potash merged company to be called Nutrien "
    },
    {
        "content": "* Upon closure of the merger transaction  Agrium and Potashcorp will become nutrien",
        "date": "06212017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Agrium and Potash Corp will become Nutrien  upon closure of merger transaction "
    },
    {
        "content": "NEW YORK Governance changes at Chile lithium producer SQM  which give shareholder Potash Corp of Saskatchewan greater influence  do not reflect any intent by Potash to raise its stake  Potash Corp's chief executive said on Thursday.",
        "date": "05182017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "SQM governance changes no signal of Potash Corp interest in bigger stake: CEO "
    },
    {
        "content": "NEW YORK  May 18 Governance changes at Chile lithium producer SQM  which give shareholder Potash Corp of Saskatchewan greater influence  do not reflect any intent by Potash to raise its stake  Potash Corp's chief executive said on Thursday.",
        "date": "05182017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 1-SQM governance changes no signal of Potash Corp interest in bigger stake-CEO "
    },
    {
        "content": "NEW YORK  May 18 Governance changes at Chile lithium producer SQM  which give shareholder Potash Corp of Saskatchewan greater influence  do not reflect any intent by Potash to raise its stake  Potash Corp's chief executive said on Thursday.",
        "date": "05182017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash CEO says SQM governance changes no signal of Potash interest in raising stake-CEO "
    },
    {
        "content": "NEW YORK BHP Billiton Ltd's   Canadian potash mine will use advanced  cost-saving technology  giving it a competitive edge in a currently over-supplied fertilizer market  the executive in charge of the business said on Thursday.",
        "date": "05182017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BHP stays course on Canada potash mine few expected built "
    },
    {
        "content": "* Potash Corporation Of Saskatchewan Inc declares quarterly dividend",
        "date": "05102017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp declares quarterly dividend "
    },
    {
        "content": "KASSEL  Germany German potash and salt miner K+S  is looking at ways to boost the value of its salt unit under a wider strategic review  Chief Financial Officer Burkhard Lohr said on Wednesday.",
        "date": "05102017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S aims to boost salt unit's value in strategic review "
    },
    {
        "content": "AMMAN  May 1 Jordan's Arab Potash Company (APC) said net profit for the first quarter rose 12 percent to 26.3 million dinars ($37 million) after it agreed annual contracts with China and India.",
        "date": "05012017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Jordan's Arab Potash Company reports 12 pct rise in quarterly profit "
    },
    {
        "content": "April 27 Canada's Potash Corp of Saskatchewan reported a bigger-than-expected rise in quarterly profit on Thursday and raised its full-year outlook  citing lower costs and increased sales volumes.",
        "date": "04272017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 2-Potash Corp raises outlook  notches higher profit as sales climb "
    },
    {
        "content": "April 27 Potash Corp of Saskatchewan's quarterly profit nearly doubled as lower costs and increased potash sales volumes more than offset weak phosphate prices.",
        "date": "04272017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp's profit nearly doubles on fall in costs "
    },
    {
        "content": "SANTIAGO  April 18 Three top shareholders in Chile's SQM have agreed to change the way board decisions are made at the global supplier of lithium  they said  a move that will see controlling shareholder Julio Ponce cede some power and Canada's Potash Corp gain more say.",
        "date": "04182017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Shareholders in Chilean lithium firm SQM shake up governance "
    },
    {
        "content": "* Gensource Potash Corp - co has executed shareholder agreement  with Essel Group Me Limited to create a joint venture company  Vanguard Potash Corp",
        "date": "04052017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Gensource Potash to create joint venture company - Vanguard Potash with Essel "
    },
    {
        "content": "MUMBAI Indian fertilizer companies will soon raise potash prices after the government last week cut subsidies by 20 percent for the current financial year  officials said.",
        "date": "04042017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Indian fertilizer companies to raise potash prices after subsidy cut "
    },
    {
        "content": "* Companies plan to raise prices for farmers  could hit demand",
        "date": "04042017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Indian fertiliser companies to raise potash prices after subsidy cut "
    },
    {
        "content": "NEW DELHI  March 29 India's competition regulator said the proposed merger between Agrium Inc and Potash Corp of Saskatchewan Inc  was likely to hurt competition  a government statement said on Wednesday.",
        "date": "03292017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Indian regulator says Agrium-Potash merger likely to hurt competition "
    },
    {
        "content": "NEW DELHI/WINNIPEG  March 29 India's competition regulator said the proposed merger of fertilizer producers Agrium Inc and Potash Corp of Saskatchewan Inc is likely to hurt competition  but the comments were not expected to prevent the merger.",
        "date": "03292017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 1-Indian regulator says Agrium-Potash merger likely to hurt competition "
    },
    {
        "content": "March 1 Potash Corporation Of Saskatchewan Inc  CEO Jochen Tilk  speaking at an investor presentation in Florida:",
        "date": "03012017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp sees third-quarter closing of Agrium merger "
    },
    {
        "content": "* Potash Corporation of Saskatchewan Inc declares quarterly dividend",
        "date": "01252017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Corporation of Saskatchewan declares quarterly dividend "
    },
    {
        "content": "Jan 26 The deepest slump in a decade for the oversupplied potash fertilizer market may abate only slightly in 2017  major producers say  and could take years to correct due to the imminent startup of new mines.",
        "date": "01262017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 4-Potash slump drags on as competition overheats "
    },
    {
        "content": "TORONTO  Jan 26 Canada's main stock index edged lower on Thursday but stayed close to its all-time high as a retreat among materials stocks weighed and investors reacted to a string of earnings reports.",
        "date": "01262017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CANADA STOCKS-TSX edges lower as materials stocks weigh  earnings in focus "
    },
    {
        "content": "* Q4 nitrogen sales volume 1.6 million tonnes versus 1.6 million tonnes in Q3",
        "date": "01262017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp posts Q4 earnings of $0.07 per share "
    },
    {
        "content": "Jan 26 Potash Corp of Saskatchewan Inc   reported a 70.7 percent drop in fourth-quarter profit on Thursday  hurt by weaker prices for crop nutrients.",
        "date": "01262017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Canada's Potash Corp posts 70.7 pct drop in Q4 profit "
    },
    {
        "content": "* Centerboard Group Portfolio Company  Signor Lodging  acquires 1 056 room lodging facility from Potash Corporation of Saskatchewan",
        "date": "01122017",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Signor Lodging acquires 1 056 room lodging facility from Potash Corp "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 23 Fertilizer maker Potash Corp of Saskatchewan Inc said on Wednesday that it was reducing jobs and output at one Canadian mine and temporarily curtailing production at two others as the sector struggles with weak prices.",
        "date": "11232016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 2-Potash Corp cuts jobs  Canadian potash output as prices sag "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 23 Potash Corp of Saskatchewan Inc  the world's biggest fertilizer maker by capacity  said on Wednesday that it was reducing output at one Canadian mine and temporarily curtailing production at two others  as the sector struggles with weak prices.",
        "date": "11232016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp cuts jobs  Canadian potash output as prices sag "
    },
    {
        "content": "* Potash Corporation of Saskatchewan Inc. declares quarterly dividend  Source text for Eikon:  Further company coverage:",
        "date": "11172016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp says sets quarterly dividend of $0.10 per share "
    },
    {
        "content": "* Agrium and Potashcorp provide update on approvals for proposed merger of equals",
        "date": "11072016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Agrium  Potashcorp provide update on approvals for proposed merger "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 4 Moody's Investor Service on Friday downgraded the credit rating of Potash Corp of Saskatchewan   citing concerns of a longer-than-expected fertilizer slump  ahead of the company's planned merger with rival Agrium Inc.",
        "date": "11042016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-Moody's downgrades Potash Corp as fertilizer slump lingers "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 4 Moody's Investor Service on Friday downgraded the credit rating of Potash Corp of Saskatchewan   due to concerns of a longer-than-expected fertilizer slump  ahead of the company's planned merger with rival Agrium Inc.",
        "date": "11042016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Moody's downgrades Potash Corp as fertilizer slump lingers "
    },
    {
        "content": "* Agrium Inc - Approximately 98 percent of shares and voting options voted at meeting were voted in favour of merger",
        "date": "11032016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Agrium securityholders overwhelmingly approve merger of equals with Potashcorp "
    },
    {
        "content": "* Potash Corporation of Saskatchewan Inc - More than 99 percent of shares voted at meeting were voted in favor of merger",
        "date": "11032016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potashcorp shareholders overwhelmingly approve merger of equals with Agrium "
    },
    {
        "content": "CALGARY  Alberta/WINNIPEG  Manitoba  Nov 3 (Reuters) - S hareholders of Agrium Inc and Potash Corp of Saskatchewan Inc overwhelmingly approved an all-stock merger of the fertilizer producers on Thursday.",
        "date": "11032016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Agrium  Potash Corp investors back merger of fertilizer companies "
    },
    {
        "content": "CALGARY  Alberta/WINNIPEG  Manitoba  Nov 3 (Reuters) - S hareholders of Agrium Inc and Potash Corp of Saskatchewan Inc overwhelmingly approved an all-stock merger of the fertilizer producers on Thursday  shifting the focus to U.S. and Canadian regulators.",
        "date": "11032016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 2-Agrium  Potash Corp investors back merger of fertilizer companies "
    },
    {
        "content": "Nov 3 Agrium Inc CEO Chuck Magro  speaking on a conference call said:",
        "date": "11032016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Agrium expects overwhelming investor support for Potash merger "
    },
    {
        "content": "Oct 27 Potash Corporation Of Saskatchewan Inc  Chief Executive Jochen Tilk  speaking on a conference call:",
        "date": "10272016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp of Saskatchewan to ramp up Rocanville mine by mid-year "
    },
    {
        "content": "TORONTO/WINNIPEG Shareholders of Agrium Inc  and Potash Corp of Saskatchewan Inc  are set to overwhelmingly approve a merger of the two Canadian fertilizer producers  according to a source familiar with the situation  despite initial skepticism from Agrium investors.",
        "date": "10272016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Agrium-Potash merger set for shareholder approval -source "
    },
    {
        "content": "Investor advisory company Glass Lewis said on Thursday it recommended that Agrium Inc  and Potash Corp of Saskatchewan Inc  shareholders support a proposed merger  saying it would create a bigger  more diversified company.",
        "date": "10202016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Glass Lewis recommends Agrium  Potash investors back merger "
    },
    {
        "content": "TORONTO/WINNIPEG  Oct 27 Shareholders of Agrium Inc and Potash Corp of Saskatchewan Inc are set to overwhelmingly approve a merger of the two Canadian fertilizer producers  according to a source familiar with the situation  despite initial skepticism from Agrium investors.",
        "date": "10272016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "WRAPUP 1-Agrium-Potash merger set for shareholder approval -source "
    },
    {
        "content": "Oct 20 Investor advisory company Glass Lewis said on Thursday it recommended that Agrium Inc and Potash Corp of Saskatchewan Inc shareholders support a proposed merger  saying it would create a bigger  more diversified company.",
        "date": "10202016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 1-Glass Lewis recommends Agrium  Potash investors back merger "
    },
    {
        "content": "TORONTO/WINNIPEG  Oct 27 The shareholders of Agrium Inc and Potash Corp of Saskatchewan Inc  are set to overwhelmingly approve a merger of the two Canadian fertilizer producers  according to a source familiar with the situation  despite initial skepticism from Agrium investors.",
        "date": "10272016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 1-Agrium-Potash merger set for shareholder approval - source "
    },
    {
        "content": "TORONTO/WINNIPEG  Oct 27 The shareholders of Agrium Inc and Potash Corp of Saskatchewan Inc  are set to overwhelmingly approve a merger of the two Canadian fertilizer producers  according to a source familiar with the situation  despite initial skepticism from Agrium investors.",
        "date": "10272016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Agrium-Potash merger set for shareholder approval - source "
    },
    {
        "content": "Oct 27 Potash Corp of Saskatchewan    the world's biggest fertilizer company by capacity  said early votes by shareholders supported a proposed merger with rival Agrium Inc as it posted a smaller-than-expected drop in quarterly profit.",
        "date": "10272016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 2-Potash Corp sees merger support; profit drops less than expected "
    },
    {
        "content": "Oct 20 Investor advisory company Glass Lewis said on Thursday that it recommended Agrium Inc  shareholders support a proposed merger with Potash Corp of Saskatchewan  saying that it would create a bigger  more diversified company.",
        "date": "10202016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Glass Lewis recommends Agrium investors back Potash Corp merger "
    },
    {
        "content": "* Potashcorp reports third-quarter earnings of $0.10 per share  Source text for Eikon:  Further company coverage:",
        "date": "10272016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potashcorp reports Q3 earnings of $0.10 per share "
    },
    {
        "content": "Oct 27 Potash Corp of Saskatchewan    the world's biggest fertilizer company by capacity  reported a 25.7 percent drop in quarterly sales  as potash prices remained weak.",
        "date": "10272016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp Q3 sales fall about 26 pct "
    },
    {
        "content": "Oct 17 Investor advisory company Institutional Shareholder Services (ISS) has recommended that investors in fertilizer producers Agrium Inc and Potash Corp of Saskatchewan support a merger of the companies.",
        "date": "10172016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-ISS recommends investors back Agrium-Potash Corp merger "
    },
    {
        "content": "Oct 17 Investor advisory company Institutional Shareholder Services (ISS) has recommended that investors in fertilizer producers Agrium Inc and Potash Corp of Saskatchewan support a merger of the companies.",
        "date": "10172016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "ISS recommends investors back Agrium-Potash Corp merger "
    },
    {
        "content": "Oct 6 Agrium Inc and Potash Corp of Saskatchewan shareholders will hold separate meetings next month to vote on a merger agreement between the two fertilizer companies  they said in a filing on Thursday.",
        "date": "10062016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Agrium  Potash to hold shareholder votes on merger next month "
    },
    {
        "content": "BRUSSELS  Sept 26 China National Chemical Corp (ChemChina) has sought antitrust approval for its $43 billion bid for Swiss pesticides and seeds group Syngenta  from the European Union and a decision is expected by Oct. 28.",
        "date": "09262016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "ChemChina seeks EU okay for Syngenta deal  decision due Oct. 28 "
    },
    {
        "content": "Plunging crop and fertilizer prices may not have hit rock bottom yet  and the market's weakness makes it the right time to merge leading farm input suppliers  the chief executive officer of Agrium Inc said on Tuesday  making his pitch to skeptical investors for a $26 billion union with Potash Corp of Saskatchewan Inc.",
        "date": "09212016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Tough farm conditions right time for Potash merger: Agrium CEO "
    },
    {
        "content": "Sept 20 Plunging crop and fertilizer prices may not have hit rock bottom yet  and the market's weakness makes it the right time to merge leading farm input suppliers  the chief executive officer of Agrium Inc said on Tuesday  making his pitch to skeptical investors for a $26 billion union with Potash Corp of Saskatchewan Inc.",
        "date": "09202016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Tough farm conditions right time for Potash merger -Agrium CEO "
    },
    {
        "content": "Sept 20 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday",
        "date": "09202016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Sept 20 Potash Corp  Agrium CEOs  speaking at Scotiabank investor conference in Toronto:",
        "date": "09202016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp  Agrium merger could accelerate retail expansion "
    },
    {
        "content": "JERUSALEM  Sept 11 Stefan Borgas stepping down as chief executive is the latest in a series of issues that have plagued Israel Chemicals (ICL)  and the company's fortunes are not expected to turn around in the foreseeable future given very low potash prices.",
        "date": "09112016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Israel Chemicals faces tough road to recovery after CEO steps down "
    },
    {
        "content": "* Based on the Aug 29  market caps of both Potash and Agrium  combined co will have $26 billion market cap - conf call",
        "date": "09122016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Agrium says new co will have low-cost capacity of about 22 mln tonnes "
    },
    {
        "content": "* Moody's places Agrium under review for upgrade following merger announcement with Potash Corp",
        "date": "09132016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Moody's places Agrium under review for upgrade following merger announcement with Potash "
    },
    {
        "content": "TORONTO  Sept 12 Canada's main stock index fell early on Monday  as investors bet that global central bank enthusiasm for monetary stimulus may be waning and oil prices dipped  while Potash Corp and Agrium Inc both gained after agreeing to merge.",
        "date": "09122016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CANADA STOCKS-TSX falls with oil  global sentiment; Potash and Agrium gain "
    },
    {
        "content": "* Moody's places Potash Corp under review for downgrade following merger announcement",
        "date": "09132016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Moody's places Potash Corp under review for downgrade following merger announcement "
    },
    {
        "content": "* Agrium and PotashCorp to combine in merger of equals to create a world-Class integrated global supplier of crop inputs",
        "date": "09122016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Agrium and PotashCorp to combine in merger of equals "
    },
    {
        "content": "* Paine & Partners appoints David Delaney as strategic advisor  Source text for Eikon:  Further company coverage:",
        "date": "09062016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Paine & Partners appoints David Delaney as strategic advisor "
    },
    {
        "content": "Sept 12 Canada's Agrium Inc and Potash Corp of Saskatchewan Inc said on Monday they would combine to create a fertilizer and farm retailing giant with proforma enterprise value of $36 billion.",
        "date": "09122016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Agrium and Potash Corp to merge "
    },
    {
        "content": "* Agrium confirms discussions with PotashCorp regarding potential merger of equals",
        "date": "08302016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Agrium confirms talks with Potash Corp for potential merger of equals "
    },
    {
        "content": "Sept 1 Stock futures pointed to a higher opening for Canada's main stock index on Thursday as oil prices steadied on hopes that producers were moving towards a common ground on a potential output freeze.",
        "date": "09012016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CANADA STOCKS-Futures rise as oil steadies "
    },
    {
        "content": "Aug 30 Canadian fertilizer companies Agrium Inc  and Potash Corp of Saskatchewan Inc are in talks to merge  Bloomberg reported  citing people familiar with the matter.",
        "date": "08302016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Agrium  Potash Corp in merger talks- Bloomberg "
    },
    {
        "content": "* Potash Corp  Agrium Inc planning to merge; combination could be announced as soon as next week - Bloomberg  citing sources  Source text : http://bloom.bg/2bzbR1O",
        "date": "08302016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp  Agrium planning to merge - Bloomberg "
    },
    {
        "content": "Potash Corp of Saskatchewan    the world's biggest fertilizer company by capacity  cut its full-year profit forecast and dividend for the second time this year on Thursday  and said that potash markets had bottomed out.",
        "date": "07282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash Corp cuts dividend  profit forecast again; shares fall "
    },
    {
        "content": "July 28 Potash Corp of Saskatchewan    the world's biggest fertilizer company by capacity  cut its full-year profit forecast and dividend for the second time this year on Thursday  and said that potash markets had bottomed out.",
        "date": "07282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 3-Potash Corp cuts dividend  profit forecast again; shares fall "
    },
    {
        "content": "July 28 Potash Corporation Of Saskatchewan Inc  CEO Jochen Tilk  speaking on a conference call:",
        "date": "07282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp of Saskatchewan considering further mine shut-ins "
    },
    {
        "content": "July 28 Canada's Potash Corp of Saskatchewan    the world's biggest fertilizer company by capacity  cut its full-year profit forecast for the second time as potash prices remained weak.",
        "date": "07282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp cuts full-year profit forecast again "
    },
    {
        "content": "* engages Snc-Lavalin to construct valleyfield project  Source text for Eikon:  Further company coverage:    )",
        "date": "07052016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Ridge engages SNC-Lavalin to construct valleyfield project "
    },
    {
        "content": "July 1 A U.S. grand jury has charged a Spanish investor with lying to regulators probing insider trading ahead of an August 2010 hostile bid for Potash Corp of Saskatchewan Inc  even though he had been cleared of charges over his own trading.",
        "date": "07012016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "U.S. charges Spanish man with lying in Potash insider trading probe "
    },
    {
        "content": "WINNIPEG  Manitoba Shares of Potash Corp of Saskatchewan jumped as much as 6.5 percent on Thursday after a financial news website reported a rumor that the Canadian fertilizer company had received an unsolicited takeover offer.",
        "date": "06302016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash Corp shares briefly jump after takeover rumor "
    },
    {
        "content": "* Says files for debt shelf with U.S. SEC; size undisclosed - SEC filing  Source text for Eikon: (http://1.usa.gov/29bEm8N) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06292016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp of Saskatchewan files for debt shelf; size undisclosed "
    },
    {
        "content": "* Shares down 10 pct   (Adds details on Potash takeover approach  shares  previous forecast)",
        "date": "06272016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 2-K+S Q2 profit slumps on lower potash prices "
    },
    {
        "content": "* Potash Corp of Saskatchewan CEO Jochen Tilk says China potash contract will be finalized in a couple of weeks",
        "date": "05192016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp of Saskatchewan CEO says dividend sustainable "
    },
    {
        "content": "NEW YORK Agrium Inc    North America's biggest retail seller of products for farming  sees ample opportunities to buy and build more stores in the United States and looks to claim a quarter of the market  its chief executive said on Thursday.",
        "date": "05192016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Agrium eyes one-quarter share of U.S. farm retail sector "
    },
    {
        "content": "* PotashCorp recommends shareholders reject TRC Capital's \"Mini tender\" offer",
        "date": "05132016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-PotashCorp says recommends shareholders reject TRC Capital's \"mini-tender\" offer "
    },
    {
        "content": "* Potash corporation of saskatchewan inc. Declares quarterly dividend  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "05112016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Corporation Of Saskatchewan sets qtrly dividend "
    },
    {
        "content": "KASSEL  Germany  May 11 German potash miner K+S   which last year fended off a takeover approach by larger rival Potash Corp  is ready to increase its capital to make it easier for a potential anchor investor to take a stake  its chief executive said.",
        "date": "05112016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S says capital increase could be used to lure anchor investor "
    },
    {
        "content": "NAIROBI  May 3 Australia mining group Danakali Ltd has applied to Eritrea for a mining licence for its Colluli Potash Project  which is expected to start production in 2019  the company's chief executive said.",
        "date": "05032016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Australian company seeks potash mining licence in Eritrea "
    },
    {
        "content": "* Shares drop 3 percent   (Adds CEO comments on dividend  phosphate  Europe)",
        "date": "04282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 4-Potash Corp cuts 2016 profit forecast  dividend seen at risk "
    },
    {
        "content": "* CEO Jochen Tilk said in an interview that the company is not actively looking to sell its phosphate business  Further company coverage:    (Reporting By Rod Nickel)",
        "date": "04282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp of Saskatchewan not considering selling phosphate business -CEO "
    },
    {
        "content": "April 28 Potash Corp of Saskatchewan is monitoring its dividend payout  but sees an adjustment as premature",
        "date": "04282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp of Saskatchewan CEO says dividend change premature "
    },
    {
        "content": "Canada's Potash Corp of Saskatchewan   the world's biggest fertilizer company by capacity  cut its full-year profit forecast due to weak demand and lower prices on Thursday  raising concerns of another dividend cut.",
        "date": "04282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp cuts 2016 profit forecast  dividend seen at risk "
    },
    {
        "content": "* Q1 earnings per share view $0.16 -- Thomson Reuters I/B/E/S",
        "date": "04282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-PotashCorp Q1 earnings per share $0.09 "
    },
    {
        "content": "April 28 Potash Corp of Saskatchewan    the world's biggest fertilizer company by capacity  reported a 79.7 percent fall in first-quarter profit  hurt by weak potash prices.",
        "date": "04282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp profit plunges due to weak crop nutrient prices "
    },
    {
        "content": "WINNIPEG  Manitoba  Feb 25 Potash Corp of Saskatchewan Inc said on Thursday that it will curtail production at two Canadian mines for four weeks  as excessive supplies pressure prices.",
        "date": "02252016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash Corp to curb production for 4 weeks at 2 Canada mines "
    },
    {
        "content": "TORONTO  Feb 1 Tanking fertilizer prices have worsened the economic and budget outlook for the Canadian province of Saskatchewan  where the oil shock has already stalled growth  pushed the government into deficit and caused its bonds to underperform.",
        "date": "02012016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash woes worsen Saskatchewan growth  debt outlook "
    },
    {
        "content": "Jan 28 Potash Corp of Saskatchewan   forecast its bleakest year in a decade and slashed its dividend  due to tanking fertilizer prices.",
        "date": "01282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 3-Potash Corp forecasts bleak year ahead  slashes dividend "
    },
    {
        "content": "Jan 28 Potash Corp of Saskatchewan   reported a fourth-quarter profit that halved  hurt by weaker fertilizer prices.",
        "date": "01282016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp's quarterly profit halves on weaker fertilizer prices "
    },
    {
        "content": "The suspension of production at an eastern Canadian mine may lead Potash Corp of Saskatchewan Inc to shelve plans to build a new West Coast shipping terminal with partners Mosaic Co and Agrium Inc  Potash Chief Executive Jochen Tilk said on Thursday.",
        "date": "01212016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash Corp mine closure may shelve Canpotex port plans: CEO "
    },
    {
        "content": "Jan 21 The suspension of production at an eastern Canadian mine may lead Potash Corp of Saskatchewan Inc   to shelve plans to build a new West Coast shipping terminal with partners Mosaic Co and Agrium Inc   Potash Chief Executive Jochen Tilk said on Thursday.",
        "date": "01212016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 1-Potash Corp mine closure may shelve Canpotex port plans -CEO "
    },
    {
        "content": "Weak conditions in the potash market will not improve any time soon  the chief executive of Potash Corp of Saskatchewan  said on Tuesday as the crop nutrient company announced it would suspend operations \"indefinitely\" at a Canadian mine.",
        "date": "01192016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash Corp shuts Canadian mine  sees weak market continuing "
    },
    {
        "content": "Jan 21 Potash Corp of Saskatchewan's   decision this week to suspend production at an Eastern Canadian mine may lead to it shelving plans to build a new West Coast shipping terminal with partners Mosaic Co and Agrium Inc  Potash Chief Executive Jochen Tilk said on Thursday.",
        "date": "01212016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp mine closure may lead to shelving Canpotex port plans -CEO "
    },
    {
        "content": "Jan 19 Weak conditions in the potash market will not improve any time soon  the chief executive of Potash Corp of Saskatchewan said on Tuesday as the crop nutrient company announced it would suspend operations \"indefinitely\" at a Canadian mine.",
        "date": "01192016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 2-Potash Corp shuts Canadian mine  sees weak market continuing "
    },
    {
        "content": "Jan 19 Potash Corp of Saskatchewan said it would \"indefinitely\" suspend potash mining at Picadilly  New Brunswick in Canada in response to weakening demand for the crop nutrient.",
        "date": "01192016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp to suspend operations at a Canadian mine "
    },
    {
        "content": "Jan 21 Potash Corp of Saskatchewan board will discuss dividend next week",
        "date": "01212016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp board to discuss dividend next week -CEO "
    },
    {
        "content": "Jan 15 Potash Corp of Saskatchewan's   chief operating officer  David Delaney  will retire Jan. 31  the fertilizer producer said on Friday.",
        "date": "01152016",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "MOVES-Potash Corp of Saskatchewan COO to retire Jan. 31 "
    },
    {
        "content": "Dec 9 A Canadian court has fined fertilizer producer Potash Corp of Saskatchewan after falling earth killed a worker in its Cory  Saskatchewan  potash mine.",
        "date": "12092015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Canadian court fines Potash Corp in mine worker's death "
    },
    {
        "content": "Dec 2 A recent report that Potash Corp of Saskatchewan is preparing a new takeover bid for German potash producer K+S AG is an unfounded rumor  Chief Executive Officer Jochen Tilk said on Wednesday.",
        "date": "12022015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-Potash Corp position on German company K+S unchanged - CEO "
    },
    {
        "content": "Dec 2 A recent report that Potash Corp of Saskatchewan is preparing a new takeover bid for German potash producer K+S AG is an unfounded rumor  Chief Executive Officer Jochen Tilk said on Wednesday.",
        "date": "12022015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp position on German company K+S unchanged - CEO "
    },
    {
        "content": "Dec 2 Potash Corp Of Saskatchewan Looking At Reducing Dividend And Buying Back Stock",
        "date": "12022015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp of Saskatchewan CEO says bid for K+S just rumor "
    },
    {
        "content": "FRANKFURT  Nov 24    **Potash Corp is preparing a fresh takeover approach for German rival K+S  which could likely come in spring next year  German investor newsletter Platow Brief reports on Tuesday  citing \"rumours\"",
        "date": "11242015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "MEDIA-Potash Corp working on new K+S approach -Platow "
    },
    {
        "content": "Potash Corp of Saskatchewan   said on Thursday it would cut production and trim its full-year earnings and sales forecasts  as volatile currencies and economic pressures weigh on demand for the crop nutrient potash.",
        "date": "10292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash Corp cuts output  forecasts as prices slump; shares drop "
    },
    {
        "content": "Oct 29 Potash Corp of Saskatchewan   said on Thursday it would cut production and trim its full-year earnings and sales forecasts  as volatile currencies and economic pressures weigh on demand for the crop nutrient potash.",
        "date": "10292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 4-Potash Corp cuts output  forecasts as prices slump; shares drop "
    },
    {
        "content": "TORONTO  Oct 29 Canada's main stock index fell on Thursday  with Bombardier Inc plunging after reporting a massive quarterly loss and Potash Corp also retreating as it trimmed its earnings and sales forecasts.",
        "date": "10292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CANADA STOCKS-TSX falls; Bombardier and Potash Corp weigh "
    },
    {
        "content": "Oct 29 Potash Corp of Saskatchewan   on Thursday cut its full-year earnings forecast and said it expects to sell less potash in the year than expected due to weak demand and prices.",
        "date": "10292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CORRECTED-UPDATE 1-Potash Corp cuts profit view  to sell less potash due to weak prices "
    },
    {
        "content": "Oct 29 Potash Corp of Saskatchewan    the world's biggest fertilizer company by market capitalization  reported an 11 percent drop in quarterly profit  hurt mainly by weak nitrogen and potash prices and increased phosphate costs.",
        "date": "10292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp Q3 profit drops 11 pct on weak prices  higher costs "
    },
    {
        "content": "* Shares in K+S drop 25 percent   (Adds statement from K+S  shares closing price  adds link to Breakingviews column)",
        "date": "10052015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 2-Potash Corp withdraws $8.9 bln bid for German rival K+S "
    },
    {
        "content": "FRANKFURT  Oct 5 K+S said it remained upbeat on its long-term prospects after Potash Corp of Saskatchewan withdrew its 7.9 billion euro ($8.90 billion) offer for the German potash miner on Monday.",
        "date": "10052015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S says positive on future after Potash Corp drops bid "
    },
    {
        "content": "* K+S shares drop 24 percent   (Adds K+S shares  analyst comment)",
        "date": "10052015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "RPT-UPDATE 2-Potash Corp withdraws $8.9 bln takeover bid for German peer K+S "
    },
    {
        "content": "* Potash corporation of saskatchewan withdraws its proposal to launch public offer  Further company coverage:    (Frankfurt Newsroom)",
        "date": "10052015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-K+S says Potash corporation of Saskatchewan withdraws proposal to launch public offer "
    },
    {
        "content": "Oct 4 Potash Corp of Saskatchewan said it has withdrawn its offer for German potash producer K+S   citing a decline in global commodity and equity markets and a lack of engagement by K+S management.",
        "date": "10052015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp withdraws offer for K+S "
    },
    {
        "content": "(Adds company news items)     LONDON  Oct 1 European equity futures rose on Thursday  boosted by gains on Asian and U.S. equity markets.     Futures for the Euro STOXX 50  Germany's DAX  France's CAC  and Britain's FTSE 100 all rose by between 1 and 1.5 percent.     China's factory activity fell to a more than 6-year low in September while growth in the once-resilient services sector came close to stalling  private surveys showed  fuelling fears that the world's second biggest eco",
        "date": "10012015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "European Factors to Watch-European equity futures rise "
    },
    {
        "content": "(Adds company news items)     LONDON  Oct 1 European stocks were seen opening higher on Thursday  boosted by gains on Asian and U.S. equity markets.     Financial spreadbetters expected Britain's FTSE 100 to open up by 72-77 points  or 1.2-1.3 percent higher. Germany's DAX was seen opening up by 101-106 points  or 1.1 percent higher  while France's CAC 40 was seen up by 49-52 points  or 1.1-1.2 percent higher.     China's factory activity fell to a more than 6-year low in Septembe",
        "date": "10012015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "European Factors to Watch-Shares seen rising at open "
    },
    {
        "content": "* Potash Corp CEO says if K+S shareholders like offer  it might eventually happen; declines comment on strategy",
        "date": "09222015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp CEO says K+S deal may happen if shareholders like offer "
    },
    {
        "content": "Sept 16 Potash Corp of Saskatchewan   is not actively discussing its takeover proposal with Germany's K+S  but remains interested in a combination of fertilizer producers that would aid North American potash sales and offer new access to Europe  Chief Executive Jochen Tilk said on Wednesday.",
        "date": "09162015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 3-Potash Corp  K+S not actively discussing takeover -Potash CEO "
    },
    {
        "content": "Sept 16 Potash Corp of Saskatchewan   is not actively discussing its takeover proposal with Germany's K+S  but remains interested in a deal that would aid North America potash sales and offer new access to Europe  Chief Executive Jochen Tilk said on Wednesday.",
        "date": "09162015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp  K+S not actively discussing takeover-Potash CEO "
    },
    {
        "content": "BERLIN  Sept 8 Germany's regional government of Hesse  the home state of K+S  denied a newspaper report saying it was aware that Potash Corp was planning a hostile takeover bid for the German company.",
        "date": "09082015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Hesse government denies it aware of hostile Potash bid for K+S "
    },
    {
        "content": "* Amlin surges 33 pct after MS&AD agrees to buy firm   (Updates with closing prices)",
        "date": "09082015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Germany's DAX outperforms European shares after strong data "
    },
    {
        "content": "* Potash declines to comment   (Adds shares  detail from newspaper report and background)",
        "date": "09082015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 1-Potash might be prepared to make hostile K+S bid -Handelsblatt "
    },
    {
        "content": "FRANKFURT  Sept 8 Potash Corp is prepared to launch a hostile takeover offer for German potash mining rival K+S under certain conditions  German newspaper Handelsblatt reported on Tuesday.",
        "date": "09082015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash might be prepared to make hostile K+S bid -Handelsblatt "
    },
    {
        "content": "FRANKFURT Canada's Potash Corp of Saskatchewan  has hired a third investment bank as adviser in its effort to take over German fertilizer maker K+S   a German newspaper reported on Sunday.",
        "date": "09062015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Canada's Potash hires third bank in battle for K+S: paper "
    },
    {
        "content": "FRANKFURT  Sept 6 Canada's Potash Corp of Saskatchewan has hired a third investment bank as adviser in its effort to take over German fertiliser maker K+S   a German newspaper reported on Sunday.",
        "date": "09062015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Canada's Potash hires 3rd bank in battle for K+S -paper "
    },
    {
        "content": "* K+S keeps profit  sales guidance  details outlook   (Adds earnings detail  CFO comments  peer comparison and shares)",
        "date": "08132015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 2-K+S says will look at higher Potash bid  profit jumps "
    },
    {
        "content": "BERLIN  Aug 13 German salt and fertilizer company K+S does not oppose a takeover in principle  but it affirmed the current proposal by Canada's Potash Corp of Saskatchewan is inadequate in its view.",
        "date": "08132015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S CFO says does not in principle oppose takeover "
    },
    {
        "content": "BERLIN  Aug 13 Germany's K+S AG kept its guidance for a significant increase in full-year earnings after second-quarter operating profit rose more than expected to 179.2 million euros ($199.56 million).",
        "date": "08132015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S keeps FY profit guidance after Q2 rise  affirms Potash rejection "
    },
    {
        "content": "FRANKFURT German salt and fertilizer company K+S AG  says a survey of its retail investors shows they strongly support its rejection of a 7.9 billion euros ($8.6 billion) takeover offer from Canada's Potash Corp of Saskatchewan .",
        "date": "08102015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "K+S says retail shareholders back rejection of Potash offer "
    },
    {
        "content": "* More than 39 000 retail shareholders took part in survey   (Adds new comment from K+S  no comment from Potash Corp  share activity)",
        "date": "08102015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 2-K+S says retail shareholders back rejection of Potash offer "
    },
    {
        "content": "FRANKFURT  Aug 10 German salt and fertilizer company K+S AG said 84 percent of private shareholders it surveyed backed its decision to reject Potash Corp of Saskatchewan's takeover offer.",
        "date": "08102015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S says shareholders back rejection of Potash's proposal "
    },
    {
        "content": "Aug 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "08072015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "FRANKFURT German salt and fertilizer company K+S AG  once again rejected Potash Corp of Saskatchewan's  takeover offer on Friday  saying the Canadian company's assurances about maintaining jobs and mine sites in Germany were unreliable.",
        "date": "08072015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S rejects Potash offer  promises on German jobs and mines "
    },
    {
        "content": "FRANKFURT  Aug 7 German salt and fertilizer company K+S AG once again rejected Potash Corp of Saskatchewan's takeover offer on Friday  saying the Canadian company's assurances about maintaining jobs and mine sites in Germany were unreliable.",
        "date": "08072015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 2-K+S rejects Potash offer  promises on German jobs and mines "
    },
    {
        "content": "FRANKFURT  Aug 7 German salt and fertilizer company K+S AG said on Friday that Potash Corp of Saskatchewan's new offer still does not reflect the true value of the company and that commitments proposed by PotashCorp \"do not provide reliability\".",
        "date": "08072015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S says new Potash offer still not reflects fundamental value "
    },
    {
        "content": "Aug 7 Potash Corp confirms has sent private letter to K+S boards",
        "date": "08072015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-Potash Corp confirms sending letter to K+S boards "
    },
    {
        "content": "FRANKFURT  Aug 7 German salt and fertilizer company K+S AG said on Friday Potash Corp of Saskatchewan again sent an unsolicited letter to its management and supervisory boards.",
        "date": "08072015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S says Potash Corp sent unsolicited letter to management  board "
    },
    {
        "content": "Aug 4 A possible takeover of German potash miner K+S by Potash Corp of Saskatchewan would make further consolidation less likely  the incoming chief executive of fertilizer maker Mosaic Co said on Tuesday.",
        "date": "08042015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash Corp-K+S deal may limit further consolidation-Mosaic "
    },
    {
        "content": "The man who was instrumental in blocking a foreign takeover five years ago of Canada's Potash Corp  the world's No. 2 producer of the crop nutrient potash  says Germany need not fear Potash's move to buy German potash miner K+S AG.",
        "date": "07312015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Don't fear potash takeover  Saskatchewan premier tells Germany "
    },
    {
        "content": "* UCB  BNP Paribas  Natixis up after results   (Updates with closing prices  writes through)",
        "date": "07312015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "European shares mark positive end to rebound month "
    },
    {
        "content": "July 30 Canada's Potash Corp of Saskatchewan Inc   remains focused on acquiring German salt and fertilizer company K+S  the company said on Thursday  and is prepared to make \"binding commitments\" to maintain jobs and keep mines running to get a deal.",
        "date": "07302015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 5-Potash Corp keeps sights on buying K+S  vows to protect jobs "
    },
    {
        "content": "WINNIPEG  Manitoba  July 30 German salt and fertilizer company K+S AG sees no reason for new talks with Potash Corp of Saskatchewan  a spokesman said on Thursday  despite Potash Corp saying it would make binding commitments to protect jobs after a takeover.",
        "date": "07302015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S cool to new talks with Potash Corp on takeover "
    },
    {
        "content": "WINNIPEG  Manitoba  July 30 Potash Corp of Saskatchewan would finish building and would operate the Legacy potash mine owned by rival K+S  if it acquires the German salt and fertilizer producer  Chief Executive Jochen Tilk said on Thursday.",
        "date": "07302015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp set on building Legacy mine if it buys K+S-CEO "
    },
    {
        "content": "* Nationalisation seen as unlikely   (Adds source on KfW not acting as white knight)",
        "date": "07292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-K+S asks German government to fend off takeover-Handelsblatt "
    },
    {
        "content": "July 30 Potash Corp of Saskatchewan Inc   remains focused on acquiring German salt and fertilizer company K+S  the company said on Thursday  as it reduced the top end of its full-year earnings forecast.",
        "date": "07302015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CORRECTED-UPDATE 2-Potash Corp keeps sights on buying K+S  trims outlook "
    },
    {
        "content": "FRANKFURT  July 29 German potash and salt miner K+S has turned to German economy minister Sigmar Gabriel for help against an unwanted takeover approach by Canadian rival Potash Corp  and has discussed the option of German state bank KfW taking a stake in K+S  a newspaper reported on Wednesday.",
        "date": "07292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S asks German government to help fend off takeover-Handelsblatt "
    },
    {
        "content": "July 30 Potash Corp of Saskatchewan Inc    the world's biggest fertilizer company by market capitalization  reported a 12 percent drop in quarterly profit  hurt mainly by weak nitrogen earnings and lower phosphate sales.",
        "date": "07302015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp profit drops 12 pct "
    },
    {
        "content": "* K+S says nothing was offered that would warrant negotiations",
        "date": "07212015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-K+S rejects Potash Corp's new attempt at takeover talks "
    },
    {
        "content": "FRANKFURT  July 21 Canadian mineral miner Potash Corp has made a fresh attempt to win over the management of takeover target K+S and the German regional state of Hesse  where it is headquartered  but failed to entice K+S into merger talks.",
        "date": "07212015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S says new Potash Corp overture no basis for talks "
    },
    {
        "content": "LONDON  July 22 European shares headed for a lower open on Wednesday  tracking falls in U.S. equities  with focus on company results as the second-quarter earnings season gathers pace in Europe.     Futures for the Euro STOXX 50  Germany's DAX  Britain's FTSE and France's CAC traded between 0.7 and 0.5 percent lower by 0628 GMT.     European stocks retreated on Tuesday from the six-week high hit in the previous session  with the FTSEurofirst 300 index of top European shares  down 1.1",
        "date": "07222015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "European Factors to Watch - Shares seen tracking U.S. stocks lower "
    },
    {
        "content": "July 13 K+S CEO Norbert Steiner says on Potash Corp offer for K+S during visit of prime minister of the German state of Lower Saxony  Stephan Weil:",
        "date": "07132015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "CORRECTED-BRIEF-K+S CEO says Potash bid disregards interests of region "
    },
    {
        "content": "FRANKFURT  July 9 Shareholders in takeover target K+S say a deal could be done because suitor Potash Corp's main aim is to get control over its German rival's ambitious Canadian project and scale it back.",
        "date": "07092015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S investors see Potash Corp deal within reach despite rebuff "
    },
    {
        "content": "July 8 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Wednesday:",
        "date": "07082015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* 41 eur/shr offer no starting point for further increases-sources",
        "date": "07082015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 2-Potash Corp not planning to increase K+S bid-sources "
    },
    {
        "content": "FRANKFURT  July 9 K+S finance chief Burkhardt Lohr denied the German potash miner had set 50 euros per share as a minimum it expected suitor Potash Corp of Saskatchewan Inc to offer for the group  according to a newspaper interview.",
        "date": "07092015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S hasn't set minimum for Potash Corp bid - CFO in Boersen-Zeitung "
    },
    {
        "content": "July 8 Potash Corp of Saskatchewan Inc  is confident that K+S AG shareholders would accept its $8.7 billion bid  but is open to raising it if its German rival could reveal more value not currently seen by the Canadian company  the Globe and Mail reported  citing a source close to the deal.",
        "date": "07082015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp open to raising K+S bid - Globe & Mail "
    },
    {
        "content": "FRANKFURT German potash miner K+S  rejected Potash Corp of Saskatchewan's  7.9 billion euro ($8.7 billion) takeover bid on Thursday  saying it was too low and that the Canadian suitor could be planning to dismantle the company  putting jobs at risk.",
        "date": "07022015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "K+S rejects Potash Corp's takeover approach as too low "
    },
    {
        "content": "FRANKFURT  July 4 A German regional minister gave his backing to potash miner K+S's rejection of an $8.8 billion-euro takeover bid by Canada's Potash Corp of Saskatchewan  saying K+S should remain a German company.",
        "date": "07042015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "German minister backs K+S's Potash bid rejection "
    },
    {
        "content": "FRANKFURT  July 3 German potash miner K+S  on Friday rebuffed Potash Corp's overture to engage in talks over its proposed 7.85 billion euro ($8.72 billion) takeover.",
        "date": "07032015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "K+S says no basis for talks suggested by Potash Corp "
    },
    {
        "content": "* K+S says 41 eur/shr offer disregards value of new Canadian mine",
        "date": "07022015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 2-K+S rejects Potash Corp's takeover approach as too low "
    },
    {
        "content": "FRANKFURT German potash miner K+S rejected Potash Corp of Saskatchewan's 7.9 billion euro ($8.7 billion) takeover bid on Thursday  saying it was too low and that the Canadian suitor could be planning to dismantle the company  putting jobs at risk.",
        "date": "07042015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S rejects Potash Corp's takeover approach as too low "
    },
    {
        "content": "* K+S shares jump 4.5 percent   (Adds shares  analyst comment)",
        "date": "07032015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 1-Potash Corp says to address K+S's concerns about tie-up "
    },
    {
        "content": "* Doesn't make sense to talk about due diligence  will not open books to a competitor",
        "date": "07022015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "BRIEF-K+S says will not open books to suitor Potash Corp "
    },
    {
        "content": "June 28 Potash Corp of Saskatchewan Inc   the world's largest fertilizer company by capacity  does not plan any closures at K+S AG if its bid for its German peer proves successful  according to people familiar with the matter.",
        "date": "06282015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash Corp would not shed K+S operations in a deal -sources "
    },
    {
        "content": "German potash producer K+S  said on Thursday it has received a takeover proposal from larger Canadian rival",
        "date": "06252015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Germany's K+S confirms takeover proposal from Potash Corp "
    },
    {
        "content": "June 25 German potash producer K+S  said on Thursday it has received a takeover proposal from larger Canadian rival  Potash Corp of Saskatchewan Inc  starting a new takeover saga in the fertilizer industry.",
        "date": "06252015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 2-Germany's K+S confirms takeover proposal from Potash Corp "
    },
    {
        "content": "FRANKFURT Shares in German potash miner K+S  leapt as much as  40 percent on Friday after a takeover proposal from Canada's Potash Corp of Saskatchewan   which sources close to the matter said was worth close to 8 billion euros ($8.9 billion).",
        "date": "06262015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "K+S shares surge after Potash Corp takeover approach "
    },
    {
        "content": "June 25 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "06252015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* K+S will likely reject offer as too low -sources   (Adds Potash shareholder comment  German politician's comments  updates share prices)",
        "date": "06262015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 4-K+S shares surge after Potash Corp takeover approach "
    },
    {
        "content": "* Tesco top FTSEurofirst gainer after sales beat forecasts   (Update with optimism over Greece  adds details)",
        "date": "06262015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "European shares pick up ahead of crucial Greece talks "
    },
    {
        "content": "FRANKFURT  June 25 Potash Corporation of Saskatchewan Inc is eyeing",
        "date": "06252015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp eyes Germany's K+S -Handelsblatt newspaper "
    },
    {
        "content": "LONDON  June 26 European stocks fell on Friday  with investors discouraged by a lack of progress in Greek debt crisis negotiations heading into crunch talks at the weekend.",
        "date": "06262015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "European shares fall  Greek weekend debt talks prompt caution "
    },
    {
        "content": "FRANKFURT  June 26 Shares in German potash producer K+S leapt 38 percent to 40 euros in early trading on Friday after the company received a takeover proposal from larger Canadian fertilizer producer Potash Corp.",
        "date": "06262015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "K+S shares spike after takeover offer from Potash "
    },
    {
        "content": "FRANKFURT/TORONTO  June 25 German potash producer K+S said on Thursday it has received a takeover proposal from larger Canadian fertilizer producer Potash Corp of Saskatchewan Inc  potentially marking the start of a new takeover saga in the industry.",
        "date": "06262015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 3-Germany's K+S confirms takeover proposal from Potash Corp "
    },
    {
        "content": "May 21 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "05212015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK Potash Corporation of Saskatchewan Inc  Chief Executive Jochen Tilk said on Thursday that he views the company’s stakes in fertilizer companies Sinofert Holdings  and Arab Potash Company  as “strategic ” but continues to review whether to keep its shares in ICL  and SQM .",
        "date": "05212015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp evaluating SQM  ICL stakes; other holdings 'strategic' "
    },
    {
        "content": "NEW YORK  May 21 Potash Corporation of Saskatchewan Inc Chief Executive Jochen Tilk said on Thursday that he views the company's stakes in fertilizer companies Sinofert Holdings and Arab Potash Company  as \"strategic \" but continues to review whether to keep its shares in ICL and SQM.",
        "date": "05212015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 1-Potash Corp evaluating SQM  ICL stakes; other holdings 'strategic' "
    },
    {
        "content": "NEW YORK  May 21 Potash Corp of Saskatchewan  Chief Executive Jochen Tilk said on Thursday that he views the company's stakes in fertilizer companies Sinofert Holdings and Arab Potash Company as \"strategic \" but continues to review whether to keep its shares in ICL and SQM.",
        "date": "05212015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp evaluating SQM  ICL stakes "
    },
    {
        "content": "April 30 North America's two biggest potash producers  Potash Corp of Saskatchewan  and Mosaic Co  reported larger first-quarter profits on Thursday  but results missed expectations.",
        "date": "04302015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 2-Potash Corp  Mosaic profits climb less than expected "
    },
    {
        "content": "April 30 Potash Corp of Saskatchewan    the world's biggest fertilizer company by market capitalization  reported an 8.8 percent rise in quarterly profit  helped by lower costs and higher prices for potash and phosphate.",
        "date": "04302015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp profit rises 8.8 pct on better prices "
    },
    {
        "content": "* Shareholders will vote for new SQM board on Friday in Santiago",
        "date": "04222015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Power slips from Pinochet cronies as Chile's lithium giant reboots board "
    },
    {
        "content": "* Shareholders will vote for new SQM board on Friday in Santiago",
        "date": "04232015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-Power slips from Pinochet cronies as Chile's lithium giant revamps board "
    },
    {
        "content": "CHICAGO Bracing for their leanest season in eight years  U.S. farmers are skimping on everything from machinery to fertilizers  betting that they can go down-market and yet maintain crop production and quality.",
        "date": "04082015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "U.S. farmers take a gamble with belt-tightening as incomes slide "
    },
    {
        "content": "CHICAGO  April 8 Bracing for their leanest season in eight years  U.S. farmers are skimping on everything from machinery to fertilizers  betting that they can go down-market and yet maintain crop production and quality.",
        "date": "04082015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "US farmers take a gamble with belt-tightening as incomes slide "
    },
    {
        "content": "WINNIPEG  Manitoba  March 30 Canpotex Ltd  the offshore potash sales arm of North America's Potash Corp of Saskatchewan   Mosaic Co and Agrium Inc   said on Monday it had set 2015 supply contracts with major Chinese buyers  including Sinofert Holdings Ltd  and expected higher volume.",
        "date": "03302015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-Canpotex sets potash contracts with Chinese buyers "
    },
    {
        "content": "JERUSALEM/WINNIPEG  March 27 Potash producer Israel Chemicals  said on Friday it had made a C$137 million ($109.50 million) offer to buy Canada's Allana Potash  a deal it hopes will accelerate development of a mine in Ethiopia.",
        "date": "03272015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-Israel Chemicals makes $109 mln offer for Allana Potash "
    },
    {
        "content": "SANTIAGO  March 27 The largest U.S.-based shareholder of SQM has demanded an overhaul of the board and resignation of its chairman \"to restore credibility\" to the Chilean fertilizer company.",
        "date": "03272015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "U.S.-based shareholder of Chile's SQM demands board shake-up "
    },
    {
        "content": "SANTIAGO  March 17 SQM fertilizer company has fired its chief executive after it became embroiled in an election campaign financing scandal that has rocked the Chilean establishment  tainting business leaders and politicians with close links to the 1973-1990 dictatorship of Augusto Pinochet.",
        "date": "03172015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-Chile's campaign finance scandal fells CEO of SQM fertilizer "
    },
    {
        "content": "* Bigger rival Uralkali criticises hike as too small   (Writes through  adds quotes from Belarus  Uralkali)",
        "date": "03192015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 2-Belarus surprises rivals with China potash deal "
    },
    {
        "content": "SANTIAGO/WINNIPEG  March 18 Shares in Chilean fertilizer group SQM plunged on Wednesday after three board representatives from Canada's Potash Corp resigned in protest at its handling of an illicit payments scandal that has shaken the Chilean establishment.",
        "date": "03182015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 3-SQM stock plummets after directors from Potash Corp resign "
    },
    {
        "content": "WINNIPEG  Manitoba  March 18 Potash Corp of Saskatchewan  has made no decision on whether to sell its stake in Chilean fertilizer group SQM   Potash spokesman Randy Burton said.",
        "date": "03182015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp undecided about stake in Chile's SQM "
    },
    {
        "content": "SANTIAGO  March 18 Chilean fertilizer group SQM said on Wednesday that the three representatives on its board from Canadian stakeholder Potash Corp had resigned on Tuesday evening  although the company did not say why.",
        "date": "03182015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp representatives resign from SQM board as scandal deepens "
    },
    {
        "content": "SAO PAULO  March 2 Potash Corporation of Saskatchewan Inc  the world's largest fertilizer company by market value  agreed on Monday to pay about $56 million for a 9.5 percent stake in Brazilian rival Fertilizantes Heringer SA  the latest effort by Potash to grow in Latin America's largest economy.",
        "date": "03022015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "UPDATE 1-PotashCorp buys 9.5 pct in Heringer to expand in Brazil "
    },
    {
        "content": "March 2 Potash Corp of Saskatchewan Inc   the world's biggest fertilizer company by market capitalization  said it would buy a 9.5 percent stake in Brazil's Fertilizantes Heringer SA from its controlling shareholders for $55.7 million.",
        "date": "03022015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp to buy stake in Brazil's Heringer "
    },
    {
        "content": "NEW YORK A former Banco Santander SA executive has been indicted for insider trading ahead of a proposed 2010 takeover of Potash Corp of Saskatchewan Inc by the mining group BHP Billiton Ltd  U.S. prosecutors said on Tuesday.",
        "date": "02032015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "U.S. charges ex-Banco Santander executive with insider trading "
    },
    {
        "content": "NEW YORK  Feb 3 A former Banco Santander SA  executive has been indicted for insider trading ahead of a proposed 2010 takeover of Potash Corp of Saskatchewan Inc  by the mining group BHP Billiton Ltd  U.S. prosecutors said on Tuesday.",
        "date": "02032015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 2-U.S. charges ex-Banco Santander executive with insider trading "
    },
    {
        "content": "Potash Corp of Saskatchewan    the world's biggest fertilizer company by market capitalization  reported higher-than-expected quarterly profit on strong potash sales  but its 2015 outlook disappointed.",
        "date": "01292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "topStory",
        "symbol": "POT",
        "title": "Potash Corp's profit beats on higher potash sales; outlook misses "
    },
    {
        "content": "Jan 29 Potash Corp of Saskatchewan    the world's biggest fertilizer company by market capitalization  reported higher-than-expected quarterly profit on strong potash sales  but its 2015 outlook disappointed.",
        "date": "01292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "UPDATE 3-Potash Corp's profit beats on higher potash sales; outlook misses "
    },
    {
        "content": "TORONTO  Jan 29 Canada's main stock index was little changed in choppy trading on Thursday after a decline in energy shares was offset by gains in financials and most other major sectors.",
        "date": "01292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CANADA STOCKS-TSX little changed as energy decline offset by banks "
    },
    {
        "content": "Jan 29 Potash Corp of Saskatchewan    the world's biggest fertilizer company by market capitalization  reported higher-than-expected quarterly profit on strong potash sales  but its 2015 outlook disappointed.",
        "date": "01292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CORRECTED-UPDATE 2-Potash Corp's profit beats on higher potash sales; outlook misses "
    },
    {
        "content": "TORONTO  Jan 29 Canada's main stock index dropped 1.3 percent on Thursday  extending the previous session's sharp fall as investors remained nervous about the Federal Reserve's outlook for raising U.S. interest rates.",
        "date": "01292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "CANADA STOCKS-TSX drops as Fed worries  energy shares weigh "
    },
    {
        "content": "Jan 29 Potash Corp of Saskatchewan    the world's biggest fertilizer company by market capitalization  reported a 77 percent rise in quarterly profit  helped by higher realized prices and lower costs.",
        "date": "01292015",
        "name": "Potash Corporation of Saskatchewan Inc",
        "news_type": "normal",
        "symbol": "POT",
        "title": "Potash Corp quarterly profit jumps 77 pct "
    }
]