[
    {
        "content": "* PPG Industries Inc - ‍ entered into a partnership with Sinode Systems for vehicle battery technology​",
        "date": "11162017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG Industries entered into partnership with Sinode Systems for vehicle battery technology​ "
    },
    {
        "content": "AMSTERDAM Dutch paints maker Akzo Nobel  under pressure after rejecting a lucrative takeover offer and two profit warnings  has confirmed merger talks with smaller U.S. rival Axalta Coating Systems Ltd to create a $30 billion company.",
        "date": "10302017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo Nobel seeks $30 billion merger with smaller U.S. rival Axalta "
    },
    {
        "content": "FRANKFURT/NEW YORK  Oct 27 Dutch paints and coatings giant Akzo Nobel NV has approached U.S. rival Axalta Coating Systems Ltd to discuss a possible merger that would create a global coatings giant  according to sources familiar with the matter.",
        "date": "10272017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "EXCLUSIVE-Akzo Nobel approaches Axalta about possible merger -sources "
    },
    {
        "content": "AMSTERDAM Paint maker Akzo Nobel  warned its operating profit would not grow at all this year  in a further retreat from performance promises made to investors to fend off a 26-billion-euro ($31 billion) takeover approach in May. | Video ",
        "date": "10182017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo cuts profit goal for second time since fending off PPG "
    },
    {
        "content": "AMSTERDAM  Oct 18 Paint maker Akzo Nobel warned its operating profit would not grow at all this year  in a further retreat from performance promises made to investors to fend off a 26-billion-euro ($31 billion) takeover approach in May.",
        "date": "10182017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "RPT-UPDATE 3-Akzo cuts profit goal for second time since fending off PPG "
    },
    {
        "content": "* Q3 earnings per share view $1.52 -- Thomson Reuters I/B/E/S",
        "date": "10192017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG Industries Q3 earnings per share $1.52 from continuing operations "
    },
    {
        "content": "* Still planning special dividend  chemicals sale (Recasts to focus on Akzo's missed promise  adds detail)",
        "date": "10182017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 3-Akzo cuts profit goal for second time since fending off PPG "
    },
    {
        "content": "AMSTERDAM  Sept 19 Dutch paint maker Akzo Nobel   which rejected a 26 billion euro ($31.2 billion) takeover approach from U.S. rival PPG Industries this year -- has hired a new chief financial officer from financial services group Intertrust.",
        "date": "09192017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Overhauling management  Akzo Nobel hires Intertrust CFO De Vries "
    },
    {
        "content": "AMSTERDAM Dutch paintmaker Akzo Nobel   which angered investors by fending off a $32 billion takeover approach three months ago  warned on Friday it would not hit the 2017 profit target it promised during an acrimonious battle. | Video ",
        "date": "09082017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo abandons profit forecast made during PPG takeover battle "
    },
    {
        "content": "* CFO to step aside on health grounds (Adds quotes from shareholder meeting)",
        "date": "09082017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 4-Akzo abandons profit forecast made during PPG takeover battle "
    },
    {
        "content": "* Elliott agrees to halt lawsuits  back Akzo's board nominations",
        "date": "08162017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "UPDATE 3-U.S. activist investor ends feud with Dutch paintmaker Akzo Nobel "
    },
    {
        "content": "AMSTERDAM Akzo Nobel  does not have to let shareholders vote on whether to dismiss its chairman  a Dutch court ruled on Thursday  handing the paint company another victory in its battle with U.S. activist investor Elliott Advisors.",
        "date": "08102017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo Nobel wins again in court battle with hedge fund Elliott "
    },
    {
        "content": "AMSTERDAM Activist hedge fund Elliott Advisors returned to court on Thursday to try to oust the chairman of Dutch paints group Akzo Nobel  over his rejection of a 26.3 billion euro ($30 billion) takeover proposal from PPG Industries .",
        "date": "07272017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Round Two: Elliott Advisors  Akzo Nobel face off in Dutch court "
    },
    {
        "content": "AMSTERDAM  July 27 Activist hedge fund Elliott Advisors returned to court on Thursday to try to oust the chairman of Dutch paints group Akzo Nobel over his rejection of a 26.3 billion euro ($30 billion) takeover proposal from PPG Industries.",
        "date": "07272017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 2-Round Two: Elliott Advisors  Akzo Nobel face off in Dutch court "
    },
    {
        "content": "AMSTERDAM  July 27 Activist hedge fund Elliott Advisors on Thursday pressed ahead with a second lawsuit seeking to oust the chairman of Dutch paints group Akzo Nobel over his rejection of a 26.3 billion euro ($30 billion) takeover proposal from U.S. group PPG Industries.",
        "date": "07272017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Round Two: Elliott Advisors  Akzo Nobel resume combat in Dutch court "
    },
    {
        "content": "AMSTERDAM Dutch paintmaker Akzo Nobel's  chairman will step down next April  having angered some major investors by fighting off a 26.3 billion euro ($30.6 billion) takeover bid by U.S. rival PPG Industries . | Video ",
        "date": "07252017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo Nobel chairman to leave after opposing PPG deal "
    },
    {
        "content": "AMSTERDAM Dutch paintmaker Akzo Nobel's  chairman will step down next April  having angered some major investors by fighting off a 26.3 billion euro ($30.6 billion) takeover bid by U.S. rival PPG Industries . | Video ",
        "date": "07252017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel to lose chairman who fought off PPG takeover "
    },
    {
        "content": "* PPG to acquire coatings application services provider The Crown Group",
        "date": "07202017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG to acquire coatings application services provider The Crown Group "
    },
    {
        "content": "* Akzo Nobel Q2 results fall short of expectations (Updates with reaction from Elliott Advisors)",
        "date": "07252017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 3-Akzo Nobel to lose chairman who fought off PPG takeover "
    },
    {
        "content": "AMSTERDAM  July 25 Dutch paint maker Akzo Nobel on Tuesday said it would hold an extra shareholders meeting on Sept 8  on the appointment of a new CEO and to explain its rejection of a 26.3 billion euro ($30.63 billion) takeover bid by U.S. rival PPG Industries. (Reporting by Bart Meijer; Editing by Himani Sarkar)",
        "date": "07252017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel will hold extra shareholders' meeting on Sept. 8 "
    },
    {
        "content": "* PPG directors approve 13-percent dividend increase to 45 cents per share Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG approves 13 pct dividend increase to 45 cents per share "
    },
    {
        "content": "* PPG Industries Inc - Gary R. Heminger  chairman and ceo of Marathon Petroleum Corporation  has been elected to join its board of directors Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG appoints Gary Heminger to board of directors "
    },
    {
        "content": "* Q2 earnings per share view $1.82 -- Thomson Reuters I/B/E/S",
        "date": "07202017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG reports Q2 earnings per share $1.95 from continuing operations "
    },
    {
        "content": "AMSTERDAM Activist hedge fund Elliott Advisors has filed a second lawsuit in its attempt to oust the chairman of Dutch paints group Akzo Nobel  over his rejection of a 26.3 billion-euro ($30 billion) takeover proposal from U.S. group PPG Industries .",
        "date": "07072017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Elliott Advisors makes fresh legal move against Akzo Nobel's chairman "
    },
    {
        "content": "AMSTERDAM  July 7 Activist hedge fund Elliott Advisors has filed a second lawsuit in its attempt to oust the chairman of Dutch paints group Akzo Nobel over his rejection of a 26.3 billion-euro ($30 billion) takeover proposal from U.S. group PPG Industries.",
        "date": "07072017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 1-Elliott Advisors makes fresh legal move against Akzo Nobel's chairman "
    },
    {
        "content": "AMSTERDAM  July 7 Hedge fund Elliott Advisors said on Friday it has filed a second lawsuit seeking a general meeting of Akzo Nobel shareholders to vote on dismissing Chairman Antony Burgmans over his handling of a 26.3 billion-euro ($30 billion) takeover proposal from U.S. group PPG Industries.",
        "date": "07072017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "REFILE-Elliott Advisors makes fresh legal move against Akzo Nobel's chairman "
    },
    {
        "content": "LONDON Activist investor Elliott Advisors suffered a setback when U.S. paint maker PPG  walked away from bid target Akzo Nobel   but the New York-based hedge fund has plenty of other investments where it is seeking to exert its influence.",
        "date": "06062017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Factbox: Elliott Advisors' top five holdings "
    },
    {
        "content": "AMSTERDAM Akzo Nobel  the Dutch paint maker that rejected a 26.3 billion-euro ($29.6 billion) takeover proposal from U.S. rival PPG Industries   has sent PPG a letter shortly after its suitor walked away  detailing its objections to doing a deal.",
        "date": "06022017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo responds to PPG approach after takeover battle ends "
    },
    {
        "content": "AMSTERDAM  June 2 Akzo Nobel  the Dutch paint maker that rejected a 26.3 billion-euro ($29.6 billion) takeover proposal from U.S. rival PPG Industries  has sent PPG a letter shortly after its suitor walked away  detailing its objections to doing a deal.",
        "date": "06022017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 2-Akzo responds to PPG approach after takeover battle ends "
    },
    {
        "content": "AMSTERDAM  June 2 Akzo Nobel  the Dutch paint maker that rejected a 26.3 billion-euro ($29.63 billion) takeover proposal from U.S. rival PPG Industries  has sent PPG a letter  seen by Reuters   detailing specific problems it saw with the deal.",
        "date": "06022017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo responds to PPG - after the takeover battle ends "
    },
    {
        "content": "LONDON/AMSTERDAM In early March  U.S. paint maker PPG 's Chief Executive Michael McGarry flew from Pittsburgh to Amsterdam to take Akzo Nobel  boss Ton Buechner for lunch.",
        "date": "06012017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "How PPG lost its $29.5 billion bet on Dulux paint "
    },
    {
        "content": "U.S. coatings maker PPG Industries Inc  said on Tuesday that the Dutch Authority for the Financial Markets (AFM) did not grant its request to extend a June 1 deadline for making a tender offer for Dutch paint maker Akzo Nobel NV .",
        "date": "05302017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Dutch reject PPG's request to extend Akzo Nobel offer deadline "
    },
    {
        "content": "AMSTERDAM U.S. paints and coatings maker PPG Industries  has dropped its attempt to buy Dutch rival Akzo Nobel  in a  26.3 billion euro ($29.5 billion) deal  stung by repeated rejections from the company  legal defeats and hostility from Dutch politicians.",
        "date": "06012017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "PPG walks away from battle to buy Akzo Nobel "
    },
    {
        "content": "May 30 U.S. coatings maker PPG Industries Inc said on Tuesday that the Dutch Authority for the Financial Markets (AFM) did not grant its request to extend a June 1 deadline for making a tender offer for Dutch paint maker Akzo Nobel NV.",
        "date": "05302017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 1-Dutch reject PPG's request to extend Akzo Nobel offer deadline "
    },
    {
        "content": "AMSTERDAM  May 29 A Dutch court on Monday rejected a request by Akzo Nobel investors for it to take immediate action against the  company over its rejection of a takeover bid by U.S. rival PPG Industries  handing the Dutch company a victory in its efforts to repel the U.S. firm's 25 billion euro ($28 billion) proposed offer.",
        "date": "05292017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "UPDATE 3-Akzo Nobel wins court case against dissident shareholders "
    },
    {
        "content": "AMSTERDAM  June 1 U.S. paints and coatings maker PPG Industries has dropped its attempt to buy Dutch rival Akzo Nobel in a  26.3 billion euro ($29.5 billion) deal  stung by repeated rejections from the company  legal defeats and hostility from Dutch politicians.",
        "date": "06012017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "REFILE-UPDATE 3-PPG walks away from battle to buy Akzo Nobel "
    },
    {
        "content": "May 30 Dutch financial regulator AFM has informed U.S. coatings maker  PPG Industries Inc that it will not extend the June 1 deadline for making a tender offer for Dutch paint maker Akzo Nobel  people familiar with the matter said on Tuesday.",
        "date": "05302017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Dutch deny PPG's move to extend Akzo Nobel tender offer deadline -sources "
    },
    {
        "content": "AMSTERDAM  June 1 U.S. paints and coatings maker PPG Industries will not launch a formal bid for Dutch peer Akzo Nobel after repeated informal offers were rejected  it said on Thursday.",
        "date": "06012017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "PPG ends quest to buy Akzo Nobel for at least six months "
    },
    {
        "content": "AMSTERDAM A Dutch court on Monday rejected a request by Akzo Nobel  investors for it to take immediate action against the  company over its rejection of a takeover bid by U.S. rival PPG Industries   handing the Dutch company a victory in its efforts to repel the U.S. firm's 25 billion euro ($28 billion) proposed offer. | Video ",
        "date": "05302017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel wins court case against dissident shareholders "
    },
    {
        "content": "* Says it signed a agreement with PPG Industries  Inc. through unit Nippon Electric Glass America  Inc.  regarding acquisition of glass fiber business",
        "date": "05262017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-Nippon Electric Glass signs agreement with PPG Industries regarding acquisition of glass fiber business "
    },
    {
        "content": "* PPG ANNOUNCES DECISION TO WITHDRAW PROPOSAL AND NOT PURSUE OFFER FOR AKZONOBEL",
        "date": "06012017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG withdraws offer for Akzo Nobel "
    },
    {
        "content": "AMSTERDAM PPG Industries  remains interested in negotiating a \"consensual\" deal with Akzo Nobel   even as the Dutch rival paint maker resists its 26.3 billion euro ($29.5 billion) takeover offer  PPG's top executive said on Tuesday.",
        "date": "05232017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "PPG CEO says remains interested in 'consensual' deal with Akzo "
    },
    {
        "content": "AMSTERDAM Akzo Nobel  shareholders angered by the Dulux paint maker's rejection of a 26.3 billion euro ($29.5 billion) takeover proposal from U.S. rival PPG Industries  took their fight to an Amsterdam court on Monday. | Video ",
        "date": "05222017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Shareholders go to court seeking to oust Akzo chairman "
    },
    {
        "content": "AMSTERDAM  May 22 Akzo Nobel shareholders angered by the Dutch paint maker's rejection of a 26.3 billion euro ($29.5 billion) takeover offer from U.S. rival PPG Industries go to court on Monday seeking a pivotal victory in the continuing battle.",
        "date": "05212017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Shareholders take Akzo Nobel to court in effort to aid PPG takeover "
    },
    {
        "content": "AMSTERDAM The Dutch financial markets regulator AFM confirmed on Tuesday that it has received a request from U.S. paint maker PPG Industries  to extend a filing deadline by which the American company must submit a formal offer for Dutch rival Akzo Nobel.",
        "date": "05232017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "PPG request for Akzo Nobel extension under consideration: Dutch regulator "
    },
    {
        "content": "AMSTERDAM  May 23 The Dutch financial markets regulator AFM confirmed on Tuesday that it has received a request from U.S. paint maker PPG Industries to extend a filing deadline by which the American company must submit a formal offer for Dutch rival Akzo Nobel.",
        "date": "05232017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "PPG request for Akzo Nobel extension under consideration -Dutch regulator "
    },
    {
        "content": "AMSTERDAM  May 23 PPG Industries remains interested in negotiating a \"consensual\" deal with Akzo Nobel   even as the Dutch rival paint maker resists its 26.3 billion euro ($29.5 billion) takeover offer  PPG's top executive said on Tuesday.",
        "date": "05232017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 1-PPG CEO says remains interested in \"consensual\" deal with Akzo "
    },
    {
        "content": "* Court ruling expected May 29 (Adds Akzo reaction  judge's questions  court to rule May 29)",
        "date": "05222017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 3-Shareholders go to court seeking to oust Akzo chairman "
    },
    {
        "content": "AMSTERDAM  May 23 PPG Industries remains interested in negotiating a \"consensual\" deal with Akzo Nobel   even as the Dutch rival paint maker resists its 26.3 billion euro ($29.5 billion) takeover offer  PPG's top executive said on Tuesday.",
        "date": "05232017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "PPG CEO says remains interested in \"consensual\" deal with Akzo "
    },
    {
        "content": "AMSTERDAM  May 22 Akzo Nobel shareholders angered by the Dutch paint maker's rejection of a 26.3 billion euro ($29.5 billion) takeover offer from U.S. rival PPG Industries go to court on Monday seeking a pivotal victory in the continuing battle.",
        "date": "05222017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Shareholders take Akzo Nobel to court in effort to aid PPG takeover "
    },
    {
        "content": "* Amsterdam court ruling may influence PPG-Akzo takeover attempt",
        "date": "05152017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "RPT-Akzo's rebuff of PPG pushes bid battle into uncharted territory "
    },
    {
        "content": "* Amsterdam court ruling may influence PPG-Akzo takeover attempt",
        "date": "05122017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo's rebuff of PPG pushes bid battle into uncharted territory "
    },
    {
        "content": "* Ppg industries inc - PPG has reviewed AkzoNobel's May 8  2017 response to PPG's revised proposal of april 24  2017",
        "date": "05102017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG Industries says willing to meet AkzoNobel for \"meaningful\" discussions "
    },
    {
        "content": "AMSTERDAM Elliott Advisors  the hedge fund that has been pushing Dutch paint maker Akzo Nobel  to enter takeover talks with U.S. rival PPG Industries   said on Tuesday it has begun legal proceedings to try to oust Akzo Chairman Antony Burgmans.",
        "date": "05092017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Hedge fund goes to court seeking to oust Akzo Nobel chairman "
    },
    {
        "content": "* PPG faces June 1 deadline to launch bid or walk away (Adds details of Elliott's past legal campaigns)",
        "date": "05092017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 2-Hedge fund goes to court seeking to oust Akzo Nobel chairman "
    },
    {
        "content": "AMSTERDAM  May 9 Elliot Advisors  the hedge fund that has been pushing Dutch paint maker Akzo Nobel to enter takeover talks with U.S. peer PPG Industries  said on Tuesday it had launched legal action in an attempt to oust Akzo chairman Antony Burgmans.",
        "date": "05092017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Elliott goes to court seeking dismissal of Akzo Nobel chairman Burgmans "
    },
    {
        "content": "* Elliott advisors limited condemns Akzo Nobel N.V.'s rejection of third PPG proposal; has filed petition with enterprise chamber regarding EGM",
        "date": "05092017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-Elliott Advisors limited condemns Akzo Nobel's rejection of third PPG proposal "
    },
    {
        "content": "AMSTERDAM  May 8 Dutch paint maker Akzo Nobel on Monday rejected a third takeover proposal from PPG Industries  leaving its larger U.S. rival to decide whether to make a formal bid without the support of Akzo's board  or throw in the towel.",
        "date": "05082017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "UPDATE 4-Akzo Nobel rejects third takeover proposal from PPG "
    },
    {
        "content": "AMSTERDAM Elliott Advisors  the Akzo Nobel  shareholder that has been pushing for the company to enter takeover talks with U.S. rival PPG Industries   said on Friday Akzo will lose up to 6 400 jobs under the independence plan it has put forward as an alternative.",
        "date": "05052017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Elliot Advisors says Akzo to lose four times as many jobs without PPG takeover "
    },
    {
        "content": "AMSTERDAM Dutch paint maker Akzo Nobel  on Monday rejected a third takeover proposal from PPG Industries   leaving its larger U.S. rival to decide whether to make a formal bid without the support of Akzo's board  or throw in the towel. | Video ",
        "date": "05082017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel rejects third takeover proposal from PPG "
    },
    {
        "content": "* Is \"disappointed\" that Akzonobel has once again refused to enter into a negotiation regarding a combination of two companies",
        "date": "05082017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG says is \"disappointed\" that Akzo Nobel has again refused to enter into negotiation "
    },
    {
        "content": "* Elliott Advisors (UK) says is encouraged that Akzo Nobel has stated that it will \"carefully review and consider\" PPG's latest proposal",
        "date": "04242017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-Elliott Advisors (UK) says is encouraged that Akzo Nobel has stated that it will \"carefully review and consider\" PPG's latest proposal "
    },
    {
        "content": "AMSTERDAM  April 25 The chairman of Dutch paint-maker Akzo Nobel  Antony Burgmans  told shareholders at their annual meeting that the company is not yet ready to respond to a 26.9 billion takeover proposal by U.S. peer PPG Industries.",
        "date": "04252017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel backs its chairman  still studying PPG offer "
    },
    {
        "content": "LONDON One of Britain's biggest pension scheme investors has called on Dutch paintmaker Akzo Nobel  to engage with U.S. suitor PPG Industries  over a revised bid and criticized the board's handling of the issue.",
        "date": "04282017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo Nobel investor USS backs call for PPG talks over revised bid "
    },
    {
        "content": "April 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday: ** Government-controlled Dubai Aerospace Enterprise Ltd (DAE) is acquiring Dublin-based AWAS  the world's tenth biggest aircraft lessor  in a deal that will add over 200 planes to its fleet and more than double the size of its current business. ** Goals Soccer Centres Plc  the five-a-side football pitch operator  confirmed that it was in early discussions with privately-owned Powerle",
        "date": "04242017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "AMSTERDAM Dutch Economic Affairs Minister Henk Kamp repeated his opposition to a takeover of paint maker Akzo Nobel  on Tuesday  saying he did not care that U.S. rival PPG Industries  had raised its offer.",
        "date": "04252017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Dutch Economic Affairs minister says still opposed to Akzo Nobel takeover "
    },
    {
        "content": "LONDON  April 28 One of Britain's biggest pension scheme investors has called on Dutch paintmaker Akzo Nobel to engage with U.S. suitor PPG Industries over a revised bid and criticised the board's handling of the issue.",
        "date": "04282017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "CORRECTED-Akzo Nobel investor USS backs call for PPG talks over revised bid "
    },
    {
        "content": "AMSTERDAM The chief executive of paint maker PPG Industries   which raised its takeover proposal for Dutch rival Akzo Nobel to about 26.9 billion euros ($28 billion) on Monday  said the deal would still add to earnings in the first year.",
        "date": "04242017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel purchase would add to earnings in first year: PPG CEO "
    },
    {
        "content": "LONDON U.S. activist investor Elliott Capital Advisors disclosed on Monday it has taken a 6.8 percent stake in WS Atkins after the British engineering and construction consultancy firm agreed to be bought in a C$3.6 billion ($2.7 billion) deal.",
        "date": "04252017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Activist investor Elliott takes stake in UK takeover target WS Atkins "
    },
    {
        "content": "April 28 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Friday:",
        "date": "04282017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* PPG submits revised proposal to Akzonobel to combine companies",
        "date": "04242017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG submits revised proposal to AkzoNobel to combine companies "
    },
    {
        "content": "* \"PPG has listened carefully to Akzonobel's new strategic plan  and we continue to believe in merits of combining two companies\"",
        "date": "04192017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG says continues to believe in merits of combining with Akzonobel "
    },
    {
        "content": "AMSTERDAM  April 19 A Dutch trade union said on Wednesday it will consider meeting with PPG Industries to discuss its planned 24.6 billion euro ($26.34 billion) takeover of rival AkzoNobel after the Dutch company announced a strategic plan that would lead to job cuts.",
        "date": "04192017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Dutch trade union: AkzoNobel strategic plan will lead to job cuts "
    },
    {
        "content": "AMSTERDAM Pittsburgh-based PPG Industries  dismissed proposals put forward by Dutch paintmaker Akzo Nobel  on Wednesday to fend off its takeover bid and won support from activist hedge fund Elliott Advisors. | Video ",
        "date": "04192017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "PPG dismisses Akzo Nobel defense  presses takeover case "
    },
    {
        "content": "* Dutch company has resisted pressure to hold talks (Adds Elliott  PPG comments)",
        "date": "04192017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 3-PPG dismisses Akzo Nobel defence  presses takeover case "
    },
    {
        "content": "AMSTERDAM  April 19 Akzo Nobel  the Dutch paint maker struggling to avoid a 24.6 billion euro ($26 billion) takeover by U.S. rival PPG Industries Inc  on Wednesday outlined a plan to instead separate its chemicals arm and pay shareholders 1.6 billion euros in extra dividends.",
        "date": "04192017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel unveils plan to separate chemicals arm  pay special dividend "
    },
    {
        "content": "AMSTERDAM/LONDON Akzo Nobel   the Dutch paint-maker struggling to avoid a 24.6 billion euro ($26.4 billion) takeover by U.S. rival PPG Industries Inc   on Wednesday reported better than expected operating profit for the first quarter.",
        "date": "04192017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel beats on first-quarter operating profit  sees 2017 growth "
    },
    {
        "content": "AMSTERDAM  April 17 PPG Industries  the U.S. paint-maker that is trying to buy Dutch peer AkzoNobel for 24.6 billion euros  ($26.1 billion)  said on Monday that Akzo's plan to instead spin off its chemicals arm and remain independent is riskier and would create less value.",
        "date": "04172017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "PPG CEO: AkzoNobel independence plan riskier than merger "
    },
    {
        "content": "* PPG Industries Inc - funded acquisition  which represents a minority interest related to one of PPG's legacy businesses  using cash on hand",
        "date": "04112017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG acquires minority stake in Taiwan Chlorine Industries "
    },
    {
        "content": "AMSTERDAM  April 11 The CEO of AkzoNobel   the Dutch paints and coatings maker whose management is trying to avoid a takeover by U.S. rival PPG Industries   said its shareholders are divided over the bid in an interview published on Tuesday.",
        "date": "04112017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "AkzoNobel CEO: Shareholders divided on PPG bid - paper "
    },
    {
        "content": "* Shareholder Elliott Advisors threaten legal action (Adds Elliott's threat of legal action)",
        "date": "04122017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "UPDATE 2-Rebel shareholder threatens legal action if Akzo rejects vote on chairman's dismissal "
    },
    {
        "content": "AMSTERDAM  April 12 Elliott Advisors  the AkzoNobel shareholder that backs rival PPG's planned takeover of the Dutch paint maker  said it would take legal action if Akzo did not give an upcoming shareholder meeting the chance to vote to dismiss its chairman.",
        "date": "04122017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Elliott plans legal action if Akzo rejects vote on chairman dismissal "
    },
    {
        "content": "April 12 Hedge Fund Elliott Advisors Says Met With PPG Industries",
        "date": "04122017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-Hedge fund Elliott Advisors says met with PPG on Akzo Nobel "
    },
    {
        "content": "AMSTERDAM Akzo Nobel  said it had reported one of its own biggest shareholders  Elliott Advisors  and its suitor PPG Industries  to regulators for possibly sharing \"sensitive\" information about shareholders' intentions to call an extraordinary meeting to replace Chairman Antony Burgmans.",
        "date": "04122017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel reports Elliott  PPG for allegedly sharing 'sensitive' information "
    },
    {
        "content": "* PPG acquires remaining interest in IVC joint venture in Asia",
        "date": "04062017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG acquires remaining interest in IVC joint venture in Asia "
    },
    {
        "content": "AMSTERDAM Dutch paint maker AkzoNobel  could face a shareholder revolt if it continues to avoid a meeting with PPG Industries  to discuss a possible takeover by the U.S. company  PPG Chief Executive Michael McGarry told Reuters on Wednesday.",
        "date": "04052017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo could face investor revolt for blocking talks  PPG says "
    },
    {
        "content": "AMSTERDAM  April 3 Akzo Nobel CEO Ton Buechner repeated on Monday his opposition to a March 20 takeover proposal from U.S. rival PPG Industries  saying he sees no merit in negotiating with PPG.",
        "date": "04032017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel CEO says PPG proposal is insufficient "
    },
    {
        "content": "* Akzo says PPG's proposals are \"unacceptable\" (Updates to clarify how Akzo's anti-takeover defence mechanism works in final paragraph)",
        "date": "04052017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 3-Akzo could face investor revolt for blocking talks  PPG says "
    },
    {
        "content": "AMSTERDAM  April 5 PPG Industries  the U.S. paints and coating makers that is trying to buy smaller Dutch peer Akzo Nobel  said on Wednesday it was ready to address various non-financial objections Akzo had raised about PPG's offer.",
        "date": "04052017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "PPG says ready to address Akzo Nobel objections to offer "
    },
    {
        "content": "LONDON  April 3 A top-20 investor in Akzo Nobel said on Monday he wanted the firm to engage with U.S. rival PPG Industries over a revised bid raising pressure on the Dutch paint maker to begin talks.",
        "date": "04032017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Top-20 Akzo Nobel investor backs talks with PPG over revised bid "
    },
    {
        "content": "AMSTERDAM Akzo Nobel  Chairman Antony Bergmans on Friday again dismissed a takeover proposal from U.S. rival PPG Industries  as \"a poor offer\".",
        "date": "03312017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo Nobel's chairman says PPG's proposal 'just a poor offer': newspaper interview "
    },
    {
        "content": "AMSTERDAM  March 31 Akzo Nobel Chairman Antony Bergmans on Friday again dismissed a takeover proposal from U.S. rival PPG Industries as \"a poor offer\".",
        "date": "03312017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "REFILE-Akzo Nobel's chairman says PPG's proposal \"just a poor offer\" - newspaper interview "
    },
    {
        "content": "AMSTERDAM Elliott Advisors  the activist investor with a 3.25 percent stake in Akzo Nobel   said on Wednesday other shareholders owning almost a quarter of the Dutch paints and chemicals group want it to enter into talks with spurned U.S. suitor PPG Industries .",
        "date": "03292017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Other Akzo shareholders also want talks with PPG: Elliott Advisors "
    },
    {
        "content": "AMSTERDAM Dutch paints maker Akzo Nobel  said it will raise its financial targets and detail plans for its chemicals division next month  as it seeks to win over shareholders and avoid a takeover by U.S. rival PPG Industries .",
        "date": "03282017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo Nobel aims to soothe shareholders over PPG rejection "
    },
    {
        "content": "AMSTERDAM  March 29 Elliott Advisors  the activist investor with a 3.25 percent stake in Akzo Nobel   said on Wednesday other shareholders owning almost a quarter of the Dutch paints and chemicals group want it to enter into talks with spurned U.S. suitor PPG Industries.",
        "date": "03292017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 4-Other Akzo shareholders also want talks with PPG - Elliott Advisors "
    },
    {
        "content": "AMSTERDAM  March 28 Dutch paints maker Akzo Nobel said it will raise its financial targets and detail plans for its chemicals division next month  as it seeks to win over shareholders and avoid a takeover by U.S. rival PPG Industries.",
        "date": "03282017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "REFILE-UPDATE 1-Akzo Nobel aims to soothe shareholders over PPG rejection "
    },
    {
        "content": "AMSTERDAM  March 28 Akzo Nobel  the Dutch paints and coatings maker trying to avoid being taken over by larger U.S. rival PPG Industries  said on Tuesday it would detail its strategy to remain independent on April 19.",
        "date": "03282017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel to detail new strategic plan on April 19 "
    },
    {
        "content": "AMSTERDAM A team of executives from U.S. paint maker PPG  left the Netherlands on Friday without meeting their counterparts at Akzo Nobel during a two-day charm offensive to win support for their proposed takeover of their Dutch rival.",
        "date": "03242017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "PPG chief snubbed by Akzo during Netherlands visit "
    },
    {
        "content": "AMSTERDAM  March 24 The chief executive of PPG Industries has left the Netherlands after meeting with Akzo Nobel \"stakeholders\" to lobby for a merger of the two companies  a spokesman said Friday.",
        "date": "03242017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "PPG CEO leaves Netherlands  remains ready to meet with Akzo boards "
    },
    {
        "content": "AMSTERDAM  March 24 A team of executives from U.S. paint maker PPG left the Netherlands on Friday without meeting their counterparts at Akzo Nobel during a two-day charm offensive to win support for their proposed takeover of their Dutch rival.",
        "date": "03242017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 1-PPG chief snubbed by Akzo during Netherlands visit "
    },
    {
        "content": "* PPG announces automotive and industrial coatings price increases in Europe",
        "date": "03242017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG announces automotive and industrial coatings price increases in Europe "
    },
    {
        "content": "* Akzo refusal cites jobs losses  differing corporate culture   (Updates after interview with CEO)",
        "date": "03222017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "UPDATE 6-Shareholders urge Akzo to negotiate with suitor PPG "
    },
    {
        "content": "AMSTERDAM The chief executive of U.S. paint maker PPG  won the backing of Akzo Nobel's  largest shareholder on Thursday after flying to Amsterdam to press the Dutch company to open talks on a 22.7 billion euro ($24.5 billion) takeover.",
        "date": "03232017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo Nobel finds unwanted suitor PPG on its doorstep "
    },
    {
        "content": "LONDON  March 22 Top-20 Akzo Nobel shareholder Columbia Threadneedle said on Wednesday a takeover by U.S. rival PPG Industries made sense and the Akzo board should engage in talks over a deal.",
        "date": "03222017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Top Akzo investor Columbia Threadneedle says wants firm to talk to PPG over deal "
    },
    {
        "content": "* Press release - PPG makes revised proposal to combine with Akzonobel",
        "date": "03222017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG makes revised proposal to combine with Akzonobel "
    },
    {
        "content": "* Largest Akzo shareholder says time to talk   (Updates after Akzo's largest shareholder calls for talks)",
        "date": "03232017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 2-Akzo Nobel finds unwanted suitor PPG on its doorstep "
    },
    {
        "content": "AMSTERDAM  March 23 Causeway Capital  the largest holder of shares in Dutch paints maker Akzo Nobel  on Thursday urged the company to engage in takeover talks with U.S. suitor PPG Industries.",
        "date": "03232017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel's largest shareholder urges it to talk to bidder PPG "
    },
    {
        "content": "Activist investor Elliott Management owns shares in Akzo Nobel NV   a person familiar with the matter said on Friday  potentially adding pressure on the Dutch paint maker to consider a sale to U.S. coatings manufacturer PPG industries Inc .",
        "date": "03172017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Activist investor Elliott owns Akzo Nobel's stock: source "
    },
    {
        "content": "AMSTERDAM Investor Elliot Advisors Ltd on Wednesday said it was urging Akzo Nobel  on behalf of itself and other shareholders to \"engage\" with U.S. rival PPG Industries  on a possible takeover.",
        "date": "03222017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Elliot Advisors urges Akzo Nobel to 'engage' with PPG  has built 3 percent stake "
    },
    {
        "content": "AMSTERDAM  March 22 Dutch paints and coatings maker Akzo Nobel rejected on Wednesday a second takeover proposal from U.S. rival PPG Industries saying the offer was too low and too risky.",
        "date": "03222017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel rejects improved bid from U.S. rival PPG "
    },
    {
        "content": "AMSTERDAM Shareholders piled pressure on Dutch paint maker Akzo Nobel  to open talks with U.S. rival PPG Industries  on Wednesday after Akzo rejected a revised 22.7 billion euro takeover offer as too low  too risky and a bad fit culturally. | Video ",
        "date": "03232017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Shareholders urge Akzo to negotiate with suitor PPG "
    },
    {
        "content": "March 17 Activist investor Elliott Management owns shares in Akzo Nobel NV  a person familiar with the matter said on Friday  potentially adding pressure on the Dutch paint maker to consider a sale to U.S. coatings manufacturer PPG industries Inc.",
        "date": "03172017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Activist investor Elliott owns Akzo Nobel's stock -source "
    },
    {
        "content": "* Elliott Management owns stake in Akzo Nobel NV; Elliott is pushing Azko to engage in talks with suitor PPG Industries Inc - WSJ  citing sources",
        "date": "03172017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-Elliott pushes Azko Nobel to engage in talks with suitor PPG Industries - WSJ  citing sources "
    },
    {
        "content": "* Rejects second unsolicited proposal from PPG Industries Inc",
        "date": "03222017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-Akzo Nobel rejects second unsolicited proposal from PPG "
    },
    {
        "content": "AMSTERDAM Akzo Nobel's  Chief Executive Ton Buechner said on Wednesday he was not planning to meet or talk with Michael McGarry  his counterpart at U.S. suitor PPG Industries   when McGarry visits Amsterdam this week.",
        "date": "03232017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel CEO: won't meet with PPG to talk about bid "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - PPG Industries will struggle to paint by Akzo Nobel's numbers. The Pittsburgh-based maker of Glidden and other coatings and chemicals is deciding whether to improve on an offer to buy Dutch competitor Akzo Nobel after an unsolicited $22 billion entreaty was firmly rejected. To make the deal stick requires some ultra-glossy cost savings (see calculator http://tmsnrt.rs/2msqtWd).",
        "date": "03152017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Breakingviews: PPG will struggle to paint by Akzo Nobel numbers "
    },
    {
        "content": "AMSTERDAM Dutch paints and coatings maker Akzo Nobel NV  rejected a 21 billion euro ($22 billion) bid from larger U.S. rival PPG Industries Inc  on Thursday  saying instead it wanted to \"unlock value\" by spinning off its chemicals business. | Video ",
        "date": "03102017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo Nobel rejects $22 billion PPG bid  looks to spin off chemicals "
    },
    {
        "content": "* Shares rise 14 pct to near record levels   (Adds estimate on value of chemicals division  details on advisers  political reaction)",
        "date": "03092017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "UPDATE 4-Akzo Nobel rejects $22 bln PPG bid  looks to spin off chemicals "
    },
    {
        "content": "AMSTERDAM  March 10 Henderson Global Investors  a shareholder in Akzo Nobel  has called on the Dutch paint maker's management to engage in takeover discussions with U.S. rival PPG Industries.",
        "date": "03102017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Shareholder Henderson Global urges Akzo Nobel to talk to PPG "
    },
    {
        "content": "Dutch paint maker Akzo Nobel NV  is exploring a sale or merger with a peer  and is in talks with companies including U.S. coatings manufacturer PPG Industries Inc   people familiar with the matter said on Wednesday.",
        "date": "03082017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Akzo Nobel explores sale  merger with peer: sources "
    },
    {
        "content": "March 8 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "03082017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "March 8 Dutch paint maker Akzo Nobel NV  is exploring a sale or merger with a peer  and is in talks with companies including U.S. coatings manufacturer PPG Industries Inc  people familiar with the matter said on Wednesday.",
        "date": "03082017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 1-Akzo Nobel explores sale  merger with peer -sources "
    },
    {
        "content": "March 8 Dutch paint maker Akzo Nobel NV  is exploring a sale or merger with a peer  and is in talks with companies including U.S. coatings manufacturer PPG Industries Inc  people familiar with the matter said on Wednesday.",
        "date": "03082017",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Akzo Nobel explores sale  merger with peer -sources "
    },
    {
        "content": "* PPG appoints Morales as senior vice president and chief financial officer; Sklarsky announces retirement",
        "date": "01192017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG Industries appoints Morales as senior vice president  CFO "
    },
    {
        "content": "* PPG Industries-in connection with Morales'S appointment as CFO  his monthly salary will be increased to $41 667 and will be eligible for target cash bonus under incentive compensation plan of $450 000  Source text : http://bit.ly/2kbmPDr Further company coverage:",
        "date": "01202017",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-Ppg industries-in connection with morales's appointment as cfo  his monthly salary will be increased to $41 667 "
    },
    {
        "content": "* PPG directors announce quarterly dividend of 40 cents per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780; )",
        "date": "10202016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG announce quarterly dividend of 40 cents per share "
    },
    {
        "content": "* Q3 adjusted earnings per share $1.56 from continuing operations",
        "date": "10202016",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG Industries Q3 loss per share $0.75 from continuing operations "
    },
    {
        "content": "Chemical company PPG Industries Inc  said on Friday it expected to post a third-quarter loss  its first since March 2009  due to charges related to a pension settlement.",
        "date": "10072016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Chemical company PPG sees first quarterly loss since 2009 "
    },
    {
        "content": "Oct 7 Chemical company PPG Industries Inc  said on Friday it expected to post a third-quarter loss  its first since March 2009  due to charges related to a pension settlement.",
        "date": "10072016",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "UPDATE 1-Chemical company PPG sees first quarterly loss since 2009 "
    },
    {
        "content": "Oct 7 Chemical company PPG Industries Inc  said it expected to post a loss in the third quarter  its first in 30 quarters  due to charges related to a pension settlement.",
        "date": "10072016",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Chemical company PPG Industries expects to post Q3 loss "
    },
    {
        "content": "* Sees Q3 2016 Reported Loss Per Share From Continuing Operations To Be In Range Of 74 Cents To 77 Cents",
        "date": "10072016",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG Industries sees Q3 adj EPS $1.54-$1.57 from cont ops "
    },
    {
        "content": "MEXICO CITY  Oct 3 Mexican glassmaker Vitro said on Monday it had completed its acquisition of the flat glass unit of U.S. company PPG  which in July it announced it would buy for around $750 million.    (Writing by Dave Graham)",
        "date": "10032016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Mexico's Vitro says completes PPG flat glass unit purchase "
    },
    {
        "content": "* Completes sale of European fiber glass operations to Nippon Electric Glass",
        "date": "10032016",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG completes sale of European fiber glass operations to Nippon Electric Glass "
    },
    {
        "content": "MEXICO CITY  Sept 23 Mexican glassmaker Vitro said on Friday it had obtained a 7-year loan worth $500 million to cover part of its planned acquisition of the flat glass unit of U.S. company PPG.",
        "date": "09242016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "Mexico's Vitro secures $500mln loan for PPG unit purchase "
    },
    {
        "content": "* Investing $20 million to upgrade its fiber glass manufacturing facility in chester  south carolina  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08032016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG industries investing $20 mln to upgrade its fiber glass manufacturing facility "
    },
    {
        "content": "MONTERREY  July 21 Mexican glass manufacturer Vitro said on Thursday it had agreed to purchase the flat glass unit of U.S. company PPG for around $750 million  giving it a foothold in U.S. and Canadian markets.",
        "date": "07212016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "UPDATE 2-Mexico's Vitro to buy PPG's flat glass unit for $750 mln "
    },
    {
        "content": "MEXICO CITY Mexican glass manufacturer Vitro  said on Thursday it had agreed to purchase the flat glass unit of U.S. company PPG  for around $750 million  giving it a foothold in the U.S. and Canadian markets.",
        "date": "07212016",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Mexico's Vitro to buy PPG's flat glass unit for $750 million "
    },
    {
        "content": "* President and chief executive officer Michael McGarry will become chairman and CEO effective same day",
        "date": "07212016",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG says executive chairman Bunch to retire "
    },
    {
        "content": "* Jeff Oravitz  previously CEO of MetoKote  is appointed vice president of PPG Coatings Services and president of PPG-MetoKote  Source text for Eikon:  Further company coverage:",
        "date": "07112016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG names Jeff Oravitz as vice president of PPG Coatings Services "
    },
    {
        "content": "* PPG will purchase group annuity contracts from Metlife and Massmutual",
        "date": "06282016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-Metlife signs pension buyout agreement with PPG "
    },
    {
        "content": "* To recognize non-cash pension settlement charge of about $500-$600 million after tax in Q3 as result of purchase of group annuity contracts",
        "date": "06272016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG Industries to take non-cash pension settlement charge of about $500-$600 mln after tax in Q3 "
    },
    {
        "content": "* PPG to transfer pension administration and obligations to Massachusetts Mutual Life Insurance Company and Metropolitan Life Insurance Company",
        "date": "06272016",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "BRIEF-PPG to transfer pension administration and obligations to Massachusetts Mutual Life Insurance Co and Metropolitan Life Insurance Co "
    },
    {
        "content": "* Psa group gives full approval to enviro-prime epic electrocoat by ppg  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06232016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PSA Group gives full approval to enviro-prime epic electrocoat by PPG "
    },
    {
        "content": "* Says the company entered into agreement with PPG Industries Inc to buy its properties for glass fiber business in EU and 100 percent stake in PPG Industries Fiber Glass B.V.",
        "date": "06202016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-Nippon Electric Glass to buy glass fiber business in EU and PPG Industries Fiber Glass B.V "
    },
    {
        "content": "* PPG fully funds its share of Pittsburgh Corning Asbestos Trust",
        "date": "06102016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG fully funds its share of Pittsburgh Corning Asbestos Trust "
    },
    {
        "content": "* Platinum Equity to sell Metokote to PPG  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06082016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-Platinum Equity to sell Metokote to PPG "
    },
    {
        "content": "* On May 27  2016  co entered into a $250 million term loan credit agreement between co and Bank Of Tokyo-Mitsubishi UFJ  ltd - sec filing",
        "date": "06032016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG Industries enters $250 mln term loan credit agreement - SEC filing "
    },
    {
        "content": "* In 2015  achieved goal of sustainable products accounting for 30 percent of its sales five years ahead of schedule  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780; )",
        "date": "04282016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG Industries provides 2015 sustainable goals "
    },
    {
        "content": "* PPGdirectors approve 11-percent dividend increase to 40 cents per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04212016",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-PPG Board approves 11-pct dividend raise to $0.40/shr "
    },
    {
        "content": "Feb 29 Auto parts distributor LKQ Corp  said it would buy Pittsburgh Glass Works from private equity firm Kohlberg & Co LLC and PPG Industries Inc for $635 million on an enterprise basis.",
        "date": "02292016",
        "name": "PPG Industries Inc",
        "news_type": "normal",
        "symbol": "PPG",
        "title": "Auto parts distributor LKQ to buy Pittsburgh Glass Works "
    },
    {
        "content": "July 20 Uzertas Boya Sanayi Ticaret ve Yatirim AS :",
        "date": "07202015",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "BRIEF-Uzertas Boya signs letter of intent with PPG for distribution of Bondex brand "
    },
    {
        "content": "where assigned  and hit the newskey (F9 on Reuters terminals)",
        "date": "03062015",
        "name": "PPG Industries Inc",
        "news_type": "topStory",
        "symbol": "PPG",
        "title": "New Issue-PPG Industries prices dual tranche deal "
    }
]