[
    {
        "content": "* ‍HAS TODAY COMPLETED SALE OF A 22 PCT STAKE IN PENGUIN RANDOM HOUSE VENTURE TO OUR PARTNER BERTELSMANN SE & CO KGAA​ Source text for Eikon: Further company coverage:",
        "date": "10052017",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Pearson completes sale of 22 pct stake in Penguin Random House "
    },
    {
        "content": "HONG KONG/LONDON  Sept 22 North Asia private equity firm MBK Partners is preparing a bid to buy language learning business Wall Street English (WSE) from Pearson PLC   the world's biggest education company  three people with direct knowledge of the matter said.",
        "date": "09222017",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "PE firm MBK Partners preparing bid for Pearson's $400 mln English language unit -sources "
    },
    {
        "content": "* COMPLETED DISPOSAL  TOGETHER WITH SALE OF ASSOCIATED PROPERTY ASSETS  IS EXPECTED TO GENERATE GROSS CASH PROCEEDS TO PEARSON IN REGION OF $80M",
        "date": "08162017",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Pearson says to sell Global Education business "
    },
    {
        "content": "* Initiated processes to explore a potential partnership for its english language learning business Wall Street English",
        "date": "02242017",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Pearson announces strategic review of Wall Street English business  Global Education business "
    },
    {
        "content": "SAO PAULO  Jan 30 Grupo SEB do Brasil could seek an initial public offering following the repurchase of a learning system division from Pearson Plc  to fund growth of the profitable business unit across privately owned elite schools  Chief Executive Officer Chaim Zaher said on Monday.",
        "date": "01302017",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "UPDATE 1-Brazil's SEB considers IPO after buying back Pueri unit from Pearson "
    },
    {
        "content": "SAO PAULO  Jan 30 Brazil's Grupo SEB has reacquired Pueri Domus learning systems from Britain's Pearson Plc for an undisclosed value on Monday  the Brazilian company said.",
        "date": "01302017",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Brazil's Grupo SEB reacquires Pueri Domus learning systems from UK's Pearson "
    },
    {
        "content": "LONDON  Oct 4 European shares advanced on Tuesday  with Germany's Deutsche Bank hitting a two-week high following recent steep losses and the world's biggest education company Pearson gaining after encouraging comments by Morgan Stanley.",
        "date": "10042016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Deutsche Bank and Pearson help European shares rally "
    },
    {
        "content": "* Micro Focus surges after Hewlett Packard deal   (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon  see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "09082016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "European shares drop as ECB's Draghi cools stimulus talk "
    },
    {
        "content": "July 14 Valeant Pharmaceuticals International Inc :",
        "date": "07142016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Valeant says former CEO Pearson remains \"significant\" shareholder "
    },
    {
        "content": "* Former Valeant CEO Pearson sold nearly 5 million Valeant shares and options for $96.8 million - CNBC  Source text: (http://cnb.cx/29XOtj4) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07132016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Former Valeant CEO Pearson sold nearly 5 mln shares  options for $96.8 mln -CNBC "
    },
    {
        "content": "* But Barclays jumps after results   (Adds details  closing prices)",
        "date": "07292016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "FTSE ends flat  breaks five-week winning streak as Pearson plunges "
    },
    {
        "content": "* Shares fall 10 pct   (Adds CFO  analyst comment; updates shares)",
        "date": "07292016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UPDATE 2-Pearson sees outlook improving after first-half sales disappoint "
    },
    {
        "content": "LONDON  July 29 British shares fell on Friday  with the FTSE 100 index set to end a five-week gaining streak as education publisher Pearson slumped after it posted results.",
        "date": "07292016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Britain's FTSE set to break five-week winning streak as Pearson plunges "
    },
    {
        "content": "July 29 Pearson Plc  the world's biggest education company that is struggling with a downturn  said it could potentially surpass its previous full-year adjusted operating profit guidance  if current currency exchange rates persisted.",
        "date": "07292016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson hints at full-year gain from currency "
    },
    {
        "content": "* Is trading in-line with expectations set in February and is reiterating 2016 guidance",
        "date": "07292016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BRIEF-Pearson says H1 trading in line with expectations "
    },
    {
        "content": "SAO PAULO  June 8 Pearson Plc is looking at several possible acquisitions in Brazil amid a wave of merger talks  an executive told Reuters  as the British education company aims to take advantage of a favorable exchange rate in a market where it is fast expanding.",
        "date": "06082016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Pearson sees possible Brazil targets as education deals heat up "
    },
    {
        "content": "June 9 Britain's FTSE 100 index is seen opening down 20 points  or 0.3 percent  on Thursday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed up 16.99 points  or 0.3 percent  at 6 285.21 points on Wednesday  with a recovery in commodities prices underpinning basic resources and energy stocks.      * VODAFONE: Britain's Vodafone Group Plc on Thursday announced an effective takeover of leadin",
        "date": "06092016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UK Stocks-Factors to watch on June 9 "
    },
    {
        "content": "* Under separation agreement with former CEO pearson  he will provide consulting services to company through december 31  2017",
        "date": "05312016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Valeant's former CEO may remain as consultant through 2017 "
    },
    {
        "content": "LONDON Pearson   the British education company struggling to cope with a downturn in its biggest markets  reported a further fall in sales on Friday as the loss of high-profile testing contracts in the United States hit first-quarter results.",
        "date": "04292016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "U.S. contract losses hit education firm Pearson's first quarter "
    },
    {
        "content": "April 29 Valeant Pharmaceuticals International Inc :",
        "date": "04292016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BRIEF-Valeant says 3 new independent directors nominated to board "
    },
    {
        "content": "WASHINGTON  April 27 Outgoing Valeant Pharmaceuticals Chief Executive Michael Pearson plans to tell a U.S. Senate panel on Wednesday that he regrets his decision to acquire and jack up the price of two life-saving heart drugs  saying it was all a \"mistake.\"",
        "date": "04272016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Valeant CEO to tell U.S. Senate he regrets raising heart drug prices "
    },
    {
        "content": "LONDON - The yen hit an 18-month high as investors wager the Bank of Japan might be done adding fresh stimulus to the economy  culminating in a sharp rise on the week that dragged stocks around the world lower. (GLOBAL-MARKETS/ (WRAPUP 5)  moved  by Jamie McGeever  710 words)",
        "date": "04292016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Reuters Business News Schedule at 1230 GMT/0830 AM ET "
    },
    {
        "content": "WASHINGTON/NEW YORK Activist investor William Ackman promised U.S. lawmakers on Wednesday that he will urge the board of Valeant Pharmaceuticals to reduce the high prices of four life-saving drugs that are now at the heart of two congressional probes.",
        "date": "04272016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Valeant CEO tells U.S. Senate of regret over raising drug prices "
    },
    {
        "content": "April 13 Valeant Pharmaceuticals International Inc's  outgoing chief executive  Michael Pearson  consented to be deposed by a U.S. Senate committee later this month  after the panel threatened to hold him in contempt for failing to comply with a subpoena.",
        "date": "04132016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "UPDATE 1-Valeant CEO agrees to be deposed by Senate committee "
    },
    {
        "content": "* U.S. Senate Special Committee on Aging says Senate Special Committee on Aging to depose Michael Pearson",
        "date": "04132016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BRIEF-U.S. Senate Special Committee on Aging to depose Valeant CEO Pearson "
    },
    {
        "content": "LONDON  March 22 Pearson said there was no change in its position regarding its stake in its Penguin Random House joint venture after partner Bertelsmann  said earlier on Tuesday it wanted to increase its holding.",
        "date": "03222016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson sticks to Penguin position after partner's comments "
    },
    {
        "content": "Drugmaker Valeant Pharmaceuticals International Inc  said on Monday its chief executive officer is leaving and billionaire investor William Ackman would join the board as it tries to clean up accounting problems and save its business.    The Canadian company  whose operations include prescription drugs  consumer products  and Bausch & Lomb eye care  has lost nearly 90 percent of its value as it came under public scrutiny for its pricing and distribution pra | Video ",
        "date": "03222016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Drugmaker Valeant CEO leaving as investor Ackman joins board "
    },
    {
        "content": "March 14 * ValueAct Capital CEO Jeff Ubben to CNBC - Oil could push to $100 by 2019  * ValueAct Capital CEO Jeff Ubben On Valeant to CNBC - CEO Pearson is the right guy for the job",
        "date": "03142016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "CORRECTED-BRIEF-ValueAct's Ubben says Valeant CEO Pearson is right guy for job-CNBC "
    },
    {
        "content": "LW Tanner Pearson has four goals in his last eight games. The first two were overtime winners in the Kings' only two victories on a five-game road trip  and the next two carried the Kings over the visiting Sabres on Saturday night. The Kings are now 9-0-0 this year when Pearson scores  and he is a plus-4 during the Kings' four-game winning streak.",
        "date": "02282016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Los Angeles Kings - PlayerWatch "
    },
    {
        "content": "* Shares rise on signs of stabilisation   (Adds exec comments  analyst reaction  shares)",
        "date": "02262016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "UPDATE 1-Pearson sees profit recovery in 2018 as tough markets persist "
    },
    {
        "content": "* Ceo says company 'already quarter of a way through' restructuring plan",
        "date": "02262016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BRIEF-Pearson says Q4 trend in line with first nine months "
    },
    {
        "content": "LONDON  Feb 26 Pearson plc  the British education company struggling to find a strategy to cope with tough end-markets  reported operating profit of 723 million pounds ($1.01 billion) for 2015  2 percent down on the year before.",
        "date": "02262016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson sees profit recovery in 2018 "
    },
    {
        "content": "* Unexpected complications resulted in longer hospital stay-Pearson",
        "date": "01252016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "UPDATE 2-Valeant's Pearson says timing of return uncertain "
    },
    {
        "content": "* Deutsche Bank hit by capital concerns   (Adds closing prices  details)",
        "date": "01212016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "European shares rise energised by Draghi; Italy boosted by bank rally "
    },
    {
        "content": "LONDON Britain's Pearson said it would cut 10 percent of its workforce and restructure once again to tackle the unrelenting pressures hitting markets from North America to South Africa after it decided to focus on educational publishing.",
        "date": "01212016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson to cut 4 000 jobs in latest restructuring plan "
    },
    {
        "content": "LONDON  Jan 21 Britain's Pearson said it would cut 10 percent of its workforce and restructure once again to tackle the unrelenting pressures hitting markets from North America to South Africa after it decided to focus on educational publishing.",
        "date": "01212016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "REFILE-UPDATE 4-Pearson to cut 4 000 jobs in latest restructuring plan "
    },
    {
        "content": "* Deutsche Bank hit by capital concerns   (Updates with market developments)",
        "date": "01212016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "European shares rise helped by Draghi; Italy banks rally "
    },
    {
        "content": "* Pearson surges after announcing cost-cutting plans   (Recasts  adds quote  detail)",
        "date": "01212016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Britain's FTSE gets Draghi boost to bounce from 3-yr lows "
    },
    {
        "content": "* Pearson surges after announcing cost-cutting plans   (Updates prices  adds detail)",
        "date": "01212016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Britain's FTSE steadies at lowest level in more than three years "
    },
    {
        "content": "* Deutsche Bank hit by capital concerns   (Adds details  updates prices)",
        "date": "01212016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "European shares edge up before ECB meeting; Pearson jumps "
    },
    {
        "content": "* Ceo says taking \"decisive action\" to return pearson to growth  confident market challenges will abate",
        "date": "01212016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BRIEF-Pearson confidence it can cover dividend  due to outlook and balance sheet "
    },
    {
        "content": "LONDON  Jan 21 Britain's top share index lingered on Thursday at its lowest level in more than three years  as leading financial stocks lost ground while oil prices weakened further.",
        "date": "01212016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Britain's FTSE lingers at lowest level in more than three years "
    },
    {
        "content": "LONDON  Jan 21 European equities steadied on Thursday after slumping in the previous session following a rout in commodities prices  with a strong rally in shares of companies such as Pearson and Logitech  underpinning the market.",
        "date": "01212016",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "European shares steady after Wednesday's slump  Pearson jumps "
    },
    {
        "content": "Valeant Pharmaceuticals International Inc   will appoint an interim chief executive officer to replace Michael Pearson who is hospitalized  a source familiar with the matter told Reuters  news that sent shares down 7 percent on Tuesday.   The source did not clarify whether the CEO would be temporary or would permanently replace Pearson  56  who is recovering from a severe case of pneumonia.",
        "date": "01062016",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Valeant to appoint interim CEO as Pearson remains hospitalized: source "
    },
    {
        "content": "** Education publisher Pearson up c.5 pct  on-track for its sharpest one-day gain since late Jan & top FTSE 100  gainer after Exane BNP Paribas upgrades to \"outperform\" v \"neutral\"",
        "date": "12162015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BUZZ-Pearson: top UK bluechip gainer after Exane gets behind it "
    },
    {
        "content": "Dec 17 Britain's FTSE 100 index is seen opening up 69 points  or 1.14 percent  on Thursday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed up 43.40 points  or 0.7 percent  at 6 061.19 points  boosted by rises in Dixons Carphone and Pearson  with investors hoping that an expected rise in U.S. interest rates later would calm volatile markets.      * STANDARD CHARTERED: Temasek is willing to",
        "date": "12172015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UK Stocks-Factors to watch on Dec 17 "
    },
    {
        "content": "* Sidney Taurel is to be appointed as Chairman with effect from 1 January 2016  Source text for Eikon:  Further company coverage:",
        "date": "12072015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Pearson appoints Taurel as Chairman "
    },
    {
        "content": "FRANKFURT European media giant Bertelsmann  is looking for a private equity partner to help it buy the rest of publisher Penguin Random House should co-owner Pearson  want a swift exit from the business  three sources told Reuters.",
        "date": "11242015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Bertelsmann seeks partner to buy Penguin Random House: sources "
    },
    {
        "content": "* Could use financial help if Pearson exits quickly - sources",
        "date": "11242015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UPDATE 2-Bertelsmann seeks partner to buy Penguin Random House-sources "
    },
    {
        "content": "* Dow Jones and Pearson today jointly announce plans to divest their stakes in Russian newspaper Vedomosti to the Kudryavtsev family  Source text: (http://bit.ly/1Ngm5FO) Further company coverage:",
        "date": "11202015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Pearson and Dow Jones to sell stakes in Russian newspaper Vedomosti "
    },
    {
        "content": "FRANKFURT  Nov 24 European media conglomerate Bertelsmann is looking for a private equity partner to help it buy the rest of publisher Penguin Random House in case co-owner Pearson wants a quick exit from the business  three sources told Reuters.",
        "date": "11242015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Bertelsmann seeks partner to buy Penguin Random House-sources "
    },
    {
        "content": "* Appointment of Lincoln Wallen as an independent non-executive director  effective from January 1st 2016.",
        "date": "11182015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Pearson appoints Wallen as independent non-executive director "
    },
    {
        "content": "BARCELONA Pearson's chief executive John Fallon said on Wednesday he considered protecting his company's dividend a top priority as the world's largest educational publisher struggles with slowdowns in most of its major markets.",
        "date": "11112015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Pearson CEO says 'sustaining' the dividend his priority "
    },
    {
        "content": "BARCELONA  Nov 11 Pearson's chief executive John Fallon said on Wednesday he considered protecting his company's dividend a top priority as the world's largest educational publisher struggles with slowdowns in most of its major markets.",
        "date": "11112015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson CEO says \"sustaining\" the dividend his priority "
    },
    {
        "content": "LONDON  Oct 26 British education publisher Pearson named Sidney Taurel as its new chairman on Monday  appointing the former pharmaceutical boss to lead its board at a time when it is facing questions over its strategy.",
        "date": "10262015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Pearson names pharma exec Sidney Taurel as new chairman "
    },
    {
        "content": "LONDON  Oct 22 Shares in Pearson fell a further 8 percent on Thursday  taking the total wiped off its market value in two days to 2.2 billion pounds ($3.4 billion)  as analysts said the education company could need to overhaul its whole strategy.",
        "date": "10222015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson faces questions over strategy as shares fall further "
    },
    {
        "content": "TORONTO The plunge in the stock price of Valeant Pharmaceuticals International Inc   has not only cost some of Wall Street's titans billions of dollars this week  it also wiped $1.5 billion from the personal wealth of its head Mike Pearson.",
        "date": "10232015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Valeant share price meltdown wipes $1.5 billion from CEO's wealth "
    },
    {
        "content": "* Taurel (adds dropped word)  former ceo and chairman of global pharmaceutical firm eli lilly will take over on 1 january 2016",
        "date": "10262015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BRIEF-Pearson appoints Sidney Taurel as new chairman "
    },
    {
        "content": "TORONTO  Oct 23 The plunge in the stock price of Valeant Pharmaceuticals International Inc  has not only cost some of Wall Street's titans billions of dollars this week  it also wiped $1.5 billion from the personal wealth of its head Mike Pearson.",
        "date": "10232015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Valeant share price meltdown wipes $1.5 bln from CEO's wealth "
    },
    {
        "content": "TORONTO/NEW YORK Valeant Pharmaceuticals International Inc  moved to reassure investors on Thursday after being accused of using specialty pharmacies to inflate revenue  and said it would refute them in detail on a conference call with investors.",
        "date": "10232015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Valeant vows to refute 'phantom sales' allegations "
    },
    {
        "content": "Mike Pearson's methods heading one of the world's most acquisitive drugmakers have long been viewed as troubling to some  merely unorthodox to others.",
        "date": "10212015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Often criticized  Valeant's unusual CEO comes under heavy fire "
    },
    {
        "content": "Oct 21 Mike Pearson's methods heading one of the world's most acquisitive drugmakers have long been viewed as troubling to some  merely unorthodox to others.",
        "date": "10212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "NEWSMAKER-Often criticized  Valeant's unusual CEO comes under heavy fire "
    },
    {
        "content": "* Pearson set for record one-day loss   (Recasts  adds quotes  updates prices)",
        "date": "10212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Britain's FTSE edges higher on positive company results "
    },
    {
        "content": "LONDON Pearson  shares plunged as much as 18 percent on Wednesday after the world's biggest education publisher said earnings would be worse than expected  partly because fewer students were enrolling at U.S. colleges.",
        "date": "10212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson shares plunge after education publisher cuts forecasts "
    },
    {
        "content": "LONDON  Oct 21 Pearson shares plunged as much as 18 percent on Wednesday after the world's biggest education publisher said earnings would be worse than expected  partly because fewer students were enrolling at U.S. colleges.",
        "date": "10212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UPDATE 3-Pearson shares plunge after education publisher cuts forecasts "
    },
    {
        "content": "** Pearson loses more than 1.5 billion GBP ($2.32 billion) in market value on Wednesday  and stock on track for its worst one-day slide ever",
        "date": "10212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BUZZ-Pearson: the long and short of it "
    },
    {
        "content": "MILAN/LONDON  Oct 21 European shares pared losses to turn slightly higher on Wednesday as confidence over a positive close to the year and continued central bank support helped investors absorb weak earnings news.",
        "date": "10212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "European shares turn higher as investors shrug off poor earnings "
    },
    {
        "content": "LONDON  Oct 21 European shares fell on Wednesday  with British education publisher Pearson  slumping after warning on its earnings and Swiss bank Credit Suisse dropping on its plans for capital hikes.",
        "date": "10212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Poor company earnings hit European shares  Pearson down 15 pct "
    },
    {
        "content": "LONDON  Oct 21 Britain's top share index dipped on Wednesday  hit by a drop in Pearson after it said that full-year profit would come in at the lower end of its range.",
        "date": "10212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson slump drags Britain's FTSE lower "
    },
    {
        "content": "FRANKFURT  Sept 17 German publisher Axel Springer may want to increase its current 7 percent stake in U.S. news website Business Insider  German Manager Magazin reported on Thursday.",
        "date": "09172015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Axel Springer eyes controlling stake in Business Insider -Manager Magazin "
    },
    {
        "content": "** British publisher Pearson up c.2 pct & top gainer on the E300 media index after two brokerages upgrade the stock",
        "date": "09072015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BUZZ-Pearson: top media gainer on two brokerages upgrades "
    },
    {
        "content": "WASHINGTON  Sept 2 Japan's Nikkei media group won U.S. antitrust approval for its $1.3 billion purchase of the Financial Times from Britain's Pearson PLC  the Federal Trade Commission said on Wednesday.",
        "date": "09022015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "U.S. gives antitrust approval to Nikkei's purchase of Financial Times "
    },
    {
        "content": "FRANKFURT German media group Bertelsmann will consider raising its stake in book publisher Penguin Random House  it said on Monday  now that shares in the joint venture with Pearson could come on the market.",
        "date": "08312015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Bertelsmann open to increasing stake in Penguin Random House "
    },
    {
        "content": "* Hawkins' \"Girl on the Train\" sells more than 4.5 mln copies",
        "date": "08312015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UPDATE 2-Bertelsmann open to increasing stake in Penguin Random House "
    },
    {
        "content": "* CEO says not interested in parts of News Corp's  education business",
        "date": "08312015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BRIEF-Bertelsmann would mull upping stake in Penguin Random House "
    },
    {
        "content": "LONDON Britain's Pearson  brought an end to its near 60-year ownership of The Economist on Wednesday  agreeing to sell its 50 percent stake in a deal that makes Italy's Agnelli family the largest shareholder in the weekly title.",
        "date": "08132015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Agnelli family lifts stake in The Economist as Pearson sells out "
    },
    {
        "content": "Aug 13 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08132015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "PRESS DIGEST- Financial Times - Aug 13 "
    },
    {
        "content": "MILAN Britain's Pearson  should announce the sale of its 50 percent stake in The Economist to Italy's Exor and the Rothschild family for 400 million pounds ($624 million) as early as this week  two sources close to the matter said on Tuesday.",
        "date": "08112015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Exor to get 40 percent of The Economist after Pearson stake sale: source "
    },
    {
        "content": "LONDON Britain's Pearson brought an end to its near 60-year ownership of The Economist on Wednesday  agreeing to sell its 50 percent stake in a deal that makes Italy's Agnelli family the largest shareholder in the weekly title. | Video ",
        "date": "08122015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Agnelli family lifts stake in The Economist as Pearson sells out "
    },
    {
        "content": "MILAN  Aug 11 Britain's Pearson should announce the sale of its 50 percent stake in The Economist to Italy's Exor and the Rothschild family for 400 million pounds ($624 million) as early as this week  two sources close to the matter said on Tuesday.",
        "date": "08112015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Exor to get 40 percent of The Economist after Pearson stake sale-source "
    },
    {
        "content": "* The Economist says deal ensures editorial independence   (Adds background  details)",
        "date": "08122015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UPDATE 2-Agnelli family lifts stake in The Economist as Pearson sells out "
    },
    {
        "content": "MILAN Exor  the holding company of Italy's Agnelli family  has increased its stake in The Economist Group to 43.4 percent",
        "date": "08122015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Exor ups stake in The Economist to 43.4 percent for 287 million pounds "
    },
    {
        "content": "The following factors could affect Italian markets on Wednesday.",
        "date": "08122015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Italy - Factors to watch on August 12 "
    },
    {
        "content": "MILAN  Aug 12 Exor  the holding company of Italy's Agnelli family  has increased its stake in The Economist Group to 43.4 percent  from 4.7 percent by buying shares from Britain's Pearson  for 287 million pounds ($447 million).",
        "date": "08122015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Exor ups stake in The Economist to 43.4 pct for 287 mln pounds "
    },
    {
        "content": "LONDON  Aug 12 Britain's Pearson  fresh from agreeing the sale of the Financial Times newspaper to Japan's Nikkei  said on Wednesday it would sell its 50 percent stake in the Economist Group for 469 million pounds ($730.6 million) to its existing investors.",
        "date": "08122015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson to sell Economist stake for 469 mln stg "
    },
    {
        "content": "FRANKFURT  Aug 4 German publisher Axel Springer  increased its financing to 1.2 billion euros ($1.32 billion) at the beginning of July  the time when it was in negotiations to buy Pearson's Financial Times.",
        "date": "08042015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Axel Springer increased financing to 1.2 bln euros "
    },
    {
        "content": "FRANKFURT  Aug 4 Germany's biggest news publisher Axel Springer on Tuesday reported better-than-expected second-quarter core profit as its continued to expand its digital activities  offsetting a decline in its classic printing business.",
        "date": "08042015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Axel Springer Q2 core profit easily beats estimates "
    },
    {
        "content": "LONDON/MILAN Britain's Pearson  is in talks to sell its 50 percent stake in The Economist to the other shareholders of the weekly newspaper  with one  Italy's Agnelli family  confirming it wants to increase its stake.",
        "date": "07252015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Pearson says in talks to sell its 50 percent stake in The Economist "
    },
    {
        "content": "MILAN  July 25 Italian holding company Exor  said on Saturday it was in talks with Britain's Pearson on the possibility of raising its 4.72 percent stake in The Economist Group  publisher of The Economist newspaper.",
        "date": "07252015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Italy's Exor in talks to increase its stake in The Economist "
    },
    {
        "content": "* Pearson down more than 5 percent as brokers cut target prices",
        "date": "07272015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "UPDATE 2-Britain's FTSE falls as commodity stocks and Pearson drop "
    },
    {
        "content": "LONDON/MILAN  July 25 Britain's Pearson  is in talks to sell its 50 percent stake in The Economist to the other shareholders of the weekly newspaper  with one  Italy's Agnelli family  confirming it wants to increase its stake.",
        "date": "07252015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UPDATE 2-Pearson says in talks to sell its 50 pct stake in The Economist "
    },
    {
        "content": "LONDON  July 27 Britain's top share index slipped on Monday  weighed down by Merlin Entertainments  and Pearson  although it outperformed European peers as mining stocks bounced.",
        "date": "07272015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Britain's FTSE slips as Merlin and Pearson drop "
    },
    {
        "content": "Nikkei's $1.3 billion purchase of the Financial Times from Britain's Pearson PLC marks the culmination of decades of attempts by the Japanese household name to break into mainstream English-language media. | Video ",
        "date": "07242015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Nikkei's Financial Times buy follows years of attempting to break into English news "
    },
    {
        "content": "** Publisher Pearson 2nd top FTSE 100  faller  extending Friday's losses & within sight of six-month lows after three brokerages slash TPs citing limited 2016 EPS growth",
        "date": "07272015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BUZZ-Pearson: nears 6-month lows as brokers cut targets "
    },
    {
        "content": "LONDON  July 25 British publishing group Pearson  said on Saturday it was in talks to sell its 50 percent stake in The Economist Group  publisher of The Economist newspaper.",
        "date": "07252015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson says in talks to sell its 50 pct stake in The Economist "
    },
    {
        "content": "LONDON  July 24 The Economist Group could become the latest British media business to undergo a change of ownership this year as its co-owner Pearson focuses on education  bankers and industry sources said.",
        "date": "07242015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Focus turns to The Economist after FT sale "
    },
    {
        "content": "LONDON  July 27 Britain's top share index edged lower on Monday after falls in Merlin Entertainments and Pearson and ahead of GDP data due later in the week  but outperformed broader European equities as battered miners staged a rebound.",
        "date": "07272015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Britain's FTSE falls  lead lower by Pearson and Merlin Entertainments "
    },
    {
        "content": "* Confirms it is in discussions with Economist Group board and trustees regarding potential sale of its 50 pct share in group",
        "date": "07272015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BRIEF-Pearson says in talks to sell its 50 pct stake in The Economist "
    },
    {
        "content": "LONDON  July 23 Japanese media group Nikkei agreed on Thursday to buy the Financial Times from Britain's Pearson in a $1.3 billion deal that brings together two of the leading financial news operations from Europe and Asia.",
        "date": "07232015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "REFILE-TIMELINE-History of the Financial Times "
    },
    {
        "content": "July 20 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "07202015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON Pearson  will increase earnings this year for the first time since 2011  it said on Friday  allaying worries about the health of a U.S. education business that is increasingly important after its deal to sell the Financial Times newspaper.",
        "date": "07242015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson sees bright future in education after FT sale "
    },
    {
        "content": "* Shares up 1.1 percent   (Adds CEO comments  analyst reaction  shares)",
        "date": "07242015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UPDATE 2-Pearson sees bright future in education after FT sale "
    },
    {
        "content": "LONDON Japanese media group Nikkei has agreed to buy the Financial Times from Britain's Pearson  for $1.3 billion  putting one of the world's premier business newspapers in the hands of a company influential at home but little known outside Japan.",
        "date": "07232015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Japan's Nikkei buys Financial Times in $1.3 billion deal "
    },
    {
        "content": "LONDON Japanese media group Nikkei agreed on Thursday to buy the Financial Times from Britain's Pearson  in a $1.3 billion deal that brings together two of the leading financial news operations from Europe and Asia.",
        "date": "07232015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "History of the Financial Times "
    },
    {
        "content": "July 23 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07232015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": " ",
        "date": "07202015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UPDATE 2-Pearson exploring sale of Financial Times -Bloomberg "
    },
    {
        "content": "LONDON  July 24 Britain's top share index edged higher on Friday  in line with euro zone equities  boosted by positively received corporate updates from several companies  including Vodafone and Pearson.",
        "date": "07242015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Vodafone and Pearson lead Britain's FTSE higher "
    },
    {
        "content": "LONDON British publisher Pearson  is exploring the sale of its  Financial Times newspaper after receiving interest from potential buyers  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "07202015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson exploring sale of Financial Times: Bloomberg "
    },
    {
        "content": "July 24 Nikkei's $1.3 billion purchase of the Financial Times from Britain's Pearson PLC marks the culmination of decades of attempts by the Japanese household name to break into mainstream English-language media.",
        "date": "07242015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Nikkei's FT buy follows years of attempting to break into English news "
    },
    {
        "content": "LONDON  July 23 Japanese media group Nikkei has agreed to buy the Financial Times from Britain's Pearson  for $1.3 billion  putting one of the world's premier business newspapers in the hands of a company influential at home but little known outside Japan.",
        "date": "07232015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UPDATE 8-Japan's Nikkei buys Financial Times in $1.3 bln deal "
    },
    {
        "content": "LONDON  July 24 Pearson  the British group selling the Financial Times in a $1.3 billion deal  increased its dividend and confirmed guidance on Friday after first-half operating profit dipped  partly on the timing of textbook adoption in the United States.",
        "date": "07242015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson sticks to guidance after FT sale "
    },
    {
        "content": "* Ceo says price of 844 million stg reflects quality of ft and is a good return for shareholders",
        "date": "07232015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BRIEF-Pearson CEO says began internal talks on FT sale a year ago "
    },
    {
        "content": "* Unilever  Kingfisher see improved sales   (Adds detail  closing prices)",
        "date": "07232015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Britain's FTSE edges lower after Aberdeen AM hit by outflows "
    },
    {
        "content": "July 24 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "07242015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "PRESS DIGEST- New York Times business news - July 24 "
    },
    {
        "content": "* Unilever  Kingfisher see improved sales   (Recasts  adds detail  quote)",
        "date": "07232015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Britain's FTSE edges lower after Aberdeen Asset hit by outflows "
    },
    {
        "content": "LONDON  July 23 Japan's Nikkei has agreed to buy the FT Group  publisher of the Financial Times newspaper  from Britain's Pearson for 844 million pounds ($1.31 billion) in cash  the two companies said on Thursday.",
        "date": "07232015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Japan's Nikkei to buy FT Group for $1.3 bln "
    },
    {
        "content": "* It has agreed sale of its PowerSchool business to Vista Equity Partners for a gross consideration of $350 million",
        "date": "06172015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Pearson to sell PowerSchool to Vista Equity for $350 mln "
    },
    {
        "content": "* A committee of board  headed by senior independent director  Vivienne Cox  will select his successor  Source text for Eikon:  Further company coverage:",
        "date": "04242015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "BRIEF-Pearson chairman of over nine years to step down "
    },
    {
        "content": "* Trading in line with expectations set out in our full-year results announcement",
        "date": "04242015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "BRIEF-Pearson ses EPS between 75p-80p for full year "
    },
    {
        "content": "Underlying govt bond    Over Mid-swaps  equivalent to 113.7bp",
        "date": "04292015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "New Issue-Pearson prices 500 mln euro 2025 bond "
    },
    {
        "content": "LONDON  April 16 European equities retreated from 14-year highs on Thursday  led lower by shares in French retailer Casino  which reported slower sales growth  and Pearson  on a report that one of its educational technology projects was in trouble.",
        "date": "04162015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "European shares retreat from multi-year highs  Casino and Pearson dip "
    },
    {
        "content": "* FTSE closes down 0.5 pct at 7 060.45 points     * Index had earlier hit record high of 7 119.35 points     * Pearson hit by report of possible LA contract glitch     * Unilever rises after solid sales     * Rise in gold boosts Fresnillo and Randgold      By Sudip Kar-Gupta     LONDON  April 16 Britain's top share index slipped off record highs on Thursday  with media group Pearson  underperforming after a newspaper report of a glitch in a lucrative contract.     The blue-chip FTSE ",
        "date": "04162015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson penalised as UK's FTSE slips off record high "
    },
    {
        "content": "* FTSE down 0.3 pct after touching record high     * Pearson hit by report of possible LA contract glitch     * Unilever rises after solid sales     * Rise in gold boosts Fresnillo and Randgold      By Sudip Kar-Gupta     LONDON  April 16 Britain's top share index slipped off record highs on Thursday  with media group Pearson  underperforming after a newpaper report of a glitch in a lucrative contract.     The blue-chip FTSE 100 index initially rose to an all-time high of 7 119.35 po",
        "date": "04162015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson lags as UK's FTSE slips off record high "
    },
    {
        "content": "LONDON  April 16 European equities retreated on Thursday  with growing concerns about Greece's debt situation prompting investors to take some profits after the previous session's 14-year highs.",
        "date": "04162015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "European equities retreat from highs on Greek concerns "
    },
    {
        "content": "LONDON  April 16 European equities retreated from a 14-year high on Thursday  with media stocks leading the market lower after Pearson fell sharply following troubles with one of its educational technology projects.",
        "date": "04162015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Media stocks drag down European equities from highs "
    },
    {
        "content": "Endo International Plc's  $11 billion offer this week for Salix Pharmaceuticals Ltd   an effort to trump an agreed $10 billion bid from Valeant Pharmaceutical Inc   illustrates CEO Rajiv De Silva's plan to be seen as not just a protege of Valeant chief Mike Pearson  but as a challenger.",
        "date": "03122015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "Endo's bid for Salix shows its strategy as Valeant challenger "
    },
    {
        "content": "* U.S. college enrolments show improving trend   (Adds CEO quotes)",
        "date": "02272015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "UPDATE 2-Pearson says benefits of restructuring coming through "
    },
    {
        "content": "The Financial Times is changing the way it charges readers for digital access  shaking up the metered model it pioneered almost eight years ago  its chief executive officer said.",
        "date": "02272015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "FT to change the way it charges for digital news "
    },
    {
        "content": "LONDON  Feb 27 British publisher Pearson  reported an as expected 5 percent rise in 2014 underlying adjusted operating profit and reiterated its pledge to return to earnings growth in 2015 as two years of painful restructuring come to an end.",
        "date": "02272015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson posts 5 percent rise in 2014 profit as restructuring ends "
    },
    {
        "content": "LONDON  Jan 21 Britain's blue-chip share index climbed to a six-week high on Wednesday  helped by a rally in energy stocks on the back of stronger oil prices and after a source said the ECB's executive board has proposed buying 50 billion euros in bonds every month.",
        "date": "01212015",
        "name": "Pearson Plc",
        "news_type": "topStory",
        "symbol": "PSO",
        "title": "FTSE hits 6-wk high on firmer oil shares  QE expectations "
    },
    {
        "content": "LONDON  Jan 21 Britain's top share index hit a six-week high on Wednesday  helped by gains for energy stocks following a rise in oil.",
        "date": "01212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "FTSE hits six-week high on strong energy stocks "
    },
    {
        "content": "LONDON  Jan 21 Britain's blue-chip share index climbed to a six-week high on Wednesday  helped by gains for energy companies following a rise in oil prices and by education and media group Pearson which said it expected to return to growth in 2015.",
        "date": "01212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Energy shares lift FTSE to 6-wk high  Pearson leads "
    },
    {
        "content": "LONDON  Jan 21 Britain's FTSE 100 lifted in early deals on Wednesday to a six week-high  rising for a fifth straight day on the back of encouraging corporate reports.",
        "date": "01212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Britain's FTSE hits six week high on encouraging earnings "
    },
    {
        "content": "* Shares up three percent   (Adds analyst comment  share price)",
        "date": "01212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "UPDATE 2-Pearson expects to return to growth this year "
    },
    {
        "content": "LONDON  Jan 21 Britain's Pearson said it expected to grow its earnings in 2015 after solid growth in its North American higher education business helped it bring an end to a turbulent two-year period of restructuring and profit downgrades.",
        "date": "01212015",
        "name": "Pearson Plc",
        "news_type": "normal",
        "symbol": "PSO",
        "title": "Pearson expects to grow in 2015 after solid end to 2014 "
    }
]