[
    {
        "content": "Phillips 66  on Friday wrapped up a strong third quarter for big U.S. oil refiners that saw refining margins rise sharply in the aftermath of Hurricane Harvey.",
        "date": "10272017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 wraps up strong quarter for big U.S. refiners "
    },
    {
        "content": "* Earnings across most Phillips 66 businesses rise (Adds analyst comment; details on Exxon  Chevron results; shares)",
        "date": "10272017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 2-Phillips 66 wraps up strong quarter for big U.S. refiners "
    },
    {
        "content": "Oct 27 Independent U.S. refiner Phillips 66 reported a 61  percent increase in consolidated earnings as refining margins soared in the aftermath of Hurricane Harvey.",
        "date": "10272017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Refiner Phillips 66's 3rd-qtr earnings surge 61 pct "
    },
    {
        "content": "NEW YORK  Oct 23 U.S. refineries from Ohio to Minnesota are capitalizing on access to cheap crude from Western Canada and North Dakota oilfields  helping their region break a historic dependence on fuel from the Gulf Coast while redrawing oil trade maps.",
        "date": "10232017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "U.S. Midwest oil refiners boost output  cut region's dependence on Gulf Coast "
    },
    {
        "content": "* CO AND SQUARE ROBOT TEAM UP TO DEVELOP STORAGE TANK INSPECTION ROBOT​ Source text for Eikon: Further company coverage:",
        "date": "10192017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-PHILLIPS 66   SQUARE ROBOT TEAM UP TO DEVELOP STORAGE TANK INSPECTION ROBOT​ "
    },
    {
        "content": "HOUSTON Phillips 66's  247 000 barrel per day (bpd) Alliance  Louisiana  refinery was undamaged by the passage of Hurricane Nate on Saturday night and may begin restarting some units on Sunday  sources familiar with plant operations said.",
        "date": "10082017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 Alliance refinery undamaged by Hurricane Nate: sources "
    },
    {
        "content": "* Phillips 66 - ‍new $3 billion share repurchase program increases total authorization for share repurchases to $12 billion since Q3 of 2012​ Source text for Eikon: Further company coverage:",
        "date": "10092017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 announces new $3 billion share repurchase program and quarterly dividend "
    },
    {
        "content": "HOUSTON Phillips 66 shut its 247 000-barrel-per-day refinery in Alliance  Louisiana  on Saturday ahead of the approach of Hurricane Nate  sources familiar with plant operations said.",
        "date": "10072017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 shuts Alliance refinery ahead of hurricane: sources "
    },
    {
        "content": "* Chicago Bridge & Iron - awarded contract by Phillips 66 to increase storage capacity at Phillips 66's liquid products terminal in Nederland  Texas​ Source text for Eikon: Further company coverage:",
        "date": "09262017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Chicago Bridge & Iron - awarded contract by Phillips 66 to increase storage capacity in Nederland  Texas​ "
    },
    {
        "content": "Sept 15 Phillips 66 has chartered a Marshall Islands-flagged vessel  making use of a temporary waiver of the Jones Act that was put in place to meet fuel shortages in the wake of hurricanes Harvey and Irma  Argus Media reported on Thursday.",
        "date": "09152017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "U.S. refiner Phillips 66 charters foreign vessel after Jones Act waiver- Argus Media "
    },
    {
        "content": "HOUSTON  Sept 3 U.S. refiner Phillips 66 has requested a Jones Act waiver to allow it to use foreign vessels to move crude or products to and from its 260 000-barrel-per-day Alliance refinery in Louisiana after Hurricane Harvey  the company said on Sunday.",
        "date": "09032017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "U.S. Phillips 66 requests Jones Act waiver after Harvey "
    },
    {
        "content": "NEW YORK  Sept 2 Phillips 66 is preparing to resume operations at its Sweeny refinery as well as its Beaumont terminal in Texas  the company said on Saturday.",
        "date": "09022017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 says preparing to resume ops at Sweeny refinery in Texas "
    },
    {
        "content": "HOUSTON Phillips 66 said on Sunday 600 people were at the 247 000 barrel per day (bpd) Sweeny  Texas  refinery assessing and repairing damage from Tropical Storm Harvey in preparation for restarting the plant.",
        "date": "09032017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 repairing storm damage at Sweeny refinery "
    },
    {
        "content": "HOUSTON A number of key Texas refineries worked to reopen or resume normal operations on Saturday  a week after Hurricane Harvey knocked out nearly one quarter of the U.S. refining capacity and sent gasoline prices to two-year highs.",
        "date": "09032017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Texas refineries begin restart after hit from Harvey "
    },
    {
        "content": "WASHINGTON The U.S. Department of Energy said on Thursday that it was releasing a total of 1 million barrels of oil from the nation's emergency crude reserve in two equal batches to a Phillips 66 refinery in Louisiana after Tropical Storm Harvey shut refineries on the U.S. Gulf Coast.",
        "date": "08312017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Factbox: U.S. oil releases from emergency reserves "
    },
    {
        "content": "HOUSTON  Sept 2 A number of key Texas refineries worked to reopen or resume normal operations on Saturday  a week after Hurricane Harvey knocked out nearly one quarter of the U.S. refining capacity and sent gasoline prices to two-year highs.",
        "date": "09032017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 3-Texas refineries begin restart after hit from Harvey "
    },
    {
        "content": "OSLO  Aug 29 Nordic investors rejected on Tuesday allegations in a lawsuit by the operator of Dakota Access Pipeline (DAPL) that they divested from the project due to pressure from Greenpeace and other environmental groups.",
        "date": "08292017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Nordic investors reject Dakota pipeline operator’s allegations "
    },
    {
        "content": "Aug 14 Venezuela's PDVSA and its joint ventures last month shipped 638 325 barrels per day (bpd) of crude to the United States  a 30 percent increase over June due to larger sales of upgraded oil  according to Thomson Reuters trade flows data.",
        "date": "08142017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Venezuela ships more oil to U.S. in July vs June  but less than yr ago "
    },
    {
        "content": "HOUSTON  Aug 7 U.S. refiners could face a continued squeeze on profit margins in the months ahead as dwindling supplies of heavy crude from Venezuela and elsewhere are leading several to switch to higher-priced but easier-to-refine light  sweet crude.",
        "date": "08072017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Higher-cost crude could squeeze margins at U.S. refiners "
    },
    {
        "content": "HOUSTON Venezuela's supply of heavy crude to U.S. independent refiner Phillips 66 has dropped by more than two-thirds this year in part due to quality problems  and the company has cancelled at least one cargo in recent months  according to sources from state-run oil company PDVSA.",
        "date": "08022017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Exclusive: Venezuelan oil supply to Phillips 66 falls amid quality issues "
    },
    {
        "content": "HOUSTON  Aug 1 Independent U.S. oil refiner Phillips 66 plans to cut its capital expenditure plans for full-year 2017 by \"several hundred million dollars \" company Chief Executive Greg Garland said during a conference call on Tuesday to discuss second-quarter earnings.",
        "date": "08012017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 CEO says to slash 2017 capital expenditure "
    },
    {
        "content": "HOUSTON Independent U.S. oil refiner Phillips 66  processed less heavy crude at its nine refineries in the second quarter due to reduced global supply  Chief Executive Greg Garland said during a conference call with Wall Street analysts on Tuesday.",
        "date": "08012017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 processed less heavy crude in second quarter due to supply issues: CEO "
    },
    {
        "content": "HOUSTON  Aug 1 Independent U.S. oil refiner Phillips 66 processed less heavy crude at its nine refineries in the second quarter due to reduced global supply  Chief Executive Greg Garland said during a conference call with Wall Street analysts on Tuesday.",
        "date": "08012017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 1-Phillips 66 processed less heavy crude in 2nd qtr due to supply issues: CEO "
    },
    {
        "content": "U.S. independent oil refiner Phillips 66 reported a bigger-than-expected rise in quarterly profit helped by strength in its chemicals and refining units.",
        "date": "08012017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Refiner Phillips 66 quarterly profit beats estimates "
    },
    {
        "content": "Aug 1 U.S. independent oil refiner Phillips 66 reported a bigger-than-expected rise in quarterly profit helped by strength in its chemicals and refining units.",
        "date": "08012017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 1-Refiner Phillips 66 quarterly profit beats estimates "
    },
    {
        "content": "* Phillips 66 reports second-quarter earnings of $550 million or $1.06 per share",
        "date": "08012017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 Q2 adjusted earnings per share $1.09 "
    },
    {
        "content": "Aug 1 U.S. independent oil refiner Phillips 66 reported a near 11 percent rise in quarterly profit helped by strength in its chemicals and refining units.",
        "date": "08012017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Refiner Phillips 66 quarterly profit rises 11 pct "
    },
    {
        "content": "* Sets quarterly dividend of $0.70 per share Source text for Eikon: Further company coverage:",
        "date": "07122017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 sets quarterly dividend of $0.70 per share "
    },
    {
        "content": "NEW YORK Refiners from the Midwest United States are fighting for access to a vital Pennsylvania pipeline – a move that could cripple their East Coast competitors and redraw the map for international flows of crude and fuel into coveted coastal markets.",
        "date": "06022017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Pennsylvania pipeline fight could upend international oil flows "
    },
    {
        "content": "NEW YORK  June 2 Refiners from the Midwest United States are fighting for access to a vital Pennsylvania pipeline – a move that could cripple their East Coast competitors and redraw the map for international flows of crude and fuel into coveted coastal markets.",
        "date": "06022017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "INSIGHT-Pennsylvania pipeline fight could upend international oil flows "
    },
    {
        "content": "NEW YORK  June 2 Refiners from the Midwest United States are fighting for access to a vital Pennsylvania pipeline – a move that could cripple their East Coast competitors and redraw the map for international flows of crude and fuel into coveted coastal markets.",
        "date": "06022017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "RPT-INSIGHT-Pennsylvania pipeline fight could upend international oil flows "
    },
    {
        "content": "HOUSTON Declining U.S. demand for transportation fuels will create opportunities for refining industry consolidations through mergers and acquisitions  Phillips 66 Chief Executive Greg Garland said on Wednesday.",
        "date": "05032017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 sees refiner consolidation amid sliding demand: CEO "
    },
    {
        "content": "U.S. independent oil refiner Phillips 66  reported a 39 percent rise in quarterly profit  helped by a $423 million one-time gain from the consolidation of a petroleum coking venture.",
        "date": "04282017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66's profit jumps 39 percent on $423 million gain "
    },
    {
        "content": "* Sees Q2 global olefins & polyolefins utilization at mid-90 pct",
        "date": "04282017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 sees Q2 refining crude utilization at mid-90 pct "
    },
    {
        "content": "* Sees Q2 pre-tax refining turnaround expenses $130 million to $160 million - presentation slides Source text: (http://bit.ly/2pGBY2s) Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "04282017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 sees Q2 pre-tax refining turnaround expenses $130 mln-$160 mln "
    },
    {
        "content": "HOUSTON Phillips 66  expects the Organization of Petroleum Exporting Countries to agree to extend crude oil production cuts at the organization's May 25 meeting  Chief Executive Greg Garland said in a Friday morning conference call.",
        "date": "04282017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 expects OPEC to extend production cuts at May meeting "
    },
    {
        "content": "April 28 U.S. independent oil refiner Phillips 66 reported a 39 percent rise in quarterly profit  helped by a $423 million one-time gain from the consolidation of a petroleum coking venture.",
        "date": "04282017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 1-Phillips 66's profit jumps 39 percent on $423 mln gain "
    },
    {
        "content": "* Phillips 66 reports first-quarter earnings of $535 million or $1.02 per share",
        "date": "04282017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 Q1 earnings per share $1.02 "
    },
    {
        "content": "April 28 U.S. independent oil refiner Phillips 66 reported a 39 percent rise in quarterly profit  helped by a $423 million one-time gain from the consolidation of a petroleum coking venture.",
        "date": "04282017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66's profit jumps 39 percent on $423 mln gain "
    },
    {
        "content": "* Phillips 66 announces open season for West Texas crude oil pipeline system",
        "date": "03162017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 announces open season for West Texas crude oil pipeline system "
    },
    {
        "content": "Feb 28 Warren Buffett's Berkshire Hathaway Inc  will urge shareholders to reject a proposal by a Nebraska nonprofit that it sell its investments in oil refiner Phillips 66 and other companies involved in fossil fuels over 12 years  the nonprofit said on Tuesday.",
        "date": "02282017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Buffett's Berkshire rejects fossil fuel proposal  shareholder says "
    },
    {
        "content": "Feb 18 An explosion and fire at an oil refinery in Torrance  California  on Saturday forced the partial shutdown of the plant  leading oil traders to expect a spike this week in West Coast gasoline prices.",
        "date": "02182017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 2-Fire hits California refinery; local gasoline prices could rise "
    },
    {
        "content": "HOUSTON A gas transmission line and at least two production facilities in the Gulf of Mexico were curtailing operations or shutting on Friday following an onshore fire at Phillips 66's Paradis Pipeline Station in southern Louisiana.",
        "date": "02102017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Some Gulf of Mexico infrastructure shuts after Phillips 66 pipeline fire "
    },
    {
        "content": "* Phillips 66 - Amended by-laws to incorporate a \"proxy access\" by-law  Source text: [http://bit.ly/2ltsqkY] Further company coverage:",
        "date": "02092017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 amended by-laws to incorporate a \"proxy access\" by-law "
    },
    {
        "content": "* Sets quarterly dividend of $0.63/per share  Source text for Eikon:  Further company coverage:",
        "date": "02082017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 sets quarterly dividend of $0.63/per share "
    },
    {
        "content": "HOUSTON  Feb 11 A worker missing since a Thursday night explosion at a Phillips 66 natural gas liquids pipeline station in Louisiana is believed dead  the company said on Saturday.",
        "date": "02122017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Missing worker believed dead in Phillips 66 pipeline blast "
    },
    {
        "content": "CARACAS  Feb 9 Venezuelan state oil company PDVSA has delayed and canceled crude deliveries to commercial partners in recent months  according to documents seen by Reuters  a further sign of the steady production decline of the country's top export.",
        "date": "02092017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Venezuela delays crude shipments amid operational mishaps  low output "
    },
    {
        "content": "HOUSTON Production at Exxon  PBF  Phillips 66 and Motiva refineries in southeast Louisiana were unaffected by severe weather on Tuesday that spawned tornadoes  the companies and Gulf Coast market sources said.",
        "date": "02072017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Production at five Louisiana refineries unaffected by tornadoes "
    },
    {
        "content": "HOUSTON One contract worker remained hospitalized on Saturday after a hydrofluoric acid leak at Phillips 66's Ferndale  Washington  refinery on Friday  the company said in a statement.",
        "date": "02122017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "One worker remains hospitalized from Phillips 66 Ferndale leak "
    },
    {
        "content": "NEW YORK The chief executive of Phillips 66 said on Friday he expects the Dakota Access Pipeline to start operations in the second quarter  even though the project - which has sparked protests by Native Americans and environmentalists - is still in the midst of legal battles and a U.S. regulatory review.",
        "date": "02042017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Dakota Access Pipeline to start in second quarter: stakeholder "
    },
    {
        "content": "NEW YORK  Feb 3 The chief executive of Phillips 66 said on Friday he expects the Dakota Access Pipeline to start operations in the second quarter  even though the project - which has sparked protests by Native Americans and environmentalists - is still in the midst of legal battles and a U.S. regulatory review.",
        "date": "02042017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 2-Dakota Access Pipeline to start in 2nd quarter -stakeholder "
    },
    {
        "content": "NEW YORK  Feb 3 The controversial Dakota Access Pipeline is expected to be completed by the second quarter  Phillips 66 Chief Executive Greg Garland said in the company's earning call.",
        "date": "02032017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Dakota Access Pipeline to be completed by second quarter - Phillips 66 CEO "
    },
    {
        "content": "U.S. independent oil refiner Phillips 66  posted a lower-than-expected quarterly profit as margins were squeezed by the narrowing gap between prices of U.S. crude and refined products.",
        "date": "02032017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66's profit misses on lower refining margins "
    },
    {
        "content": "Feb 3 U.S. independent oil refiner Phillips 66  posted a lower-than-expected quarterly profit as margins were squeezed by the narrowing gap between prices of U.S. crude and refined products.",
        "date": "02032017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 2-Phillips 66's profit misses on lower refining margins "
    },
    {
        "content": "* Phillips 66 reports fourth-quarter earnings of $163 million or $0.31 per share",
        "date": "02032017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 Q4 earnings per share $0.31 "
    },
    {
        "content": "* Phillips 66 qtrly total revenues and other income $23 668 million versus $22 029 million",
        "date": "02032017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 reports Q4 total revenues and other income $23 668 mln vs $22 029 mln "
    },
    {
        "content": "Feb 3 U.S. independent oil refiner Phillips 66  reported a 75 percent fall in quarterly profit as refining margins were hit by the narrowing gap between U.S. crude price and globally-traded Brent crude  to which prices of refined products are tied.",
        "date": "02032017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66's profit falls 75 pct on weak refining margins "
    },
    {
        "content": "Jan 25 Britain's FTSE 100 index is seen opening 13 to 19 points higher  or up as much as 0.3 percent on Wednesday  according to financial bookmakers.           * The UK blue chip index   which touched a three-week low the previous day  had a volatile session after the UK Supreme Court ruled that Prime Minister Theresa May must gain parliament's approval before she begins Britain's formal exit from the European Union. The top share index ended little changed on Tuesday.      * BHP BIL",
        "date": "01252017",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UK Stocks-Factors to watch on Jan 25 "
    },
    {
        "content": "HOUSTON U.S. refiner Phillips 66 on Monday said it would buy crude from the U.S. Strategic Petroleum Reserve (SPR) after submitting a winning bid in an auction held earlier this month by the U.S. Department of Energy.",
        "date": "01232017",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 to buy crude from U.S. Strategic Petroleum Reserve "
    },
    {
        "content": "A Nebraska nonprofit on Friday said it will propose that Warren Buffett's Berkshire Hathaway Inc  sell its investments in oil refiner Phillips 66  and other companies involved in fossil fuels over 12 years.",
        "date": "12022016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Buffett's Berkshire is urged to sell fossil fuel stocks "
    },
    {
        "content": "HOUSTON  Oct 28 Construction is continuing on the Dakota Access Pipeline (DAPL) even as a dispute with Native Americans has blocked work on a section of the project  the chief executive of Phillips 66  which owns 25 percent of the project  said on Friday.",
        "date": "10282016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "RPT-Phillips 66 says construction continues on Dakota Access Pipeline "
    },
    {
        "content": "HOUSTON Construction is continuing on the Dakota Access Pipeline (DAPL) even as a dispute with Native Americans has blocked work on a section of the project  the chief executive of Phillips 66  which owns 25 percent of the project  said on Friday.",
        "date": "10282016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 says construction continues on Dakota Access Pipeline "
    },
    {
        "content": "Phillips 66  reported a better-than-expected quarterly profit on Friday  helped by profitability at two of its midstream units.",
        "date": "10282016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 profit beats on strength in midstream units "
    },
    {
        "content": "HOUSTON U.S. refiners are looking at \"some run cuts\"  for the fourth quarter of 2016  said Phillips 66  Chief Executive Greg Garland during a conference call on Friday to discuss third-quarter results.",
        "date": "10282016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "U.S. refiners looking at 'some run cuts' in fourth-quarter: Phillips 66 CEO "
    },
    {
        "content": "HOUSTON U.S. refiner Phillips 66  said its refineries would run in the low 90 percent range of their combined throughput of 1.8 million barrels per day (bpd) during the fourth quarter of this year  the company said during a conference call to discuss third quarter results.",
        "date": "10282016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 says refineries to run in low 90 percent range "
    },
    {
        "content": "* Shares up slightly in morning trading   (Adds details  analysts comments)",
        "date": "10282016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 2-Phillips 66 profit beats on strength in midstream units "
    },
    {
        "content": "* Phillips 66 - have lowered our forecasted 2016 capital expenditures to approximately $3 billion",
        "date": "10282016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 reports Q3 adjusted eps $1.05 "
    },
    {
        "content": "Oct 28 U.S. refiner Phillips 66 reported a sharp fall in quarterly profit due to lower refining margins  and cut its full-year capital expenditure forecast to about $3 billion.",
        "date": "10282016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 quarterly profit plunges  cuts 2016 capex "
    },
    {
        "content": "HOUSTON/WASHINGTON  Oct 26 The top executive at the company behind the embattled Dakota Access Pipeline has donated more than $100 000 to Republican presidential candidate Donald Trump since June  according to campaign finance disclosure records.",
        "date": "10262016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Top exec behind Dakota Access has donated more than $100 000 to Trump "
    },
    {
        "content": "HOUSTON  Oct 8 North Dakota oil producers were dealt another blow this week when Royal Dutch Shell  said it would scrap plans to build an oil train terminal in Washington state that would have taken over 400 000 barrels per week of Bakken and other inland crudes.",
        "date": "10082016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Crude realities for Bakken oil as Shell ditches W. Coast rail plan "
    },
    {
        "content": "* Sets quarterly dividend of $0.63 per share  Source text for Eikon:  Further company coverage:",
        "date": "10072016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 sets quarterly dividend of $0.63 per share "
    },
    {
        "content": "* Election on Oct. 6  2016  increases total number of Phillips 66 directors to 10",
        "date": "10072016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 board elects Denise Ramos  Gary Adams as independent directors "
    },
    {
        "content": "HOUSTON The U.S. Coast Guard on Wednesday was investigating two oil sheens in the San Francisco Bay area  one of which is in the vicinity of a Phillips 66 refinery  the federal maritime safety agency said.",
        "date": "09222016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "U.S. Coast Guard investigates sheen on bay near San Francisco "
    },
    {
        "content": "HOUSTON Phillips 66 on Wednesday shut a marine terminal at its Rodeo refinery in the San Francisco Bay Area after discovering a light oily sheen on nearby water  a spokesman for the company said by email on Wednesday.",
        "date": "09212016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 shuts San Francisco Bay marine terminal due to oily sheen "
    },
    {
        "content": "* Berkshire Hathaway Inc bought about 1 million shares of Phillips 66 from 12 Sept to 14 Sept - SEC filing",
        "date": "09152016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Berkshire Hathaway bought about 1 mln shares of Phillips 66 from 12 Sept to 14 Sept - SEC filing "
    },
    {
        "content": "NEW YORK  Sept 11 With the U.S. government siding in favor of Native American protests against a key North Dakota pipeline  local oil producers and shippers are facing the possibility of greater delays in getting a quick route to ship oil to the Gulf of Mexico.",
        "date": "09112016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "North Dakota oil pipeline delays could hit producers  shippers "
    },
    {
        "content": "HOUSTON Phillips 66 shut a gasoline-making reformer unit at its 260 000 barrel-per-day Westlake  Louisiana refinery earlier this month  and advanced planned work on the unit  two sources familiar with the work said on Wednesday.",
        "date": "08242016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 shuts gasoline-producing unit at Westlake refinery: sources "
    },
    {
        "content": "* Energy Transfer  Sunoco Logistics  and Phillips 66 announce binding supplemental open season for Bakken pipeline transport",
        "date": "08172016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Energy Transfer  Sunoco Logistics and Phillips 66 announce binding supplemental open season for Bakken pipeline transport "
    },
    {
        "content": "HOUSTON  Aug 15 A fire that started in a processing unit on Monday at Phillips 66's 260 000 barrel per day Lake Charles refinery in Louisiana has been put out with no injuries reported  an emergency management official said.",
        "date": "08152016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "UPDATE 3-Fire at Phillips 66 Louisiana refinery out  no injuries "
    },
    {
        "content": "* Chase  Phillips 66 have signed multi-year agreement for Phillips 66 to accept Chase pay at Phillips 66  Conoco  76 branded locations across U.S.  Source text for Eikon:  Further company coverage:",
        "date": "08172016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-JPMorgan Chase signs Phillips 66 to accept Chase pay "
    },
    {
        "content": "HOUSTON A fire that started in a processing unit on Monday at Phillips 66's 260 000 barrel per day Lake Charles refinery in Louisiana  has been put out with no injuries reported  an emergency management official said.",
        "date": "08152016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Fire at Phillips 66 Louisiana refinery out  no injuries: official "
    },
    {
        "content": "* Energy Transfer  Sunoco Logistics and Phillips 66 announce successful completion of project financing for Bakken Pipeline Joint Ventures",
        "date": "08022016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Energy Transfer  Sunoco Logistics  Phillips 66 complete Bakken Pipeline financing "
    },
    {
        "content": "HOUSTON/NEW YORK The long-planned and oft-delayed Sandpiper pipeline through the U.S. Midwest may not be dead  but it appears to be on life support  a likely casualty of the oil-and-gas industry's infrastructure overbuild amid a two-year global oil rout.",
        "date": "08042016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Enbridge's Sandpiper looks to be latest victim of pipeline overbuild "
    },
    {
        "content": "MONTREAL/NEW YORK  Aug 3 Irving Oil said on Wednesday it agreed to buy Ireland's only refinery from Phillips 66  scooping it up at a discount in a deal that will extend the Canadian company's reach across the Atlantic.",
        "date": "08032016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "UPDATE 1-Canada's Irving Oil to buy Irish refinery from Phillips 66 "
    },
    {
        "content": "HOUSTON/NEW YORK  Aug 4 The long-planned and oft-delayed Sandpiper pipeline through the U.S. Midwest may not be dead  but it appears to be on life support  a likely casualty of the oil-and-gas industry's infrastructure overbuild amid a two-year global oil rout.",
        "date": "08042016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "CORRECTED-RPT-Enbridge's Sandpiper looks to be latest victim of pipeline overbuild "
    },
    {
        "content": "HOUSTON/NEW YORK  Aug 4 The long-planned and oft-delayed Sandpiper pipeline through the U.S. Midwest may not be dead  but it appears to be on life support  a likely casualty of the oil-and-gas industry's infrastructure overbuild amid a two-year global oil rout.",
        "date": "08042016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "CORRECTED-Enbridge's Sandpiper looks to be latest victim of pipeline overbuild "
    },
    {
        "content": "Aug 3 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "08032016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "VANCOUVER Enbridge Inc  said on Tuesday it had formed a joint venture with Marathon Petroleum Corp  to take a minority stake in a holding company that owns 75 percent of the Bakken Pipeline System.",
        "date": "08032016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Enbridge  Marathon take minority stake in Bakken pipeline "
    },
    {
        "content": "Phillips 66  joined larger rival Valero Energy Corp  in saying that refiners are expected to process less crude in the second half of the year as margins shrink due to a gasoline glut.",
        "date": "07292016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 says refiners to cut production as margins shrink "
    },
    {
        "content": "VANCOUVER  Aug 2 Enbridge Inc said on Tuesday it had formed a joint venture with Marathon Petroleum Corp to take a minority stake in a holding company that owns 75 percent of the Bakken Pipeline System.",
        "date": "08032016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "CORRECTED-Enbridge  Marathon take minority stake in Bakken pipeline "
    },
    {
        "content": "* Shares fall as much as 3.2 pct   (Adds CEO comment  updates shares)",
        "date": "07292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 4-Phillips 66 says refiners to cut production as margins shrink "
    },
    {
        "content": "* Expects 2017 share repurchases to be between $1 billion and $2 billion  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 sees 2017 share buybacks of $1 bln-$2 bln "
    },
    {
        "content": "MONTREAL  Aug 3 Irving Oil said on Wednesday it agreed to buy Ireland's only refinery from Phillips 66  a deal that will extend the Canadian company's reach across the Atlantic.",
        "date": "08032016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Canada's Irving Oil to buy Irish refinery from Phillips 66 "
    },
    {
        "content": "* Transaction is expected to close by end of q3 once all conditions of sale have been met",
        "date": "08032016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Irving oil says reached agreement with Phillips 66 to acquire Whitegate refinery "
    },
    {
        "content": "* Sees Q3 global Olefins & Polyolefins utilization in mid-90 percent - earnings conference call",
        "date": "07292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 sees Q3 refining crude utilization at mid-90 pct "
    },
    {
        "content": "HOUSTON Phillips 66  Chief Executive Greg Garland said during a Friday morning conference call that U.S. refiners would face production cuts in the second half of 2016 due to a glut of motor fuel supply.",
        "date": "07292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 CEO says U.S. refiners face production cuts in second half of 2016 "
    },
    {
        "content": "* Refining's adjusted earnings were $152 million in q2  compared with $86 million in q1 of 2016",
        "date": "07292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 reports Q2 earnings of $0.93 per share "
    },
    {
        "content": "July 29 U.S. refiner Phillips 66's  quarterly profit more than halved as earnings from its refining business were compressed by record supplies of gasoline and diesel.",
        "date": "07292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "U.S. refiner Phillips 66 reports 51 pct fall in quarterly profit "
    },
    {
        "content": "* Sets quarterly dividend of $0.63 per share  Source text for Eikon:  Further company coverage:",
        "date": "07132016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 sets quarterly dividend of $0.63/shr "
    },
    {
        "content": "NEW YORK  June 3 U.S. diesel futures have soared about 40 percent in the last two months  prompting independent refiners to pounce  selling future output on the view that resurgent domestic demand and higher exports may turn out to provide only a brief boost.",
        "date": "06032016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "As diesel price soars  U.S. refiners seize the moment  sell future output "
    },
    {
        "content": "LONDON  May 21 U.S. independent refiner Phillips 66 is in the final stages of selling the only oil refinery in Ireland  a source familiar with negotiations said on Saturday.",
        "date": "05212016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 in final stages of selling Ireland's only oil refinery - sources "
    },
    {
        "content": "* Berkshire Hathaway bought about 824 000 shares of Phillips 66 from 19 May to 23 May  raises stake to 76.37 million shares - SEC filing    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05242016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Berkshire Hathaway buys about 824 000 shares of Phillips 66 "
    },
    {
        "content": "LONDON U.S. energy group Phillips 66  is in the final stages of selling the only oil refinery in Ireland  a source familiar with negotiations said on Saturday. ",
        "date": "05222016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 in final stages of selling Ireland's only oil refinery: sources "
    },
    {
        "content": "LONDON  May 21 U.S. energy group Phillips 66  is in the final stages of selling the only oil refinery in Ireland  a source familiar with negotiations said on Saturday.",
        "date": "05222016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 2-Phillips 66 in final stages of selling Ireland's only oil refinery - sources "
    },
    {
        "content": "* Berkshire hathaway inc ups share stake in phillips 66 by 22.9 percent to 75.6 million shares",
        "date": "05162016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Berkshire Hathaway ups share stake in Phillips 66  Bank of New York Mellon "
    },
    {
        "content": "* Phillips 66 announces 12.5 percent increase in quarterly dividend",
        "date": "05042016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 increases quarterly dividend by 12.5 pct "
    },
    {
        "content": "HOUSTON  April 29 Independent refiner Phillips 66 is looking to a buoyant  summer driving season and distillate export demand to lift profits squashed by swollen inventories and dismal margins in the first quarter  executives told analysts on Friday.",
        "date": "04292016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "UPDATE 1-Phillips 66 expects better gasoline margins in summer "
    },
    {
        "content": "U.S. refiner Phillips 66  reported a weaker-than-expected quarterly profit  hurt by lower margins for gasoline and other refined products.",
        "date": "04292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66's profit misses as margins shrink "
    },
    {
        "content": "HOUSTON Independent refiner Phillips 66  is seeing better gasoline margins in the second quarter after low margins and glutted stocks hurt profits in the first three months of 2016  executives told analysts on Friday.",
        "date": "04292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 expects better gasoline margins in summer driving season "
    },
    {
        "content": "* Sees Q2 refining crude utilization of mid 90 percent; sees Q2 global olefins & polyolefins utilization  of low 90 percent",
        "date": "04292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 targets another dividend increase of at least 10 pct this year "
    },
    {
        "content": "* Reports First Quarter earnings of $385 million or $0.72 per share",
        "date": "04292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 reports Q1 adjusted earnings per share $0.67 "
    },
    {
        "content": "NEW YORK  April 20 Phillips 66 has purchased a cargo of Algerian crude oil for its Bayway refinery in New Jersey for the first time since 2013  two sources said  the latest U.S. refiner on the East Coast to shun domestic crudes in favor of cheaper imports.",
        "date": "04202016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "RPT-Once a mainstay  Algerian crude returns to U.S. East Coast "
    },
    {
        "content": "NEW YORK  April 20 Phillips 66 has purchased a cargo of Algerian crude oil for its Bayway refinery in New Jersey for the first time since 2013  two sources said  the latest U.S. refiner on the East Coast to shun domestic crudes in favor of cheaper imports.",
        "date": "04202016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Once a mainstay  Algerian crude returns to U.S. East Coast "
    },
    {
        "content": "NEW YORK  April 5 The sudden closure of the Keystone oil pipeline from Canada has forced Phillips 66  to shut several units at its Illinois refinery  sources said on Tuesday  as the ripple effects of disrupting one of the largest U.S. import lines spread.",
        "date": "04052016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "UPDATE 3-Keystone oil pipeline closure forces Illinois refinery outage "
    },
    {
        "content": "* Cfo greg maxwell's 2015 total compensation was $5.4 million versus $4.6 in 2014 - sec filing",
        "date": "03252016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 CEO Garland's 2015 total compensation $22.9 mln "
    },
    {
        "content": "* Says names Timothy Roberts executive vice president  strategy and business development  effective april 4  2016  Further company coverage:",
        "date": "03232016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-Phillips 66 names Timothy Roberts executive vice president "
    },
    {
        "content": "* Likely sold cargo to TonenGeneral for May arrival   (Adds Phillips 66 actively offering U.S. crude to Asia  other details)",
        "date": "03162016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "UPDATE 1-Japan to import US crude in May  2nd cargo since export ban lifted -sources "
    },
    {
        "content": "NEW YORK/HOUSTON  Feb 10 U.S. refiner Phillips 66 dumped crude for immediate delivery in Cushing  Oklahoma on Wednesday  sparking speculation that the move reflected advance warning of looming output cuts amid sluggish winter demand and record inventories.",
        "date": "02112016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "RPT--As U.S. refiner Phillips 66 dumps Cushing crude  traders spy output cuts "
    },
    {
        "content": "NEW YORK/HOUSTON  Feb 10 U.S. refiner Phillips 66 dumped crude for immediate delivery in Cushing  Oklahoma on Wednesday  sparking speculation that the move reflected advance warning of looming output cuts amid sluggish winter demand and record inventories.",
        "date": "02112016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "As U.S. refiner Phillips 66 dumps Cushing crude  traders spy output cuts "
    },
    {
        "content": "Berkshire Hathaway Inc  has bought an additional $1 billion of stock in Phillips 66  this year  and now owns roughly 14.1 percent of the oil refiner.",
        "date": "02102016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Buffett's Berkshire buys $1 billion worth of Phillips 66 stock in 2016 "
    },
    {
        "content": "Feb 10 Berkshire Hathaway Inc has bought an additional $1 billion of stock in Phillips 66  this year  and now owns roughly 14.1 percent of the oil refiner.",
        "date": "02102016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Buffett's Berkshire buys $1 bln worth of Phillips 66 stock in 2016 "
    },
    {
        "content": "Phillips 66 said on Tuesday it was planning to modernize the Fluid Catalytic Cracking (FCC) unit at the Bayway refinery in Linden  New Jersey.",
        "date": "02032016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 to modernize FCC at Bayway  New Jersey refinery "
    },
    {
        "content": "* Warren Buffett says acquired 1.69 million shares of Phillips 66 in multiple transactions at prices ranging from $76.79 to $78.60 - SEC Filing",
        "date": "02042016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "BRIEF-(Feb. 3)-Warren Buffett says acquired 1.69 mln shares of Phillips 66 "
    },
    {
        "content": "* Shares fall 4 pct in morning trading   (Adds details on first dividend cut in 25 years)",
        "date": "02042016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 3-Conoco cuts dividend for first time in 25 years on crude crash "
    },
    {
        "content": "Jan 30 Berkshire Hathaway Inc  the conglomerate run by Warren Buffett  has resumed its purchases of Phillips 66 stock  and spent roughly $832 million in January to boost its stake even as the oil refiner's profit margins narrowed.",
        "date": "01302016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Berkshire resumes buying Phillips 66 stock "
    },
    {
        "content": "HOUSTON  Jan 29 Phillips 66 may consider increasing its 25 percent stake in Energy Transfer Partners'  pipeline project to move North Dakota Bakken oil to Illinois and Texas  but likes its current commitment as is  President Tim Taylor told analysts on Friday.",
        "date": "01292016",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "UPDATE 1-Phillips 66 may consider higher stake in Bakken pipeline project "
    },
    {
        "content": "HOUSTON  Jan 26 County planners want to squash Phillips 66's proposal to transport heavy crude by rail to one of its California refineries  saying it is too risky to public health and the environment.",
        "date": "01262016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "California county planners oppose Phillips 66 oil-by-rail project "
    },
    {
        "content": "U.S. refiner Phillips 66  reported a better-than-expected quarterly profit  helped by robust gasoline margins due to lower crude costs.",
        "date": "01292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 reports better-than-expected profit "
    },
    {
        "content": "HOUSTON U.S. oil producers  refiners and logistics companies have dozens of crude-by-rail project throughout the United States  although U.S. crude movements via rail retreated to 785 143  barrels per day in the third quarter of 2015 from more than 1 million bpd in the second half of 2014.",
        "date": "01262016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Factbox: U.S. crude-by-rail projects; Hearings set on Phillips 66  Valero projects "
    },
    {
        "content": "HOUSTON Phillips 66  may consider increasing its 25 percent stake in Energy Transfer Partners' pipeline project to move North Dakota Bakken oil to Illinois  but the company's current commitment \"is where we would like it to be at this point \" President Tim Taylor told analysts on Friday.",
        "date": "01292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 may consider higher stake in Bakken pipeline project "
    },
    {
        "content": "Jan 29 U.S. refiner Phillips 66 reported a better-than-expected quarterly profit  helped by robust gasoline margins due to lower crude costs.",
        "date": "01292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 1-U.S. refiner Phillips 66 reports better-than-expected profit "
    },
    {
        "content": "Jan 29 U.S. refiner Phillips 66 reported a 43 percent fall in quarterly profit  hurt by lower earnings from its midstream and chemicals businesses.",
        "date": "01292016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "U.S. refiner Phillips 66's profit plunges 43 pct "
    },
    {
        "content": "Jan 14 Warren Buffett is expanding his bet on the oil industry  slowly adding to his already large stake in oil refiner Phillips 66 even as crude oil prices have sunk to a 12-year low.",
        "date": "01142016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Buffett expands oil bet  buys more Phillips 66 "
    },
    {
        "content": "* Says bought about 5.1 mln shares of Phillips 66  between Jan. 4 and Jan. 11",
        "date": "01142016",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "BRIEF-Berkshire buys 5.1 mln shares of Phillips 66 in a week "
    },
    {
        "content": "HOUSTON  Dec 21 Pacific Northwest gasoline prices were bid and offered higher on Monday following a fire over the weekend at Phillips 66's refinery in Ferndale  Washington.",
        "date": "12212015",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "UPDATE 1-Fire at Phillips 66's Ferndale  Washington refinery supports gasoline "
    },
    {
        "content": "U.S. refiner Phillips 66  reported a 34 percent rise in quarterly profit  as cheaper crude oil boosted gasoline refining margins amid buoyant demand.",
        "date": "10302015",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Refiner Phillips 66's profit up 34 percent on higher gasoline demand "
    },
    {
        "content": "Oct 30 U.S. refiner Phillips 66 reported a 34 percent rise in quarterly profit  as cheaper crude oil boosted gasoline refining margins amid buoyant demand.",
        "date": "10302015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Refiner Phillips 66's profit up 34 pct on higher gasoline demand "
    },
    {
        "content": "U.S. refiner Phillips 66 set a lower capital budget for 2016 and raised its share buyback plan.",
        "date": "10122015",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 lowers 2016 capex  boosts share buyback "
    },
    {
        "content": "Oct 12 U.S. refiner Phillips 66 set a lower capital budget for 2016 and raised its share buyback plan.",
        "date": "10122015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 2-Phillips 66 lowers 2016 capex  boosts share buyback "
    },
    {
        "content": "Oct 12 U.S. refiner Phillips 66  announced a capital budget of $3.6 billion for 2016 and raised its share buyback plan by $2 billion.",
        "date": "10122015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Phillips 66 plans $3.6 bln 2016 capex  raises share buyback "
    },
    {
        "content": "Warren Buffett's Berkshire Hathaway Inc said it has purchased another 3.5 million shares of Phillips 66  bringing its total stake in the U.S. refiner to 11.4 percent.",
        "date": "09102015",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Berkshire Hathaway buys 3.51 million shares of Phillips 66 "
    },
    {
        "content": "Sept 9 Warren Buffett's Berkshire Hathaway Inc  said it has purchased another 3.5 million shares of Phillips 66  bringing its total stake in the U.S. refiner to 11.4 percent.",
        "date": "09102015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Berkshire Hathaway buys 3.51 mln shares of Phillips 66 "
    },
    {
        "content": "* Indexes finish down: Dow 0.69 pct  S&P 0.84 pct  Nasdaq 1.07 pct   (Updates to close)",
        "date": "08312015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "US STOCKS-Wall Street's worst month in 3 years ends on a sour note "
    },
    {
        "content": "Aug 29 Warren Buffett's Berkshire Hathaway Inc  disclosed a $4.48 billion stake in oil refiner Phillips 66  rebuilding a bet it had made in the energy industry before oil prices fell.",
        "date": "08292015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Buffett's Berkshire takes $4.48 billion stake in Phillips 66 "
    },
    {
        "content": "* Indexes down: Dow 0.76 pct  S&P 0.85 pct  Nasdaq 0.97 pct   (Updates to afternoon)",
        "date": "08312015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "US STOCKS-Wall Street falls as investors fret about rate-hike timing "
    },
    {
        "content": "May 10 Phillips 66 shares could rise another 15 percent in the coming months based on strong earnings and growth potential at the oil refiner  Barron's financial newspaper said in its latest issue  citing analysts.",
        "date": "05102015",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 shares poised to rise another 15 pct -Barron's "
    },
    {
        "content": "BOSTON  March 9 U.S. oil refiner Phillips 66  cut by 35 percent what it paid Chief Executive Greg Garland last year under its bonus plan  citing market conditions and stock performance.",
        "date": "03092015",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Phillips 66 cuts CEO bonus after 2014 share decline "
    },
    {
        "content": "SAN FRANCISCO Environmentalists in California filed a lawsuit on Wednesday against Contra Costa County over its approval last month of a plan to increase propane recovery at Phillips 66's Rodeo refinery  saying the environmental review did not take into account the broader impact of the project.",
        "date": "03042015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Environmentalists file suit over California oil refinery project "
    },
    {
        "content": "SAN FRANCISCO  March 4 Environmentalists in California filed a lawsuit on Wednesday against Contra Costa County over its approval last month of a plan to increase propane recovery at Phillips 66's Rodeo refinery  saying the environmental review did not take into account the broader impact of the project.",
        "date": "03042015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 1-Environmentalists file suit over California oil refinery project "
    },
    {
        "content": "U.S. refiners Valero Energy Corp  and Phillips 66  reported better-than-expected quarterly profits as they processed more cheap crude oil amid buoyant demand for gasoline.",
        "date": "01292015",
        "name": "Phillips 66",
        "news_type": "topStory",
        "symbol": "PSX",
        "title": "Cheap crude helps Valero  Phillips 66 profits beat estimates "
    },
    {
        "content": "Jan 29 U.S. refiners Valero Energy Corp  and Phillips 66 reported better-than-expected quarterly profits as they processed more cheap crude oil amid buoyant demand for gasoline.",
        "date": "01292015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "UPDATE 2-Cheap crude helps Valero  Phillips 66 profits beat estimates "
    },
    {
        "content": "Jan 29 U.S. refiner Phillips 66 reported a 39 percent jump in quarterly profit  helped by a gain from asset dispositions and strong margins in its marketing and specialties business.",
        "date": "01292015",
        "name": "Phillips 66",
        "news_type": "normal",
        "symbol": "PSX",
        "title": "Refiner Phillips 66 profit jumps 39 pct "
    }
]