[
    {
        "content": "* Larger teapots run at full capacity to meet domestic demand",
        "date": "11162017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China's oil refiners rush to cash in on bumper profits "
    },
    {
        "content": "* Efforts will lift Caofeidian's capacity to 1.28 mln cubic metres",
        "date": "11062017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina  Beijing firm doubling LNG storage in Caofeidian as demand rises "
    },
    {
        "content": "* In unusual move  LNG spot prices jump above oil-linked prices",
        "date": "11032017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "GRAPHIC-As China faces winter gas crunch  LNG prices soar "
    },
    {
        "content": "BEIJING China National Petroleum Corp (CNPC) plans to reduce natural gas supplies to industrial users as it expects shortages this winter after millions of residential households were switched to gas for heating under a government program to reduce pollution.",
        "date": "11062017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "CNPC plans to cut gas supplies to industrial users-state media "
    },
    {
        "content": "BEIJING  Nov 6 China National Petroleum Corp (CNPC) plans to reduce natural gas supplies to industrial users as it expects shortages this winter after millions of residential households were switched to gas for heating under a government programme to reduce pollution.",
        "date": "11062017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 2-CNPC plans to cut gas supplies to industrial users-state media "
    },
    {
        "content": "BEIJING  Oct 30 China's largest oil and gas producer PetroChina reported on Monday a leap in third-quarter net profit on rebounding crude prices and deleveraging.",
        "date": "10302017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina's Q3 net profit leaps "
    },
    {
        "content": "* New alliance to have 1 mln bpd crude oil import quotas -exec",
        "date": "09082017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 1-China's teapot plants form new club to beat rivals  but will it work? "
    },
    {
        "content": "* New alliance to have 1 mln bpd crude oil import quotas -exec",
        "date": "09082017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China's teapot plants form new club to beat rivals  but will it work? "
    },
    {
        "content": "NEW YORK A flurry of departures across the U.S. and Canadian units of Chinese state energy firm PetroChina Co Ltd  have sparked speculation that the oil trader is reducing its presence in North America  even though the company says it is committed to the region.",
        "date": "08232017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "North American exodus at PetroChina sparks speculation of company shift "
    },
    {
        "content": "NEW YORK  Aug 23 A flurry of departures across the U.S. and Canadian units of Chinese state energy firm PetroChina Co Ltd have sparked speculation that the oil trader is reducing its presence in North America  even though the company says it is committed to the region.",
        "date": "08232017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 1-North American exodus at PetroChina sparks speculation of company shift "
    },
    {
        "content": "NEW YORK  Aug 22 A flurry of departures across the U.S. and Canadian units of Chinese state energy firm PetroChina Co Ltd have sparked speculation that the oil trader is reducing its presence in North America  even though the company says it is committed to the region.",
        "date": "08232017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "REFILE-North American exodus at PetroChina sparks speculation of company shift "
    },
    {
        "content": "BEIJING PetroChina's refinery  gas fields and pipelines have not been affected by the Sichuan earthquake  a spokesman said on Wednesday.",
        "date": "08092017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "Petrochina's refinery  gas fields and pipelines unaffected by Sichuan quake "
    },
    {
        "content": "* Saudi Aramco is in talks to buy Petrochina refinery stake- WSJ  citing sources",
        "date": "08042017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "BRIEF-Saudi Aramco in talks to buy Petrochina refinery stake- WSJ  citing sources "
    },
    {
        "content": "SINGAPORE PetroChina is this week unloading the first Chinese purchase of crude oil from U.S. strategic petroleum reserves at a port in eastern China  according to shipping data and two industry sources.",
        "date": "07202017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina unloading first Chinese purchase of oil from U.S. strategic reserves: shipping data "
    },
    {
        "content": "SINGAPORE  July 20 PetroChina is this week unloading the first Chinese purchase of crude oil from U.S. strategic petroleum reserves at a port in eastern China  according to shipping data and two industry sources.",
        "date": "07202017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina unloading first Chinese purchase of oil from US strategic reserves -shipping data "
    },
    {
        "content": "BEIJING/SINGAPORE  July 11 China has opened more than 6 000 trading accounts for its long-awaited crude futures contract - with three-quarters coming from individual traders - as it pushes ahead with plans to compete with global pricing benchmarks.",
        "date": "07112017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China sets sights on oil benchmark after years of delays "
    },
    {
        "content": "BEIJING  June 1 Li Chuang  former head of crude oil trading at Chinese state energy giant PetroChina Co Ltd has joined Geneva-based independent commodities trading house Mercuria as Asia head of its crude oil business  trading sources briefed on Li's move said.",
        "date": "06012017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "Ex-PetroChina top oil trader joins Mercuria to lead crude in Asia "
    },
    {
        "content": "MELBOURNE Arrow Energy  owned by Royal Dutch Shell and PetroChina  has been granted a license to build a natural gas pipeline in Australia's Queensland state that could contribute to easing the country's gas supply crunch.",
        "date": "05012017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "Arrow Energy wins Australian gas pipeline license  but plan on hold "
    },
    {
        "content": "BEIJING  April 7 China's largest oil and gas producer  PetroChina  said on Friday it expected a first-quarter profit of 5-6 billion yuan ($724.8-$869.8 million)  down slightly from the preceding quarter  but a turnaround from a huge loss a year earlier.",
        "date": "04072017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina sees lower Q1 profit on qtr  but turnaround from yr ago "
    },
    {
        "content": "BEIJING PetroChina   will consider taking part in national oil giant Saudi Aramco's initial public offering based on market conditions  it said on Thursday  the second Chinese oil major to discuss becoming an investor this week.",
        "date": "03302017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina latest China oil major to consider Aramco listing "
    },
    {
        "content": "BEIJING  March 30 PetroChina will consider taking part in national oil giant Saudi Aramco's initial public offering based on market conditions  it said on Thursday  the second Chinese oil major to discuss becoming an investor this week.",
        "date": "03302017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 1-PetroChina latest China oil major to consider Aramco listing "
    },
    {
        "content": "* PetroChina 2016 profit falls nearly 80 pct y/y to 7.86 bln yuan",
        "date": "03302017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 1-PetroChina 2016 profit sinks 78 pct on lower crude prices "
    },
    {
        "content": "BEIJING  March 30 PetroChina said on Thursday it will consider taking part in national oil giant Saudi Aramco's initial public offering based on market conditions  the second Chinese oil major to discuss becoming an investor this week.",
        "date": "03302017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina says will consider Aramco IPO based on market conditions "
    },
    {
        "content": "BEIJING  March 30 China's largest oil and gas producer  PetroChina   on Thursday reported a drop of 78 percent in 2016 annual net profit  to its lowest since at least 2011  hit by lower prices for crude oil and natural gas.",
        "date": "03302017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "REFILE-PetroChina 2016 profit sinks 78 pct on lower crude prices "
    },
    {
        "content": "BEIJING  March 22 The head of crude oil trading at Chinese state energy giant PetroChina has resigned after 20 years with the company  a rare departure from a state-owned enterprise known for retaining talent in the midst of rapid expansion.",
        "date": "03222017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina's head of crude oil trading resigns，replaced by deputy "
    },
    {
        "content": "* Expects refined oil products markets to balance by mid-2018",
        "date": "02282017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "Aramco's Malaysia deal gives Saudis upper hand in fight for Asia oil share "
    },
    {
        "content": "BEIJING China's biggest energy giant PetroChina aims to achieve sales of 150 billion cubic meters of natural gas this year  up from about 140 billion in 2016  state-run China Energy News said on Saturday.",
        "date": "02112017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina aims for 7 percent boost in 2017 natural gas sales on year: paper "
    },
    {
        "content": "BEIJING  Jan 26 China's oil majors are expected to pump up spending in 2017 for the first time in years  scrambling to squeeze more barrels of crude out of ageing domestic wells in the hope that higher prices are here to stay.",
        "date": "01262017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "As crude prices rise  China's oil majors set to lift capex for first time in years "
    },
    {
        "content": "BEIJING A Chinese court on Thursday jailed the former vice chairman of oil giant PetroChina for 15 years after finding him guilty of corruption  the latest official to be brought down in a sweeping crackdown on graft.",
        "date": "01192017",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "China jails former senior oil executive for 15 years for graft "
    },
    {
        "content": "BEIJING  Jan 19 A Chinese court on Thursday jailed the former vice chairman of oil giant PetroChina   for 15 years after finding him guilty of corruption  the latest official to be brought down in a sweeping crackdown on graft.",
        "date": "01192017",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 1-China jails former senior oil executive for 15 years for graft "
    },
    {
        "content": "HOUSTON China's trading firm PetroChina was awarded a tender to sell up to 1.65 million barrels of U.S. light crude to Venezuela's state-run PDVSA for delivery in the coming weeks at a terminal in Curacao  traders said on Monday.",
        "date": "12122016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina wins U.S. crude tender to sell to PDVSA: traders "
    },
    {
        "content": "BEIJING  Oct 28 PetroChina Co Ltd  reported sharply lower profits for the third quarter as weaker crude prices eroded margins at China's largest oil and gas producer.",
        "date": "10282016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "UPDATE 1-PetroChina reports lower Q3 profit on weak oil prices "
    },
    {
        "content": "BEIJING  Oct 28 PetroChina Co Ltd  reported sharply lower profits for the third quarter as weaker crude prices versus year-ago levels eroded margins at the country's largest oil and gas producer.",
        "date": "10282016",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina posts lower Q3 profit on weak oil prices "
    },
    {
        "content": "BEIJING Kunlun Energy Co Ltd has resumed or was in the process of resuming production at seven liquefied natural gas (LNG) plants  including China's largest  to meet upcoming winter demand  its parent PetroChina said on Tuesday.",
        "date": "10252016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina's Kunlun Energy reopens top LNG plant to meet winter demand "
    },
    {
        "content": "BEIJING/YANGON A newly built Chinese refinery near its border with Myanmar is facing a delayed start-up after state firm PetroChina balked at paying an extra tax for piping crude oil through the Southeast Asian nation  two senior Chinese industry sources said.",
        "date": "10102016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "New China refinery faces delay as Myanmar seeks extra oil tax: sources "
    },
    {
        "content": "BEIJING/YANGON  Oct 10 A newly built Chinese refinery near its border with Myanmar is facing a delayed start-up after state firm PetroChina balked at paying an extra tax for piping crude oil through the Southeast Asian nation  two senior Chinese industry sources said.",
        "date": "10102016",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "New China refinery faces delay as Myanmar seeks extra oil tax -sources "
    },
    {
        "content": "BEIJING Chinese prosecutors have indicted Xu Jianyi  the former chairman of state-owned FAW Group Corp  on corruption charges  the official Xinhua news agency said on Wednesday.",
        "date": "09142016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "China charges former senior PetroChina  FAW Group officials with graft: Xinhua "
    },
    {
        "content": "BEIJING  Sept 14 Chinese prosecutors have indicted Xu Jianyi  the former chairman of state-owned FAW Group Corp  on corruption charges  the official Xinhua news agency said on Wednesday.",
        "date": "09142016",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China charges former senior PetroChina  FAW Group officials with graft-Xinhua "
    },
    {
        "content": "* China-listed companies post 5.5 pct drop in combined earnings",
        "date": "08312016",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China stocks firm on company earnings  National Team; Hong Kong flat "
    },
    {
        "content": "BEIJING  Aug 24 PetroChina Co Ltd  the country's largest oil and gas producer  reported sharply lower profits for the first half of the year  hit by slowing demand growth for refined products as well as weak crude oil and natural gas prices.",
        "date": "08242016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "UPDATE 1-PetroChina profits sink as weak prices  oversupply bite "
    },
    {
        "content": "BEIJING  Aug 24 PetroChina Co Ltd  the country's largest oil and gas producer  reported sharply lower profits for the first half of the year  hit by slowing demand growth for refined products  an oversupply of crude and weak prices.",
        "date": "08242016",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "Petrochina profits sink as weak prices  oversupply bite "
    },
    {
        "content": "BEIJING  Aug 1 China  the world's third-largest natural gas consumer  is planning to lower distribution prices for gas  part of anticipated sector reforms to boost use of the cleaner-burning fuel  state media reported.",
        "date": "08012016",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China eyes gas distribution price cut to boost consumption -state media "
    },
    {
        "content": "June 13 Beijing Jiaxun Feihong Electrical Co.  Ltd. :",
        "date": "06132016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "BRIEF-Beijing Jiaxun Feihong Electrical wins bid of PetroChina "
    },
    {
        "content": "May 31 Bluedon Information Security Technologies Co Ltd",
        "date": "05312016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "BRIEF-Bluedon's unit sign deal on online services at Petrochina's Guangdong petrol kiosks "
    },
    {
        "content": "* Iraq allocates 5 mln bbls more Basra Light to partners in June",
        "date": "05302016",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "Iraq joins Mideast rivals raising oil exports ahead of OPEC meeting "
    },
    {
        "content": "HONG KONG PetroChina Co Ltd  the country's largest oil and gas producer  on Thursday reported its first ever quarterly loss as oil prices touched near 13-year lows  and forecast continued volatility in the market.",
        "date": "04282016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina posts first quarterly loss as oil prices weigh "
    },
    {
        "content": "* PetroChina Q1 loss 13.79 bln yuan vs 6.15 bln yuan gain yr ago",
        "date": "04282016",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 1-PetroChina posts first quarterly loss as oil prices weigh "
    },
    {
        "content": "* Pipeline consolidation pushes up natural gas earnings   (Adds breakdown of earnings)",
        "date": "03232016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "UPDATE 1-PetroChina profit dives 70 pct in 2015 on low oil prices "
    },
    {
        "content": "BEIJING  March 23 PetroChina     China's biggest oil and gas producer  reported a 70 percent slump in its full-year 2015 profit  with earnings upstream and in the marketing segment both taking a hit from lower prices.",
        "date": "03232016",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina profit dives 70 pct in 2015 on low oil prices "
    },
    {
        "content": "SHANGHAI  Feb 4 China Universal Asset Management Co said it plans to liquidate a fund that invests in energy stocks  in what would be the first case of a product dissolution by a mutual fund this year.",
        "date": "02042016",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China sees first mutual fund liquidation this year "
    },
    {
        "content": "BEIJING  Jan 11 PetroChina   and Chevron began production at an onshore natural gas field in China's southwest at the end of 2015  PetroChina's parent said on Monday  after years of delays.",
        "date": "01132016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "CORRECTED-PetroChina-Chevron sour gas project begins production in China "
    },
    {
        "content": "BEIJING  Jan 11 PetroChina   and Chevron began production at an onshore natural gas field in China's southwest at the end of 2015  PetroChina's parent said on Monday  after years of delays.",
        "date": "01112016",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina-Chevron sour gas project begins production in China "
    },
    {
        "content": "* Says pipeline unit plans assets restructuring with other partners",
        "date": "12242015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "BRIEF-Petrochina's pipeline unit to undergo assets restructuring "
    },
    {
        "content": "* Says board approves to take part in Petrochina's  pipeline platform restructuring",
        "date": "12242015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "BRIEF-Youngor to take part in PetroChina's pipeline platform restructuring "
    },
    {
        "content": "BEIJING PetroChina plans to lay a temporary natural gas pipeline in the southern Chinese city of Shenzhen to replace a line that exploded near the site of a deadly mudslide  the company said Monday.",
        "date": "12212015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina to build temporary gas pipe in 10 days after blast "
    },
    {
        "content": "* China looking to boost business with resource-rich neighbour",
        "date": "12152015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 1-Private China firm to take control of unit of Kazakh state oil company "
    },
    {
        "content": "BEIJING/HONG KONG PetroChina is discussing selling a stake in domestic gas pipelines worth an estimated $47 billion in total  sources told Reuters  in a move seen as a prelude to Beijing's plans to break the state giant's near monopoly and boost spending on energy infrastructure.",
        "date": "12102015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "Exclusive: PetroChina plans big gas grid stake sale under reform push - sources "
    },
    {
        "content": "LAUNCESTON  Australia - Has enough been done to boost the liquidity  and more importantly  the confidence of participants in the benchmark Middle East crude pricing system?",
        "date": "12022015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "Middle East oil price benchmark is patched up  full fix elusive: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Dec 2 - Has enough been done to boost the liquidity  and more importantly  the confidence of participants in the benchmark Middle East crude pricing system?",
        "date": "12022015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "COLUMN-Middle East oil price benchmark is patched up  full fix elusive: Russell "
    },
    {
        "content": "BEIJING  Dec 1 Changes by PetroChina  to add a delayed coking unit at a large new refinery in southwestern China would still satisfy environmental requirements  according to a newspaper run by parent company China National Petroleum Corporation (CNPC)  citing a team of experts.",
        "date": "12012015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "Yunnan refinery changes meet environmental standards -CNPC newspaper "
    },
    {
        "content": "* Ministry tells teapot refineries to apply for Q1 export quotas",
        "date": "11242015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China's teapot oil refineries set to export fuel for the first time -sources "
    },
    {
        "content": "BEIJING  Oct 29 PetroChina     China's biggest oil and gas producer  reported a 68.1 percent drop in net earnings for the first nine months of the year  as oil prices fell.",
        "date": "10292015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina net profit down 68.1 pct in first nine months of 2015 "
    },
    {
        "content": "HONG KONG  Oct 6 Hong Kong shares closed mixed on Tuesday  with the main index down slightly but the Chinese Enterprise index lifted by gains in energy stocks  such as PetroChina.",
        "date": "10062015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "Hong Kong shares close mixed; higher oil prices boost PetroChina "
    },
    {
        "content": "MELBOURNE Australia's competition watchdog flagged concerns on Thursday that Royal Dutch Shell's  proposed $70 billion takeover of BG Group  may lessen gas supply competition in the country's east  and it put off a final decision on the bid until November.",
        "date": "09172015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "Australia delays decision on Shell bid for BG on gas supply concerns "
    },
    {
        "content": "* Shell says still expects to complete deal in early 2016   (Adds details  quotes)",
        "date": "09172015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 2-Australia delays decision on Shell bid for BG on gas supply concerns "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "09082015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "RPT-COLUMN-Can Middle East oil pricing be fixed after China breaks it?: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "09082015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "COLUMN-Can Middle East oil pricing be fixed after China breaks it?: Russell "
    },
    {
        "content": "* Chinese crude futures could be launched as early as October",
        "date": "09022015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China oil market reform paves way for new crude benchmark "
    },
    {
        "content": "* Banking shares fall after lacklustre performance at top lenders",
        "date": "08282015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China stocks extend rebound but banks lose steam; Hong Kong up on Wall Street rally "
    },
    {
        "content": "BEIJING  Aug 27 PetroChina     China's biggest oil and gas producer  reported a 63 percent drop in first-half profits  with earnings upstream and in the marketing segment hit by lower prices  while earnings from natural gas jumped.",
        "date": "08272015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "UPDATE 1-PetroChina profit dives 63 percent in first half "
    },
    {
        "content": "BEIJING  Aug 27 PetroChina     China's biggest oil and gas producer  reported a 63 percent drop in its first-half profit  with earnings upstream and in the marketing segment both taking a hit from lower prices.",
        "date": "08272015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina profit dives 63 pct in first half "
    },
    {
        "content": "DUBAI  Aug 27 Here are some factors that may affect Middle East stock markets on Thursday. Reuters has not verified the press reports and does not vouch for their accuracy.",
        "date": "08272015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "MIDEAST STOCKS - Factors to watch - Aug 27 "
    },
    {
        "content": "HONG KONG  Aug 18 Some foreign investors have found a new and simple way to make money from China's dysfunctional stock markets - by dispensing with market research and playing \"follow the leader\" instead.",
        "date": "08182015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "Playing Chinese markets is as simple as \"follow the leader\" "
    },
    {
        "content": "* Two Chinese oil firms increasingly dominate physical market",
        "date": "08112015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China strengthens hold over oil market as price maker "
    },
    {
        "content": "HONG KONG  Aug 6 Wison Engineering Services Co Ltd  a supplier to PetroChina  said it has been found guilty of bribery after an investigation by the Chinese government and ordered to pay a fine of 30 million yuan ($4.83 million).",
        "date": "08062015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina supplier Wison says found guilty of bribery in China "
    },
    {
        "content": "NEW YORK  Aug 3 PetroChina Co   on Monday won the dismissal of a U.S. class-action lawsuit arising from an alleged bribery scheme at China's state-run oil company.",
        "date": "08032015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina wins dismissal of US lawsuit over alleged bribery "
    },
    {
        "content": "BEIJING China's implied oil demand grew 3.5 percent in June  as rising air travel and vehicle usage boosted fuel consumption  but a drop in passenger car sales amid a recent stock market rout could limit demand growth over the next few months.",
        "date": "07152015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "China oil demand rises in June  car sales slump may cap growth "
    },
    {
        "content": "BEIJING  July 3 China's crude oil output looks set to rise this year from a record in 2014 as new production from third largest producer CNOOC helps to counter reductions from its two bigger rivals.",
        "date": "07032015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "CNOOC's new output to lift China's oil production from 2014 record "
    },
    {
        "content": " (This June 16 story corrects to say Shell  PetroChina are shareholders  not operators of Arrow LNG  in tenth paragraph)",
        "date": "06172015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "Low oil price hits $200 billion in mega-projects "
    },
    {
        "content": "BEIJING  June 15 Former PetroChina  Vice Chairman Liao Yongyuan has been expelled from the Communist Party and will be prosecuted for crimes including bribery  the party's graft watchdog said on Monday.",
        "date": "06152015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "Former PetroChina vice chairman to be prosecuted for graft "
    },
    {
        "content": "BEIJING  June 15 Former PetroChina  Vice Chairman Liao Yongyuan has been expelled from the Communist Party and will be prosecuted for crimes including bribery  the party said on Monday  the latest official caught up in a sweeping corruption crackdown.",
        "date": "06152015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 2-Former PetroChina vice chairman to be prosecuted for graft "
    },
    {
        "content": "April 28 Hong Kong stocks ended flat on Tuesday as strength in financial shares was offset by a slump in oil giants PetroChina and Sinopec Corp.",
        "date": "04282015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "Hong Kong shares end flat  oil giants slump "
    },
    {
        "content": "HONG KONG  April 27 PetroChina  China's biggest oil and gas producer  reported a sharper-than-expected 82 percent fall in first-quarter profit  due to lower international crude prices and inventory writedowns at its refining division.",
        "date": "04272015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "UPDATE 1-PetroChina first-quarter profit dives 82 percent "
    },
    {
        "content": "BEIJING  April 27 China will likely cut the number of its central government-owned conglomerates to 40 through a series of mergers  as Beijing pushes forward a plan to overhaul the country's underperforming state sector  state media reported on Monday.",
        "date": "04272015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 2-China plans mergers to cut number of big state firms to 40 - state media "
    },
    {
        "content": "HONG KONG  April 27 Sinopec Corp and PetroChina on Monday dismissed media reports their parents would merge to create a state giant  saying they have never received any official information about such a restructuring.",
        "date": "04272015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "Sinopec  PetroChina dismiss media reports about merger "
    },
    {
        "content": "HONG KONG  April 27 PetroChina  China's biggest oil and gas producer  reported a sharper-than-expected 82 percent fall in first-quarter profit  due to lower international crude prices and inventory writedowns at its refining division.",
        "date": "04272015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina first-quarter profit dives 82 pct  below forecasts "
    },
    {
        "content": "SHANGHAI  April 27 China stocks jumped to fresh seven-year highs on Monday  led by heavyweights such as China Petroleum & Chemical Corp and PetroChina Co Ltd  on expectations that Beijing will accelerate mergers among state-owned enterprises (SOEs).",
        "date": "04272015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "China stocks surge on state firm merger hopes "
    },
    {
        "content": "* PetroChina sold rare Australian grade gasoline to Chevron last month - source",
        "date": "04022015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "China sells Australia-spec gasoline cargo  eyes growing market "
    },
    {
        "content": "HONG KONG PetroChina  Asia's largest oil and gas producer  on Thursday vowed to further slash spending and divest more assets this year after posting a worse-than-expected 67 percent earnings slide for the fourth quarter.",
        "date": "03262015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "Hit by oil slump  PetroChina eyes spending cuts and divestments "
    },
    {
        "content": "* Return to profitability targeted in refining   (Adds details  quotes  recasts)",
        "date": "03262015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 1-Hit by oil slump  PetroChina eyes spending cuts and divestments "
    },
    {
        "content": "HONG KONG  March 26 PetroChina Co Ltd  Asia's largest oil and gas producer  reported a 67 percent slump in net profit for the fourth quarter  lagging forecast  due to a steep decline in the international crude oil prices.",
        "date": "03262015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina Q4 profit slumps 67 pct  below forecast "
    },
    {
        "content": "MILAN  March 26 Italy's Saipem is close to signing a joint venture with a big local partner in Nigeria just days after clinching a similar deal in China with PetroChina as the oil contractor seeks access to new markets.",
        "date": "03262015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 1-Saipem close to Nigeria jv deal after China success - source "
    },
    {
        "content": "BEIJING  March 17 PetroChina Vice Chairman Liao Yongyuan resigned on Tuesday after the state oil giant said he was being investigated by the country's anti-graft watchdog for \"serious disciplinary violations\".",
        "date": "03172015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "UPDATE 2-PetroChina vice chairman resigns amid graft crackdown "
    },
    {
        "content": "BEIJING PetroChina Vice Chairman Liao Yongyuan is being investigated for \"serious disciplinary violations\"  the company said  as an anti-corruption crackdown reaches deeper into the Chinese state-owned oil giant.",
        "date": "03162015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "PetroChina vice chairman under investigation amid graft crackdown "
    },
    {
        "content": "BEIJING PetroChina Vice Chairman Liao Yongyuan is being investigated for \"serious disciplinary violations\"  the company said  as an anti-corruption crackdown reaches deeper into the Chinese state-owned oil giant.",
        "date": "03172015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina vice chairman under investigation amid graft crackdown "
    },
    {
        "content": "BEIJING  March 16 PetroChina Vice Chairman Liao Yongyuan is being investigated for \"serious disciplinary violations\"  the company said  as an anti-corruption crackdown reaches deeper into the Chinese state-owned oil giant.",
        "date": "03162015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "UPDATE 1-PetroChina vice chairman under investigation amid graft crackdown "
    },
    {
        "content": "(Repeats with no changes to text)  - Clyde Russell is a Reuters columnist. The views expressed are his own. -",
        "date": "02272015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "RPT-COLUMN-PetroChina  Sinopec merger makes little sense: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Feb 27 The market chatter over forming a giant Chinese oil major through merging PetroChina and Sinopec has ramped up again recently  but the motivations for such a deal struggle to stand up to scrutiny.",
        "date": "02272015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "PetroChina  Sinopec merger makes little sense: Russell "
    },
    {
        "content": "- Clyde Russell is a Reuters columnist. The views expressed are his own. -",
        "date": "02272015",
        "name": "PetroChina Company Limited",
        "news_type": "normal",
        "symbol": "PTR",
        "title": "COLUMN-PetroChina  Sinopec merger makes little sense: Russell "
    },
    {
        "content": "NEW YORK Oil slumped on Wednesday  with U.S. crude prices at near six-year lows  after the government reported record-high inventories in the United States that raised anxieties about the global oil glut that had pressured the market since last summer. | Video ",
        "date": "01282015",
        "name": "PetroChina Company Limited",
        "news_type": "topStory",
        "symbol": "PTR",
        "title": "Oil tumbles; U.S. crude prices near six-year low on record stockpiles "
    }
]