[
    {
        "content": "* Aim to raise proportion to 15 pct of portfolio from 12 pct -CEO",
        "date": "11142017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "REUTERS SUMMIT-Malaysia's $30 bln pension fund to allocate more money for foreign deals "
    },
    {
        "content": "Prudential  expects its Asian business to double in size every five to seven years  the British life insurer said after reporting the region drove a 17 percent rise in new business profit during the first nine months of 2017.",
        "date": "11162017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential seeks larger slice of life in China as Asia drives profit "
    },
    {
        "content": "* Share performance vs peers: http://bit.ly/2zJnEdz (Adds quotes  context  updates shares)",
        "date": "11162017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 4-Prudential seeks larger slice of life in China as Asia drives profit "
    },
    {
        "content": "* CEO Mike Wells says Asia 'in some ways ours to lose'; need to get better in health and protection.",
        "date": "11162017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential CEO says no decision on UK annuity book yet; eyes U.S. M&A "
    },
    {
        "content": "Britain's Prudential  plans to break up its 10 billion pound ($13 billion) British pensions annuities book into four parts  in a move that could see the insurer leave its domestic market  Sky News said.",
        "date": "11062017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential talks to buyers for $13 billion British annuities book: Sky "
    },
    {
        "content": "Nov 16 British life insurer Prudential Plc reported higher new-business profit across is businesses for the first nine months of the year as it saw opportunities in its three key markets - Asia  United States and the UK and Europe.",
        "date": "11162017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential's 9-month new-business profit rises "
    },
    {
        "content": "Nov 6 Britain's Prudential plans to break up its 10 billion pound ($13 billion) British pensions annuities book into four parts  in a move that could see the insurer leave its domestic market  Sky News said.",
        "date": "11062017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential talks to buyers for $13 bln British annuities book- Sky "
    },
    {
        "content": "* Prudential informs potential buyers of chunks of pension annuities biz that 10 billion STG portfolio will be divided into four parcels- Sky News‍​ Source text: http://bit.ly/2izj7QS Further company coverage:",
        "date": "11062017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential informs potential buyers of chunks of pension annuities biz that 10 bln STG portfolio will be divided into four parcels- Sky News‍​ "
    },
    {
        "content": "Nov 1 Prudential Plc's U.S. life insurance business Jackson has set up a private wealth and trust arm to manage the investments and finances of very wealthy clients.",
        "date": "11012017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential's U.S. life business enters private wealth market "
    },
    {
        "content": "* JACKSON NATIONAL - FORMS PRIVATE WEALTH & TRUST GROUP TO FOCUS ON INVESTMENT MANAGEMENT AND TAX MITIGATION FOR HIGH AND ULTRA HIGH NET-WORTH FAMILIES",
        "date": "11012017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential unit Jackson enters private wealth and trust market "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  October 23 (Fitch) Fitch Ratings has assigned Prudential Plc's (Prudential) USD750 million issue of subordinated notes a rating of 'BBB+'. The notes are rated three notches below Prudential's Long-Term Issuer Default Rating (IDR) of 'A+'  which has a Stable Outlook  to reflect their subordination and loss-absorption features  in line with Fitch's notching criteria. KEY RATING DRIVERS The Tier 2 subordinated notes carry a coupon ",
        "date": "10232017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Fitch Rates Prudential's Subordinated Notes 'BBB+' "
    },
    {
        "content": "HONG KONG/SINGAPORE Prudential Plc  has kicked off the sale of its Vietnam consumer finance unit  which could fetch up to $150 million  as the UK firm sharpens focus on its core insurance business in the Southeast Asian nation  people familiar with the process said.",
        "date": "10042017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential seeks sale of Vietnam consumer finance unit for up to $150 million: sources "
    },
    {
        "content": "* Interested buyers include PE firms  financial services firms",
        "date": "10042017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential seeks sale of Vietnam consumer finance unit for up to $150 mln - sources "
    },
    {
        "content": "UK-based general insurer Direct Line Insurance Group said Prudential Plc  executive Penny James will replace John Reizenstein as its chief financial officer  starting from March.",
        "date": "09082017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Direct Line Insurance names Prudential executive as CFO "
    },
    {
        "content": "Sept 8 UK-based general insurer Direct Line Insurance Group said Prudential Plc executive Penny James will replace John Reizenstein as its chief financial officer  starting from March.",
        "date": "09082017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "MOVES-Direct Line Insurance names Prudential exec as CFO "
    },
    {
        "content": "* ‍Penny James to succeed John Reizenstein as CFO of Direct Line Group​",
        "date": "09082017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "CORRECTED-BRIEF-Direct Line brings on Prudential exec as new finance head "
    },
    {
        "content": "LAGOS  Aug 30 Germany's Allianz said on Wednesday it is buying control of Nigerian insurer Ensure Insurance Plc in a push for growth in Africa  where many people are uninsured.",
        "date": "08302017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Allianz buys Nigerian insurer in African push "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  August 28 (Fitch) The Australian Prudential Regulation Authority's (APRA) inquiry into Commonwealth Bank of Australia's (CBA; AA-/Stable/aa-) governance  culture and accountability frameworks and practices may result in negative rating action if it identifies systemic issues in these areas  Fitch Ratings says. The establishment of the prudential inquiry follows several developments that raised questions about CBA's governance fr",
        "date": "08282017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Fitch to Monitor if Prudential Inquiry Finds Systemic Issues at CBA "
    },
    {
        "content": "* Follows money laundering lawsuit  corporate regulator probe",
        "date": "08282017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 3-CBA hit with second regulatory probe after money laundering claims "
    },
    {
        "content": "(The following statement was released by the rating agency) Link to Fitch Ratings' Report: Macro-Prudential Risk Monitor - August 2017 https://www.fitchratings.com/site/re/902114 LONDON  August 25 (Fitch) Global credit growth in 2017 is likely to stabilise following a slowdown in 2016  but remains at a record low since the global financial crisis of 2008  says Fitch Ratings in its latest Macro-Prudential Risk Monitor. Consequently  macro-prudential risk indicators (MPI scores) continue to point ",
        "date": "08252017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Fitch: Global Credit Growth to Stabilise in 2017; Low Macro-Prudential Risk in Most Markets "
    },
    {
        "content": "LONDON Britain's Prudential  sold its broker-dealer network in the United States for $325 million to LPL Financial   the insurer said on Wednesday.",
        "date": "08162017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Britain's Prudential sells U.S. broker-dealer network for $325 million "
    },
    {
        "content": "LONDON  Aug 16 Britain's Prudential sold its broker-dealer network in the United States for $325 million to LPL Financial  the insurer said on Wednesday.",
        "date": "08162017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Britain's Prudential sells U.S. broker-dealer network for $325 mln "
    },
    {
        "content": "* Announces sale of US broker-dealer network for $325 mln to LPL Financial LLC  the largest independent broker-dealer in the US",
        "date": "08162017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential announces sale of US broker-dealer network for $325 mln "
    },
    {
        "content": "* Chief executive mike wells says looking at \"external and internal options\" for uk annuities book",
        "date": "08102017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Prudential CEO-looking at \"external and internal options\" for UK annuities book "
    },
    {
        "content": "* TO COMBINE ITS ASSET MANAGER  M&G  AND PRUDENTIAL UK & EUROPE (PRUDENTIAL UK&E) TO FORM M&G PRUDENTIAL",
        "date": "08102017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential names John Foley as CEO of combined UK business "
    },
    {
        "content": "* Group ifrs operating profit 1 of £2 358 million  up 5 per cent",
        "date": "08102017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential combines M&G and UK & Europe divisions  H1 profit up 5 pct "
    },
    {
        "content": "July 12 British insurer Prudential said it had bought a majority stake in Nigeria's Zenith Life to give it access to the African country's fast-growing insurance market.",
        "date": "07122017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Insurer Prudential enters Nigeria via insurance buy  Zenith Bank deal "
    },
    {
        "content": "* ‍Appointment of Thomas Watjen as non-executive director​ Source text for Eikon: Further company coverage:",
        "date": "07122017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential appoints Thomas Watjen as non-executive director​ "
    },
    {
        "content": "* Bank's talks with FWD fail due to disagreement over valuations",
        "date": "07062017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 1-Thai bank SCB halts $3 bln insurance unit sale as talks fail - sources "
    },
    {
        "content": "* Drop in solvency under new disclosure rules reasonable-Bernstein (Adds analysts' comment  solvency data  updates shares)",
        "date": "05182017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "UPDATE 2-Prudential posts Q1 new-business profit rise  reshuffles management "
    },
    {
        "content": "LONDON  May 18 British insurer Prudential reported a 25 percent rise in first-quarter new business profit on Thursday  driven by growth in Asia  and said the firm's Asia head was stepping down.",
        "date": "05182017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential Q1 new business profit rises  Asia head steps down "
    },
    {
        "content": "* Q1 group new business profit of 856 million stg  up 25 percent (up 42 percent)",
        "date": "05182017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential reports hgiher Q1 new business profit "
    },
    {
        "content": "* Prudential appoints Nic Nicandrou as chief executive of Prudential Corporation Asia",
        "date": "05182017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential names Mark Fitzpatrick as group CFO "
    },
    {
        "content": "LONDON  May 9 Governance adviser PIRC recommended on Tuesday that Prudential shareholders oppose the insurer's pay policy and report  and the re-election of chairman Paul Manduca at the company's annual general meeting next week.",
        "date": "05092017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "PIRC recommends Prudential shareholders vote against pay  chairman "
    },
    {
        "content": "NEW YORK PGIM Fixed Income senior portfolio manager Greg Peters said on Thursday that he has been reducing his overweight position in junk bonds because the \"risk-reward is just not favorable.\"",
        "date": "04202017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential's Peters says risk-reward for junk bonds 'not favorable' "
    },
    {
        "content": "NEW YORK  April 20 PGIM Fixed Income senior portfolio manager Greg Peters said on Thursday that he has been reducing his overweight position in junk bonds because the \"risk-reward is just not favorable.\"",
        "date": "04202017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 2-Prudential's Peters says risk-reward for junk bonds \"not favorable\" "
    },
    {
        "content": "NEW YORK  April 20 Prudential senior portfolio manager Greg Peters said on Thursday that he has been reducing his overweight position in junk bonds because the \"risk-reward is just not favorable.\"",
        "date": "04202017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential's Peters says junk bonds ‘risk-reward is not favorable’ "
    },
    {
        "content": "* on March 30  co  Prudential amended April 27  2016 note purchase  private shelf agreement to extend facility expiration date to March 30  2020",
        "date": "04042017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-LCI Industries amends Note Purchase and Private Shelf Agreement with Prudential - SEC filing "
    },
    {
        "content": "* As at March 31  2017  Prudential's issued share capital admitted to trading consisted of 2.59 billion ordinary shares of 5 pence each Source text for Eikon: Further company coverage:",
        "date": "04032017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Prudential updates on total voting rights  issued share capital "
    },
    {
        "content": "LONDON Britain has sold a portfolio of mortgages issued by failed lender Bradford & Bingley for 11.8 billion pounds to insurer Prudential and buyout firm Blackstone in one of the biggest deals of its kind.",
        "date": "03312017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UK recoups taxpayer funds in $15 bln Bradford & Bingley loans sale "
    },
    {
        "content": "LONDON  March 24 Prudential Chief Executive Mike Wells' pay fell 30 percent to 6.9 million pounds ($8.62 million) in 2016  the insurer's annual report showed on Friday.",
        "date": "03242017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential CEO pay drops 30 pct to $8.6 mln in 2016-annual report "
    },
    {
        "content": "* Biggest UKAR asset sale since Northern Rock (Adds UKAR CEO  context)",
        "date": "03312017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 2-UK recoups taxpayer funds in $15 bln Bradford & Bingley loans sale "
    },
    {
        "content": "March 31 Britain's FTSE 100 index is seen opening down 19 points at 7 351 points on Friday  according to financial bookmakers  with futures down 0.4 percent ahead of the cash market open.",
        "date": "03312017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 1-UK Stocks-Factors to watch on March 31 "
    },
    {
        "content": "* Chief executive mike wells says doesn't see need for m&g  eastspring to acquire other asset managers",
        "date": "03142017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Prudential CEO-no need for M&G  Eastspring to acquire asset managers "
    },
    {
        "content": "LONDON  March 14 British shares were up slightly on Tuesday after some solid earnings reports  which offset falls in banking and retail stocks on political uncertainty as Britain gets set to start negotiating its departure from the EU.",
        "date": "03142017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential's record profit helps Britain's FTSE creep higher "
    },
    {
        "content": "LONDON  March 14 British insurer Prudential  reported record 2016 operating profit of 4.3 billion pounds ($5.16 billion) on Tuesday  led by growth in its Asian business and sending its shares higher.",
        "date": "03142017",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential posts record operating profit in 2016  shares rise "
    },
    {
        "content": "LONDON  Feb 27 Buyout firm Blackstone Group  and insurer Prudential are the preferred bidders for about 12.5 billion pounds ($15.5 billion) in mortgages made by failed British lender Bradford & Bingley  a person with knowledge of the matter said.",
        "date": "02272017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Blackstone  Prudential top pick for failed Bradford & Bingley's U.K. mortgages "
    },
    {
        "content": "* Farmland Partners Inc and prudential announce termination of management agreement",
        "date": "02212017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Farmland Partners  Prudential announce termination of management agreement "
    },
    {
        "content": "* Announced appointment of Louise Dennett to newly-created role of director of finance change for group",
        "date": "02132017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Hiscox appoints Louise Dennett as group finance director "
    },
    {
        "content": "(The following statement was released by the rating agency) Link to Fitch Ratings' Report: Macro-Prudential Risk Monitor - January 2017 https://www.fitchratings.com/site/re/892224 NEW YORK  January 11 (Fitch) Real credit growth in 2016 slowed to the lowest  level since the global financial crisis (GFC) in 2009  says Fitch Ratings in its  latest Macro-Prudential Risk Monitor. Consequently  macro-prudential risk  indicators (MPI scores) continue to trend lower. Fitch estimates that global median r",
        "date": "01112017",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Fitch: Global Credit Growth Slows in 2016; Macro-Prudential Risks Decreasing "
    },
    {
        "content": "NEW YORK Gregory Peters  senior investment officer at Prudential Fixed Income  on Tuesday said the steep selloff in U.S. bonds following last week's surprise election of Donald Trump to the White House and the Republican sweep of Congress was overdone.",
        "date": "11152016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential's Peters calls U.S. bond selloff overdone "
    },
    {
        "content": "* Ceo mike wells says still interested in \"bolt-on\" acquisitions in united states",
        "date": "11162016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Prudential CEO still interested in \"bolt-on\" U.S. acquisitions "
    },
    {
        "content": "LONDON/BANGALORE Prudential's Asian focus drove a 19 percent rise in new business profit for the first nine months  the British life insurer said on Wednesday as it pledged to raise its dividend by 5 percent every year.",
        "date": "11162016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Asia drives Prudential's new business profit  raises dividend "
    },
    {
        "content": "* Reached an agreement to sell 100 pct of its life insurance subsidiary in Korea  PCA Life Insurance Co.  Ltd",
        "date": "11102016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Prudential to sell life insurance unit in Korea for 119 mln stg "
    },
    {
        "content": "* Shares up 1.6 pct   (Adds quotes from Investor Day  bullet points  share price  analyst quote)",
        "date": "11162016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 2-Asia drives Prudential's new business profit  raises dividend "
    },
    {
        "content": "* CEO Wells says sees \"significant\" growth opportunities across Asia  Europe  U.S.",
        "date": "11162016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential CEO sees 'significant' growth opportunities across business "
    },
    {
        "content": "* Prudential - For our UK life business  in the first 9 months  new business profit from retail sales was 41 percent higher",
        "date": "11162016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential says new business trends experienced in the first half of the year have continued in the third quarter of 2016 "
    },
    {
        "content": "Nov 16 Insurer Prudential Plc reported a 19 percent rise in new business profit for the first nine months of the year  driven mainly by strong performance at its Asian business.",
        "date": "11162016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential says 9-month new business profit rises  boosts dividend "
    },
    {
        "content": "LONDON  Oct 21 M&G Investments  a unit of insurer Prudential  will lift the suspension of its M&G Property Portfolio and feeder funds from midday on Nov. 4  the firm said in a statement on Friday.",
        "date": "10212016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "M&G lifts UK property funds suspension "
    },
    {
        "content": "LONDON  Oct 10 British asset manager M&G Investments  the fund arm of insurer Prudential  plans to launch a Luxembourg fund range to ensure it can sell to continental European retail investors after Britain's vote to leave the European Union.",
        "date": "10102016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "M&G to launch retail-focused funds in Luxembourg "
    },
    {
        "content": "LONDON  Sept 9 Staff at a British regional office of insurer Prudential have voted to strike over plans to transfer 82 jobs to Mumbai  the Unite union said on Friday.",
        "date": "09092016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential staff in Reading to strike over Mumbai job plan "
    },
    {
        "content": "SEOUL South Korea's Mirae Asset Life Insurance Co Ltd  said in a regulatory filing on Friday it had submitted a final bid for PCA Life Insurance Co Ltd  an unlisted South Korean unit of British insurer Prudential PLC .",
        "date": "09082016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Mirae Asset Life says made final bid for Prudential's South Korea unit "
    },
    {
        "content": "SEOUL  Sept 9 South Korea's Mirae Asset Life Insurance Co Ltd said in a regulatory filing on Friday it had submitted a final bid for PCA Life Insurance Co Ltd  an unlisted South Korean unit of British insurer Prudential PLC.",
        "date": "09082016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Mirae Asset Life says made final bid for Prudential's S.Korea unit "
    },
    {
        "content": "*  Says to transfer $2.5 billion in U.S. pension obligations to Prudential",
        "date": "09082016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-WestRock to transfer $2.5 bln in U.S. Pension obligations to Prudential "
    },
    {
        "content": "MUMBAI  Sept 8 India's ICICI Prudential Life Insurance Co Ltd's initial public offering of shares will open on Sept. 19  parent ICICI Bank said on Thursday  seeking to raise as much as $909 million in the biggest local listing in six years.",
        "date": "09082016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "ICICI Pru Life seeks up to $909 mln in India's biggest IPO in six years "
    },
    {
        "content": "* Preferred apartment communities announces acquisition of a 290-unit multifamily community in Jacksonville  Florida",
        "date": "08242016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Preferred Apartment Communities buys multifamily community "
    },
    {
        "content": "LONDON  Aug 10 Britain's top equity index rose on Wednesday in its fifth straight day of gains as stronger financial stocks offset weaker energy shares which tracked a pullback in oil prices.",
        "date": "08102016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "UK's FTSE notches up fifth day of gains on firm financials "
    },
    {
        "content": "* H1 operating profit up 6 pct  beats expectations   (Recasts with CEO  M&G comments on Brexit  adds M&A comment   analyst  updates shares)",
        "date": "08102016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 2-Prudential considers shifting funds to Dublin  Luxembourg "
    },
    {
        "content": "* Chief executive mike wells says at group level  the immediate impact of brexit will not be material",
        "date": "08102016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential CEO-at group level  Brexit impact not material "
    },
    {
        "content": "LONDON  Aug 10 Insurer Prudential posted a forecast-beating six percent rise in first-half operating profit to 2.06 billion pounds ($2.69 billion)  led by growth in Asia  the firm said on Wednesday.",
        "date": "08102016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential H1 operating profit up 6 pct  beats expectations "
    },
    {
        "content": "* Excluding uk bulk annuities from 2015 comparative results as prudential has withdrawn from this market.",
        "date": "08102016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential H1 operating profit rises 6 pct "
    },
    {
        "content": "NEW YORK  July 19 The Financial Industry Regulatory Authority fined Prudential Annuities Distributors $950 000 on Tuesday for failing to prevent the fraudulent withdrawal of nearly $1.3 million from an elderly annuity holder's account by her financial officer.",
        "date": "07192016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential fined for authorizing fraudulent annuity withdrawals "
    },
    {
        "content": "(The following statement was released by the rating agency) SYDNEY  July 19 (Fitch) Further proposed tightening of macro-prudential rules  for residential mortgage lending in New Zealand from 1 September 2016 should  strengthen the banking system's credit profile  says Fitch Ratings. However   these new rules are not expected to change the current bank ratings. Fitch believes the measures  which limit lending growth based on loan/value  ratio (LVR) ranges and borrower types  could increase finan",
        "date": "07192016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Fitch: Tighter Macro-Prudential Rules in New Zealand Support Bank Ratings "
    },
    {
        "content": "* Proceeds to be used to raise Shaikan production   (Adds background  analyst comment  share and debt prices)",
        "date": "07142016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 2-Distressed funds set for big stakes in Gulf Keystone after debt swap "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential arm M&G suspends trading in $5.7 bln UK property fund "
    },
    {
        "content": "LONDON British asset manager M&G Investments  the fund arm of insurer Prudential   is looking at expanding its operations in Dublin in the wake of a British vote to leave the European Union.",
        "date": "06282016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential unit M&G eyes Dublin expansion after Brexit vote "
    },
    {
        "content": "LONDON  June 28 British asset manager M&G Investments  the fund arm of insurer Prudential  is looking at expanding its operations in Dublin in the wake of a British vote to leave the European Union.",
        "date": "06282016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "REFILE-UPDATE 1-Prudential unit M&G eyes Dublin expansion after Brexit vote "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  June 30 (Fitch) Fitch Ratings has affirmed Prudential Assurance Company  Ltd's (PAC) Insurer Financial Strength (IFS) rating at 'AA'. The agency has also  affirmed Prudential Plc's (Prudential) US subsidiaries Jackson National Life  Insurance Company and Jackson National Life Insurance Company of New York's  (collectively  JNL) IFS ratings at 'AA'.  At the same time  Fitch has affirmed Prudential's Long-Term Issuer Default  Rati",
        "date": "06302016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Fitch Affirms Prudential Plc's IFS at 'AA'; Outlook Stable "
    },
    {
        "content": "NEW YORK Gregory Peters  a senior investment officer at Prudential Fixed Income with more than $621 billion of assets  said on Tuesday he thinks U.S. stocks and bonds are a \"great\" buying opportunity if Britain votes to exit the European Union.",
        "date": "06212016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Buy everything U.S. if Britain leaves EU: Prudential's Peters "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  June 07 (Fitch) Fitch Ratings has assigned Prudential Plc's (Prudential)  USD1bn issue of subordinated notes a rating of 'BBB+'. The notes are rated three  notches below Prudential's Long-Term Issuer Default Rating (IDR) of 'A+'  which  has a Stable Outlook  to reflect their subordination and loss absorption  features  in line with Fitch's notching criteria.  KEY RATING DRIVERS The Tier 2 subordinated notes carry a coupon of 5.2",
        "date": "06072016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Fitch Rates Prudential's Subordinated Notes 'BBB+' "
    },
    {
        "content": "NEW YORK  June 6 Gregory Peters  a senior investment officer at Prudential Fixed Income  said Monday he favors higher-quality high-yield junk bonds even after the sector's rally.",
        "date": "06062016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential's Peters says sticking with junk bonds post-rally "
    },
    {
        "content": "LONDON/ZURICH  April 28 Credit Suisse  investors want answers from CEO Tidjane Thiam about his turnaround plan in the wake of $1 billion of unexpected trading writedowns at the bank  which has lost more than a third of its value since he joined 10 months ago.",
        "date": "04282016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Credit Suisse boss Thiam must show turnaround plan on track "
    },
    {
        "content": "* Says ex-ceo Tidjane Thiam's annual salary in 2015 was 1.09 million stg versus 1.06 million stg year ago",
        "date": "03312016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Prudential's former chief Thiam earned $7.2 mln for 5 mths in 2015 "
    },
    {
        "content": "March 31 British insurer Prudential's  former chief executive  Tidjane Thiam  earned 5 million pounds ($7.20 million) in the first five months of 2015  according to the company's annual report  published on Thursday.",
        "date": "03312016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential's former chief Thiam earned $7.2 mln for 5 mths in 2015 "
    },
    {
        "content": "ZURICH Credit Suisse  Chief Executive Tidjane Thiam received 18.9 million Swiss francs ($19.4 million) in cash and share awards from the Swiss bank in 2015 even after requesting a 40 percent bonus cut  according to its annual report.",
        "date": "03242016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Credit Suisse CEO paid $19.4 million in cash and shares last year "
    },
    {
        "content": "ZURICH  March 24 Credit Suisse Chief Executive Tidjane Thiam received 18.9 million Swiss francs ($19.4 million) in cash and share awards from the Swiss bank in 2015 even after requesting a 40 percent bonus cut  according to its annual report.",
        "date": "03242016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 2-Credit Suisse CEO paid $19.4 mln in cash and shares last year "
    },
    {
        "content": "HANOVER  Germany German insurer Allianz named two new board members to succeed asset management chief Jay Ralph and company investment head Maximilian Zimmerer  who will step down this year.",
        "date": "03102016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Allianz names successors to board members Ralph  Zimmerer "
    },
    {
        "content": "LONDON Prudential  renewed calls for Britain to remain in the European Union on Wednesday  warning that an exit could make it harder for its UK fund management arm M&G to attract investors.",
        "date": "03092016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential warns Brexit could hit M&G UK funds business "
    },
    {
        "content": "* Company pays first special dividend since 1970   (Releads with Brexit comments  updates shares)",
        "date": "03092016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 2-Prudential warns Brexit could hit M&G UK funds business "
    },
    {
        "content": "* Chief executive mike wells says it's in prudential's interests for britain to remain in europe  Further company coverage:",
        "date": "03092016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential ceo-in our interests for Britain to stay in EU "
    },
    {
        "content": "LONDON  March 9 Britain's top share index edged higher on Wednesday  boosted by a rise in insurer Prudential  after it announced a special dividend with results that beat expectations.",
        "date": "03092016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Britain's FTSE gets small lift from Prudential results "
    },
    {
        "content": "LONDON  Feb 15 Britain's top equity index rose on Monday  extending its climb away from three-year lows reached earlier this month  helped by a surge in Reckitt Benckiser .",
        "date": "02152016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Britain's FTSE rises as Reckitt rallies "
    },
    {
        "content": "* Fines and bans Colin McIntosh  CEO of Millburn Insurance Company Ltd  for serious regulatory breaches and also fines Millburn 2.9 mln stg",
        "date": "02012016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-UK's PRA fines and bans Colin McIntosh  CEO of Millburn Insurance Co Ltd "
    },
    {
        "content": "* Solvency II won't affect dividend policy  CFO says   (Adds comments by CEO  CFO from investor day)",
        "date": "01192016",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "UPDATE 3-Prudential capital ratio beats forecasts  confirms UK head "
    },
    {
        "content": "LONDON  Jan 19 UK shares rebounded on Tuesday after closing at their lowest level in three years in the previous session  with mining and oil firms leading the rise after Chinese GDP figures met expectations while leaving room for further stimulus.",
        "date": "01192016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Britain's FTSE rebounds from lowest close in three years "
    },
    {
        "content": "* Chief financial officer nic nicandrou says unlikely to sustain current level of uk bulk annuity sales going forward   Further company coverage:",
        "date": "01192016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential sees lower UK bulk annuity sales "
    },
    {
        "content": "LONDON  Jan 19 UK shares rebounded from closing at their lowest level in three years in the previous session  as weak Chinese GDP figures boosted hopes for further stimulus  sending mining and oil and gas stocks higher.",
        "date": "01192016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Britain's FTSE finds its footing as commodity firms rally "
    },
    {
        "content": "* Chief financial officer nic nicandrou says dividend policy unchanged as a result of solvency II    Further company coverage:    (Reporting By Carolyn Cohn)",
        "date": "01192016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Dividend policy unchanged by Solvency II regulations -Prudential "
    },
    {
        "content": "LONDON British insurer Prudential Plc  posted a slightly above-forecast capital ratio under new European rules and appointed a UK head as it attempts to woo investors later on Tuesday.",
        "date": "01192016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential capital ratio beats forecasts  appoints new UK head "
    },
    {
        "content": "LONDON  Jan 19 British insurer Prudential Plc  said on Tuesday its solvency capital ratio was 190 percent on June 30  2015 under new European rules for insurers.",
        "date": "01192016",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential posts capital ratio of 190 pct at end-June 2015 "
    },
    {
        "content": "* Says new system will help prevent systemic financial risks   (Adds details)",
        "date": "12292015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "UPDATE 1-China c.bank to launch new macro-prudential regime to curb risks "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON/CHICAGO  December 10 (Fitch) Fitch Ratings has affirmed Prudential Plc's  (Prudential) Long-term Issuer Default Rating (IDR) at 'A+' and senior unsecured  debt at 'A'. The agency has also affirmed Prudential Assurance Company Ltd's  (PAC) Insurer Financial Strength (IFS) rating at 'AA'.  At the same time  Fitch has affirmed Prudential's US subsidiaries Jackson  National Life Insurance Company and Jackson National Life Insurance C",
        "date": "12102015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Fitch Affirms Prudential Plc's IDR at 'A+'; Outlook Stable "
    },
    {
        "content": "LONDON Britain's largest insurer Prudential said on Monday it would give an update on its capital position under new EU Solvency II rules on Jan. 19  ahead of other insurers who plan to issue ratios alongside annual earnings statements.",
        "date": "12072015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential likely to be first UK insurer to announce Solvency II ratios "
    },
    {
        "content": "* Solvency ii internal model approved by prudential regulation authority",
        "date": "12072015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential to give \"detailed update\" on Solvency II on Jan 19 "
    },
    {
        "content": "LONDON  Dec 5 Britain's top two insurers Aviva  and Prudential along with the Lloyd's of London insurance market were among the 19 firms whose capital calculation models the Bank of England  approved on Saturday.",
        "date": "12052015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Bank of England approves capital models for 19 UK insurers "
    },
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit  click on http://www.reuters.com/summit/Investment16",
        "date": "11172015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "REUTERS SUMMIT-Prudential's Peters: 80 pct chance of Dec. rate hike "
    },
    {
        "content": "* Looking at internal  external candidates for UK boss   (Adds CEO comment  background  analyst  updates share price)",
        "date": "11102015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "UPDATE 1-Chinese middle class boosts Prudential's new business "
    },
    {
        "content": "LONDON  Nov 10 British insurer Prudential's  new business profit rose 13 percent to 1.76 billion pounds ($2.7 billion) in the first nine months of 2015  led by strong performance in Asia  but U.S. new business profit fell  the firm said on Tuesday.",
        "date": "11102015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential 9mth new business profit rises 13 pct "
    },
    {
        "content": "Nov 3 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "11032015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "MOVES- Prudential  Old Mutual "
    },
    {
        "content": "LONDON After five uneventful months settling into the top job at Britain's largest insurer  the challenges facing Prudential boss Mike Wells are beginning to mount.",
        "date": "10232015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Honeymoon over for Prudential boss facing boardroom  regulation woes "
    },
    {
        "content": "Oct 21 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10212015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "MOVES-Citi  Prudential  Canaccord "
    },
    {
        "content": "Oct 21 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10212015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "MOVES-Citi  Prudential  Henderson Global  Amundi "
    },
    {
        "content": "* Announces departure of Jackie Hunt as chief executive  Prudential UK & Europe  with immediate effect",
        "date": "10212015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "CORRECTED-BRIEF-Prudential names John Foley as interim CEO of UK & Europe unit "
    },
    {
        "content": "Oct 21 British insurer Prudential Plc  said Jackie Hunt  chief executive of its UK and Europe unit  would leave immediately.",
        "date": "10212015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential says head of UK  Europe unit leaves "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON/CHICAGO  October 14 (Fitch) Fitch Ratings has affirmed Prudential Plc's  (Prudential) Long-term Issuer Default Rating (IDR) at 'A+' and senior unsecured  debt at 'A'. The agency has also affirmed Prudential Assurance Company Ltd's  (PAC) Insurer Financial Strength (IFS) rating at 'AA'.  At the same time  Fitch has affirmed Prudential's US subsidiaries Jackson  National Life Insurance Company and Jackson National Life Insurance Co",
        "date": "10142015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Fitch Affirms Prudential Plc's IDR at 'A+'; Outlook Stable "
    },
    {
        "content": "British insurer Prudential PLC may shift its headquarters from London to Asia to escape new European Union regulations  the Sunday Times reported citing people familiar with the matter.",
        "date": "10042015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential may quit UK to escape new EU regulations: Sunday Times "
    },
    {
        "content": "Oct 4 British insurer Prudential PLC may shift its headquarters from London to Asia to escape new European Union regulations  the Sunday Times reported citing people familiar with the matter.",
        "date": "10042015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential may quit UK to escape new EU regulations -Sunday Times "
    },
    {
        "content": "LONDON  Sept 15 British insurer Prudential  said on Tuesday it had appointed Adair Turner  the former head of the country's financial services regulator  as a non-executive director.",
        "date": "09152015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential appoints former head of regulator as non-executive director "
    },
    {
        "content": "* Appointment of Jonathan Turner and David Law as non-executive directors",
        "date": "09152015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential appoints Jonathan Turner and David Law as non-exec directors "
    },
    {
        "content": "* Expects that notes will not be capable of counting as tier 2 own funds",
        "date": "09092015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Prudential amends terms to $700 mln 5.25 pct Tier 1 perpetual notes "
    },
    {
        "content": "* Penny James appointed group chief risk officer and to Prudential Plc board",
        "date": "08102015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Prudential appoints Penny James as group chief risk officer "
    },
    {
        "content": "* Prudential gains 3.7 pct as operating profit beats forecasts   (Updates prices  adds detail)",
        "date": "08112015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "FTSE 100 falls as China devaluation hits Burberry  mining stocks "
    },
    {
        "content": "LONDON  Aug 11 Mike Wells hailed forecast-beating half-year earnings in his first set of results since taking charge of British insurer Prudential  saying he was confident he could build on an ambitious global expansion drive started by his predecessor.",
        "date": "08112015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "CORRECTED-UPDATE 2-New Prudential CEO Wells enjoys forecast-beating start "
    },
    {
        "content": "* Asia boss says has seen strong growth in agency  banking distribution; strong sales to mainland China.",
        "date": "08112015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential CEO says confident on growth outlook "
    },
    {
        "content": "LONDON  Aug 11 Prudential said on Tuesday that first-half operating profit rose 17 percent to 1.88 billion pounds  boosted by strong performances across its Asian  U.S. and UK life and asset management businesses.",
        "date": "08112015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential posts 17 pct jump in H1 operating profit "
    },
    {
        "content": "June 29 M&G Investments  Prudential Plc's  asset management unit  appointed Jeik Sohn as its first investment specialist in Asia.",
        "date": "06292015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "MOVES-M&G Investments names Jeik Sohn first Asia investment specialist "
    },
    {
        "content": "LONDON  June 5 The newly-formed Global Infrastructure Investor Association (GIIA) said on Friday it had appointed Matthew Farnum-Schneider  a managing director at insurer Prudential  as its first chairman.",
        "date": "06052015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "MOVES-Infrastructure investor body appoints Prudential's Farnum-Schneider as chairman "
    },
    {
        "content": "June 1 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06012015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "MOVES-Morgan Stanley  Citigroup  BoFA  Prudential "
    },
    {
        "content": "Lead Manager(s)         BNP Paribas  Deutsche Bank  GSI  HSBC  JPMorgan & RBC CM",
        "date": "06022015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "New Issue- Prudential prices 600 mln stg 2055 bond "
    },
    {
        "content": "June 1 M&G Investments  a unit of Prudential Plc   said Johan Du Preez would be rejoining the company in July as two Japan equities funds return to M&G from Eastspring Investments.",
        "date": "06012015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "MOVES-Johan Du Preez returns to M&G Investments "
    },
    {
        "content": "* John Foley  group investment director  has agreed to take on role of interim group Chief Risk Officer",
        "date": "06012015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential names Barry Stowe as Chairman and CEO of North American unit "
    },
    {
        "content": "* Second sale of HK business by StanC in less than six months",
        "date": "05142015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "UPDATE 1-StanChart seeking buyers for $350 mln HK pension business-sources "
    },
    {
        "content": "* Pierre-Olivier Bouée is to step down as group chief risk officer and a member of board of Prudential Plc",
        "date": "05122015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "BRIEF-Prudential says chief risk officer Pierre-Olivier Bouée to step down "
    },
    {
        "content": "* EU exit would be harmful for UK economy  Thiam says   (Recasts with Thiam  Wells comments  updates share price)",
        "date": "05062015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "UPDATE 2-Prudential will see strong first-half earnings  outgoing CEO says "
    },
    {
        "content": "LONDON  May 6 British insurer Prudential  on Wednesday posted a drop in new business profit in the United States and the UK during the first quarter  although Asian new business profit climbed.",
        "date": "05062015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential sees Q1 new business profit drop in U.S.  UK "
    },
    {
        "content": "LONDON  May 1 Investors and analysts expect business as usual at British insurer Prudential after it appointed internal candidate Mike Wells  head of the company's U.S. arm  as successor to Tidjane Thiam.",
        "date": "05012015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "UPDATE 2-Business as usual seen at Prudential under new CEO Wells "
    },
    {
        "content": "LONDON  May 1 British insurer Prudential  said on Friday it had appointed Mike Wells  head of the firm's U.S. arm  as chief executive to replace Tidjane Thiam.",
        "date": "05012015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential names Mike Wells as CEO to replace Thiam "
    },
    {
        "content": "* Appointment of Mike Wells to succeed Tidjane Thiam as group Chief Executive on 1 June 2015.  Source text for Eikon:  Further company coverage:",
        "date": "05012015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "BRIEF-Prudential names Mike Wells as CEO "
    },
    {
        "content": "ZURICH  April 21 Prudential boss Tidjane Thiam will start his new role as head of Credit Suisse  some time in the middle of June  the Swiss bank's outgoing chief executive said on Tuesday.",
        "date": "04212015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Thiam expected to start Credit Suisse CEO role in mid-June "
    },
    {
        "content": "LONDON Prudential  paid outgoing chief executive Tidjane Thiam 11.8 million pounds ($17.45 million) in 2014  a 35 percent increase on his 2013 compensation  following a bumper incentive plan payout in his final year in charge.",
        "date": "03312015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential's departing CEO Thiam earned $17.5 million in 2014 "
    },
    {
        "content": "LONDON  March 31 Prudential paid outgoing chief executive Tidjane Thiam 11.8 million pounds ($17.45 million) in 2014  a 35 percent increase on his 2013 compensation  following a bumper incentive plan payout in his final year in charge.",
        "date": "03312015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 1-Prudential's departing CEO Thiam earned $17.5 mln in 2014 "
    },
    {
        "content": "LONDON  March 31 Prudential paid outgoing chief executive Tidjane Thiam 11.8 million pounds ($17.45 million) in 2014  a 35 percent increase on his 2013 compensation  following a bumper incentive plan payout in his final year in charge.",
        "date": "03312015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential's departing CEO Thiam earned $17.5 mln in 2014 "
    },
    {
        "content": "* Minmetals  Brightoil  Temasek seen as likely interested parties-bankers",
        "date": "03202015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "REFILE-DEALTALK-Suitors circle Noble after commodity trader's $1.8 bln market plunge "
    },
    {
        "content": "* Successor will need to be interviewed by financial regulator",
        "date": "03112015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential treads carefully with investors in hunt for new CEO "
    },
    {
        "content": "HONG KONG/LONDON Incoming Credit Suisse boss Tidjane Thiam is expected to focus on private banking in Asia while aggressively cutting jobs at its investment bank  as he aims to repeat the success in the region of his old employer  Prudential.",
        "date": "03122015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "New Credit Suisse boss faces stiff challenge in Asia "
    },
    {
        "content": "* Push into Asia private wealth faces challenge from incumbent UBS",
        "date": "03122015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 2-New Credit Suisse boss faces stiff challenge in Asia "
    },
    {
        "content": "ZURICH/LONDON/HONG KONG Credit Suisse has swooped on Prudential boss Tidjane Thiam to lead the Swiss bank in a push to manage more of the wealth held by Asia's fast growing club of multi-millionaires. | Video ",
        "date": "03102015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Credit Suisse poaches Prudential's Thiam for Asian push "
    },
    {
        "content": "* Credit Suisse shares rally 7.5 pct   (Adds Swiss media comment)",
        "date": "03102015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 10-Credit Suisse poaches Prudential's Thiam for Asian push "
    },
    {
        "content": "LONDON  March 10 Britain's top share index suffered its biggest decline so far this year on Tuesday  hit by drops in insurer Prudential and energy stocks such as BG .",
        "date": "03102015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UK's FTSE has worst day so far in 2015 as BG and Pru fall "
    },
    {
        "content": "Prudential PLC Chief Tidjane Thiam is slated to replace Credit Suisse Group AG's Brady Dougan as Chief Executive  the Financial Times reported  citing people briefed on the matter.",
        "date": "03092015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "Prudential's Thiam lined up to replace Dougan at Credit Suisse: FT "
    },
    {
        "content": "LONDON  March 10 Britain's top share index was headed for its worst drop since mid-January on Tuesday following a sharp fall in insurer Prudential prompted by the departure of its chief executive officer for Credit Suisse .",
        "date": "03102015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UK's FTSE on track for worst fall since January as Pru drops "
    },
    {
        "content": "LONDON  March 10 Britain's top share index fell further from record highs on Tuesday  pegged back by Prudential  after the insurer said its CEO was leaving for Credit Suisse.",
        "date": "03102015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Pru and oil stocks push UK's FTSE further from record highs "
    },
    {
        "content": "March 9 Prudential PLC Chief Tidjane Thiam is slated to replace Credit Suisse Group AG's  Brady Dougan as Chief Executive  the Financial Times reported  citing people briefed on the matter.",
        "date": "03092015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential's Thiam lined up to replace Dougan at Credit Suisse -FT "
    },
    {
        "content": "LONDON  March 10 Britain's top share index edged further from all-time highs on Tuesday  led down by heavyweight Prudential after the insurer said its CEO was leaving for Credit Suisse.",
        "date": "03102015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Pru CEO departure pushes Britain's FTSE further from all-time highs "
    },
    {
        "content": "LONDON Insurer Prudential  said on Tuesday its chief executive Tidjane Thiam is leaving to take the reins at Credit Suisse  as it reported a 14 percent rise in operating profits in 2014  sending its shares lower.",
        "date": "03102015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential CEO to join Credit Suisse  profits rise 14 percent "
    },
    {
        "content": "LONDON  March 10 Insurer Prudential said on Tuesday its chief executive Tidjane Thiam is leaving to take the reins at Credit Suisse  as it reported a 14 percent rise in operating profits in 2014  sending its shares lower.",
        "date": "03102015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "RPT-UPDATE 1-Prudential CEO to join Credit Suisse  profits rise 14 pct "
    },
    {
        "content": "* Shares down 2.5 pct to lead FTSE 100 faller   (Adds detail  ceo comment from statement)",
        "date": "03102015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "UPDATE 1-Prudential CEO to join Credit Suisse  profits rise 14 pct "
    },
    {
        "content": "LONDON  March 10 Insurer Prudential said on Tuesday its chief executive Tidjane Thiam would step down to join Credit Suisse as chief executive  as it reported a 14 percent rise in operating profits in 2014.",
        "date": "03102015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "Prudential 2014 CEO to join Credit Suisse  profits rise 14 pct "
    },
    {
        "content": "* Deal allows insurers to sell through DBS branches   (Adds details of other bidders  background on bancassurance)",
        "date": "02042015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "UPDATE 1-AIA  Pru among bidders for DBS's $1.5 bln distribution deal-sources "
    },
    {
        "content": "HONG KONG  Feb 4 AIA Group Ltd  Prudential plc and Manulife Financial Corp have been shortlisted to become the insurance partner of Singapore's DBS in a bank distribution deal worth around $1.5 billion  people familiar with the matter said.",
        "date": "02042015",
        "name": "Prudential Public Limited Company",
        "news_type": "normal",
        "symbol": "PUK",
        "title": "AIA  Pru bidding for DBS's $1.5 bln distribution deal-sources "
    },
    {
        "content": "Jan 28 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01282015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "MOVES- JP Morgan Chase  Oppenheimer  Wells Fargo  Fortress Investment "
    },
    {
        "content": "Lead Manager(s)         Credit Agricole CIB  Deutsche Bank  J.P. Morgan ",
        "date": "01122015",
        "name": "Prudential Public Limited Company",
        "news_type": "topStory",
        "symbol": "PUK",
        "title": "New Issue- Prudential prices 300 mln stg 2018 bond "
    }
]