[
    {
        "content": "* Greenlight Capital cuts share stake in Apple Inc by 44.2 percent to 2.2 million shares - SEC filing",
        "date": "11142017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-Greenlight Capital cuts share stake in Apple  General Motors "
    },
    {
        "content": "LONDON  Sept 19 U.S. designer Tommy Hilfiger closed out London Fashion Week with a rock-themed show held at a venue famous for classic rock concerts  featuring model and social media star Gigi Hadid as the centrepiece of the event.",
        "date": "09192017",
        "name": "PVH Corp",
        "news_type": "normal",
        "symbol": "PVH",
        "title": "Tommy Hilfiger closes out London Fashion Week with 'rock circus' show "
    },
    {
        "content": "* G-III Apparel Group Ltd announces joint venture for DKNY and Donna Karan in China",
        "date": "08232017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-G-III Apparel Group Ltd announces joint venture for DKNY and Donna Karan in China "
    },
    {
        "content": "* Dispute highlights wider concerns over pollution in Vietnam",
        "date": "07212017",
        "name": "PVH Corp",
        "news_type": "normal",
        "symbol": "PVH",
        "title": "Vietnam pollution fight hits supplier to global fashion brands "
    },
    {
        "content": "* PVH Corp announces licensing agreement with sports products of America for IZOD women's sportswear & activewear",
        "date": "06072017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH Corp announces licensing agreement with Sports Products of America for IZOD women's sportswear & activewear "
    },
    {
        "content": "* Indexes up: Dow 0.39 pct  S&P 0.46 pct  Nasdaq 0.59 pct (Adds details  changes comment  updates prices)",
        "date": "05252017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "US STOCKS-Rare retail bright spot boosts S&P  Nasdaq to records "
    },
    {
        "content": "* Pvh corp. Reports 2017 first quarter revenue and eps above guidance and raises full year guidance",
        "date": "05242017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH corp Q1 adjusted earnings per share $1.65 "
    },
    {
        "content": "May 25 U.S. stock index futures were higher on Thursday after minutes of the Federal Reserve's latest meeting showed policymakers expected the economy to pick up momentum and that they would raise interest rates soon.",
        "date": "05252017",
        "name": "PVH Corp",
        "news_type": "normal",
        "symbol": "PVH",
        "title": "US STOCKS-Futures up as Fed minutes show economic growth to pick up "
    },
    {
        "content": "* G-III Apparel Group- entered multi-year license agreement with PVH Corp under which PVH will design distribute menswear for DKNY brand in U.S.  Canada Source text for Eikon: Further company coverage:",
        "date": "05222017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-G-III Apparel Group enters multi-year license agreement with PVH Corp "
    },
    {
        "content": "* Says CEO Emanuel Chirico's FY 2016 total compensation was $16.1 million versus $11.6 million in FY 2015 - sec filing",
        "date": "05052017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH says CEO Emanuel Chirico's FY 2016 total compensation was $16.1 mln "
    },
    {
        "content": "* PVH announces licensing agreement with USA Legwear for Warner's socks and hosiery",
        "date": "04132017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH announces licensing agreement with USA Legwear for Warner's socks and hosiery "
    },
    {
        "content": "* PVH Corp. And Li & Fung Limited form new strategic supply chain partnership",
        "date": "03242017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH Corp  Li & Fung Ltd form new strategic supply chain partnership "
    },
    {
        "content": "* Says number of directors constituting full board was increased to 12 in connection with this appointment  Source text for Eikon: Further company coverage:",
        "date": "03222017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH Corp appoints Amy McPherson to its board of directors "
    },
    {
        "content": "* PVH Corp reports 2016 fourth quarter and full year results and provides 2017 guidance",
        "date": "03222017",
        "name": "PVH Corp",
        "news_type": "normal",
        "symbol": "PVH",
        "title": "BRIEF-PVH Q4 non-gaap earnings per share $1.23 "
    },
    {
        "content": "* PVH Corp to acquire True&Co.  a direct-to-consumer intimate apparel e-commerce retailer",
        "date": "03162017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-Pvh Corp to buy True&Co "
    },
    {
        "content": "* PVH Corp. to acquire tommy hilfiger men's tailored clothing business for north america from marcraft",
        "date": "01242017",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH Corp to buy Tommy Hilfiger Men's Tailored Clothing Business for North America from Marcraft "
    },
    {
        "content": "* PVH Corp. appoints Judith Amanda Sourry Knox to its board of directors",
        "date": "09232016",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH Corp appoints Judith Amanda Sourry Knox to its board "
    },
    {
        "content": "* Disclosing that approximately 3% of its total net revenues are generated in United Kingdom  Source text (http://1.usa.gov/28S0XWJ) Further company coverage:",
        "date": "06242016",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH Corp discloses that about 3 pct of its total net revenues are generated in United Kingdom "
    },
    {
        "content": "* Commenced an offer to sell eur350 million principal amount of senior notes due 2024",
        "date": "06102016",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH launches EURO 350 mln private offering of senior notes "
    },
    {
        "content": "* Qtrly revenue in Calvin Klein business for quarter increased 13% on a constant currency basis from $654 million in prior year's q1",
        "date": "05252016",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH Corp Q1 non-gaap earnings per share $1.50 "
    },
    {
        "content": "* JV will license from units of PVH rights to operate and manage distribution of Calvin Klein  Tommy Hilfiger  Warner's  Olga and Speedo brand products in Mexico",
        "date": "05192016",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "BRIEF-PVH  Grupo Axo set up joint venture to distribute Calvin Klein  Tommy Hilfiger in Mexico "
    },
    {
        "content": "MUMBAI  Jan 29 (Thomson Reuters Foundation) - Clothing companies H&M  Inditex  C&A and PVH have committed to improving the lives of workers in India's southern city of Bengaluru  after a report said employees lived in appalling conditions and were denied decent wages and freedom of movement.",
        "date": "01292016",
        "name": "PVH Corp",
        "news_type": "normal",
        "symbol": "PVH",
        "title": "Global apparel brands pledge to improve conditions for Bengaluru workers "
    },
    {
        "content": "PVH Corp  reported better-than-expected quarterly profit and sales  helped by higher demand for clothing and accessories under its Calvin Klein brand in North America and Europe.",
        "date": "08262015",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "PVH profit  sales beat on demand for Calvin Klein apparel "
    },
    {
        "content": "Aug 26 PVH Corp reported better-than-expected quarterly profit and sales  helped by higher demand for clothing and accessories under its Calvin Klein brand in North America and Europe.",
        "date": "08262015",
        "name": "PVH Corp",
        "news_type": "normal",
        "symbol": "PVH",
        "title": "UPDATE 1-PVH profit  sales beat on demand for Calvin Klein apparel "
    },
    {
        "content": "Aug 26 PVH Corp  the maker of apparel under the Calvin Klein and Tommy Hilfiger brands  reported a 5.6 percent fall in quarterly revenue as a strong dollar hurt spending by tourists in the United States and reduced the value of sales from Europe.",
        "date": "08262015",
        "name": "PVH Corp",
        "news_type": "normal",
        "symbol": "PVH",
        "title": "Branded apparel maker PVH Corp's revenue falls 5.6 pct "
    },
    {
        "content": "July 7 PVH Corp said it would wind down the production of Donald Trump's menswear after exclusive retail partner Macy's Inc decided to stop selling his products in protest against racist remarks made by the real estate tycoon.",
        "date": "07072015",
        "name": "PVH Corp",
        "news_type": "normal",
        "symbol": "PVH",
        "title": "PVH's apparel deal with Trump ends as Macy's cuts ties with tycoon "
    },
    {
        "content": "PVH Corp   owner of clothing brands such as Calvin Klein and Tommy Hilfiger  forecast lower-than-expected profit for the first quarter and the full year  as it expects to be hurt by a strengthening dollar.",
        "date": "03252015",
        "name": "PVH Corp",
        "news_type": "topStory",
        "symbol": "PVH",
        "title": "Calvin Klein owner PVH expects strong dollar to hurt profit "
    },
    {
        "content": "March 25 PVH Corp  owner of clothing brands such as Calvin Klein and Tommy Hilfiger  forecast lower-than-expected profit for the first quarter and the full year  as it expects to be hurt by a strengthening dollar.",
        "date": "03252015",
        "name": "PVH Corp",
        "news_type": "normal",
        "symbol": "PVH",
        "title": "UPDATE 1-Calvin Klein owner PVH expects strong dollar to hurt profit "
    },
    {
        "content": "March 25 PVH Corp  which owns clothing brands such as Tommy Hilfiger  reported a marginal increase in quarterly sales  helped by higher demand for its Calvin Klien line of apparel in North America.",
        "date": "03252015",
        "name": "PVH Corp",
        "news_type": "normal",
        "symbol": "PVH",
        "title": "PVH Corp reports marginal rise in sales "
    }
]