[
    {
        "content": "FRANKFURT  Nov 8 Industrial gases group Linde has exceeded an important 74 percent approval threshold for its planned $80 billion tie-up with Praxair   it said on Wednesday.",
        "date": "11082017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde reaches important acceptance level for Praxair merger "
    },
    {
        "content": "FRANKFURT Industrial gases group Linde  has cut the approval threshold and extended a deadline for accepting its $80 billion tie-up with Praxair   while pushing on with plans to get a green light from regulators.",
        "date": "10232017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde cuts threshold for $80 billion Praxair deal  prepares asset sales "
    },
    {
        "content": "LONDON/MUNICH German industrial gases maker Linde  reported a 3 percent rise in third-quarter core profit  the high-end of forecasts  as a row brewed over the future of its engineering and healthcare units after a planned merger with Praxair .",
        "date": "10272017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde trims costs  lifts margins as Praxair row brews "
    },
    {
        "content": "* Praxair Inc - ‍declared a quarterly dividend of 78.75 cents per share  unchanged from previous quarter​ Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair Inc - ‍declared a quarterly dividend of 78.75 cents per share "
    },
    {
        "content": "* Praxair signs new long-term contract with BASF in the u.s. Gulf coast",
        "date": "10252017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair signs long-term contract with BASF in the U.S. Gulf coast "
    },
    {
        "content": "* Praxair signs long-term agreement to supply Samsung display complex in Tangjeong  South Korea",
        "date": "10242017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair signs long-term agreement to supply Samsung display complex in Tangjeong "
    },
    {
        "content": "* Divestitures worth up to 7.5 bln euros next step -sources (Adds details  background)",
        "date": "10232017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 2-Linde cuts threshold for $80 bln Praxair deal  prepares asset sales "
    },
    {
        "content": "FRANKFURT  Oct 23 German industrial gases groups Linde has lowered the acceptance threshold for its planned $80 billion merger with U.S. peer Praxair to 60 from 75 percent.",
        "date": "10232017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde lowers acceptance threshold for Praxair merger to 60 percent "
    },
    {
        "content": "* Praxair CFO casts doubt over future of engineering  healthcare",
        "date": "10272017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 3-Linde trims costs  lifts margins as Praxair row brews "
    },
    {
        "content": "* Sees Q4 2017 earnings per share $1.45 to $1.50 excluding items",
        "date": "10262017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Praxair reports Q3 earnings per share $1.50 excluding items "
    },
    {
        "content": "LONDON  Oct 27 The finance chiefs of industrial gases groups Linde and Praxair will meet soon to sort out a row over the future of Linde's engineering division after the planned merger of the two companies  Linde's chief executive said on Friday.",
        "date": "10272017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde  Praxair CFOs to meet soon to sort out engineering unit rift "
    },
    {
        "content": "* Says 67.9 pct of shares have been tendered for exchange in Praxair merger",
        "date": "10272017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Linde CEO says 67.9 pct of shares tendered for exchange so far "
    },
    {
        "content": "LONDON  Oct 27 German industrial gases group Linde  which is striving for an $80 billion merger with U.S. peer Praxair  reported third-quarter core earnings above analysts' forecasts and confirmed its sales and earnings targets for 2017.",
        "date": "10272017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde beats profit expectations  misses on sales "
    },
    {
        "content": "FRANKFURT  Oct 20 German industrial gases group Linde has passed an important threshold in its exchange offer for the planned $80 billion merger with U.S. peer Praxair.",
        "date": "10202017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde passes important 50 percent threshold in Praxair tender "
    },
    {
        "content": "* Praxair signs long-term agreement to supply nitrogen to globalfoundries",
        "date": "10172017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair signs agreement to supply nitrogen to GlobalFoundries "
    },
    {
        "content": "* Shareholders representing 45.8 percent of capital accept exchange offer for praxair merger by Oct 17",
        "date": "10172017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Linde says 46 percent of shares tendered for planned Praxair merger "
    },
    {
        "content": "BERLIN Industrial gases firms Air Products and Air Liquide may bid for parts of peers Linde  and Praxair  that the two groups may be forced to divest in the event of a merger  Frankfurter Allgemeine Zeitung reported on Friday.",
        "date": "10132017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Industrial gases firms eye Linde-Praxair parts: Frankfurter Allgemeine "
    },
    {
        "content": "* 33.21 percent of Linde's shares have been tendered for planned merger with Praxair as of Oct 10",
        "date": "10102017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Linde says 33.21 pct of shares tendered for Praxair merger "
    },
    {
        "content": "BERLIN  Oct 13 Industrial gases firms Air Products and Air Liquide may bid for parts of peers Linde and Praxair that the two groups may be forced to divest in the event of a merger  Frankfurter Allgemeine Zeitung reported on Friday.",
        "date": "10132017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Industrial gases firms eye Linde-Praxair parts -Frankfurter Allgemeine "
    },
    {
        "content": "* Praxair signs long-term contract to supply Huali Microelectronics at Kangqiao Industrial Park in Shanghai  China",
        "date": "10132017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Praxair signs long-term contract to supply Huali Microelectronics "
    },
    {
        "content": "BERLIN  Oct 9 German investors' association DSW recommended on Monday that shareholders in industrial gases group Linde not  tender their shares in an exchange offer for its planned $80 billion merger with U.S. peer Praxair .",
        "date": "10092017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "DSW investor group rejects Linde-Praxair merger offer "
    },
    {
        "content": "FRANKFURT  Oct 5 German industrial gases group Linde urged investors to tender their shares in an exchange offer for its planned $80 billion merger with U.S. peer Praxair as a deadline approaches to reach 75 percent acceptance.",
        "date": "10052017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde urges investors to exchange shares for Praxair merger "
    },
    {
        "content": "Oct 5 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Thursday:",
        "date": "10052017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* All-share merger to create $80 bln company (Adds Deutsche Boerse-LSE merger  paragraphs 6-7)",
        "date": "10052017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 1-Linde urges investors to exchange shares for Praxair merger "
    },
    {
        "content": "* Says ‍business combination is expected to be completed in second half of 2018​",
        "date": "09272017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair shareholders vote in favor of Linde AG merger "
    },
    {
        "content": "The following are some of the factors that may move German stocks on Wednesday:",
        "date": "09272017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "German stocks - Factors to watch on September 27 "
    },
    {
        "content": "OSLO The proposed $74 billion tie-up of German industrial gases group Linde  and U.S. peer Praxair  got a boost on Tuesday when the world's biggest sovereign wealth fund said it was backing the deal.",
        "date": "09192017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Norway's $1 trillion wealth fund backs Linde-Praxair deal "
    },
    {
        "content": "OSLO  Sept 19 The proposed $74 billion tie-up of German industrial gases group Linde and U.S. peer Praxair got a boost on Tuesday when the world's biggest sovereign wealth fund said it was backing the deal.",
        "date": "09192017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "CORRECTED-UPDATE 1-Norway's $1 trillion wealth fund backs Linde-Praxair deal "
    },
    {
        "content": "FRANKFURT German industrial gases group Linde  does not rule out lowering the shareholder acceptance threshold for its planned $75 billion merger with U.S. peer Praxair   its chief executive told German magazine Euro.",
        "date": "09192017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde could lower threshold for Praxair exchange offer: Euro magazine "
    },
    {
        "content": "FRANKFURT  Sept 19 German industrial gases group Linde does not rule out lowering the shareholder acceptance threshold for its planned $75 billion merger with U.S. peer Praxair  its chief executive told German magazine Euro.",
        "date": "09192017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde could lower threshold for Praxair exchange offer -Euro magazine "
    },
    {
        "content": "OSLO  Sept 19 Norway's sovereign wealth fund  the world's largest  supports the planned merger of German industrial gases group Linde and U.S. peer Praxair   it said on Tuesday.",
        "date": "09192017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Norway's $1 trillion wealth fund backs Linde-Praxair combination "
    },
    {
        "content": "FRANKFURT Linde  and Praxair  said late on Monday they  were responding to a second request from the U.S. Federal Trade Commission regarding their planned $74 billion merger and were in a pre-notification phase with the European Commission.",
        "date": "08292017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde  Praxair get second antitrust request from FTC "
    },
    {
        "content": "* Merger still seen closing in H2 2018 (Adds Linde comment  details on other antitrust filings  shares)",
        "date": "08292017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 1-Linde  Praxair get second antitrust request from FTC "
    },
    {
        "content": "FRANKFURT  Aug 29 Linde and Praxair received a second request for information in August from U.S. antitrust regulator FTC regarding their planned merger and are in the process of responding  they said in a regulatory filing late on Monday.",
        "date": "08292017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde  Praxair received second request from U.S. anti-trust regulator "
    },
    {
        "content": "FRANKFURT  Aug 21 The leadership of German industrial gases group Linde on Monday urged shareholders to accept a proposed $74 billion merger with U.S. peer Praxair.",
        "date": "08212017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde management  supervisory boards recommend Praxair deal "
    },
    {
        "content": "FRANKFURT  Aug 15 German industrial gases group Linde said the 10-week acceptance period for its proposed $74 billion merger with U.S. peer Praxair started on Tuesday and would run through Oct. 24.",
        "date": "08152017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde says acceptance period for Praxair merger starts "
    },
    {
        "content": "FRANKFURT The planned $74 billion merger of German industrial gases group Linde  and U.S. peer Praxair  is on course  with regulators expected to finish reviewing offer documents by mid-August  Linde said as it published financial results on Friday.",
        "date": "07282017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde says Praxair merger process on track "
    },
    {
        "content": "* Linde Q2 operating profit beats consensus (Recasts  adds CFO comment  Praxair comment)",
        "date": "07282017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 2-Linde says Praxair merger process on track "
    },
    {
        "content": "FRANKFURT  July 28 German industrial gases group Linde beat expectations with a 2 percent increase in second-quarter operating profit driven by its core gases division and confirmed its full-year outlook on Friday.",
        "date": "07282017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde confirms outlook; no update on Praxair merger "
    },
    {
        "content": "* Sets quarterly dividend of $0.7875per share Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair sets quarterly dividend of $0.7875per share "
    },
    {
        "content": "* Sees Q3 2017 earnings per share $1.40 to $1.46 excluding items",
        "date": "07272017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Praxair reports Q2 earnings per share $1.41 "
    },
    {
        "content": "* Started up new air separation plant for Nanjing Jinling Huntsman New Materials Co.  Ltd.  a joint venture between Sinopec Jinling and Huntsman​ Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07202017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair announces air separation plant "
    },
    {
        "content": "* On June 30  Co entered into a 364-day credit agreement - SEC filing",
        "date": "07052017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair enters into credit agreement for revolving commitments of $500 mln "
    },
    {
        "content": "FRANKFURT  June 23 German industrial gases group Linde will terminate its American depository receipt programme on Sept. 29 due to its planned $74 billion merger with U.S. peer Praxair  it said on Friday.",
        "date": "06232017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde to terminate ADRs due to Praxair merger "
    },
    {
        "content": "MUNICH German industrial gases company Linde  turned its attention on Friday to winning over investors to its planned $75 billion merger with U.S. peer Praxair   a task that Chairman Wolfgang Reitzle said was not straightforward. | Video ",
        "date": "06022017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde turns to winning over investors to Praxair merger "
    },
    {
        "content": "* Energy stocks  Vestas fall on U.S. climate withdrawal (Adds details  closing prices)",
        "date": "06022017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "European shares ends off highs as US jobs growth slows; DAX shines "
    },
    {
        "content": "* Winning shareholder approval \"not trivial\" - Linde chairman",
        "date": "06022017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 2-Linde turns to winning over investors to Praxair merger "
    },
    {
        "content": "FRANKFURT/MUNICH The boards of Linde  and Praxair  voted on Thursday to merge  creating a $73 billion global industrial gases leader in what is likely to be the last in a wave of combinations that has resulted in a highly consolidated market.",
        "date": "06012017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde  Praxair agree $73 billion merger to create global gases leader "
    },
    {
        "content": "FRANKFURT/MUNICH A crack has appeared in German labor opposition to Linde's  proposed merger with U.S. peer Praxair   three people familiar with the deal told Reuters  making it likely that the $73 billion deal will be approved on Thursday.",
        "date": "05312017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde-Praxair merger seen more likely as labor opposition wavers "
    },
    {
        "content": "* Says may have to dispose of more assets than expected but that wouldn't derail the Praxair merger",
        "date": "06022017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Linde chairman says may have to dispose of more assets than expected "
    },
    {
        "content": "MUNICH  June 2 An offer to Linde investors to tender their shares to a new merged Linde-Praxair industrial gases group is likely be launched around September  the chief executives of the German and U.S. companies told Reuters on Friday.",
        "date": "06022017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde  Praxair expect offer to Linde shareholders in September "
    },
    {
        "content": "FRANKFURT/MUNICH  June 1 The boards of Linde and Praxair voted on Thursday to merge  creating a $73 billion global industrial gases leader in what is likely to be the last in a wave of combinations that has resulted in a highly consolidated market.",
        "date": "06012017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "CORRECTED-UPDATE 2-Linde  Praxair agree $73 bln merger to create global gases leader "
    },
    {
        "content": "FRANKFURT  June 1 Linde said its supervisory board voted on Thursday to approve the German industrial gases group's $73 billion merger with U.S. peer Praxair.",
        "date": "06012017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde supervisory board approves Praxair merger "
    },
    {
        "content": "* Linde supervisory board said to approve praxair deal- Bloomberg  citing sources",
        "date": "06012017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Linde supervisory board said to approve Praxair deal- Bloomberg  citing sources "
    },
    {
        "content": "* Chairman Reitzle could be spared need to use casting vote (Releads with uncertainty over labour opposition  changes dateline)",
        "date": "05312017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 2-Linde-Praxair merger seen more likely as labour opposition wavers "
    },
    {
        "content": "FRANKFURT/MUNICH Labor representatives on Linde's  supervisory board may not vote unanimously against the German industrial gases group's planned $73 billion merger with U.S. peer Praxair   three sources familiar with the matter told Reuters.",
        "date": "05312017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Labor representatives may not be unanimous against Praxair merger: sources "
    },
    {
        "content": "BERLIN/FRANKFURT  June 1 The DAX top-30 index looked set to open 0.3 percent higher on Thursday  according to premarket data from brokerage Lang & Schwarz at 0601 GMT.",
        "date": "06012017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "German stocks - Factors to watch on June 1 "
    },
    {
        "content": "FRANKFURT/MUNICH  May 31 Labour representatives on Linde's supervisory board may not vote unanimously against the German industrial gases group's planned $73 billion merger with U.S. peer Praxair  three sources familiar with the matter told Reuters.",
        "date": "05312017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Labour reps may not be unanimous against Praxair merger-sources "
    },
    {
        "content": "MUNICH  June 2 Linde and Praxair expect to have to divest assets above all in the United States to satisfy anti-trust concerns as the two industrial gases groups prepare for their $73 billion merger  Linde's chief executive said.",
        "date": "06022017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde sees U.S. disposals as part of Praxair merger remedies "
    },
    {
        "content": "BERLIN  May 31 German Economy Minister Brigitte Zypries urged German industrial gases group Linde on Wednesday not to force through a planned $73 billion merger with U.S. peer Praxair against the will of German workers.",
        "date": "05312017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Berlin urges Linde to consider workers' views in Praxair merger "
    },
    {
        "content": "* Energy stocks  Vestas fall on U.S. climate withdrawal (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon  see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "06022017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "FTSE hits new record  Europe boosted by appetite for riskier assets "
    },
    {
        "content": "FRANKFURT German industrial gases group Linde  and U.S. peer Praxair  have reached a deal in principle on details of their proposed $70 billion merger  Linde said on Wednesday.",
        "date": "05242017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde  Praxair reach agreement on details of merger "
    },
    {
        "content": "MUNICH German industrial gases group Linde's  supervisory board is due to vote on a merger agreement with U.S. peer Praxair  on June 1  two people close to the matter told Reuters on Friday.",
        "date": "05262017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde board to vote on Praxair merger on June 1: sources "
    },
    {
        "content": "May 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "05242017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Unanswered questions to be addressed at meeting -source (Adds further comments by source  background)",
        "date": "05262017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 1-Linde board to vote on Praxair merger on June 1 -sources "
    },
    {
        "content": "* Praxair Inc. confirms agreement in principle regarding a business combination agreement with Linde AG subject to board approvals of both parties",
        "date": "05242017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Praxair confirms agreement in principle regarding deal with Linde AG "
    },
    {
        "content": "MUNICH  May 26 German industrial gases group Linde's supervisory board is due to meet on Thursday to vote on a merger agreement with U.S. peer Praxair  two people familiar with the matter told Reuters on Friday.",
        "date": "05262017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde board to vote on Praxair merger on Thursday - sources "
    },
    {
        "content": "* Linde shares up 4 pct  Praxair up 2.5 pct (Adds further details of deal  share price)",
        "date": "05242017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 1-Linde  Praxair reach agreement on details of merger "
    },
    {
        "content": "FRANKFURT  May 24 German industrial gases group Linde and U.S. peer Praxair have reached a deal in principle on their proposed $70 billion merger  Linde said on Wednesday.",
        "date": "05242017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde  Praxair reach deal on merger agreement "
    },
    {
        "content": "FRANKFURT  May 24 German industrial gases group Linde's supervisory board will vote next week on a merger agreement with U.S. peer Praxair  German weekly WirtschaftsWoche reported  citing sources close to the negotiations.",
        "date": "05242017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde board to vote on Praxair deal next week -WirtschaftsWoche "
    },
    {
        "content": "MUNICH The chairman of German industrial gases group Linde  got an effective green light on Wednesday for his long-desired $70 billion merger with U.S. peer Praxair despite a protest vote by shareholders dismayed at the way he is pushing it through.",
        "date": "05102017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde chairman survives protest vote over Praxair merger "
    },
    {
        "content": "FRANKFURT  May 6 Shareholder adviser Ivox Glass Lewis has called on Linde investors to vote against signing off on the actions of its management and supervisory board due to problems in the handling of a planned merger with peer Praxair.",
        "date": "05062017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Shareholder adviser challenges Linde board over merger with Praxair "
    },
    {
        "content": "* Reitzle reiterates would use casting vote to push merger through (Releads with vote  adds chairman  shareholder quotes)",
        "date": "05102017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 2-Linde chairman survives protest vote over Praxair merger "
    },
    {
        "content": "MUNICH  May 10 The new company formed from the planned $70 billion merger of Linde and Praxair will likely be based in Ireland with a tax domicile in Britain  its chief executive told shareholders on Wednesday.",
        "date": "05102017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde CEO sees new company after Praxair merger based in Ireland "
    },
    {
        "content": "MUNICH  May 10 German industrial gases group Linde expects to complete its planned $70 billion merger of equals with U.S. peer Praxair in 2018 if negotiations are successfully completed  Chief Executive Aldo Belloni told shareholders on Wednesday.",
        "date": "05102017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde CEO says expects to complete Praxair merger in 2018 "
    },
    {
        "content": "FRANKFURT  April 28 German industrial gases group Linde's $65 billion merger negotiations with U.S. peer Praxair are \"on track\" although slightly delayed  Linde's finance chief said on Friday.",
        "date": "04282017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde CFO says Praxair negotiations delayed but on track "
    },
    {
        "content": "* Soroban Capital GP LLC reports 6.2 percent passive stake in Praxair Inc as of April 18  2017 - SEC filing Source text: (http://bit.ly/2qc9cGR) Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "04272017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Soroban Capital reports 6.2 pct passive stake in Praxair - SEC filing "
    },
    {
        "content": "* Praxair commissions air separation plant On Burns Harbor  Indiana  pipeline system",
        "date": "04172017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair commissions air separation plant on Burns Harbor  Indiana "
    },
    {
        "content": "MUNICH  Germany Linde  and Praxair's  $65 billion merger talks are facing legal complexities that mean the agreement will not be finalised as planned before Linde's annual shareholder meeting on May 10  a source familiar with the situation said.",
        "date": "04132017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde-Praxair merger deal falls behind schedule: source "
    },
    {
        "content": "FRANKFURT  April 11 Germany's Linde has for a second time rejected a request for a shareholder vote at its annual general meeting next month on its planned $65 billion merger with U.S. industrial gases rival Praxair.",
        "date": "04112017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde rejects request to vote on Praxair merger at AGM "
    },
    {
        "content": "* Linde says still working towards May 10 deadline (Adds details  background)",
        "date": "04132017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 1-Linde-Praxair merger deal falls behind schedule -source "
    },
    {
        "content": "MUNICH  Germany  April 7 Munich prosecutors are not initiating any investigation into  Linde Chairman Wolfgang Reitzle in connection with his actions around a planned merger with U.S. rival Praxair  a spokeswoman for the prosecutor's office said on Friday.",
        "date": "04072017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Munich prosecutors not starting probe of Linde Chairman Reitzle "
    },
    {
        "content": "MUNICH  Germany The labor and capital representatives on Linde's  supervisory board stuck to their opposing positions over a planned merger with Praxair  at a meeting on Thursday  a supervisory board source told Reuters after the meeting.",
        "date": "04062017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde board equally split on Praxair merger -source "
    },
    {
        "content": "FRANKFURT The chairman of German industrial gases group Linde  is prepared to use his casting vote to push through a $65 billion merger with U.S. rival Praxair  in the face of worker opposition  he told the Financial Times.",
        "date": "04032017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde chairman ready to use casting vote for Praxair merger: FT "
    },
    {
        "content": "MUNICH  Germany  April 13 A $65 billion merger contract between industrial gases groups Linde and Praxair will not be ready as planned by Linde's annual shareholder meeting on May 10  a source familiar with the situation told Reuters on Thursday.",
        "date": "04132017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde-Praxair agreement will not be ready by May 10 AGM -source "
    },
    {
        "content": "* Set for showdown at supervisory board meeting on May 3 (Adds details on merger agreement  procedure  shares)",
        "date": "04062017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 1-Linde board equally split on Praxair merger -source "
    },
    {
        "content": "FRANKFURT  April 3 The chairman of German industrial gases group Linde is prepared to use his casting vote to push through a $65 billion merger with U.S. rival Praxair in the face of worker opposition  he told the Financial Times.",
        "date": "04032017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde chairman ready to use casting vote for Praxair merger -FT "
    },
    {
        "content": "MUNICH  Germany  April 6 The labour and capital representatives on Linde's supervisory board remain committed to their opposing positions over a planned merger with Praxair  a supervisory board source told Reuters after a board meeting on Thursday.",
        "date": "04062017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde board still equally divided on Praxair merger -source "
    },
    {
        "content": "FRANKFURT/MUNICH  March 30 Linde labour representatives threatened on Thursday to scupper the German industrial gases group's planned $65 billion merger with U.S. rival Praxair  urging their board members to vote against the deal and enlisting Berlin's support.",
        "date": "03302017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Unions threaten to scupper Linde-Praxair merger "
    },
    {
        "content": "BERLIN  March 29 European worker representatives of German industrial gases group Linde are opposed to a merger with U.S. rival Praxair and want labour members of the supervisory board to vote against the deal  a letter seen by Reuters shows.",
        "date": "03292017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Praxair-Linde merger opposed by European works council "
    },
    {
        "content": "* Says employee representatives on board to vote against it (Recasts with works council chief comments)",
        "date": "03302017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 1-Unions threaten to scupper Linde-Praxair merger "
    },
    {
        "content": "* Praxair Inc - Praxair Surface Technologies subsidiary was awarded a long-term contract by leading aero engine manufacturer Rolls-Royce",
        "date": "03282017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair Inc's subsidiary signs long-term contract to supply Rolls-Royce "
    },
    {
        "content": "MUNICH  Germany  March 30 Linde's works council chief will vote against the German industrial gases group's planned $65 billion merger with U.S. rival Praxair when it comes up for approval by the supervisory board  he told Reuters on Thursday.",
        "date": "03302017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde works council chief says to vote against Praxair merger "
    },
    {
        "content": "* Praxair inc - ceo stephen angel's 2016 total compensation was $13 million versus $15.1 million in 2015 - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "03152017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair CEO Stephen Angel's 2016 total compensation $13 mln vs $15.1 mln "
    },
    {
        "content": "MUNICH  Germany Finalizing a merger with Praxair  is likely to take \"several months\"  the chief executive of Linde  said in a letter to a shareholder association  reiterating he saw no need to ask shareholders to vote on the $65 billion deal.",
        "date": "03082017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Praxair merger likely to take several months: Linde CEO "
    },
    {
        "content": "MUNICH  Germany  March 8 Finalising a merger with Praxair is likely to take \"several months\"  the chief executive of Linde said in a letter to a shareholder association  reiterating he saw no need to ask shareholders to vote on the $65 billion deal.",
        "date": "03082017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Praxair merger likely to take several months - Linde CEO "
    },
    {
        "content": "MUNICH  Germany  March 2 German worker opposition to Linde's planned merger with Praxair  has resurfaced after trade union IG Metall learned of a message from Praxair's chief executive promising to run the company in the style of more profitable Praxair.",
        "date": "03022017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "German union opposition to Praxair-Linde merger resurfaces "
    },
    {
        "content": "FRANKFURT  March 9 German industrial gases group Linde is seeing interest in assets it may have to divest in the course of a planned merger with U.S. rival Praxair   its chief executive said.",
        "date": "03092017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde sees interest in assets it may have to sell "
    },
    {
        "content": "MUNICH  Germany  March 9 The chief executive of German industrial gases group Linde is working hard to win over employees sceptical about the benefits of a planned $65 billion merger with U.S. rival Praxair  he said on Thursday.",
        "date": "03092017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde CEO steps up efforts to win over workers to Praxair merger "
    },
    {
        "content": "* Healthcare sales up 4 percent  engineering down 9 percent   (Adds details on units  CEO quote  Praxair comparison)",
        "date": "03092017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 1-Linde says Praxair merger on track  seeks higher margin "
    },
    {
        "content": "MUNICH  Germany  March 9 German industrial gases group Linde said its planned merger with U.S. rival Praxair was on track  with the two parties still aiming to finalise an agreement on combining their businesses by the end of April or beginning of May.",
        "date": "03092017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde says Praxair merger on track  seeks higher profitability "
    },
    {
        "content": "LONDON  Feb 22 Tobacco company Imperial Brands  and nutritional ingredients maker Glanbia are attractive targets for Japanese companies looking to expand into international markets  Exane BNP Paribas analysts said in a note to clients.",
        "date": "02222017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Exane adds Imperial Brands and Glanbia to M&A targets list "
    },
    {
        "content": "* Praxair signs long-term agreement with celanese to supply carbon monoxide  oxygen and nitrogen in the U.S. Gulf coast",
        "date": "02212017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair signs long-term agreement with Celanese to supply carbon monoxide  oxygen and nitrogen in the U.S. Gulf coast "
    },
    {
        "content": "* Praxair starts up hydrogen facility for the Dow Chemical company in U.S. Gulf coast; signs long-term nitrogen supply agreement",
        "date": "02012017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair starts up hydrogen facility for the Dow Chemical company in U.S. Gulf coast "
    },
    {
        "content": "* Praxair signs long-term U.S. Gulf Coast hydrogen supply agreement with Marathon Petroleum Corporation",
        "date": "01232017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair signs hydrogen supply agreement with Marathon Petroleum "
    },
    {
        "content": "* Q4 earnings per share view $1.41 -- Thomson Reuters I/B/E/S",
        "date": "01262017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair Q4 EPS $1.41 "
    },
    {
        "content": "* Praxair declares 24th consecutive annual dividend increase in first quarter 2017",
        "date": "01262017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Praxair raises quarterly dividend by 5 pct to $0.7875/shr "
    },
    {
        "content": "FRANKFURT  Jan 13 Germany's financial and markets regulator BaFin said it had begun a formal investigation into suspected insider trading in Linde shares in the run-up to the announcement of merger talks with U.S. rival Praxair in August.",
        "date": "01132017",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "German regulator investigates pre-merger trading in Linde shares "
    },
    {
        "content": "SAO PAULO  Jan 11 IBG-Indústria Brasileira de Gases Ltda may bid for assets of proposed merger partners Praxair Inc and Linde AG should Brazilian antitrust watchdog Cade force them to divest businesses to approve their deal  Valor Econômico newspaper said on Wednesday.",
        "date": "01112017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Brazil's IBG eyes Praxair-Linde assets amid merger -Valor "
    },
    {
        "content": "* Praxair starts up fourth air separation plant at Samsung Electronics in Hwasung  South Korea",
        "date": "01092017",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair starts fourth air separation plant at Samsung Electronics in South Korea "
    },
    {
        "content": "FRANKFURT German industrial gases group Linde  and U.S. suitor Praxair  have agreed an outline for a $65 billion-plus merger  with the combined company to be run out of the United States by Praxair's chief executive. | Video ",
        "date": "12212016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde  Praxair agree $65 billion merger outline  ambitious cost savings "
    },
    {
        "content": "MUNICH Linde  plans to move its Engineering business to a separate legal entity as part of a proposed merger with U.S. rival Praxair   the German industrial gases group's chief executive said in a letter to employees.",
        "date": "12202016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde to move Engineering ops to separate legal entity "
    },
    {
        "content": "Praxair Inc and Linde AG  the industrial gas companies that agreed earlier this month to revive merger talks  are close to finalizing the terms of the potential deal  people familiar with the matter said on Friday.",
        "date": "12162016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Praxair  Linde close to finalizing merger terms: sources "
    },
    {
        "content": "FRANKFURT Labor unions have secured guarantees for a planned merger of Linde  and U.S. rival Praxair   saying on Friday there would be no forced layoffs at Linde in Germany until Dec. 31  2021 in case of a tie-up.",
        "date": "12092016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "No forced layoffs in Germany by 2021 if Linde  Praxair merge: union "
    },
    {
        "content": "FRANKFURT Germany's Linde agreed to revive talks with U.S. rival Praxair  to create a $65 billion industrial gases giant which will have its main operations run from Connecticut  two sources familiar with the deal said on Wednesday.",
        "date": "12072016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde resumes merger talks with Praxair  CEO resigns "
    },
    {
        "content": "FRANKFURT Praxair's and Linde's shareholders are to own equal parts in the industrial gases group created by a proposed merger of the two companies  people close to the deal said.",
        "date": "12072016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Merged Praxair  Linde to 50:50 percent owned by each: sources "
    },
    {
        "content": "FRANKFURT Praxair enticed prospective merger partner Linde into resuming negotiations by offering to locate some central functions of the combined group in Germany  two people familiar with the matter told Reuters on Wednesday.",
        "date": "12072016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Parts of mooted Praxair-Linde group to be run out of Germany: sources "
    },
    {
        "content": "FRANKFURT Linde  supervisory board Chairman Wolfgang Reitzle is still in favor of a tie-up between the German industrial gases maker and U.S. rival Praxair   which has made a renewed merger proposal  German newspaper Handelsblatt reported.",
        "date": "12012016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde chairman backs deal with Praxair: Handelsblatt "
    },
    {
        "content": "* Confirms company has approached Linde AG about resuming discussions regarding a potential merger",
        "date": "11292016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair confirms it has approached Linde AG about resuming discussions regarding potential merger "
    },
    {
        "content": "* Says received revised proposal concerning a potential merger of equals with Praxair Inc",
        "date": "11292016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Linde receives revised merger proposal from Praxair "
    },
    {
        "content": "FRANKFURT/MUNICH U.S. industrial gases group Praxair  has revived efforts to combine with German rival Linde   seeking to overcome differences over key personnel and location of headquarters that scuppered previous talks in September.",
        "date": "11302016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde considers fresh merger overture from Praxair "
    },
    {
        "content": "MUNICH/FRANKFURT German industrial gases group Linde's  supervisory board is expected to discuss a fresh merger overture by Praxair  at its next regular meeting on December 7  a person familiar with the matter told Reuters on Wednesday.",
        "date": "11302016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde board likely to discuss Praxair approach on December 7: source "
    },
    {
        "content": "FRANKFURT  Nov 29 German industrial gases group Linde has received a fresh approach from U.S. rival Praxair for a merger of equals and its executive board is reviewing the proposal.",
        "date": "11302016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "CORRECTED-UPDATE 2-Linde considers fresh merger overture from Praxair "
    },
    {
        "content": "FRANKFURT  Nov 23 Germany's Linde is in talks with China's acquisitive transportation and leisure giant HNA Group over its temperature-controlled logistics unit Gist  two people close to the matter said.",
        "date": "11232016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde in talks with HNA about logistics unit Gist - sources "
    },
    {
        "content": "* Praxair expands on-site business for wastewater customers in China",
        "date": "10262016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair expands on-site business for wastewater customers in China "
    },
    {
        "content": "* Praxair signs long-term contract with Meglobal  expands carbon dioxide capabilities in the u.s. Gulf coast",
        "date": "10262016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Praxair signs contract with Meglobal  expands carbon dioxide capabilities in U.S. Gulf coast "
    },
    {
        "content": "MUNICH  Germany German industrial gases group Linde  is not considering reviving merger talks with rival Praxair   its outgoing chief executive told Reuters on Friday.",
        "date": "10282016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde CEO says no question of reviving Praxair talks "
    },
    {
        "content": "* Sets quarterly dividend of $0.75 per share  Source text for Eikon:  Further company coverage:",
        "date": "10272016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair sets quarterly dividend of $0.75 per share "
    },
    {
        "content": "* Shares pare early gains  up 1.7 percent   (Adds comments on profitability  divestments  markets)",
        "date": "10282016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "INTERVIEW-Linde CEO says no question of reviving Praxair talks "
    },
    {
        "content": "MUNICH  Germany  Oct 28 German industrial gases group Linde can have a bright future even if it does not merge with a rival  its chief executive said on Friday after merger talks with U.S. peer Praxair failed last month.",
        "date": "10282016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde CEO says company has much potential without merger "
    },
    {
        "content": "MUNICH  Germany  Oct 28 Germany's Linde   the world's biggest maker of industrial gases by sales  said on Friday it had launched a new efficiency programme following the collapse last month of its merger talks with U.S. rival Praxair.",
        "date": "10282016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde launches new savings programme after failed merger "
    },
    {
        "content": "* Praxair Inc - has started up its second air separation plant and is extending its pipeline system in Port of Antwerp",
        "date": "10112016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair starts up its second air separation plant "
    },
    {
        "content": "FRANKFURT  Oct 7 Linde  the world's biggest industrial gases group by revenue  plans to cut costs and may and may close some sites abroad after failing to merge with U.S. rival Praxair  German weekly Spiegel reported.",
        "date": "10072016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Linde plans to cut costs after Praxair merger -Spiegel "
    },
    {
        "content": "* New facility adjacent to hydrogen plant will recover and purify carbon dioxide (co2) generated by SMR for production of food-grade liquid co2  Source text for Eikon:  Further company coverage:",
        "date": "10042016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair starts up new hydrogen plant in Peru "
    },
    {
        "content": "* Through its horizon 2 project  Fibria is expanding its Três Lagoas facility  located in state of mato grosso do sul",
        "date": "10062016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair signs long-term oxygen supply agreement with Brazilian pulp producer Fibria "
    },
    {
        "content": "* Signs long-term supply contract in South Korea  Source text for Eikon:  Further company coverage:",
        "date": "09262016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair signs long-term supply contract in South Korea "
    },
    {
        "content": "FRANKFURT  Sept 16 Germany's financial markets regulator BaFin on Friday said it had launched a routine investigation into whether industrial gases supplier Linde  held back information about the departure of top executives for too long.",
        "date": "09162016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "CORRECTED-(OFFICIAL)-Financial regulator investigates timing of Linde announcements "
    },
    {
        "content": "* Executive Board of Linde AG decided to terminate preliminary talks with Praxair  Inc. about a potential merger  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "09122016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Linde: executive board decides to end talks with Praxair "
    },
    {
        "content": "BERLIN  Sept 13 The chief executive of Linde  will not stay on when his contract expires next year  the industrial gases company said on Tuesday  joining the chief financial officer in departing after merger talks with U.S. rival Praxair collapsed.",
        "date": "09132016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde CEO to step down after Praxair deal falls through "
    },
    {
        "content": "FRANKFURT  Sept 12 The DAX top-30 index  looked set to open 1.6 percent lower on Monday  according to premarket data from brokerage Lang & Schwarz at 0644 GMT.",
        "date": "09122016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "German stocks - Factors to watch on September 12 "
    },
    {
        "content": "* Praxair Inc and Linde AG terminate preliminary talks about a potential merger",
        "date": "09122016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "BRIEF-Praxair Inc and Linde AG terminate preliminary talks about a potential merger "
    },
    {
        "content": "FRANKFURT  Sept 13 Linde said its finance chief Georg Denoke was leaving the management board  effective Tuesday  a day after merger talks ended between the German industrial gases group and U.S. rival Praxair.",
        "date": "09132016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Linde CFO leaves after Praxair talks collapse "
    },
    {
        "content": "NEW YORK/MUNICH U.S. industrial gas supplier Praxair Inc  and German peer Linde AG  are in early-stage talks about a merger to create a market leader with a value of more than $60 billion  Linde said on Tuesday  sending shares in both companies higher. | Video ",
        "date": "08162016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "Gas suppliers Praxair  Linde hold merger talks "
    },
    {
        "content": "Aug 16 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "08162016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Shares in Linde  Praxair jump   (Adds Praxair statement  updates shares)",
        "date": "08162016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "UPDATE 6-Gas suppliers Praxair  Linde hold merger talks "
    },
    {
        "content": "LONDON  Aug 16 European shares pulled back from 7-week highs on Tuesday  weighed down by industrial stocks  after Swiss firm Schindler lowered its outlook for 2016.",
        "date": "08162016",
        "name": "Praxair Inc",
        "news_type": "normal",
        "symbol": "PX",
        "title": "European shares pulled back from 7-week highs by industrials "
    },
    {
        "content": "* Praxair Inc in discussions to combine with Germany's Linde AG- source",
        "date": "08152016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair Inc in discussions to combine with Germany's Linde ag- source "
    },
    {
        "content": "* Sees Q3 2016 adjusted earnings per share $1.35 to $1.42 excluding items",
        "date": "07282016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair reports Q2 earnings per share $1.39 "
    },
    {
        "content": "* Says price increases of up to 15 pct for nitrogen  oxygen  argon  hydrogen  helium and carbon dioxide effective July 15  2016  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07012016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair says price up about 15 pct for nitrogen  oxygen  argon  hydrogen  helium and carbon dioxide effective July 15  2016 "
    },
    {
        "content": "* Says has completed the sale of its European CO2 business and its remaining 34 pct stake in the Yara Praxair Holding AS joint venture to Praxair for EUR 300 million ($335.91 million)",
        "date": "06022016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Yara completes sale of its European CO2 business to Praxair "
    },
    {
        "content": "* Uno-X Hydrogen AS  a NEL ASA joint venture  has entered into an agreement with a Norwegian affiliate of Praxair as a strategic alliance to install 20 hydrogen refuelling stations  covering all the major cities in Norway by 2020",
        "date": "05242016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-NEL partners with Praxair for Norwegian hydrogen refulleling station "
    },
    {
        "content": "* Praxair invests in the expansion of its Geismar  Louisiana facility",
        "date": "04272016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair invests in expansion of Geismar  Louisiana facility "
    },
    {
        "content": "* Q1 earnings per share view $1.27 -- Thomson Reuters I/B/E/S",
        "date": "04292016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair Inc Q1 adjusted EPS $1.28 "
    },
    {
        "content": "* Says signed a long term agreement to source carbon dioxide in US",
        "date": "04192016",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Praxair signs long-term agreement to source carbon dioxide in US "
    },
    {
        "content": "* Says signs a non-binding agreement with U.S.-based Praxair  Inc. to sell its European CO2 business for 218 million euros.",
        "date": "09152015",
        "name": "Praxair Inc",
        "news_type": "topStory",
        "symbol": "PX",
        "title": "BRIEF-Norway's Yara to sell its European CO2 business to U.S Praxair  sees gain of EUR 150 mln "
    }
]