[
    {
        "content": "PayPal Holdings Inc  said it would sell its $5.8 billion-worth U.S. credit portfolio to Synchrony Financial  and raised its current-quarter revenue and profit forecasts  sending the company's shares to a record high.",
        "date": "11162017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal to sell U.S. credit assets  raises fourth quarter forecasts "
    },
    {
        "content": "* Synchrony stock rise about 3 pct (Recasts  adds forecast  analyst quotes; updates shares))",
        "date": "11162017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 2-PayPal to sell U.S. credit assets  raises Q4 forecasts "
    },
    {
        "content": "* Synchrony financial says transaction with paypal not expected to impact current capital plan announced may 17- sec filing‍​",
        "date": "11162017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-Synchrony Financial sees deal with PayPal EPS accretive in 2019 "
    },
    {
        "content": "Nov 16 The following bids  mergers  acquisitions and disposals were reported by 1400 GMT on Thursday:",
        "date": "11162017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Suspension of services by TIO is a result of PayPal's discovery of security vulnerabilities on TIO platform​",
        "date": "11102017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal announces ‍suspension of services by TIO Networks "
    },
    {
        "content": "Payment processor PayPal Holdings Inc  on Wednesday launched domestic operations in India  a market already dominated by China's Alibaba-backed  PayTM  the country's leading digital payments firm.",
        "date": "11082017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal starts payment services in India "
    },
    {
        "content": "Nov 16 Consumer financial services company Synchrony Financial said on Thursday that it would buy $6.8 billion in receivables from PayPal Holdings Inc  including the payment processor's U.S. consumer credit receivables portfolio.",
        "date": "11162017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Synchrony to buy $6.8 bln receivables portfolio from PayPal "
    },
    {
        "content": "Nov 8 Payment processor PayPal Holdings Inc on Wednesday launched domestic operations in India  a market already dominated by China's Alibaba-backed PayTM  the country's leading digital payments firm.",
        "date": "11082017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 1-PayPal starts payment services in India "
    },
    {
        "content": "* PayPal and Synchrony Financial announce expanded strategic credit relationship",
        "date": "11162017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal and Synchrony Financial announce expanded strategic credit relationship "
    },
    {
        "content": "Nov 8 Payment processor PayPal Holdings Inc on Wednesday launched domestic operations in India allowing indian consumers to use PayPal to shop online at some of India's most popular businesses.",
        "date": "11082017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal launches domestic operations in India "
    },
    {
        "content": "* PAYPAL HOLDINGS INC - ‍PAYPAL HOLDINGS INC ANNOUNCED LAUNCH OF ITS DOMESTIC OPERATIONS IN INDIA​ Source text for Eikon: Further company coverage:",
        "date": "11082017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-PAYPAL HOLDINGS ANNOUNCES LAUNCH OF ITS DOMESTIC OPERATIONS IN INDIA​ "
    },
    {
        "content": "* Says launches domestic operations in India Source text - [Mumbai  India - November 8  2017 - Global technology platform and digital leader PayPal Hondings Inc. today announced the launch of domestic operations in India.] Further company coverage:",
        "date": "11082017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal launches domestic ops in India "
    },
    {
        "content": "Sharp growth in mobile payments led PayPal Holdings Inc  to report a better-than-expected third-quarter profit on Thursday and lift its guidance for earnings through the rest of the year.",
        "date": "10192017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal tops profit estimates  lifts target on mobile payments growth "
    },
    {
        "content": "Oct 19 Sharp growth in mobile payments led PayPal Holdings Inc to report a better-than-expected third-quarter profit on Thursday and lift its guidance for earnings through the rest of the year.",
        "date": "10192017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 3-PayPal tops profit estimates  lifts target on mobile payments growth "
    },
    {
        "content": "NEW YORK  Oct 17 PayPal Holdings Inc said more than two million U.S. retailers will be able to accept payments through its mobile app Venmo starting this week  seeking to broaden its reach with a brand that has been a hit with young people.",
        "date": "10172017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal rolls out Venmo payments to its U.S. retailers "
    },
    {
        "content": "Oct 19 Payment processor PayPal Holdings Inc reported a 17.6 percent rise in quarterly profit  helped by higher ecommerce spending.",
        "date": "10192017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Paypal 3rd-qtr profit rises 17.6 pct "
    },
    {
        "content": "* PayPal - ‍On sept 26  co drew down $800 million under revolving credit facility pursuant to previously disclosed credit and guarantee agreement​",
        "date": "09282017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal drew down $800 mln under revolving credit facility "
    },
    {
        "content": "* Appointment of Adkins will increase Paypal's board of directors to 11 members​ Source text for Eikon: Further company coverage:",
        "date": "09272017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal appoints Rodney C. Adkins to its board of directors "
    },
    {
        "content": "NEW YORK  Sept 8 A consortium of U.S. banks is taking another step next week to attract a critical mass of users to their Zelle network  a rival to PayPal's Venmo for handling instant payments between individuals with smartphones.",
        "date": "09082017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "U.S. banks move to broaden reach of Zelle instant payments app "
    },
    {
        "content": "* Carl Icahn cuts shared share stake in PayPal Holdings Inc by 68.3% to 10 million shares - SEC filing",
        "date": "08142017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Carl Icahn cuts shared share stake in PayPal Holdings by 68.3 pct "
    },
    {
        "content": "NEW YORK  Aug 10 Payments firm PayPal Holdings Inc has agreed to acquire online lending company Swift Financial in a bid to expand its business that provides working capital to merchants.",
        "date": "08102017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal to expand lending offering with acquisition "
    },
    {
        "content": "BEIJING  July 27 Baidu Inc said on Friday that it has entered a strategic agreement with PayPal Holdings Inc to tap overseas merchants as Chinese tech companies ramp up the fight for overseas payment partnerships.",
        "date": "07272017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "China's Baidu enters strategic partnership with Paypal to tap Chinese tourists "
    },
    {
        "content": "Digital payments company PayPal Holdings Inc raised its earnings outlook on Wednesday after reporting better-than-expected quarterly results  driven by growth in users and transaction volumes.",
        "date": "07262017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal raises 2017 forecasts on growth in users  payment volumes "
    },
    {
        "content": "July 26 Digital payments company PayPal Holdings Inc raised its earnings outlook on Wednesday after reporting better-than-expected quarterly results  driven by growth in users and transaction volumes.",
        "date": "07262017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 2-PayPal raises 2017 forecasts on growth in users  payment volumes "
    },
    {
        "content": "* Bank Of America and Paypal partner to enable in-store payments and account linking",
        "date": "07262017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-Bank of America  Paypal partner to enable in-store payments and account linking "
    },
    {
        "content": "July 26 PayPal Holdings Inc reported a 27.2 percent rise in quarterly profit as the payment processor's growing strategic partnerships helped boost payment volumes.",
        "date": "07262017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal's profit rises 27.2 pct "
    },
    {
        "content": "NEW YORK PayPal Holdings Inc has invested in LendUp  a San Francisco-based startup that offers loans online to consumers who have been traditionally overlooked by banks because they are considered too risky.",
        "date": "07242017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal invests in online lender LendUp "
    },
    {
        "content": "* Citi and PayPal expand partnership to deliver enhanced payments experience",
        "date": "07202017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Citi and PayPal expand partnership to deliver enhanced payments experience "
    },
    {
        "content": "* Visa and PayPal have agreed to extend participation in Visa digital enablement program (VDEP) in Europe",
        "date": "07182017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Visa and PayPal extend partnership to Europe "
    },
    {
        "content": "* JPMorgan Chase and PayPal strike payments partnership to enhance payments online  in app and in store",
        "date": "07202017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-JPMorgan Chase and PayPal strike payments partnership "
    },
    {
        "content": "* PayPal completes acquisition of Tio Networks Source text for Eikon: Further company coverage:",
        "date": "07182017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal completes acquisition of Tio Networks "
    },
    {
        "content": "* PayPal acquisition of Tio Networks to help democratize financial services",
        "date": "07182017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal acquisition of Tio Networks to help democratize financial services "
    },
    {
        "content": "* Samsung - Samsung Pay announces partnership to allow users to pay via PayPal Source text: http://bit.ly/2txtqIo Further company coverage:",
        "date": "07172017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Samsung Pay announces partnership to allow users to pay via PayPal "
    },
    {
        "content": "* Lendup announces strategic investment from Paypal  additions to leadership team",
        "date": "06292017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Lendup announces strategic investment from Paypal "
    },
    {
        "content": "NEW YORK  June 28 PayPal Holdings Inc has invested in LendUp  a San Francisco-based startup that offers loans online to consumers who have been traditionally overlooked by banks because they are considered too risky.",
        "date": "06282017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal invests in online lender LendUp "
    },
    {
        "content": "* Appointment of Sarnoff will increase Paypal's board of directors to 10 members",
        "date": "06282017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal appoints Ann Sarnoff to board of directors "
    },
    {
        "content": "NEW YORK  June 12 The U.S. banking industry is about to launch its answer to the popular mobile payments app Venmo  in what is likely to be the biggest change in years in how individuals exchange funds digitally.",
        "date": "06122017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "U.S. banks launching answer to peer-to-peer payment app Venmo "
    },
    {
        "content": "* PayPal and Canada Post announce integrated payment and shipping solution Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal and Canada Post announce integrated payment and shipping solution "
    },
    {
        "content": "Online payment processor PayPal has been hit with a proposed class action accusing it of aiding an alleged Ponzi scheme that authorities say took in more than $207 million from investors worldwide.",
        "date": "05092017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal hit with lawsuit alleging it aided Ponzi scheme "
    },
    {
        "content": "* Entered into a strategic partnership with Paypal Source text for Eikon: Further company coverage:",
        "date": "05012017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Gruden Group entered into strategic partnership with Paypal "
    },
    {
        "content": "* Dow up 0.03 pct  S&P 500 up 0.06 pct  Nasdaq up 0.39 pct (Updates prices  changes comment  byline)",
        "date": "04272017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "US STOCKS-Earnings lift Nasdaq to record; S&P  Dow drift "
    },
    {
        "content": "PayPal Holdings Inc  raised its earnings outlook on Wednesday after reporting higher-than-expected quarterly profit resulting from an increase in payment processing volumes and user growth.",
        "date": "04262017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal offers positive outlook  beats expectations "
    },
    {
        "content": "April 26 PayPal Holdings Inc raised its earnings outlook on Wednesday after reporting higher-than-expected quarterly profit resulting from an increase in payment processing volumes and user growth.",
        "date": "04262017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "REFILE-UPDATE 2-PayPal offers positive outlook  beats expectations "
    },
    {
        "content": "* Expects FY 2017 non-GAAP operating margin to be flat to slightly up versus. 2016 - Presentation",
        "date": "04262017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal expects FY2017 non-GAAP operating margin to be flat to slightly up vs 2016 "
    },
    {
        "content": "April 26 Payment processor PayPal Holdings Inc reported a 5.2 percent rise in quarterly profit on Wednesday  helped by an increase in payment processing volumes and customer additions.",
        "date": "04262017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal's quarterly profit rises 5.2 pct "
    },
    {
        "content": "* Wells Fargo announces support for Paypal Wallet for in-store transactions",
        "date": "04182017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Wells Fargo announces support for Paypal Wallet for in-store transactions "
    },
    {
        "content": "* Extending partnership with Google to make it easy for consumers to use Paypal as a payment method in android pay - blog",
        "date": "04182017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal partners with Google with Android Pay for mobile payments "
    },
    {
        "content": "* Tio Networks Corp- Tio Networks Corp receives final court approval for plan of arrangement with Paypal Holdings Inc Source text for Eikon: Further company coverage:",
        "date": "04172017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Tio Networks receives final court approval for arrangement with Paypal Holdings "
    },
    {
        "content": "* Tio Networks Corp. securityholders overwhelmingly approve plan of arrangement with Paypal Holdings  Inc.",
        "date": "04112017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Tio Networks says shareholders approve of arrangement with PayPal "
    },
    {
        "content": "* Paypal Holdings Inc - CEO Daniel H. Schulman 2016 total compensation was $18.9 million versus $14.5 million in 2015",
        "date": "04132017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal Holdings Inc's CEO 2016 total compensation was $18.9 mln "
    },
    {
        "content": "* Tio Networks-Institutional shareholder services  Glass Lewis & Co have recommended that tio shareholders approve proposed plan of arrangement with PayPal",
        "date": "03282017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Glass Lewis & Co have recommended that Tio shareholders approve proposed plan of arrangement with PayPal "
    },
    {
        "content": "* PayPal and Visa extend partnership to accelerate adoption of digital and mobile payments across Asia Pacific",
        "date": "04042017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal and Visa extend partnership to accelerate adoption of digital and mobile payments across Asia Pacific "
    },
    {
        "content": "BERLIN  April 4 UK-based online money transfer firm Azimo is turning the process of sending remittances on its head by allowing mobile phone and computer users to send cash to any mobile phone number via text message  leaving it up to the recipient to claim the money.",
        "date": "04042017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Need cash? Azimo lets recipients sort out money transfer headaches "
    },
    {
        "content": "* CEO Daniel Schulman's FY 2016 total compensation was $18.9 million versus $14.4 million in FY 2015 - sec filing",
        "date": "03312017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal Holdings CEO Daniel Schulman's FY 2016 total compensation was $18.9 mln vs $14.4 mln in FY 2015 "
    },
    {
        "content": "* AppSpotr and PayPal have started cooperation to promote AppSpotr e-commerce solution to PayPal B2B customers",
        "date": "03172017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "CORRECTED-BRIEF-PayPal starts cooperation with AppSpotr to offer app-based e-commerce solutions "
    },
    {
        "content": "* Extends makemytrip merchant partnership to facilitate hotel bookings in addition to international flight bookings  Source text - (PayPal  one of the world's leading payments platforms today announced an extension of its merchant partnership with MakeMyTrip  leading Indian online travel booking company  to facilitate hotel and holidays booking in addition to airline tickets.) Further company coverage:",
        "date": "03072017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-MakemyTrip and PayPal partner for hotel bookings "
    },
    {
        "content": "March 6 Consumer Reports  an influential U.S. non-profit group that conducts extensive reviews of cars  kitchen appliances and other goods  is gearing up to start considering cyber security and privacy safeguards when scoring products.",
        "date": "03062017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Consumer Reports to consider cyber security in product reviews "
    },
    {
        "content": "Consumer Reports  an influential U.S. non-profit group that conducts extensive reviews of cars  kitchen appliances and other goods  is gearing up to start considering cyber security and privacy safeguards when scoring products.",
        "date": "03072017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Consumer Reports to consider cyber security in product reviews "
    },
    {
        "content": "NEW YORK Currency market fluctuations in the third quarter of 2016 had the smallest negative impact on North American companies' financial results since 2014  FIREapps said in a report on Monday.",
        "date": "01302017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "Negative effective of currency rates on company results fall in third quarter "
    },
    {
        "content": "* Sees foreign exchange headwinds throughout 2017  expects greater impact in the first half",
        "date": "01262017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal sees foreign exchange headwinds throughout 2017 "
    },
    {
        "content": "* Says in q4  merchant services TPV grew 27%  or 30% on an fx-neutral basis",
        "date": "01262017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal reports Q4 active customer accounts of 197 mln  EPS $0.32 "
    },
    {
        "content": "PayPal Holdings Inc  offered a subdued outlook on Thursday  as it faced unpredictable currency fluctuations and an increasingly competitive digital payments market.",
        "date": "01272017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal outlook muted on mobile competition  currency trends "
    },
    {
        "content": "Jan 26 PayPal Holdings Inc reported a 16.6 percent rise in quarterly revenue helped by the continued growth in customer and merchant accounts on its payments platform.",
        "date": "01262017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal quarterly revenue rises 16.6 percent "
    },
    {
        "content": "Jan 26 PayPal Holdings Inc offered a subdued outlook on Thursday  as it faced unpredictable currency fluctuations and an increasingly competitive digital payments market.",
        "date": "01272017",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 2-PayPal outlook muted on mobile competition  currency trends "
    },
    {
        "content": "* Paypal holdings inc says  belinda johnson will serve on paypal's audit committee",
        "date": "01172017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal appoints Belinda Johnson to Board "
    },
    {
        "content": "* Discover Financial Services - Co  PayPal have signed agreement making PayPal more widely available to Discover cardmembers  acquirers and merchants",
        "date": "01112017",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Discover Financial Services  PayPal sign agreement on payment services "
    },
    {
        "content": "Oct 21 PayPal Holdings Inc said on Friday that it has experienced some service disruptions due to the cyber attack on Dyn that caused Internet outages for its customers.",
        "date": "10212016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal says some customers unable to make payments due to cyber attack on Dyn "
    },
    {
        "content": "PayPal Holdings Inc said on Friday that it has experienced some service disruptions due to the cyber attack on Dyn that caused Internet outages for its customers.",
        "date": "10222016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal says some customers unable to make payments due to cyber attack on Dyn "
    },
    {
        "content": "PayPal Holdings Inc  reported a better-than-expected 18.1 percent rise in quarterly revenue and its margin forecast allayed concerns over costs associated with its payment network deals with MasterCard Inc  and Visa Inc .",
        "date": "10202016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal's shares rally on revenue beat  margin forecast "
    },
    {
        "content": "* Expects adj. oper margin to be stable or grow in next 3 yrs",
        "date": "10202016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 3-PayPal's shares rally on revenue beat  margin forecast "
    },
    {
        "content": "* Q3 revenue $2.667 billion versus I/B/E/S view $2.65 billion",
        "date": "10202016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal Holdings Q3 non-GAAP earnings per share $0.35 "
    },
    {
        "content": "SHANGHAI/HONG KONG  Oct 11 Investors gearing up for the initial public offering of Ant Financial  the $60 billion online finance arm spun off by e-commerce giant Alibaba   will have to wait until at least late 2017 as the business puts growth first  sources say.",
        "date": "10112016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Alibaba's $60 bln finance arm seeks growth before IPO - sources "
    },
    {
        "content": "* Says William Ready appointed COO  Source text for Eikon:  Further company coverage:",
        "date": "10032016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal Holdings says William Ready appointed COO "
    },
    {
        "content": "San Francisco  Sept 12 Facebook's  Messenger application  which now boasts a billion users  is introducing new capabilities that will make it possible to pay for goods and services through Messenger or though \"bots \" or automated programs  that use the messaging app.",
        "date": "09122016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Facebook announces payment capabilities for Messenger service "
    },
    {
        "content": "MasterCard Inc said on Tuesday it had expanded its deal with payment processor PayPal Holdings Inc  which would allow customers to use PayPal's payment services in stores.",
        "date": "09072016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal  MasterCard reach deal for store payments "
    },
    {
        "content": "Sept 6 MasterCard Inc said on Tuesday it had expanded its deal with payment processor PayPal Holdings Inc   which would allow customers to use PayPal's payment services in stores.",
        "date": "09062016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "UPDATE 2-PayPal  MasterCard reach deal for store payments "
    },
    {
        "content": "Sept 6 PayPal Holdings Inc has entered into a deal with MasterCard Inc that will allow payments in stores  the Wall Street Journal reported.",
        "date": "09062016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "REFILE-PayPal reaches deal with MasterCard for store payments - WSJ "
    },
    {
        "content": "* PayPal strikes deal with Mastercard to allow payments in stores  - WSJ",
        "date": "09062016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal strikes deal with Mastercard to allow payments in stores - WSJ "
    },
    {
        "content": "* Google is close to winning Paypal's cloud business  beating out Amazon & Microsoft -  CNBC citing sources",
        "date": "08302016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Google is close to winning Paypal's cloud business  beating out Amazon & Microsoft - CNBC "
    },
    {
        "content": "Aug 30 Alphabet Inc's Google is close to winning PayPal Holdings Inc as a client for its cloud business  CNBC reported on Tuesday  citing people familiar with the matter.",
        "date": "08302016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Google's cloud close to winning PayPal business - CNBC "
    },
    {
        "content": "* Carl Icahn cuts shared share stake in Paypal Holdings Inc by 10.4 percent to 33.9 million shares",
        "date": "08152016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Carl Icahn cuts shared share stake in Paypal Holdings Inc "
    },
    {
        "content": "By Karen Freifeld The chief of the investigation division at the Manhattan District Attorney's office has left to join online payments giant PayPal.",
        "date": "08082016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "Manhattan DA's investigation chief to join Paypal "
    },
    {
        "content": "PayPal Holdings Inc  moved to extend the reach of its online payments business through a deal with Visa Inc  that is expected to boost the revenue and number of users of the money-transfer service.",
        "date": "07222016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal seeks to extend reach with Visa tie-up "
    },
    {
        "content": "July 21 PayPal Holdings Inc moved to extend the reach of its online payments business through a deal with Visa Inc that is expected to boost the revenue and number of users of the money-transfer service.",
        "date": "07222016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 3-PayPal seeks to extend reach with Visa tie-up "
    },
    {
        "content": "* Announced multi-year extension of Paypal extras Mastercard co-branded consumer credit card program in United States  Puerto Rico  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07272016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Mastercard and Paypal renew consumer credit card program "
    },
    {
        "content": "July 21 PayPal Holdings Inc on Thursday showed strong growth in its online payments business  meeting Wall Street expectations on earnings and announcing a new partnership with Visa Inc that is expected to bring a significant revenue increase.",
        "date": "07212016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal announces Visa partnership  15 percent revenue growth "
    },
    {
        "content": "* Paypal will not encourage Visa cardholders to link to a bank account via ach",
        "date": "07212016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal and Visa enter partnership to extend consumer payment choice "
    },
    {
        "content": "* IKEA Canada says customers can now pay with Paypal on its e-commerce site  Source text for Eikon:  Further company coverage:",
        "date": "07192016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-IKEA Canada says customers can pay with Paypal "
    },
    {
        "content": "* PayPal to suspend operations in Turkey  effective June 6  after failing to obtain new license for its services - Paypal Turkey website  Source text: (http://bit.ly/1Xb9B6W) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05312016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal to suspend operations in Turkey effective June 6 "
    },
    {
        "content": "MEXICO CITY  May 24 For two decades  Noe Sanchez sent money from California to his father in Mexico City through storefront outlets of traditional remittance firms such as Western Union.",
        "date": "05242016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Financial tech startups compete for overlooked U.S. immigrant market "
    },
    {
        "content": "MEXICO CITY  May 24 For two decades  Noe Sanchez sent money from California to his father in Mexico City through storefront outlets of traditional remittance firms such as Western Union.",
        "date": "05242016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "RPT-Financial tech startups compete for overlooked U.S. immigrant market "
    },
    {
        "content": "SYDNEY Digital money transfer companies including PayPal Holdings are rushing to grab a share of Australia's $35 billion remittance market  hoping to plug a vacuum left by the major domestic banks' exit from the space last year.  U.S.-listed PayPal intends to roll out its online remitting platform Xoom into Australia soon  senior executives told Reuters  while U.K.-based WorldRemit in April said it had chosen Australia as its Asia-Pacific base.",
        "date": "05022016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "As Australian banks snub remitters  digital players emerge "
    },
    {
        "content": "EBay Inc reported better-than-expected quarterly earnings on Tuesday and raised its full-year revenue forecast as a revamped shopping platform attracted more buyers  mitigating growth concerns following its spinoff of PayPal Holdings Inc.",
        "date": "04262016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "EBay attracts more shoppers  earnings beat expectations "
    },
    {
        "content": "April 26 EBay Inc reported better-than-expected quarterly earnings on Tuesday and raised its full-year revenue forecast as a revamped shopping platform attracted more buyers  mitigating growth concerns following its spinoff of PayPal Holdings Inc.",
        "date": "04262016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 2-EBay attracts more shoppers  earnings beat expectations "
    },
    {
        "content": "PayPal Holdings Inc's  quarterly revenue and profit jumped  beating analysts' estimates  as the company added customers and processed more digital payments.",
        "date": "04272016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal's profit surges on growth in transactions  new users "
    },
    {
        "content": "* Profit $0.37/share vs est. $0.35   (Adds details  analyst comment; updates shares)",
        "date": "04272016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 2-PayPal's profit surges on growth in transactions  new users "
    },
    {
        "content": "* Paypal holdings inc says  8 payment transactions per active account on a trailing twelve month basis  up 12%",
        "date": "04272016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "BRIEF-Paypal reports Q1 GAAP earnings per share $0.30 "
    },
    {
        "content": "April 27 PayPal Holdings Inc's  quarterly revenue rose 19 percent as the company added customers and processed more digital payments on its network.",
        "date": "04272016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Payment processor PayPal's quarterly revenue rises 19 pct "
    },
    {
        "content": "* Acorns says raised $30 million in financing  including strategic investments from paypal and rakuten fintech fund  Source text for Eikon:    )",
        "date": "04212016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-Acorns says raised $30 mln in financing including strategic investments from PayPal "
    },
    {
        "content": "CHICAGO PayPal Holdings Inc  on Tuesday canceled plans to open a global operations center in Charlotte  North Carolina and invest $3.6 million in the area after the state passed a controversial law targeting lesbian  gay  bisexual and transgender (LGBT) citizens.",
        "date": "04062016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal pulls North Carolina plan after transgender bathroom law "
    },
    {
        "content": "CHICAGO  April 5 PayPal Holdings Inc on Tuesday canceled plans to open a global operations center in Charlotte  North Carolina and invest $3.6 million in the area after the state passed a controversial law targeting lesbian  gay  bisexual and transgender (LGBT) citizens.",
        "date": "04052016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "UPDATE 2-PayPal pulls North Carolina plan after transgender bathroom law "
    },
    {
        "content": "CHICAGO  April 5 PayPal Holdings Inc  said on Tuesday it canceled plans to open a global operations center in Charlotte  North Carolina after the state passed a controversial law targeting lesbian  gay  bisexual and transgender (LGBT) citizens.",
        "date": "04052016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal pulls North Carolina plan after transgender bathroom law "
    },
    {
        "content": "Payment processor PayPal Holdings Inc on Wednesday reported better-than-expected quarterly revenue  as new customer additions and payment processing volumes surged  and it announced a buyback of $2 billion of its stock.",
        "date": "01272016",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal's revenue beats Street view on higher transactions  customers "
    },
    {
        "content": "Jan 27 Payment processor PayPal Holdings Inc  on Wednesday reported better-than-expected quarterly revenue  as new customer additions and payment processing volumes surged  and it announced a buyback of $2 billion of its stock.",
        "date": "01272016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 3-PayPal's revenue beats Street view on higher transactions  customers "
    },
    {
        "content": "Jan 27 Payment processor PayPal Holdings Inc's  quarterly revenue rose about 17 percent as it added more customers and processed more payments than in the same period last year  when it was a part of eBay Inc.",
        "date": "01272016",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal's quarterly revenue rises 17 pct "
    },
    {
        "content": "NEW YORK  Dec 17 Electronic payment company PayPal Holdings Inc said on Thursday it will increase its paid maternity and sick leave programs and offer time off for U.S. employees to volunteer and care for ill family members.",
        "date": "12172015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal boosts maternity leave  sick time for U.S. employees "
    },
    {
        "content": "NEW YORK  Nov 16 Billionaire activist investor Carl Icahn swapped his entire equity stake in eBay Inc  for the same number of shares in PayPal Holdings Inc in the third quarter  regulatory filings showed on Monday.",
        "date": "11162015",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "Icahn exits eBay stake  opts for PayPal after spinoff "
    },
    {
        "content": "Soros Fund Management  which manages the investments of billionaire George Soros and his family  took new stakes in video streaming company Netflix Inc and casino operator Wynn Resorts Ltd during the third quarter.",
        "date": "11162015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Soros checks into Netflix  bids Herbalife adieu "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn swapped his entire equity stake in eBay Inc  for the same number of shares in PayPal Holdings Inc in the third quarter  regulatory filings showed on Monday.",
        "date": "11172015",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "Icahn exits eBay stake  opts for PayPal after spinoff "
    },
    {
        "content": "Nov 16 Soros Fund Management  which manages the investments of billionaire George Soros and his family  took new stakes in video streaming company Netflix Inc and casino operator Wynn Resorts Ltd during the third quarter.",
        "date": "11162015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 1-Soros checks into Netflix  bids Herbalife adieu "
    },
    {
        "content": "Top U.S. hedge fund management firms  including Soros Fund Management LLC and Viking Global Investors  placed new bets on Netflix Inc  while Tiger Global Management increased its stake in the video streaming company during the third quarter  regulatory filings showed on Monday.",
        "date": "11172015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Factbox: Netflix  PayPal become hedge fund darlings in third quarter "
    },
    {
        "content": "Payment processor PayPal Holdings Inc   spun off from eBay Inc  reported quarterly revenue slightly below analysts' expectations as a strong dollar hurt its transaction volumes in China and Europe.",
        "date": "10282015",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal's China  Europe transaction volumes hit by strong dollar "
    },
    {
        "content": "LAS VEGAS PayPal Holdings Inc   the online payment processor  said on Tuesday its small-business lending program has processed $1 billion in loans in the first two years of its launch and more than doubled loan growth in that span.",
        "date": "10272015",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "PayPal says makes $1 billion in small-business loans in first two years "
    },
    {
        "content": "Oct 28 PayPal Holdings Inc's quarterly revenue rose about 14 percent as the company  spun off from eBay Inc  added customers and processed 27 percent more payments on its platform.",
        "date": "10282015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal's quarterly revenue rises 14 pct "
    },
    {
        "content": "LAS VEGAS  Oct 27 PayPal Holdings Inc  the online payment processor  said on Tuesday its small-business lending program has processed $1 billion in loans in the first two years of its launch and more than doubled loan growth in that span.",
        "date": "10272015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal says makes $1 bln in small-business loans in 1st 2 years "
    },
    {
        "content": "NEW YORK PayPal Holdings Inc   the e-commerce group trading sharply off its recent offering price  could rise 40 percent to $46 a share if it succeeds with investments tied to payments systems innovation  the Aug. 31 edition of Barron's said.",
        "date": "08302015",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "Paypal seen rising 40 percent from post spinoff lows: Barron's "
    },
    {
        "content": "NEW YORK  Aug 30 PayPal Holdings Inc  the e-commerce group trading sharply off its recent offering price  could rise 40 percent to $46 a share if it succeeds with investments tied to payments systems innovation  the Aug. 31 edition of Barron's said.",
        "date": "08302015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "Paypal seen rising 40 pct from post spinoff lows -Barron's "
    },
    {
        "content": "* Paypal extends OneTouch to 13 new markets  including: Australia  Austria  Belgium Denmark  France  Germany  Netherlands  Norway  Poland  Spain  Sweden Switzerland and Turkey",
        "date": "08262015",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "BRIEF-PayPal expands One Touch program to new markets in Europe  Australia "
    },
    {
        "content": "SAN FRANCISCO  Aug 25 PayPal Holdings Inc  said on Tuesday it would expand its One Touch payments product to 13 new markets in Europe and Australia  bringing a simpler check-out to online shoppers and merchants.",
        "date": "08262015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "PayPal expands One Touch program to new markets in Europe  Australia "
    },
    {
        "content": "CHICAGO Visa Inc said on Monday online shoppers using its payment service are 17 percentage points more likely to complete their purchases than those using PayPal.",
        "date": "08252015",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "Visa says its users more likely to complete online purchases "
    },
    {
        "content": "CHICAGO  Aug 24 Visa Inc said on Monday online shoppers using its payment service are 17 percentage points more likely to complete their purchases than those using PayPal.",
        "date": "08252015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "UPDATE 1-Visa says its users more likely to complete online purchases "
    },
    {
        "content": "CHICAGO Visa Inc said on Monday online shoppers using its payment service are 17 percentage points more likely to complete their purchases than those using PayPal.",
        "date": "08242015",
        "name": "PayPal Holdings Inc",
        "news_type": "topStory",
        "symbol": "PYPL",
        "title": "Visa: Consumers using it online finish transactions more than those using PayPal "
    },
    {
        "content": "CHICAGO  Aug 24 Visa Inc said on Monday online shoppers using its payment service are 17 percentage points more likely to complete their purchases than those using PayPal.",
        "date": "08242015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "CORRECTED-Visa: Consumers using it online finish transactions more than those using PayPal "
    },
    {
        "content": "Aug 4 United Continental Holdings Inc  Chief Financial Officer John Rainey has left the fourth-biggest passenger air carrier in the United States to take up the same role at PayPal Holdings Inc  the companies said Tuesday.",
        "date": "08042015",
        "name": "PayPal Holdings Inc",
        "news_type": "normal",
        "symbol": "PYPL",
        "title": "United Airlines CFO Rainey moves to same position at PayPal "
    }
]