[
    {
        "content": "Broadcom Ltd said on Friday it closed its acquisition of network gear maker Brocade Communications Systems Inc  giving it a larger share of the data center products market.",
        "date": "11172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Broadcom closes $5.5 billion Brocade deal "
    },
    {
        "content": "Nov 17 Broadcom Ltd said on Friday it closed its acquisition of network gear maker Brocade Communications Systems Inc  giving it a larger share of the data center products market.",
        "date": "11172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Broadcom closes $5.5 billion Brocade deal "
    },
    {
        "content": "Nov 17 Broadcom Ltd said on Friday it completed its $5.5 billion acquisition of network gear maker Brocade Communications Systems Inc.",
        "date": "11172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Broadcom completes Brocade acquisition "
    },
    {
        "content": "* Qualcomm extends cash tender offer for all outstanding shares of NXP",
        "date": "11172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm extends cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "U.S. smartphone chipmaker Qualcomm Inc  may win European Union approval for its bid to acquire NXP Semiconductors NV  by the end of the year  Bloomberg reported on Thursday  citing people familiar with the matter.",
        "date": "11162017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm could win EU approval for NXP by end of year: Bloomberg "
    },
    {
        "content": "Nov 16 U.S. smartphone chipmaker Qualcomm Inc may win European Union approval for its bid to acquire NXP Semiconductors NV by the end of the year  Bloomberg reported on Thursday  citing people familiar with the matter.",
        "date": "11162017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm could win EU approval for NXP by end of year - Bbg "
    },
    {
        "content": "BEIJING A ruling on Qualcomm Inc's proposed $38 billion acquisition of NXP Semiconductors NV may come in 2018  European Commissioner for Competition Margrethe Vestager said on Wednesday.",
        "date": "11152017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm-NXP ruling may be in 2018: EU competition commissioner "
    },
    {
        "content": "U.S. House will reject total elimination of state and local tax deductions -Brady",
        "date": "11122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Reuters Business News Schedule at 2130 GMT/4:30 p.m. ET "
    },
    {
        "content": "Mobile chipmaker Qualcomm Inc on Monday rejected rival Broadcom Ltd's $103-billion takeover bid  saying the offer undervalued the company and would face regulatory hurdles. | Video ",
        "date": "11132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm rejects Broadcom's $103-billion takeover bid "
    },
    {
        "content": "BEIJING  Nov 15 A ruling on Qualcomm Inc's proposed $38 billion acquisition of NXP Semiconductors NV may come in 2018  European Commissioner for Competition Margrethe Vestager said on Wednesday.",
        "date": "11152017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm-NXP ruling may be in 2018 - EU competition commissioner "
    },
    {
        "content": "Nov 13 Mobile chipmaker Qualcomm Inc on Monday rejected rival Broadcom Ltd's $103-billion takeover bid  saying the offer undervalued the company and would face regulatory hurdles.",
        "date": "11132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 4-Qualcomm rejects Broadcom's $103-billion takeover bid "
    },
    {
        "content": "BEIJING  Nov 15 Chinese artificial intelligence (AI) startup SenseTime Group said on Wednesday it has sealed an investment from chipmaker Qualcomm Inc as part of a funding round that will close later this year.",
        "date": "11152017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm invests in Chinese AI facial recognition startup SenseTime "
    },
    {
        "content": "Nov 13 Mobile chipmaker Qualcomm Inc on Monday rejected rival Broadcom Ltd's $103-billion takeover bid  saying the offer undervalued the company and would face regulatory hurdles.",
        "date": "11132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "CORRECTED-UPDATE 2-Qualcomm rejects Broadcom's $103-billion takeover bid "
    },
    {
        "content": "* SIGNED STRATEGIC INVESTMENT AGREEMENT WITH QUALCOMM INCORPORATED   WHICH IS PENDING CLOSING​",
        "date": "11152017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-‍Sensetime says signed strategic investment agreement with Qualcomm "
    },
    {
        "content": "* Broadcom remains fully committed to acquisition of Qualcomm",
        "date": "11132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Broadcom says it remains \"fully committed\" to pursue Qualcomm acquisition "
    },
    {
        "content": "Nov 13 Mobile chipmaker Qualcomm Inc on Monday rejected rival Broadcom Ltd's $103 billion takeover bid  saying the offer \"dramatically\" undervalued the U.S. company.",
        "date": "11132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm rejects Broadcom's $103 billion takeover proposal "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - The chipmaker’s hostile tilt at Qualcomm is a rare aggressive move in the sector. Qualcomm has its own issues  awaiting approval for its NXP deal and fighting Apple in court. It all suggests the tech sector is too frothy. Plus: Is Hong Kong losing its moxie as a financial center?",
        "date": "11102017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Breakingviews - Viewsroom: Broadcom $130 bln bid signals market top "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Apple may anoint the winner of Broadcom's $105 billion bid for Qualcomm. A dispute over iPhone royalties left the U.S. chipmaker vulnerable to an opportunistic offer from its acquisitive rival. Settling could preserve Qualcomm’s independence – but it all depends on whether Apple thinks a bigger Broadcom would be slavishly devoted to the handset maker  or just surlier.",
        "date": "11092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Breakingviews - Apple has deciding vote in Broadcom-Qualcomm deal "
    },
    {
        "content": "* Qualcomm board of directors unanimously rejects Broadcom's unsolicited proposal",
        "date": "11132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm board unanimously rejects Broadcom's unsolicited proposal "
    },
    {
        "content": "NEW YORK  Nov 10 Banks are eager to open their wallets for what could be the biggest syndicated loan financing ever for an investment-grade acquisition  if chipmaker Broadcom’s unsolicited US$103bn bid to buy Qualcomm is accepted.",
        "date": "11102017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "LPC: Lenders to embrace a record Broadcom bridge loan "
    },
    {
        "content": "BEIJING U.S. companies  from chip giant Qualcomm to aircraft maker Boeing  announced a slew of deals on Thursday during U.S. President Donald Trump's visit to Beijing. The deals could be valued as much as $250 billion  though some have been long in the pipeline and many are non-binding.",
        "date": "11092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Factbox: China-U.S. commercial deals signed during Trump's China visit "
    },
    {
        "content": "** S&P 500 ends 8-week winning streak  though dips just 0.2 pct as tax plan details weigh",
        "date": "11132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "RPT-BUZZ-U.S. stocks weekly: Cold front "
    },
    {
        "content": "U.S. chipmaker Qualcomm Inc  is making preparations to reject rival Broadcom Ltd's  $103 billion bid as early as this week  four people familiar with the matter said on Sunday  setting the stage for one of the biggest-ever takeover battles.",
        "date": "11132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm draws up plans to rebuff Broadcom's $103 billion offer: sources "
    },
    {
        "content": "* Broadcom is reviewing candidates for Qualcomm director slate- CNBC‍​",
        "date": "11082017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Broadcom reviewing candidates for Qualcomm director slate- CNBC‍​ "
    },
    {
        "content": "Communications chipmaker Broadcom Ltd  is planning to unveil a bid for smartphone chip supplier Qualcomm Inc  by Monday  three sources familiar with the matter said on Friday  an attempt to create a roughly $200-billion company through the biggest technology acquisition ever. | Video ",
        "date": "11042017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Broadcom plans record tech deal with Qualcomm bid: sources "
    },
    {
        "content": "BEIJING Qualcomm Inc  has signed $12 billion worth of deals with three Chinese mobile handset makers on the sidelines of a state visit to Beijing by U.S. President Donald Trump.",
        "date": "11092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm signs $12 billion in China deals amid Trump visit "
    },
    {
        "content": "Nov 12 U.S. chipmaker Qualcomm Inc is making preparations to reject rival Broadcom Ltd's $103 billion bid as early as this week  four people familiar with the matter said on Sunday  setting the stage for one of the biggest-ever takeover battles.",
        "date": "11132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "REFILE-Qualcomm draws up plans to rebuff Broadcom's $103 billion offer -sources "
    },
    {
        "content": "SHANGHAI A potential mega-merger between chipmaker Broadcom Ltd  and U.S. rival Qualcomm Inc  is likely to face stern scrutiny in China  antitrust lawyers say  amid a strategic push by Beijing into semiconductors. | Video ",
        "date": "11072017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Bargaining chip? China seen closely scrutinizing Qualcomm  Broadcom deal "
    },
    {
        "content": "Chip maker Broadcom Ltd made an unsolicited $103 billion bid for Qualcomm Inc on Monday  setting the stage for a takeover battle that could reshape the industry at the heart of mobile phone hardware. | Video ",
        "date": "11062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Broadcom bids $103 billion for Qualcomm  open to going hostile "
    },
    {
        "content": "* QUALCOMM SIGNS MEMORANDA OF UNDERSTANDING WITH XIAOMI  OPPO AND VIVO AS PART OF A BILATERAL TRADE MISSION",
        "date": "11092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm signs MoU with Xiaomi  Oppo and Vivo as part of a bilateral trade mission "
    },
    {
        "content": "* Boosted by revenue from partnerships (Adds comments from CEO  analyst  details  share reaction)",
        "date": "11072017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Japan royalties help to drive profits higher for TowerJazz "
    },
    {
        "content": "* Nasdaq hits another record high; dollar in tight range (Adds all three major U.S. indexes closed at record highs)",
        "date": "11062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "GLOBAL MARKETS-Oil surges to over two-year peak; Wall St climbs to record highs "
    },
    {
        "content": "Nov 6 Chip maker Broadcom Ltd made an unsolicited $103 billion bid for Qualcomm Inc on Monday  setting the stage for a takeover battle that could reshape the industry at the heart of mobile phone hardware.",
        "date": "11062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 6-Broadcom bids $103 bln for Qualcomm  open to going hostile "
    },
    {
        "content": "* Excelero secures strategic investment from Qualcomm Ventures  its third major tech firm investor to date",
        "date": "11072017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Excelero secures strategic investment from Qualcomm Ventures  total of $30 mln VC funds "
    },
    {
        "content": "Nov 3 Communications chipmaker Broadcom Ltd is planning to unveil a bid for smartphone chip supplier Qualcomm Inc by Monday  three sources familiar with the matter said on Friday  an attempt to create a roughly $200-billion company through the biggest technology acquisition ever.",
        "date": "11032017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "UPDATE 5-Broadcom plans record tech deal with Qualcomm bid -sources "
    },
    {
        "content": "Qualcomm Inc  has sued Apple Inc   alleging that it violated a software license contract to benefit rival chipmaker Intel Corp  for making broadband modems  the latest salvo in the longstanding dispute between Qualcomm and Apple.",
        "date": "11022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm sues Apple for breach of software license contract "
    },
    {
        "content": "Qualcomm Inc's fourth-quarter profit and revenue beat market expectations as strength in its smartphone chips business was complemented by demand for chips used in automobiles and for the Internet of Things (IoT).",
        "date": "11012017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Demand for modem  IoT chips helps Qualcomm top estimates "
    },
    {
        "content": "* Nasdaq hits another record high; dollar in tight range (Updates market indexes  adds Dudley)",
        "date": "11062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "GLOBAL MARKETS-Oil surges to over two-year peak; shares near flat "
    },
    {
        "content": "Nov 3 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "11032017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Nov 3 Broadcom Ltd is exploring a deal to buy smartphone chip maker Qualcomm Inc  in what could be the biggest ever acquisition of a chipmaker  Bloomberg News reported on Friday.",
        "date": "11032017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Broadcom explores deal to buy Qualcomm-Bloomberg "
    },
    {
        "content": "* Broadcom explores deal to acquire chipmaker Qualcomm- Bloomberg citing sources‍​",
        "date": "11032017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Broadcom explores deal to acquire chipmaker Qualcomm- Bloomberg citing sources‍​ "
    },
    {
        "content": "Nov 2 Qualcomm Inc has sued Apple Inc   alleging that it violated a software license contract to benefit rival chipmaker Intel Corp for making broadband modems  the latest salvo in the longstanding dispute between Qualcomm and Apple.",
        "date": "11022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 5-Qualcomm sues Apple for breach of software license contract "
    },
    {
        "content": "Nov 2 Qualcomm Inc has sued Apple Inc   alleging that it violated a software license contract to benefit rival chipmaker Intel for making broadband modems  the latest salvo in a longstanding dispute between the two companies.",
        "date": "11022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "REFILE-Qualcomm sues Apple for contract breach "
    },
    {
        "content": "Nov 1 Qualcomm Inc's fourth-quarter profit and revenue beat market expectations as strength in its smartphone chips business was complemented by demand for chips used in automobiles and for the Internet of Things (IoT).",
        "date": "11012017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Demand for modem  IoT chips helps Qualcomm top estimates "
    },
    {
        "content": "* Nasdaq hits new record high; dollar in tight range (Updates with U.S. market open; changes dateline and byline)",
        "date": "11062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "GLOBAL MARKETS-Oil surges to over two-year peak; shares little changed "
    },
    {
        "content": "Apple Inc  has designed iPhones and iPads that would drop chips supplied by Qualcomm Inc   according to two people familiar with the matter. | Video ",
        "date": "10312017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Apple could drop Qualcomm components in next year's iPhones  iPads: sources "
    },
    {
        "content": "SAN FRANCISCO Chipmaker Qualcomm Inc and private equity firm JMC Capital Partners are looking to sell their stakes in a joint venture that operates more than 1 300 free WiFi kiosks fashioned from old phone booths around New York City  according to people familiar with the matter.",
        "date": "11022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm  JMC seek to exit Alphabet-backed New York WiFi project: sources "
    },
    {
        "content": "SAN FRANCISCO  Nov 1 Chipmaker Qualcomm Inc and private equity firm JMC Capital Partners are looking to sell their stakes in a joint venture that operates more than 1 300 free WiFi kiosks fashioned from old phone booths around New York City  according to people familiar with the matter.",
        "date": "11022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Qualcomm  JMC seek to exit Alphabet-backed New York WiFi project -sources "
    },
    {
        "content": "SAN FRANCISCO  Nov 1 Chipmaker Qualcomm Inc and private equity firm JMC Capital Partners are looking to sell their stakes in a joint venture that operates more than 1 300 free WiFi kiosks fashioned from old phone booths around New York City  according to people familiar with the matter.",
        "date": "11012017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm  JMC seek to exit Alphabet-backed New York WiFi project -sources "
    },
    {
        "content": "* Qualcomm confirms receipt of unsolicited proposal from Broadcom",
        "date": "11062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm confirms receipt of unsolicited proposal from Broadcom "
    },
    {
        "content": "Oct 31 Shares in Qualcomm Inc fell as much as 8 percent on Tuesday after reports that Apple Inc would not use its modem chips in iPhones and iPads from next year.",
        "date": "10312017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm dips on risk of losing Apple  Intel gains "
    },
    {
        "content": "Oct 31 Shares in Qualcomm Inc fell as much as 8 percent on Tuesday on reports that Apple Inc would not use its modem chips in iPhones and iPads from next year.",
        "date": "10312017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Qualcomm dips on risk of losing Apple  Intel gains "
    },
    {
        "content": "* Sees Q1 2018 MSM chip shipments‍​ of 220 million to 240 million",
        "date": "11012017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm Q4 adj. earnings per share $0.92 "
    },
    {
        "content": "* Qualcomm is set to reject Broadcom’s takeover offer; views rival’s $130 bn proposal as too low and fraught with regulatory risks- FT  citing sources‍​ Source text : http://on.ft.com/2ixBUvG",
        "date": "11062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm set to reject Broadcom's takeover offer - FT‍​ "
    },
    {
        "content": "Nov 1 Smartphone chipmaker Qualcomm Inc reported a 89.5 percent slump in quarterly profit on Wednesday as the company’s ongoing patent battle with Apple Inc hurt both its licensing and chips business.",
        "date": "11012017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm profit sinks nearly 90 pct "
    },
    {
        "content": "* Broadcom proposes to acquire Qualcomm for $70.00 per share in cash and stock in transaction valued at $130 billion",
        "date": "11062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Broadcom proposes to acquire Qualcomm for $70.00 per share in cash and stock in transaction valued at $130 bln "
    },
    {
        "content": "Oct 30 Apple Inc has designed iPhones and iPads that would drop chips supplied by Qualcomm Inc   according to two people familiar with the matter.",
        "date": "10312017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "REFILE-RPT-UPDATE 1-Apple could drop Qualcomm components in next year's iPhones  iPads -sources "
    },
    {
        "content": "Nov 6 Communications chipmaker Broadcom Ltd on Monday said it offered to buy smartphone chip supplier Qualcomm Inc for $70 per share or $103 billion in cash and stock  in what would be the biggest technology acquisition ever.",
        "date": "11062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Broadcom offers to buy mobile chipmaker Qualcomm for $103 billion "
    },
    {
        "content": "* NXP Semiconductors NV qtrly revenue of $2.39 billion  a decline of 3 percent year on year‍​",
        "date": "10262017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Nxp Semiconductors NV reports qtrly earnings per share  $0.31 "
    },
    {
        "content": "Oct 30 Apple Inc has designed iPhones and iPads that would drop chips supplied by Qualcomm Inc   according to two people familiar with the matter.",
        "date": "10312017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "REFILE-Apple could drop Qualcomm components in next year's iPhones  iPads -sources "
    },
    {
        "content": "* Apple is designing iPhones  iPads that would drop Qualcomm components- WSJ citing sources‍",
        "date": "10312017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Apple is designing iPhones  iPads that would drop Qualcomm components- WSJ citing sources‍ "
    },
    {
        "content": "* Qualcomm extends cash tender offer for all outstanding shares of NXP",
        "date": "10202017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm extends cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "* Qualcomm and Mercedes-AMG Petronas Motorsport extend strategic partnership focusing on high-speed communications and wireless power",
        "date": "10202017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm and Mercedes extend communications partnership "
    },
    {
        "content": "* Qualcomm appoints Penny Baldwin as senior vice president and chief marketing officer Source text for Eikon: Further company coverage:",
        "date": "10182017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm appoints Penny Baldwin as chief marketing officer "
    },
    {
        "content": "SHANGHAI/BEIJING Qualcomm Inc wants to hit Apple Inc where it hurts most: iPhone sales in China - one of its biggest global markets where most of its flagship smartphones are made.",
        "date": "10172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Patently tough: Long road ahead for Qualcomm in China case against Apple "
    },
    {
        "content": "Qualcomm Inc  confirmed an earlier report that the chipmaker had filed lawsuits in China  seeking to halt the manufacture and sale of Apple Inc's  iPhones in the country.",
        "date": "10132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm files lawsuits in China to ban iPhones "
    },
    {
        "content": "Oct 13 Qualcomm Inc confirmed an earlier report that the chipmaker had filed lawsuits in China  seeking to halt the manufacture and sale of Apple Inc's iPhones in the country.",
        "date": "10132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Qualcomm files lawsuits in China to ban iPhones "
    },
    {
        "content": "Oct 13 Qualcomm Inc filed lawsuits in China  seeking to halt the manufacture and sale of Apple Inc's iPhones in the country  Bloomberg reported on Friday.",
        "date": "10132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm files lawsuits in China to ban iPhones - Bloomberg "
    },
    {
        "content": "* Qualcomm asks China to halt manufacture  sale of Apple iPhones - Bloomberg‍​ Source text: https://bloom.bg/2iclZ9X Further company coverage:",
        "date": "10132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm asks China to halt manufacture  sale of Apple iPhones - Bloomberg‍​ "
    },
    {
        "content": "* Says it agrees and supports Taiwan Fair Trade Commission's decision on Qualcomm",
        "date": "10122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Mediatek agrees and supports Taiwan Fair Trade Commission's decision on Qualcomm "
    },
    {
        "content": "HONG KONG Qualcomm Inc  faces an antitrust fine in Taiwan  the latest in a years-long streak of regulatory setbacks to its business model that comes as it also fights U.S. regulators and iPhone maker Apple Inc  in court over many of the same legal issues.",
        "date": "10112017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Taiwan fines Qualcomm $774 million for antitrust violations "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.57per share Source text for Eikon: Further company coverage:",
        "date": "10102017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm sets quarterly cash dividend of $0.57 per share "
    },
    {
        "content": "HONG KONG  Oct 11 Qualcomm Inc faces an antitrust fine in Taiwan  the latest in a years-long streak of regulatory setbacks to its business model that comes as it also fights U.S. regulators and iPhone maker Apple Inc in court over many of the same legal issues.",
        "date": "10112017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Taiwan fines Qualcomm $774 mln for antitrust violations "
    },
    {
        "content": "* Qualcomm disagrees with decision by Taiwan Fair Trade Commission and intends to seek a stay and appeal the decision",
        "date": "10112017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm comments on fine imposed by Taiwan FTC "
    },
    {
        "content": "LONDON Silicon Valley graphics chipmaker NVIDIA unveiled on Tuesday the first computer chips for developing fully autonomous vehicles and said it had more than 25 customers working to build a new class of driverless cars  robotaxis and long-haul trucks.",
        "date": "10102017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "NVIDIA unveils next-generation platform for fully autonomous cars "
    },
    {
        "content": "* Qualcomm fined $773 million in Taiwan for antitrust violations - Bloomberg‍​ Source text: [https://bloom.bg/2yadH8M] Further company coverage:",
        "date": "10112017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm fined $773 million in Taiwan for antitrust violations - Bloomberg‍​ "
    },
    {
        "content": "LONDON  Oct 10 Silicon Valley graphics chipmaker NVIDIA unveiled on Tuesday the first computer chips for developing fully autonomous vehicles and said it had more than 25 customers working to build a new class of driverless cars  robotaxis and long-haul trucks.",
        "date": "10102017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-NVIDIA unveils next-generation platform for fully autonomous cars "
    },
    {
        "content": "LONDON  Oct 10 Silicon Valley graphics chipmaker NVIDIA unveiled on Tuesday the first computer chips for developing fully autonomous vehicles and said it had more than 25 customers working to build a new class of driverless cars  robotaxis and long-haul trucks.",
        "date": "10102017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "NVIDIA unveils next-generation chip for fully autonomous cars "
    },
    {
        "content": "BRUSSELS U.S. smartphone chipmaker Qualcomm has offered concessions in an attempt to allay EU antitrust concerns over its $38-billion bid for NXP Semiconductors  the largest ever in the semiconductor industry.",
        "date": "10092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm offers EU concessions over $38 billion NXP takeover bid "
    },
    {
        "content": "Apple Inc  said on Friday its general counsel  Bruce Sewell  will retire and be succeeded by former Honeywell International Inc  executive Katherine Adams  who will take over Apple's multinational legal battle against Qualcomm Inc .",
        "date": "10062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Apple names former Honeywell executive as new general counsel "
    },
    {
        "content": "There is a \"strong case\" for expecting chipmaker Qualcomm Inc to raise its offer for NXP Semiconductors NV  Morgan Stanley analysts wrote on Monday  saying investors they spoke to last week believed the price would rise.",
        "date": "10092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "'Overwhelming' view is Qualcomm will up offer for NXP: Morgan Stanley "
    },
    {
        "content": "Oct 6 Apple Inc said on Friday its general counsel  Bruce Sewell  will retire and be succeeded by former Honeywell International Inc executive Katherine Adams  who will take over Apple's multinational legal battle against Qualcomm Inc.",
        "date": "10062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Apple names former Honeywell exec as new general counsel "
    },
    {
        "content": "* Qualcomm signs 3G/4G patent license agreement with General Mobile",
        "date": "10092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm signs 3G/4G patent license agreement with General Mobile "
    },
    {
        "content": "BRUSSELS  Oct 9 U.S. smartphone chipmaker Qualcomm has offered concessions in an attempt to allay EU antitrust concerns over its $38-billion bid for NXP Semiconductors  the largest ever in the semiconductor industry.",
        "date": "10092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm offers EU concessions over $38 bln NXP takeover bid "
    },
    {
        "content": "* Qualcomm Inc - ‍has designed and developed reference designs for cost-effective  connected and medical-grade biometric patches​",
        "date": "09272017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm ‍has developed reference designs for biometric patches​ "
    },
    {
        "content": "* Qualcomm extends cash tender offer for all outstanding shares of NXP",
        "date": "09222017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm extends cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "FRANKFURT  Sept 14 The first 5G phones ready to meet next-generation mobile standards will be available for the mass market in 2019 - a year ahead of most predictions - in several Asian countries and the United States  Qualcomm's CEO said on Thursday.",
        "date": "09142017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "UPDATE 1-5G phones to go mainstream in key markets in 2019 - Qualcomm CEO "
    },
    {
        "content": "FRANKFURT  Sept 14 The first 5G phones ready to meet the next-generation mobile standard will be available for the mass market in 2019 - a year ahead of most predictions - in several Asian countries and the United States  Qualcomm's CEO said on Thursday.",
        "date": "09142017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "5G phones to go mainstream in key markets in 2019 - Qualcomm CEO "
    },
    {
        "content": "STOCKHOLM Sweden's Autoliv   said it planned to split into two listed companies  with one focused on high-tech safety gear to capture the rapid growth toward self-driving vehicles  lifting its shares on Thursday.",
        "date": "09142017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Autoliv lifts shares with plans to split into two listed companies "
    },
    {
        "content": "* Qualcomm and Nokia to collaborate on driving wide-scale mobile 5G NR deployments to meet growing market demand",
        "date": "09112017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm and Nokia to collaborate on driving wide-scale mobile 5G NR deployments "
    },
    {
        "content": "* Qualcomm announces 5G NR mmWave prototype to accelerate mobile deployments for smartphones Source text for Eikon: Further company coverage:",
        "date": "09112017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm announces 5G NR mmWave prototype to accelerate mobile deployments for smartphones "
    },
    {
        "content": "Sept 8 Apple Inc's 11 foreign lawsuits against Qualcomm Inc can proceed while the company's dispute plays out in the United States  a U.S. federal judge in San Diego ruled Sept. 7.",
        "date": "09082017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Apple lawsuits against Qualcomm can proceed  U.S. judge rules "
    },
    {
        "content": "BRUSSELS  Sept 6 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "UPDATE 1-EU mergers and takeovers (Sept 6) "
    },
    {
        "content": "* Qualcomm stay appeal denied by Seoul High Court on absence of irreparable harm; appeal to Seoul High Court on merits of the case to proceed",
        "date": "09052017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm stay appeal denied by Seoul High Court "
    },
    {
        "content": "BRUSSELS  Sept 6 EU antitrust regulators have halted for a second time their review of U.S. smartphone chipmaker Qualcomm's $38-billion bid for NXP Semiconductors after the companies failed to provide key details of the deal.",
        "date": "09062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU regulators halt review of Qualcomm-NXP deal for second time "
    },
    {
        "content": "SEOUL A South Korean court on Monday rejected Qualcomm Inc's  request to suspend an order by the country's antitrust agency to take corrective action on the way it licenses patents.",
        "date": "09042017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "South Korean court rejects Qualcomm's request to suspend antitrust body's order "
    },
    {
        "content": "SEOUL  Sept 4 A South Korean court on Monday rejected Qualcomm Inc's request to suspend an order by the country's antitrust agency to take corrective action on the way it licences patents.",
        "date": "09042017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "S.Korean court rejects Qualcomm's request to suspend antitrust body's order "
    },
    {
        "content": "* Qualcomm and Himax Technologies jointly announce high resolution 3D depth sensing solution",
        "date": "08302017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm and Himax Technologies jointly announce high resolution 3D depth sensing solution "
    },
    {
        "content": "* Qualcomm announces president  Derek Aberle  to leave company as of December 31st 2017",
        "date": "08242017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm announces president  Derek Aberle  to leave company as of Dec 31 2017 "
    },
    {
        "content": "Aug 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "08242017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Qualcomm extends cash tender offer for all outstanding shares of NXP",
        "date": "08242017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm extends cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "Aug 14 Chipmaker Qualcomm Inc on Monday disclosed further details about the impact of an ongoing dispute with Apple Inc  responding to questions from the U.S. Securities and Exchange Commission.",
        "date": "08142017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm outlines impact of dispute with Apple after SEC request "
    },
    {
        "content": "LONDON  Aug 11 Following are five big themes likely to dominate thinking of investors and traders in the coming week  and the Reuters stories related to them.",
        "date": "08142017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "GRAPHIC-Take Five: World markets themes for the week ahead "
    },
    {
        "content": "* Takes stake of 4.5 million sponsored ADS in Alibaba - SEC filing",
        "date": "08112017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Third Point‍​ takes share stake in Alibaba  dissolves share stake in Qualcomm  JPMorgan "
    },
    {
        "content": "LONDON Following are five big themes likely to dominate thinking of investors and traders in the coming week  and the Reuters stories related to them.",
        "date": "08112017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Take Five: World markets themes for the week ahead "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO U.S. trade officials have agreed to investigate Qualcomm Inc's allegations that Apple Inc infringed on patents with its iPhone 7 and other devices  the U.S. International Trade Commission said on Tuesday.",
        "date": "08082017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "U.S. to review Qualcomm's complaints about Apple iPhone patents "
    },
    {
        "content": "* U.S. International Trade Commission to pursue investigation of Apple",
        "date": "08082017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-U.S. International Trade Commission to pursue investigation of Apple "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO  Aug 8 U.S. trade officials have agreed to investigate Qualcomm Inc's allegations that Apple Inc infringed on patents with its iPhone 7 and other devices  the U.S. International Trade Commission said on Tuesday.",
        "date": "08082017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 3-U.S. to review Qualcomm's complaints about Apple iPhone patents "
    },
    {
        "content": "Activist investor Elliott Management Corp on Friday disclosed a 6 percent stake in chipmaker NXP Semiconductors NV  and indicated it was pushing for a higher price tag in NXP's pending sale to Qualcomm Inc  for $38 billion in cash.",
        "date": "08042017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Elliott discloses NXP stake  to push for higher price in Qualcomm deal "
    },
    {
        "content": "Aug 4 Activist investor Elliott Management Corp on Friday disclosed a 6 percent stake in chipmaker NXP Semiconductors NV and indicated it was pushing for a higher price tag in NXP's pending sale to Qualcomm Inc for $38 billion in cash.",
        "date": "08042017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Elliott discloses NXP stake  to push for higher price in Qualcomm deal "
    },
    {
        "content": "Aug 4 Activist investor Elliott Management Corp on Friday disclosed a 6 percent stake in chipmaker NXP Semiconductors NV  which is being bought by Qualcomm Inc for $38 billion  and indicated it could engage in talks to boost the offer price.",
        "date": "08042017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Elliott discloses NXP stake  Qualcomm's $38 bln bid in its radar "
    },
    {
        "content": "* Qualcomm and Nichicon sign commercial wireless electric vehicle charging license agreement",
        "date": "07252017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm  Nichicon sign commercial wireless electric vehicle charging license agreement "
    },
    {
        "content": "* Qualcomm extends cash tender offer for all outstanding shares of NXP",
        "date": "07272017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm extends cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "TEL AVIV  July 25 Israeli digital farming company Prospera said on Tuesday it raised $15 million in a funding round led by Qualcomm Ventures  the investment arm of Qualcomm Inc.",
        "date": "07252017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Israel's Prospera raises $15 mln in round led by Qualcomm Ventures "
    },
    {
        "content": "STOCKHOLM  July 21 Swedish biometric firm Fingerprint Cards (FPC) said on Friday it had struck a deal to include its sensors in several Qualcomm products  after posting second-quarter earnings below market forecasts.",
        "date": "07212017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Fingerprint Cards says teams up with Qualcomm as Q2 profit misses forecasts "
    },
    {
        "content": "July 20 A group representing major technology companies has aligned itself against Qualcomm Inc in its legal dispute with Apple Inc by calling on regulators to reject Qualcomm's bid to ban the import of iPhones.",
        "date": "07202017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "UPDATE 1-Tech group sides with Apple in Qualcomm's iPhone ban dispute "
    },
    {
        "content": "* Fingerprint Cards says teaming-up with Qualcomm to pre-integrate capacitive fingerprint technology on low- and mid-tier Qualcomm snapdragon mobile platforms For the original story click here: http://bit.ly/2ugcSXC Further company coverage: (Stockholm Newsroom)",
        "date": "07212017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Fingerprint Cards says enters cooperation with Qualcomm "
    },
    {
        "content": "July 20 A group representing major technology companies has aligned itself against Qualcomm Inc in its legal dispute with Apple Inc by calling on regulators to reject Qualcomm's bid to ban the import of iPhones.",
        "date": "07202017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Tech group sides with Apple in Qualcomm's iPhone ban dispute "
    },
    {
        "content": "A group representing major technology companies has aligned itself against Qualcomm Inc in its legal dispute with Apple Inc by calling on regulators to reject Qualcomm's bid to ban the import of iPhones.",
        "date": "07212017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Tech group sides with Apple in Qualcomm's iPhone ban dispute "
    },
    {
        "content": "* Dow down 0.13 pct  S&P 500 down 0.02 pct  Nasdaq up 0.08 pct (Updates to market close  changes byline)",
        "date": "07202017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Wall St flat as home improvement retailers get Amazoned "
    },
    {
        "content": "BRUSSELS  July 17 U.S. chipmaker Qualcomm faces the threat of a daily fine of 580 000 euros ($665 000) for failing to provide EU antitrust regulators with information after losing an appeal against the penalty in an EU court on Monday. Qualcomm  which was charged by the European Commission of using anti-competitive methods to squeeze out British phone software maker Icera  last month asked the Luxembourg-based General Court to suspend the order.",
        "date": "07172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm loses appeal against EU threat of daily fine "
    },
    {
        "content": "July 19 iPhone chip supplier Qualcomm Inc faces a fresh set of antitrust allegations from a group of four companies that assemble the iPhone and other products on behalf of Apple Inc.",
        "date": "07192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Four Apple contractors accuse Qualcomm of antitrust violations "
    },
    {
        "content": "Qualcomm Inc  forecast fourth-quarter profit below analysts' estimates as the company's escalating patent battle with Apple Inc  continues to take a toll on its licensing business.",
        "date": "07192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm's profit forecast disappoints as Apple battle takes toll "
    },
    {
        "content": "July 19 Qualcomm Inc forecast fourth-quarter profit below analysts' estimates as the company's escalating patent battle with Apple Inc continues to take a toll on its licensing business.",
        "date": "07192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Qualcomm's profit forecast disappoints as Apple battle takes toll "
    },
    {
        "content": "July 19 iPhone chip supplier Qualcomm Inc faces a new set of antitrust allegations from a group of four companies that assemble the iPhone and other products on behalf of Apple Inc.",
        "date": "07192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Four Apple contractors accuse Qualcomm of antitrust violations "
    },
    {
        "content": "* Q3 earnings per share view $0.81  revenue view $5.26 billion -- Thomson Reuters I/B/E/S",
        "date": "07192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm reports quarterly GAAP EPS of $0.58 "
    },
    {
        "content": "July 19 Qualcomm Inc reported a 40 percent slump in quarterly profit  hurt in part by its escalating patent battle with Apple Inc.",
        "date": "07192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm's profit slumps amid Apple battle "
    },
    {
        "content": "* Brain Corp announces $114 million in series C funding round led by the Softbank Vision Fund",
        "date": "07192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Brain Corp announces $114 mln in series C funding round "
    },
    {
        "content": "WASHINGTON  July 6 Chipmaker Qualcomm Inc will ask the U.S. International Trade Commission to bar Apple Inc from selling some iPhones and iPads in the United States on the grounds that they infringe on six Qualcomm patents.",
        "date": "07062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm accuses Apple of infringing six patents in iPhone  iPad "
    },
    {
        "content": "WASHINGTON  July 6 Chipmaker Qualcomm Inc will ask the U.S. International Trade Commission to bar Apple Inc from selling some iPhones and iPads in the United States that use chips made by competitor Intel Corp on the grounds that the devices infringe on six Qualcomm patents.",
        "date": "07062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 3-Qualcomm accuses Apple of infringing six patents in iPhone  iPad "
    },
    {
        "content": "* Qualcomm files patent infringement complaints against apple with international trade commission and federal court",
        "date": "07062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm files patent infringement complaints against Apple with ITC  federal court "
    },
    {
        "content": "* Qualcomm extends cash tender offer for all outstanding shares of NXP",
        "date": "06282017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm extends cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "BRUSSELS  June 29 EU antitrust authorities have halted their scrutiny of Qualcomm's $38 billion bid for NXP Semiconductors after the companies failed to provide relevant information.",
        "date": "06292017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU antitrust regulators halt Qualcomm  NXP deal review "
    },
    {
        "content": "June 27 The Federal Trade Commission's antitrust lawsuit against Qualcomm Inc can proceed  a federal judge ruled late on Monday  meaning the iPhone chip supplier must now wage a fight with U.S. regulators even as it contests a separate $1 billion lawsuit filed by Apple Inc.",
        "date": "06272017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "U.S. antitrust lawsuit against Qualcomm to proceed  judge rules "
    },
    {
        "content": "BRUSSELS The European Commission handed down a record 2.42 billion euro  ($2.73 billion) fine to Alphabet  unit Google on Tuesday for breaching EU antitrust rules after a seven-year investigation prompted by complaints from both sides of the Atlantic.",
        "date": "06272017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Factbox: EU hits Google with record $2.7 billion fine "
    },
    {
        "content": "Apple Inc broadened a legal attack on Qualcomm Inc  arguing to a U.S. federal court that license agreements that secure the chip maker a cut of every iPhone manufactured were invalid.",
        "date": "06212017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Apple tells court Qualcomm chip licenses are invalid "
    },
    {
        "content": "June 20 Apple Inc broadened a legal attack on Qualcomm Inc  arguing to a U.S. federal court that license agreements that secure the chip maker a cut of every iPhone manufactured were invalid.",
        "date": "06202017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Apple tells court Qualcomm chip licenses are invalid "
    },
    {
        "content": "June 23 Canada's BlackBerry Ltd reported a quarterly profit on Friday  helped by a $940 million arbitration payment from U.S. chipmaker Qualcomm Inc.",
        "date": "06232017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BlackBerry reports quarterly profit on Qualcomm payment "
    },
    {
        "content": "June 20 Apple Inc broadened a legal attack on Qualcomm Inc  arguing to a U.S. federal court that license agreements that secure the chip maker a cut of every iPhone manufactured were invalid.",
        "date": "06212017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Apple tells court Qualcomm chip licenses are invalid "
    },
    {
        "content": "* Qualcomm Inc - as part of its investment  Qualcomm president Derek Aberle will join board of directors of Amionx Source text for Eikon: Further company coverage:",
        "date": "06202017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm makes strategic investment in Amionx "
    },
    {
        "content": "* Qualcomm receives antitrust clearance by the Taiwan Fair Trade Commission for NXP Semiconductors acquisition",
        "date": "06152017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm receives antitrust for NXP Semiconductors acquisition "
    },
    {
        "content": "BOLTON  Ontario  June 9 A visit to trucking firm Titanium Transportation helps explain why BlackBerry's stock is once again a darling in Canadian markets  having soared 70 percent in two months.",
        "date": "06132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "CORRECTED-Born-again BlackBerry: Canadian icon hopes to ride trucks to growth "
    },
    {
        "content": "* Qualcomm announces agreement with Lifescan Inc  a Johnson & Johnson diabetes care company  to inform patient care with connected blood glucose meters",
        "date": "06122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm announces agreement with Lifescan Inc "
    },
    {
        "content": "* Futures down: Dow 18 pts  S&P 4 pts  Nasdaq 51.25 pts (Adds details  comments  updates prices)",
        "date": "06122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Wall St set to open lower as tech selloff continues "
    },
    {
        "content": "June 12 U.S. stock index futures were lower on Monday  with Nasdaq futures taking the biggest hit as investors locked in gains on the richly-valued technology sector.",
        "date": "06122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Futures down as tech rout continues "
    },
    {
        "content": "TORONTO  June 7 Blackberry Ltd. said on Wednesday it has developed new software for running complex computer systems on vehicles that will be bundled with semiconductors sold by Qualcomm Inc.",
        "date": "06072017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Blackberry introduces auto software  will bundle with Qualcomm chips "
    },
    {
        "content": "BRUSSELS EU antitrust authorities opened an investigation on Friday into Qualcomm's  $38-billion bid for NXP Semiconductors   ratcheting up pressure on the U.S. smartphone chipmaker to offer concessions to address their concerns.",
        "date": "06092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "EU antitrust regulators to investigate $38 billion Qualcomm  NXP deal "
    },
    {
        "content": "BRUSSELS  June 9 EU antitrust authorities opened an investigation on Friday into Qualcomm's $38-billion bid for NXP Semiconductors  ratcheting up pressure on the U.S. smartphone chipmaker to offer concessions to address their concerns.",
        "date": "06092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-EU antitrust regulators to investigate $38 bln Qualcomm  NXP deal "
    },
    {
        "content": "BRUSSELS  June 9 U.S. smartphone chipmaker Qualcomm said on Friday it was confident it would addressed EU antitrust concerns about its $38-billion bid for NXP Semiconductors  after EU regulators started an investigation into the deal.",
        "date": "06092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm says confident can address EU concerns about NXP deal "
    },
    {
        "content": "BRUSSELS  June 9 EU antitrust authorities opened on Friday an investigation into U.S. smartphone chipmaker Qualcomm's $38-billion bid for NXP Semiconductors   concerned that the merged company may squeeze out rivals and jack up prices.",
        "date": "06092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU antitrust regulators to investigate $38 bln Qualcomm  NXP deal "
    },
    {
        "content": "* Qualcomm extends cash tender offer for all outstanding shares of NXP",
        "date": "05312017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm extends cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "* Parkervision -middle district of Florida granted co's request to lift stay and reopen its patent infringement case against Apple  LG and Qualcomm",
        "date": "05302017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Parkervision says middle district of Florida granted co's request to reopen patent infringement case against Apple  LG and Qualcomm "
    },
    {
        "content": "BRUSSELS  June 2 U.S. smartphone chipmaker Qualcomm has not offered any concessions so far in its $38-billion bid for NXP Semiconductors  EU antitrust regulators said on Friday  increasing the risk of a lengthy investigation into the deal.",
        "date": "06022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU regulators say Qualcomm has not offered concessions in NXP bid "
    },
    {
        "content": "May 26 Canada's BlackBerry Ltd said on Friday that U.S. chipmaker Qualcomm Inc has agreed to pay the software maker $940 million  including interest and legal fees  to settle a royalty dispute.",
        "date": "05262017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BlackBerry  Qualcomm decide on final amount to resolve royalty dispute "
    },
    {
        "content": "TORONTO  May 23 BlackBerry Ltd shares surged to a four-year high in Toronto on Tuesday  extending a two-month rally spurred on by expectations for strong growth in the fast-expanding cyber security and automotive software markets.",
        "date": "05232017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-BlackBerry climbs on hopes for growth in security  autos "
    },
    {
        "content": "* Blackberry Ltd - reached an agreement with qualcomm incorporated resolving all amounts payable in connection with interim arbitration decision announced on April 12  2017​",
        "date": "05262017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Blackberry ltd announces final award in Qualcomm arbitration "
    },
    {
        "content": "BRUSSELS  May 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05232017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU mergers and takeovers (May 23) "
    },
    {
        "content": "* Qualcomm announces pricing of $11.0 billion senior notes offering",
        "date": "05192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm announces pricing of $11 bln senior notes offering "
    },
    {
        "content": "BRUSSELS  May 19 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU mergers and takeovers (May 19) "
    },
    {
        "content": "* Qualcomm Inc files preliminary prospectus supplement with U.S. SEC related to a 9-part notes offering - SEC filing Source text: (http://bit.ly/2rz9Hb1) Further company coverage:",
        "date": "05192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm files preliminary prospectus supplement related to a 9-part notes offering "
    },
    {
        "content": "* Qualcomm and Google to enable daydream standalone virtual reality headsets",
        "date": "05172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm and Google to enable Daydream standalone VR headsets "
    },
    {
        "content": "Chipmaker Qualcomm Inc filed a lawsuit against four Apple Inc contract manufacturers  including Foxconn Technology Group  for not paying royalties  as its legal battle with the iPhone maker intensifies.",
        "date": "05172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm sues four Apple contract manufacturers "
    },
    {
        "content": "BRUSSELS  May 17 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU mergers and takeovers (May 17) "
    },
    {
        "content": "* Qualcomm files breach of contract complaint against Apple's manufacturers for non-payment of royalties",
        "date": "05172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm files breach of contract complaint against Apple's manufacturers for non-payment of royalties "
    },
    {
        "content": "Chipmaker Qualcomm Inc  has escalated its patent battle with Apple Inc   suing Foxconn and three other Taiwanese manufacturers that supply iPhone and iPad components for not paying royalties.",
        "date": "05182017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm ups ante in fight with Apple  sues four Taiwanese suppliers "
    },
    {
        "content": "May 17 Qualcomm Inc said on Wednesday it filed a complaint against Foxconn Technology Group and other Apple Inc manufacturers for breaching license agreements.",
        "date": "05172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm files breach of contract complaint against Apple's manufacturers "
    },
    {
        "content": "BRUSSELS  May 18 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05182017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU mergers and takeovers (May 18) "
    },
    {
        "content": "* Appaloosa LP dissolves share stake in Bristol Myers Squibb Co - sec filing",
        "date": "05122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Appaloosa LP dissolves share stake in Bristol Myers  Qualcomm "
    },
    {
        "content": "SAN FRANCISCO  May 18 Qualcomm Inc said on Thursday it had demonstrated how electric vehicles could be charged wirelessly while driving  a technology some believe will help accelerate the adoption of self-driving cars.",
        "date": "05182017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm shows off wireless charging for electric vehicles "
    },
    {
        "content": "BRUSSELS  May 12 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU mergers and takeovers (May 12) "
    },
    {
        "content": "* Foxconn  three other Taiwanese suppliers named in complaint",
        "date": "05182017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 4-Qualcomm ups ante in fight with Apple  sues four Taiwanese suppliers "
    },
    {
        "content": "* Qualcomm Snapdragon 660 and 630 mobile platforms drive advanced photography  enhanced gaming  integrated connectivity and machine learning",
        "date": "05092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm introduces new mobile platforms Qualcomm Snapdragon 660 and 630 "
    },
    {
        "content": "* Qualcomm said to seek U.S. import ban on iPhones- CNBC  citing Bloomberg Source text : http://cnb.cx/2p9Xit6 Further company coverage:",
        "date": "05032017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm said to seek U.S. import ban on iPhones- CNBC  citing Bloomberg "
    },
    {
        "content": "BRUSSELS EU regulators will decide by June 9 whether to clear smartphone chipmaker Qualcomm's $38 billion takeover of NXP Semiconductors NV  with rivals voicing concerns about continued access to key NXP technology after the deal.",
        "date": "05022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "EU to rule on $38 bln Qualcomm  NXP deal by June 9 "
    },
    {
        "content": "BRUSSELS EU regulators will decide by June 9 whether to clear smartphone chipmaker Qualcomm's  $38 billion takeover of NXP Semiconductors NV   with rivals voicing concerns about continued access to key NXP technology after the deal.",
        "date": "05022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU to rule on $38 billion Qualcomm  NXP deal by June 9 "
    },
    {
        "content": "BRUSSELS  May 2 EU regulators will decide by June 9 whether to clear smartphone chipmaker Qualcomm's $38 billion takeover of NXP Semiconductors NV  with rivals voicing concerns about continued access to key NXP technology after the deal.",
        "date": "05022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-EU to rule on $38 bln Qualcomm  NXP deal by June 9 "
    },
    {
        "content": "BRUSSELS  May 2 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU mergers and takeovers (May 2) "
    },
    {
        "content": "* Qualcomm extends cash tender offer for all outstanding shares of NXP",
        "date": "05022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm extends cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "BRUSSELS  May 2 EU antitrust regulators will decide by June 9 whether to clear smartphone chipmaker Qualcomm's $38 billion bid for NXP Semiconductors NV   which would make it the leading supplier to the fast-growing automotive chips market.",
        "date": "05022017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU regulators to rule on $38 bln Qualcomm  NXP deal by June 9 "
    },
    {
        "content": "Qualcomm Inc slashed its current-quarter profit and revenue forecasts on Friday  amid an escalating legal battle between the chipmaker and Apple Inc.",
        "date": "04282017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm warns of profit hit as Apple battle intensifies "
    },
    {
        "content": "* Apple says will stop paying royalties (Adds details  updates shares)",
        "date": "04282017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Qualcomm warns of profit hit as Apple battle intensifies "
    },
    {
        "content": "* Says \"we’ve been trying to reach a licensing agreement with Qualcomm for more than five years but they have refused to negotiate fair terms\"",
        "date": "04282017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Apple comments on payment dispute with Qualcomm "
    },
    {
        "content": "April 28 Qualcomm Inc said on Friday Apple Inc will not pay royalties to its contract manufacturers  that are owed to the chipmaker  for sales made in the first quarter of 2017.",
        "date": "04282017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm says Apple to stop paying royalties  cuts profit forecast "
    },
    {
        "content": "April 26 Key healthcare stakeholders  led by the World Economic Forum  plan pilot programs this year to show the value of a new model for healthcare that would track and pay for treatment based on how well it works rather than the volume of care.",
        "date": "04262017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Global foundation launches value-based healthcare pilots "
    },
    {
        "content": "* Qualcomm Inc signs 3G/4G patent license agreement with Smartron",
        "date": "04242017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm signs 3G/4G patent license agreement with Smartron "
    },
    {
        "content": "A coalition of technology companies including Samsung Electronics Co and Intel Corp have urged President Donald Trump not to interfere with an Obama administration antitrust case against Qualcomm Inc over its patent licensing practices.",
        "date": "04212017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Tech companies urge Trump to continue FTC case against Qualcomm "
    },
    {
        "content": "Qualcomm Inc   the largest maker of chips used in smartphones  reported quarterly revenue and profit that beat analysts' estimates  helping ease concerns surrounding the company's dispute with Apple Inc .",
        "date": "04192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm results beat help allay worries over Apple dispute "
    },
    {
        "content": "* Shares rise 2.4 pct aftermarket (Adds details  updates shares)",
        "date": "04192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Qualcomm results beat help allay worries over Apple dispute "
    },
    {
        "content": "April 19 Qualcomm Inc  the largest maker of chips used in smartphones  reported 9.6 percent fall in quarterly revenue  hurt by an arbitration decision to pay Canada's BlackBerry Ltd for previously received royalties.",
        "date": "04192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "CORRECTED-Chipmaker Qualcomm's revenue falls 9.6 pct "
    },
    {
        "content": "Qualcomm Inc hit back at Apple Inc's charges that were made in a U.S. lawsuit in January  saying the iPhone maker breached agreements with the firm and encouraged regulatory attacks on its business in various jurisdictions around the world by making false statements.",
        "date": "04112017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm hits back at Apple's lawsuit  accuses iPhone maker of false statements "
    },
    {
        "content": "Chipmaker Qualcomm Inc said it was asked to refund Canada's BlackBerry Ltd a sum of $814.9 million in an arbitration settlement over royalties for certain past sales.",
        "date": "04122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BlackBerry awarded $814.9 mln in Qualcomm arbitration "
    },
    {
        "content": "Chipmaker Qualcomm Inc said on Wednesday it was asked to refund Canada's BlackBerry Ltd $814.9 million in an arbitration over royalties for certain past sales.",
        "date": "04122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm to pay BlackBerry $814.9 million to settle royalties dispute "
    },
    {
        "content": "* NXP Semiconductors NV - will not hold an earnings call nor provide forward guidance for Q2 of 2017 due to pending acquisition of NXP by Qualcomm Source text for Eikon: Further company coverage:",
        "date": "04102017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-NXP Semiconductors NV says will not hold an earnings call "
    },
    {
        "content": "* Does not agree with the decision - Qualcomm (Adds details  analysts comment)",
        "date": "04122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Qualcomm to pay BlackBerry $814.9 mln to settle royalties dispute "
    },
    {
        "content": "* NXP Semiconductors - will not hold an earnings call nor provide forward guidance for Q2 of 2017 due to pending acquisition of NXP by Qualcomm Source text for Eikon: Further company coverage:",
        "date": "04102017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-NXP to not hold earnings call nor provide forward guidance for Q2 2017 "
    },
    {
        "content": "* Qualcomm - announced binding interim arbitration award requiring co to refund a sum of $814.9 million  plus interest and attorneys' fees  to BlackBerry",
        "date": "04122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-BlackBerry awarded $814.9 mln in Qualcomm arbitration "
    },
    {
        "content": "* Blackberry awarded U.S. $814 868 350.00 in arbitration against Qualcomm",
        "date": "04122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Blackberry awarded $814.9 mln in Qualcomm arbitration "
    },
    {
        "content": "April 4 Smartphone chipmaker Qualcomm Inc has received approval from U.S. antitrust regulators for its proposed $47 billion acquisition of NXP Semiconductors NV  Qualcomm said in a statement on Tuesday.",
        "date": "04042017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm  NXP receive antitrust approval "
    },
    {
        "content": "Smartphone chipmaker Qualcomm Inc has received approval from U.S. antitrust regulators for its proposed $47 billion acquisition of NXP Semiconductors NV   Qualcomm said in a statement on Tuesday.",
        "date": "04052017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm  NXP receive antitrust approval "
    },
    {
        "content": "* Qualcomm extends cash tender offer for all outstanding shares of NXP",
        "date": "04042017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm extends cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "* Qualcomm appoints Dr. James H. Thompson as chief technology officer",
        "date": "03292017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm appoints James Thompson as chief technology officer "
    },
    {
        "content": "* Israeli start-ups raised nearly $5 billion in 2016  up 11 pct",
        "date": "03232017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "RPT-Mobileye deal to fuel investment in late-stage Israeli start-ups "
    },
    {
        "content": "* Israeli start-ups raised nearly $5 billion in 2016  up 11 pct",
        "date": "03222017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Mobileye deal to fuel investment in late-stage Israeli start-ups "
    },
    {
        "content": "* Unit introduces 205 mobile platform   the platform brings 4G LTE connectivity and 4G services to entry-level feature phones  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm 205 Mobile Platform brings 4G connectivity entry-level feature phones "
    },
    {
        "content": "* Qualcomm inc - quarterly cash dividend will increase from $0.53 to $0.57 per share of common stock  Source text for Eikon:  Further company coverage:",
        "date": "03072017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm increases quarterly dividend by 7.5 pct to $0.57 per share of common stock "
    },
    {
        "content": "* ParkerVision - patent trial and appeal board has issued decisions regarding petitions for inter partes review filed by Qualcomm against ParkerVision patents",
        "date": "03082017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-ParkerVision says patent trial and appeal board issued decisions regarding petitions for inter partes review filed by Qualcomm against ParkerVision patents "
    },
    {
        "content": "NEW YORK/HONG KONG Chinese telecom equipment maker ZTE Corp has agreed to plead guilty and pay nearly $900 million in a U.S. sanctions case  drawing a line under a damaging scandal that had threatened its cut off its supply chain. | Video ",
        "date": "03082017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "China's ZTE pleads guilty  settles U.S. sanctions case for nearly $900 million "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - China has been giving fair warning. Telecoms equipment maker ZTE has agreed to plead guilty for violating U.S. export controls. The charges could have been more severe and the $892 million fine is manageable for the $9 billion company. More powerful is the message: the new U.S. administration is prepared to take action against corporate giants to rein in troublesome nations.",
        "date": "03082017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "U.S. tech sanctions will rattle China's firewall "
    },
    {
        "content": "* ZTE to plead guilty to evading U.S. sanctions on Iran  N.Korea",
        "date": "03082017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 5-China's ZTE pleads guilty  settles U.S. sanctions case for nearly $900 mln "
    },
    {
        "content": "* Appaloosa lp  dissolves share stake in bank of america corp",
        "date": "02142017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Appaloosa LP dissolves share stake in Citigroup  Bank of America - SEC Filing "
    },
    {
        "content": "* Qualcomm announces first end-to-end 802.11ax Wi-Fi portfolio",
        "date": "02132017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm announces first end-to-end 802.11ax Wi-Fi portfolio "
    },
    {
        "content": "* Trump's promised deregulation to make doing business easier -Son",
        "date": "02082017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-SoftBank expects to gain from Trump's promised deregulation "
    },
    {
        "content": "* Qualcomm extends cash tender offer for all outstanding shares of nxp",
        "date": "02062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm extends cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "* Says the co's wholly owned unit EPCOS AG will transfer 51 percent stake in RF360 Holdings Singapore PTE. Ltd. to Qualcomm Global Trading PTE. Ltd  a unit of Qualcomm Inc",
        "date": "02062017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-TDK unit to transfer 51 pct stake in RF360 Holdings Singapore PTE. Ltd. to Qualcomm Global Trading PTE. Ltd "
    },
    {
        "content": "* Nxp shareholders approve all items proposed relating to qualcomm's tender offer",
        "date": "01272017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-NXP shareholders approve all items proposed relating to Qualcomm's tender offer "
    },
    {
        "content": "SAN FRANCISCO  Jan 26 Apple Inc's new legal assault on Qualcomm in the United States and China reflects its conclusion that regulators are unlikely to put an end to what it considers the chip maker's unfair business practices  analysts said.",
        "date": "01262017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "As regulators waver  Apple takes on Qualcomm in courts "
    },
    {
        "content": "* Dow up 0.13 pct  S&P down 0.10 pct  Nasdaq down 0.04 pct   (Updates to early afternoon)",
        "date": "01262017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Dow holds above 20 000; Qualcomm weighs on S&P  Nasdaq "
    },
    {
        "content": "* Q1 non-gaap total revenue $6.0 billion versus $5.8 billion last year",
        "date": "01252017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm Q1 non-GAAP total revenue $6.0 bln; Q1 non-GAAP EPS $1.19 "
    },
    {
        "content": "* Dow up 0.16 pct  S&P down 0.01 pct  Nasdaq down 0.08 pct   (Updates details  changes comment  updates prices)",
        "date": "01262017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Dow holds above 20 000 as investors focus on earnings "
    },
    {
        "content": "Jan 25 Qualcomm Inc reported a 3.9 percent rise in quarterly revenue  boosted by strong demand for its chips used in smartphones  at a time when the company is facing multiple legal challenges over its alleged \"anticompetitive\" tactics.",
        "date": "01252017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Chipmaker Qualcomm's revenue rises 3.9 pct amid legal challenges "
    },
    {
        "content": "Qualcomm Inc reported a lower-than-expected 3.9 percent rise in quarterly revenue on Wednesday  and defended its licensing model in the face of multiple legal challenges over its alleged \"anticompetitive\" tactics.",
        "date": "01262017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm misses revenue estimates  defends licensing model "
    },
    {
        "content": "Jan 25 Qualcomm Inc reported a lower-than-expected 3.9 percent rise in quarterly revenue on Wednesday  and defended its licensing model in the face of multiple legal challenges over its alleged \"anticompetitive\" tactics.",
        "date": "01262017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 3-Qualcomm misses revenue estimates  defends licensing model "
    },
    {
        "content": "Please click on the link below for Qualcomm Inc's fourth-quarter earnings press release:  Source text: ( http://bit.ly/2kuagDd )",
        "date": "01252017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm Inc Q4 results press release "
    },
    {
        "content": "Every day seems to bring new troubles for Qualcomm  the chip maker accused last week by Apple and the Federal Trade Commission of abusing its monopoly on a key broadband processor used in cellphones and tablets. Wednesday’s headache: an antitrust class action by consumers who bought devices containing the Qualcomm processors.",
        "date": "01252017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "With new class action  phone and tablet buyers add to Qualcomm’s woes "
    },
    {
        "content": "WASHINGTON  Jan 25 Apple Inc filed a lawsuit against Qualcomm Inc in Beijing  alleging that the chip supplier abused its clout in the chip industry and seeking 1 billion yuan ($145.32 million) in damages  Beijing's Intellectual Property Court said in a statement on Wednesday.",
        "date": "01252017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Apple sues Qualcomm in Beijing seeking 1 billion yuan "
    },
    {
        "content": "WASHINGTON  Jan 25 Apple Inc filed a lawsuit against Qualcomm Inc in Beijing  alleging the chip supplier abused its clout in the chip industry and seeking 1 billion yuan ($145.32 million) in damages  Beijing's Intellectual Property Court said in a statement on Wednesday.",
        "date": "01252017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Apple sues Qualcomm in Beijing seeking 1 billion yuan "
    },
    {
        "content": "* \"Apple was offered terms consistent with terms accepted by more than one hundred other chinese companies and refused to even consider them\"",
        "date": "01252017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm comments on Apple's lawsuits in China "
    },
    {
        "content": "Apple Inc filed a $1 billion lawsuit against supplier Qualcomm Inc on Friday  days after the U.S. government accused the chip maker of resorting to anticompetitive tactics to maintain a monopoly over key semiconductors in mobile phones.",
        "date": "01212017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Apple files $1 billion lawsuit against chip supplier Qualcomm "
    },
    {
        "content": "* Apple sues Qualcomm for roughly $1 billion over royalties - CNBC  Source text : http://cnb.cx/2jy3p8P Further company coverage:",
        "date": "01202017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Apple sues Qualcomm for roughly $1 bln over royalties - CNBC "
    },
    {
        "content": "* Says that Apple's claims are baseless  Source text for Eikon:  Further company coverage:",
        "date": "01212017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm terms Apple's claims on lawsuit \"baseless\" "
    },
    {
        "content": "Jan 20 Apple Inc filed a $1 billion lawsuit against supplier Qualcomm Inc on Friday  days after the U.S. government accused the chip maker of resorting to anticompetitive tactics to maintain a monopoly over key semiconductors in mobile phones.",
        "date": "01212017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 4-Apple files $1 billion lawsuit against chip supplier Qualcomm "
    },
    {
        "content": "* Qualcomm Inc - CEO Steve Mollenkopf's 2016 total compensation $11.1 million versus $10.4 million in 2015 - SEC filing",
        "date": "01192017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm CEO Mollenkopf's 2016 compensation $11.1 mln vs $10.4 mln in 2015 "
    },
    {
        "content": "WASHINGTON  Jan 17 The U.S. Federal Trade Commission filed a lawsuit against Qualcomm Inc on Tuesday  accusing the company of antitrust violations in its patent licensing business.",
        "date": "01172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "U.S. antitrust agency sues Qualcomm over patent licensing "
    },
    {
        "content": "WASHINGTON  Jan 17 The U.S. Federal Trade Commission filed a lawsuit against Qualcomm Inc on Tuesday  accusing the company of using \"anticompetitive\" tactics to maintain its monopoly on a key semiconductor used in mobile phones.",
        "date": "01172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 3-U.S. antitrust agency sues Qualcomm over patent licensing "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.53per share  Source text for Eikon:  Further company coverage:",
        "date": "01122017",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm announces quarterly cash dividend "
    },
    {
        "content": "* Qualcomm responds to complaint from u.s. Federal Trade Commission",
        "date": "01172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm responds to complaint from U.S. Federal Trade Commission "
    },
    {
        "content": "Jan 17 Qualcomm Inc is set to face a U.S. antitrust case for allegedly using unfair practices in the way the chipmaker licenses its technology  Bloomberg reported  citing people familiar with the matter. (http://bloom.bg/2iLeYus)",
        "date": "01172017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm said to face U.S. antitrust case on licensing practices - BBG "
    },
    {
        "content": "TEL AVIV  Jan 9 The venture arms of Microsoft  and Qualcomm have invested in Team8  an Israeli creator of cybersecurity start-ups  as big multinational companies get behind Israel's burgeoning cyber industry in the face of growing threats.",
        "date": "01092017",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Microsoft  Qualcomm back Israel's Team8 cybersecurity firm "
    },
    {
        "content": "SEJONG  South Korea/SAN FRANCISCO South Korea's antitrust regulator fined Qualcomm Inc  1.03 trillion won ($854 million) for what it called unfair business practices in patent licensing and modem chip sales  a decision the U.S. chipmaker said it will challenge in court. | Video ",
        "date": "12282016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "South Korea fines Qualcomm $854 million for violating competition laws "
    },
    {
        "content": "* Qualcomm commences cash tender offer for all outstanding shares of NXP  Source text for Eikon:  Further company coverage:",
        "date": "11182016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm commences cash tender offer for all outstanding shares of NXP "
    },
    {
        "content": "* Subsidiary  Qualcomm Technologies  Inc and Samsung Electronics Co.  Ltd.  have extended strategic foundry collaboration",
        "date": "11172016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm and Samsung collaborate on 10nm process technology "
    },
    {
        "content": "* Qualcomm Inc - Unit   Qualcomm Technologies  Inc.  has introduced its first 5g new radio (NR) spectrum sharing prototype system and trial platform",
        "date": "11142016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm Inc - Qualcomm Technologies introduces its first 5g new radio spectrum sharing prototype system and trial platform "
    },
    {
        "content": "WASHINGTON  Nov 15 The U.S. International Trade Commission said on Tuesday it had voted to investigate whether some electronic mobile devices from Chinese companies contain hardware and software components that infringe upon patents owned by Qualcomm Inc.",
        "date": "11152016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US trade panel eyes Qualcomm patent complaint against Chinese firms "
    },
    {
        "content": "* Qualcomm - on November 8  entered into a credit agreement - SEC filing",
        "date": "11092016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm enters pact for term loan facility "
    },
    {
        "content": "* Preh will include Qualcomm Halo WEVC technology in its product portfolio",
        "date": "11082016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm  Preh sign commercial wireless electric vehicle charging license agreement "
    },
    {
        "content": "* Recent deal surge earned advisers $475.91M fees - TR  Freeman",
        "date": "11072016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-UK misses out in end-of-year recovery for M&A deals "
    },
    {
        "content": "Smartphone chipmaker Qualcomm Inc  which agreed to buy NXP Semiconductors NV for about $38 billion last week   reported a better-than-expected 13.3 percent rise in quarterly revenue  helped by strong demand  particularly in China.",
        "date": "11022016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm reports better-than-expected quarterly revenue "
    },
    {
        "content": "Nov 2 Smartphone chipmaker Qualcomm Inc   which agreed to buy NXP Semiconductors NV for about $38 billion last week   reported a better-than-expected 13.3 percent rise in quarterly revenue  helped by strong demand  particularly in China.",
        "date": "11022016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Qualcomm reports better-than-expected quarterly revenue "
    },
    {
        "content": "Nov 2 Smartphone chipmaker Qualcomm Inc   which agreed to buy NXP Semiconductors NV for about $38 billion last week   reported a 13.3 percent rise in quarterly revenue on Wednesday  helped by strong demand.",
        "date": "11022016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm's quarterly revenue rises 13.3 pct "
    },
    {
        "content": "* Qualcomm announces fourth quarter and fiscal 2016 results fiscal 2016 revenues $23.6 billion; GAAP EPS $3.81  non-GAAP EPS $4.44",
        "date": "11022016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm posts Q4 earnings per share $1.07 "
    },
    {
        "content": "* Nxp semiconductors - nxp will be obligated to pay to qualcomm termination fee equal to $1.25 billion in cash if nxp to enters into superior proposal",
        "date": "10272016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-NXP Semiconductors will be obligated to pay to Qualcomm termination fee equal to $1.25 bln in cash if NXP enters superior proposal "
    },
    {
        "content": "Smartphone chipmaker Qualcomm Inc  agreed to buy NXP Semiconductors NV  for about $38 billion in the biggest-ever deal in the semiconductor industry  making it the leading supplier to the fast-growing automotive chips market. | Video ",
        "date": "10272016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm to buy NXP for $38 billion in biggest chip deal "
    },
    {
        "content": "* Qualcomm shares up 4 pct  NXP up 1.4 pct   (Adds Breaking Views link  updates shares)",
        "date": "10272016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 5-Qualcomm to buy NXP for $38 bln in biggest chip deal "
    },
    {
        "content": "* Qualcomm Inc - Total enterprise value of approximately $47 billion",
        "date": "10272016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm to acquire NXP "
    },
    {
        "content": "Oct 27 Qualcomm Inc said on Thursday it had agreed to buy NXP Semiconductors NV for an enterprise value of about $47 billion  as it seeks to expand the reach of its chips from phones to cars.",
        "date": "10272016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm to buy NXP Semiconductors for enterprise value of $47 bln "
    },
    {
        "content": "Qualcomm Inc is nearing a deal to acquire NXP Semiconductors NV for around $37 billion  a person familiar with the matter said on Friday  as the U.S. company seeks to expand the reach of its chips from phones to cars.",
        "date": "10212016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm nears $37 billion deal to buy NXP Semiconductors: source "
    },
    {
        "content": "Oct 21 Qualcomm Inc is nearing a deal to acquire NXP Semiconductors NV for around $37 billion  a person familiar with the matter said on Friday  as the U.S. company seeks to expand the reach of its chips from phones to cars.",
        "date": "10212016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Qualcomm nears $37 billion deal to buy NXP Semiconductors -source "
    },
    {
        "content": "* Has successfully made world's first over--air connection via multefire using listen-before-talk",
        "date": "10172016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm reports over--air connection via multefire using listen-before-talk "
    },
    {
        "content": "* Qualcomm files actions against Meizu in the United States  Germany And France",
        "date": "10142016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm files actions against Meizu in the U.S. Germany And France "
    },
    {
        "content": "* Qualcomm appoints Alex Rogers as EVP and president of QTl  Source text for Eikon:  Further company coverage:",
        "date": "10192016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm appoints Alex Rogers as EVP and president of QTl "
    },
    {
        "content": "* Qualcomm appoints Ann M. Livermore to its board of directors",
        "date": "10102016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm appoints Ann Livermore to its board of directors "
    },
    {
        "content": "* NXP Semiconductors asking price is $120/Share; talks with qualcomm continue  no deal imminent- CNBC  citing sources",
        "date": "10062016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-NXP Semiconductors asking price $120/share  talks with Qualcomm continue  no deal imminent- CNBC  citing sources "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.53per share  Source text for Eikon:  Further company coverage:",
        "date": "10062016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm sets quarterly cash dividend of $0.53 per share "
    },
    {
        "content": "NXP Semiconductors NV  is exploring selling itself to Qualcomm Inc  in a deal that could be valued at more than $30 billion  two sources familiar with the matter said on Thursday.",
        "date": "09292016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "NXP Semiconductors explores sale to Qualcomm: sources "
    },
    {
        "content": "BRUSSELS U.S. chipmaker Qualcomm will attempt to fend off EU antitrust charges at a hearing on Nov. 10 that it used anti-competitive methods to squeeze out a rival  two people familiar with the matter said on Friday.",
        "date": "09302016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm to fight EU antitrust charge at November 10 hearing: sources "
    },
    {
        "content": "Sept 29 NXP Semiconductors NV is exploring selling itself to Qualcomm Inc in a deal that could be valued at more than $30 billion  two sources familiar with the matter said on Thursday.",
        "date": "09292016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 6-NXP Semiconductors explores sale to Qualcomm-sources "
    },
    {
        "content": "BRUSSELS  Sept 30 U.S. chipmaker Qualcomm  will attempt to fend off EU antitrust charges at a hearing on Nov. 10 that it used anti-competitive methods to squeeze out a rival  two people familiar with the matter said on Friday.",
        "date": "09302016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm to fight EU antitrust charge at Nov. 10 hearing - sources "
    },
    {
        "content": "Sept 29 Chipmaker Qualcomm Inc is in talks to buy NXP Semiconductors NV in a deal that could value NXP at more than $30 billion  CNBC reported  citing Dow Jones.",
        "date": "09292016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm in talks to buy NXP Semiconductors - CNBC  citing DJ "
    },
    {
        "content": "* Qualcomm in talks to acquire NXP Semiconductors  which could value NXP at more than $30 bln - CNBC  citing Dow Jones  Further company coverage:    (Bengaluru Newsroom)",
        "date": "09292016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm in talks to buy NXP Semiconductors  which could value NXP at more than $30 bln - CNBC  citing Dow Jones "
    },
    {
        "content": "Activist hedge fund Elliott Management said it bought 8.1 percent stake in Mentor Graphics Corp   calling on the company to increase shareholder value and pursue \"strategic opportunities.\"",
        "date": "09302016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Elliott takes 8.1 percent stake in Mentor Graphics "
    },
    {
        "content": "* Elliott's stake comes months after Carl Icahn exited investment   (Adds background on company  Elliott management)",
        "date": "09302016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Elliott takes 8.1 pct stake in Mentor Graphics "
    },
    {
        "content": "* Has invested in 7invensun  a Chinese company which is committed to eye-tracking and eye-control techniques with ip rights",
        "date": "09092016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm invests in eye-tracking technology company 7invensun "
    },
    {
        "content": "* Qualcomm and AT&T to trial drones on cellular network to accelerate wide-scale deployment",
        "date": "09062016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm and AT&T to trial drones on cellular network "
    },
    {
        "content": "* Philips and Qualcomm announce strategic collaboration to advance personalized connected health care  Source text for Eikon:  Further company coverage:",
        "date": "08312016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Philips and Qualcomm announce strategic collaboration to advance personalized connected health care "
    },
    {
        "content": "* Qualcomm and Boehringer Ingelheim Pharmaceuticals collaborate to add new digital technology to respimat\u007f inhaler  Source text for Eikon:  Further company coverage:",
        "date": "08302016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm and Boehringer Ingelheim Pharmaceuticals collaborate to add new digital technology to Respimat inhaler "
    },
    {
        "content": "* Soros fund management cuts share stake in abbott laboratories by 21.5% to 0.33 million shares",
        "date": "08152016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Soros fund management cuts stake in Amazon  dissolves Qualcomm  Nike "
    },
    {
        "content": "* Qualcomm Technologies Inc is \"powering\" Samsung's smartphone  Samsung Galaxy Note7 for select regions  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08032016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm powers next generation Samsung Galaxy Note7 "
    },
    {
        "content": "* Enters agreement with Qualcomm for the licensing of Precise Biomatch Mobile",
        "date": "07282016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Precise Biometrics signs licensing deal with Qualcomm "
    },
    {
        "content": "* Lear will be including Qualcomm Halo WEVC technology in its product portfolio",
        "date": "07272016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm  Lear sign commercial wireless electric vehicle charging license agreement "
    },
    {
        "content": "Qualcomm Inc has agreed to pay $19.5 million to settle a proposed gender bias class action accusing the San Diego-based chip manufacturer of failing to give 3 300 female employees the same pay and promotion opportunities as their male colleagues.",
        "date": "07272016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm to pay $19.5 mln to settle gender discrimination class action "
    },
    {
        "content": "Qualcomm Inc forecast current-quarter profit largely above market estimates as it sees strong demand for its mobile chips in China and expects to sign more licensing deals.",
        "date": "07202016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Strong demand from China buoys Qualcomm forecast "
    },
    {
        "content": "July 20 Qualcomm Inc forecast current-quarter profit largely above market estimates as it sees strong demand for its mobile chips in China and expects to sign more licensing deals.",
        "date": "07202016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Strong demand from China buoys Qualcomm forecast "
    },
    {
        "content": "July 20 Qualcomm Inc reported a 3.6 percent rise in quarterly revenue  driven by strong demand for its flagship Snapdragon processors used in smartphones.",
        "date": "07202016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm revenue rises 3.6 percent "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.53 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07122016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm sets qtrly cash dividend of $0.53 per share "
    },
    {
        "content": "SAO PAULO  July 4 U.S. biotech company Monsanto Co and Microsoft Corp announced on Monday a partnership to invest in agricultural technology startups in Brazil.",
        "date": "07042016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Monsanto  Microsoft to invest in agricultural technology in Brazil "
    },
    {
        "content": "* Qualcomm files patent infringement complaints against Meizu in China  Source text for Eikon:  Further company coverage:",
        "date": "06302016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm files patent infringement complaints against Meizu "
    },
    {
        "content": "SHANGHAI  June 30 Qualcomm Inc has filed 17 fresh complaints in China against Meizu Technology Co  stepping up its battle with the Chinese smartphone maker after the two were unable to reach a licensing accord in the U.S. tech giant's biggest market.",
        "date": "06302016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm files 17 new complaints in China courts against smartphone maker Meizu "
    },
    {
        "content": "June 24 Qualcomm Inc has filed a complaint in a Chinese court against smartphone maker Meizu Technology Co after the tech giant said it was unable to reach a licensing accord with one of the top 10 handset suppliers in its biggest market.",
        "date": "06242016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm files complaint in China court against smartphone maker Meizu "
    },
    {
        "content": "* TDK expected to book a 130 bln yen ($1.24 Bln) profit from spinning off assets to a wireless communications partnership with Qualcomm this FY - Nikkei",
        "date": "06172016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-TDK expected to book 130 bln yen profit from spinning off assets to wireless communications partnership with Qualcomm - Nikkei "
    },
    {
        "content": "Apple Inc's next iPhone will use modems chips from Intel Corp  replacing those made by Qualcomm Inc in some versions of the new smartphone  Bloomberg reported  citing people familiar with the matter.",
        "date": "06102016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Intel gets mobile chip contract from Apple - Bbg "
    },
    {
        "content": "June 10 Apple Inc's next iPhone will use modems chips from Intel Corp  replacing those made by Qualcomm Inc in some versions of the new smartphone  Bloomberg reported  citing people familiar with the matter.",
        "date": "06102016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Intel gets mobile chip contract from Apple - Bbg "
    },
    {
        "content": "June 10 Apple Inc's next iPhone will use modems chips from Intel Corp  replacing those made by Qualcomm Inc in some versions of the new smartphone  Bloomberg reported  citing people familiar with the matter.",
        "date": "06102016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Intel gets mobile chip contract from Apple - Bloomberg "
    },
    {
        "content": "* Qualcomm signs 3g/4g Chinese patent license agreement with Yulong",
        "date": "04182016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm signs 3G/4G Chinese patent license agreement with Yulong "
    },
    {
        "content": "U.S. chipmaker Qualcomm Inc  forecast third-quarter profit below analysts estimates as it expects to ship fewer chips  including those for smartphones  its biggest business.",
        "date": "04202016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm profit forecast misses estimates as chip shipments drop "
    },
    {
        "content": "April 20 U.S. chipmaker Qualcomm Inc  forecast third-quarter profit below analysts estimates as it expects to ship fewer chips  including those for smartphones  its biggest business.",
        "date": "04202016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Qualcomm profit forecast misses estimates as chip shipments drop "
    },
    {
        "content": "* Q2 non-GAAP revenue  $5.5 billion versus $6.9 billion last year",
        "date": "04202016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm reports Q2 non-GAAP earnings of $1.04 per share "
    },
    {
        "content": "* Qualcomm signs 3G/4G Chinese patent license agreement with Hisense",
        "date": "04202016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm signs 3G/4G Chinese patent license agreement with Hisense "
    },
    {
        "content": "April 20 Qualcomm Inc reported a 19.5 percent fall in quarterly revenue  hurt by lower demand for its chips for mobile devices amid stiff competition from Chinese and Taiwanese rivals.",
        "date": "04202016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm revenue falls 19.5 pct "
    },
    {
        "content": "* Announced a quarterly cash dividend of $0.53 per common share",
        "date": "04082016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm says quarterly cash dividend of $0.53 per share "
    },
    {
        "content": "* Qualcomm and ricardo sign commercial wireless electric vehicle charging license agreement",
        "date": "04012016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm  Ricardo sign license agreement "
    },
    {
        "content": "* Qualcomm appoints Mary Gendron as senior vice president and chief information officer",
        "date": "03172016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm appoints mary gendron as senior vice president and chief information officer "
    },
    {
        "content": "* Says signs agreements with  Qualcomm and units on chips and software cooperation",
        "date": "03142016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Goertek  Qualcomm sign agreements on chips and software cooperation "
    },
    {
        "content": "Qualcomm Inc has agreed to pay $7.5 million to settle charges it violated U.S. anti-bribery laws by hiring relatives of Chinese officials to obtain business  the U.S. Securities and Exchange Commission said on Tuesday.",
        "date": "03012016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "U.S. fines Qualcomm for hiring relatives of China officials: SEC "
    },
    {
        "content": "March 1 Qualcomm Inc has agreed to pay $7.5 million to settle charges that it violated U.S. anti-bribery laws by hiring relatives of Chinese officials to obtain business  the U.S. Securities and Exchange Commission said on Tuesday.",
        "date": "03012016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "U.S. fines Qualcomm for hiring relatives of China officials -SEC "
    },
    {
        "content": "March 1 Qualcomm Inc has agreed to pay $7.5 million to settle charges it violated U.S. anti-bribery laws by hiring relatives of Chinese officials to obtain business  the U.S. Securities and Exchange Commission said on Tuesday.",
        "date": "03012016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-U.S. fines Qualcomm for hiring relatives of China officials -SEC "
    },
    {
        "content": "* Qualcomm enters into settlement with U.S. Securities and Exchange Commission with respect to its Foreign Corrupt Practices Act investigation",
        "date": "03012016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm enters into settlement with U.S. SEC "
    },
    {
        "content": "Feb 2 Magic Leap Inc  a startup focused on augmented reality technology  said on Tuesday it had raised $793.5 million in a funding round led by Chinese ecommerce giant Alibaba Group Holding Ltd.",
        "date": "02022016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Magic Leap raises $793.5 mln in funding round led by Alibaba "
    },
    {
        "content": "Qualcomm Inc forecast current-quarter profit below analysts' expectations as demand weakens for its chips used in mobile devices in a slowing market.",
        "date": "01272016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm forecasts weak profit as demand slows for mobile chips "
    },
    {
        "content": "* Shares down 3 pct after market   (Adds details  analyst comment; updates shares)",
        "date": "01272016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Qualcomm forecasts weak profit as demand slows for mobile chips "
    },
    {
        "content": "Jan 27 Qualcomm Inc's quarterly revenue fell 18.7 percent as demand for its chips for mobile devices declined amid stiff competition from Chinese and Taiwanese rivals.",
        "date": "01272016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm's quarterly revenue falls 18.7 pct "
    },
    {
        "content": "Pharmaceutical group GlaxoSmithKline Plc  is said to be in discussions with chipmaker Qualcomm Inc  to form a joint venture as GSK looks for ways to develop medical technology  Bloomberg reported on Wednesday.",
        "date": "01202016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "GSK said to be in talks with Qualcomm to form JV: Bloomberg "
    },
    {
        "content": "NEW YORK Qualcomm Inc and the provincial government of Guizhou in southwest China unveiled on Sunday a $280 million joint venture for the design  development and sale of advanced server technology  as the U.S. chipmaker deepens its Chinese relations.",
        "date": "01172016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm unveils $280 million joint venture with Chinese province "
    },
    {
        "content": "SEOUL Qualcomm Inc said on Thursday Samsung Electronics Co Ltd will become the sole manufacturer of its new flagship mobile chip  a major boost for the South Korean tech giant as it vies for deals with bigger rival TSMC.",
        "date": "01142016",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Samsung Electronics to produce new Qualcomm chips in blow to TSMC "
    },
    {
        "content": "* Snapdragon 820 could generate more than $1B in revenue -analyst",
        "date": "01142016",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Samsung Elec to produce new Qualcomm chips in blow to TSMC "
    },
    {
        "content": "Qualcomm Inc has decided not to split into separate chipmaking and technology licensing businesses  concluding a six-month strategic review instigated by hedge fund Jana Partners.",
        "date": "12152015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm decides against breakup  says current structure best "
    },
    {
        "content": "Dec 15 Qualcomm Inc has decided not to split into separate chipmaking and technology licensing businesses  concluding a six-month strategic review instigated by hedge fund Jana Partners.",
        "date": "12152015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "CORRECTED-UPDATE 3-Qualcomm decides against breakup  says current structure best "
    },
    {
        "content": "Dec 15 Qualcomm Inc has decided not to separate its chipmaking and technology licensing businesses  concluding a six-month strategic review pushed by hedge fund Jana Partners.",
        "date": "12152015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm says to maintain current corporate structure "
    },
    {
        "content": "BRUSSELS  Dec 8 European Union antitrust regulators charged U.S. chipmaker Qualcomm on Tuesday of using anti-competitive practices to block rivals.",
        "date": "12082015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "EU antitrust regulators accuse Qualcomm of hindering rivals "
    },
    {
        "content": "Dec 2 Chipmaker Qualcomm Inc signed a licensing pact with Xiaomi Technology Co Ltd that allows the Chinese smartphone maker to use its patents to make and sell 3G and 4G devices.",
        "date": "12022015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm to license patents to Chinese mobile phone maker Xiaomi "
    },
    {
        "content": "Dec 2 Chipmaker Qualcomm Inc signed a licensing pact with Xiaomi Technology Co Ltd that allows the Chinese smartphone maker to use its patents to make and sell 3G and 4G devices.",
        "date": "12022015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Qualcomm to license patents to Chinese mobile phone maker Xiaomi "
    },
    {
        "content": "Qualcomm Inc forecast first-quarter profit way below analysts' expectations as the chipmaker struggles against fierce competition from Chinese and Taiwanese rivals  and faces delays in closing new licensing agreements in China.",
        "date": "11052015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "China woes hurt chipmaker Qualcomm's profit forecast "
    },
    {
        "content": "Qualcomm Inc  forecast first-quarter profit way below analysts' expectations as the chipmaker struggles against fierce competition from Chinese and Taiwanese rivals  and faces delays in closing new licensing agreements in China.",
        "date": "11042015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "China woes hurt chipmaker Qualcomm's profit forecast "
    },
    {
        "content": "* Shares fall about 6 pct after market   (Adds details from conference call  forecast; updates shares)",
        "date": "11042015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-China woes hurt chipmaker Qualcomm's profit forecast "
    },
    {
        "content": "Nov 4 Chipmaker Qualcomm Inc's  quarterly profit plunged 44 percent as the company was hurt by fierce competition and it took longer than expected to close new license agreements in China.",
        "date": "11042015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Chipmaker Qualcomm's quarterly profit plunges 44 pct "
    },
    {
        "content": "Further company coverage:    (Reporting by Hong Kong and Singapore newsrooms)",
        "date": "10202015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-Wuhan Tianyu Information  Qualcomm's units in cooperation agreement "
    },
    {
        "content": "NEW YORK Qualcomm Inc's  President Derek Aberle  under pressure from activist hedge fund Jana Partners to improve the licensing and chip design firm's stock performance  on Thursday sounded a cautionary note about a potential breakup of the company.",
        "date": "09032015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm president says splitting company may not create value "
    },
    {
        "content": "A former Merrill Lynch stock broker was spared prison after admitting to concealing a Qualcomm Inc executive's insider trading and obstructing a subsequent investigation.",
        "date": "08262015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Ex-Merrill Lynch broker spared prison in Qualcomm insider trading case "
    },
    {
        "content": "Aug 26 Chipmaker Qualcomm Inc has sold its U.K. spectrum rights to Vodafone Group Plc and CK Hutchison Holdings Ltd for about 200 million pounds ($313.8 million)  Bloomberg reported  citing people familiar with the matter.",
        "date": "08262015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm sells UK spectrum rights to Vodafone and CK Hutchison -Bloomberg "
    },
    {
        "content": "SHANGHAI  Aug 12 China's Tsinghua Holdings plans to invest at least 30 billion yuan ($4.74 billion) in developing mobile chip technology to challenge industry leader Qualcomm Inc's market dominance  the China Daily newspaper reported on Wednesday.",
        "date": "08122015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "China's Tsinghua to invest $4.7 bln in mobile chips-China Daily "
    },
    {
        "content": "NEW YORK  July 31 A U.S. appeals court on Friday upheld a lower court's decision to clear Qualcomm Inc  in a patent lawsuit by ParkerVision Inc  allowing it to escape a $173 million verdict for infringement.",
        "date": "07312015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm wins appeal in $173 mln ParkerVision case "
    },
    {
        "content": "NEW YORK A U.S. appeals court on Friday upheld a lower court's decision to clear Qualcomm Inc in a patent lawsuit by wireless chip developer ParkerVision Inc  allowing it to escape a $173 million verdict for infringement.",
        "date": "07312015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm wins appeal in $173 million ParkerVision case "
    },
    {
        "content": "NEW YORK  July 31 A U.S. appeals court on Friday upheld a lower court's decision to clear Qualcomm Inc  in a patent lawsuit by wireless chip developer ParkerVision Inc   allowing it to escape a $173 million verdict for infringement.",
        "date": "07312015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Qualcomm wins appeal in $173 mln ParkerVision case "
    },
    {
        "content": "Wall Street says Intel Corp is the best suitor for Qualcomm Inc's chip unit  if the maker of Snapdragon mobile processors decides to break itself up.",
        "date": "07232015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm's potential break-up could lead to courtship with Intel "
    },
    {
        "content": "* Acquisition of CSR by Qualcomm has been cleared by Ministry of Commerce of People's Republic of China",
        "date": "07242015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-CSR says China clears Qualcomm's acquisition of CSR "
    },
    {
        "content": "Wall Street says Intel Corp  is the best suitor for Qualcomm Inc's  chip unit  if the maker of Snapdragon mobile processors decides to break itself up.",
        "date": "07242015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm's potential break-up could lead to courtship with Intel "
    },
    {
        "content": "Chipmaker Qualcomm Inc  said it may break itself up as it delivered its third profit warning this year and announced plans to slash jobs and spending in the face of rising competition. | Video ",
        "date": "07222015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm slashes jobs and costs  says may split itself up "
    },
    {
        "content": "Qualcomm Inc  is expected to conduct a strategic review that may result in the breakup of the company  among other options  the Wall Street Journal reported on Monday citing sources.",
        "date": "07212015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm may consider breakup: WSJ "
    },
    {
        "content": "* Lowers full-year forecast for third time this year   (Adds quotes from interview with company president)",
        "date": "07222015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 5-Qualcomm slashes jobs and costs  says may split itself up "
    },
    {
        "content": "July 20 Qualcomm Inc is expected to conduct a strategic review that may result in the breakup of the company  among other options  the Wall Street Journal reported on Monday citing sources.",
        "date": "07212015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm may consider breakup - WSJ "
    },
    {
        "content": "July 22 Chipmaker Qualcomm Inc said it may break itself up as it delivered its third profit warning this year and announced plans to slash jobs and spending.",
        "date": "07222015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "RPT-UPDATE 1-Qualcomm says may split itself  cut jobs "
    },
    {
        "content": "July 22 Chipmaker Qualcomm Inc said on Wednesday that it would conduct a strategic review that may result in the company being broken up.",
        "date": "07222015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm says may split itself "
    },
    {
        "content": "LONDON Top European technology stocks shed nearly $6 billion of market value on Wednesday  with suppliers for Apple the top fallers after the tech giant's revenue forecasts fell short of expectations.",
        "date": "07222015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "$5.7 billion wiped off European tech shares after Apple outlook disappoints "
    },
    {
        "content": "Chipmaker Qualcomm Inc is preparing to lay off several thousand employees  or more than 10 percent of its 30 000-strong workforce  the Information website reported on Monday.",
        "date": "07202015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm preparing to lay off several thousand employees: tech website "
    },
    {
        "content": "July 20 Chipmaker Qualcomm Inc is preparing to lay off several thousand employees  or more than 10 percent of its 30 000-strong workforce  the Information website reported on Monday.",
        "date": "07202015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Qualcomm preparing to lay off several thousand employees - tech website "
    },
    {
        "content": "BRUSSELS/FRANKFURT European Union antitrust regulators are investigating whether one of the world's biggest chipmakers  Qualcomm  uses illegal tactics to shut out rivals  six years after slapping a record 1 billion euro ($1.09 billion) fine on Intel for a similar offense.",
        "date": "07162015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm faces EU antitrust probes over tactics to block rivals "
    },
    {
        "content": "SAN FRANCISCO  July 20 Qualcomm Inc is preparing to layoff as many as several thousand employees  tech website The Information reported on Monday.",
        "date": "07202015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "CORRECTED-Qualcomm preparing to layoff as many as several thousand employees -tech website "
    },
    {
        "content": "* Qualcomm says EU concerns not merited   (Adds details  background  comments)",
        "date": "07162015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Qualcomm faces EU antitrust probes over tactics to block rivals "
    },
    {
        "content": "Further company coverage:    (Reporting by Hong Kong and Singapore newsrooms)",
        "date": "07162015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Wuhan Tianyu Information Industry plans cooperation with Qualcomm "
    },
    {
        "content": "BRUSSELS The European Commission has opened two investigations into possible abuse of market dominance by chipmaker Qualcomm Inc  it said on Thursday  the latest in a string of antitrust and tax inquiries into major U.S. corporations.",
        "date": "07162015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU opens twin Qualcomm antitrust investigations "
    },
    {
        "content": "BRUSSELS  July 16 The European Commission said on Thursday it had opened two antitrust investigations into Qualcomm's possible abuse of its market dominance of semiconductors used in consumer electronic devices.",
        "date": "07162015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "RPT-EU opens two antritust investigations against Qualcomm "
    },
    {
        "content": "BRUSSELS  July 16 The European Commission said on Thursday it had opened two antitrust investigations into Qualcomm's possible abuse of its market dominance of semiconductors used in consumer electronic devices.",
        "date": "07162015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU opens two antritust investigations against Qualcomm "
    },
    {
        "content": "July 13 Moelis & Co has hired investment banker Zach Righellis as a managing director to build up a practice in global semiconductors  one of the most active areas this year in technology dealmaking  the company said on Monday.",
        "date": "07132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Moelis & Co adds new semiconductor banker -memo "
    },
    {
        "content": "SAN FRANCISCO Tumbling markets and economic uncertainty in China pose a risk to major chipmakers such as Qualcomm Inc  that derive a big portion of their sales from the world's second-largest economy.",
        "date": "07072015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "China economic uncertainty a potential risk for U.S. chipmakers "
    },
    {
        "content": "SEOUL U.S. chipmaker Qualcomm Inc has no plans to spin off its chips business at present  Executive Chairman Paul Jacobs said on Tuesday  despite recent investor pressure to do so amid intensifying industry competition.",
        "date": "06302015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm has no plans to spin off chip business at present: chairman "
    },
    {
        "content": "A former high-ranking executive at semiconductor maker Qualcomm Inc was sentenced on Friday to a year and a half in prison and fined $500 000 for masterminding a three-year insider trading scheme.",
        "date": "06262015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Ex-Qualcomm exec gets one-and-a-half years in prison for insider trades "
    },
    {
        "content": "June 26 A former high-ranking executive at semiconductor maker Qualcomm Inc was sentenced on Friday to a year and a half in prison and fined $500 000 for masterminding a three-year insider trading scheme.",
        "date": "06262015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Ex-Qualcomm exec gets 1-1/2 years in prison for insider trades "
    },
    {
        "content": "BEIJING  June 11 U.S. chipmaker Qualcomm Inc  said it has appointed old-hand Frank Meng as its chairman for China  a market which accounts for half of the company's overall revenues but where it has hit rough patches in recent times.",
        "date": "06112015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm names old-hand as new China chairman; former head joins Xiaomi "
    },
    {
        "content": "LONDON Chipmaker Qualcomm has put a chunk of spectrum up for sale in Britain which could appeal to mobile operators grappling with the demand for Internet access.",
        "date": "06082015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm puts UK spectrum up for sale "
    },
    {
        "content": "Avago Technologies Ltd's  $37 billion deal to buy chipmaker Broadcom  Corp  creates new competitive challenges for Qualcomm and may force the world's largest mobile chip maker to radically rethink its own strategy.",
        "date": "05282015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Avago  Broadcom deal could put pressure on Qualcomm "
    },
    {
        "content": "FRANKFURT  May 23 Carmaker Daimler on Saturday announced a partnership with mobile technologies company Qualcomm Inc. to explore wireless recharging of mobile phones in cars as well as recharging of electric cars without cables.",
        "date": "05232015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Daimler and Qualcomm to develop in-car tech  wireless charging "
    },
    {
        "content": "FRANKFURT Carmaker Daimler on Saturday announced a partnership with mobile technologies company Qualcomm Inc. to explore wireless recharging of mobile phones in cars as well as recharging of electric cars without cables.",
        "date": "05242015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Daimler and Qualcomm to develop in-car tech  wireless charging "
    },
    {
        "content": "BRUSSELS European Union antitrust regulators are not investigating U.S. chipmaker Qualcomm's patent licensing deals  an EU source said on Thursday in response to media reports saying that scrutiny of the company had been expanded to this issue.",
        "date": "05072015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "EU antitrust regulators not probing Qualcomm licensing deals -EU source "
    },
    {
        "content": "BRUSSELS  May 7 European Union antitrust regulators are not investigating U.S. chipmaker Qualcomm's  patent licensing deals  an EU source said on Thursday in response to media reports saying that scrutiny of the company had been expanded to this issue.",
        "date": "05072015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-EU antitrust regulators not probing Qualcomm licensing deals -EU source "
    },
    {
        "content": "BRUSSELS  May 7 European Union antitrust regulators are not investigating U.S. chipmaker Qualcomm  on its patent licensing deals  an EU source said on Thursday  refuting media reports saying the issue was on the European Commission's radar.",
        "date": "05072015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU antitrust regulators not probing Qualcomm licensing deals - EU source "
    },
    {
        "content": "SEOUL South Korea's antitrust body said on Wednesday it would cooperate with counterparts in Europe and the United States as part of the regulator's investigation into U.S. chip maker Qualcomm Inc.",
        "date": "05062015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "South Korea says to cooperate with Europe  U.S. on Qualcomm probe "
    },
    {
        "content": "BRUSSELS  May 8 EU antitrust regulators are asking Qualcomm's rivals how the U.S. chipmaker's business practices and the way it licenses its products affect them  as part of an investigation begun seven months ago  a document seen by Reuters showed.",
        "date": "05082015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "EU antitrust regulators query Qualcomm rivals on its business practices "
    },
    {
        "content": "SEOUL  May 6 South Korea's antitrust body said on Wednesday it would cooperate with counterparts in Europe and the United States as part of the regulator's investigation into U.S. chip maker Qualcomm Inc.",
        "date": "05062015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "S.Korea says to cooperate with Europe  U.S. on Qualcomm probe "
    },
    {
        "content": "May 4 General Electric Co on Monday announced collaborations with Qualcomm Inc and Apple Inc as it uses digital technology and the growing appetite for data to reinvigorate its 130-year-old lighting business.",
        "date": "05042015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "GE ties up with Qualcomm  Apple in new lighting business bet "
    },
    {
        "content": "SEOUL  April 28 South Korea's antitrust body said on Tuesday that it is investigating U.S. database firm Oracle Corp over whether its practice of bundling new software offerings into maintenance services contracts is anticompetitive behaviour.",
        "date": "04282015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-S.Korea investigating Oracle over software bundling "
    },
    {
        "content": "SEOUL U.S. chip maker Qualcomm Inc plans to have its next-generation Snapdragon 820 mobile processors manufactured by Samsung Electronics Co Ltd  tech news website Re/code reported  citing unnamed sources.",
        "date": "04212015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm to tap Samsung Elec to make new mobile processors: report "
    },
    {
        "content": "Qualcomm Inc forecast current-quarter revenue and profit below analysts' expectations  saying the loss of a key customer and delays in product launches by some smartphone makers would hurt sales of its flagship Snapdragon chips.",
        "date": "04222015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm forecast misses as customer loss hurts mobile chip sales "
    },
    {
        "content": "SEOUL  April 21 U.S. chip maker Qualcomm Inc  plans to have its next-generation Snapdragon 820 mobile processors manufactured by Samsung Electronics Co Ltd   tech news website Re/code reported  citing unnamed sources.",
        "date": "04212015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm to tap Samsung Elec to make new mobile processors - report "
    },
    {
        "content": "April 22 Qualcomm Inc forecast current-quarter revenue and profit below analysts' expectations  saying the loss of a key customer and delays in product launches by some smartphone makers would hurt sales of its flagship Snapdragon chips.",
        "date": "04222015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-Qualcomm forecast misses as customer loss hurts mobile chip sales "
    },
    {
        "content": "April 22 Mobile chip maker Qualcomm Inc's  quarterly profit plunged 46 percent as it lost a key customer and its highly profitable licensing business suffered due to a Chinese government probe into its anti-competitive practices.",
        "date": "04222015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Chipmaker Qualcomm's quarterly profit plunges 46 pct "
    },
    {
        "content": "NEW YORK  April 17 (IFR) - Hedge fund pressure to break up Qualcomm is not likely to be an obstacle when the world's largest phone chip-maker comes to market as expected with a jumbo bond to finance a share buyback.",
        "date": "04172015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Hedge fund pressure unlikely to block Qualcomm bond "
    },
    {
        "content": "A slew of Dow 30 companies report results in the week: Chemicals conglomerate DuPont  industrial conglomerate United Technologies Corp and property and casualty insurer Travelers Companies Inc on Tuesday; planemaker Boeing Co  beverage maker Coca-Cola Co and McDonald's Corp on Wednesday; and diversified manufacturer 3M Co  Procter & Gamble and Microsoft Corp on Thursday. While DuPont is expected to report lower first-quarter results  Travelers Companies Inc's first-quarter results are expected t",
        "date": "04172015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "What to Watch in the Week Ahead and on Monday  April 20 "
    },
    {
        "content": "* Forecast comes after client Qualcomm's chips dropped by Samsung",
        "date": "04162015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "UPDATE 2-TSMC sees Q2 sales dip after key client loses business "
    },
    {
        "content": "TAIPEI  April 16 Taiwan Semiconductor Manufacturing Co Ltd (TSMC)  reported a 65 percent rise in first-quarter net profit on Thursday  beating analyst estimates  boosted by strong sales of iPhones from main client Apple Inc.",
        "date": "04162015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "CORRECTED-UPDATE 1-Taiwan's TSMC books 65 pct rise in Q1 net profit  beats estimates "
    },
    {
        "content": "NEW YORK  April 14 BlackRock Inc chief Larry Fink has asked the top executives of the 500 largest publicly listed U.S. companies urging them to take a long-term approach to create value for shareholders or risk losing his firm's support.",
        "date": "04142015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-BlackRock's Fink tells S&P 500 firms to think long-term "
    },
    {
        "content": "U.S. stocks dipped on Monday as fears increased that the strong dollar and lower oil prices will hurt U.S. first-quarter earnings.",
        "date": "04132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Wall St. declines as worries about earnings deepen "
    },
    {
        "content": "April 13 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "04132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Hedge fund Jana Partners said on Monday that Qualcomm Inc's chip business was \"essentially worthless\" at current valuations and pressed the company to spin it off from its patent-licensing business to \"restore investor confidence.\" | Video ",
        "date": "04132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Jana Partners pressing Qualcomm to spin off chip business "
    },
    {
        "content": "* Jana says chip unit \"essentially worthless\" at current valuation",
        "date": "04132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 4-Jana Partners pressing Qualcomm to spin off chip business "
    },
    {
        "content": "* Netflix to raise share authorization in step to split stock",
        "date": "04132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Nasdaq near all-time high on lift from tech "
    },
    {
        "content": "* Indexes up: Dow 0.17 pct  S&P 0.15 pct  Nasdaq 0.45 pct   (Updates to open)",
        "date": "04132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Wall St flat with earnings eyed; Apple  Qualcomm lift Nasdaq "
    },
    {
        "content": "NEW YORK  April 13 Activist hedge fund manager Barry Rosenstein said on Monday he wants the share price of chip maker Qualcomm to climb and his hedge fund  Jana Partners  plans to work collaboratively with management to find ways to boost it.",
        "date": "04132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Investor Jana's Rosenstein wants to 'pull levers' to boost Qualcomm "
    },
    {
        "content": "* Plans new wearable devices   (Adds comments from executives  analysts  background)",
        "date": "04092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "UPDATE 2-Samsung expects record Galaxy shipments  S6 edge shortage "
    },
    {
        "content": "April 13 U.S. stocks were set for a slightly lower open after three straight days of gains  as the corporate earnings season was poised to kick into high gear with a slew of reports this week.",
        "date": "04132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "REFILE-US STOCKS-Wall St to dip at open after three-day run; earnings eyed "
    },
    {
        "content": "* Jana Partners urges Qualcomm to consider spinning off its chip unit from its patent-licensing business - letter to investors",
        "date": "04132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Jana Partners urges Qualcomm to consider spinning off its chip unit "
    },
    {
        "content": "* Futures off: Dow 129 pts  S&P 14.5 pts  Nasdaq 30 pts   (Adds upcoming data  Uniqure  Qualcomm  Tesla; updates prices)",
        "date": "04062015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "US STOCKS-Wall Street to open lower in wake of weak jobs data "
    },
    {
        "content": "SEOUL/SAN FRANCISCO  April 3 Samsung Electronics Co Ltd used more of its own chips to power the new Galaxy S6 smartphone than it did for the predecessor S5  according to an early teardown report  in a blow to U.S. chip supplier Qualcomm Inc.",
        "date": "04032015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Teardown of new Samsung Galaxy smartphone suggests deeper loss for Qualcomm "
    },
    {
        "content": "March 9 Chipmaker Qualcomm Inc said it would buy back up to $15 billion of shares and raise its quarterly dividend.",
        "date": "03092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm to buy back up to $15 bln of shares  raise dividend "
    },
    {
        "content": "March 9 Chipmaker Qualcomm Inc said it would buy back up to $15 billion of shares and raise its quarterly dividend.",
        "date": "03092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Qualcomm to buy back up to $15 bln of shares  raise dividend "
    },
    {
        "content": "* Indexes down: Dow 1.05 pct  S&P 500 1.01 pct  Nasdaq 1.09 pct   (Updates to market open)",
        "date": "03102015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "US STOCKS-Wall St slumps on Greece concerns "
    },
    {
        "content": "* Futures down: Dow 150 pts  S&P 16.5 pts  Nasdaq 30.25 pts   (Updates prices  adds Barnes & Noble results)",
        "date": "03102015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Futures imply lower open on Greece concerns  China data "
    },
    {
        "content": "* Q4 underlying diluted EPS 0.13 usd versus 0.06 usd year ago",
        "date": "03052015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "BRIEF-CSR says core business continues to perform well "
    },
    {
        "content": "* Futures down: Dow 156 pts  S&P 18 pts  Nasdaq 33.25 pts   (Updates prices)",
        "date": "03102015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Futures weaken on Greece concerns  China data "
    },
    {
        "content": "NEW YORK  March 10 U.S. stock index futures fell on Tuesday  pressured by weaker-than-expected data out of China as well as ongoing concerns about debt talks in Greece.",
        "date": "03102015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Futures tumble on Greece concerns  China data "
    },
    {
        "content": "NEW YORK Honeywell International Inc said on Monday it has teamed up with satellite internet startup OneWeb Ltd to expand the high-speed data services it offers to aircraft.",
        "date": "03022015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Honeywell  OneWeb partner to offer satellite internet to aircraft "
    },
    {
        "content": "Thomson Reuters March 02  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                ",
        "date": "03022015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "DETROIT  March 2 Qualcomm Inc  a maker of smartphone chips and software  unveiled on Monday fourth-generation LTE modems that will enable cars to stay better-connected wirelessly to cloud-based services via the Web.",
        "date": "03022015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm seeks to pave road to marriage of cars and smartphones "
    },
    {
        "content": "SAN DIEGO  Feb 19 A former director of sales for U.S. chipmaker Qualcomm Inc pleaded guilty in San Diego on Thursday to insider trading  officials said.",
        "date": "02202015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Ex-Qualcomm executive pleads guilty to insider trading "
    },
    {
        "content": "BEIJING  Feb 13 Last summer  lawyers from Chinese telecoms gear maker ZTE Corp began writing to half a dozen local handset makers it believed used its patents. Its message was simple: it's time to pay up.",
        "date": "02132015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm deal sparks China smartphone patent skirmishes "
    },
    {
        "content": "SEOUL South Korea's Fair Trade Commission is investigating Qualcomm Inc  a person familiar with the matter told Reuters on Thursday  adding to antitrust woes for the U.S. chipmaker following a record fine it agreed to pay in China.",
        "date": "02122015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "South Korea antitrust body investigating Qualcomm: source "
    },
    {
        "content": "* S.Korea fined Qualcomm more than $200 mln in 2009   (Updates with regulator declining comment  background)",
        "date": "02122015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 2-South Korea antitrust body investigating Qualcomm -source "
    },
    {
        "content": "SEOUL  Feb 12 South Korea's Fair Trade Commission is investigating U.S.-based chipmaker Qualcomm Inc   a person familiar with the matter told Reuters on Thursday.",
        "date": "02122015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "S.Korea Fair Trade Commission investigating Qualcomm - source "
    },
    {
        "content": "SHANGHAI  Feb 11 China shares rose for a third straight day on Wednesday after the central bank vowed to support economic growth  but investors were reluctant to chase stocks too high on concerns that the rebound was due to technical factors and may be short-lived.",
        "date": "02112015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "China stocks up on expectations of more policy easing  Hong Kong lags "
    },
    {
        "content": "SAN FRANCISCO/BEIJING  Feb 10 Even after agreeing to pay a record near-$1 billion fine in China for antitrust violations  U.S. chipmaker Qualcomm Inc faces big challenges in its most important market.",
        "date": "02102015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "With antitrust deal done  Qualcomm still faces China challenges "
    },
    {
        "content": "SAN FRANCISCO/BEIJING Qualcomm Inc  has agreed to pay China a fine of $975 million  the largest in the country's corporate history  ending a 14-month government investigation into anti-competitive practices.",
        "date": "02092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm to pay $975 million to resolve China antitrust dispute "
    },
    {
        "content": "SAN FRANCISCO/BEIJING Qualcomm Inc has agreed to pay a fine of $975 million  the largest in China's corporate history  ending a 14-month government investigation into anti-competitive practices.",
        "date": "02102015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm to pay $975 mln to resolve China antitrust dispute "
    },
    {
        "content": "SAN FRANCISCO/BEIJING  Feb 9 Qualcomm Inc  has agreed to pay China a fine of $975 million  the largest in the country's corporate history  ending a 14-month government investigation into anti-competitive practices.",
        "date": "02092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 3-Qualcomm to pay $975 mln to resolve China antitrust dispute "
    },
    {
        "content": "SAN FRANCISCO/BEIJING Qualcomm Inc has agreed to pay China a fine of $975 million  the largest in the country's corporate history  ending a 14-month government investigation into anti-competitive practices.",
        "date": "02092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm pays $975 mln  resolves China antitrust dispute "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - China has held back with its Qualcomm settlement. The country's antitrust watchdogs hit the U.S. chipmaker with a $975 million fine on Feb. 9 and forced it to lower patent fees. That's helpful for local smartphone makers that rely on Qualcomm's third and fourth generation mobile technology. Yet the resolution stopped short of explicitly curbing the tech giant's dominance in the country. Big as China is  it can't yet afford to shut out foreign technology.",
        "date": "02102015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Breakingviews: China pulls its punches with Qualcomm settlement "
    },
    {
        "content": "SAN FRANCISCO  Feb 9 Qualcomm Inc told Reuters in a telephone interview on Monday:  * CFO says increased fiscal 2015 guidance reflects removal of potential",
        "date": "02092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "BRIEF-Qualcomm CFO says increased fiscal 2015 guidance reflects removal of potential negative outcomes "
    },
    {
        "content": "Feb 9 Chipmaker Qualcomm Inc said it would pay a fine of $975 million to China's National Development and Reform Commission to resolve a 14-month government investigation into anti-competitive practices.",
        "date": "02092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "REFILE-Qualcomm to pay $975 mln to settle China antitrust dispute "
    },
    {
        "content": "SEOUL  Feb 10 As Samsung Electronics Co Ltd  sells fewer of its own smartphones  the South Korean group's components businesses are under pressure to pick up the slack and secure external customers for chips and display panels  including putting these in rival mobile devices.",
        "date": "02092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Amid mobile slump  Samsung needs more outside customers for its chips and panels "
    },
    {
        "content": "SEOUL As Samsung Electronics Co Ltd sells fewer of its own smartphones  the South Korean group's components businesses are under pressure to pick up the slack and secure external customers for chips and display panels  including putting these in rival mobile devices. | Video ",
        "date": "02102015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Amid mobile slump  Samsung needs more outside customers for chips  panels "
    },
    {
        "content": "SEOUL  Feb 10 As Samsung Electronics Co Ltd  sells fewer of its own smartphones  the South Korean group's components businesses are under pressure to pick up the slack and secure external customers for chips and display panels  including putting these in rival mobile devices.",
        "date": "02102015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Amid mobile slump  Samsung needs more outside customers for chips  panels "
    },
    {
        "content": "* Indexes down: Dow 0.28 pct  S&P 0.12 pct  Nasdaq 0.02 pct   (Updates to afternoon trade  commentary)",
        "date": "02092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Wall St down on China  Greek worry; energy gains "
    },
    {
        "content": "SAN FRANCISCO/BEIJING Qualcomm Inc has agreed to pay a fine of $975 million  the largest in China's corporate history  ending a 14-month government investigation into anti-competitive practices.",
        "date": "02102015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm to pay $975 million to resolve China antitrust dispute "
    },
    {
        "content": "* Indexes off: Dow 0.33 pct  S&P 0.18 pct  Nasdaq 0.24 pct   (Updates to late morning trade)",
        "date": "02092015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Wall St dips on China  Greek worry; energy gains "
    },
    {
        "content": "SAN FRANCISCO Qualcomm Inc  reduced its outlook for fiscal 2015  saying it expects its newest Snapdragon mobile chip will not be used in a major customer's flagship smartphone  sending its shares lower.",
        "date": "01282015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Qualcomm says key customer passed on new chip  stock drops "
    },
    {
        "content": "* Indexes up: Dow 1.31 pct  S&P 0.95 pct  Nasdaq 0.98 pct   (Updates with market moves  comments)",
        "date": "01292015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Wall St finishes higher in afternoon rally as oil gains "
    },
    {
        "content": "SAN FRANCISCO  Jan 28 Qualcomm Inc  reduced its outlook for fiscal 2015  saying it expects its newest Snapdragon mobile chip will not be used in a major customer's flagship smartphone  sending its shares lower.",
        "date": "01282015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 3-Qualcomm says key customer passed on new chip  stock drops "
    },
    {
        "content": "SAN FRANCISCO  Jan 28 Qualcomm Inc  posted higher fiscal first-quarter revenue that beat analysts' expectations as a year-long antitrust investigation in China weighed on investor sentiment.",
        "date": "01282015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm's fiscal first-quarter revenue beats Street "
    },
    {
        "content": "* Dow up 0.71 pct  S&P up 0.41 pct  Nasdaq up 0.33 pct   (Updates with market moves  comments)",
        "date": "01292015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS-Wall St gains in choppy trading "
    },
    {
        "content": "NEW YORK  Jan 29 The S&P 500 opened little changed on Thursday  while the Dow rebounded after two days of sharp losses on strong labor market data  though weakness in Qualcomm shares in the wake of its results weighed on the Nasdaq.",
        "date": "01292015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "US STOCKS SNAPSHOT-S&P 500 opens flat  Qualcomm weighs on Nasdaq "
    },
    {
        "content": "NEW YORK  Jan 29 U.S. stock index futures climbed on Thursday  rebounding after two days of sharp losses  ahead of housing and labor market data and another busy day for corporate earnings.",
        "date": "01292015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "CORRECTED-US STOCKS-Futures rise with earnings after two days of losses  data due "
    },
    {
        "content": "SEOUL Samsung Electronics Co Ltd  will not use Qualcomm Inc's  processors for the next version of the South Korean technology giant's flagship Galaxy S smartphone  Bloomberg reported on Wednesday  citing unidentified sources.",
        "date": "01212015",
        "name": "QUALCOMM Incorporated",
        "news_type": "topStory",
        "symbol": "QCOM",
        "title": "Samsung drops Qualcomm processors in next Galaxy S: report "
    },
    {
        "content": "* Move could boost Samsung's struggling foundry ops - analysts   (Updates with comments from analysts  background)",
        "date": "01212015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "UPDATE 1-Samsung drops Qualcomm processors in next Galaxy S - report "
    },
    {
        "content": "SEOUL  Jan 21 Samsung Electronics Co Ltd  will not use Qualcomm Inc's processors for the next version of the South Korean technology giant's flagship Galaxy S smartphone  Bloomberg reported on Wednesday  citing unnamed sources.",
        "date": "01212015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Samsung Elec won't use Qualcomm chip for new Galaxy S phone -Bloomberg "
    },
    {
        "content": "CAPE CANAVERAL  Fla.  Jan 15 Richard Branson's Virgin Group and Qualcomm Inc will invest in a venture to build and fly a constellation of 648 satellites that can provide high-speed  global Internet access  company officials said on Thursday.",
        "date": "01152015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Virgin  Qualcomm to invest in Internet-via-satellite venture "
    },
    {
        "content": "SAN FRANCISCO  Jan 5 Qualcomm on Monday unveiled easy-to-use blueprints to help manufacturers make LED light bulbs that use the chipmaker's wifi technology to connect to the Internet.",
        "date": "01052015",
        "name": "QUALCOMM Incorporated",
        "news_type": "normal",
        "symbol": "QCOM",
        "title": "Qualcomm flicks switch on Internet-connected light bulbs "
    }
]