[
    {
        "content": "* Qiagen NV - reaffirming 2017 adjusted EPS target of $1.25-1.27 cer before restructuring‍​",
        "date": "11062017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen NV posts qtrly adjusted EPS $0.32‍​ "
    },
    {
        "content": "* Qiagen and Centogene to collaborate in bioinformatics for genetic diseases",
        "date": "10092017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen  Centogene to collaborate in bioinformatics for genetic diseases "
    },
    {
        "content": "* Partnership will seek to combine angle's parsortix system for harvesting circulating tumor cells with qiagen's liquid biopsy solution portfolio Source text for Eikon: Further company coverage: (Reporting By London Bureau)",
        "date": "09112017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Angle partners Qiagen in liquid biopsy portolio "
    },
    {
        "content": "* BOOKRUNNER SAYS TRANSACTION WILL PRICE AT 0.50% COUPON AND 30% PREMIUM ON AN UPSIZED $400M ISSUE SIZE",
        "date": "09062017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Bookrunner says Qiagen transaction priced at 30 pct premium on upsized $400 mln issue size "
    },
    {
        "content": "* BOOKRUNNER SAYS ORDERS BELOW MIDS RISK MISSING  FURTHER DETAILS TO FOLLOW ON BOOKS CLOSE IN QIAGEN DEAL Further company coverage: (Bengaluru Newsroom)",
        "date": "09062017",
        "name": "Qiagen NV",
        "news_type": "normal",
        "symbol": "QGEN",
        "title": "BRIEF-Bookrunner says orders below mids risk missing Qiagen deal "
    },
    {
        "content": "* Says q2 net sales $349.0 million (+4% actual); adjusted net sales $349.6 million (+5% actual  +7% CER vs. +5-6% CER guidance)",
        "date": "07272017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen upgrades 2017 sales guidance after solid first half "
    },
    {
        "content": "* HTG Molecular Diagnostics - initiation of second development program under co's master agreement with unit of Qiagen N.V. Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Qiagen NV",
        "news_type": "normal",
        "symbol": "QGEN",
        "title": "BRIEF-HTG Molecular Diagnostics initiates second development program under co's master agreement with unit of Qiagen N.V. "
    },
    {
        "content": "* Signs collaboration with Qiagen to expand liaison test menu through adoption of select Qiagen assays Further company coverage:",
        "date": "06222017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Diasorin  Qiagen to develop tests for Diasorin's family of analyzers "
    },
    {
        "content": "* SIGNS COLLABORATION WITH QIAGEN TO DEVELOP NEW TESTS FOR DIASORIN’S LIAISON FAMILY OF ANALYZERS BASED ON REVIEW AND SELECTION PROCESS INVOLVING QIAGEN’S ASSAY TECHNOLOGIES Source text: http://reut.rs/2sFOaPL Further company coverage: (Gdynia Newsroom)",
        "date": "06222017",
        "name": "Qiagen NV",
        "news_type": "normal",
        "symbol": "QGEN",
        "title": "BRIEF-Diasorin signs collaboration with QIAGEN to expand LIAISON test menu "
    },
    {
        "content": "* Says ‍french health system approves reimbursement of qiagen's quantiferon latent tb test​ Source text for Eikon: Further company coverage:",
        "date": "06222017",
        "name": "Qiagen NV",
        "news_type": "normal",
        "symbol": "QGEN",
        "title": "BRIEF-QIAGEN says ‍French health system approves reimbursement of it's QuantiFERON latent TB test​ "
    },
    {
        "content": "* Oxford Immunotec announces favorable claim construction ruling in patent infringement litigation",
        "date": "06152017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Oxford Immunotec announces favorable claim construction ruling in patent infringement litigation "
    },
    {
        "content": "* HTG Molecular Diagnostics Inc -  effective June 14  co entered statement of work with subsidiary of Qiagen N.V",
        "date": "06142017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-HTG Molecular Diagnostics Inc enters statement of work with subsidiary of QIAGEN N.V "
    },
    {
        "content": "* Qiagen Nv - U.S. Commercialization of Quantiferon®-Tb Gold Plus is planned to begin later this year Source text for Eikon: Further company coverage:",
        "date": "06082017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen NV's Quantiferon-Tb Gold plus gains U.S. FDA approval "
    },
    {
        "content": "* Qiagen receives U.S. FDA approval for Cytomegalovirus (CMV) testing on automated Qiasymphony platform",
        "date": "06062017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen receives U.S. FDA approval for Cytomegalovirus testing "
    },
    {
        "content": "* Qiagen nv -  reaffirms full-year 2017 outlook for 6-7% cer sales growth and adjusted eps target before restructuring costs of $1.25-1.27 cer",
        "date": "05022017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen reports Q1 adjusted earnings per share $0.22 "
    },
    {
        "content": "* Qiagen partners with Maccura to localize and commercialize GeneReader NGS system in China",
        "date": "05022017",
        "name": "Qiagen NV",
        "news_type": "normal",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen partners with Maccura to localize GeneReader NGS System in China "
    },
    {
        "content": "* Says new research suggests potential for additional clinical utility of qiagen's quantiferon-tb gold plus",
        "date": "04122017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen: potential additional clinical utility of Quantiferon-tb gold plus "
    },
    {
        "content": "* Qiagen expands liquid biopsy pipeline with AR-V7 test in prostate cancer",
        "date": "03312017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen expands liquid biopsy pipeline with AR-V7 test in prostate cancer "
    },
    {
        "content": "* Qiagen launches first FDA-cleared JAK2 test for certain type of leukemia Source text for Eikon: Further company coverage:",
        "date": "03292017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen launches first FDA-cleared JAK2 test for certain type of leukemia "
    },
    {
        "content": "* Qiagen reaffirms full-year 2017 outlook for 6-7 pct CER sales growth",
        "date": "02012017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "CORRECTED-BRIEF-Qiagen Q4 adjusted eps $0.15 "
    },
    {
        "content": "* Qiagen reaffirms full-year 2017 outlook for 6-7% CER sales growth",
        "date": "02012017",
        "name": "Qiagen NV",
        "news_type": "normal",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen NV Q4 SHR $0.04 "
    },
    {
        "content": "* Qiagen announces adjustment of conversion ratio under its 0.375 pct senior unsecured convertible notes due 2019 (isin xs1046477235)",
        "date": "01262017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "BRIEF-Qiagen announces adjustment of conversion ratio under its 0.375pct senior unsecured convertible notes "
    },
    {
        "content": "Diagnostic technology company Qiagen NV will try to persuade the U.S. Court of Appeals for the Federal Circuit on Thursday to throw out an injunction barring the sale of its year-old GeneReader  the company's entry into the rapidly growing gene-sequencing market.",
        "date": "01112017",
        "name": "Qiagen NV",
        "news_type": "topStory",
        "symbol": "QGEN",
        "title": "Illumina  Qiagen to square off over GeneReader ban "
    }
]