[
    {
        "content": "* Pershing Square Capital Management‍​ cuts sole share stake in Restaurant Brands International Inc by 32.3 percent to 26.5 million shares - SEC filing",
        "date": "11142017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Pershing Square Capital Management‍​ cuts sole share stake in Restaurant Brands International "
    },
    {
        "content": "Canada's Restaurant Brands International Inc  on Thursday reported a quarterly profit that blew past estimates  helped by continued demand at its Burger King chain.",
        "date": "10262017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "Restaurant Brands profit beats estimates as Burger King shines "
    },
    {
        "content": "Oct 26 Canada's Restaurant Brands International Inc on Thursday reported a quarterly profit that blew past estimates  helped by continued demand at its Burger King chain.",
        "date": "10262017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "UPDATE 1-Restaurant Brands profit beats estimates as Burger King shines "
    },
    {
        "content": "* Restaurant Brands International Inc. announces intention to redeem all class A preferred shares and to repurchase 5.0 million class B exchangeable limited partnership units",
        "date": "10262017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International announces intention to redeem all class A preferred shares "
    },
    {
        "content": "Oct 26 Canada's Restaurant Brands International Inc on Thursday reported a 6 percent rise in quarterly profit  helped by strength in its Burger King chain.",
        "date": "10262017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "Restaurant Brands posts 6 pct rise in profit "
    },
    {
        "content": "* Restaurant Brands International Inc reports third quarter 2017 results",
        "date": "10262017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant brands reports Q3 ‍diluted EPS of $0.37​ "
    },
    {
        "content": "* Says on Oct 13  Co's units extended maturity date of senior secured revolving credit facility under deal dated Oct 27  2014​",
        "date": "10162017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands extends maturity date of revolving credit facility "
    },
    {
        "content": "* Restaurant brands International Inc announces pricing and upsizing of add-on offering of 5.0% second lien senior secured notes due 2025",
        "date": "09182017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International announces pricing of Second Lien Senior Secured Notes "
    },
    {
        "content": "* Restaurant Brands International Inc announces launch of add-on offering of 5.0 percent Second Lien senior secured notes due 2025",
        "date": "09182017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International announces launch of add-on offering "
    },
    {
        "content": "* Restaurant Brands International Inc announces pricing and upsizing of second lien senior secured notes offering",
        "date": "08092017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International announces pricing and upsizing senior secured notes offering "
    },
    {
        "content": "* Restaurant Brands International Inc announces launch of second lien senior secured notes offering",
        "date": "08082017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands launches second lien senior secured notes offering "
    },
    {
        "content": "* Restaurant Brands International Inc - RBI may purchase up to $300 million of its common shares over next four years Source text for Eikon: Further company coverage:",
        "date": "08022017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International announces renewal of normal course issuer bid "
    },
    {
        "content": "Restaurant Brands International Inc's   quarterly profit topped Wall Street estimates  driven mainly by higher sales at its Burger King chain.",
        "date": "08022017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "Burger King drives Restaurant Brands' profit beat "
    },
    {
        "content": "Aug 2 Restaurant Brands International Inc's quarterly profit topped Wall Street estimates  driven mainly by higher sales at its Burger King chain.",
        "date": "08022017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "UPDATE 2-Burger King drives Restaurant Brands' profit beat "
    },
    {
        "content": "* Restaurant Brands International Inc. announces agreement to launch the Tim Hortons® brand in Spain",
        "date": "08022017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International to launch Tim Hortons brand in Spain "
    },
    {
        "content": "Aug 2 Restaurant Brands International Inc posted a slight drop in quarterly profit on Wednesday  as a strength in its Burger King chain was offset by fewer patrons visiting Tim Hortons and Popeyes Louisiana Kitchen.",
        "date": "08022017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "Burger King  Tim Hortons owner Restaurant Brands' profit dips "
    },
    {
        "content": "* Restaurant Brands International Inc. reports second quarter 2017 results",
        "date": "08022017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International reports Q2 earnings per share $0.37 "
    },
    {
        "content": "* Restaurant brands international inc. Announces election of directors",
        "date": "06062017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International announces election of directors "
    },
    {
        "content": "* Restaurant Brands says unit entered indenture in connection with issuance  sale of $1.50 billion of 4.250% first lien senior secured notes due 2024",
        "date": "05172017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands says unit entered indenture in connection with issuance  sale of $1.50 billion of 4.250% first lien senior secured notes "
    },
    {
        "content": "* Restaurant Brands International Inc announces pricing and upsizing of first lien senior secured notes offering and revised sizing of additional borrowings under its existing first lien term loan facility",
        "date": "05032017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International Inc announces pricing and upsizing of first lien senior secured notes "
    },
    {
        "content": "Restaurant Brands International Inc    reported an unexpected drop in quarterly comparable-store sales at both coffee and doughnut chain Tim Hortons and fast-food chain Burger King  sending the company's shares down nearly 8 percent.",
        "date": "04262017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "Burger King owner Restaurant Brands' comp-sales miss; shares down "
    },
    {
        "content": "* Shares slide as much as 7.6 pct to $54.02 (Adds details  shares)",
        "date": "04262017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "UPDATE 2-Burger King owner Restaurant Brands' comp-sales miss; shares down "
    },
    {
        "content": "* Restaurant Brands International Inc reports first quarter 2017 results",
        "date": "04262017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International posts Q1 adj. earnings $0.36/shr "
    },
    {
        "content": "April 26 Restaurant Brands International Inc   the owner of Burger King and Tim Hortons  reported an 8.9 percent rise in quarterly revenue as it opened more restaurants.",
        "date": "04262017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "Burger King owner Restaurant Brands revenue rises 8.9 pct "
    },
    {
        "content": "* Restaurant Brands International Inc announces agreement to grow the Burger King® brand in Sub-Saharan Africa Source text for Eikon: Further company coverage:",
        "date": "04042017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands reports agreement to grow Burger King brand in Sub-Saharan Africa "
    },
    {
        "content": "* Restaurant Brands International Inc - expects to complete acquisition of Popeyes Louisiana Kitchen Inc on Monday  Source text for Eikon:  Further company coverage:",
        "date": "03272017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International expects to complete acquisition of Popeyes Louisiana Kitchen "
    },
    {
        "content": "* Restaurant Brands -  on March 27  2 indirect units entered into an incremental facility amendment to credit agreement dated as of October 27  2014",
        "date": "03312017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands says 2 indirect units entered into an incremental facility amendment to credit agreement dated as of Oct 27  2014 "
    },
    {
        "content": "Restaurant Brands International Inc   owner of the Burger King and Tim Hortons fast-food chains  said on Tuesday it would acquire Popeyes Louisiana Kitchen  for $1.8 billion in cash.",
        "date": "02222017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "Burger King and Tim Hortons owner to buy Popeyes for $1.8 billion "
    },
    {
        "content": "* Restaurant Brands International - on February 17  2017  two indirect subsidiaries entered into a second amendment to credit agreement",
        "date": "02172017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International says 2 units entered into a second amendment to credit agreement "
    },
    {
        "content": "TORONTO  Feb 21 Canada's main stock index closed at a record high on Tuesday  with energy shares leading broad-based gains as oil prices climbed  while Restaurant Brands International Inc jumped more than 7 percent after it announced an acquisition.",
        "date": "02212017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "CANADA STOCKS-TSX adds to record high; led by energy  Restaurant Brands "
    },
    {
        "content": "Feb 21 Restaurant Brands International Inc   owner of the Burger King and Tim Hortons fast-food chains  said on Tuesday it would acquire Popeyes Louisiana Kitchen for $1.8 billion in cash.",
        "date": "02212017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "UPDATE 2-Burger King and Tim Hortons owner to buy Popeyes for $1.8 bln "
    },
    {
        "content": "Feb 21 Restaurant Brands International Inc   owner of the Burger King and Tim Hortons fast-food chains  said on Tuesday it would acquire Popeyes Louisiana Kitchen for $1.8 billion in cash.",
        "date": "02212017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "Burger King and Tim Hortons owner to buy Popeyes for $1.8 bln "
    },
    {
        "content": "* Restaurant Brands International Inc agrees to acquire Popeyes Louisiana Kitchen",
        "date": "02212017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands to acquire Popeyes Louisiana Kitchen "
    },
    {
        "content": "Feb 21 Canada's main stock index futures pointed to a higher start on Tuesday on strengthening oil prices  as OPEC aims for deeper output cuts directed at reining in a global fuel supply overhang.",
        "date": "02212017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "CANADA STOCKS-Futures higher after rise in oil prices "
    },
    {
        "content": "Feb 13 Restaurant Brands International Inc   owner of the Burger King and Tim Hortons fast-food chains  has approached Popeyes Louisiana Kitchen Inc about a possible acquisition  people familiar with the matter said on Monday.",
        "date": "02132017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "EXCLUSIVE-Burger King and Tim Hortons owner in bid to buy Popeyes -sources "
    },
    {
        "content": "Feb 13 Canada's main stock index was set to follow global markets higher on Monday  helped by optimism over U.S. President Donald Trump's tax reform plans and a rebound in certain commodity prices.",
        "date": "02132017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "CANADA STOCKS-Futures trade higher on global cues "
    },
    {
        "content": "* Q4 Tim Hortons same store sales rose 0.2 percent in constant currency",
        "date": "02132017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands reports Q4 adjusted EPS of $0.44 "
    },
    {
        "content": "TORONTO  Feb 7 Canada's main stock index rose on Tuesday  with gains among heavyweight financial stocks on talk of a U.S. interest rate hike in March offsetting losses for shares of energy companies as oil prices fell.",
        "date": "02072017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "CANADA STOCKS-TSX rises as bank gains offset energy losses "
    },
    {
        "content": "* Restaurant Brands International Inc. to report full year and fourth quarter 2016 results on February 13  2017; provides selected full year 2016 guidance",
        "date": "02062017",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International provides selected full year 2016 guidance "
    },
    {
        "content": "Feb 13 Restaurant Brands International Inc    the owner of Burger King and Tim Hortons  reported a quarterly profit that more than doubled from a year ago  when it recorded a one-time charge related to the merger of the two brands.",
        "date": "02132017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "Burger King  Tim Hortons owner's profit more than doubles "
    },
    {
        "content": "Jan 27 Restaurant Brands International Inc  said it would launch its coffee and doughnut chain  Tim Hortons  in Mexico as a part of its expansion plans.",
        "date": "01272017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "Restaurant Brands to launch Tim Hortons in Mexico "
    },
    {
        "content": "* Restaurant Brands International Inc. announces master franchise joint venture to launch the Tim Hortons brand in Mexico",
        "date": "01272017",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International to launch Tim Hortons brand in Mexico "
    },
    {
        "content": "* Restaurant Brands International Inc reports third quarter 2016 results",
        "date": "10242016",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International Inc reports third quarter 2016 results "
    },
    {
        "content": "TORONTO  Sept 1 Canada's main stock index moved slightly higher on Thursday as gold miners bucked bullion's fall after an August sell-off and investors cheered the expansion of Tim Hortons into Britain.",
        "date": "09012016",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "CANADA STOCKS-TSX rises modestly with gold miners; oil weighs "
    },
    {
        "content": "Aug 31 Canada's Restaurant Brands International Inc  said it would launch Tim Hortons coffee and doughnut shops in Great Britain as part of its expansion plans.",
        "date": "08312016",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "Restaurant Brands to launch Tim Hortons in Great Britain "
    },
    {
        "content": "* Establishment of a master franchise joint venture with an investor in Great Britain",
        "date": "08312016",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International establishment of a master franchise joint venture with an investor in Great Britain "
    },
    {
        "content": "* Q2 RBI total revenues of $1 040.2 million versus $1 042.2 million in prior year period",
        "date": "08042016",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International Q2 RBI diluted EPS $0.38 "
    },
    {
        "content": "* Announces adoption of share repurchase authorization and commencement of normal course issuer bid",
        "date": "08042016",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands International announces adoption of share repurchase authorization "
    },
    {
        "content": "Aug 4 Restaurant Brands International Inc    owner of Burger King and the Tim Hortons coffee and doughnut chain  reported a more than eight-fold rise in quarterly profit  helped by lower costs.",
        "date": "08042016",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "Owner of Burger King/Tim Hortons posts jump in profit "
    },
    {
        "content": "* Restaurant Brands International Inc announces master franchise joint venture to develop and grow the Tim Hortons\u007f brand in the Philippines",
        "date": "07282016",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands announces master franchise JV "
    },
    {
        "content": "TORONTO  July 18 Canada's main stock index rose on Monday as banks  some consumer stocks  industrials and materials gained  while energy shares weighed with lower oil prices.",
        "date": "07182016",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "CANADA STOCKS-TSX rises  but energy sector losses cut into broad advance "
    },
    {
        "content": "* Appointed Ali Hedayat to board to fill a recent vacancy on board  effective immediately",
        "date": "07152016",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands appointed Ali Hedayat to board "
    },
    {
        "content": "* Announces agreement with Restaurant Development Partners to grow Tim Hortons brand in Minnesota",
        "date": "06092016",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands announces agreement to grow Tim Hortons brand in Minnesota "
    },
    {
        "content": "* Restaurant Brands International Inc reports first quarter 2016 results",
        "date": "04282016",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "BRIEF-Restaurant Brands reports Q1 adjusted earnings $0.30/shr "
    },
    {
        "content": "Restaurant Brands International Inc   said it was off to a \"great start\" this year  after new product launches at its Burger King and Tim Hortons chains in 2015 helped boost sales in a highly competitive market.",
        "date": "02162016",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "Burger King  Tim Hortons owner says 2016 off to a great start "
    },
    {
        "content": "Feb 16 Stock futures pointed to a higher opening for Canada's main stock index on Tuesday as oil prices rose after four of the world's largest producers agreed to freeze output.",
        "date": "02162016",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "CANADA STOCKS-Futures rise on higher oil prices "
    },
    {
        "content": "Feb 16 Restaurant Brands International Inc    the owner of Burger King and Tim Hortons  posted a fourth-quarter profit  compared with year-ago loss  on strong demand for products such as Nutella pockets  grilled wraps and chicken fries.",
        "date": "02162016",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "Burger King/Tim Hortons owner posts fourth-quarter profit "
    },
    {
        "content": "* Shares rise 7.5 pct to 5-month high   (Adds Breakingviews link)",
        "date": "07272015",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "UPDATE 3-Burger King/Tim Hortons owner profit gets boost from new menu items "
    },
    {
        "content": "April 27 Restaurant Brands International Inc   said on Monday its Burger King and Tim Hortons chains posted their strongest same-store sales performance in years in the first quarter  with customers lured in by popular menu items.",
        "date": "04272015",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "UPDATE 2-Owner of Tim Hortons  Burger King posts strong 1st-qtr sales "
    },
    {
        "content": "TORONTO  April 27 Canada's main stock index gained on Monday as buoyant metal prices helped mining stocks rise and investors cheered first-quarter results from Restaurant Brands International Inc.",
        "date": "04272015",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "CANADA STOCKS-TSX rises slightly  led by mining stocks "
    },
    {
        "content": "TORONTO  Feb 17 Canada's main stock index edged higher on Tuesday as a jump in Restaurant Brands International Inc  following the fast-food chain's quarterly report  helped offset declines in the natural resource sectors after commodity prices weakened.",
        "date": "02172015",
        "name": "Restaurant Brands International Inc",
        "news_type": "topStory",
        "symbol": "QSR",
        "title": "CANADA STOCKS-TSX up slightly as Restaurant Brands gain offsets resources "
    },
    {
        "content": "TORONTO  Feb 17 Canada's main stock index was little changed on Tuesday as a jump in shares of Restaurant Brands International Inc  following the fast-food chain's quarterly report  helped offset declines in the natural resource sectors after commodity prices weakened.",
        "date": "02172015",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "CANADA STOCKS-TSX little changed as Restaurant Brands rises  resources slip "
    },
    {
        "content": "TORONTO  Feb 17 Restaurant Brands International Inc  the parent of Burger King and Canadian coffee and doughnut chain Tim Hortons  reported robust quarterly sales growth on Tuesday  crediting new menu items for driving traffic.",
        "date": "02172015",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "UPDATE 4-New menu items help drive Burger King  Tim Hortons sales jump "
    },
    {
        "content": "TORONTO  Feb 17 Canada's main stock index edged higher on Tuesday as a jump in shares of Restaurant Brands International Inc  after the fast-food chain reported quarterly results  helped offset worries about whether Greece will be able to secure a debt deal.",
        "date": "02172015",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "CANADA STOCKS-TSX edges higher as Greek worries offset by Restaurant Brands "
    },
    {
        "content": "Feb 17 Restaurant Brands International Inc   formed out of Burger King's takeover of Canadian coffee and doughnut chain Tim Hortons last year  reported a net loss in its first quarterly results after the merger.",
        "date": "02172015",
        "name": "Restaurant Brands International Inc",
        "news_type": "normal",
        "symbol": "QSR",
        "title": "Burger King/Tim Hortons parent posts quarterly loss "
    }
]