[
    {
        "content": "* IPTs MS+65bp-70bp area. Books open  today's business. Due Jan 16 2021. Settles Nov 16 2017. Denoms EUR100k+EUR 1k. Senior  Unsecured  RegS Bearer. Standalone. Irish listed. English Law. MWC.",
        "date": "11092017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari names banks for EUR500m exp Jan 2021  MS+65bp-70bp area "
    },
    {
        "content": "* To use proceeds from bond for general company purposes including repaying existing credit lines Further company coverage: (Reporting by Milan Newsroom)",
        "date": "11092017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "BRIEF-Italy's Ferrari says to issue bond "
    },
    {
        "content": "MILAN Italian luxury sportscar maker Ferrari  nudged up its full-year profit forecast on Thursday  but the modest increase disappointed  along with rise in third-quarter earnings that were only in line with expectations  sending the share price lower.",
        "date": "11022017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari disappoints with sluggish profit growth forecast "
    },
    {
        "content": "MILAN  Nov 2 Italian luxury sportscar maker Ferrari nudged up its full-year profit forecast on Thursday  but the modest increase disappointed  along with rise in third-quarter earnings that were only in line with expectations  sending the share price lower.",
        "date": "11022017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "UPDATE 1-Ferrari disappoints with sluggish profit growth forecast "
    },
    {
        "content": "MILAN  Nov 2 Italian luxury sportscar maker Ferrari nudged up its full-year guidance on Thursday  but the modest lift and an expected 13 percent rise in quarterly core earnings disappointed the market  with shares falling more than 4 percent.",
        "date": "11022017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari disappoints on Q3 results  modest guidance lift "
    },
    {
        "content": "MILAN  Sept 20 Demand for the initial public offering of Italian tyremaker Pirelli has reached an amount sufficient to cover the base size of the offer on the third day of the share sale  a memo sent by banks to investors said on Wednesday.",
        "date": "09202017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Pirelli's IPO books covered on base deal size - bank memo "
    },
    {
        "content": "FRANKFURT  Sept 12 Ferrari and Volkswagen-owned Lamborghini are working on hybrid versions of their sportscars but have no plans for now to develop wholly electric models  executives at the two companies said at the Frankfurt car show on Tuesday.",
        "date": "09122017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari  Lamborghini say no plans yet to develop all-electric cars "
    },
    {
        "content": "LONDON The Ferrari Formula One team and tobacco company Philip Morris International announced on Monday the renewal of one of the longest-running and least obvious sponsorships in sport.",
        "date": "09042017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Motor racing: Ferrari continue with tobacco sponsor "
    },
    {
        "content": "LONDON  Sept 4 The Ferrari Formula One team and tobacco company Philip Morris International announced on Monday the renewal of one of the longest-running and least obvious sponsorships in sport.",
        "date": "09042017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Motor racing-Ferrari continue with tobacco sponsor "
    },
    {
        "content": "MILAN  Aug 23 Italian luxury sportscar maker Ferrari on Wednesday unveiled the Ferrari Portofino  its new entry level model that will replace the California.",
        "date": "08232017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari unveils its new entry-level model: the Portofino "
    },
    {
        "content": "MILAN  Aug 2 An expansion of Ferrari's line-up into utility vehicles would not compromise the Italian carmaker's exclusive status nor its luxury profit margins  Chief Executive Sergio Marchionne said on Wednesday.",
        "date": "08022017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "UPDATE 1-Ferrari CEO says a utility vehicle would not hurt brand or margins "
    },
    {
        "content": "MILAN  Aug 2 Italian luxury sportscar maker Ferrari reported a 24 percent rise in second-quarter core earnings on Wednesday and kept its full-year guidance disappointing some investors who had expected it to lift its outlook.",
        "date": "08022017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari Q2 core earnings rise 24 pct  confirms guidance "
    },
    {
        "content": "* Ferrari wants ‘utility vehicle’ in a plan to double profit - Bloomberg citing sources",
        "date": "08012017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari wants ‘utility vehicle’ in plan to double profit - Bloomberg "
    },
    {
        "content": "BUDAPEST The Swiss-based Sauber Formula One team announced a multi-year agreement on Friday to continue using Ferrari engines after this season.",
        "date": "07282017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Sauber to stay with Ferrari engines in 2018 "
    },
    {
        "content": "BUDAPEST  July 28 Sauber have signed a multi-year agreement to continue using  Ferrari engines after this season  the Swiss Formula One team said on Friday.",
        "date": "07282017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Motor racing-Sauber to stay with Ferrari engines in 2018 "
    },
    {
        "content": "* has reached multi-year agreement with Sauber F1 team to supply Swiss team with power units produced at Maranello factory Source text for Eikon: Further company coverage: (Reporting by Milan newsroom)",
        "date": "07282017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari to supply Sauber F1 team with power units from Maranello "
    },
    {
        "content": "SPIELBERG  Austria Ferrari will trial a new transparent frontal protection cockpit 'shield' in British Grand Prix practice at Silverstone next week  Formula One's governing body said on Saturday.",
        "date": "07082017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Formula One to test 'shield' device at Silverstone "
    },
    {
        "content": "SPIELBERG  Austria  July 8 Ferrari will trial a new transparent frontal protection cockpit 'shield' in British Grand Prix practice at Silverstone next week  Formula One's governing body said on Saturday.",
        "date": "07082017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "UPDATE 1-Motor racing-Formula One to test 'shield' device at Silverstone "
    },
    {
        "content": "SPIELBERG  Austria  July 8 Ferrari will trial a new transparent frontal protection cockpit 'shield' in British Grand Prix practice at Silverstone next week  Formula One's governing body said on Saturday.",
        "date": "07082017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Motor racing-Formula One to test 'shield' device at Silverstone "
    },
    {
        "content": "* SAYS PAOLA FERRARI DE BENEDETTI HAS SIGNED A CONTRACT FOR THE PURCHASE  THROUGH UNIT ALEVI SRL  OF 5.76 PCT STAKE IN THE COMPANY'S SHARE CAPITAL FOR 3.0 MILLION EUROS",
        "date": "07042017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Paola Ferrari's Alevi acquires 5.76 pct stake in Lucisano Media Group "
    },
    {
        "content": "* Agreements relating to proposed Ferrari dealership were entered into between Ferrari Hk and Blackbird Concessionaires​",
        "date": "06262017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-CCT Fortis says ‍agreements relating to proposed Ferrari dealership were entered into between Ferrari Hk and Blackbird Concessionaires​ "
    },
    {
        "content": "* Group And Ferrari entered into legally binding agreement together with other related documentation in connection with transitional deals Source text for Eikon: Further company coverage:",
        "date": "05262017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Auto Italia and Ferrari enters into legally binding agreement in connection with transitional deals "
    },
    {
        "content": "* Ferrari Chairman Sergio Marchionne says is sincerely hopeful that by 2019 co can offer a hybrid gas-electric vehicle - Conf call Further company coverage:",
        "date": "05042017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari Chairman Sergio Marchionne says hopeful of offering a hybrid gas-electric vehicle by 2019 - Conf call "
    },
    {
        "content": "* Says the brand is capable of expressing itself beyond the 10 000 (shipments) mark  on an annual basis",
        "date": "05042017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari says is capable of going beyond 10 000 shipments mark annually - Conf call "
    },
    {
        "content": "MILAN Italian luxury sportscar maker Ferrari  reported a better-than-expected 36 percent rise in first-quarter core earnings on Thursday and confirmed its full-year guidance  lifting shares up more than 3 percent.",
        "date": "05042017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari first-quarter beats expectations  shares rise 3 percent "
    },
    {
        "content": "* Japanese manufacturer behind others on performance (Adds detail)",
        "date": "04302017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "UPDATE 1-Motor racing-Honda to supply engines to Sauber from 2018 "
    },
    {
        "content": "MILAN/DETROIT  April 26 Fiat Chrysler Automobiles  may seek more supplier partners to help it develop and build self-driving vehicles  Chief Executive Officer Sergio Marchionne said on Wednesday.",
        "date": "04262017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Fiat Chrysler may add more self-driving supplier partners -CEO "
    },
    {
        "content": "ROME Italian investigators said on Tuesday they had foiled a plot to steal the body of legendary Formula One racing pioneer Enzo Ferrari and demand a ransom.",
        "date": "03292017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Italian police foil plot to steal Ferrari founder's body "
    },
    {
        "content": "ROME  March 28 Italian investigators said on Tuesday they had foiled a plot to steal the body of legendary Formula One racing pioneer Enzo Ferrari and demand a ransom.",
        "date": "03282017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Italian police foil plot to steal Ferrari founder's body "
    },
    {
        "content": "MELBOURNE Lewis Hamilton took pole for Mercedes at the season-opening Australian Grand Prix on Saturday but Sebastian Vettel raised hope of a Ferrari renaissance by grabbing a spot on the front row.",
        "date": "03252017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Motor racing: Hamilton grabs pole  Vettel raises Ferrari hopes "
    },
    {
        "content": "* Subsequent to receipt of termination advice  group and Ferrari have been in discussion",
        "date": "03102017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Auto Italia Holdings Ltd updates on entering into term sheet "
    },
    {
        "content": "March 7 Ferrari NV Head of Sales Enrico Galliera says:",
        "date": "03072017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari exec says several models sold out for this year "
    },
    {
        "content": "LONDON Ferrari reserve driver Antonio Giovinazzi will replace Sauber's injured German Pascal Wehrlein at the first pre-season test in Barcelona next week  the Swiss-based Formula One team said on Friday.",
        "date": "02242017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Italian Giovinazzi replaces Wehrlein for F1 test "
    },
    {
        "content": "LONDON Former Ferrari chief aerodynamicist Dirk De Beer is joining Williams on Mar. 1 to head the aero department  the Formula One team said on Thursday.",
        "date": "02162017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Williams hire former Ferrari aerodynamicist "
    },
    {
        "content": "* will present the Ferrari 812 Superfast model at the Geneva auto show in March",
        "date": "02162017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari to launch \"extreme performance\" model at Geneva car show "
    },
    {
        "content": "MILAN Ferrari  shares raced to a new high on Thursday after the Italian sports car maker beat quarterly sales and earnings estimates  and gave stronger than expected forecasts for 2017.",
        "date": "02022017",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari races to new high after earnings top forecast "
    },
    {
        "content": "* Shares jump more than 4 pct  touching new high   (Adds details  trader  analysts  updates shares)",
        "date": "02022017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "UPDATE 1-Ferrari races to new high after earnings top forecast "
    },
    {
        "content": "MILAN  Feb 2 Italian luxury carmaker Ferrari   on Thursday reported a better-than-expected 38 percent rise in fourth-quarter adjusted core earnings and gave a strong guidance for 2017  lifting its shares more than 4 percent.",
        "date": "02022017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari Q4 earnings beat forecasts  shares jump 4 pct "
    },
    {
        "content": "LONDON  Jan 26 BP and its Castrol brand will replace French oil company Total as the Renault Formula One team's official fuel and lubricant supplier this season  both sides said on Thursday.",
        "date": "01262017",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Motor racing-BP replaces Total as Renault F1 fuel partner "
    },
    {
        "content": "* Company is in discussion with Ferrari for transition arrangement",
        "date": "11292016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Auto Italia Holdings says unit received advice from Ferrari to terminate import and distribution rights "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA/LONDON  November 29 (Fitch) Fitch Ratings has revised Fiat Chrysler  Automobiles N.V.'s (FCA) Outlook to Positive from Stable  while affirming the  group's Long-Term Issuer Default Rating (IDR) and senior unsecured rating at  'BB-' and Short-Term IDR at 'B'. The agency has also affirmed Fiat Chrysler  Finance Europe S.A.'s senior unsecured rating at 'BB-'. The rating action reflects Fitch's projections that free cash flow (FCF",
        "date": "11292016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Fitch Revises FCA's Outlook to Positive; Affirms at 'BB-' "
    },
    {
        "content": "AMSTERDAM  Nov 29 The days of the European conglomerate may be numbered  as activist shareholders are pressing diversified groups to spin off secondary businesses and focus on doing one thing well.",
        "date": "11292016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "RPT-Demergers and destruction: activists press Europe conglomerates "
    },
    {
        "content": "AMSTERDAM  Nov 29 The days of the European conglomerate may be numbered  as activist shareholders are pressing diversified groups to spin off secondary businesses and focus on doing one thing well.",
        "date": "11292016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Demergers and destruction: activists press Europe conglomerates "
    },
    {
        "content": "* Jana Partners Llc dissolves common share stake in Ferrari NV  - SEC Filing",
        "date": "11142016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Jana Partners dissolves stake in Ferrari  Macy's "
    },
    {
        "content": "MILAN Italian luxury carmaker Ferrari  could sell more than 10 000 cars a year by 2025  its CEO said on Monday as he signalled a strategy shift after presenting better than expected quarterly earnings and upgraded full-year guidance.",
        "date": "11072016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari chief signals strategy shift  flags potential volume leap "
    },
    {
        "content": "* Group to boost car portfolio first  other luxury products later",
        "date": "11072016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "UPDATE 1-Ferrari chief signals strategy shift  flags potential volume leap "
    },
    {
        "content": "MILAN  Nov 7 Italian luxury carmaker Ferrari   raised its outlook for the year after reporting a better-than-expected 10 percent rise in third-quarter adjusted core earnings on Monday.",
        "date": "11072016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari improves FY guidance after Q3 beats forecasts "
    },
    {
        "content": "* FCA Bank bought majority stake in Ferrari Financial Services GmbH (FFS) for 18.6 million euros",
        "date": "11072016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "BRIEF-FCA Bank buys majority of Ferrari Financial Services for 19 mln eur "
    },
    {
        "content": "Sept 29 Ferrari Head of Sales Enrico Galliera says:",
        "date": "09292016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari exec says company doing very well "
    },
    {
        "content": "PARIS  Sept 29 Ferrari's 1.86 million euro ($2 million) LaFerrari Aperta sports car had sold out before its official debut at the Paris auto show on Thursday - in a sign the super rich still clamour for any special edition of the luxury brand.",
        "date": "09292016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari again bets on special editions as $2 mln Aperta sells out before launch "
    },
    {
        "content": "* Ferrari to produce 209 LaFerrari Aperta special edition cars  200 of which have already been pre-sold while the remainder will be kept in house for anniversary celebrations",
        "date": "09292016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari has pre-sold 550 special edition cars "
    },
    {
        "content": "SPA-FRANCORCHAMPS  Belgium Kimi Raikkonen set the pace for Ferrari in the final practice session for Sunday’s Belgian Formula One Grand Prix.",
        "date": "08272016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Raikkonen fastest in final Belgian GP practice "
    },
    {
        "content": "* CEO says considers FY guidance \"minimum point\"   (Recasts after conference call  adds details  analysts  CEO comments)",
        "date": "08022016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "UPDATE 2-Ferrari's supercar sales fuel Q2 earnings beat "
    },
    {
        "content": "* up 0.5 pct at 1342 GMT  Source text for Eikon:  Further company coverage:    (Reporting by Milan newsroom)",
        "date": "08022016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari shares in Milan turn positive after Q2 results "
    },
    {
        "content": "July 25 Italy's Agnelli family holding company Exor says:",
        "date": "07252016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Italy's Exor to fold into new Dutch holding company "
    },
    {
        "content": "WASHINGTON  July 20 Daimler AG's Mercedes-Benz and Daimler Vans units and Ferrari NV are among a small group of automakers selling some new vehicles with faulty Takata airbags that will be subject to recalls by the end of 2018  a Senate report released said Wednesday.",
        "date": "07202016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Daimler AG  Ferrari selling some new vehicles with faulty air bags - Senate report "
    },
    {
        "content": "* As part of the sponsorship deal  the Ray-Ban logo will appear on SF16-H Formula One cars  starting from the British Grand Prix in Silverstone  Further company coverage:      (Reporting by Milan newsroom)",
        "date": "07072016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Luxottica agrees sponsorship deal with Ferrari "
    },
    {
        "content": "LONDON  June 14 Dutch brewer Heineken's sponsorship deal with Formula One    announced last week  has led to renewed calls from European  campaigners for a ban on alcohol sponsorship in the sport.",
        "date": "06132016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Motor racing-Heineken F1 deal triggers new call for alcohol ban "
    },
    {
        "content": "MONTREAL Ferrari's Sebastian Vettel was fastest in final practice for the Canadian Formula One Grand Prix on Saturday  with the session cut short after Renault's Kevin Magnussen crashed into the wall.",
        "date": "06112016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Vettel fastest in shortened final Canada GP practice "
    },
    {
        "content": "BARCELONA Formula One championship leader Nico Rosberg set the pace in Friday practice for a Spanish Grand Prix that could see the Mercedes driver celebrate his eighth win in a row.",
        "date": "05132016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Rosberg leads on 'tricky' day for Hamilton "
    },
    {
        "content": "MILAN Italian luxury carmaker Ferrari  on Monday nudged up its full-year earnings forecast after a stronger-than expected first quarter  helped by higher shipments and better margins.",
        "date": "05022016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari nudges up earnings view  Marchionne becomes CEO "
    },
    {
        "content": "MILAN Ferrari  Chairman Sergio Marchionne will also become the luxury carmaker's chief executive after Amedeo Felisa's decision to retire  the company said in a statement on Monday.",
        "date": "05022016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Marchionne to succeed Felisa as Ferrari CEO "
    },
    {
        "content": "* Ferrari NV is set to appoint chairman Sergio Marchionne to replace Amedeo Felisa as Chief Executive Officer - Bloomberg  citing sources",
        "date": "05022016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari to replace Amedeo Felisa with Marchionne as CEO - Bloomberg  citing sources "
    },
    {
        "content": "SOCHI  Russia Ferrari are still waiting to take the fight to Formula One champions Mercedes after a Russian Grand Prix that left even their dominant rivals surprised by the gap in performance.",
        "date": "05022016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Mercedes surprised by Ferrari's lack of pace "
    },
    {
        "content": "* Says Board of Directors authorized purchase of common shares up to a maximum of 10% of Ferrari's common shares",
        "date": "04152016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari NV says Board authorized purchase of up to a maximum of 10% of common shares "
    },
    {
        "content": "April 15 Ferrari Chairman Sergio Marchionne tells shareholders during an annual general meeting in Amsterdam:",
        "date": "04152016",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari to raise production if market conditions right - chairman "
    },
    {
        "content": "Statistics for Sunday's Chinese Formula One Grand Prix  the third race of the 21-round season:",
        "date": "04132016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Statistics for the Chinese Grand Prix "
    },
    {
        "content": "* Says \u007fannounces Settlement Of Its Inaugural Issue Of Eur 500 Mln Principal Amount Of 7 Year fixed-rate notes with a coupon of 1.50% due 2023\u007f  Source text for Eikon:  Further company coverage:",
        "date": "03162016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari announces settlement of issue of EUR 500 mln notes "
    },
    {
        "content": "MILAN Italian carmaker Ferrari   gave a cautious outlook for its financial performance this year  its first as a standalone company  as growth in sales of its supercars is expected to slow  pushing its shares to record lows.",
        "date": "02022016",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari gives cautious forecast for 2016  shares slide "
    },
    {
        "content": "SAN FRANCISCO Short sellers waiting for recently listed shares of Ferrari NV  to swerve off the road may soon face higher costs to maintain their bets on the luxury sportscar maker.",
        "date": "12292015",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari short sellers face higher costs; shares in short supply "
    },
    {
        "content": "SAN FRANCISCO  Dec 29 Short sellers waiting for recently listed shares of Ferrari NV to swerve off the road may soon face higher costs to maintain their bets on the luxury sportscar maker.",
        "date": "12292015",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "REFILE-Ferrari short sellers face higher costs; shares in short supply "
    },
    {
        "content": "MILAN The top two investors in Ferrari  have signed a shareholder pact giving them a total voting power of nearly 50 percent to keep firm grip on the sports car maker after it separates from Fiat Chrysler Automobiles .",
        "date": "12232015",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Top two Ferrari investors sign pact over 48.8 percent of voting rights "
    },
    {
        "content": "Ferrari president Sergio Marchionne says he has seen a new Kimi Raikkonen emerge this year and believes the 2007 Formula One world champion could be set for a 'phenomenal' 2016.",
        "date": "12142015",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari boss sees 'phenomenal' Raikkonen in 2016 "
    },
    {
        "content": "Fiat Chrysler could bring the Alfa Romeo brand back to Formula One as a competitor to Ferrari  chief executive Sergio Marchionne said on Monday.",
        "date": "12142015",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Alfa Romeo could return to F1  says Marchionne "
    },
    {
        "content": "Dec 14 Fiat Chrysler could bring the Alfa Romeo brand back to Formula One as a competitor to Ferrari  chief executive Sergio Marchionne said on Monday.",
        "date": "12142015",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Motor racing-Alfa Romeo could return to F1  says Marchionne "
    },
    {
        "content": "* Determined number of Ferrari shares it will deliver to holders of its mandatory convertible bond due in 2016",
        "date": "12142015",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "BRIEF-Fiat Chrysler sets ratio of Ferrari shares to convertible notes "
    },
    {
        "content": "MILAN Luxury carmaker Ferrari  is giving its employees a Christmas treat  awarding them a 5 000 euro ($5 450) bonus each to thank them for this year's financial results and a successful Wall Street debut  a spokesman said on Friday.",
        "date": "12042015",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari workers get 5 000 euro bonus after share sale "
    },
    {
        "content": "* Shareholders approve Ferrari demerger   (Adds details  quotes  shares)",
        "date": "12032015",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "UPDATE 2-Fiat Chrysler to focus on growth plan as GM merger hopes fade "
    },
    {
        "content": "AMSTERDAM  Dec 3 Fiat Chrysler Automobiles (FCA)  investors on Thursday approved the demerger of Ferrari  from the group  paving the way for Italy's Agnelli family to become the luxury sportscar maker's biggest shareholder.",
        "date": "12032015",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Fiat Chrysler shareholders approve de-merger of Ferrari from group "
    },
    {
        "content": "MILAN Luxury sports car maker Ferrari  has signed contracts to raise 2.5 billion euros in debt which will use in part to refinance debt owed to Fiat Chrysler Automobiles  as it moves towards separation from its parent company.",
        "date": "11302015",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari gets 2.5 billion euros in funding "
    },
    {
        "content": "MILAN  Nov 30 Luxury sports car maker Ferrari  has signed contracts to raise 2.5 billion euros in debt which will use in part to refinance debt owed to Fiat Chrysler Automobiles as it moves towards separation from its parent company.",
        "date": "11302015",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari gets 2.5 bln euros in funding "
    },
    {
        "content": "* Luxury sports car unit Ferrari filed a request to list its shares on the Milan stock exchange",
        "date": "11232015",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Ferrari applies to list shares on the Milan bourse "
    },
    {
        "content": "MILAN Luxury carmaker Ferrari   which debuted on Wall Street last week  on Wednesday reported a 22 percent rise in third-quarter adjusted core profit  as a jump in sportscar shipments offset lower sales of engines to sister brand Maserati.",
        "date": "10282015",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari third-quarter earnings jump on higher vehicle shipments "
    },
    {
        "content": "MILAN  Oct 28 Luxury carmaker Ferrari  which debuted on Wall Street last week  on Wednesday reported a 22 percent rise in third-quarter adjusted core profit  as a jump in sportscar shipments offset lower sales of engines to sister brand Maserati.",
        "date": "10282015",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari Q3 earnings jump on higher vehicle shipments "
    },
    {
        "content": "* Calls extraordinary shareholder meeting for Dec. 3 in Amsterdam to approve separation of Ferrari",
        "date": "10222015",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "BRIEF-Fiat Chrysler calls meeting to vote on Ferrari separation "
    },
    {
        "content": "NEW YORK/MILAN Ferrari  shares jumped 15 percent to $60 on its Wall Street debut on Wednesday after the Italian supercar maker priced its share offering at the top of the range amid heavy investor demand. | Video ",
        "date": "10212015",
        "name": "Ferrari NV",
        "news_type": "topStory",
        "symbol": "RACE",
        "title": "Ferrari shares race ahead 15 percent on Wall Street debut "
    },
    {
        "content": "MILAN  Oct 21 Shares in Ferrari rose 15 percent to $60 in the luxury group's Wall Street debut on Wednesday after it priced its share offering at the top end of an indicated range as investors vied to grab a slice of the maker of sportscars for the super rich.",
        "date": "10212015",
        "name": "Ferrari NV",
        "news_type": "normal",
        "symbol": "RACE",
        "title": "Ferrari shares race 15 pct in Wall Street debut "
    }
]