[
    {
        "content": "* Chief risk officer David Stephen leaving to take role outside the bank",
        "date": "11102017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Chief risk officer at Britain's RBS leaves bank "
    },
    {
        "content": "LONDON  Oct 31 Britain's Royal Bank of Scotland has put around 200 million pounds ($265 million) worth of offshore assets from its asset financing group Lombard up for sale  a source close to the matter said on Tuesday.",
        "date": "10312017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS sells leasing unit Lombard assets to meet ring-fencing rules "
    },
    {
        "content": "LONDON The head of Britain's financial watchdog told Royal Bank of Scotland  to speed up its handling of compensation claims related to its treatment of struggling businesses during the financial crisis.",
        "date": "10312017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS told to get act together on compensating small businesses "
    },
    {
        "content": "* Has set aside 400 million pounds to cover redress (Adds more detail  RBS  small business comments)",
        "date": "10312017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS told to get act together on compensating small businesses "
    },
    {
        "content": "LONDON  Oct 31 The head of Britain's financial watchdog said on Tuesday that it is \"unfortunate\" that the Royal Bank of Scotland does not more readily accept strong criticisms made in a report on its treatment of struggling businesses during and after the financial crisis.",
        "date": "10312017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS should accept criticisms in report \"more readily\" - Britain's FCA chief "
    },
    {
        "content": "LONDON Royal Bank of Scotland  raised income and cut costs in the third quarter to deliver a forecast-beating operating profit which lifted shares in the state-owned bank on Friday.",
        "date": "10272017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS springs quarterly profit surprise on rising revenue "
    },
    {
        "content": "LONDON  Oct 27 British stocks followed European indexes higher on Friday  driven by a weakening pound and a rise in RBS  which helped outweigh falls among mining stocks and British Airways owner IAG.",
        "date": "10272017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS  Sterling supports FTSE as IAG  miners drag on UK index "
    },
    {
        "content": "* Shares up 2.2 percent at 0746 GMT (Adds CEO comment  analyst comment and share price)",
        "date": "10272017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS springs quarterly profit surprise on rising revenue "
    },
    {
        "content": "* ‍net interest margin (nim) reduced by 1 basis point to 2.12​",
        "date": "10272017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS ‍net interest margin reduced by 1 basis point to 2.12 pct​ "
    },
    {
        "content": "Royal Bank of Scotland Group Plc  agreed to pay more than $44 million and enter a non-prosecution agreement to settle a U.S. Department of Justice criminal probe of traders accused of defrauding customers on bond prices.",
        "date": "10262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to pay $44 million to settle U.S. charges it defrauded customers "
    },
    {
        "content": "Oct 26 Royal Bank of Scotland Group Plc agreed to pay more than $44 million and enter a non-prosecution agreement to settle a U.S. Department of Justice criminal probe of traders accused of defrauding customers on bond prices.",
        "date": "10262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS to pay $44 mln to settle U.S. charges it defrauded customers "
    },
    {
        "content": "LONDON  Oct 23 Britain's financial watchdog is considering further action against Royal Bank of Scotland (RBS) for its treatment of struggling companies during and after the financial crisis.",
        "date": "10232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-Britain's FCA weighs further action over RBS small business treatment "
    },
    {
        "content": "* SAYS SUBSIDIARIES HAVE TODAY ENTERED INTO AN AGREEMENT TO DISPOSE OF RBS' ENTIRE SHAREHOLDINGS IN EUROCLEAR PLC TO INTERCONTINENTALEXCHANGE HOLDINGS​",
        "date": "10242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Royal Bank Of Scotland says disposal of shareholdings in Euroclear plc "
    },
    {
        "content": "Oct 26 A unit of Royal Bank of Scotland Group Plc has agreed to pay more than $44 million and enter a non-prosecution agreement to settle a U.S. criminal probe into fraudulent trading through a now-defunct bond trading group.",
        "date": "10262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to pay more than $44 mln to settle U.S. trading fraud probe "
    },
    {
        "content": "LONDON  Oct 23 Royal Bank of Scotland said on Monday the potential bill for claims against its small business restructuring division will remain at 400 million pounds ($528 million) after misconduct allegations against it were dismissed by Britain's financial regulator.",
        "date": "10232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS keeps compensation pot for restructuring claims at 400 mln pounds "
    },
    {
        "content": "Oct 24 The Financial Conduct Authority (FCA) is considering widening the Ombudsman service to small and medium-sized UK companies (SME) in its interim report that highlights the mistreatment of customers by Royal Bank of Scotland’s Global Restructuring Group (GRG).",
        "date": "10242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "LPC-FCA to extend Ombudsman service to UK middle market firms "
    },
    {
        "content": "Oct 26 U.S. ATTORNEY SAYS SETTLEMENT RELATES TO RBS' FRAUDULENT TRADING THROUGH ITS NOW-DEFUNCT U.S. ABS  MBS AND CMBS TRADING GROUP U.S. ATTORNEY SAYS AFFECTED CUSTOMERS INCLUDED FIRMS AFFILIIATED WITH RECIPIENTS OF FEDERAL BAILOUT MONEY THROUGH TROUBLED ASSET RELIEF PROGRAM U.S. ATTORNEY SAYS SETTLEMENT ADDRESSES ONLY RBS' CORPORATE CRIMINAL LIABILITY  AND THAT A CRIMINAL PROBE OF INDIVIDUALS ASSOCIATED WITH BANK'S TRADING REMAINS OPEN RBS SECURITIES ENTERS NONPROSECUTION AGREEMENT",
        "date": "10262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS to pay more than $44 mln  enter U.S nonprosecution agreement over trading "
    },
    {
        "content": "* UK'S FCA - UPDATE ON THE FCA'S REVIEW OF RBS'S TREATMENT OF SME CUSTOMERS REFERRED TO ITS GLOBAL RESTRUCTURING GROUP‍​",
        "date": "10232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-UK's FCA updates on review of RBS's treatment of SME customers "
    },
    {
        "content": "LONDON  Oct 17 Britain's Financial Conduct Authority has agreed to allow a confidential report on the Royal Bank of Scotland's treatment of struggling companies to be scrutinised by a barrister  lawmakers said on Tuesday.",
        "date": "10172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-British financial watchdog consents to scrutiny of confidential RBS report "
    },
    {
        "content": "LONDON  Oct 17 Britain's Financial Conduct Authority has agreed to allow a confidential report into the Royal Bank of Scotland's treatment of struggling companies to be scrutinised  lawmakers said on Tuesday.",
        "date": "10172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's financial watchdog consents to scrutiny of confidential RBS report "
    },
    {
        "content": "LONDON  Oct 13 British lawmakers have hired a barrister to check if a summary of a report by regulators into how Royal Bank of Scotland treated companies in difficulties is comprehensive and fair.",
        "date": "10122017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK lawmakers pile pressure on watchdog over RBS report "
    },
    {
        "content": "NEW YORK  Sept 28 Nomura Holdings Inc and Royal Bank of Scotland Group Plc lost a U.S. court appeal on Thursday to overturn an order requiring them to pay $839 million for making false statements while selling mortgage-backed securities to Fannie Mae and Freddie Mac.",
        "date": "09282017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "REFILE-Nomura  RBS lose bid to overturn $839 million mortgage bond award "
    },
    {
        "content": "NEW YORK Nomura Holdings Inc  and Royal Bank of Scotland Group Plc  lost a U.S. court appeal on Thursday to overturn an order requiring them to pay $839 million for making false statements while selling mortgage-backed securities to Fannie Mae  and Freddie Mac.",
        "date": "09282017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Nomura  RBS lose bid to overturn $839 million mortgage bond award "
    },
    {
        "content": "* Announces allotment  issue of 56.6 million new ordinary shares of co at subscription price of 256.0266 pence per new share‍​ Source text for Eikon: (http://bit.ly/2hyWhvM) Further company coverage:",
        "date": "09282017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS announces allotment  issue of new ordinary shares "
    },
    {
        "content": "LONDON The story dated Sept. 22 and headlined \"Litigation costs to rub salt in RBS investor wounds\" is withdrawn. Reuters is withdrawing this story to avoid leaving any readers with a misimpression about the litigation costs related to the case.",
        "date": "09262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Story withdrawn on RBS case litigation costs "
    },
    {
        "content": "* A cheque could be in post by Christmas (Adds comment from institutional claimant Manx in paragraphs 11 and 12)",
        "date": "09232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-Litigation costs to rub salt in RBS investor wounds "
    },
    {
        "content": "LONDON Some RBS shareholders  who lost most of their money after a credit crisis-era rights issue  could receive less than a quarter of their settlement after litigation costs  according to a letter seen by Reuters.",
        "date": "09252017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Litigation costs to rub salt in RBS investor wounds "
    },
    {
        "content": "Sept 25 Britain's FTSE 100 index is seen opening down 9 points at 7 301.4 on Monday  according to financial bookmakers  with futures down 0.27 percent ahead of the cash market open.",
        "date": "09252017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Sept 25 "
    },
    {
        "content": "    Sept 25 Britain's FTSE 100 index is seen opening down 9 points at 7 301.4 on Monday  according to financial bookmakers          * SHELL:  Iraqi oil minister Jabar al-Luaibi said on Sunday talks are continuing with Royal Dutch Shell on the Majnoon oil field that the company is said to be seeking to quit.     * RBS: Some RBS shareholders  who lost most of their money after a credit crisis-era rights issue  could receive less than a quarter of their settlement after litigation costs",
        "date": "09252017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK Stocks-Factors to watch on Sept 25 "
    },
    {
        "content": "* RBS chief executive Ross McEwan told LBC radio he is not interested in running Commonwealth Bank of Australia after media reports linked him to the role",
        "date": "09222017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-RBS CEO denies interest in running Commonwealth Bank of Australia "
    },
    {
        "content": "LONDON  Sept 22 Royal Bank of Scotland Chief Executive Ross McEwan said the company will enact its Brexit plans by the end of March 2018 if no clarity emerges about Britain's ability to retain access to the European single market when it leaves the EU.",
        "date": "09222017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS CEO will enact Brexit plans by March 2018 if no sign of a deal "
    },
    {
        "content": "* Refusal to publish \"smacks of cover up\" -lawmaker (Adds small business reaction)",
        "date": "09152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-UK watchdog rejects call to publish RBS report in full "
    },
    {
        "content": "BRUSSELS  Sept 18 European Union regulators approved a British plan allowing bailed-out Royal Bank of Scotland to support smaller alternative banks with funds totalling around 835 million pounds ($1.1 billion) to encourage competition.",
        "date": "09182017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "EU gives nod to RBS competition plan  lifting state aid curbs "
    },
    {
        "content": "* A PLAN TO RESOLVE RBS' FINAL STATE AID COMMITMENT HAS BEEN AGREED IN PRINCIPLE BETWEEN THE UK GOVERNMENT AND THE EU COMMISSION‍​",
        "date": "09182017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-UK government backs RBS's plan to help challenger banks "
    },
    {
        "content": "BRUSSELS  Sept 18 EU state aid regulators formally approved on Monday a British plan allowing bailed-out lender Royal Bank of Scotland to fund about 835 million pounds ($1.1 billion) to boost competition by helping challenger banks.",
        "date": "09182017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "EU regulators approve RBS plan to help challenger banks "
    },
    {
        "content": "LONDON  Sept 7 Britain's financial regulator is facing growing pressure to release a leaked report about Royal Bank of Scotland that alleged many companies suffered from \"inappropriate action\" by its Global Restructuring Group unit.",
        "date": "09072017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-UK regulator urged to release report into RBS's turnaround unit "
    },
    {
        "content": "LONDON  Sept 7 Britain's financial regulator should release a leaked report about Royal Bank of Scotland that alleged many companies suffered from \"inappropriate action\" by its Global Restructuring Group unit  a senior British lawmaker said.",
        "date": "09062017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UK regulator urged to release report into RBS's turnaround unit "
    },
    {
        "content": "LONDON  Aug 23 Royal Bank of Scotland has settled a legal case with a businessman who alleged that the bank caused his business to go bankrupt after forcing him to take out interest-rate hedging products while manipulating the benchmark.",
        "date": "08232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS settles businessman's claim that bank wrecked property business "
    },
    {
        "content": "LONDON Britain's Royal Bank of Scotland plans to cut around 900 technology jobs at its London office by 2020  in its latest plan to reduce costs  the Unite union said  although the bank said no figures had been finalised.",
        "date": "08152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Royal Bank of Scotland to cut 880 IT jobs by 2020: union "
    },
    {
        "content": "LONDON  Aug 15 Britain's Royal Bank of Scotland plans to cut around 900 technology jobs at its London office by 2020  in its latest plan to reduce costs  the Unite union said  although the bank said no figures had been finalised.",
        "date": "08152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-Royal Bank of Scotland to cut 880 IT jobs by 2020 - union "
    },
    {
        "content": "Aug 15 UK labour union Unite said on Tuesday that Royal Bank of Scotland Group had informed staff of a further 40 percent cut in IT jobs at the bank's London office by 2020.",
        "date": "08152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK's Unite labour union says RBS bank to cut 880 IT jobs by 2020 "
    },
    {
        "content": "* UK'S UNITE -  ROYAL BANK OF SCOTLAND TOLD STAFF ON AUG.15 THAT IT WILL BE CUTTING A FURTHER 40 PER CENT OF PERMANENT STAFF FROM ITS LONDON IT FUNCTION BY 2020",
        "date": "08152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-UK's Unite says RBS to cut 40 pct IT staff by 2020 "
    },
    {
        "content": "LONDON  Aug 10 (IFR) - NatWest Markets has hired Barbara Scalongne to work as a director in its financial institution origination and solutions business  Spain.",
        "date": "08102017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-MOVES-NatWest Markets bolsters FIG franchise with Scalongne hire "
    },
    {
        "content": "* Royal Bank of Scotland Group plc (\"RBSG\") has given notice to holders of redemption of certain series of non-cumulative dollar preference shares",
        "date": "08072017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-Royal Bank of Scotland to redeem $1.21 bln dollar preference shares "
    },
    {
        "content": "* Royal Bank of Scotland Group plc (\"RBSG\") has given notice to holders of redemption of certain series of non-cumulative dollar preference shares",
        "date": "08072017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-Royal Bank of Scotland to redeem $1.21 dollar preference shares "
    },
    {
        "content": "LONDON Royal Bank of Scotland beat first-half profit forecasts on Friday in a sign its long-promised recovery is finally gathering pace  and said it may move up to around 150 jobs to Amsterdam after Brexit. | Video ",
        "date": "08042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS makes first-half profit  may move some jobs to Amsterdam "
    },
    {
        "content": "London 2017 (Reuters Breakingviews) - The Bible admonishes the unfairly smitten to turn the other cheek in order to reach paradise. Royal Bank of Scotland shareholders  who have borne repeated slaps in the face in the form of heavy and recurring losses since the financial crisis  are no strangers to pain in pursuit of salvation. On Friday there was evidence that deliverance  in the form of dividends  may be nearer at hand.",
        "date": "08042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Robust retail bank helps RBS profit from atonement "
    },
    {
        "content": "* Surprise 44 pct boost in NatWest Markets income (Repeats to additional clients. Adds investment bank performance  updates shares)",
        "date": "08042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RPT-UPDATE 3-RBS makes first-half profit  may move some jobs to Amsterdam "
    },
    {
        "content": "LONDON  Aug 4 Falls among housebuilders on Friday dampened an otherwise strong week for the UK's top share index  with lender Royal Bank of Scotland among top performers after a strong set of results.",
        "date": "08042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's FTSE slips as homebuilders crumble; RBS shines "
    },
    {
        "content": "LONDON  Aug 4 (IFR) - Royal Bank of Scotland could add 150 staff to its Amsterdam operation as NatWest Markets  its investment bank arm  will use a Netherlands licence to deal with Britain's exit from the European Union.",
        "date": "08042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS plans Amsterdam hub for NatWest Markets after Brexit "
    },
    {
        "content": "* US jobs data in focus later on today (Adds details  updates price)",
        "date": "08042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "European shares weighed by Swiss Re in busy earnings day; RBS up "
    },
    {
        "content": "LONDON Royal Bank of Scotland is in discussions with the Dutch central bank to use the Netherlands as its trading base in the European Union once Britain leaves the bloc  the bank said on Friday.",
        "date": "08042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS plans to make Amsterdam its EU base after Brexit "
    },
    {
        "content": "LONDON  Aug 4 Royal Bank of Scotland is in discussions with the Dutch central bank to use the Netherlands as its trading base in the European Union once Britain leaves the bloc  the bank said on Friday.",
        "date": "08042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "REFILE-RBS plans to make Amsterdam its EU base after Brexit "
    },
    {
        "content": "LONDON  Aug 4 Royal Bank of Scotland swung to a profit in the first half of the year  it said on Friday  as its recovery continued following a 2 billion pound ($2.65 billion)loss in the same period last year amid hefty restructuring and legal costs.",
        "date": "08042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS swings to first-half profit as recovery continues "
    },
    {
        "content": "LONDON The European Commission has accepted the British government's plans to free Royal Bank of Scotland  from an obligation to sell more than 300 branches bringing to an end the bank's seven-year struggle to meet conditions for its bailout.",
        "date": "07262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UK in $1.1 billion deal with EU to settle RBS state aid issues "
    },
    {
        "content": "LONDON The European Commission has accepted the British government's plans to free Royal Bank of Scotland from an obligation to sell more than 300 branches bringing to an end the bank's seven-year struggle to meet conditions for its bailout.",
        "date": "07262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK in $1.1 bln deal with EU to settle RBS state aid issues "
    },
    {
        "content": "LONDON  July 26 The European Commission has accepted the British government's plans to free Royal Bank of Scotland from an obligation to sell more than 300 branches bringing to an end the bank's seven-year struggle to meet conditions for its bailout.",
        "date": "07262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-UK in $1.1 bln deal with EU to settle RBS state aid issues "
    },
    {
        "content": "LONDON  July 26 The British government said on Wednesday that the European Commission had accepted its plans to free Royal Bank of Scotland from its obligation to sell more than 300 branches after the lender's seven-year struggle to meet bailout requirements.",
        "date": "07262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "CORRECTED-UK agrees $1.1 bln deal with EU to settle RBS state aid concerns "
    },
    {
        "content": "* BEEN INFORMED BY HM TREASURY THAT AN ALTERNATIVE REMEDIES PACKAGE HAS NOW BEEN AGREED IN PRINCIPLE BETWEEN HMT AND EC COMMISSIONER RESPONSIBLE FOR COMPETITION",
        "date": "07262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-Royal Bank Of Scotland updates on remaining state aid obligation "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  July 13 (Fitch) Royal Bank of Scotland Group's GBP4.2 billion settlement with the Federal Housing Finance Agency (FHFA) for claims related to its issuance and underwriting of US RMBS removes a key uncertainty for the bank  Fitch Ratings says. Uncertainty about the size and timing of the conduct fines RBS faces  together with other legacy issues  has been weighing on its capital management and delaying its resumption of dividends",
        "date": "07132017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Fitch: FHFA Settlement Removes a Further Key RBS Uncertainty "
    },
    {
        "content": "* Company has agreed to acquire  and RBS has agreed to sell  33.3% of equity interest in Hua Ying Securities Source text for Eikon: Further company coverage:",
        "date": "07062017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Guolian Securities Co enters equity transfer agreement with RBS "
    },
    {
        "content": "LONDON/NEW YORK Royal Bank of Scotland  will pay $5.5 billion to settle one of the two major U.S. investigations into allegations it mis-sold mortgage-backed bonds that it needs to resolve before the British government can sell its shares. | Video ",
        "date": "07122017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to pay $5.5 billion to resolve major U.S. mortgage probe "
    },
    {
        "content": "LONDON/NEW YORK  July 12 Royal Bank of Scotland will pay $5.5 billion to settle one of two major U.S. investigations into allegations it mis-sold mortgage-backed bonds that it needs to resolve before the British government can sell its shares.",
        "date": "07122017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to pay $5.5 bln to resolve major U.S. mortgage case "
    },
    {
        "content": "LONDON/NEW YORK  July 12 Royal Bank of Scotland will pay $5.5 billion to settle one of two major U.S. investigations into allegations it mis-sold mortgage-backed bonds that it needs to resolve before the British government can sell its shares.",
        "date": "07122017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS to pay $5.5 bln to resolve major U.S. mortgage case "
    },
    {
        "content": "July 12 Freddie mac to receive about $4.525 bln  fannie mae to receive about $975 mln in royal bank of scotland settlement -- u.s. Fhfa FEDERAL HOUSING FINANCE AGENCY SAYS SETTLEMENT RESOLVES ALL CLAIMS IN 2011 LAWSUIT IT FILED AGAINST RBS SETTLEMENT AGREEMENT CONTAINS NO ADMISSION OF LIABILITY  AND SAYS RBS VIGOROUSLY DENIES THE ALLEGATIONS MADE IN THE FHFA LAWSUIT",
        "date": "07122017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-U.S. FHFA details breakdown of $5.5 bln RBS settlement  says bank denies wrongdoing "
    },
    {
        "content": "LONDON  July 12 xx Royal Bank of Scotland will pay $5.5 billion to settle one of the two major U.S. investigations into allegations it mis-sold mortgage-backed bonds that it needs to resolve before the government can sell its shares in the bailed-out bank.",
        "date": "07122017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to pay $5.5 bln to resolve major U.S. mortgage probe "
    },
    {
        "content": "* To be sole provider of life insurance products for rbs   natwest and ulster ni banking customers-aig Further company coverage: (Reporting By Carolyn Cohn)",
        "date": "07032017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-AIG to provide life insurance products for RBS  Natwest customers "
    },
    {
        "content": "LONDON  June 30 Tesco Bank  owned by Britain's biggest retailer Tesco  is no longer allowing customers to buy or sell Qatari riyals at its stores  a spokesman for the retailer said on Friday. (Reporting By Andrew MacAskill; editing by Carolyn Cohn)",
        "date": "06302017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Britain's Tesco bank has stopped selling Qatari riyals at its stores "
    },
    {
        "content": "June 25 British lender Royal Bank of Scotland is planning to cut 443 jobs dealing with business loans and many of them will move to India  the bank said.",
        "date": "06252017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to cut 443 jobs in UK  move many of them to India "
    },
    {
        "content": "* Rating action reflects Moody's expectation for more stable performance in medium term resulting from group's multi-year restructuring",
        "date": "06152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Royal Bank Of Scotland welcomes credit rating upgrade by Moody's "
    },
    {
        "content": "* Mining and energy stocks also weigh (Adds details  updates prices)",
        "date": "06152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK mid-caps set for biggest one-day drop this year as dark skies gather "
    },
    {
        "content": "* Royal Bank of Scotland closing on a multibillion pound settlement with a U.S. Regulator over mis-selling of toxic mortgage bonds - Sky News Source text : http://bit.ly/2rT0Ofr Further company coverage:",
        "date": "06122017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-RBS closing on a multibillion pound settlement with U.S. regulator over mis-selling of toxic mortgage bonds - Sky News "
    },
    {
        "content": "A federal appeals court has declined to revive a Pittsburgh hotel consortium's lawsuit claiming that Royal Bank of Scotland drove it into bankruptcy by manipulating benchmark interest rates  which raised the cost of a business loan.",
        "date": "06152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "2nd Circuit declines to revive rate-rigging lawsuit against RBS "
    },
    {
        "content": "* Talks between RBS CEO Ross McEwan and RBoS shareholder action group ended on Friday without a deal- Sky News  citing sources Source http://bit.ly/2rstIkz",
        "date": "06022017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Talks between RBS CEO and RBoS shareholder action group ended without a deal- Sky News  citing sources "
    },
    {
        "content": "LONDON Royal Bank of Scotland  is set to face a trial it had hoped to avert over its 2008 share sale  as the last group of holdout investors in the case secured the funds they need to proceed to trial  a source involved in the claim said on Monday.",
        "date": "06052017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS braces for trial over 2008 share sale case "
    },
    {
        "content": "LONDON A London High Court judge on Wednesday called off a trial due to begin on Wednesday in a long-running investor lawsuit against Royal Bank of Scotland  over its 2008 rights issue that would have called disgraced former CEO Fred Goodwin to testify.",
        "date": "06072017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Judge leaves door ajar to more RBS hearings on 2008 cash call "
    },
    {
        "content": "LONDON Rebel RBS shareholders  who had been determined to bring the bank and former CEO Fred Goodwin to court over losses related to a 2008 rights issue  are set to agree to a settlement and the case is likely to be dropped  sources said on Tuesday.",
        "date": "06062017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS investor settlement over 2008 cash call back on track- sources "
    },
    {
        "content": "LONDON  June 5 Royal Bank of Scotland is set to face a trial it had hoped to avert over its 2008 share sale  as the last group of holdout investors in the case secured the funds they need to proceed to trial  a source involved in the claim said on Monday.",
        "date": "06052017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS braces for trial over 2008 share sale case "
    },
    {
        "content": "LONDON  June 1 A breakaway faction of shareholders in Royal Bank of Scotland is seeking extra time to raise cash for a trial that would call disgraced former CEO Fred Goodwin to account over the bank's 12 billion pound cash call in the 2008 financial crisis.",
        "date": "06012017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS investors seek extra time to raise cash for trial "
    },
    {
        "content": "* RBS says no outstanding claimants want to continue claim (Adds RBS comment  further quotes  details)",
        "date": "06072017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-Judge leaves door ajar to more RBS hearings on 2008 cash call "
    },
    {
        "content": "LONDON Rebel RBS shareholders  who had been determined to bring the bank and former CEO Fred Goodwin to court over losses related to a 2008 rights issue  are set to agree to a settlement and the case is likely to be dropped  sources said on Tuesday.",
        "date": "06062017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS investor settlement over 2008 cash call back on track: sources "
    },
    {
        "content": "LONDON  June 5 Royal Bank of Scotland is refusing to raise its offer to shareholders still suing the bank over its 2008 share sale  sources with knowledge of the matter said  leaving the claimants in a race to raise 3 million pounds ($3.9 million) to proceed with the case.",
        "date": "06052017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS claimants face dash for funding as bank refuses to up settlement "
    },
    {
        "content": "June 7 A London High Court judge on Wednesday called off a trial due to begin on Wednesday in a drawn-out investor lawsuit against Royal Bank of Scotland over its 2008 rights issue that would have called disgraced former CEO Fred Goodwin to testify.",
        "date": "06072017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "London Judge calls off RBS trial  leaves door open to further hearings "
    },
    {
        "content": "LONDON  June 6 Rebel RBS shareholders  who had been determined to bring the bank and former CEO Fred Goodwin to court over losses related to a 2008 rights issue  are set to agree to a settlement and the case is likely to be dropped  sources said on Tuesday.",
        "date": "06062017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS investor settlement over 2008 cash call back on track- sources "
    },
    {
        "content": "* Settlement would spare RBS long  costly trial (Adds detail  background)",
        "date": "05312017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS in settlement talks with holdouts in rights issue case "
    },
    {
        "content": "LONDON  May 29 A group representing Royal Bank of Scotland investors has accepted an out-of-court deal to settle a lawsuit that was set to call disgraced former CEO Fred Goodwin to account over a 12 billion pound ($15 billion) cash call in 2008.",
        "date": "05292017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS investor group accepts offer to end lawsuit over 2008 cash call "
    },
    {
        "content": "LONDON  June 6 Royal Bank of Scotland has reached an out-of-court deal to settle a costly and embarrassing lawsuit alleging it misled investors during a 12 billion pound ($16 billion) cash call launched just before its near collapse in 2008  sources said.",
        "date": "06062017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS settles landmark lawsuit over 2008 cash call - sources "
    },
    {
        "content": "LONDON  June 7 A lawyer for shareholders in RBS   who are suing the bank over losses related to its 2008 rights issue  has asked a London High Court judge to call off a trial because a majority of investors had agreed to an out-of-court settlement.",
        "date": "06072017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Lawyer for RBS investors wants trial over 2008 rights issue called off "
    },
    {
        "content": "LONDON  May 31 Royal Bank of Scotland Group is in fresh talks with the last remaining claimants in a lawsuit over its 2008 fundraising  two sources with knowledge of the matter said on Wednesday.",
        "date": "05312017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS in fresh settlement talks with holdouts in rights issue case "
    },
    {
        "content": "* Some claimants consider pursuing case - source (Adds possible break-away group  details)",
        "date": "05292017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS investor group accepts offer to end lawsuit over 2008 cash call "
    },
    {
        "content": "LONDON  June 7 Britain's major share index rose as banks enjoyed a lift from RBS and mid-caps outperformed on Wednesday  a day before Britons were set to begin voting in parliamentary elections.",
        "date": "06072017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Financials lift Britain's FTSE as markets brace for election "
    },
    {
        "content": "LONDON A British judge has given Royal Bank of Scotland a week to avoid a trial by reaching a deal with investors who allege the bank misled them over its 2008 fundraising.",
        "date": "05242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Judge gives RBS week to end investor suit or face trial "
    },
    {
        "content": "LONDON A judge has given Royal Bank of Scotland  and thousands of investors until June 1 to agree a deal that would avert a trial over the bank's 12 billion pound cash call in 2008. | Video ",
        "date": "05242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Judge gives RBS a week to end investor suit or face trial "
    },
    {
        "content": "* Claimants' lawyer says logistical problems hamper talks (Adds logistical problems reaching shareholders)",
        "date": "05242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-Judge gives RBS a week to end investor suit or face trial "
    },
    {
        "content": "* Both sides in rbs trial over 2008 rights issue ask for adjournment until june 7",
        "date": "05242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-Claimants and RBS ask for further adjournment of 2008 rights issue trial "
    },
    {
        "content": "May 24 Britain's FTSE 100 index futures were down 0.1 percent on Wednesday ahead of the cash market open.",
        "date": "05242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-UK Stocks-Factors to watch on May 24 "
    },
    {
        "content": "LONDON  May 24 Royal Bank of Scotland is struggling to reach a deal with all the investors who allege the lender misled them during a 12 billion pound ($15.6 billion) cash call in 2008  two sources familiar with the situation said.",
        "date": "05242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS struggles to seal deal over 2008 cash call dispute - sources "
    },
    {
        "content": "LONDON  May 18 Fred Goodwin  the former Royal Bank of Scotland chief executive  is set to become the first senior banker in Britain to be challenged in court over his role in the financial crisis.",
        "date": "05192017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RPT-Nine years on  ex-RBS boss Goodwin to face investors in court "
    },
    {
        "content": "LONDON  May 22 Royal Bank of Scotland (RBS) has tried to reach a last-minute settlement with a group of investors who allege that the lender misled them over a 2008 capital increase  according to two people familiar with the matter.",
        "date": "05222017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS tries for last-minute settlement before investor court case -sources "
    },
    {
        "content": "ANKARA Turkey put on trial 200 suspects on Monday including senior military officers accused of plotting and orchestrating last year's failed coup  in a court case where prosecutors are calling for life sentences. | Video ",
        "date": "05222017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Turkey puts 200 suspected military coup plotters on trial amid heavy security "
    },
    {
        "content": "LONDON  May 23 A trial in which Royal Bank of Scotland is accused by investors of misleading them over its 2008 fundraising is set to be delayed for a second day  as frantic settlement talks between the claimants and the bank continued in London on Tuesday.",
        "date": "05232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Trial over RBS 2008 cash call faces further delay amid settlement talks "
    },
    {
        "content": "LONDON  May 18 Fred Goodwin  the former Royal Bank of Scotland chief executive  is set to become the first senior banker in Britain to be challenged in court over his role in the financial crisis.",
        "date": "05182017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Nine years on  ex-RBS boss Goodwin to face investors in court "
    },
    {
        "content": "LONDON  May 17 Lloyds Chief Executive Antonio Horta-Osorio travelled at the front of the British Airways plane last week  enjoying the extra leg room in the business section on his way from London to the bank's annual meeting in Edinburgh.",
        "date": "05172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "As Lloyds flies free  RBS years away from leaving state hands "
    },
    {
        "content": "LONDON  May 22 Royal Bank of Scotland is close to settling a costly and potentially embarrassing case alleging it misled shareholders during a 12 billion pound ($16 billion) fundraising at the height of the financial crisis  sources familiar with the talks said on Monday.",
        "date": "05222017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 3-RBS nears settlement in landmark lawsuit over 2008 cash call -sources "
    },
    {
        "content": "* Bank has already settled with 4 of 5 claimant groups (Updates with decision)",
        "date": "05232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-Trial over RBS 2008 cash call adjourned for settlement talks "
    },
    {
        "content": "* Claimants request adjournment in RBS rights issue case as settlement talks continue -source Source text for Eikon: Further company coverage: (Reporting by Lawrence White)",
        "date": "05222017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-Claimants request adjournment in RBS case amid settlement talks -source "
    },
    {
        "content": "* U.K. investors seek another day for settlement talks in lawsuit against RBS - claimant lawyer Source text for Eikon: Further company coverage: (Reporting by Lawrence White)",
        "date": "05232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-Investors seek another day for settlement talks in RBS lawsuit - claimant lawyer "
    },
    {
        "content": "LONDON  May 16 Britain's opposition Labour Party would launch a consultation to break up state-owned Royal Bank of Scotland into smaller local banks  the party said on Tuesday at the launch of its election manifesto.",
        "date": "05162017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-Britain's Labour party says would break up Royal Bank of Scotland "
    },
    {
        "content": "LONDON  May 16 Britain's opposition Labour Party would launch a consultation to break up state-owned Royal Bank of Scotland into smaller local banks  the party said on Tuesday at the launch of its election manifesto.",
        "date": "05162017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's Labour party says would break up Royal Bank of Scotland "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 15 (Fitch) Fitch Ratings has affirmed The Royal Bank of Scotland PLC's (RBS  BBB+/Stable/F2) outstanding mortgage covered bonds at 'AAA'; the Outlook is Stable. This affirmation follows the addition of around GBP3 billion of mortgage loans issued by NatWest Bank  the revision of the interest rate swap spread to 2.577% (from 2.675%) and the issuance of EUR1.25 billion and GBP1.25 billion of covered bonds. KEY RATING DRIVERS T",
        "date": "05152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Fitch Affirms RBS's Covered Bonds at 'AAA'; Outlook Stable "
    },
    {
        "content": "LONDON  May 12 Royal Bank of Scotland Chief Executive Ross McEwan said the bank is in talks to settle one of the two major U.S. investigations into allegations it mis-sold mortgage-backed securities that it needs to overcome before the British government can sell its shares in the bailed-out bank.",
        "date": "05122017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS CEO sees potential to settle major U.S. mortgage probe "
    },
    {
        "content": "LONDON  May 9 British lender Royal Bank of Scotland plans to cut 334 jobs and offshore more jobs to India  the Unite union said on Tuesday.",
        "date": "05092017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to cut 334 jobs  offshore more jobs to India - Unite union "
    },
    {
        "content": "EDINBURGH/LONDON Royal Bank of Scotland  Thursday defended its new executive pay plan at its annual shareholder meeting on Thursday after some investors criticized the policy for still being too generous.",
        "date": "05112017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS defends directors' bonuses in response to criticism "
    },
    {
        "content": "OSLO  May 9 Norway's $938-billion sovereign wealth fund  the world's largest  will vote in favour of Royal Bank of Scotland's new remuneration policy  the fund said on Tuesday.",
        "date": "05092017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Norway's sovereign wealth fund backs RBS new remuneration policy "
    },
    {
        "content": "* Bank's board faces down irate investors at AGM (Adds result of vote)",
        "date": "05112017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS defends directors' bonuses in response to criticism "
    },
    {
        "content": "LONDON  May 11 Royal Bank of Scotland on Thursday said it would shrink incentives for top executives and streamline its pay policy  as the bank seeks to align pay more closely to good behaviour and performance.",
        "date": "05112017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS sets out new pay proposals to shrink bonuses for top executives "
    },
    {
        "content": "* Royal Bank of Scotland group plc announces today that John Hughes and Yasmin Jetha will be appointed as non-executive directors of RBS Source text for Eikon: Further company coverage: (Reporting by Lawrence White)",
        "date": "05112017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS names two new board members "
    },
    {
        "content": "LONDON  May 11 (IFR) - Eric Capp  who left Royal Bank of Scotland in late 2015  has been appointed partner of Pemberton  an asset manager owned by major UK insurer Legal & General.",
        "date": "05112017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "MOVES-Ex-RBS high yield specialist Capp joins buyside "
    },
    {
        "content": "LONDON  May 5 The former CEO of a software company suing RBS for allegedly conspiring to push the business into administration faced the dismissal of his case on Friday  after a judge ruled it was unlikely to succeed based on an interim hearing in March.",
        "date": "05052017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Businessman suing RBS over alleged conspiracy faces case dismissal "
    },
    {
        "content": "    May 4 Britain's FTSE 100 index is seen opening 16 points higher on Thursday  according to financial bookmakers.           * BHP: Australia warned on Thursday that a push by activist investor Elliott Management to ditch global miner BHP Billiton's dual listing may be a criminal offence and could be subject to civil penalties.     * ROYAL BANK: Investor advisory firm Institutional Shareholder Services has advised shareholders in Royal Bank of Scotland to vote against its remunerati",
        "date": "05042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK Stocks-Factors to watch on May 4 "
    },
    {
        "content": "LONDON  May 3 Investor advisory firm Institutional Shareholder Services has advised shareholders in Royal Bank of Scotland to vote against its remuneration policy next week because it is unclear how bonuses will be paid out to senior directors.",
        "date": "05032017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS investors urged to reject CEO pay award "
    },
    {
        "content": "* UBS  BNP  RBS get subpoenas in U.S. treasuries probe - Bloomberg citing sources",
        "date": "05012017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-UBS  BNP  RBS get subpoenas in U.S. treasuries probe - Bloomberg  citing sources "
    },
    {
        "content": "RIYADH Saudi Arabia's Alawwal Bank  partly owned by Royal Bank of Scotland  has roughly doubled its market share within retail banking thanks to its expansion in the last three years  despite a difficult economic environment  its chief executive said on Monday.",
        "date": "05012017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS-backed Saudi bank says has nearly doubled share of retail market "
    },
    {
        "content": "LONDON Royal Bank of Scotland swung to a better than expected first quarter profit of 259 million pounds ($334.24 million)  it reported on Friday  its first quarterly profit since September 2015.",
        "date": "04282017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS posts first quarterly profit since third quarter of 2015 "
    },
    {
        "content": "LONDON  April 28 Royal Bank of Scotland swung to a far better than expected first-quarter profit of 259 million pounds ($334.24 million)  sending its shares up as much as 4 percent as the lender showed signs of progress in a decade-long turnaround.",
        "date": "04282017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS posts first quarterly profit since September 2015 "
    },
    {
        "content": "* Net interest margin (nim) of 2.24% for q1 2017 was 9 basis points higher than q1 2016",
        "date": "04282017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS net interest margin rises to 2.24 pct "
    },
    {
        "content": "LONDON  April 28 Royal Bank of Scotland swung to a better than expected first quarter profit of 259 million pounds ($334.24 million)  it reported on Friday  after making a loss of nearly a billion pounds in the same period a year ago.",
        "date": "04282017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS posts first quarterly profit since Q3 2015 "
    },
    {
        "content": "LONDON  April 27 Royal Bank of Scotland has reached an out-of-court settlement with more shareholders who alleged the lender misled them during a fundraising during the financial crisis  the state-owned bank said on Thursday.",
        "date": "04272017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS settles with more investors over 2008 cash call lawsuit "
    },
    {
        "content": "DUBAI  April 25 Alawwal Bank  Saudi Arabia's oldest lender and partly owned by Royal Bank of Scotland  said on Tuesday it has agreed to start initial merger talks with Saudi British Bank (SABB)  an affiliate of HSBC Holdings.",
        "date": "04252017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Saudi's Alawwal Bank in merger talks with HSBC-backed SABB "
    },
    {
        "content": "LONDON  April 27 Royal Bank of Scotland has reached an out-of-court settlement with another batch of shareholders who alleged they were misled during a 12 billion-pound ($15.5 billion) cash call in 2008  the state-owned bank said on Thursday.",
        "date": "04272017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS settles with more investors over 2008 cash call lawsuit "
    },
    {
        "content": "LONDON  April 21 A British government department has applied to join a class action suit to represent some shareholders who are among those state-owned Royal Bank of Scotland is alleged to have misled in 2008  a document seen by Reuters shows.",
        "date": "04212017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "British ministry may join investor suit against state-owned RBS "
    },
    {
        "content": "LONDON Former Royal Bank of Scotland chief executive Fred Goodwin is scheduled to appear in court at the start of June over claims the lender misled investors over its 2008 share sale  a draft timetable released on Tuesday showed.",
        "date": "04112017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Former RBS chief Goodwin to make June court appearance in cash-call case "
    },
    {
        "content": "LONDON  April 11 Former Royal Bank of Scotland chief executive Fred Goodwin is scheduled to appear in court at the start of June over claims the lender misled investors over its 2008 share sale  a draft timetable released on Tuesday showed.",
        "date": "04112017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-Former RBS chief Goodwin to make June court appearance in cash-call case "
    },
    {
        "content": "LONDON  April 11 Former Royal Bank of Scotland chief executive Fred Goodwin is scheduled to appear in court at the start of June over claims the lender misled investors over its 2008 share sale  a draft timetable released on Tuesday showed.",
        "date": "04112017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Former RBS CEO Goodwin to appear in court in June over cash-call case "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Libor-fiddling has momentarily recaptured its 2012 glory days. A leaked recording has re-opened the question of how much the UK regulator knew about action by Barclays and other banks to submit lowball interbank rates in 2008 – and what the penalty should be if the answer is “a lot”. In a way  though  it’s a redundant question. Libor has hit bank bosses – just not the right ones.",
        "date": "04112017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Libor did hit bank bosses  just not the right ones "
    },
    {
        "content": "LONDON  April 5 Royal Bank of Scotland announced on Wednesday that the team managing its Williams & Glyn division of branches are leaving after the bank abandoned its seven-year-old plan to sell it to meet regulatory obligations.",
        "date": "04052017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS's Williams & Glyn management quit as EU probes alternative to sell-off "
    },
    {
        "content": "BRUSSELS  April 4 EU state aid regulators will investigate whether a proposal by Royal Bank of Scotland to help so-called challenger banks and boost competition among lenders will be able to substitute a previous pledge to sell its Williams & Glyn unit.",
        "date": "04042017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "EU to investigate new RBS plan to offset state aid "
    },
    {
        "content": "LONDON Nine years after the beginning of a 45-billion-pound ($56 billion) bailout by the British government  Royal Bank of Scotland  is emerging from its restructuring process a shadow of what was once the biggest lender in the world.",
        "date": "04032017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS rising from ruins as shadow of former self "
    },
    {
        "content": "* GRAPHIC-Rise and fall of RBS assets: http://tmsnrt.rs/2mPV7La",
        "date": "04032017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "INSIGHT-RBS rising from ruins as shadow of former self "
    },
    {
        "content": "LONDON Royal Bank of Scotland  has nudged up an offer to settle the last of five damages claims by investors over its record 12 billion pound ($15 billion) emergency cash call in 2008  two sources familiar with the situation said on Tuesday.",
        "date": "03282017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS raises offer to settle 2008 cash call lawsuit "
    },
    {
        "content": "LONDON  March 28 Royal Bank of Scotland has nudged up an offer to settle the last of five damages claims by investors over its record 12 billion pound ($15 billion) emergency cash call in 2008  two sources familiar with the situation said on Tuesday.",
        "date": "03282017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS raises offer to settle 2008 cash call lawsuit "
    },
    {
        "content": "LONDON  March 28 Royal Bank of Scotland has nudged up an offer to the final group of claimants seeking damages over an emergency cash call in 2008  a source familiar with the situation said on Tuesday.",
        "date": "03282017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS raises settlement offer to last claimants over 2008 cash call "
    },
    {
        "content": "LONDON  March 27 Royal Bank of Scotland said on Monday the Financial Conduct Authority (FCA) and other regulators have requested information about allegations the lender was involved in a global money laundering scheme.",
        "date": "03272017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS answering regulator questions about Russia money laundering claims "
    },
    {
        "content": "LONDON  March 27 (IFR) - Global GDP will fall by 2.4%  sterling plunges against the dollar  UK interest rates rise to 4% and US corporate bond spreads will widen by 1 150bp under the 2017 \"stress test\" scenario for Britain's big banks.",
        "date": "03272017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK toughens stress tests with sterling drop  wider bond spreads "
    },
    {
        "content": "State-backed Royal Bank of Scotland  said on Thursday it planned to close about 180 bank branches in Britain and Ireland and about 1 000 roles were at risk in the latest round of cuts and closures at the lender.",
        "date": "03232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to close 180 branches due to dramatic online shift "
    },
    {
        "content": "* Bank cutting costs after 9 years of net loss   (Adds Ulster Bank branch closures  job cuts)",
        "date": "03232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 3-RBS to close 180 branches due to dramatic online shift "
    },
    {
        "content": "March 23 Royal Bank of Scotland is to close more than 150 bank branches in Britain and cut hundreds of jobs  the state-backed lender said on Thursday.",
        "date": "03232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS says to close more than 150 bank branches in Britain "
    },
    {
        "content": "LONDON  March 17 Lawyers representing tens of thousands of Royal Bank of Scotland (RBS) shareholders have held tentative talks to settle a 1.2 billion pound ($1.5 billion) damages claim over the lender's 2008 rights issue that was launched shortly before a state bailout  two sources said.",
        "date": "03182017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RPT-UPDATE 1-Last RBS investor group held settlement talks over 2008 cash call -sources "
    },
    {
        "content": "    March 20 Britain's FTSE 100 index is seen opening 1 point higher at 7 426 on Monday  according to financial bookmakers.          * The UK blue chip FTSE 100 index ended 0.1 percent higher at 7 424.96 points on Friday  closing at a record level but with a stronger sterling capping gains.     * UNILEVER: Unilever is preparing a 6 billion pound ($7.44 billion) sale of some of its food brands  British newspapers reported on Saturday.     * BHP BILLITON: The labor union at the world's",
        "date": "03202017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK Stocks-Factors to watch on March 20 "
    },
    {
        "content": "* Case scheduled to come to court in May   (Adds multimillionaire businessman backing the claimants)",
        "date": "03172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-Last RBS investor group held settlement talks over 2008 cash call -sources "
    },
    {
        "content": "LONDON Leveraged loan investors are set to welcome two sizeable cross-border acquisition deals totaling US$11.5bn  which will offer some relief from the raft of refinancings that have dominated both the US and European markets since the start of the year.",
        "date": "03172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Lenders welcome $10billion mega-loans "
    },
    {
        "content": "LONDON  March 17 Leveraged loan investors are set to welcome two sizeable cross-border acquisition deals totalling US$11.5bn  which will offer some relief from the raft of refinancings that have dominated both the US and European markets since the start of the year.",
        "date": "03172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "LPC-Lenders welcome US$10bn mega-loans "
    },
    {
        "content": "LONDON Lawyers representing tens of thousands of Royal Bank of Scotland  shareholders have held tentative talks to settle a 1.2 billion pound ($1.5 billion) damages claim over the lender's 2008 rights issue that was launched shortly before a state bailout  two sources said.",
        "date": "03172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Last RBS investor group held settlement talks over 2008 cash call : sources "
    },
    {
        "content": "LONDON  March 17 Lawyers representing tens of thousands of Royal Bank of Scotland shareholders have held tentative talks to settle a 1.2 billion pound ($1.5 billion) damages claim over the lender's 2008 rights issue that was launched shortly before a state bailout  two sources said.",
        "date": "03172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Last RBS investor group held settlement talks over 2008 cash call - sources "
    },
    {
        "content": "LONDON  March 17 British shares were flat on Friday against weaker European markets  holding close to Thursday's record high and set to post a weekly gain.",
        "date": "03172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's FTSE set for weekly gain  steadies against stronger sterling "
    },
    {
        "content": "NEW YORK Wells Fargo & Co  Royal Bank of Scotland Group Plc and Deutsche Bank AG have reached a $165 million class-action settlement over their underwriting for the now-bankrupt subprime lender NovaStar Mortgage Inc.",
        "date": "03152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Wells Fargo  RBS  Deutsche Bank in $165 million NovaStar settlement "
    },
    {
        "content": "NEW YORK  March 15 Wells Fargo & Co  Royal Bank of Scotland Group Plc and Deutsche Bank AG  have reached a $165 million class-action settlement of investor claims over their underwriting for the now-bankrupt subprime lender NovaStar Mortgage Inc.",
        "date": "03152017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Wells Fargo  RBS  Deutsche Bank in $165 mln NovaStar settlement "
    },
    {
        "content": "LONDON  March 10 A judge on Thursday ordered legal representatives of thousands of shareholders suing Royal Bank of Scotland over a 12 billion pound ($15 billion) cash call to reveal the source of its funding to meet the hefty risks of a trial.",
        "date": "03102017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS investors told to reveal funding in cash call case "
    },
    {
        "content": " (Adds company news item  updates futures)     March 10 Britain's FTSE 100         index is seen opening up 22.3 points on Friday  according to financial bookmakers  with futures         up 0.2 percent ahead of the cash market open.                 * BT GROUP: Britain's biggest telecoms group BT        has reached an agreement with the regulator to finally resolve a two-year row over how the national broadband network is run  agreeing to a legal separation of the business.           ",
        "date": "03102017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-UK Stocks-Factors to watch on March 10 "
    },
    {
        "content": "    March 10 Britain's FTSE 100 index is seen opening up 22.3 points on Friday  according to financial bookmakers.                  * ROYAL BANK OF SCOTLAND: A judge on Thursday ordered legal representatives of thousands of shareholders suing Royal Bank of Scotland over a 12 billion pound ($15 billion) cash call to prove they have insurance to meet the hefty risks of a trial.     * BP: Motorists will be able to fill up their gas tanks at about 1 500 new BP  service stations the oil m",
        "date": "03102017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK Stocks-Factors to watch on March 10 "
    },
    {
        "content": "LONDON  March 9 A judge on Thursday ordered legal representatives of thousands of shareholders suing Royal Bank of Scotland over a 12 billion pound ($15 billion) cash call to prove they have  insurance to meet the hefty risks of a trial.",
        "date": "03092017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS investors told to reveal funding in cash call case "
    },
    {
        "content": "LONDON  March 8 Royal Bank of Scotland awarded Chief Executive Ross McEwan shares worth almost a quarter more than last year.",
        "date": "03082017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS CEO share awards rise by a quarter to $1.5 million "
    },
    {
        "content": "LONDON UK banks are selling hundreds of millions of pounds of performing syndicated loans for UK companies to foreign banks as they try to boost profitability by reducing their exposure and even exit unprofitable relationships altogether as pressure on balance sheets grows.",
        "date": "03092017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK banks boost profits by selling UK loans to foreign lenders "
    },
    {
        "content": "LONDON  March 9 UK banks are selling hundreds of millions of pounds of performing syndicated loans for UK companies to foreign banks as they try to boost profitability by reducing their exposure and even exit unprofitable relationships altogether as pressure on balance sheets grows.",
        "date": "03092017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "LPC-UK banks boost profits by selling UK loans to foreign lenders "
    },
    {
        "content": "LONDON Royal Bank of Scotland  reported a sharp rise in losses on Friday as higher misconduct charges and restructuring costs underscored the challenges facing the lender nine years after it was bailed out in the world's biggest bank rescue.",
        "date": "02242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS posts ninth straight annual loss on \"sins of the past\" "
    },
    {
        "content": "LONDON  Feb 24 Britain's top share index hit a two-week low on Friday and was on track for a weekly loss after three straight weeks of gains  with falls in lenders like Standard Chartered and RBS after their results pressuring the wider market.",
        "date": "02242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "FTSE hits 2-week low on poor earnings  heads for weekly loss "
    },
    {
        "content": "* Says 2017 will probably be last year of losses   (Adds shares  CEO quote)",
        "date": "02242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS posts ninth straight annual loss on \"sins of the past\" "
    },
    {
        "content": "MILAN  Feb 24 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "02242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "European shares set for weaker open  RBS and earnings in focus. For more see the LiveMarkets blog "
    },
    {
        "content": "* Rbs CEO says there will be further job losses as bank targets 2 billion stg cost cuts over next 4 years",
        "date": "02242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS says not yet in active negotiations with U.S. DoJ on RMBS case "
    },
    {
        "content": "* Mark Seligman has been appointed as a non-executive director of rbs with effect from April 1  2017  Source text for Eikon: Further company coverage:   (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "02242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS appoints Mark Seligman as a non-exec director "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  February 22 (Fitch) A revised plan for Royal Bank of Scotland Group  (RBSG) to meet its remaining state aid obligations would remove one of the key  cost challenges it faces in its restructuring strategy  Fitch Ratings says. We  believe the plan  if agreed  would bring a faster and more certain conclusion to  its state aid obligations than the existing requirement to sell all RBS branches  in England and Wales and all NatWest br",
        "date": "02222017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Fitch: Revised State Aid Plan Removes A Key RBS Uncertainty "
    },
    {
        "content": "* The group bonus pool has fallen from 373 million stg in 2015 to 343 million stg in 2016  a reduction of 8 percent",
        "date": "02242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS bonus pool falls in 2016  CEO paid total of 3.5 mln stg "
    },
    {
        "content": "LONDON  Feb 24 Royal Bank of Scotland reported on Friday a sharp rise in losses as higher misconduct charges and restructuring costs underscored the challenges facing the lender nine years after it required the world's biggest bank bailout.",
        "date": "02242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS posts $8.7 billion loss in ninth straight year without a profit "
    },
    {
        "content": "* Royal bank of scotland group 2016 conduct and litigation charges 5.9 billion stg",
        "date": "02242017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-Royal Bank of Scotland group 2016 loss 6.955 billion stg "
    },
    {
        "content": "* Update on preliminary non-binding proposal to the Royal Bank Of Scotland Group Plc",
        "date": "02202017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-CYBG says it notified RBS that it has withdrawn its offer for Williams & Glyn "
    },
    {
        "content": "LONDON  Feb 20 Royal Bank of Scotland Group  shares rose 5 percent on Monday  after the lender said on Friday evening it had proposed abandoning the disposal of its Williams & Glyn business after a seven-year struggle to sell the unit to meet European Union state aid demands.",
        "date": "02202017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS shares up 5 pct on alternative plan to Williams & Glyn sale "
    },
    {
        "content": "* RBS has taken a £750 million provision within its 2016 annual results as a consequence of today's proposal",
        "date": "02202017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS takes 750 mln stg provision for new Williams & Glyn sale plan "
    },
    {
        "content": "LONDON/BRUSSELS Britain's plan to free Royal Bank of Scotland  from an obligation to sell more than 300 branches risks a clash with the European Commission weeks before the government is due to start formal talks to leave the trading bloc.",
        "date": "02212017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Britain risks EU clash over RBS bailout terms "
    },
    {
        "content": "Royal Bank of Scotland Group Plc  said on Friday it had proposed abandoning the planned sale of its Williams & Glyn unit after a seven-year struggle to sell the small business lender to meet European Union state aid demands.",
        "date": "02172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS proposes new 750-million-pound plan to abandon Williams & Glyn unit sale "
    },
    {
        "content": "Feb 17 Royal Bank of Scotland Group Plc said on Friday it had proposed abandoning the planned sale of its Williams & Glyn unit after a seven-year struggle to sell the small business lender to meet European Union state aid demands.",
        "date": "02172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS proposes new 750 mln stg plan to abandon Williams & Glyn unit sale "
    },
    {
        "content": "Feb 17 Royal Bank of Scotland Group Plc has proposed abandoning the planned sale of its Williams & Glyn unit after a seven-year struggle to sell the small business lender to meet European Union state aid demands.",
        "date": "02172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "REFILE-RBS proposes abandoning sale of Williams & Glyn unit "
    },
    {
        "content": "* Update on RBS's remaining state aid obligation regarding the business previously described as Williams & Glyn",
        "date": "02172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS provides update on its remaining state aid obligation regarding the business previously described as Williams & Glyn "
    },
    {
        "content": "    By Maya Nikolaeva     PARIS  Feb 17 French banks lost ground in the 2016 ranking of the most active financial institutions on primary and secondary government debt markets  according to public debt management agency Agence France Tresor (AFT).     Banks in Europe have retreated from primary dealing in government bonds  saying regulatory constraints are adding to the costs involved.     BNP Paribas held on to top place in 2016 but lost ground to HSBC and JP Morgan in the primary a",
        "date": "02172017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Domestic banks lose ground in France's AFT debt agency rankings "
    },
    {
        "content": "LONDON  Feb 10 A group of senior businessmen are among investors seeking to join a lawsuit against Royal Bank of Scotland saying they were misled over its massive rights issue in 2008  according to sources and court documents.",
        "date": "02102017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Former RBS vice-chairman among investors seeking to join rights issue case "
    },
    {
        "content": "LONDON  Feb 10 Royal Bank of Scotland has rejected calls to beef up a 400 million pound ($502 million) scheme to reimburse customers who say they were mistreated by the bank's business restructuring division.",
        "date": "02102017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS rejects calls for more cash to compensate small businesses "
    },
    {
        "content": "WASHINGTON The U.S. Commodity Futures Trading Commission said it ordered the Royal Bank of Scotland  to pay an $85 million fine as part of a settlement reached on Friday to settle charges RBS tried to manipulate a key foreign exchange swaps benchmark rate.",
        "date": "02032017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "U.S. fines RBS $85 million for forex swap rates manipulation bid "
    },
    {
        "content": "LONDON  Feb 3 Royal Bank of Scotland  will pay a $85 million penalty to resolve civil charges that it attempted to manipulate a global benchmark for interest rate products  U.S. derivatives regulators said on Friday.",
        "date": "02032017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to pay $85 million penalty over attempted benchmark manipulation "
    },
    {
        "content": "WASHINGTON  Feb 3 The U.S. Commodity Futures Trading Commission said it ordered the Royal Bank of Scotland  to pay an $85 million fine as part of a settlement reached on Friday to settle charges RBS tried to manipulate a key foreign exchange swaps benchmark rate.",
        "date": "02032017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "U.S. fines RBS $85 mln for forex swap rates manipulation bid "
    },
    {
        "content": "LONDON  Jan 23 Japanese financial services firm Orix Corp said it was looking to buy more shipping loans in Europe after confirming on Monday that it would purchase $289 million worth of such debt from Royal Bank of Scotland in a landmark deal.",
        "date": "01232017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Japan's Orix looking for more European shipping debt after buying RBS loans "
    },
    {
        "content": "* Royal Bank Of Scotland to announce within days it is taking another multibillion pound charge for mis-selling mortgage-backed securities - Sky News  Source http://bit.ly/2jy4egV",
        "date": "01252017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-RBS takes multibillion pound charge as U.S. mis-selling fine looms- Sky News "
    },
    {
        "content": "LONDON  Jan 25 Royal Bank of Scotland is demanding that thousands of shareholders suing the bank over a 12 billion pound ($15 billion) cash call in 2008 prove they have appropriate insurance cover to meet the hefty risks of a trial now slated for May.",
        "date": "01252017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS challenges investors on costs as rights issue trial nears "
    },
    {
        "content": "* RBS set for 9th straight annual loss   (Adds new CEO quote  analyst and share reaction)",
        "date": "01262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS sets aside $4 bln for 'painful legacy ' of US loan mis-selling "
    },
    {
        "content": "LONDON  Jan 26 European shares climbed to a one-year high on Thursday  supported by mergers and acquisitions-related optimism  with Johnson & Johnson's  $30 billion deal to buy Actelion lifting shares in the Swiss biotech firm.",
        "date": "01262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "European shares get M&A boost  climb to one-year high "
    },
    {
        "content": "LONDON  Jan 26 Royal Bank of Scotland  has taken a 3.1 billion pound ($3.92 billion) provision as it prepares to settle claims in the United States that it mis-sold toxic mortgage-backed securities in the run up to the 2008 financial crisis.",
        "date": "01262017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS writes off $4 bln for US mortgage mis-selling cases "
    },
    {
        "content": "NEW YORK Credit Suisse has formally agreed to pay $5.3 billion to settle with U.S. authorities over claims it misled investors in residential mortgage-backed securities it sold in the run-up to the 2008 financial crisis.",
        "date": "01182017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Credit Suisse finalizes $5.3 bln mortgage deal with U.S. "
    },
    {
        "content": "NEW YORK Credit Suisse  has formally agreed to pay $5.3 billion to settle with U.S. authorities over claims it misled investors in residential mortgage-backed securities it sold in the run-up to the 2008 financial crisis.",
        "date": "01182017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Credit Suisse finalizes $5.3 billion mortgage deal with U.S. "
    },
    {
        "content": "NEW YORK  Jan 18 Credit Suisse has formally agreed to pay $5.3 billion to settle with U.S. authorities over claims it misled investors in residential mortgage-backed securities it sold in the run-up to the 2008 financial crisis.",
        "date": "01182017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-Credit Suisse finalizes $5.3 bln mortgage deal with U.S. "
    },
    {
        "content": "MILAN  Jan 18 Italy will issue 6 billion euros ($6.4 billion) of a new 15-year bond it launched on Wednesday in the first test of market demand for its debt since last week's sovereign downgrade  an official at one of the banks managing the sale said.",
        "date": "01182017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Italy to sell 6 bln euros of new 15-year bond - lead "
    },
    {
        "content": "LONDON/TOKYO Royal Bank of Scotland  has concluded agreements to sell at least $600 million worth of shipping loans from its portfolio as part of efforts to exit the sector  sources with direct knowledge of the deal told Reuters on Friday.",
        "date": "01202017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS sells $600 million of shipping loans  Orix among buyers: sources "
    },
    {
        "content": "LONDON/TOKYO  Jan 20 Royal Bank of Scotland  has concluded agreements to sell at least $600 million worth of shipping loans from its portfolio as part of efforts to exit the sector  sources with direct knowledge of the deal told Reuters on Friday.",
        "date": "01202017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS sells $600 million of shipping loans  Orix among buyers - sources "
    },
    {
        "content": "TOKYO  Jan 20 Japanese financial services firm Orix Corp has agreed to buy $290 million worth of shipping loans from Royal Bank of Scotland  sources with direct knowledge of the deal told Reuters on Friday.",
        "date": "01202017",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Orix agrees to buy $290 mln of RBS shipping loans -sources "
    },
    {
        "content": "LONDON More than 160 investors in Royal Bank of Scotland  have asked the bank to create a committee of shareholders to improve its corporate governance and help avoid a repeat of mistakes that led to its 45 billion pound ($55 billion) bailout.",
        "date": "12302016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS asked to create investor committee to avoid repeat of crisis-era mistakes "
    },
    {
        "content": "LONDON Royal Bank of Scotland is close to selling at least $600 million worth of shipping loans from its portfolio  two sources familiar with the matter told Reuters.",
        "date": "12212016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS near to selling $600 million of shipping loans: sources "
    },
    {
        "content": "LONDON A small group of Royal Bank of Scotland  retail shareholders is close to joining three other investor parties and settling a 4.0 billion pound ($5 billion)-plus lawsuit against the bank out of court.",
        "date": "12152016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Fourth RBS investor group prepares to settle fundraising claim "
    },
    {
        "content": "LONDON Royal Bank of Scotland  on Thursday lost a court battle to withhold transcripts  notes and interview records from thousands of retail investors suing the bank over an ill-fated  12 billion pound ($15 billion) share sale in 2008.",
        "date": "12082016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS ordered to hand over documents in shareholder cash call case "
    },
    {
        "content": "LONDON Royal Bank of Scotland  has agreed to pay 800 million pounds ($1 billion) in an out-of-court settlement over allegations it misled shareholders during a 12 billion pound fundraising at the height of the financial crisis.",
        "date": "12052016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to pay investors $1 billion in bid to avoid fundraising trial "
    },
    {
        "content": "LONDON Britain's spending watchdog may open an investigation into the government's decision to start selling shares in Royal Bank of Scotland last year causing a 1.1 billion pound ($1.39 billion) loss for taxpayers  sparking accusations of poor timing from opposition politicians.",
        "date": "12072016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Britain's spending watchdog may review RBS privatization process "
    },
    {
        "content": "DUBLIN Britain's vote to leave the European Union has strengthened the strategic importance of Ulster Bank to RBS and the Irish lender is a key part of its parent group's post-Brexit planning  Ulster Bank's chief executive said on Thursday.",
        "date": "12052016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Ulster Bank a key part of RBS' post-Brexit options: CEO "
    },
    {
        "content": "DUBAI  Nov 27 Gulf stocks consolidated in a quiet market on Sunday with little corporate news to prompt trading  and with Friday's sharp pull-back in oil prices offsetting strength in bourses worldwide.",
        "date": "11272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "MIDEAST STOCKS-Gulf consolidates in quiet trade "
    },
    {
        "content": "LONDON Royal Bank of Scotland (RBS) will cut costs and sell assets to boost capital  it said on Wednesday after failing its Bank of England stress test  with the central bank warning of a \"challenging\" outlook for Britain's financial system. | Video ",
        "date": "11302016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "British lender RBS to bolster capital after failing stress test "
    },
    {
        "content": "LONDON Royal Bank of Scotland  still faces challenges from past misconduct and bad assets  Bank of England Governor Mark Carney said on Wednesday after the British lender failed the central bank's latest stress test.",
        "date": "11302016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BoE's Carney: RBS faces challenges from past misconduct  bad assets "
    },
    {
        "content": "LONDON Royal Bank of Scotland  has agreed a plan of action with the Bank of England's regulatory arm to improve its capital levels after failing an annual stress test  it said on  Wednesday.",
        "date": "11302016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS says to take action to improve capital after failing stress test "
    },
    {
        "content": "DUBLIN  Nov 25 Royal Bank of Scotland's (RBS) Irish operation Ulster Bank will pay its parent company a dividend for the first time since the financial crisis  saying on Friday that it had received regulatory approval to release 1.5 billion euros ($1.59 billion) of capital.",
        "date": "11252016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Ulster Bank to pay RBS first dividend since financial crisis "
    },
    {
        "content": "LONDON Just hours before Royal Bank of Scotland  launched a massive cash call in 2008 to shore up its capital  the bank's senior advisers were still discussing whether its financial figures were potentially misleading for investors  court documents allege.",
        "date": "11172016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS rejected Goldman  Deloitte warning over 2008 cash call  lawsuit alleges "
    },
    {
        "content": "LONDON  Nov 17 Just hours before Royal Bank of Scotland launched a massive cash call in 2008 to shore up its capital  the bank's senior advisers were still discussing whether its financial figures were potentially misleading for investors  court documents allege.",
        "date": "11172016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "INSIGHT-RBS rejected Goldman  Deloitte warning over 2008 cash call  lawsuit alleges "
    },
    {
        "content": "LONDON If Britain does not agree a transitional arrangement with the European Union for the country's finance industry  it will be damaging for the economy and the financial services sector  the Chairman of Royal Bank of Scotland  said on Sunday.",
        "date": "11132016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Brexit without transitional deal will damage economy: RBS Chairman "
    },
    {
        "content": "LONDON  Nov 13 If Britain does not agree a transitional arrangement with the European Union for the country's finance industry  it will be damaging for the economy and the financial services sector  the Chairman of Royal Bank of Scotland said on Sunday.",
        "date": "11132016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-Brexit without transitional deal will damage economy -RBS Chairman "
    },
    {
        "content": "LONDON  Nov 13 If Britain does not agree a transitional arrangement with the European Union  it will be damaging for the economy and for Britain's financial sector  the Chairman of Royal Bank of Scotland said on Sunday.",
        "date": "11132016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Brexit without transitional deal will be damaging for economy -RBS Chairman Davies "
    },
    {
        "content": "The head of the agency managing Britain's stakes in bailed out banks said market speculation that Royal Bank of Scotland faces a potential fine of between $5 to $12 billion from the U.S. is hindering the government's share sale plans.",
        "date": "11162016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "U.S. settlement is blocking RBS share sale - UKFI chairman "
    },
    {
        "content": "LONDON The head of the agency managing Britain's stakes in bailed out banks said market speculation that Royal Bank of Scotland  faces a potential fine of between $5 to $12 billion from the U.S. is hindering the government's share sale plans.",
        "date": "11162016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "U.S. settlement is blocking RBS share sale: UKFI chairman "
    },
    {
        "content": "* Williams & Glyn issue must be fixed before share sale resumes",
        "date": "11162016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-U.S. settlement is blocking RBS share sale - UKFI chairman "
    },
    {
        "content": "LONDON  Nov 16 Royal Bank of Scotland  could face a settlement of $5 billion to $12 billion for mis-selling of mortgage-backed securities in the United States  a top government shareholder in the British lender told parliament on Wednesday.",
        "date": "11162016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "REFILE-UKFI chairman sees RBS facing $5-12 bln settlement for U.S. RMBS case "
    },
    {
        "content": "LONDON Royal Bank of Scotland bosses avoided repricing billions of dollars of souring investments on the eve of the 2008 financial crisis for fear of endangering bonuses and a takeover bid for a rival  court documents allege.",
        "date": "11162016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Court documents allege clashes inside RBS over 2008 toxic assets "
    },
    {
        "content": "* RBS failed to heed warnings  say investors seeking compensation",
        "date": "11162016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "INSIGHT-Court documents allege clashes inside RBS over 2008 toxic assets "
    },
    {
        "content": "LONDON  Nov 7 Royal Bank of Scotland  will announce on Tuesday it is setting up a compensation scheme worth more than 300 million pounds to help small businesses  amid allegations of malpractice at its small business restructuring division  sources said.",
        "date": "11072016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to announce compensation program for small businesses "
    },
    {
        "content": "DUBAI Credit Suisse has been appointed to sell Royal Bank of Scotland's  40 percent stake in Saudi Hollandi Bank   sources aware of the matter said on Tuesday  in a deal potentially worth around $1.2 billion.",
        "date": "11082016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Exclusive: Credit Suisse hired to sell RBS's Saudi Hollandi Bank stake - sources "
    },
    {
        "content": "LONDON Royal Bank of Scotland is setting up a 400 million pound  ($497 million) scheme to reimburse fees to customers who say they were mistreated by its small business restructuring unit as it seeks to end one of its longest customer service battles.",
        "date": "11082016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS's 400 million pound fee refund plan fails to dispel lawsuit risk "
    },
    {
        "content": "LONDON  Nov 8 Britain's financial watchdog is investigating a leak of the news that Royal Bank of Scotland  is setting up a 400 million pound ($496 million) scheme to reimburse fees to customers who say they were mistreated by its small businesses restructuring unit.",
        "date": "11082016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK watchdog investigating leak of RBS redress scheme "
    },
    {
        "content": "* RBS plays down fear issue could rival PPI redress in cost  scale",
        "date": "11082016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 3-RBS's 400 mln pound fee refund plan fails to dispel lawsuit risk "
    },
    {
        "content": "* Financial conduct authority- Review of Royal Bank Of Scotland's treatment of customers referred to its Global Restructuring Group",
        "date": "11082016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-UK's FCA welcomes RBS's decision of fee refund programme for small businesses "
    },
    {
        "content": "LONDON  Nov 8 Royal Bank of Scotland is setting up a 400 million pounds scheme to reimburse fees to customers who claim they were mistreated by its small business restructuring unit  as it seeks to draw a line under one of its longest-running customer service battles.",
        "date": "11082016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS announces 400 million stg fee refund programme for small businesses "
    },
    {
        "content": "LONDON  Nov 4 (IFR) - Chris Agathangelou has been hired by RBS to run Europe  Middle East and Africa financial institutions bond syndicate  according to multiple market sources.",
        "date": "11042016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-Agathangelou heads to RBS after Dhami's departure "
    },
    {
        "content": "* Posts rbs launches a new complaints process and refund of complex fees for sme customers in grg",
        "date": "11082016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS launches a new complaints process  fee refunds for GRG customers "
    },
    {
        "content": "LONDON  Nov 4 (IFR) - Pillarstone  the platform set up by US private equity firm KKR to buy non-core bank assets in Europe  looks set to take on more shipping loans after appointing an industry veteran to run its shipping business.",
        "date": "11042016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "KKR's Pillarstone set to snap up Europe shipping loans "
    },
    {
        "content": "LONDON  Nov 1 (IFR) - Harman Dhami  a managing director in the financial institutions group debt syndicate at Royal Bank of Scotland  has the left the bank  according to multiple market sources.",
        "date": "11012016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-Senior FIG syndicate banker departs RBS "
    },
    {
        "content": "* Bank triples legal provisions   (Adds shares  analyst comment)",
        "date": "10282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 2-Costs of misdeeds and revamp take toll on RBS "
    },
    {
        "content": "* Rbs reported an operating profit before tax of £255 million",
        "date": "10282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "REFILE-BRIEF-Royal Bank of Scotland 9-mth total income 9.4 billion pounds "
    },
    {
        "content": "WASHINGTON The U.S. Securities and Exchange Commission has released a collection of internal voting records  long held secret  that reveal it to be less divided than is commonly thought.",
        "date": "10272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Oft-divided SEC speaks with one voice when suing corporations -records "
    },
    {
        "content": "LONDON  Oct 28 Royal Bank of Scotland  swung to a third-quarter loss on Friday  hit by costs related to past misconduct and  restructuring  casting fresh doubts on when the government might begin to recoup more of its 2008 emergency investment.",
        "date": "10282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS sinks to third-quarter loss on misconduct  restructuring charges "
    },
    {
        "content": "* Q3 net mortgage lending up 3 billion stg  Source text for Eikon:  Further company coverage:    (Reporting by Lawrence White)",
        "date": "10282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-Royal Bank of Scotland Q3 loss of 469 mln stg "
    },
    {
        "content": "WASHINGTON  Oct 27 The U.S. Securities and Exchange Commission has released a collection of internal voting records  long held secret  that reveal it to be less divided than is commonly thought.",
        "date": "10272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "CORRECTED-Oft-divided SEC speaks with one voice when suing corporations -records "
    },
    {
        "content": "SYDNEY/SINGAPORE DBS Group  plans to buy Australia and New Zealand Banking Group's  wealth and retail businesses in five Asian markets - part of a big private banking push for the Singapore lender and the first significant retreat from Asia for ANZ.",
        "date": "10312016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Singapore's DBS pounces on ANZ assets to extend Asia private banking push "
    },
    {
        "content": "* DBS weighing a bid for ABN AMRO's Asian private bank - sources",
        "date": "10312016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 6-Singapore's DBS pounces on ANZ assets to extend Asia private banking push "
    },
    {
        "content": "LONDON  Oct 25 Clydesdale Bank Plc said it made an offer to take over Royal Bank of Scotland's Williams & Glyn business  after Spain's Banco Santander SA  called off discussions last month.",
        "date": "10252016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-Clydesdale makes offer for RBS's Williams & Glyn unit "
    },
    {
        "content": "* Board of Co can confirm engaged in discussions with RBS and made preliminary proposal to RBS in relation to Williams and Glyn operations  Further company coverage:",
        "date": "10252016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-CYBG made preliminary proposal to RBS in relation to Williams and Glyn operations "
    },
    {
        "content": "LONDON Clydesdale Bank Plc has made an offer to take over Royal Bank of Scotland's  Williams & Glyn business  a person with knowledge of the talks said on Tuesday  after Spain's Banco Santander SA  called off discussions with the British lender last month.The move by Glasgow-based Clydesdale could end a costly seven-year process by RBS to offload Williams & Glyn  after it was ordered to by the European Union to sell it as a condition of its taxpayer-funded ",
        "date": "10252016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Clydesdale makes offer for RBS's Williams & Glyn unit: source "
    },
    {
        "content": "LONDON  Oct 25 Clydesdale Bank Plc has made an offer to take over Royal Bank of Scotland's Williams & Glyn business  a person with knowledge of the talks said on Tuesday  after Spain's Banco Santander SA called off discussions with the British lender last month.",
        "date": "10252016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Clydesdale makes offer for RBS's Williams & Glyn unit - source "
    },
    {
        "content": "LONDON  Oct 25 Books opened on Tuesday for the sale via syndication of several billion pounds of a British government bond due to mature in 2065  one of the bookrunners on the deal said.",
        "date": "10252016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK opens books on sale via syndication of 2065 government bond "
    },
    {
        "content": "Oct 25 Britain's FTSE 100 index is seen opening up by 13-17 points  or 0.2 percent  on Tuesday  according to financial bookmakers  with futures up 0.29 percent ahead of the cash market open.",
        "date": "10252016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 3-UK Stocks-Factors to watch on Oct 25 "
    },
    {
        "content": "Oct 25 Britain's FTSE 100 index is seen opening up by 13-17 points  or 0.2 percent  on Tuesday  according to financial bookmakers.          * The UK blue chip index closed down 0.5 percent at 6 986.40 points on Monday  as energy stocks came under pressure following a drop in crude oil prices and gold miners tracked weaker precious metals.      * GLENCORE: Glencore and Japanese power utilities have settled quarterly thermal coal contract prices at $94.75 a tonne  up from around $64 la",
        "date": "10252016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK Stocks-Factors to watch on Oct 25 "
    },
    {
        "content": "DUBLIN  Oct 10 The Irish unit of Royal Bank of Scotland has sold non-performing loans with a face value of 2.5 billion euro ($2.8 billion) to private equity firm Cerberus  the bank said on Monday.",
        "date": "10102016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS Irish unit sells problem loans with $2.8 bln face value "
    },
    {
        "content": "* RBS faces new claim of up to $2.5 bln from small businesses",
        "date": "10102016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "GRAPHIC-RBS's worst-case legal bill could hit $27 billion "
    },
    {
        "content": "LONDON  Oct 14 Royal Bank of Scotland  said its debit cards are now working normally after customers experienced problems across Britain earlier on Friday  in the latest apparent glitch to hit the bank's IT systems.",
        "date": "10142016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS says debit cards working normally after glitches for customers in Britain "
    },
    {
        "content": "LONDON  Oct 14 Royal Bank of Scotland is aware of some customers experiencing problems using their debit cards across Britain  t said on Friday  and that it is working to resolve the issue.",
        "date": "10142016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS says aware of debit card glitches for customers in Britain "
    },
    {
        "content": "LONDON  Oct 5 Britain's finance watchdog has received a long-delayed final report looking into alleged malpractice at Royal Bank of Scotland's small business restructuring division  the regulator said on Wednesday.",
        "date": "10052016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "FCA gets final report into RBS small business restructuring division "
    },
    {
        "content": "* Mandated Barclays  Deutsche Bank and RBS to arrange a series of credit investor meetings in UK commencing on Oct. 10",
        "date": "10062016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-JRP says Barclays  Deutsche Bank and RBS to arrange investor meets "
    },
    {
        "content": "DUBLIN  Oct 6 Royal Bank of Scotland may consider acquisitions for its Irish business a year from now  but it will not grow at any cost and is wary of taking on problem loans from other lenders  Chief Executive Ross McEwan told the Irish Independent on Thursday.",
        "date": "10062016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS CEO says may consider Irish acquisitions a year from now - Irish Independent "
    },
    {
        "content": "LONDON Royal Bank of Scotland  is to separate its retail operations from its higher-risk businesses in a major overhaul to meet new ring-fencing rules in Britain  which also means the RBS brand will only be used in Scotland. | Video ",
        "date": "09302016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS unveils brand changes  new structure in ring-fencing revamp "
    },
    {
        "content": "LONDON  Sept 30 (IFR) - Royal Bank of Scotland is renaming its corporate and institutional banking (CIB) as NatWest Markets  a throwback to one of the leading securities firms of the 1990s.",
        "date": "09302016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS renames investment bank as NatWest Markets "
    },
    {
        "content": "LONDON  Sept 30 Royal Bank of Scotland  is to separate its retail operations from its higher-risk businesses in a major overhaul to meet new ring-fencing rules in Britain  which also means the RBS brand will only be used in Scotland.",
        "date": "09302016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS unveils brand changes  new structure in ring-fencing revamp "
    },
    {
        "content": "LONDON  Sept 30 Britain's top share index dropped on Friday  taking the shine off a strong quarter  as banks fell on renewed uncertainty over Deutsche Bank's financial health and as a spate of broker downgrades hit outsourcer Capita.",
        "date": "09302016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's FTSE ends strong quarter on weak note  hit by falling banks "
    },
    {
        "content": "LONDON  Sept 30 Royal Bank of Scotland  announced on Friday a sweeping overhaul of its structure and banking brands as it outlined plans to separate its retail operations from riskier parts of its business by 2019.",
        "date": "09302016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS unveils sweeping new structure as ring-fencing looms "
    },
    {
        "content": "NEW YORK  Sept 28 Royal Bank of Scotland Group Plc will pay $1.1 billion to resolve claims that it sold toxic mortgage-backed securities to credit unions that later failed  the U.S. National Credit Union Administration (NCUA) said.",
        "date": "09282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "CORRECTED-UPDATE 2-RBS to pay $1.1 bln to resolve some of its U.S. mortgage claims "
    },
    {
        "content": "LONDON The Royal Bank of Scotland  has begun winding down its global shipping finance business  it said on Tuesday  ending efforts to sell it off during a worsening downturn across the freight industry.",
        "date": "09202016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS starts winding down shipping business as sale efforts fade "
    },
    {
        "content": "* European banks looking to offload billions of dollars in loans",
        "date": "09202016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS starts winding down shipping business as sale efforts fade "
    },
    {
        "content": "* Santander has pulled out of talks with Royal Bank of Scotland to acquire Williams & Glyn  - FT  citing sources  Source text - (http://on.ft.com/2ck7fNk) Further company coverage:    (Bengaluru Newsroom)",
        "date": "09202016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-Santander has pulled out of talks with Royal Bank of Scotland to buy Williams & Glyn - FT  citing sources "
    },
    {
        "content": "* UK lender awaits potential record fine after mis-selling probe",
        "date": "09162016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS shares hit after U.S. demands hefty fine from Deutsche Bank "
    },
    {
        "content": "LONDON  Sept 9 Fund manager Hermes Investment Management said on Friday it had launched a direct lending strategy to invest in the debt of small and medium-sized businesses  in partnership with Royal Bank of Scotland.",
        "date": "09092016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Fund firm Hermes links up with RBS in direct lending push "
    },
    {
        "content": "* Fund firm Hermes launches direct lending strategy  partners with RBS.  Source text for Eikon:  Further company coverage:    (Reporting By Simon Jessop)",
        "date": "09092016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-Fund firm Hermes launches direct lending strategy  partners with RBS "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  September 07 (Fitch) Fitch Ratings has affirmed The Royal Bank of  Scotland PLC's (RBS  BBB+/Stable/F2) GBP4.2bn equivalent mortgage covered bonds  at 'AAA'. The Outlook is Stable. KEY RATING DRIVERS The rating is based on RBS's Long-Term Issuer Default Rating (IDR) of 'BBB+'  an  unchanged IDR uplift of 1 notch and Discontinuity Cap of 4 notches and the 87.5%  asset percentage (AP) that Fitch takes into account in its analysis ",
        "date": "09072016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Fitch Affirms RBS's Covered Bonds at 'AAA'; Outlook Stable "
    },
    {
        "content": "LONDON  Sept 5 Britain's top shares index dipped lower on Monday as a fall in the shares of Royal Bank of Scotland and its rival Lloyds weighed on the overall market.",
        "date": "09052016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's FTSE underperforms as RBS and Lloyds lose ground "
    },
    {
        "content": "* Non-Cumulative usd preference shares  series r (ads cusip: 780097747 ads isin: us7800977479)  amount outstanding us$254 098 300",
        "date": "08252016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Royal Bank of Scotland redeems American depositary shares "
    },
    {
        "content": "LONDON  Aug 22 At an English country mansion last month  lawyers for Royal Bank of Scotland (RBS) sat down with representatives of angry shareholders to broker an end to what may end up being the costliest case in British legal history.",
        "date": "08222016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to relive unpleasant memories as investor lawsuit looms "
    },
    {
        "content": "Aug 22 Britain's FTSE 100 index is seen opening down 2 points  according to financial bookmakers  with futures down 0.1 percent ahead of the cash market open.",
        "date": "08222016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-UK Stocks-Factors to watch on August 22 "
    },
    {
        "content": "LONDON  Aug 19 Some big corporate clients of Royal Bank of Scotland face the prospect of paying to hold deposits with the bank from Monday as it becomes the first lender in Britain to charge negative interest rates.",
        "date": "08192016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS to charge some British corporate customers negative rates "
    },
    {
        "content": "LONDON  Aug 19 Some large corporate clients who bank with Royal Bank of Scotland face the prospect of paying to hold cash in their accounts from Monday  a source close to the bank said  the first in Britain to charge negative interest rates on deposits.",
        "date": "08192016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to charge some corporate customers for deposits in Britain "
    },
    {
        "content": "Aug 17 Indian shares were largely unchanged on Wednesday  tracking global markets as investors turned cautious after an influential U.S. Federal Reserve official said interest rates could rise as soon as September.",
        "date": "08172016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Indian shares little changed on weak global cues "
    },
    {
        "content": "* Auto  personal  start-up financing growth offsets mortgage dip",
        "date": "08162016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Bank price war looms to woo cautious UK borrowers after Brexit "
    },
    {
        "content": "LONDON  Aug 11 Royal Bank of Scotland  has put its portfolio of Turkish shipping loans up for sale  in the latest move by the state-backed bank to exit this troubled sector and cut overall losses through asset sales  two sources told Reuters.",
        "date": "08112016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS looks to sell Turkish loans in latest bid to exit shipping - sources "
    },
    {
        "content": "NEW YORK  Aug 11 (IFR) - Issuance of risky Additional Tier 1 capital could be set for a revival after Royal Bank of Scotland and Standard Chartered printed large dollar deals that rallied in secondary trade.",
        "date": "08122016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "CORRECTED-More AT1 bonds expected after strong showing by RBS  StanChart "
    },
    {
        "content": "* Royal bank of scotland group plc successfully priced $2.65 billion additional tier 1 capital notes",
        "date": "08112016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS prices $2.65 bln of additional tier 1 capital notes "
    },
    {
        "content": "LONDON  Aug 10 (IFR) - Royal Bank of Scotland attracted US$15bn of investor orders for its US$2.65bn (£2bn) Additional Tier 1 bond on Wednesday  the first AT1 from a UK bank since the Brexit vote in June.",
        "date": "08102016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS reaches 2016 AT1 target with £2bn-equivalent deal "
    },
    {
        "content": "LONDON  Aug 10 (IFR) - Royal Bank of Scotland is set to price a US$2.65bn (£2bn) perpetual non-call five-year Additional Tier 1 bond at 8.625% on Wednesday  according to an investor following the deal.",
        "date": "08102016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to price £2bn-equivalent dollar AT1 bond at 8.625% "
    },
    {
        "content": "* Says its subsidiary CTBC Bank will stop acquiring 51 percent stake in Malaysia Branch of Royal Bank of Scotland",
        "date": "08082016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-CTBC Financial Holding units to stop fully acquiring Malaysia Branch of Royal Bank of Scotland "
    },
    {
        "content": "LONDON  Aug 5 Royal Bank of Scotland  said on Friday its Natwest unit would pass on in full a 25 basis point cut in the Bank of England base rate to its standard variable mortgage customers.",
        "date": "08052016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to pass on BoE rate cut to variable mortgage rate customers "
    },
    {
        "content": "LONDON Royal Bank of Scotland reported wider first-half losses  1.3 billion pounds of new litigation charges and axed plans to turn its Williams & Glyn business into a stand-alone bank on Friday as it braces for post-Brexit shocks to the UK economy. | Video ",
        "date": "08052016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS losses and costs mount as Brexit fallout looms large "
    },
    {
        "content": "* Shares fall 6.8 pct by 1250 GMT   (Adds CEO comment on job cuts and strategy  updates shares)",
        "date": "08052016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 4-RBS losses and costs mount as Brexit fallout looms large "
    },
    {
        "content": "LONDON  Aug 4 (IFR) - David Leeming  head of hybrid capital debt capital markets and liability management at RBS  left the bank in late July for personal reasons  according to a source familiar with the matter.",
        "date": "08042016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-RBS shuffles DCM team as Leeming departs "
    },
    {
        "content": "LONDON  Aug 2 Banco Santander has made an offer to take over Royal Bank of Scotland's Williams & Glyn business  two sources familiar with the matter told Reuters on Tuesday  as part of a long-standing plan to grow its market share in Britain.",
        "date": "08022016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-Santander makes offer for RBS's Williams & Glyn arm -sources "
    },
    {
        "content": "MILAN  Aug 5 European shares rose on Friday in early deals  helped by well-received earning updates from companies including cement maker LafargeHolcim  but Royal Bank of Scotland slumped after its first-half losses widened.",
        "date": "08052016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "European shares rise helped by solid earning updates  RBS slumps "
    },
    {
        "content": "LONDON  Aug 2 Banco Santander has made an offer to take over Royal Bank of Scotland's Williams & Glyn business  a source familiar with the situation told Reuters on Tuesday.",
        "date": "08022016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Santander makes offer for RBS's Williams & Glyn arm -source "
    },
    {
        "content": "* Net interest margin (nim) of 2.18% for h1 2016 was 4 basis points higher than h1 2015",
        "date": "08052016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-Royal Bank of Scotland posts wider H1 losses  scraps W&G carve-out plan "
    },
    {
        "content": "* Safe Bulkers Inc. agrees with the Royal Bank of Scotland Plc to amend a term loan facility  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07212016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Safe bulkers to amend loan pact with Royal Bank of Scotland "
    },
    {
        "content": "LONDON  July 20 British employee union Unite has criticised proposals by state-backed lender Royal Bank of Scotland to relocate another 66 jobs from Britain to India  a plan it described as the ultimate betrayal of the bank's workforce.",
        "date": "07202016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS's Indian job relocations are the ultimate betrayal  says union "
    },
    {
        "content": "* UK referendum result battered bank shares   (Updates with Credit Suisse declining to comment)",
        "date": "07112016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-Interest in RBS Greek shipping unit cools after Brexit vote -sources "
    },
    {
        "content": "LONDON  July 11 The Royal Bank of Scotland  is facing setbacks over a proposed sale of its Greek ship finance business  with potential suitors backing off  partly due to the British vote to leave the European Union  sources told Reuters.",
        "date": "07112016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Interest in RBS' Greek shipping unit cools post-Brexit vote - sources "
    },
    {
        "content": "LONDON  July 4 Royal Bank of Scotland  Chief Executive Ross McEwan said the bank may have to move a small number of staff overseas and called for an end to the uncertainty gripping the main political parties following Britain's vote to leave the European Union.",
        "date": "07042016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS would only move \"tens\" of employees post Brexit - CEO "
    },
    {
        "content": "LONDON The chief executives of Lloyds Banking Group  and Royal Bank of Scotland  moved to reassure thousands of workers that their state-backed companies would weather the turmoil sparked by Britain's decision to quit the European Union.",
        "date": "06282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Lloyds  RBS CEOs reassure staff on strength after Brexit vote "
    },
    {
        "content": "LONDON  June 28 The chief executives of Lloyds Banking Group and Royal Bank of Scotland moved to reassure thousands of workers that their state-backed companies would weather the turmoil sparked by Britain's decision to quit the European Union.",
        "date": "06282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-Lloyds  RBS CEOs reassure staff on strength after Brexit vote "
    },
    {
        "content": "LONDON  June 28 Royal Bank of Scotland  Chief Executive Officer Ross McEwan has warned staff that Britain's decision to leave the European Union has caused a range of economic uncertainties \"in the short  medium and long term\"  a memo seen by Reuters showed.",
        "date": "06282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS CEO tells staff Brexit will cause period of economic uncertainty "
    },
    {
        "content": "LONDON  June 27 Britain's government has scrapped plans to sell stakes in Royal Bank of Scotland  and Lloyds Banking Group this year in the wake of the Brexit vote  sources said  a decision set to leave a multi-billion pound hole in the country's public finances.",
        "date": "06282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RPT-British government puts sale of RBS  Lloyds stakes on hold after Brexit vote -sources "
    },
    {
        "content": "* Revolving facility with RBS to refinancing at a lower cost 39 million pounds of Circle Property Unit Trust current facilities  Source text for Eikon:  Further company coverage:",
        "date": "06272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Circle Property signs 50 million stg facility deal with RBS "
    },
    {
        "content": "LONDON  June 27 Britain's government has scrapped plans to sell stakes in Royal Bank of Scotland  and Lloyds Banking Group this year in the wake of the Brexit vote  sources said  a decision set to leave a multi-billion pound hole in its finances.",
        "date": "06272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "British government puts sale of RBS  Lloyds stakes on hold after Brexit vote -sources "
    },
    {
        "content": "LONDON Britain's top share index extended the previous session's steep losses on Monday as the country's vote last week to leave the European Union hurled it into political and economic uncertainty  hitting banks  housebuilders and airlines hard.",
        "date": "06272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Brexit vote wipes $130 billion off FTSE 100 in 2 days; banks slump "
    },
    {
        "content": "LONDON Britain's top share index fell again on Monday as Britain struggled with political and economic uncertainty after last week's vote to leave the European Union. Banks  housebuilders and budget airline easyJet were hit hard.",
        "date": "06272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "FTSE slumps again after Brexit vote; banks hit seven-year low "
    },
    {
        "content": "LONDON Shares in UK banks plunged on Monday as fears over the fallout from Britain's decision to leave the European Union sparked earnings downgrades and sell-offs by shell-shocked investors.",
        "date": "06272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK bank shares plunge as Brexit spooks investors "
    },
    {
        "content": "LONDON Royal Bank of Scotland  is planning to cut about 900 jobs in Britain  sources familiar with the process said  taking the total number of layoffs in the last four months to around 5 percent of the bank's British workforce.",
        "date": "06212016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS planning to cut 900 jobs to reduce costs: sources "
    },
    {
        "content": "LONDON  June 21 State-backed Royal Bank of Scotland is planning to axe about 900 UK jobs  sources familiar with the process told Reuters  taking the total number of layoffs to around 5 percent of its British workforce in the last four months.",
        "date": "06212016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS planning to cut 900 jobs to reduce costs - sources "
    },
    {
        "content": "LONDON The former CEO of a software company is suing RBS  for allegedly conspiring to push the business into administration to benefit from its sale  court filings show  in the latest case to allege misconduct by the bank's restructuring division.",
        "date": "06112016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Businessman sues RBS for $184 million over alleged conspiracy "
    },
    {
        "content": "LONDON  June 11 The former CEO of a software company is suing RBS for allegedly conspiring to push the business into administration to benefit from its sale  court filings show  in the latest case to allege misconduct by the bank's restructuring division.",
        "date": "06112016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Businessman sues RBS for $184 mln over alleged conspiracy "
    },
    {
        "content": "MOSCOW  June 8 Igor Kim  a Russian businessman who co-owns mid-sized Expobank  has signed an agreement to buy the Kazakh business of British bank RBS  a spokesperson for Kim said on Wednesday.",
        "date": "06082016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Russian businesman Kim agrees with RBS to buy Kazakh business "
    },
    {
        "content": "LONDON  June 3 (IFR) - Dave Rome  head of loan markets for the EMEA region at RBS  has joined Ashurst as the law firm's strategic director for corporate lending.",
        "date": "06032016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "CORRECTED-MOVES-RBS loans head Rome swaps banking for law firm "
    },
    {
        "content": "LONDON  May 12 Scotland's public prosecutor said on Thursday there was insufficient evidence to prosecute Royal Bank of Scotland or its directors over a 12 billion pound cash call on the eve of its near-collapse in 2008.",
        "date": "05122016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-Scottish prosecutors drop RBS rights issue case "
    },
    {
        "content": "LONDON  May 12 Scotland's Crown Office said on Thursday there was insufficient evidence of criminal conduct to prosecute Royal Bank of Scotland or its directors over the bank's 2008 rights issue.",
        "date": "05122016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Scottish prosecutors say no criminal case against RBS over rights issue "
    },
    {
        "content": "LONDON  May 10 Investors in state-backed Royal Bank of Scotland want the British government to intervene in the bank's seven-year struggle to sell a small business lender to meet European Union demands  which they say clash with UK taxpayers' interests.",
        "date": "05102016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS investors want review of EU imposed Williams & Glyn sale "
    },
    {
        "content": "EDINBURGH  May 4 Royal Bank of Scotland  Chairman Howard Davies said the state-backed lender was preparing as best it can for a potential phase of economic instability following a referendum on Britain's membership of the European Union.",
        "date": "05042016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS says preparing for Brexit uncertainty  eyes further cost cuts "
    },
    {
        "content": "LONDON  April 29 Britain's top stock market index slid on Friday to record its second straight week of losses  hit by a fall in the shares of Royal Bank of Scotland  and airline IAG.",
        "date": "04292016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Britain's FTSE pushed down by drops at RBS and IAG "
    },
    {
        "content": "LONDON Royal Bank of Scotland  reported a sharp rise in losses in the first quarter on Friday and cautioned on the timing of a return to dividend payouts as lower income  restructuring costs and sluggish asset sales underscored the challenges still facing the lender. | Video ",
        "date": "04292016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS's loss more than doubles  dividend prospects darken "
    },
    {
        "content": "* Net interest margin (nim) was stable compared with q1 2015 at 2.15 percent",
        "date": "04292016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS says expects 2016 restructuring costs to top 1 billion stg "
    },
    {
        "content": "* Q1 attributable loss 968 million stg (2015 q1: 459 million loss)",
        "date": "04292016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS Q1 losses widen  income drops by 13 pct "
    },
    {
        "content": "* Says \"nothing\" on the table regarding potential acquisition of Royal Bank of Scotland branches in Britain  Source text for Eikon:  Further company coverage:    (Reporting by Madrid newsroom)",
        "date": "04272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Santander CEO says not considering acquisition of RBS branches in UK "
    },
    {
        "content": "LONDON  April 28 Part-nationalised Royal Bank of Scotland risks missing an end-2017 deadline to sell its Williams & Glyn brand  it said on Thursday  raising doubts about how soon it will be ready to pay dividends and return to private ownership.",
        "date": "04282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS says may miss end-2017 deadline to carve out Williams & Glyn "
    },
    {
        "content": "LONDON  April 27 A leading proxy voting firm has advised shareholders to reject pay at three of Europe's banks when they host their annual general meetings in the coming days.",
        "date": "04272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Investors should oppose pay at StanChart  RBS  Deutsche Bank - PIRC "
    },
    {
        "content": "LONDON  April 26 Britain's financial watchdog said its keenly-awaited review of alleged mistreatment of business customers by Royal Bank of Scotland was in the final stages of completion but it could still not give a publication date.",
        "date": "04262016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UK watchdog says still no date for report on RBS business clients "
    },
    {
        "content": "* Have undertaken further extensive analysis on separation and divestment of Williams & Glyn",
        "date": "04282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS says may miss deadline to carve out Williams & Glyn "
    },
    {
        "content": "LONDON  April 28 Part-nationalised Royal Bank of Scotland said on Thursday it risked missing an end-2017 deadline to sell its Williams & Glyn brand  a condition of its crisis-era bailout.",
        "date": "04282016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS says may miss end-2017 deadline to carve out Williams & Glyn "
    },
    {
        "content": "TAIPEI  April 15 CTBC Financial  parent of Taiwan's biggest credit card company  said on Friday it is buying Royal Bank of Scotland's Malaysia unit for $189.7 million  in its latest overseas expansion.",
        "date": "04152016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Taiwan's CTBC Financial says to acquire RBS's Malaysian unit "
    },
    {
        "content": "LONDON State-backed Royal Bank of Scotland  is axing almost 600 jobs in its UK retail bank  according to sources familiar with the situation  in the latest round of job cuts and branch closures at the lender. All the employees impacted work in the bank's retail network in England and most are being told of the decision on Thursday  according to the sources  who asked not to named  because they are not authorized to discuss the plans.The cuts are occurring in branches in ",
        "date": "04142016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS planning to ax 600 UK jobs in cost-cutting plan: sources "
    },
    {
        "content": "LONDON  April 14 State-backed Royal Bank of Scotland is axing almost 600 jobs in its UK retail bank  according to sources familiar with the situation  in the latest round of job cuts and branch closures at the lender.",
        "date": "04142016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS planning to axe 600 UK jobs in cost-cutting plan -sources "
    },
    {
        "content": " ",
        "date": "04142016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "REPEAT--RBS planning to axe 600 UK jobs in cost-cutting plan- sources "
    },
    {
        "content": "LONDON  April 11 Royal Bank of Scotland (RBS.L) will close its corporate banking operations in India as part of a plan to sell or shut businesses in two-thirds of the countries it operates in  a person familiar with the situation said.",
        "date": "04112016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to close down India business as it shrinks global assets -source "
    },
    {
        "content": "* Royal bank of scotland group plc (\"rbsg\") completed pricing of its ten year  usd 1 500 000 000 aggregate principal amount of 4.800% senior notes due 2026.",
        "date": "03312016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-RBS prices $1.5 billion senior notes "
    },
    {
        "content": "LONDON  March 30 Royal Bank of Scotland  plans to buy back 5.2 billion pounds ($7.50 billion) worth of debt to lower its interest payments as it shrinks its operations around the world.",
        "date": "03302016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "REFILE-RBS launches tender offer to buy back 5.2 billion pounds worth of debt "
    },
    {
        "content": "LONDON  March 22 Royal Bank of Scotland  has made a final payment to Britain's finance ministry to cancel an arrangement that gives the government priority over dividends.",
        "date": "03222016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS pays dividend access scheme fee  moves closer to shareholder payouts "
    },
    {
        "content": "** Royal Bank of Scotland and Lloyds up about 1.5 pct following positive Nomura note",
        "date": "03182016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BUZZ-RBS  Lloyds propped up by bullish Nomura note "
    },
    {
        "content": "LONDON  March 15 Royal Bank of Scotland  plans to eliminate almost 500 UK-based jobs in its investment bank in an effort to cut costs  a source familiar with the matter said on Tuesday.",
        "date": "03152016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to cut 448 UK jobs in investment bank to reduce costs "
    },
    {
        "content": "LONDON  March 15 (IFR) - Royal Bank of Scotland said 448 jobs are to go in the middle and back office of its UK corporate and institutional bank.",
        "date": "03152016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to cut 448 UK jobs in investment bank "
    },
    {
        "content": "FRANKFURT  March 14 Britain's 'special status' deal with the European Union  aimed in part at securing London's future as a financial centre  could ultimately bolster the power of the European Central Bank  the chairman of Royal Bank of Scotland said on Monday.",
        "date": "03142016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS chairman says Cameron's EU deal could bolster ECB's powers "
    },
    {
        "content": "* completes acquisition of two portfolios of Italian non-performing loans with face value of more than 2 billion euros",
        "date": "03042016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Anacap buys 2 bln euro Italian NPL portfolios from GE  RBS "
    },
    {
        "content": "LONDON  Feb 26 British shares rallied on Friday and posted a second week of gains in a row  boosted by a rally in publisher Pearson and London Stock Exchange Group   though Royal Bank of Scotland reported its eighth full-year loss in a row.",
        "date": "02262016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Britain's FTSE rallies for second week  RBS plummets "
    },
    {
        "content": "LONDON  Feb 26 British shares rallied for a second session on Friday  boosted by a rally in commodities stocks and hopes of a profit recovery in publisher Pearson   though Royal Bank of Scotland reported its eighth full-year loss in a row.",
        "date": "02262016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's FTSE rallies on commodities rebound  RBS plummets "
    },
    {
        "content": "LONDON  Feb 24 Algebris Investments  the nearly $3 billion alternative asset manager  said on Wednesday it had hired Alberto Gallo as head of global macro strategies.",
        "date": "02242016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "REFILE-MOVES-Ex-RBS credit research chief joins Algebris Investments "
    },
    {
        "content": "* GRAPHIC-European banking shares: http://bit.ly/20ExhTe   (Adds details  background  shares)",
        "date": "02262016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS shares slump to three-year low after eighth straight yearly loss "
    },
    {
        "content": "LONDON  Feb 26 UK shares extended gains for a second session on Friday  boosted by a rally in commodities stocks and hopes of a profit recovery in publisher Pearson   though Royal Bank of Scotland reported its eighth full-year loss in a row.",
        "date": "02262016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's FTSE rallies on commodities rebound  RBS tanks "
    },
    {
        "content": "LONDON  Feb 26 Royal Bank of Scotland  more than doubled the pay of Chief Executive Ross McEwan in 2015  according to the bank's annual report published on Friday.",
        "date": "02262016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "CORRECTED-RBS boss McEwan's total pay more than doubles in 2015 "
    },
    {
        "content": "Feb 11 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "02112016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES- Royal London Asset Management  Morgan Stanley  RBS "
    },
    {
        "content": "* \u007fSays profit for quarter ended Sept 30 2015 restated to 1.082\u007f bln stg versus 1.094 bln stg earlier",
        "date": "02042016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Royal Bank of Scotland restates Q3 profit "
    },
    {
        "content": "LONDON Royal Bank of Scotland  tried to put its troubled past behind it on Wednesday by making a 3.6 billion pound ($5.1 billion) provision to top up its pension fund and make amends for British and U.S. mis-selling. | Video ",
        "date": "01272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS takes $5.1 billion hit in bid to break from past "
    },
    {
        "content": "* Sets aside extra 2.2 bln for U.S. litigation   (Adds CEO  CFO comments  share price)",
        "date": "01272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS takes $5.1 bln hit in bid to break from past "
    },
    {
        "content": "** British bank RBS slumps c.5 pct  among the top FTSE-100 fallers in good volume",
        "date": "01272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BUZZ-RBS: Q4 update takes toll "
    },
    {
        "content": "LONDON  Jan 27 Royal Bank of Scotland  said on Wednesday it would make a 4.2 billion pound ($6.02 billion) payment into its pension scheme due to changes in its accounting policy and would also set aside an extra 2.2 billion dollars for mortgage-related litigation in the United States.",
        "date": "01272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to take profit hit from pension charge  US litigation provisions "
    },
    {
        "content": "* \u007fAs at 31 December 2015  RBS expects to report a CET1 capital ratio of approximately 15% and TNAV per share of approximately 350p versus a CET1 capital ratio of 16.2%",
        "date": "01272016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS says goodwill impairment charge of 498 mln stg to hit Q4 profit "
    },
    {
        "content": "Royal Bank of Scotland could reach a settlement within weeks on claims it misled investors in selling U.S. mortgage-backed securities  passing another milestone in its recovery from the financial crisis  analysts said on Friday.",
        "date": "01152016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS settlement on U.S. mortgages could come within weeks - analysts "
    },
    {
        "content": "LONDON Royal Bank of Scotland could reach a settlement within weeks on claims it misled investors in selling U.S. mortgage-backed securities  passing another milestone in its recovery from the financial crisis  analysts said on Friday.",
        "date": "01152016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS settlement on U.S. mortgages could come within weeks: analysts "
    },
    {
        "content": "LONDON  Jan 15 Royal Bank of Scotland  could reach a settlement within weeks on claims it misled investors in selling U.S. mortgage-backed securities  passing another milestone in its recovery from the financial crisis  analysts said on Friday.",
        "date": "01152016",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS settlement on U.S. mortgages could come within weeks  -analysts "
    },
    {
        "content": "* Most of the shortfall at the biggest lenders   (Adds lawmaker  consultant comment)",
        "date": "12112015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-Bank of England gives banks until 2020 to build crisis funds "
    },
    {
        "content": "LONDON Royal Bank of Scotland (RBS) may ditch plans to float its 1.5 billion pound Williams & Glyn branch network after attracting interest from buyers looking to own a slice of Britain's rebounding bank sector.",
        "date": "12162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS looks at Williams & Glyn sale as buyers circle "
    },
    {
        "content": "* RBS to look at sale option and continue with plans for 2017 IPO",
        "date": "12162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 4-RBS looks at Williams & Glyn sale as buyers circle "
    },
    {
        "content": "LONDON  Dec 10 (IFR) - Tim Skeet  a managing director in Royal Bank of Scotland's debt capital markets fixed income team  has been put at risk  according to a market source.",
        "date": "12102015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-RBS' Skeet put at risk "
    },
    {
        "content": "LONDON  Dec 16 Spain's Sabadell said it had not made an approach to Royal Bank of Scotland to buy the UK bank's Williams & Glyn network of branches  and had no intention to get involved in the sale process.",
        "date": "12162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Sabadell says no interest in buying RBS's Williams & Glyn branches "
    },
    {
        "content": "LONDON  Dec 16 Royal Bank of Scotland  said on Wednesday it would begin a dual-track trade sale process of its William & Glyn banking business in the first half of 2016  after attracting informal interest from buyers.",
        "date": "12162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS eyes trade sale or IPO for Williams & Glyn unit "
    },
    {
        "content": "* \u007fhas made significant progress in separating williams & glyn\u007f",
        "date": "12162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS plans trade sale process for Williams & Glyn in H1 2016\u007f "
    },
    {
        "content": "LONDON  Dec 7 State-backed lender Royal Bank of Scotland (RBS) has teamed up with a trio of big investment firms to lend up to 100 million pounds ($151 million) to mid-sized British companies that are backed by private equity firms.",
        "date": "12072015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS teams up with investors to lend to private equity-backed UK firms "
    },
    {
        "content": "LONDON  Nov 26 A High Court judge on Thursday delayed the trial in a drawn-out battle between Royal Bank of Scotland and shareholders  criticising the lender and its legal advisers for being \"unfocused\" and swamped by 25 million documents.",
        "date": "11262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "British judge delays trial of RBS shareholder lawsuit to 2017 "
    },
    {
        "content": "LONDON  Nov 25 Britain could complete the sale of its holding in Royal Bank of Scotland by 2020/21 under government plans to sell almost 31 billion pounds ($46.8 billion) of shares in the bank in the next six years.",
        "date": "11252015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Britain to sell more RBS shares  Northern Rock loans "
    },
    {
        "content": "* Royal Bank Of Scotland Plc launches cash tender offers for certain euro and pounds sterling notes",
        "date": "11172015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-RBS launches cash tender offers for certain euro and pounds sterling notes "
    },
    {
        "content": "LONDON  Nov 12 Britain's state-backed Royal Bank of Scotland expects annual revenues in its corporate and institutional banking (CIB) business to fall to about 1.4 billion pounds ($2.1 billion) after it is restructured  down 65 percent from last year.",
        "date": "11122015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS sees investment bank unit revenues down 65 pct under revamp "
    },
    {
        "content": "LONDON  Nov 12 State-backed British lender Royal Bank of Scotland said it expects annual revenues in its corporate and institutional banking (CIB) business to fall to about 1.4 billion pounds  ($2.1 billion) after it is restructured  down 65 percent from last year.",
        "date": "11122015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS sees investment bank unit revenues down 65 pct under revamp "
    },
    {
        "content": "LONDON  Nov 4 Royal Bank of Scotland has denied allegations it manipulated evidence in order to pay lower compensation to small firms mis-sold complex interest rate hedging products.",
        "date": "11042015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS denies allegations it manipulated swaps compensation review "
    },
    {
        "content": "* Royal Bank of Scotland Group Plc - Visa Europe shareholding",
        "date": "11022015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-RBS expects an initial 200 mln stg pretax gain on completion of Visa deal "
    },
    {
        "content": "LONDON Royal Bank of Scotland said costs relating to alleged past misconduct could be substantially higher than expected  potentially hampering plans by the British government to sell more shares in the bank soon.",
        "date": "10302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS warns of higher misconduct charges  obstacles ahead "
    },
    {
        "content": "* Q3 operating loss 134 million pounds vs 1.1 bln profit   (Adds completion of Citizens sale)",
        "date": "10302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 4-RBS warns of higher misconduct charges  obstacles ahead "
    },
    {
        "content": "* Sold approximately 110 million shares  or 20.9 pct  of Citizens common stock  at a price per share of $23.38",
        "date": "10302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS raises $2.6 bln through Citizens Financial stake sale "
    },
    {
        "content": "LONDON  Oct 29 Royal Bank of Scotland is expected to make a loss in the third quarter  hit by costs relating to past misconduct and restructuring  hampering the British government's plans for a further sale of its shares.",
        "date": "10292015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS set for Q3 loss as restructuring  misconduct charges mount "
    },
    {
        "content": "DUBAI  Oct 28 National Bank of Abu Dhabi  (NBAD)  the largest lender by assets in the United Arab Emirates  bought Royal Bank of Scotland's offshore loan book in India for 3 billion dirhams ($816.8 million) in October  the bank's chief executive Alex Thursby said in a conference call on Wednesday.",
        "date": "10282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UAE bank NBAD purchased RBS's offshore loan book in India "
    },
    {
        "content": "** British bank RBS among the top FTSE-100  fallers in good volume",
        "date": "10302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BUZZ-RBS: Q3 update takes toll "
    },
    {
        "content": "LONDON  Oct 30 Royal Bank of Scotland is planning to make a final payment to Britain's finance ministry to cancel an arrangement that gives the government priority over dividends after selling its U.S. business Citizens  CFO Ewen Stevenson told reporters.",
        "date": "10302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS planning payment to end government dividend priority -CFO "
    },
    {
        "content": "* Announces it has sold all of its remaining shareholding in Citizens Financial Group Inc. in an underwritten public follow-on offering",
        "date": "10302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS sells remainder of Citizens Financial stake "
    },
    {
        "content": "LONDON  Oct 30 Royal Bank of Scotland  warned future costs relating to past misconduct could be substantially higher than expected after reporting a third-quarter loss due to restructuring and litigation charges.",
        "date": "10302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS warns future misconduct charges may be higher than expected "
    },
    {
        "content": "* Adjusted return on equity (4) in go-forward bank on an annualised basis for first nine months of 2015 is estimated at 13%",
        "date": "10302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS Q3 operating loss 134 mln stg vs 1.1 bln stg profit yr ago "
    },
    {
        "content": "LONDON  Oct 20 (IFR) - RBS has folded its hybrid and liability management team into the bank's syndicate business  according to sources familiar with the matter  as the after-effects of the recent overhaul of the bank's investment bank continue to be felt.",
        "date": "10202015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-RBS folds capital solutions businesses into syndicate "
    },
    {
        "content": "TEL AVIV Goldman Sachs Investment Partners (GSIP) Co-Head Raanan Agus said shares in Royal Bank of Scotland were a \"compelling investment\" and could almost double to 620 pence ($0.9556) within three years.",
        "date": "10142015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Goldman Sachs' Agus: RBS shares could almost double in three years "
    },
    {
        "content": "TEL AVIV  Oct 14 Goldman Sachs Investment Partners (GSIP) Co-Head Raanan Agus said shares in Royal Bank of Scotland were a \"compelling investment\" and could almost double to 620 pence ($0.9556) within three years.",
        "date": "10142015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Goldman Sachs' Agus: RBS shares could almost double in 3 years "
    },
    {
        "content": "MILAN/LONDON  Oct 12 Three consortia have submitted bids to buy 13 billion pounds  ($20 billion) of former Northern Rock loans being sold by the British government  drawing in big names including JPMorgan and Blackstone   several people familiar with the matter said.",
        "date": "10122015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Three groups bid for $20 bln book of ex-Northern Rock loans -sources "
    },
    {
        "content": "* RBS and Investec close syndication on £400m Octopus Solar financing",
        "date": "10162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-RBS and Investec close syndication on 400 mln stg Octopus Solar Financing "
    },
    {
        "content": "LONDON  Oct 8 Royal Bank of Scotland has appointed Katie Murray to the new role of director of finance  reporting to Chief Financial Officer Ewen Stevenson.",
        "date": "10082015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-RBS appoints new finance executive "
    },
    {
        "content": "LONDON  Oct 1 Royal Bank of Scotland  said it had submitted an application for a banking licence for Williams & Glyn  the lender it plans to spin off and float next year.",
        "date": "10012015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS asks for banking licence for Williams & Glyn spin-off "
    },
    {
        "content": "LONDON  Sept 30 A former foreign exchange trader fired by Royal Bank of Scotland said he was a scapegoat and the state-backed bank had \"dishonestly contrived\" his dismissal to deflect attention from its own failings.",
        "date": "09302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Fired RBS trader says he was 'scapegoat' for FX fine "
    },
    {
        "content": "LONDON Royal Bank of Scotland could buy back its own shares to help the British government offload its 73 percent stake in the bank  its chief executive told investors on Tuesday.",
        "date": "09292015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS may buy back shares to speed up government exit: CEO "
    },
    {
        "content": "LONDON  Sept 30 A former foreign exchange trader fired by Royal Bank of Scotland said he was a scapegoat and that the state-backed bank had \"dishonestly contrived\" his dismissal to divert attention from its own failings.",
        "date": "09302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-Fired RBS trader says he was 'scapegoat' for FX fine "
    },
    {
        "content": "LONDON  Sept 29 Royal Bank of Scotland  could buy back its own shares to help the British government offload its 73 percent stake in the bank  its chief executive told investors on Tuesday.",
        "date": "09292015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS may buy back shares to speed up government exit -CEO "
    },
    {
        "content": "* RBS CEO met regulator  fears punitive outcome from GRG review",
        "date": "09232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RPT-SPECIAL REPORT-Why RBS may pay small firms it allegedly ruined "
    },
    {
        "content": "LONDON One morning in May  the chief executive of Royal Bank of Scotland  one of Britain's biggest banks  called together his senior executives for an urgent briefing. Ross McEwan had just attended a meeting with officials at the financial regulator and had important news.  | Video ",
        "date": "09232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Special Report: Why RBS may pay small firms it allegedly ruined "
    },
    {
        "content": "* RBS CEO met regulator  fears punitive outcome from GRG review",
        "date": "09232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "SPECIAL REPORT-Why RBS may pay small firms it allegedly ruined "
    },
    {
        "content": "LONDON  Sept 23 (IFR) - Richard Bartlett  Eric Capp and Nicholas Bamber are leaving Royal Bank of Scotland as part of a reshuffle of the bank's wholesale business  according to several sources.",
        "date": "09232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-MOVES-Bartlett  Bamber  Capp leave as RBS reshuffles "
    },
    {
        "content": "LONDON  Sept 23 (IFR) - Richard Bartlett  head of UK client coverage at Royal Bank of Scotland  is leaving the bank  according to several sources.",
        "date": "09232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "MOVES-RBS UK client coverage head leaving the bank - sources "
    },
    {
        "content": "LONDON  Sept 16 A former Royal Bank of Scotland  foreign exchange trader is suing the state-backed bank over his dismissal last year  adding to a growing list of fired traders who claim they were treated unfairly.",
        "date": "09162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Former RBS FX trader joins list of ex-bankers suing over dismissals "
    },
    {
        "content": "LONDON Royal Bank of Scotland  has hired Bank of America Merrill Lynch  to prepare a spin-off of its Williams & Glyn-branded retail branches in the second half of 2016  a spokeswoman said on Sunday.",
        "date": "09132015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS appoints BoAML to ready 2016 listing of Williams & Glyn "
    },
    {
        "content": "LONDON  Sept 13 Royal Bank of Scotland  has hired Bank of America Merrill Lynch to prepare a spin-off of its Williams & Glyn-branded retail branches in the second half of 2016  a spokeswoman said on Sunday.",
        "date": "09132015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS appoints BoAML to ready 2016 listing of Williams & Glyn "
    },
    {
        "content": "LONDON  Sept 13 Royal Bank of Scotland  has hired Bank of America Merrill Lynch to prepare a spin-off of scores of its Williams & Glyn-branded retail branches  the Sunday Telegraph reported.",
        "date": "09132015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS appoints BoAML to ready 2016 listing of Williams & Glyn -newspaper "
    },
    {
        "content": "LONDON  Sept 11 The leading candidate to win control of Britain's opposition Labour Party said he would introduce a punitive windfall tax  aimed at recouping money lost by privatising state assets too cheaply  if he becomes prime minister in 2020.",
        "date": "09102015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Labour's Corbyn pledges UK windfall tax in 2020  targets RBS "
    },
    {
        "content": "LONDON  Sept 8 British lawmakers challenged public officials on Thursday over whether they had allowed more than 2 billion pounds ($3.1 billion) of government shares in Royal Bank of Scotland to be sold too cheaply last month.",
        "date": "09082015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UK officials deny selling RBS stake too cheaply "
    },
    {
        "content": "LONDON  Sept 7 Royal Bank of Scotland  will print its next generation of Scottish banknotes on plastic paper  rather than the traditional cotton.",
        "date": "09072015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to go plastic with next Scottish banknotes "
    },
    {
        "content": "WASHINGTON  Aug 27 The U.S. Labor Department is leaning toward denying requests for regulatory relief by three big foreign banks that pleaded guilty to manipulating Libor interest rates but want to keep managing  retirement accounts for clients.",
        "date": "08272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "U.S. leaning against regulatory relief for 3 banks in Libor scandal "
    },
    {
        "content": "LONDON  Aug 18 British state-backed lender Royal Bank of Scotland has sold its Luxembourg-based funds business to BlackFin Capital Partners  a private equity firm that specialises in financial services.",
        "date": "08182015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS sells Luxembourg funds business to private equity firm BlackFin "
    },
    {
        "content": "HONG KONG  Aug 17 (IFR) - Standard Chartered has appointed David Yim as head of Greater China debt capital markets  based in Hong Kong.",
        "date": "08172015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Stanchart hires Yim from RBS to head Greater China DCM "
    },
    {
        "content": "LONDON  Aug 12 State-backed Royal Bank of Scotland has awarded shares worth more than 3.3 million pounds ($5.2 million) to 10 executives under new \"role-based\" pay awards it brought in to avoid limits on annual bonuses.",
        "date": "08122015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS hands out $5.2 million in 'role-based' pay awards "
    },
    {
        "content": "LONDON  Aug 5 (IFR) - Royal Bank of Scotland is close to issuing a debut Additional Tier 1 capital  one of the bank capital market's longest-awaited capital raisings  after it began actively marketing to investors on Wednesday morning.",
        "date": "08052015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS nears end of road for AT1 debut "
    },
    {
        "content": "LONDON  Aug 5 (IFR) - Royal Bank of Scotland has begun marketing a debut Additional Tier 1 bond  according to a lead banker on the trade.",
        "date": "08052015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS starts marketing debut AT1 bond - lead "
    },
    {
        "content": "LONDON  Aug 6 State-backed Royal Bank of Scotland said it had completed the pricing of two issues of contingent convertible bonds  or CoCos  raising $3.1 billion to bolster its capital.",
        "date": "08062015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "CORRECTED-UPDATE 1-RBS raising $3.1 billion through issue of CoCo bonds "
    },
    {
        "content": "* Shareholders question if it offers best value for taxpayers",
        "date": "08022015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Lloyds shareholders question government's sale plan "
    },
    {
        "content": "* Successfully priced $3.15 billion additional tier 1 capital notes",
        "date": "08062015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS prices $3.15 billion additional tier 1 capital notes "
    },
    {
        "content": "LONDON Britain took a 1.1 billion pound ($1.7 billion) loss on its first sale of shares in Royal Bank of Scotland (RBS)  on Tuesday  sparking accusations of poor timing from opposition politicians. | Video ",
        "date": "08042015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UK takes one billion pounds hit in RBS sell-off "
    },
    {
        "content": "LONDON  Aug 4 Britain took a 1.1 billion pound ($1.7 billion) loss on its first sale of shares in Royal Bank of Scotland (RBS) on Tuesday  sparking accusations of poor timing from opposition politicians.",
        "date": "08042015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RPT-UPDATE 4-UK takes 1 billion pounds hit in RBS sell-off "
    },
    {
        "content": "* Stake sold at 330 pence/shr  2.3 pct discount   (Adds comments from sources  details)",
        "date": "08042015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 4-UK takes 1 billion pounds hit in RBS sell-off "
    },
    {
        "content": "LONDON  July 30 (IFR) - Royal Bank of Scotland has capitalised on positive quarterly results on Thursday and announced firm plans to raise an inaugural Additional Tier 1 bond  putting an end to one of the market's longest awaited capital raises.",
        "date": "07302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS unveils plans for inaugural CoCo bond "
    },
    {
        "content": "Aug 3 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "08032015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON The UK government's sale of shares in Royal Bank of Scotland  on Monday was 2.4 times covered by potential investors  a person familiar with the matter said.",
        "date": "08042015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK's sale of RBS shares was 2.4 times covered: source "
    },
    {
        "content": "* Shares up 3.3 pct   (Adds comments from chief executive  finance director)",
        "date": "07302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-Unexpected RBS profit boosts chance of early share sale "
    },
    {
        "content": "* UK faces loss on 45 bln stg RBS bailout after profit on Lloyds",
        "date": "08032015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 4-Seven years after bailout  Britain starts RBS sell-off with $3 bln stake sale "
    },
    {
        "content": "LONDON  Aug 4 The UK government's sale of shares in Royal Bank of Scotland on Monday was 2.4 times covered by potential investors  a person familiar with the matter said.",
        "date": "08042015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK's sale of RBS shares was 2.4 times covered -source "
    },
    {
        "content": "LONDON  July 30 Royal Bank of Scotland  reported a modest increase in second quarter profit after booking a 1.05 billion pounds charge for the costs of restructuring its business and setting aside 459 million to deal with conduct and litigation issues.",
        "date": "07302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS reports modest rise in Q2 profit after restructuring charge "
    },
    {
        "content": "LONDON State-backed Royal Bank of Scotland  intends to sell up to $2.2 billion shares in U.S. bank Citizens   which would cut its stake in that business to less than a quarter.",
        "date": "07282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to sell $2.2 billion Citizens shares to take stake below 25 percent "
    },
    {
        "content": "LONDON Britain started the sale of a 2 billion pounds ($3.1 billion) stake in Royal Bank of Scotland (RBS)  on Monday  beginning the disposal of its holding in the bank seven years after a multi-billion pound bailout at the height of the financial crisis.",
        "date": "08032015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Seven years after bailout  Britain starts RBS sell-off with $3 billion stake sale "
    },
    {
        "content": "LONDON  Aug 4 The UK government sold a 2.1 billion pound ($3.3 billion) stake in Royal Bank of Scotland (RBS) at 330 pence per share  kicking off the disposal of its holding seven years after bailing out the bank.",
        "date": "08042015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK sells 2.1 bln stg of RBS shares at 330 pence/shr "
    },
    {
        "content": "LONDON  July 28 State-backed Royal Bank of Scotland intends to sell up to $2.2 billion shares in U.S. bank Citizens  which would cut its stake in that business to less than a quarter.",
        "date": "07282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS to sell $2.2 bln Citizens shares to take stake below 25 pct "
    },
    {
        "content": "LONDON  Aug 3 Britain said it has started the sale of its stake in Royal Bank of Scotland seven years after it bailed out the bank  taking a loss on the sale of 2 billion pounds ($3.1 billion) of shares to institutional investors.",
        "date": "08032015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK starts RBS sell-off with sale of 2 bln stg stake "
    },
    {
        "content": "MUMBAI Royal Bank of Scotland Group Plc  is in talks to sell its Indian private banking business to Sanctum Wealth Management  a firm set up by its local private banking business head Shiv Gupta  a spokeswoman for the bank said on Monday.",
        "date": "07272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS in talks to sell Indian private banking unit to Sanctum Wealth "
    },
    {
        "content": "LONDON  July 28 State-backed Royal Bank of Scotland said it intends to sell up to $2.2 billion more shares in its former U.S. arm Citizens  which would cut its stake in the business to less than a quarter.",
        "date": "07282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS eyes $2.2 bln Citizens share sale to cut stake to below 25 pct "
    },
    {
        "content": "* Shareholders question if it offers best value for taxpayers",
        "date": "08032015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RPT-Lloyds shareholders question government's sale plan "
    },
    {
        "content": "DUBAI Royal Bank of Scotland  (RBS) has ended its plan to sell its United Arab Emirates cash management and trade finance business to Abu Dhabi Commercial Bank  (ADCB)  sources familiar with the matter said on Monday.",
        "date": "07272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS ends plan to sell UAE transaction services to ADCB "
    },
    {
        "content": "* Intention to sell part of citizens financial group in an underwritten public follow-on offering",
        "date": "07282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS says intends to sell part of shareholding in Citizens Financial "
    },
    {
        "content": "DUBAI  July 27 Royal Bank of Scotland  (RBS) has ended its plan to sell its United Arab Emirates cash management and trade finance business to Abu Dhabi Commercial Bank (ADCB)  sources familiar with the matter said on Monday.",
        "date": "07272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS ends plan to sell UAE transaction services to ADCB -sources "
    },
    {
        "content": "LONDON Britain has removed a potential obstacle to an imminent sale of its shares in Royal Bank of Scotland   telling a  watchdog to delay finalizing advice on the competition impact of spinning off scores of branches under the Williams & Glyn brand.",
        "date": "07242015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Britain removes possible obstacle to RBS stake sale "
    },
    {
        "content": "LONDON Royal Bank of Scotland has agreed two separate disposals of non-performing loans as part of a continued sale of unwanted assets that has so far seen 1 trillion pounds ($1.55 trillion) shed from its balance sheet.",
        "date": "07232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Britain's RBS sells non-performing loan portfolios "
    },
    {
        "content": "* Bank says it is on track to meet sale deadline   (Recasts  adds comment from RBS spokesman)",
        "date": "07242015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-Britain removes possible obstacle to RBS stake sale "
    },
    {
        "content": "* Second portfolio sale to Cerberus for 225 mln stg   (Recasts  adds sale of further portfolio to Cerberus)",
        "date": "07232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-Britain's RBS sells non-performing loan portfolios "
    },
    {
        "content": "LONDON Royal Bank of Scotland has appointed external advisers to launch a fresh investigation into its treatment of small business customers  sources familiar with the matter said.",
        "date": "07222015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Exclusive: RBS hires advisers to look at treatment of small businesses "
    },
    {
        "content": "LONDON  July 21 (IFR) - RBS has made Doug Munro head of financial institutions  debt capital markets for UK and Ireland.",
        "date": "07212015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Munro made head of FI at RBS "
    },
    {
        "content": "LONDON  July 23 Royal Bank of Scotland  said it had agreed to sell a portfolio of loans to an entity funded by Deutsche Bank and funds affiliated with Apollo Global Management.",
        "date": "07232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to sell loans to Deutsche Bank  Apollo in 400 mln stg deal "
    },
    {
        "content": "LONDON  July 21 Britain's government unveiled plans on Tuesday to centralise financial regulation further at the Bank of England and reinforce its own powers to shield taxpayers from having to prop up failing lenders in future.",
        "date": "07212015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK consolidates Bank of England's bank supervision role "
    },
    {
        "content": "LONDON  July 14 (IFR) - RBS's former DCM syndicate head Richard Tynan has returned to the market as managing director at PrimeRevenue. He will be in charge of structuring and providing product to investors primarily in the supply chain finance area.",
        "date": "07142015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-Tynan resurfaces at PrimeRevenue "
    },
    {
        "content": "LONDON/ATHENS Royal Bank of Scotland  is winding down its Greek operation and is putting its $5 billion shipping loans portfolio up for sale as the group scales back non-core activities  finance sources familiar with the plans said on Friday.",
        "date": "07102015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Exclusive: RBS looking to sell $5 billion Greek shipping loan business "
    },
    {
        "content": "July 10 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "07102015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "LONDON  July 3 State-backed Royal Bank of Scotland may need to pay $13 billion to settle claims it misled investors in mortgage-backed securities  according to documents filed in a U.S. court.",
        "date": "07032015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS could face $13 billion bill in U.S. mortgage bond case -court filings "
    },
    {
        "content": "LONDON Britain plans to sell at least three-quarters of its stake in Royal Bank of Scotland  over the next five years  raising 25 billion pounds ($38 billion)  the body that manages the government's stake in the bank said on Wednesday.",
        "date": "07082015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UK plans to raise $38 billion from RBS sales by 2020 "
    },
    {
        "content": "* UKFI was asked to examine feasibility of sale plan   (Adds comment from UKFI chairman)",
        "date": "07082015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-UK plans to raise $38 billion from RBS sales by 2020 "
    },
    {
        "content": "LONDON Britain is planning to sell half its stake in Royal Bank of Scotland   worth 16 billion pounds ($25 billion)  within two years of a possible first sale in September  sources with knowledge of government thinking told Reuters.",
        "date": "07062015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Exclusive: Britain targets sale of half its RBS stake in two years - sources "
    },
    {
        "content": "LONDON  July 8 Britain plans to sell at least three-quarters of its stake in Royal Bank of Scotland  over the next five years  raising 25 billion pounds ($38 billion)  the body that manages the government's stake in the bank said on Wednesday.",
        "date": "07082015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK plans to raise $38 billion from RBS shares sales by 2020 "
    },
    {
        "content": "LONDON State-backed Royal Bank of Scotland  may need to pay $13 billion to settle claims it misled investors in mortgage-backed securities  according to documents filed in a U.S. court.",
        "date": "07062015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS could face $13 billion bill in U.S. mortgage bond case -court filings "
    },
    {
        "content": "LONDON  July 2 Royal Bank of Scotland  said it will no longer provide cash management and trade finance services to thousands of customers outside Britain and Ireland and will instead refer them to French bank BNP Paribas.",
        "date": "07022015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "REFILE-UPDATE 1-RBS refers clients to Paribas for transaction services "
    },
    {
        "content": "LONDON  July 2 Royal Bank of Scotland  said it had signed a referral agreement with BNP Paribas to support customers within its Global Transaction Services division.",
        "date": "07022015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to refer global transaction customers to Paribas "
    },
    {
        "content": "LONDON  June 22 Royal Bank of Scotland  said the appointment of incoming Chairman Howard Davies as a non-executive director had been delayed.",
        "date": "06222015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS appointment of incoming chairman Davies to board is delayed "
    },
    {
        "content": "EDINBURGH Royal Bank of Scotland  expects a substantial increase in its capital thanks to the sale of businesses over the coming years and intends to return some of it to shareholders  Chief Executive Ross McEwan said.",
        "date": "06232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS plans to return surplus cash to shareholders "
    },
    {
        "content": "LONDON  June 19 Royal Bank of Scotland  said a computer systems failure that led to 600 000 payments not being processed had been resolved and customer accounts had been updated.",
        "date": "06192015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS says technology glitch resolved and accounts updated "
    },
    {
        "content": "* Bank launches 'full review' into IT failure   (Adds CEO comments on government share sale)",
        "date": "06232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 4-RBS plans to return surplus cash to shareholders "
    },
    {
        "content": "LONDON  June 23 Royal Bank of Scotland's  Chief Executive Ross McEwan said he remained confident that the bank would meet a deadline to spin off its Williams & Glyn business before the end of 2016.",
        "date": "06232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS CEO says Williams & Glyn IPO remains on track for late 2016 "
    },
    {
        "content": "LONDON  June 23 Rbs chairman says most of it systems are 'pretty new'  no clear root cause identified for it problem Rbs ceo says will be doing full review of last week's it failure and that process has started Rbs fd says there will be incremental small write-backs on citizens stake Rbs chairman says free in-credit banking probably behind things like ppi mis-selling Rbs chairman says future of free in-credit banking 'quite a dilemma' for industry   (Reporting by Matt Scuffham)",
        "date": "06232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS chair says free banking probably to blame for PPI mis-selling "
    },
    {
        "content": "LONDON  June 23 Royal Bank of Scotland  Chairman Philip Hampton said on Tuesday it would take the government several years to sell its 78 percent shareholding in the bailed-out British lender.",
        "date": "06232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS chairman says will take several years for UK to sell shares "
    },
    {
        "content": "* IT chief says investment helped to tackle problem   (Adds further comment from RBS executive)",
        "date": "06182015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS to invest in making computer systems more resilient "
    },
    {
        "content": "LONDON  June 18 Royal Bank of Scotland  will invest around 150 million pounds ($239 million) a year to improve the resilience of its computer systems  Chief Administration Officer Simon McNamara said on Thursday.",
        "date": "06182015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS says to invest 150 mln stg/year to improve IT resilience "
    },
    {
        "content": "* BoE says working with RBS to resolve problem   (Adds statement from RBS  lawmaker Tyrie  customer responses)",
        "date": "06172015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS customers face wait for payments after another IT failure "
    },
    {
        "content": "LONDON  June 17 (IFR) - Sam Boughton has joined the corporate investment grade syndicate team at RBS in London  according to the bank.",
        "date": "06172015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "MOVES-Boughton joins RBS corporate syndicate "
    },
    {
        "content": "LONDON  June 17 Royal Bank of Scotland  said 600 000 customer transactions had not been processed after another technology problem at the state-backed bank.",
        "date": "06172015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS says 600 000 payment transactions hit by IT problem "
    },
    {
        "content": "June 11 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06112015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES- JPMorgan  London Stock Exchange  Royal Bank Of Scotland "
    },
    {
        "content": "LONDON Shares in Royal Bank of Scotland  rose after Britain's Conservative government said it would start selling its 32-billion pound ($49.6 billion) stake at a loss  a decision criticized by the opposition Labour party. | Video ",
        "date": "06112015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS shares rise despite Labour criticism of share sale "
    },
    {
        "content": "LONDON  June 11 Gains in Royal Bank of Scotland shares bolstered Britain's top equity index on Thursday on news it would be returned to private hands sooner than expected  while Royal Mail stock fell after the government sold half its stake at a discount.",
        "date": "06112015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Royal Mail  RBS share sales dominate as FTSE edges higher "
    },
    {
        "content": "LONDON  June 10 Britain will start selling its 32 billion-pound stake in Royal Bank of Scotland in the coming months  finance minister George Osborne said on Wednesday  giving up on his previous intention to only sell the shares for a profit.",
        "date": "06102015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain to start selling shares in RBS as Osborne swallows loss "
    },
    {
        "content": "June 9 Ratings agency Standard & Poor's downgraded several U.K. and German banks  including Deutsche Bank AG and Barclays Plc  saying it considers government support for these banks to be uncertain.",
        "date": "06092015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "S&P lowers ratings of Barclays  Deutsche and RBS "
    },
    {
        "content": "* Analysts expect demand from U.S. institutions   (Adds comment from Treasury Committee chairman  closing shares)",
        "date": "06112015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 4-RBS shares rise despite Labour criticism of share sale "
    },
    {
        "content": "LONDON Royal Bank of Scotland is set to appoint Bank of America as its new corporate broker  a person familiar with the matter said on Thursday.",
        "date": "06112015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS set to appoint Bank of America as corporate broker: source "
    },
    {
        "content": "LONDON  June 11 Royal Bank of Scotland  is set to appoint Bank of America as its new corporate broker  a person familiar with the matter said on Thursday.",
        "date": "06112015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS set to appoint Bank of America as corporate broker -source "
    },
    {
        "content": "LONDON Britain could make an initial sale of shares in Royal Bank of Scotland  in September to avoid clashing with the full privatisation of Lloyds Banking Group  next March  banking and political sources said.",
        "date": "06052015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UK weighs September RBS sale to avoid Lloyds clash: sources "
    },
    {
        "content": "The backers of payment processing company Worldpay are set to hire six banks to lead the company's London stock market listing  valued at around 6 billion pounds ($9.22 billion)  a source familiar with the matter said on Friday.",
        "date": "06052015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Worldpay to hire banks for its $9.2 billion London float: source "
    },
    {
        "content": "June 1 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06012015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-Morgan Stanley  Citigroup  BoFA  Prudential "
    },
    {
        "content": "LONDON  June 5 Britain could make an initial sale of shares in Royal Bank of Scotland in September to avoid clashing with the full privatisation of Lloyds Banking Group next March  banking and political sources said.",
        "date": "06052015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "REFILE-UPDATE 2-UK weighs September RBS sale to avoid Lloyds clash -sources "
    },
    {
        "content": "LONDON  June 5 Britain may accelerate plans to start selling shares in Royal Bank of Scotland to avoid a sale clashing with the full privatisation of Lloyds Banking Group in March next year  banking and political sources said.",
        "date": "06052015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK may speed up RBS sale to avoid clash with Lloyds exit-sources "
    },
    {
        "content": "June 1 Royal Bank of Scotland investment bank's global head of  asset-backed products and credit trading has left the bank  Bloomberg reported on Monday.",
        "date": "06012015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "MOVES-RBS head of asset-backed products leaves -Bloomberg "
    },
    {
        "content": "LONDON  May 29 Royal Bank of Scotland  has invited investment banks to pitch for the role of corporate broker as the state-backed lender gears up for a full return to public hands  two sources familir with the matter told Reuters on Friday.",
        "date": "05292015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS invites pitches for broker role ahead of privatisation - sources "
    },
    {
        "content": "LONDON  May 28 Royal Bank of Scotland  could be asked to increase the size of the Williams & Glyn business it plans to sell next year after the British government asked for a speedy review of its impact on competition in the banking market.",
        "date": "05282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS may need to bulk up Williams & Glyn to improve competition "
    },
    {
        "content": "LONDON  May 26 Britain's top equity index fell on Tuesday  with banking stocks coming under pressure after regional election results in Spain  put euro zone financials on the back foot  and energy shares tracking weaker crude oil prices.",
        "date": "05262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's FTSE falls  energy and banking stocks weigh "
    },
    {
        "content": "LONDON  May 28 Britain's competition watchdog has been asked to assess the impact of the planned spin-off of new bank Williams & Glyn for competition in the UK banking sector  so the government can judge if more needs to be done.",
        "date": "05282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK to assess impact of RBS Williams & Glyn sale on competition "
    },
    {
        "content": "LONDON  May 26 Britain's top equity index fell on Tuesday  with banking stocks coming under pressure after regional election results in Spain  put euro zone financials on the back foot  and energy shares tracking weaker crude oil prices.",
        "date": "05262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Banking and energy shares drag down FTSE index "
    },
    {
        "content": "LONDON  May 21 Until this week  two major investment banks expected Europe's benchmark German Bund yield to turn negative this year. Now there's only one.",
        "date": "05212015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS holds negative Bund yield call as Citi throws in the towel "
    },
    {
        "content": "May 21 - The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "05212015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "PRESS DIGEST- British Business - May 21 "
    },
    {
        "content": "NEW YORK/LONDON  May 20 Four major banks pleaded guilty on Wednesday to trying to manipulate foreign exchange rates and  with two others  were fined nearly $6 billion in another settlement in a global probe into the $5 trillion-a-day market.",
        "date": "05202015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "WRAPUP 7-Global banks admit guilt in forex probe  fined nearly $6 bln "
    },
    {
        "content": "LONDON Royal Bank of Scotland said it would take into account the $669 million paid in fines to U.S. authorities following misconduct in its foreign exchange business when making future pay decisions for its staff.",
        "date": "05202015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS says forex fines to influence future pay decisions "
    },
    {
        "content": "* Shares up 2 percent   (Adds share comments from CEO  share price)",
        "date": "05202015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS says forex fines to influence future pay decisions "
    },
    {
        "content": "LONDON Britain may begin selling part of the state's holding in Royal Bank of Scotland  at a loss later this year  sources familiar with the matter told Reuters.",
        "date": "05102015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Britain may sell RBS shares at loss this year -sources "
    },
    {
        "content": "* Treasury says no new information to provide   (Adds confirmation of plans from sources)",
        "date": "05102015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-Britain may sell RBS shares at loss this year -sources "
    },
    {
        "content": "May 12 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05122015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES- Standard Chartered  RBS  Lloyds "
    },
    {
        "content": "NEW YORK A U.S. judge on Monday ruled that Nomura Holdings Inc made false statements in selling mortgage-backed securities to Fannie Mae and Freddie Mac ahead of the 2008 financial crisis.",
        "date": "05112015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Nomura misled Fannie  Freddie on mortgage bonds  U.S. judge finds "
    },
    {
        "content": "LONDON British Chancellor George Osborne may sell state-owned shares in Royal Bank of Scotland  at a loss as part of plans for an accelerated sale of government holdings in the sector  a newspaper reported.",
        "date": "05102015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Osborne may sell state-owned RBS shares at a loss - paper "
    },
    {
        "content": "LONDON  May 12 Royal Bank of Scotland  has appointed Marcelino Castrillo managing director of business banking  handing him the task of restoring trust in a bank which has been criticised for its treatment of small firms.",
        "date": "05122015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "MOVES-RBS appoints Santander executive as business banking head "
    },
    {
        "content": "NEW YORK  May 11 A U.S. judge on Monday ruled that Nomura Holdings Inc made false statements in selling mortgage-backed securities to Fannie Mae and Freddie Mac ahead of the 2008 financial crisis.",
        "date": "05112015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-Nomura misled Fannie  Freddie on mortgage bonds  U.S. judge finds "
    },
    {
        "content": "LONDON  May 10 British finance minister George Osborne may sell state-owned shares in Royal Bank of Scotland  at a loss as part of plans for an accelerated sale of government holdings in the sector  a newspaper reported.",
        "date": "05102015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK's Osborne may sell state-owned RBS shares at a loss -paper "
    },
    {
        "content": "ZURICH  May 7 Royal Bank of Scotland's  overseas private banking arm  Coutts International  said on Thursday its Chief Executive Alexander Classen would leave  which comes shortly after Union Bancaire Privee (UBP) agreed to buy the wealth manager.",
        "date": "05072015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Coutts Intl CEO exits following sale to Union Bancaire Privee "
    },
    {
        "content": "April 28 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-RBS  BofA Merrill Lynch  HSBC  Metro Bank "
    },
    {
        "content": "* Maltby will resume role as advisor to investors   (Adds comments from RBS CEO  background on changes)",
        "date": "04282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS names Ulster Bank chief as boss of Williams & Glyn "
    },
    {
        "content": "LONDON  April 28 Royal Bank of Scotland  said it had appointed Jim Brown  currently boss of its Irish business  to replace John Maltby as chief executive of its Williams & Glyn business  which is due to become a new UK \"challenger\" bank.",
        "date": "04282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS says Ulster Bank CEO Brown to become boss of Williams & Glyn "
    },
    {
        "content": "DUBAI  April 30 Royal Bank of Scotland  (RBS) has closed its branch in Qatar with its country head departing  RBS told Reuters on Thursday  the latest step in its withdrawal from the Middle East.",
        "date": "04302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS returns Qatar banking licence  country head departs "
    },
    {
        "content": "LONDON Royal Bank of Scotland (RBS) said it expects to settle with U.S. authorities investigating alleged foreign exchange manipulation in the coming weeks and set aside a further 334 million pounds ($515 million) to cover the cost. | Video ",
        "date": "04302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS sets aside $515 million for looming U.S. forex fines "
    },
    {
        "content": "LONDON  April 30 Britain's top equity index extended a pullback on Thursday from record highs earlier this week as a fall in Royal Bank of Scotland and uncertainty over next week's national election weighed on the market.",
        "date": "04302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's FTSE falters as RBS shares retreat "
    },
    {
        "content": "LONDON  April 27 (IFR) - Mark Byrne has resigned from the SSA syndicate desk at Royal Bank of Scotland and is expected to join the SSA desk at TD Securities  market sources told IFR on Monday.",
        "date": "04272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "PEOPLE: Byrne leaving RBS for TD Securities: sources "
    },
    {
        "content": "* Q1 operating profit 1.6 bln stg  up 16 percent   (Recasts  adds CEO comments  details on settlement timing)",
        "date": "04302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS sets aside $515 million for looming U.S. forex fines "
    },
    {
        "content": "LONDON  April 30 Rbs ceo says expects fx settlements to occur in the second quarter Rbs ceo says expects another tough year; many conduct  litigation hurdles looming Rbs ceo says no disagreement with rory cullinan on strategy; issues were around execution Rbs ceo says expects u.s. Rmbs settlements to occur in second half of 2015 Rbs fd says restructuring costs will \"remain elevated\" this year Rbs ceo says no disagreement on strategy with cullinan; 'these things happen in large organi",
        "date": "04302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS CEO says expects FX settlements in the second quarter "
    },
    {
        "content": "LONDON Deutsche Bank's plan to jettison much of its German retail bank and withdraw from one in ten countries sees it join a growing list of banks choosing to shrink and simplify to survive.",
        "date": "04272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "\"Smaller and simpler\" mantra rings through banking boardrooms "
    },
    {
        "content": "* RBS says on foreign exchange failings  in advanced settlement discussions in criminal investigation conducted by DOJ and with certain other authorities",
        "date": "04302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS says in advanced settlement discussions with DOJ on FX probe "
    },
    {
        "content": "LONDON  April 30 Royal Bank of Scotland  set aside 856 million pounds ($1.3 billion) to cover charges for past misconduct and litigation  helping push the state-backed lender to a loss in the first quarter.",
        "date": "04302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS sets aside further $1.3 bln for misconduct charges "
    },
    {
        "content": "LONDON  April 27 Royal Bank of Scotland  has sold a further portfolio of North American loans to Mizuho   as it continues to sell off unwanted international assets to focus on domestic lending.",
        "date": "04272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS sells further North American loan portfolio to Mizuho "
    },
    {
        "content": "MUMBAI  April 10 IndusInd Bank Ltd  said it would buy Royal Bank of Scotland's diamond and jewellery financing business in India and the related deposit portfolio.",
        "date": "04102015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "IndusInd Bank to buy RBS's India jewellery financing business "
    },
    {
        "content": "April 13 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "04132015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON State-backed British bank Royal Bank of Scotland Plc  said it intends to sell its Luxembourg-based fund management business as part of its plan to shrink and focus on its core UK retail and commercial banking.",
        "date": "04132015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to sell $30 billion Luxembourg fund management business "
    },
    {
        "content": "LONDON  April 13 State-backed British bank Royal Bank of Scotland Plc said it intends to sell its Luxembourg-based fund management business as part of its plan to shrink and focus on its core UK retail and commercial banking.",
        "date": "04132015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to sell $30 bln Luxembourg fund management business "
    },
    {
        "content": "NEW YORK Mizuho Bank [MZFGEU.UL] is expected to hire roughly 200 Royal Bank of Scotland [RBSRB.UL] employees as early as next week following its agreement to buy RBS's U.S. and Canadian $36.5 billion loan portfolio  banking sources told Thomson Reuters LPC and IFR.",
        "date": "04022015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Mizuho to hire 200 RBS employees to build U.S. unit "
    },
    {
        "content": "NEW YORK  April 2 Mizuho Bank's purchase of Royal Bank of Scotland's US and Canadian loan portfolio in a deal worth $3 billion is causing a stir with banks and blue-chip borrowers in the US investment-grade loan market.",
        "date": "04022015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "TRLPC-Mizuho's RBS portfolio purchase tests loan relationships "
    },
    {
        "content": "* Transaction expected to be complete during April   (Adds detail  context  background)",
        "date": "04012015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS sells $817 mln of UAE company loans to Dubai bank CBD "
    },
    {
        "content": "LONDON  March 30 Royal Bank of Scotland  executive Rory Cullinan is to leave its investment bank at the end of April  the state-backed lender said only a month after putting him in charge of the business.",
        "date": "03302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS investment bank boss's departure announced after a month in the job "
    },
    {
        "content": "LONDON  March 30 Royal Bank of Scotland  executive Rory Cullinan left as head of its investment bank after a disagreement over the implementation of strategy  a person familiar with the matter said.",
        "date": "03302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS investment bank boss goes after disagreement on strategy implementation -source "
    },
    {
        "content": "ZURICH/LONDON Switzerland's Union Bancaire Privee (UBP) is buying the international business of 300-year-old British wealth manager Coutts  the latest deal by a Swiss private bank aimed at branching out from its struggling home market.",
        "date": "03272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Switzerland's UBP to buy RBS's Coutts International "
    },
    {
        "content": "* Price to be set by assets remaining when deal closes   (Adds analyst  detail  background)",
        "date": "03272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-Switzerland's UBP to buy RBS's Coutts International "
    },
    {
        "content": "ZURICH  March 27 Swiss private bank Union Bancaire Privee (UBP) said on Friday it had agreed to buy Royal Bank of Scotland's international private banking arm Coutts International.",
        "date": "03272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Swiss private bank UBP says to buy RBS's Coutts International "
    },
    {
        "content": "* Sale includes relationships managed from Switzerland  Monaco  UAE  Qatar  Singapore and Hong Kong",
        "date": "03272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS to sell private banking and wealth businesses "
    },
    {
        "content": "ZURICH Swiss private bank Union Bancaire Privee (UBP) is set to buy Royal Bank of Scotland's international private banking arm Coutts International  a source familiar with the deal told Reuters on Thursday.",
        "date": "03262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UBP set to buy RBS's Coutts International "
    },
    {
        "content": "ZURICH  March 26 Swiss private bank Union Bancaire Privee (UBP) is set to buy Royal Bank of Scotland's  international private banking arm Coutts International  a source familiar with the deal told Reuters on Thursday.",
        "date": "03262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-UBP set to buy RBS's Coutts International "
    },
    {
        "content": "WASHINGTON  March 23 The U.S. Federal Reserve and the Federal Deposit Insurance Corp. on Monday criticized plans by three foreign banks to go through ordinary bankruptcy in times of crisis.",
        "date": "03232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "U.S. bank regulators say RBS  BNP  HSBC living wills fall short "
    },
    {
        "content": "ZURICH  March 26 Swiss private bank Union Bancaire Privee (UBP) is set to buy Royal Bank of Scotland's  international private banking arm Coutts international  a source familiar with the deal told Reuters on Thursday.",
        "date": "03262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Union Bancaire Privee set to buy RBS's Coutts international-source "
    },
    {
        "content": "LONDON Incoming Royal Bank of Scotland Chairman Howard Davies has defended his role in setting up the financial regulator that presided over the near meltdown of Britain's banking system.",
        "date": "03232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "New RBS chairman defends his record as regulator "
    },
    {
        "content": "DUBAI Lloyds Banking Group and Natixis have sold their holdings in debt of Dubai World   the state-owned conglomerate nearing a $14.6 billion debt restructuring  according to sources familiar with the matter.",
        "date": "03192015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Lloyds  Natixis and RBS sell Dubai World debt before $14.6 billion deal-sources "
    },
    {
        "content": "LONDON Royal Bank of Scotland  is to sell up to $3.3 billion more shares in its U.S. bank Citizens  to cut its stake to less than half and accelerate its retreat to its home UK market.",
        "date": "03232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to sell $3 billion more Citizens shares to cut stake to less than half "
    },
    {
        "content": "DUBAI  March 19 Lloyds Banking Group  and Natixis have sold their holdings in debt of Dubai World  the state-owned conglomerate nearing a $14.6 billion debt restructuring  according to sources familiar with the matter.",
        "date": "03192015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-Lloyds  Natixis and RBS sell Dubai World debt before $14.6 bln deal-sources "
    },
    {
        "content": "DUBAI  March 19 Lloyds Banking Group  and Natixis have sold their exposures to Dubai World   the state-owned conglomerate nearing a $14.6 billion debt restructuring  according to sources familiar with the matter.",
        "date": "03192015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Lloyds  Natixis and RBS sell Dubai World debt before $14.6 bln deal-sources "
    },
    {
        "content": "* Accelerates RBS's retreat to core UK market   (Adds details  background)",
        "date": "03232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS to sell $3 bln more Citizens shares to cut stake to less than half "
    },
    {
        "content": "LONDON  March 23 Royal Bank of Scotland  is to sell up to another 132 million shares in its U.S. bank Citizens to cut its stake to less than half.",
        "date": "03232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS announces further share sale in US arm Citizens "
    },
    {
        "content": "DUBAI Royal Bank of Scotland  is exploring options for the sale or wind-down of its corporate and institutional banking operations in central and eastern Europe  the Middle East and Africa (CEEMEA)  a spokeswoman for the bank said on Monday.",
        "date": "03162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS eyes sale or wind-down of some overseas investment banking ops "
    },
    {
        "content": "March 16 British wealth manager Rathbone Brothers Plc appointed Sarah Owen-Jones as its chief risk officer.",
        "date": "03162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "MOVES-Wealth manager Rathbone names RBS exec as risk chief "
    },
    {
        "content": "* Bank considers sale or wind-down of business in central and eastern Europe  the Middle East and Africa - RBS",
        "date": "03162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS eyes sale or wind-down of some overseas investment banking ops "
    },
    {
        "content": "DUBAI  March 16 Royal Bank of Scotland  is exploring options for the sale or wind-down of its corporate and institutional banking operations in central and eastern Europe  the Middle East and Africa (CEEMEA)  a spokeswoman for the bank said on Monday.",
        "date": "03162015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS eyes sale or wind-down of CEEMEA corporate  institutional banking "
    },
    {
        "content": "LONDON  March 11 A British government run by the Labour Party would take its time in selling its ownership of state-controlled bank RBS in order to get taxpayers' money back  the man who would be finance minister if Labour wins May's elections said on Wednesday.",
        "date": "03112015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UK should take time to get money back from RBS -Labour's Balls "
    },
    {
        "content": "* CEO paid 1.85 mln stg for 2014  FD got 3.1 mln   (Adds further details  quote from lawmaker)",
        "date": "03062015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-Britain's RBS pays 110 staff more than $1.1 million "
    },
    {
        "content": "LONDON  March 6 State-backed Royal Bank of Scotland said it paid three staff between 5 million euros ($5.5 million) and 6 million euros ($6.6 million) last year  risking a political backlash.",
        "date": "03062015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Britain's RBS paid 3 staff more than $5.5 million last year "
    },
    {
        "content": "The British government would like to \"get rid of\" its stake in Royal Bank of Scotland  as quickly as possible  British finance minister George Osborne was quoted saying on Friday  but warned a sale could take years to complete.",
        "date": "03062015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK's Osborne wants quick RBS sale but could still take years: FT "
    },
    {
        "content": "* Says taxpayers won't want to take loss on sale   (Adds details)",
        "date": "03062015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-UK's Osborne wants quick RBS sale but could still take years-FT "
    },
    {
        "content": "March 5 British finance minister George Osborne said not radically restructuring Royal Bank of Scotland  in 2010 was a mistake and now says he would like \"to get rid of the stake as quickly as we can\" after the general election  the Financial Times reported.",
        "date": "03062015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "CORRECTED-George Osborne admits RBS error and calls for early sale -FT "
    },
    {
        "content": "LONDON Royal Bank of Scotland  has yet to decide how many jobs it will cut at its investment bank after announcing a major downsizing of the business last week  its Chief Executive Ross McEwan said on Tuesday.",
        "date": "03042015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS boss says no number set for 'significant' investment bank job cuts "
    },
    {
        "content": "British finance minister George Osborne said not radically restructuring Royal Bank of Scotland  in 2010 was a mistake and now says he would like \"to get rid of the stake as quickly as we can\" after the general election  the Financial Times reported.",
        "date": "03062015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "George Osborne admits RBS error and calls for early sale: FT "
    },
    {
        "content": "Royal Bank of Scotland  is aiming to cut as many as 14 000 jobs in its investment banking units across the United States and Asia  the Financial Times reported.",
        "date": "03032015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS to cut up to 14 000 jobs in investment banking unit: FT "
    },
    {
        "content": "LONDON  March 4 Royal Bank of Scotland  has yet to decide how many jobs it will cut at its investment bank after announcing a major downsizing of the business last week  its Chief Executive Ross McEwan said on Tuesday.",
        "date": "03042015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS boss says no number set for \"significant\" investment bank job cuts "
    },
    {
        "content": "March 3 Royal Bank of Scotland is aiming to cut as many as 14 000 jobs in its investment banking units across the United States and Asia  the Financial Times reported.",
        "date": "03032015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to cut up to 14 000 jobs in investment banking unit -FT "
    },
    {
        "content": "LONDON  March 4 Royal Bank of Scotland has transformed the executive wing of its headquarters near Edinburgh  synonymous with the excesses of former CEO Fred Goodwin  into a hub for start-up businesses  as part of the bailed-out bank's bid to revive its reputation.",
        "date": "03042015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS transforms Goodwin's old office into hub for new businesses "
    },
    {
        "content": "LONDON  Feb 27 A drop in the share prices of Intu Properties and Royal Bank of Scotland  nudged Britain's top equity index down from record highs on Friday.",
        "date": "02272015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Falls at Intu and RBS nudge UK's FTSE off record peaks "
    },
    {
        "content": "* RBS under pressure to focus on lending in Britain   (Adds analyst quote  further details  background)",
        "date": "02242015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 2-EXCLUSIVE-RBS restructuring chief to shrink investment bank "
    },
    {
        "content": "LONDON Royal Bank of Scotland  said another two employees had been suspended as part of an investigation by the bank into failings in its foreign exchange business.",
        "date": "02252015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS suspends another two staff in foreign exchange probe "
    },
    {
        "content": "LONDON Royal Bank of Scotland (RBS) will shrink investment banking operations drastically  pulling out of 25 countries across Europe  Asia and the Middle East and allowing the state-controlled lender to refocus on lending in Britain. | Video ",
        "date": "02262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS shrinks investment bank  posts $5.4 billion loss "
    },
    {
        "content": "LONDON  Feb 25 Royal Bank of Scotland  said another two employees had been suspended as part of an investigation by the bank into failings in its foreign exchange business.",
        "date": "02252015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "CORRECTED-UPDATE 1-RBS suspends another two staff in foreign exchange probe "
    },
    {
        "content": "* Three staff dismissed in forex probe  Swiss bank investigated",
        "date": "02262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "REFILE-UPDATE 4-RBS shrinks investment bank  posts $5.4 bln loss "
    },
    {
        "content": "LONDON  Feb 25 Royal Bank of Scotland  said another two employees had been suspended as part of an investigation by the bank into failings in its foreign exchange business.",
        "date": "02252015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "CORRECTED-RBS suspends two employees as part of foreign exchange probe "
    },
    {
        "content": "LONDON  Feb 23 Royal Bank of Scotland is set to appoint Howard Davies as its next chairman  replacing Philip Hampton  the Financial Times reported on Monday  citing three people familiar with the bank's plans.",
        "date": "02232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS set to appoint ex-regulator Howard Davies chairman -FT "
    },
    {
        "content": "* GSK facing tough times; CEO's 2014 bonus cut by 51 pct   (Adds detail on CEO's reduced bonus  paragraph 5)",
        "date": "02262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-GSK's new chairman Hampton to take charge in May "
    },
    {
        "content": "LONDON  Feb 26 Share price falls in publisher Reed Elsevier and financial firms Royal Bank of Scotland  and RSA kept Britain's top equity index in check on Thursday  although the market remained near record highs.",
        "date": "02262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Drops in RBS and RSA shares peg back UK's FTSE 100 "
    },
    {
        "content": "* Sale a step towards full return to private ownership   (Adds details on method of sale  future sale prospects)",
        "date": "02232015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-UK raises $769 million through sale of Lloyds shares "
    },
    {
        "content": "LONDON/NEW YORK The man synonymous with the \"light-touch\" regulation which allowed Royal Bank of Scotland to spiral out of control before its 45.5 billion pound ($71 billion) government rescue looks set to guide it back to private hands.",
        "date": "02262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS turns to an architect of 'light touch' regulation "
    },
    {
        "content": "LONDON/NEW YORK  Feb 26 The man synonymous with the \"light-touch\" regulation which allowed Royal Bank of Scotland to spiral out of control before its 45.5 billion pound ($71 billion) government rescue looks set to guide it back to private hands.",
        "date": "02262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "NEWSMAKER-RBS turns to an architect of \"light touch\" regulation "
    },
    {
        "content": "LONDON Royal Bank of Scotland  is likely to write down the value of its U.S. bank Citizens by about 4 billion pounds ($6.2 billion) next week  industry sources said  potentially wiping out much of the state-backed bank's annual profit.",
        "date": "02202015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS poised to take four billion pounds hit on value of U.S. bank Citizens: sources "
    },
    {
        "content": "LONDON  Feb 26 A fall in the shares of publisher Reed Elsevier and Royal Bank of Scotland held Britain's top equity index in check on Thursday  although the market remained near record highs hit this week.",
        "date": "02262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Drops in Reed and RBS peg back UK's FTSE 100 "
    },
    {
        "content": "Feb 26 British life insurer Phoenix Group Holdings said Chairman Howard Davies would step down at the end of August to head the board at Royal Bank of Scotland Plc.",
        "date": "02262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-Life insurer Phoenix's chairman to step down  join RBS "
    },
    {
        "content": "LONDON  Feb 26 Rbs fd says comfortably on track to achieve new core tier 1 target of 13 percent in 2016 Rbs ceo says job losses as a result of restructuring will be substantial Rbs ceo says didn't think rbs had the management capability to make restructuring changes last year Rbs fd says expects to be in a position to have dividend discussions with pra in 2016 Rbs ceo says needs to pay enough to get right people to see through recovery of bank   (Reporting by Matt Scuffham)",
        "date": "02262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "BRIEF-RBS targets dividend talks with regulator in 2016 "
    },
    {
        "content": "LONDON  Feb 18 Royal Bank of Scotland on Wednesday launched a new service for its RBS and NatWest customers enabling them to log on to the bank's mobile application using their fingerprints  becoming the first British bank to do so.",
        "date": "02182015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK's RBS launches fingerprint technology for mobile banking app "
    },
    {
        "content": "Feb 26 British life insurer Phoenix Group Holdings said Chairman Howard Davies would step down at the end of August to take up the same position at Royal Bank of Scotland plc.",
        "date": "02262015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK's Phoenix Group says chairman to step down to join RBS "
    },
    {
        "content": "LONDON  Feb 9 (IFR) - \u007fConsultancy firm Anchura has hired two equity and prime services bankers from RBS. Toby Smith-Cullen and Mark Templeman will join as client delivery directors  as the firm seeks to strengthen its front office.",
        "date": "02092015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-RBS bankers jump ship for consultancy firm Anchura "
    },
    {
        "content": "WARSAW  Jan 30 Poland's largest oil refiner PKN Orlen has paid 959 million zlotys ($259 million) to Neon Poland  a special purpose vehicle controlled by the local unit of Royal Bank of Scotland  for certain oil reserves.",
        "date": "01302015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Poland's PKN says paid RBS Polish unit $259 mln for oil reserves "
    },
    {
        "content": "Jan 29 The following bids  mergers  acquisitions and disposals were reported by 1115 GMT on Thursday:",
        "date": "01292015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* RBS reviewing global footprint as focuses on UK market   (Adds detail  context  background)",
        "date": "01292015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS to exit corporate debt  DCM business in Mideast  Africa "
    },
    {
        "content": "DUBAI  Jan 29 Royal Bank of Scotland is to exit its corporate debt and debt capital markets business in the Middle East and Africa  a statement from the British lender said on Thursday.",
        "date": "01292015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS says to exit corporate debt  DCM business in Mideast  Africa "
    },
    {
        "content": "* Specialist mortgage services  subsidiary of HML  has agreed to purchase Topaz Finance Limited from Royal Bank of Scotland",
        "date": "01282015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "BRIEF-Mortgage servicer HML says to buy Topaz Finance from RBS "
    },
    {
        "content": "* RBS to start pilot scheme next week   (Adds finance minister  Funding Circle quotes)",
        "date": "01222015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-RBS to refer rejected small firms to peer-to-peer lenders "
    },
    {
        "content": "LONDON  Jan 22 Royal Bank of Scotland  said on Thursday it would refer  small businesses rejected for loans to alternative finance providers Funding Circle and Assetz Capital.",
        "date": "01222015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS to refer some small businesses to peer-to-peer lenders "
    },
    {
        "content": "* Proposes new powers for official forecaster on economy   (Adds details  quotes)",
        "date": "01142015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "UPDATE 1-UK's Osborne says need to decide on sale of RBS stake soon after election "
    },
    {
        "content": "LONDON Royal Bank of Scotland and Barclays may have to pay some of the biggest bills from an estimated $52 billion in fines and other litigation costs facing Europe's banks in the next two years  Morgan Stanley analysts said.",
        "date": "01132015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "European banks face $52 billion in litigation costs: Morgan Stanley "
    },
    {
        "content": "LONDON  Jan 14 British finance minister George Osborne said on Wednesday the government needed to take a decision on when to sell its stake in Royal Bank of Scotland  soon after a May national election.",
        "date": "01142015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UK's Osborne says need to decide on sale of RBS stake soon after election "
    },
    {
        "content": "LONDON  Jan 13 Royal Bank of Scotland  and Barclays may have to pay some of the biggest bills from an estimated $52 billion in fines and other litigation costs facing Europe's banks in the next two years  Morgan Stanley analysts said.",
        "date": "01132015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "European banks face $52 bln in litigation costs -Morgan Stanley "
    },
    {
        "content": "LONDON  Jan 14 British state-backed lender Royal Bank of Scotland has been granted a waiver by the U.S. Federal Reserve from onerous new rules coming in next year for big overseas banks.",
        "date": "01142015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS gets waiver from tougher U.S. capital rules "
    },
    {
        "content": "ZURICH/HONG KONG  Jan 14 J Safra Sarasin  and a consortium comprising Singapore's DBS Group Holdings are among banks shortlisted for the second round sale process of Coutts International  people familiar with the matter said.",
        "date": "01142015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS short-lists DBS  Sarasin others for Coutts Intl sale -sources "
    },
    {
        "content": "LONDON  Jan 7 - Debt capital markets syndicate veteran Richard Tynan has left RBS to work on an independent project less than four months after a restructuring of the bank's debt capital markets business.",
        "date": "01072015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "MOVES-Tynan quits RBS "
    },
    {
        "content": "LONDON Royal Bank of Scotland currency trader Paul Nash has become the first individual arrested in connection with a global inquiry into alleged manipulation in the foreign exchange market  sources familiar with the matter said on Thursday.",
        "date": "01082015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "Arrested RBS forex trader named as Paul Nash: sources "
    },
    {
        "content": "LONDON  Jan 8 Royal Bank of Scotland  currency trader Paul Nash has become the first individual arrested in connection with a global inquiry into alleged manipulation in the foreign exchange market  sources familiar with the matter said on Thursday.",
        "date": "01082015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "Arrested RBS forex trader named as Paul Nash -sources "
    },
    {
        "content": "LONDON Royal Bank of Scotland could have to pay higher than expected settlements to cover the cost of involvement in the mis-selling of U.S. mortgage-backed securities  The Times reported on Friday  pushing RBS shares lower.",
        "date": "01022015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "topStory",
        "symbol": "RBS",
        "title": "RBS shares hit by report of higher U.S. mortgage bond claims "
    },
    {
        "content": "LONDON  Jan 2 Royal Bank of Scotland  could have to pay higher than expected settlements to cover the cost of involvement in the mis-selling of U.S. mortgage-backed securities  The Times reported on Friday  pushing RBS shares lower.",
        "date": "01022015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "UPDATE 2-RBS shares hit by report of higher U.S. mortgage bond claims "
    },
    {
        "content": "LONDON  Jan 2 Shares in Royal Bank of Scotland  fell 1.2 percent on Friday after The Times newspaper reported the lender could face fines over the sale of toxic mortgage-backed debt in the U.S. of more than 5 billion pounds ($7.76 billion).",
        "date": "01022015",
        "name": "Royal Bank Scotland plc (The)",
        "news_type": "normal",
        "symbol": "RBS",
        "title": "RBS shares fall on report of higher U.S. toxic-debt fines "
    }
]