[
    {
        "content": "TORONTO  Oct 19 The chief executive of Canada's biggest wireless company said on Thursday that he is seeing little demand for Apple Inc's iPhone 8  adding to concerns about prospects for sales of the device.",
        "date": "10192017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 4-Canada's No. 1 wireless carrier sees 'anemic' iPhone 8 demand "
    },
    {
        "content": "* Rogers Communications Inc - qtrly adjusted basic earnings per share $1.02‍​",
        "date": "10192017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "BRIEF-Rogers Communications qtrly adjusted basic earnings per share C$1.02‍​ "
    },
    {
        "content": "Oct 19 Canadian telecom company Rogers Communications Inc's quarterly profit more than doubled  helped by strength in its wireless unit  as it added the highest number of postpaid subscribers in eight years.",
        "date": "10192017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Rogers Communications' quarterly profit more than doubles "
    },
    {
        "content": "* RCI - DAE's offices in Australia  New zealand  US and Egypt will become part of RCI upon completion of the acquisition",
        "date": "08082017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "BRIEF-RCI announces agreement to acquire DAE "
    },
    {
        "content": "TORONTO  July 20 Canada's main stock index edged up on Thursday to a three-week high  boosted by a bump in shares of Rogers Communications Inc after it beat earnings expectations  while energy shares lost ground as oil prices fell.",
        "date": "07202017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "CANADA STOCKS-TSX edges up to 3-week high  boosted by Rogers "
    },
    {
        "content": "TORONTO Canadian telecom company Rogers Communications Inc  reported a greater-than-expected 35 percent jump in second-quarter profit on Thursday  as a gain in wireless subscribers offset declines in its cable TV business.",
        "date": "07202017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Rogers' profit beats on wireless strength but cable drags "
    },
    {
        "content": "FRANKFURT  July 18 Niek Jan van Damme  head of Deutsche Telekom's home market of Germany  is quitting a year early at the end of the year to make way for Dirk Woessner of Canada's Rogers Communications  Deutsche Telekom said on Tuesday.",
        "date": "07182017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Van Damme quits early as head of Deutsche Telekom Germany "
    },
    {
        "content": "TORONTO  July 20 Canada's main stock index eked out a small gain in morning trade on Thursday  boosted by a bump in shares of Rogers Communications Inc after strength in its wireless business help it beat earnings expectations.",
        "date": "07202017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "CANADA STOCKS-TSX edges higher as Rogers rises  Hydro One weighs "
    },
    {
        "content": "TORONTO  July 20 Canadian telecom company Rogers Communications Inc reported a greater-than-expected 35 percent jump in second-quarter profit on Thursday  as a gain in wireless subscribers offset declines in its cable TV business.",
        "date": "07202017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "UPDATE 2-Rogers' profit beats on wireless strength but cable drags "
    },
    {
        "content": "TORONTO  July 20 Canada's main stock index opened higher on Thursday  as higher oil prices boosted energy stocks and shares in Canadian Pacific Railway Ltd and Rogers Communications Inc rose after the companies reported better-than-expected earnings.",
        "date": "07202017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "CANADA STOCKS-TSX rises as earnings beats boost Rogers  CP Rail "
    },
    {
        "content": "* Rogers Communications Inc - qtrly ‍adjusted basic earnings per share $1.00​",
        "date": "07202017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "BRIEF-Rogers Communications reports second quarter 2017 results "
    },
    {
        "content": "July 20 Rogers Communications Inc  Canada's largest wireless company  posted a 35 percent rise in second-quarter profit as it added more subscribers.",
        "date": "07202017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Rogers Communications' 2nd-qtr profit jumps 35 pct "
    },
    {
        "content": "* Quebecor says sale of Videotron's Advanced Wireless Services Spectrum Licence to Rogers Communications Canada for about $184 million",
        "date": "06092017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "BRIEF-Quebecor says sale of Videotron's Advanced Wireless Services Spectrum Licence to Rogers Communications Canada "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 31 (Fitch) Fitch Ratings has affirmed Rogers Communications Inc.'s (Rogers) Long-Term Issuer Default Rating (IDR) and unsecured debt ratings at 'BBB+'. The Rating Outlook is Stable. KEY RATING DRIVERS Mid-2x Leverage by 2018 Rogers' credit profile remains weak with leverage beyond current rating guidance at the end of the first quarter 2017 at 3.0 times (x). However  Fitch believes Rogers is committed to a de-leveraging pat",
        "date": "05312017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Fitch Affirms Rogers at 'BBB+'; Outlook Stable "
    },
    {
        "content": "OTTAWA  May 15 Canada's broadcast regulator said on Monday it will renew the broadcast licenses for the country's biggest television service providers  and it also partially approved Rogers Communications Inc' application to run a national multilingual service.",
        "date": "05152017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 1-Canada's broadcast regulator renews TV licenses for 5-year term "
    },
    {
        "content": "TORONTO  May 4 The head of Rogers Communications Inc's business services unit will leave the company later this month  the Canadian telecommunications and media company said on Thursday.",
        "date": "05042017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Canada's Rogers says head of business service unit to leave "
    },
    {
        "content": "* Rogers Communications Inc - announced that Joe Natale will join as president and chief executive officer on April 19  2017",
        "date": "04132017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "BRIEF-Joe Natale will join as CEO of Rogers on April 19  2017 "
    },
    {
        "content": "TORONTO  April 19 Canada's main stock index gained in early trade on Wednesday  helped by a rebound in banking stocks after recent losses and a jump in shares of Rogers Communications Inc after it reported strong quarterly earnings.",
        "date": "04192017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "CANADA STOCKS-TSX rises as banks rebound  Rogers jumps "
    },
    {
        "content": "TORONTO Canada's Rogers Communications Inc   on Tuesday reported a sharp rise in first-quarter profit and higher revenue as it boasted a surprisingly large jump in new wireless customers.",
        "date": "04182017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Wireless growth boosts profit  revenue for Canada's Rogers Communications "
    },
    {
        "content": "April 19 Canada's main stock index was set to start higher on Wednesday as oil prices rose after OPEC reaffirmed its commitment to erode a glut that has dogged markets since 2014.",
        "date": "04192017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "CANADA STOCKS-TSX futures rise on higher oil prices "
    },
    {
        "content": "TORONTO  April 18 Canada's Rogers Communications Inc  on Tuesday reported a sharp rise in first-quarter profit and higher revenue as it boasted a surprisingly large jump in new wireless customers.",
        "date": "04182017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "UPDATE 2-Wireless growth boosts profit  revenue for Canada's Rogers Communications "
    },
    {
        "content": "* Sets quarterly dividend of C$0.48 per share Source text for Eikon: Further company coverage:",
        "date": "04182017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "BRIEF-Rogers Communications sets quarterly dividend of C$0.48/shr "
    },
    {
        "content": "April 18 Rogers Communications Inc   Canada's largest wireless provider by market share  reported a 27.8 percent increase in quarterly profit  as it signed up more postpaid wireless and internet customers.",
        "date": "04182017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Rogers Communications' 1st-qtr profit jumps 28 pct "
    },
    {
        "content": "OTTAWA  March 1 Canada's telecom regulator ruled on Wednesday that wireless startup Sugar Mobile cannot continue to use Rogers Communications Inc's network to keep customers connected  a decision critics said was a blow to consumers who face high prices.",
        "date": "03012017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Canada wireless startup must stop use of Rogers network -CRTC "
    },
    {
        "content": "TORONTO  Jan 26 Rogers Communications Inc  took a hit from an abandoned television project but reported better-than-expected adjusted profit on Thursday that sent its shares higher as Canada's largest wireless provider leaned on mobile and internet growth.",
        "date": "01262017",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 2-Canada's Rogers takes TV hit; beats on wireless growth "
    },
    {
        "content": "Jan 26 Rogers Communications Inc  Canada's largest wireless provider by market share  reported a net loss due to a C$484 million ($369.18 million) impairment charge  as it discontinued investment in its Internet Protocol Television (IPTV) product.",
        "date": "01262017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Rogers posts quarterly loss after impairment charge "
    },
    {
        "content": "* Rogers Communications Inc - Qtrly adjusted earnings per share $0.74",
        "date": "01262017",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "BRIEF-Rogers Communications Q4 adjusted earnings $0.74 per share "
    },
    {
        "content": "* Priced a US$500 million underwritten public offering of 2.90 pct senior notes due 2026",
        "date": "11022016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "BRIEF-Rogers Communications to offer $500 mln of debt securities "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 01 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to  Rogers Communications Inc.'s (Rogers) benchmark sized US 10-year senior notes  offering. The Rating Outlook is Stable. Rogers intend to use a portion of the net offering proceeds to repay a portion  of the outstanding advances under bank credit facilities and borrowings under  the accounts receivable securitization program. The drawdowns under the bank  credit f",
        "date": "11012016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Fitch Rates Rogers Communications' Debt Offering 'BBB+'; Outlook Stable "
    },
    {
        "content": "TORONTO Rogers Communications Inc Chief Executive Guy Laurence is stepping down effective immediately  the Canadian telecom company said on Monday  an unexpected departure that came as it reported a sharp fall in quarterly profit.",
        "date": "10172016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Rogers CEO departs unexpectedly; profit hit by streaming venture "
    },
    {
        "content": "TORONTO  Oct 17 Rogers Communications Inc  Chief Executive Guy Laurence is stepping down effective immediately  the Canadian telecom company said on Monday  an unexpected departure that came as it reported a sharp fall in quarterly profit.",
        "date": "10172016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "UPDATE 3-Rogers CEO departs unexpectedly; profit hit by streaming venture "
    },
    {
        "content": "* Says expects full year capital spending to be lower than last year - Conference call",
        "date": "10172016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "BRIEF-Rogers Communications sees FY 2016 capex of C$2.3 bln-C$2.4 bln - CONF CALL "
    },
    {
        "content": "Oct 17 Rogers Communications Inc said it would appoint Joseph Natale as CEO and reported a 3.2 percent rise in quarterly revenue as it added more subscribers to its wireless service.",
        "date": "10172016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Rogers names new CEO  posts 3.2 pct rise in quarterly revenue "
    },
    {
        "content": "* Rogers communications inc - Guy Laurence steps down; Joe Natale to be appointed his successor",
        "date": "10172016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "BRIEF-Rogers Communications: Joe Natale named CEO "
    },
    {
        "content": "TORONTO  Oct 6 Rogers Communications Inc  will give customers the ability to shut off family members or friends using excessive mobile data in shared data plans  the Canadian communications company said on Thursday.",
        "date": "10062016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Canada's Rogers says gives more data control to customers "
    },
    {
        "content": "TORONTO Rogers Communications Inc will incur third-quarter losses of between C$100 million ($75.60 million) to C$140 million as its joint-venture Shomi video streaming service is shut down  the Canadian company said on Monday.",
        "date": "09262016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Canada's Rogers expects losses in shutdown of streaming service "
    },
    {
        "content": "TORONTO  Sept 30 Rogers Communications Inc  will stop printing four of its biggest magazines next year and sell all its French-language and trade publications as more readers and advertisers move online  the Canadian company's media arm said on Friday.",
        "date": "09302016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 1-Canada's Rogers to cut back on print magazines  sell titles "
    },
    {
        "content": "TORONTO Rogers Communications Inc  remains committed to its  dividend growth strategy and the failure of its Shomi video streaming joint venture has not diminished its enthusiasm to invest in new technologies  its deputy chairman said on Tuesday.",
        "date": "09272016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Rogers Communications committed to dividend growth - deputy chairman "
    },
    {
        "content": "TORONTO  Sept 26 Rogers Communications Inc  will incur third-quarter losses of between C$100 million ($75.60 million) to C$140 million as its joint-venture Shomi video streaming service is shut down  the Canadian company said on Monday.",
        "date": "09262016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "UPDATE 1-Canada's Rogers expects losses in shutdown of streaming service "
    },
    {
        "content": "TORONTO  Sept 26 Rogers Communications Inc  will incur third-quarter losses of between C$100 million ($75.60 million) to C$140 million as it shuts down its Shomi video streaming service  the Canadian company said on Monday.",
        "date": "09262016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Canada's Rogers shuts Shomi streaming service  expects losses "
    },
    {
        "content": "TORONTO  Sept 30 Rogers Communications Inc  will end the print editions of four of its biggest magazines next year  its media arm said on Friday  the latest sign of the Canadian media industry's struggles with falling print advertising.",
        "date": "09302016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Canada's Rogers to shutter print editions of several magazines "
    },
    {
        "content": "TORONTO  Sept 27 Rogers Communications Inc  remains committed to its  dividend growth strategy and the failure of its Shomi video streaming joint venture has not diminished its enthusiasm to invest in new technologies  its deputy chairman said on Tuesday.",
        "date": "09272016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Rogers Communications committed to dividend growth -deputy chairman "
    },
    {
        "content": "* Rogers Communications declares 48 cents per share quarterly dividend  Source text for Eikon:  Further company coverage:",
        "date": "08112016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "BRIEF-Rogers Communications says quarterly dividend of $0.48/shr "
    },
    {
        "content": "July 21 Rogers Communications Inc  Canada's biggest wireless provider by subscribers  posted an 8.5 percent jump in quarterly profit as it added more postpaid wireless and internet subscribers.",
        "date": "07212016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Canada's Rogers reports 8.5 rise in profit on wireless  internet growth "
    },
    {
        "content": "OTTAWA  June 16 Canada's top court ruled on Thursday that a Quebec municipality did not have the right to prevent wireless provider Rogers Communications from building a cell phone tower on municipal land.",
        "date": "06162016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 1-Canada top court rules Quebec city cannot block cell tower "
    },
    {
        "content": "OTTAWA  June 16 Canada's top court ruled on Thursday that a Quebec municipality did not have the right to prevent wireless provider Rogers Communications from building a cell phone tower on municipal land.",
        "date": "06162016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Canada top court rules Quebec city cannot block cell tower "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 18 (Fitch) Fitch Ratings has affirmed Rogers Communications Inc.'s  (Rogers) Long-Term Issuer Default Rating (IDR) and unsecured debt ratings at  'BBB+'. The Rating Outlook has been revised to Stable from Negative.  The Outlook revision to Stable reflects Fitch's confidence regarding Rogers'  commitment and expected de-leveraging path over the rating horizon. Fitch's view  is supported by the company's diversified revenue b",
        "date": "05182016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Fitch Affirms Rogers at 'BBB+'; Outlook Stable "
    },
    {
        "content": "PORT LOUIS  May 12 Mauritius-based conglomerate Rogers and Company on Thursday reported an 11.3 percent rise in pretax earnings in its third quarter to March 31  driven by improved performance in the hospitality sector.",
        "date": "05122016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Mauritius' Rogers and Co Q3 pretax profit up 11 pct "
    },
    {
        "content": "Canadian telecom and media company BCE Inc reported a slightly better-than-expected quarterly profit as it added more wireless customers and earned more for each one.",
        "date": "04282016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Canada's BCE posts better-than-expected profit "
    },
    {
        "content": "TORONTO Rogers Communications Inc spent heavily to get smartphones to its wireless customers and could not add enough Internet business to offset shrinkage of its television and landline phone business  contributing to a slip in earnings reported on Monday.",
        "date": "04182016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Rogers Communications profit slips on wireless costs  TV "
    },
    {
        "content": "TORONTO  April 18 Rogers Communications Inc  spent heavily to get smartphones to its wireless customers and could not add enough Internet business to offset shrinkage of its television and landline phone business  contributing to a slip in earnings reported on Monday.",
        "date": "04182016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "UPDATE 2-Rogers Communications profit slips on wireless costs  TV "
    },
    {
        "content": "* On track to roll out 1 gig speeds to our entire footprint by end of 2016",
        "date": "04182016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "BRIEF-Rogers Communications qtrly earnings per share C$0.48 "
    },
    {
        "content": "TORONTO  March 31 Canada's Rogers Communications Inc  the primary national broadcaster of National Hockey League games  said on Thursday it will begin selling its top sports channels online without a cable subscription.",
        "date": "03312016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Canada's Rogers to offer sports channels as streaming services "
    },
    {
        "content": "* Ceo Guy Laurence total 2015 compensation $11.2 million versus $9 million in 2014  Further company coverage:",
        "date": "03182016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "BRIEF-Rogers communications announces CEO total 2015 compensation "
    },
    {
        "content": "TORONTO  Feb 18 Canada's main stock index edged higher on Thursday  sustaining a six-week high  as consumer and telecom stocks made modest gains  while shares in energy companies pulled back despite a further rise in crude oil prices.",
        "date": "02182016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "CANADA STOCKS-TSX edges higher  sustains six-week high "
    },
    {
        "content": "PORT LOUIS  Feb 11 Mauritius-based conglomerate Rogers and Company reported a 30 percent fall in quarterly pretax profit on Thursday citing higher finance costs and lower profits from its hospitality operations.",
        "date": "02112016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Mauritius conglomerate Rogers reports 30 pct fall in Q2 pretax "
    },
    {
        "content": "TORONTO  Jan 27 Canada's main stock index fell on Wednesday as a drop in crude oil prices weighed on energy stocks  while Rogers Communications Inc retreated after reporting fourth-quarter earnings that fell short of expectations.",
        "date": "01272016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "CANADA STOCKS-TSX falls as energy stocks  Rogers weigh "
    },
    {
        "content": "TORONTO  Jan 27 Canada's Rogers Communications Inc  on Wednesday reported fourth-quarter earnings that fell short of expectations  with television and landline phone revenues down and Internet and wireless sales growing.",
        "date": "01272016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "UPDATE 1-Rogers Communications 4th-qtr profit edges up but misses estimates "
    },
    {
        "content": "TORONTO  Jan 27 Canada's Rogers Communications Inc reported a slight rise in fourth-quarter profit on Wednesday and said it expects revenue and profit to rise 1-3 percent in 2016 as it held its dividend steady.",
        "date": "01272016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "CORRECTED-Canada's Rogers Communications notches small profit rise "
    },
    {
        "content": "TORONTO  Jan 25 Rogers Communications Inc  said on Monday it would cut around 200 media jobs starting in February  the latest Canadian media outlet to fire staff in a tough market dealing with sliding advertising and the migration of audiences online.",
        "date": "01262016",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "CORRECTED-UPDATE 1-Canada's Rogers Communications to cut 200 jobs in media unit "
    },
    {
        "content": "TORONTO  Jan 25 Rogers Communications Inc  said on Monday it would cut around 200 media jobs starting in February  blaming a weak ad market  shifting audience habits and competition from global rivals.",
        "date": "01262016",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "CORRECTED-Canada's Rogers Communications to cut 200 jobs in media unit "
    },
    {
        "content": "PORT LOUIS  Nov 12 Mauritius-based conglomerate Rogers and Company reported on Thursday a 37.6 percent rise in pretax earnings for the three months to Sept. 30  helped by a one-off profit from acquisitions.",
        "date": "11122015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Mauritius firm Rogers Q1 pretax earnings up  helped by one-off item "
    },
    {
        "content": "TORONTO  Nov 5 Shares in Telus Corp  one of Canada's three big telecoms providers  fell on Thursday after the company reported slowing wireless growth and forecast higher restructuring costs as it announced job cuts.",
        "date": "11052015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "UPDATE 2-Telus eyes job cuts as wireless growth slows; shares fall "
    },
    {
        "content": "Oct 22 Canada's Rogers Communications Inc  reported a surprise jump in third-quarter profit on Thursday that sent its shares to a multi-year high  helped by impressive wireless customer growth and baseball success that boosted its media business.",
        "date": "10222015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 2-Baseball's Blue Jays  wireless growth boost Rogers Communications "
    },
    {
        "content": "Oct 22 Canada's Rogers Communications Inc  reported a 39.8 percent jump in quarterly profit  helped by higher revenue from its media and wireless business.",
        "date": "10222015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "CORRECTED-Canada's Rogers Communications reports 39.8 pct rise in Q3 profit "
    },
    {
        "content": "TORONTO  Oct 5 Canada's Rogers Communications Inc said on Monday that it would broadcast live television in a high-definition standard known as \"4K\" by April next year  a move it hopes will woo viewers to an upgraded set-top box and faster Internet.",
        "date": "10052015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Canada's Rogers plans new-format HD sports push "
    },
    {
        "content": "PORT LOUIS  Sept 11 Mauritius-based conglomerate Rogers said pretax profit rose 43.4 percent in the year to June 30  driven by better performances from its hospitality  real estate and agribusiness operations.",
        "date": "09112015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Mauritius' Rogers annual pretax profit jumps 43 pct "
    },
    {
        "content": "TORONTO  July 23 Rogers Communications Inc  added wireless customers in the second quarter after two straight quarters of net defections  a key milestone in the broad strategic overhaul the Canadian telecoms and media company has embarked on.",
        "date": "07232015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 2-Rogers Communications halts wireless exits; net profit drops "
    },
    {
        "content": "TORONTO  July 23 Rogers Communications Inc  reported a 10 percent slip in second-quarter net income on Thursday  as the Canadian telecom  cable and media company made progress in its strategy of attracting value over volume in its wireless business.",
        "date": "07232015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Canada's Rogers Communications profit slips  revenue up "
    },
    {
        "content": "Canada's Rogers Communications  has put The Shopping Channel up for sale and received interest from foreign buyers for the television asset that may fetch over C$300 million ($237 million)  according to three people familiar with the matter.",
        "date": "07102015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Rogers puts Shopping Channel for sale  attracts U.S. buyers: sources "
    },
    {
        "content": "July 10 Canada's Rogers Communications  has put The Shopping Channel up for sale and received interest from foreign buyers for the television asset that may fetch over C$300 million ($237 million)  according to three people familiar with the matter.",
        "date": "07102015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "UPDATE 1-Rogers puts Shopping Channel for sale  attracts U.S. buyers -sources "
    },
    {
        "content": "TORONTO/NEW YORK  July 10 Canada's Rogers Communications has put its The Shopping Channel up for sale and received interest from foreign buyers for the television asset that may fetch over C$300 million ($237 million)  according to three sources familiar with the matter.",
        "date": "07102015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Rogers puts Shopping Channel up for sale  attracts U.S. buyers -sources "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 25 (Fitch) Fitch Ratings believes the recent transactions  announced by Rogers Communications Inc. (Rogers) are neutral to its credit  profile. Importantly  Fitch expects Rogers will continue to maintain its current  trajectory to reduce leverage below 2.5x by 2017 through debt reduction and  EBITDA growth. Leverage at the end of the first quarter 2015 was 3.1x. The series of transactions include Rogers completing the prev",
        "date": "06252015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Fitch Views Rogers Transactions as Neutral to Ratings "
    },
    {
        "content": "TORONTO Rogers Communications Inc  scooped up a small rival and secured key airwaves through a series of deals on Wednesday that reinforced its position as Canada's largest wireless company  while also helping No. 4 operator Wind Mobile.",
        "date": "06242015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Rogers adds subscribers  airwaves with Mobilicity  Shaw deals "
    },
    {
        "content": "June 19 Telus Corp  and Rogers Communications Inc  are looking to acquire wireless telecommunications provider Mobilicity  and the Canadian government is expected to approve a deal with one of the suitors  the Globe and Mail reported  citing copies of two opinion letters obtained from Industry Canada.",
        "date": "06202015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 1-Telus  Rogers in race to buy Mobilicity with federal approval -GLOBML "
    },
    {
        "content": "TORONTO  June 23 Canada's largest mobile operator  Rogers Communications Inc  has agreed to pay more than C$400 million ($324.57 million) to acquire struggling wireless carrier Mobilicity  two sources with knowledge of the matter said on Tuesday.",
        "date": "06232015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Canada's Rogers reaches deal to buy Mobilicity - sources "
    },
    {
        "content": "June 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "06242015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "June 19 Telus Corp  and Rogers Communications Inc  are looking to acquire wireless telecommunications provider Mobilicity  and the Canadian government is expected to approve a deal with one of the suitors  the Globe and Mail reported  citing copies of two opinion letters obtained from Industry Canada.",
        "date": "06202015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Telus  Rogers in race to buy Mobilicity with federal approval -GLOBML "
    },
    {
        "content": "TORONTO  June 24 Rogers Communications Inc  scooped up a small rival and secured key airwaves through a series of deals on Wednesday that reinforced its position as Canada's largest wireless company  while also helping No. 4 operator Wind Mobile.",
        "date": "06242015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "UPDATE 2-Rogers adds subscribers  airwaves with Mobilicity  Shaw deals "
    },
    {
        "content": "* Canada approves series of spectrum licence transfers between Rogers  Shaw  Mobilicity and Wind Mobile",
        "date": "06242015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "BRIEF-Canada approves series of spectrum licence transfers between Rogers  Shaw  Mobilicity and Wind Mobile "
    },
    {
        "content": "TORONTO  June 24 Rogers Communications Inc  has orchestrated a series of deals that will boost the quality of its mobile phone service  Canada's largest wireless operator said on Wednesday.",
        "date": "06242015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Canada's Rogers says to buy Mobilicity  Shaw airwaves "
    },
    {
        "content": "PORT LOUIS  May 14 Mauritius-based conglomerate Rogers reported on Thursday a 44.1 percent jump in pretax profit to 748 million rupees ($22 million) in the nine months to end-March  driven by better performance from its hospitality sector.",
        "date": "05142015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Mauritius Rogers 9-month pretax profit climbs 44 pct "
    },
    {
        "content": "A slew of Dow 30 companies report results in the week: Chemicals conglomerate DuPont  industrial conglomerate United Technologies Corp  property and casualty insurer Travelers Companies Inc and wireless carrier Verizon Communications Inc on Tuesday; McDonald's Corp  AT&T Inc  Boeing Co and Coca-Cola Co on Wednesday; and diversified manufacturer 3M Co  Procter & Gamble and Microsoft Corp on Thursday. While DuPont is expected to report lower first-quarter results  Travelers Companies Inc's first-q",
        "date": "04172015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 1-What to Watch in the Week Ahead and on Monday  April 20 "
    },
    {
        "content": "TORONTO  April 20 Rogers Communications Inc  posted an unexpected 17 percent drop in quarterly profit on Monday as the cable  phone and media company struggled to hold on to customers during a period of industry-wide turbulence.",
        "date": "04202015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 2-Profits down at Rogers Communications as customers exit "
    },
    {
        "content": "TORONTO  April 17 The head of media at Canada's Rogers Communications Inc will leave the company this summer to become commissioner of the PGA European Tour golf events  the cable and media company said in a statement on Friday.",
        "date": "04172015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Media exec at Rogers Comms leaves to head golf's European Tour "
    },
    {
        "content": "TORONTO  April 20 Canada's Rogers Communications Inc posted a 17 percent fall in first-quarter profit on Monday  as the cable  phone and media company struggled to hold on to customers during a period of industry-wide turbulence.",
        "date": "04202015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Canada's Rogers posts profit slip as customers exit "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 01 (Fitch) Fitch Ratings has affirmed the ratings for Rogers  Communications Inc. (Rogers) at 'BBB+'. The Rating Outlook is Negative. See the  full list of ratings at the end of this release. KEY RATING DRIVERS Good Asset Mix  Restructuring Needs to Gain Momentum Fitch believes Rogers' mix of wireless and cable assets positions the company  competitively and allows for significant revenue diversification through its  robu",
        "date": "04012015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Fitch Affirms Rogers Communications at 'BBB+'; Outlook Negative "
    },
    {
        "content": "WASHINGTON U.S. consumer prices rebounded in February as gasoline prices rose for the first time since June  and there were also signs of an uptick in underlying inflation pressures  keeping the Federal Reserve on course to raise interest rates this year. | Video ",
        "date": "03242015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "U.S. consumer inflation firming; new home sales at seven-year high "
    },
    {
        "content": "* Rogers  country's largest wireless operator  buys none   (Adds comment from Rogers and analyst  details and background)",
        "date": "03062015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 2-Canada raises C$2.11 bln in wireless airwaves auction "
    },
    {
        "content": "PORT LOUIS  Feb 13 Mauritius-based conglomerate Rogers said its pretax profit rose 58 percent to 555 million rupees ($16.74 million) in the six months to December  driven by better performance from its hospitality  real estate and agribusiness sectors.",
        "date": "02132015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Mauritius Rogers H1 pretax profit up 58 pct  says euro a concern "
    },
    {
        "content": "TORONTO  Feb 5 Canada's big telecom companies want as many high-paying customers as they can get  but some are clearly doing a better job at it than others.",
        "date": "02052015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "UPDATE 3-BCE outshines Rogers with wireless  Internet-TV strength "
    },
    {
        "content": "TORONTO Rogers Communications Inc   Canada's largest mobile provider  lost a large number of wireless and cable-TV customers in the fourth quarter but its focus on \"value over volume\" allowed it to beat lowered earnings expectations.",
        "date": "01292015",
        "name": "Rogers Communication Inc",
        "news_type": "topStory",
        "symbol": "RCI",
        "title": "Rogers Communications sheds customers but beats expectations "
    },
    {
        "content": "TORONTO  Jan 29 Rogers Communications Inc   Canada's largest mobile provider  lost a large number of wireless and cable-TV customers in the fourth quarter but its focus on \"value over volume\" allowed it to beat lowered earnings expectations.",
        "date": "01292015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "UPDATE 2-Rogers Communications sheds customers but beats expectations "
    },
    {
        "content": "TORONTO  Jan 29 Rogers Communications Inc  posted a 7 percent fall in fourth-quarter profit on Thursday  as the cable and telecom company seeks to shift its focus from volume to value.",
        "date": "01292015",
        "name": "Rogers Communication Inc",
        "news_type": "normal",
        "symbol": "RCI",
        "title": "Rogers Communications posts 7 pct profit slip "
    }
]