[
    {
        "content": "BERLIN/FRANKFURT  Nov 13 The following are some of the factors that may move German stocks on Monday:",
        "date": "11132017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "German stocks - Factors to watch on November 13 "
    },
    {
        "content": "ZURICH  Nov 10 Novartis's bid to move in on Bayer's and Regeneron's eye-drug turf was buoyed on Friday by data showing patients on the Swiss drugmaker's new RTH258 drug showed less disease activity than those on its rivals' drug Eylea.",
        "date": "11102017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Novartis posts eye drug data amid play for Eylea's turf "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc on Wednesday reported third-quarter profit that sailed past Wall Street estimates on the strength of increased demand for flagship eye treatment Eylea and its new eczema drug Dupixent  boosting its shares almost 7 percent.",
        "date": "11082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron third-quarter profit easily tops Street view on Eylea  Dupixent sales "
    },
    {
        "content": "* Regeneron and Sanofi to present new analyses from the Praluent® (alirocumab) injection Odyssey clinical trial program at the AHA Scientific Sessions 2017 Source text for Eikon: Further company coverage:",
        "date": "11072017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Sanofi to present new analyses from Praluent injection Odyssey clinical trial "
    },
    {
        "content": "Nov 8 Regeneron Pharmaceuticals Inc on Wednesday reported third-quarter profit that sailed past Wall Street estimates on the strength of increased demand for flagship eye treatment Eylea and its new eczema drug Dupixent  boosting its shares almost 7 percent.",
        "date": "11082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 3-Regeneron Q3 profit easily tops Street view on Eylea  Dupixent sales "
    },
    {
        "content": "* Regeneron reports third quarter 2017 financial and operating results",
        "date": "11082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron Q3 non-GAAP earnings per share $3.99 "
    },
    {
        "content": "Nov 8 Regeneron Pharmaceuticals Inc reported a 47 percent jump in quarterly profit on Wednesday on higher demand for its flagship eye treatment Eylea.",
        "date": "11082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Drugmaker Regeneron's quarterly profit surges 47 pct "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc and Sanofi SA said on Monday their drug to treat inflammation in the esophagus  mainly caused by food allergies  met the main goal of a mid-stage study.",
        "date": "10162017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron-Sanofi drug succeeds mid-stage study "
    },
    {
        "content": "Oct 16 Regeneron Pharmaceuticals Inc and Sanofi SA said on Monday their drug to treat inflammation in the esophagus  mainly caused by food allergies  met the main goal of a mid-stage study.",
        "date": "10162017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "CORRECTED-UPDATE 1-Regeneron-Sanofi drug succeeds mid-stage study "
    },
    {
        "content": "Oct 16 Aimmune Therapeutics Inc said on Monday it would collaborate with Regeneron Pharmaceuticals Inc and Sanofi to develop its experimental peanut allergy drug.",
        "date": "10162017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Aimmune teams with Regeneron  Sanofi on peanut allergy drug "
    },
    {
        "content": "Oct 16 Regeneron Pharmaceuticals Inc and Sanofi SA said on Monday their drug to treat patients with a rare throat infection met the main goal of a mid-stage study.",
        "date": "10162017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron-Sanofi throat infection drug succeeds key study "
    },
    {
        "content": "* Aimmune Therapeutics announces clinical collaboration to study AR101 with Regeneron and Sanofi’s dupilumab for peanut allergy",
        "date": "10162017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Aimmune Therapeutics collaborates to study AR101 with Regeneron and Sanofi’s dupilumab for peanut allergy "
    },
    {
        "content": "* REGENERON AND SANOFI ANNOUNCE POSITIVE PHASE 2 STUDY RESULTS FOR DUPILUMAB IN PATIENTS WITH ACTIVE MODERATE-TO-SEVERE EOSINOPHILIC ESOPHAGITIS",
        "date": "10162017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Sanofi announce positive phase 2 study results for dupilumab "
    },
    {
        "content": "A U.S. appeals court on Thursday threw out a ban on the sale of  Regeneron Pharmaceuticals Inc and Sanofi SA's cholesterol-lowering drug Praluent  and ordered a new trial after finding a jury was given improper instructions.",
        "date": "10052017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "U.S. court reverses ban on sale of Regeneron  Sanofi cholesterol drug "
    },
    {
        "content": "Oct 5 A U.S. appeals court on Thursday threw out a ban on the sale of  Regeneron Pharmaceuticals Inc and Sanofi SA's cholesterol-lowering drug Praluent  and ordered a new trial after finding a jury was given improper instructions.",
        "date": "10052017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 3-U.S. court reverses ban on sale of Regeneron  Sanofi cholesterol drug "
    },
    {
        "content": "* Appellate Court orders a new trial and vacates permanent injunction in ongoing patent case regarding Praluent® (alirocumab)",
        "date": "10052017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-U.S. Appellate Court rules Sanofi  Regeneron can continue manufacturing PRALUENT in U.S. "
    },
    {
        "content": "Oct 5 A U.S. appeals court has thrown out a ban on sales of Sanofi SA and Regeneron Pharmaceuticals Inc's cholesterol-lowering drug Praluent  in a closely watched case that could have broad implications for drug development.",
        "date": "10052017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "U.S. court reverses ban on sales of Sanofi  Regeneron drug Praluent "
    },
    {
        "content": "* Regeneron Pharmaceuticals Inc - ‍announces new collaborations with hhs to develop antibodies against ebola  influenza  multiple other emerging pathogens​",
        "date": "10022017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron Pharmaceuticals ‍announces new collaborations with HHS to develop antibodies against ebola  influenza  multiple other emerging pathogens​ "
    },
    {
        "content": "PARIS  Sept 28 The European Commission approved Regeneron Pharmaceuticals' and Sanofi's key biologic treatment dupilumab for moderate-to-severe atopic dermatitis  the two companies said on Thursday.",
        "date": "09282017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "EU approves Sanofi and Regeneron's dupilumab in eczema "
    },
    {
        "content": "PARIS Shares of Regeneron Inc and Sanofi SA slid on Monday after late-stage trial data for their asthma drug  dupilumab  fell short of investor expectations.",
        "date": "09112017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron  Sanofi asthma drug data fails to excite investors "
    },
    {
        "content": "PARIS  Sept 11 Shares of Regeneron Inc and Sanofi SA slid on Monday after late-stage trial data for their asthma drug  dupilumab  fell short of investor expectations.",
        "date": "09112017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 2-Regeneron  Sanofi asthma drug data fails to excite investors "
    },
    {
        "content": "* Regeneron and Sanofi announce positive Dupilumab topline results from phase 3 trial in uncontrolled persistent Asthma",
        "date": "09112017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron  Sanofi announce positive Dupilumab topline results from phase 3 trial in uncontrolled persistent Asthma "
    },
    {
        "content": "PARIS  Sept 11 Drugmakers Sanofi and Regeneron announced on Monday positive results for their dupilumab product  which helps  treat allergic inflammation.",
        "date": "09112017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi and Regeneron announce positive dupilumab topline results "
    },
    {
        "content": "Sept 7 AbbVie Inc said on Thursday its experimental drug to treat adults with moderate-to-severe eczema met the main goal in a mid-stage study  dragging down shares of rival U.S. biotech firm Regeneron Pharmaceuticals Inc.",
        "date": "09072017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "AbbVie's positive eczema study drags down Regeneron's shares "
    },
    {
        "content": "PARIS  Sept 8 Sanofi and Regeneron Pharmaceuticals said on Friday that the U.S. Food and Drug Administration (FDA) has granted \"Breakthrough Therapy\" designation status to their skin cancer treatment Cemiplimab.",
        "date": "09082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Sanofi says Cemiplimab skin cancer treatment gets FDA \"Breakthrough Designation\" "
    },
    {
        "content": "* Sanofi  Regeneron: Cemiplimab receives FDA breakthrough designation for advanced cutaneous squamous cell carcinoma",
        "date": "09082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Sanofi  Regeneron say Cemiplimab receives U.S. FDA breakthrough designation for advanced cutaneous squamous cell carcinoma "
    },
    {
        "content": "Aug 14 Regeneron Pharmaceuticals Inc said it would stop developing its drug to prevent respiratory syncytial virus (RSV) infections in infants  after it failed a late-stage study.",
        "date": "08142017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron to abandon drug for common respiratory virus "
    },
    {
        "content": "* Regeneron to discontinue development of suptavumab for respiratory syncytial virus",
        "date": "08142017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron's drug for respiratory virus fails late-stage study "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd takes share stake in JPMorgan Chase & Co of 264 337 shares",
        "date": "08142017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Temasek Holdings takes stake in JPMorgan  Biogen  Celgene "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc reported a much better-than-expected quarterly profit on strong demand for its flagship Eylea drug and said it would end one of its agreements with France's Sanofi SA to develop antibodies by the end of the year.",
        "date": "08032017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron beats profit view  to end antibody deal with Sanofi "
    },
    {
        "content": "* Shares close down 2 pct on plans to scrap antibody deal (Adds details about Sanofi antibody deal  Sanofi and analyst comments  updates shares)",
        "date": "08032017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 4-Regeneron beats profit view  to end antibody deal with Sanofi "
    },
    {
        "content": "* Sanofi sees \"broadly stable\" 2017 earnings (Adds details  comments)",
        "date": "07312017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 3-Sanofi raises outlook but key eczema drug disappoints investors "
    },
    {
        "content": "* Indexes down: Dow 0.05 pct  S&P 0.14 pct  Nasdaq 0.06 pct (Updates to open)",
        "date": "08032017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "US STOCKS-Wall St opens flat as tech stocks slip "
    },
    {
        "content": "* Regeneron CEO says U.S. Eylea sales have grown steadily since launch  without any price increases. Growth has been driven by new patients & new indications",
        "date": "08032017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron says expects that Dupixent will have broad market access in the United States by the end of the year "
    },
    {
        "content": "* Says U.S. Court of Appeals for Federal Circuit affirms Merus' inequitable conduct claim against regeneron",
        "date": "07282017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-U.S. Court of Appeals for Federal Circuit affirms Merus' inequitable conduct claim against Regeneron "
    },
    {
        "content": "The Dutch biotech company Merus NV won an appeals court ruling on Thursday that a patent asserted against it by rival Regeneron Pharmaceuticals Inc is unenforceable because it was obtained through deception. In a 2-1 decision affirming a District Court judge  the U.S. Court of Appeals for the Federal Circuit said that the Regeneron patent  which relates to mice antibody technology  is unenforceable because a patent prosecutor at Regeneron withheld information from the U.S. Patent and Trademark O",
        "date": "07272017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "In win for Merus  court rules Regeneron obtained patent through deception "
    },
    {
        "content": "* Futures: Dow down 1 pt  S&P off 1 pt  Nasdaq up 7 pts (Adds details  comment  updates prices)",
        "date": "08032017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "US STOCKS-Wall St set to open flat after Dow breaches 22 000 "
    },
    {
        "content": "* Regeneron reports second quarter 2017 financial and operating results",
        "date": "08032017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron Q2 non-gaap earnings per share $4.17 "
    },
    {
        "content": "LONDON  July 21 The European Medicines Agency on Friday recommended approval of  Regeneron Pharmaceuticals and Sanofi's new drug Dupixent for atopic dermatitis  a product many analysts see as the most important growth driver for the two companies.",
        "date": "07212017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "EU follows U.S. in backing Sanofi  Regeneron eczema drug "
    },
    {
        "content": "Aug 3 Regeneron Pharmaceuticals Inc reported a nearly 98 percent rise in quarterly profit on Thursday   partly helped by higher demand for its flagship eye treatment  Eylea.",
        "date": "08032017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron quarterly profit nearly doubles "
    },
    {
        "content": "* Sanofi and Regeneron announce approval of Kevzara(®) (sarilumab) to treat adult patients with moderately to severely active rheumatoid arthritis in the European Union",
        "date": "06272017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Sanofi and Regeneron announce EU approval for Kevzara "
    },
    {
        "content": "* Regeneron details royalty agreement with novartis for canakinumab (acz885)",
        "date": "06222017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron details royalty agreement with Novartis for canakinumab "
    },
    {
        "content": "ZURICH A Novartis drug to treat a leading cause of vision loss in people over 65 does not need to be injected as frequently as a rival medicine from Regeneron Pharmaceuticals to be effective  clinical trials showed on Tuesday.",
        "date": "06202017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Novartis eye drug works with fewer injections than rival "
    },
    {
        "content": "ZURICH  June 20 A drug developed by Novartis to treat vision loss in people over 65 does not need to be injected as frequently as a rival medicine from Regeneron to be effective  clinical trials showed on Tuesday.",
        "date": "06202017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "CORRECTED-UPDATE 1-Novartis eye drug works with fewer injections than rivals "
    },
    {
        "content": "ZURICH  June 20 Novartis eye drug RTH258 works as well as a rival product from Regeneron and at less frequent dosing in clinical trials  the Swiss drugmaker said on Tuesday  boosting its shares.",
        "date": "06202017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Novartis eye drug works at less frequent dosing than rival's "
    },
    {
        "content": "PARIS  June 11 France's Sanofi and partner Regeneron Pharmaceuticals said on Sunday their anti-cholesterol drug Praluent recorded positive results in its first dedicated studies involving patients with diabetes and high cholesterol.",
        "date": "06112017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi-Regeneron's Praluent cuts cholesterol in Odyssey trials "
    },
    {
        "content": "June 6 A federal appeals court hinted on Tuesday it may let Sanofi AG and Regeneron Pharmaceuticals Inc sell a cholesterol drug Amgen Inc has been trying to block on patent infringement grounds  according to lawyers and analysts who attended oral arguments in the case.",
        "date": "06062017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron  Sanofi urge court to reverse ban on cholesterol drug "
    },
    {
        "content": "May 22 The U.S. Food and Drug Administration approved Regeneron Pharmaceuticals Inc and Sanofi SA's biotech drug for adults with moderate to severe rheumatoid arthritis  the two companies said on Monday.",
        "date": "05222017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "UPDATE 1-Regeneron  Sanofi rheumatoid arthritis drug wins U.S. approval "
    },
    {
        "content": "May 22 The U.S. Food and Drug Administration approved Regeneron Pharmaceuticals and Sanofi's biotech drug for adults with moderate to severe rheumatoid arthritis  the two companies said on Monday.",
        "date": "05222017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron  Sanofi rheumatoid arthritis drug wins U.S. approval "
    },
    {
        "content": "* Regeneron and sanofi announce fda approval of kevzara® (sarilumab) for the treatment of moderately to severely active rheumatoid arthritis in adult patients",
        "date": "05222017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron  Sanofi RA drug wins FDA nod; co's price it at $39 000/patient/yr "
    },
    {
        "content": "French drugmaker Sanofi  has pledged to peg U.S. drug price rises to below healthcare inflation in a move that limits increases for any product this year to 5.4 percent  unless there are exceptional circumstances.",
        "date": "05092017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi pegs U.S. drug price rises to below healthcare inflation "
    },
    {
        "content": "* More transparency on gross and net prices in U.S. (Adds projection for NHE inflation rate  detail on Sanofi drugs)",
        "date": "05092017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 2-Sanofi pegs U.S. drug price rises to below healthcare inflation "
    },
    {
        "content": "Sanofi SA and Regeneron Pharmaceuticals Inc are citing a little-noticed federal appeals court ruling in a patent dispute over LED lights last month to bolster their own appeal of a court order banning sales of their cholesterol drug Praluent.",
        "date": "05082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Sanofi  Regeneron hope LED case will shine a light on Praluent injunction appeal "
    },
    {
        "content": "Shares of Regeneron Pharmaceuticals Inc   which tumbled 32 percent in 2016  are poised for a rebound  the financial newspaper Barron's said.",
        "date": "05072017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron shares poised for rebound: Barron's "
    },
    {
        "content": "* Regeneron and Sillajen announce immuno-oncology clinical study agreement for combination treatment in kidney cancer",
        "date": "05082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Sillajen report immuno-oncology clinical study agreement "
    },
    {
        "content": "May 7 Shares of Regeneron Pharmaceuticals Inc   which tumbled 32 percent in 2016  are poised for a rebound  the financial newspaper Barron's said.",
        "date": "05072017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron shares poised for rebound - Barron's "
    },
    {
        "content": "* Regeneron and Inovio enter immuno-oncology clinical study agreement for glioblastoma combination therapy",
        "date": "05082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Inovio enter immuno-oncology clinical study agreement "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc  said its eczema drug Dupixent was off to a strong start and the biotech stood by its full-year sales forecast for its flagship drug Eylea even as competition heats up.",
        "date": "05042017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "As Eylea fears fade  focus turns to Regeneron's eczema drug "
    },
    {
        "content": "May 4 Regeneron Pharmaceuticals Inc said its eczema drug Dupixent was off to a strong start and the biotech stood by its full-year sales forecast for its flagship drug Eylea even as competition heats up.",
        "date": "05042017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 4-As Eylea fears fade  focus turns to Regeneron's eczema drug "
    },
    {
        "content": "* Regeneron and Sanofi announce Kevzara® (sarilumab) Biologics License Application resubmission accepted for review by U.S. FDA",
        "date": "04282017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Sanofi announce Kevzara license application resubmission for review by FDA "
    },
    {
        "content": "May 4 Regeneron Pharmaceuticals Inc stood by its full-year sales forecast for its flagship drug Eylea and said the early adoption of its eczema drug Dupixent was encouraging  easing concerns about the company's reliance on Eylea as competition heats up.",
        "date": "05042017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "CORRECTED-UPDATE 3-As Eylea fears fade  focus turns to Regeneron's eczema drug "
    },
    {
        "content": "* Regeneron Pharmaceuticals says over 3 500 new prescriptions have been written for Dupixent  which translates into over 900 prescriptions : Conf Call",
        "date": "05042017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron says over 3 500 new prescriptions been written for Dupixent "
    },
    {
        "content": "* Regeneron and Sanofi announce FDA approval of a new once-monthly dosing option for Praluent (Alirocumab) injection",
        "date": "04252017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron says FDA approved for praluent injection "
    },
    {
        "content": "* Regeneron Pharmaceuticals Says in JanuarY 2017  company received subpoena from U.S. Attorney's office for the district of Massachusetts",
        "date": "05042017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron Pharmaceuticals says it received subpoena "
    },
    {
        "content": "* Sanofi and Regeneron announce FDA approval of a new once-monthly dosing option for Praluent (alirocumab) injection",
        "date": "04252017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Sanofi and Regeneron announce FDA approval of a once-monthly dosing option for Praluent "
    },
    {
        "content": "* Regeneron Pharmaceuticals Inc - q1 eylea u.s. Net sales $854 million versus $781 million",
        "date": "05042017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron Q1 non-gaap earnings per share $2.92 "
    },
    {
        "content": "May 4 Regeneron Pharmaceuticals Inc reported a 37.2 percent increase in first-quarter profit  driven by higher demand for its flagship eye drug Eylea.",
        "date": "05042017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Biotech Regeneron's profit jumps 37 pct on higher Eylea sales "
    },
    {
        "content": "* Regeneron Pharmaceuticals Inc - CEO Leonard Schleifer's 2016 total compensation was $28.3 million versus $47.5 million - SEC filing",
        "date": "04252017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron Pharmaceuticals say CEO Leonard Schleifer's 2016 total compensation was $28.3 mln - SEC filing "
    },
    {
        "content": "* EU Medicines Agency recommends approval granting of a marketing authorisation for Sandoz's Rixathon Non-Hodgkin's Lymphoma (NHL)  chronic lymphocytic leukaemia",
        "date": "04212017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-EU Medicines Agency recommendations for April 2017 "
    },
    {
        "content": "April 21 A European Medicines Agency panel said on Friday it recommended granting marketing approval to Sanofi and Regeneron's experimental drug to treat rheumatoid arthritis.",
        "date": "04212017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "EMA panel recommends nod for Sanofi  Regeneron's arthritis drug "
    },
    {
        "content": "* Regeneron announces Evinacumab has received FDA breakthrough therapy designation for homozygous familial hypercholesterolemia (HOFH)",
        "date": "04062017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron announces Evinacumab has received FDA breakthrough therapy designation "
    },
    {
        "content": "The U.S. Food and Drug Administration on Tuesday approved Regeneron Pharmaceuticals Inc and Sanofi SA's  drug for moderate-to-severe atopic dermatitis  a product widely seen as the most important future growth driver for the two companies.",
        "date": "03282017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "FDA approves Regeneron  Sanofi $37 000 per year eczema drug "
    },
    {
        "content": "March 28 The U.S. Food and Drug Administration on Tuesday approved Regeneron Pharmaceuticals Inc and Sanofi SA's  drug for moderate-to-severe atopic dermatitis  a product widely seen as the most important growth driver for the two companies.",
        "date": "03282017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 3-FDA approves Regeneron  Sanofi $37 000 per year eczema drug "
    },
    {
        "content": "* Regeneron and Sanofi announce FDA approval of Dupixent® (Dupilumab)  the first targeted biologic therapy for adults with moderate-to-severe atopic dermatitis",
        "date": "03282017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Sanofi announce FDA approval of Dupixent "
    },
    {
        "content": "* FDA granted the application for Dupixent priority review and breakthrough therapy designation",
        "date": "03282017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-U.S. FDA says approves new eczema drug Dupixent "
    },
    {
        "content": "* Says U.S. list price of newly approved Dupixent atopic dermatitis drug $37 000 per patient per yearFurther company coverage:    (Reporting by Ben Hirschler)",
        "date": "03282017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-U.S. list price for Sanofi  Regeneron's Dupixent $37 000 "
    },
    {
        "content": "LONDON  March 23 Britain's GlaxoSmithKline  and U.S.-based Regeneron Pharmaceuticals are embarking on a joint project with UK Biobank  the world's most detailed biomedical database  to hunt for new clues linking genes and disease.",
        "date": "03232017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "GSK and Regeneron to mine gene data from 500 000 Britons "
    },
    {
        "content": "March 28 The U.S. Food and Drug Administration on Tuesday approved Regeneron Pharmaceuticals Inc and Sanofi SA's  Dupixent for treatment of moderate to severe atopic dermatitis  a product widely seen as the most important future growth driver for the two companies.",
        "date": "03282017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "FDA approves Regeneron  Sanofi eczema drug "
    },
    {
        "content": "BOSTON  March 21 Sanofi SA and Regeneron Pharmaceuticals Inc filed a lawsuit seeking a court order declaring that their eczema drug Dupixent  awaiting a U.S. approval decision  does not infringe an Amgen Inc  patent for a failed asthma treatment.",
        "date": "03212017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi  Regeneron sue Amgen to protect eczema drug from patent claims "
    },
    {
        "content": "BOSTON  March 21 Sanofi SA and Regeneron Pharmaceuticals Inc have filed a lawsuit seeking a court order declaring that their eczema drug Dupixent  awaiting a U.S. approval decision  does not infringe an Amgen Inc patent for a failed asthma treatment.",
        "date": "03212017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 1-Sanofi  Regeneron sue Amgen to protect eczema drug from patent claims "
    },
    {
        "content": "* Sanofi says UK's Medicines & Healthcare Products Regulatory Agency (MHRA) has granted dupilumab  a product which treats for atopic dermatitis (AD)  a positive scientific opinion through the Early Access to Medicines Scheme (EAMS).",
        "date": "03142017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-UK regulator gives positive opinion on Sanofi/Regeneron's dupilumab product "
    },
    {
        "content": "* Regeneron and Sanofi to present new phase 3 praluent (alirocumab) injection clinical trial analyses at ACC.17 Scientific Sessions",
        "date": "03072017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Sanofi to present new phase 3 praluent (alirocumab) injection clinical trial analyses at ACC.17 Scientific Sessions "
    },
    {
        "content": "PARIS  March 4 Drugmakers Sanofi and Regeneron said on Saturday results from a one-year test of their Dupixent product aimed at adults with eczema or moderate-to-severe atopic dermatitis (AD) had been positive.",
        "date": "03042017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi  Regeneron say latest Dupixent eczema drug tests positive "
    },
    {
        "content": "Seniors' advocacy group AARP and drugmaker Eli Lilly & Co on Thursday urged a federal appeals court to overturn a court order barring sales of Sanofi SA and Regeneron Pharmaceuticals Inc's cholesterol drug Praluent.",
        "date": "02242017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "AARP  Eli Lilly support Sanofi  Regeneron in cholesterol drug fight "
    },
    {
        "content": "* Adverum Biotechnologies-on Feb 23  Regeneron Pharma notified Adverum Biotechnologies of election to extend research term of collaboration  licensing deal",
        "date": "03012017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Adverum says Regeneron Pharma elects to extend research term of deal "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc Chief Executive Leonard Schleifer signaled that the U.S. biotech was on track to reduce its reliance on its flagship drug Eylea  as the company awaits the approval of two potential blockbuster treatments.",
        "date": "02092017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron pins hope on eczema drug as Eylea sales slow "
    },
    {
        "content": "* Shares rise as much as 4 pct   (Adds conference call details; updates shares)",
        "date": "02092017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 3-Regeneron pins hope on eczema drug as Eylea sales slow "
    },
    {
        "content": "A U.S. appeals court on Wednesday stayed an order that would have blocked Regeneron Pharmaceuticals Inc and Sanofi SA from selling their cholesterol drug  Praluent  while they appeal the order.",
        "date": "02082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron  Sanofi win stay of U.S. order blocking cholesterol drug sales "
    },
    {
        "content": "* Regeneron CEO: \"As we further diversify our product related revenue stream  we do not plan to provide eylea guidance after 2017\"",
        "date": "02092017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron says price increases unrelated from innovation will be pushed back on "
    },
    {
        "content": "* Regeneron reports fourth quarter and full year 2016 financial and operating results",
        "date": "02092017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron posts Q4 adj. profit $3.04/shr "
    },
    {
        "content": "Feb 8 A U.S. appeals court on Wednesday stayed an order that would have blocked Regeneron Pharmaceuticals Inc  and Sanofi SA from selling their cholesterol drug  Praluent  while they appeal the order.",
        "date": "02082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 2-Regeneron  Sanofi win stay of U.S. order blocking cholesterol drug sales "
    },
    {
        "content": "Feb 9 Regeneron Pharmaceuticals Inc  reported an 11.7 percent rise in quarterly revenue on Thursday  helped by higher demand for its flagship eye drug Eylea.",
        "date": "02092017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron revenue rises 11.7 pct on Eylea eye drug "
    },
    {
        "content": "* Regeneron Pharmaceuticals Inc says  appeals court grants stay of permanent injunction for praluent (alirocumab) during appeals process",
        "date": "02082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron pharmaceuticals says appeals court grants stay of permanent injunction for praluent "
    },
    {
        "content": "Feb 8 A U.S. appeals court on Wednesday has stayed an order that would have blocked Regeneron Pharmaceuticals Inc and Sanofi SA from selling their cholesterol drug  Praluent  later this month while they appeal.",
        "date": "02082017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron  Sanofi win stay of order blocking cholesterol drug sales "
    },
    {
        "content": "* Sanofi and Regeneron Pharmaceuticals  Inc. today announced that Health Canada approved Kevzara(TM)",
        "date": "02012017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Sanofi and Regeneron announce first approval of Kevzara "
    },
    {
        "content": "* Tony Coles  M.D.  elected to regeneron board of directors  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Tony Coles elected to Regeneron board "
    },
    {
        "content": "Feb 2 Amgen Inc said its potent cholesterol fighter Repatha significantly reduced the risk of heart attacks  strokes and death in patients with heart disease  according to initial results of a large  eagerly-anticipated trial released on Thursday.",
        "date": "02022017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Amgen cholesterol drug succeeds in cutting serious heart problems -study "
    },
    {
        "content": "* Sanofi reports open market purchase of 87 298 shares of Regeneron Pharmaceuticals Inc's common stock on Jan 11 - SEC filing  Source text: http://bit.ly/2iR2AXn Further company coverage:",
        "date": "01132017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Sanofi buys 87 298 shares of Regeneron's common stock on Jan 11 "
    },
    {
        "content": "* Preliminary U.S. net sales of eylea injection of $858 million for Q4 2016",
        "date": "01092017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron Pharmaceuticals reports preliminary Q4 U.S. net sales of eylea injection of $858 mln "
    },
    {
        "content": "Regeneron Pharmaceuticals Chief Executive Len Schleifer on Monday ripped into Amgen Inc  for its insistence on blocking sales of a rival Regeneron cholesterol drug while the appeals process in a patent infringement case plays out.",
        "date": "01102017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron CEO says Amgen not putting patients first in patent dispute "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc and Sanofi SA said on Thursday they would appeal the U.S. District Court ruling which banned the two companies from selling their cholesterol drug  Praluent  on grounds of patent infringement.",
        "date": "01062017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron  Sanofi to appeal U.S. judge's ban on cholesterol drug sales "
    },
    {
        "content": "Jan 9 Regeneron Pharmaceuticals Chief Executive Len Schleifer on Monday ripped into Amgen Inc  for its insistence on blocking sales of a rival Regeneron cholesterol drug while the appeals process in a patent infringement case plays out.",
        "date": "01102017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 1-Regeneron CEO says Amgen not putting patients first in patent dispute "
    },
    {
        "content": "* Indexes down: Dow 0.25 pct  S&P 0.19 pct  Nasdaq 0.07 pct   (Updates to open)",
        "date": "01062017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "US STOCKS-Wall St loses ground after mixed jobs data "
    },
    {
        "content": "A federal judge on Tuesday refused to throw out a court verdict upholding two Amgen Inc patents related to the company's cholesterol drug  a defeat for Sanofi SA and Regeneron Pharmaceuticals Inc  which make a rival drug.",
        "date": "01042017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Sanofi  Regeneron lose bid to overturn Amgen win in patent case "
    },
    {
        "content": "Jan 9 Regeneron Pharmaceuticals Chief Executive Len Schleifer on Monday ripped into Amgen Inc  for its insistence on blocking sales of a rival Regeneron cholesterol drug while the appeals process in a patent infringement case plays out.",
        "date": "01102017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "CORRECTED-Regeneron CEO says Amgen not putting patients first in patent dispute "
    },
    {
        "content": "* Regeneron CEO says Sanofi plant that will fill atopic dermatitis drug awaiting U.S. approval decision deemed acceptable",
        "date": "01102017",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron says Sanofi plant used to fill drugs now deemed acceptable "
    },
    {
        "content": "PARIS The European Medicines Agency (EMA)  the European Union's health regulator  has accepted for review the Dupixent product being developed by drugmakers Sanofi and Regeneron  the companies said on Thursday.",
        "date": "12082016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "EU regulator accepts Sanofi/Regeneron's Dupixent product for review "
    },
    {
        "content": "* On nov 14  entered into termination agreement relating to master terms and conditions for warrants  dated as of Oct 18  2011",
        "date": "11182016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron entered into termination agreement relating to master terms and conditions for warrants "
    },
    {
        "content": "Nov 17 Sanofi and Regeneron Pharmaceuticals said on Thursday they would continue a large clinical outcomes study with their injectable cholesterol-lowering drug Praluent.",
        "date": "11172016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "No early win for Sanofi  Regeneron cholesterol drug in study "
    },
    {
        "content": "* Regeneron Pharmaceuticals-In MONARCH study  sarilumab monotherapy showed superiority over adalimumab monotherapy in adults with active rheumatoid arthritis",
        "date": "11162016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Sanofi Present Results from late-stage Monarch study at American College of Rheumatology Annual Meeting "
    },
    {
        "content": "Nov 17 Sanofi and Regeneron Pharmaceuticals said on Thursday they would continue a large clinical outcomes study with their injectable cholesterol-lowering drug Praluent  confounding hopes of some investors for an early win.",
        "date": "11172016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 1-No early win for Sanofi  Regeneron cholesterol drug in study "
    },
    {
        "content": "* Regeneron and Sanofi to present data from Phase 3 Praluent(alirocumab) injection clinical trials at AHA scientific sessions 2016  Source text for Eikon:  Further company coverage:",
        "date": "11112016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and sanofi to present data from clinical trials "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc's  quarterly profit handsomely beat estimates  helped by lower costs and a smaller tax bill  even as sales growth of its flagship drug Eylea continued to slow.",
        "date": "11042016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron profit tops Street on lower costs "
    },
    {
        "content": "* Shares reverse course - up as much as 4.68 pct at $351.74   (Recasts  adds conf call details  updates shares)",
        "date": "11042016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 4-Regeneron profit tops Street on lower costs "
    },
    {
        "content": "* Regeneron CEO says it is \"early for us to comment on the expected timeline for potential sarilumab approval\": conf call",
        "date": "11042016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron CEO says Eylea rivals offering discounts  rebates: conf call "
    },
    {
        "content": "* Regeneron reports third quarter 2016 financial and operating results",
        "date": "11042016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron Pharmaceuticals Q3 gaap EPS $2.27 "
    },
    {
        "content": "Nov 4 Regeneron Pharmaceuticals Inc  reported a 7.3 percent rise in quarterly revenue on Friday  driven by higher demand for its flagship eye drug Eylea.",
        "date": "11042016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Eylea sales lift Regeneron revenue 7.3 percent "
    },
    {
        "content": "* Regeneron and sanofi receive complete response letter from fda for sarilumab  an investigational treatment for rheumatoid arthritis",
        "date": "10282016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Sanofi receive complete response letter from FDA for Sarilumab "
    },
    {
        "content": "* Regeneron says it was advised by its collaborator  Sanofi  that manufacturing deficiencies have been raised by U.S. FDA during inspection of a Sanofi facility",
        "date": "10282016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron advised by Sanofi that manufacturing deficiencies have been raised by U.S. FDA "
    },
    {
        "content": "Oct 17 Regeneron Pharmaceuticals Inc  and partner Teva Pharmaceutical Industries Ltd said the U.S. health regulator has placed a clinical hold on a mid-stage study of their experimental drug for chronic lower back pain.",
        "date": "10172016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "FDA places Regeneron and Teva's pain-drug study on hold "
    },
    {
        "content": "* FDA puts study on hold after joint damage observed in a patient",
        "date": "10172016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 2-FDA places Regeneron and Teva's pain-drug study on hold "
    },
    {
        "content": "* Regeneron and Teva provide update on fasinumab clinical development programs",
        "date": "10172016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron  Teva provide update on fasinumab clinical development programs "
    },
    {
        "content": "* Ocular Therapeutix(tm) and Regeneron enter into strategic collaboration to develop sustained release formulation of aflibercept for the treatment of wet AMD and other serious retinal diseases",
        "date": "10132016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Ocular and Regeneron enter into strategic collaboration to develop sustained release formulation of aflibercept "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc said a combination therapy containing its flagship eye drug  Eylea  was inferior to Eylea alone in a mid-stage trial involving patients with wet age-related macular degeneration (AMD)  a leading cause of blindness in the elderly.",
        "date": "09302016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron's Eylea combination therapy fails mid-stage study "
    },
    {
        "content": "Sept 30 Regeneron Pharmaceuticals Inc  said a combination therapy containing its flagship eye drug  Eylea  was inferior to Eylea alone in a mid-stage trial involving patients with wet age-related macular degeneration (AMD)  a leading cause of blindness in the elderly.",
        "date": "09302016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 2-Regeneron's Eylea combination therapy fails mid-stage study "
    },
    {
        "content": "* Formulated with rinucumab (anti-PDGFR-beta) shows no benefit over aflibercept alone in neovascular age-related macular degeneration",
        "date": "09302016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron announces phase 2 study of aflibercept "
    },
    {
        "content": "French drugmaker Sanofi  and its U.S. partner Regeneron Pharmaceuticals  could win U.S. approval for their keenly awaited new eczema drug dupilumab  seen by analysts as a potential $3 billion-a-year seller  by next March.",
        "date": "09262016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Sanofi may win U.S. approval of $3 billion eczema drug by March "
    },
    {
        "content": "Sept 26 French drugmaker Sanofi and its U.S. partner Regeneron Pharmaceuticals could win U.S. approval for their keenly awaited new eczema drug dupilumab  seen by analysts as a potential $3 billion-a-year seller  by next March.",
        "date": "09262016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi may win U.S. approval of $3 bln eczema drug by March "
    },
    {
        "content": "PARIS  Sept 26 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "09262016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "French and Benelux stocks-Factors to watch on Sept. 26 "
    },
    {
        "content": "* Sanofi and Regeneron announce dupilumab biologics license application accepted for priority review by U.S. FDA  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "09262016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Sanofi and Regeneron accepted for priority review by U.S. FDA "
    },
    {
        "content": "* To pay Regeneron $250 million upfront  share equally in global commercial value  ongoing research & development costs of about $1 billion",
        "date": "09202016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Teva and regeneron announce global collaboration to develop Fasinumab "
    },
    {
        "content": "* Regeneron and Teva announce global collaboration to develop and commercialize Fasinumab  an investigational NGF antibody for chronic pain",
        "date": "09202016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron  Teva collaborate to develop  commercialize Fasinumab "
    },
    {
        "content": "Sept 20 Regeneron Pharmaceuticals Inc  and Israeli drugmaker Teva Pharmaceutical Industries  on Tuesday said they would co-develop Regeneron's experimental new type of pain drug and together market the medicine if it succeeds in trials and is approved.",
        "date": "09202016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron  Teva take aim at Lilly/Pfizer pain drug "
    },
    {
        "content": "FRANKFURT German drugmaker Bayer  said its two best-selling drugs had a higher annual peak sales potential than previously targeted  after the agreed $66 billion takeover of Monsanto  stirred criticism it might neglect its pharmaceuticals business.",
        "date": "09202016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Bayer raises sales targets for top-selling drugs after Monsanto deal "
    },
    {
        "content": "* Bayer shares seen 1.5 pct higher   (Adds consumer care unit target  analyst comment  premarket share price)",
        "date": "09202016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 1-Bayer raises sales targets for top-selling drugs after Monsanto deal "
    },
    {
        "content": "FRANKFURT  Sept 20 German drugmaker Bayer  said its two best-selling drugs had a higher annual peak sales potential than previously targeted  after the agreed $66 billion takeover of Monsanto stirred criticism it might neglect its pharmaceuticals business.",
        "date": "09202016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Bayer ups sales targets for top-selling drugs after Monsanto deal "
    },
    {
        "content": "* Sanofi and Regeneron say Praluent shows positive investigational data in phase 3 trial  Further company coverage:    (Reporting by Laurence Frost)",
        "date": "08292016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Sanofi and Regeneron say Praluent shows positive phase 3 trial data "
    },
    {
        "content": "* Regeneron announces agreement with BARDA for the manufacturing and testing of new antibodies against MERS virus",
        "date": "08222016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron announces agreement with BARDA "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc  stood by its full-year growth forecast for flagship eye drug Eylea as the company posted its slowest growth in revenue in eight quarters.",
        "date": "08042016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron sticks by 2016 growth forecast for Eylea  shares fall "
    },
    {
        "content": "Aug 4 Regeneron Pharmaceuticals Inc  stood by its full-year growth forecast for flagship eye drug Eylea as the company posted its slowest growth in revenue in eight quarters.",
        "date": "08042016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "REFILE-UPDATE 3-Regeneron sticks by 2016 growth forecast for Eylea  shares fall "
    },
    {
        "content": "* Ceo Says Co's Pipeline Can Address Many Opportunities Rare diseases  emerging infectious diseases and epidemics such as zika: conf call",
        "date": "08042016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron says reimbursement situation improving in U.S. for Praluent - Conf Call "
    },
    {
        "content": "Aug 4 Regeneron Pharmaceuticals Inc's  quarterly revenue rose about 21 percent  driven by demand for its flagship eye drug Eylea.",
        "date": "08042016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Eylea sales lift Regeneron quarterly revenue "
    },
    {
        "content": "* Regeneron and Sanofi announce approval of praluent (alirocumab) for the treatment of hypercholesterolemia in Japan  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "07052016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Sanofi announce approval of praluent (alirocumab) in Japan "
    },
    {
        "content": "PARIS  June 6 French drugmaker Sanofi SA  and U.S. partner Regeneron Pharmaceuticals Inc  said a one-year  late-stage study of dupilumab  a monoclonal antibody designed for the treatment of skin diseases  had met its main goals.",
        "date": "06062016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi and Regeneron report positive skin disease trial "
    },
    {
        "content": "* Regeneron presents positive interim data from phase 2 proof-of-concept study of Evinacumab in patients with homozygous familial hypercholesterolemia",
        "date": "05312016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron presents positive data from phase 2 study of Evinacumab "
    },
    {
        "content": "NEW YORK  May 26 Biotechnology company Regeneron Pharmaceuticals Inc on Thursday became the title sponsor of the most prestigious U.S. science competition for high school students  taking the baton from chipmaker Intel Corp .",
        "date": "05262016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Biotech Regeneron replaces Intel as sponsor of Science Talent Search "
    },
    {
        "content": "NEW YORK  May 25 Biotechnology company Regeneron Pharmaceuticals Inc on Thursday became the title sponsor of the most prestigious U.S. science competition for high school students  taking the baton from chipmaker Intel Corp .",
        "date": "05262016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "RPT-Biotech Regeneron replaces Intel as sponsor of Science Talent Search "
    },
    {
        "content": "May 16 Temasek Holdings Raises Share Stake In Regeneron Pharmaceuticals To 126 351 Shares From 58 289 Shares - SEC filing",
        "date": "05162016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Temasek Holdings ups share stake in Regeneron Pharma as of March 31 "
    },
    {
        "content": "NEW YORK  May 12 Regeneron Pharmaceuticals  Chief Executive Leonard Schleifer on Thursday took aim at an influential drug pricing watchdog  saying a critique of the company's new cholesterol lowering therapy was non-scientific.",
        "date": "05122016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron CEO says drug price critique by independent group unscientific "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc  facing slowing sales of blockbuster eye drug Eylea  said it was making substantial progress in securing more insurance coverage for cholesterol drug Praluent  its other key product.",
        "date": "05052016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron secures more coverage for cholesterol drug Praluent "
    },
    {
        "content": "* Regeneron reports first quarter 2016 financial and operating results",
        "date": "05052016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron reports Q1 adj. earnings per share $2.57 "
    },
    {
        "content": "* Patients treated with all four doses of fasinumab demonstrated a statistically significant improvement in pain relief",
        "date": "05022016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron drug suuceeds in study with patients with osteoarthritis pain "
    },
    {
        "content": "CAMBRIDGE  England  April 22 AstraZeneca   working with genome pioneer Craig Venter  is launching a massive gene hunt in the most comprehensive bet yet by a pharmaceutical firm on the potential of genetic variations to unlock routes to new medicines.",
        "date": "04212016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "AstraZeneca taps gene pioneer Venter for huge drug-hunting sweep "
    },
    {
        "content": "April 1 Regeneron Pharmaceuticals Inc  and Sanofi said on Friday their experimental treatment for eczema proved highly effective in two large studies  without serious side effects often seen with standard treatments for the chronic inflammatory skin disease.",
        "date": "04012016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron  Sanofi eczema drug clears hurdles in big trials "
    },
    {
        "content": "* Regeneron And Sanofi announce positive Dupilumab topline results from two Phase 3 trials in inadequately controlled moderate to-severe atopic Dermatitis patients",
        "date": "04012016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Sanofi announce positive Dupilumab topline results from two Phase 3 trials in inadequately controlled moderate-to-severe atopic Dermatitis patients "
    },
    {
        "content": "* Regeneron and intellia therapeutics announce collaboration to discover and develop crispr/cas therapeutics",
        "date": "04112016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron Pharmaceuticals  Intellia Therapeutics announce collaboration to discover  develop CRISPR/CAS therapeutics "
    },
    {
        "content": "* Regeneron and Bayer to jointly develop novel combination therapy for eye diseases",
        "date": "03242016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron and Bayer to jointly develop combination therapy for eye diseases "
    },
    {
        "content": "* Says \u007fBayer and Regeneron to jointly develop novel combination therapy for eye diseases\u007f  Source text for Eikon:  Further company coverage:",
        "date": "03242016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Bayer  Regeneron to jointly develop combination therapy for eye diseases\u007f "
    },
    {
        "content": "PARIS  March 23 French drugmaker Sanofi  and U.S. partner Regeneron said a late-stage study of their Praluent injection showed it reduced the need for patients with an inherited form of high cholesterol to have bad cholesterol removed from their blood.",
        "date": "03232016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi  Regeneron unveil positive Praluent cholesterol study "
    },
    {
        "content": "LONDON  March 23 European stocks were seen opening slightly lower on Wednesday  having retreated in the previous session after deadly attacks in Brussels hit travel  leisure and luxury goods stocks.",
        "date": "03232016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "European Factors to Watch-Shares seen opening slightly lower "
    },
    {
        "content": "* Regeneron and Sanofi strongly disagree with U.S. Jury verdict in ongoing patent litigation regarding Praluent (Alirocumab) injection and will appeal",
        "date": "03162016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Regeneron  Sanofi comment on verdict in ongoing patent litigation regarding Praluent "
    },
    {
        "content": "* Shares down 5.3 pct at $369.77   (Adds details from conference call  analyst comment)",
        "date": "02092016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "UPDATE 3-Regeneron sees gradual adoption of cholesterol drug Praluent "
    },
    {
        "content": "Feb 9 Regeneron Pharmaceuticals Inc  reported a 37 percent rise in quarterly revenue as sales of its blockbuster eye drug Eylea increased 44 percent in the United States.",
        "date": "02092016",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron Pharma revenue rises 37 pct "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc  raised Eylea sales growth forecast for the third time this year  after surging sales of the eye drug helped the company beat quarterly profit and revenue estimates.",
        "date": "11042015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Regeneron raises Eylea sales growth estimates again "
    },
    {
        "content": "* Shares rise 3.8 pct premarket   (Adds forecast  background)",
        "date": "11042015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 2-Regeneron raises Eylea sales growth estimates again "
    },
    {
        "content": "Nov 4 Drugmaker Regeneron Pharmaceuticals Inc  reported a 57 percent jump in quarterly revenue  powered by soaring demand for its blockbuster eye drug  Eylea.",
        "date": "11042015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron revenue jumps 57 pct as Eylea sales surge "
    },
    {
        "content": "Oct 12 The odds that Merck & Co's  high-stakes cholesterol drug will succeed have dropped dramatically after Eli Lilly and Co said its similar medicine failed to reduce heart attacks and strokes  top U.S. heart doctors said.",
        "date": "10132015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Merck cholesterol drug's odds dim after Lilly failure "
    },
    {
        "content": "Sept 11 A new Novartis AG drug to treat heart failure should cost 17 percent less than its list price of $4 560 per year to keep health costs in line with growth in the overall U.S. economy  according to the nonprofit ICER.",
        "date": "09112015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 1-Novartis heart failure drug should have 17 pct discount -analysis "
    },
    {
        "content": "Sept 11 A new Novartis AG drug to treat heart failure should cost 17 percent less than its list price of $4 560 per year to keep health costs in line with growth in the overall U.S. economy  according to the nonprofit ICER.",
        "date": "09112015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Novartis heart failure drug should have 17 pct discount -analysis "
    },
    {
        "content": "Sept 8 An independent non-profit organization that evaluates clinical and cost effectiveness of new medicines said announced prices for a just-approved class of potent cholesterol lowering drugs were far too high  according to a draft report released on Tuesday.",
        "date": "09082015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "UPDATE 1-Independent group finds new cholesterol drugs far too costly "
    },
    {
        "content": "CHICAGO  Sept 2 Scientists at U.S. biotechnology company Regeneron Pharmaceuticals researching a rare genetic disease that traps sufferers in a second skeleton have discovered a treatment that shuts down excessive bone growth in mice engineered to develop the illness.",
        "date": "09022015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron scientists discover key to excess bone growth in rare disease "
    },
    {
        "content": "PARIS  Sept 1 Sanofi and Regeneron Pharmaceuticals said on Tuesday that a study into their new cholesterol-lowering drug  Praluent  showed promising results.",
        "date": "09012015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi  Regeneron say new cholesterol drug data positive "
    },
    {
        "content": "PARIS  Aug 10 Sanofi is teaming up with Germany's Evotec and Austrian biotech firm Apeiron Biologics to develop a new type of immune system-boosting cancer medicine that could be given as tablets to fight both solid tumours and blood cancers.",
        "date": "08102015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi teams up with Evotec  Apeiron to develop immuno-oncology pills "
    },
    {
        "content": "Aug 4 Regeneron Pharmaceuticals Inc  reported a 50 percent rise in quarterly revenue  boosted by increasing demand for its blockbuster eye drug  Eylea.",
        "date": "08042015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Drugmaker Regeneron's revenue jumps on Eylea sales "
    },
    {
        "content": "LONDON Two of the most anticipated new heart drugs to be launched in recent years have been priced well above analyst expectations  fuelling the debate about whether modern medicines cost too much.",
        "date": "07272015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "New heart drugs come in more expensive than expected "
    },
    {
        "content": "French drugmaker Sanofi  said on Tuesday it was committing up to $2.17 billion to a collaboration with its long-time partner Regeneron Pharmaceuticals  in the hot area of cancer immunotherapy.",
        "date": "07282015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Sanofi links with Regeneron in $2.2 billion cancer drug push "
    },
    {
        "content": "July 28 French drugmaker Sanofi said on Tuesday it was committing up to $2.17 billion to a collaboration with its long-time partner Regeneron Pharmaceuticals in the hot area of cancer immunotherapy.",
        "date": "07282015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi links with Regeneron in $2.2 bln cancer drug push "
    },
    {
        "content": "* Sanofi and Regeneron agree to jointly develop PD-1 and other new immuno-oncology antibodies -",
        "date": "07282015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Sanofi to invest $2.17 bln in Regeneron cancer therapy collaboration "
    },
    {
        "content": "Amgen Inc's cholesterol fighting drug was approved by the European Commission  giving the keenly anticipated treatment a head start over a rival drug being developed by Regeneron Pharmaceuticals Inc and Sanofi SA.",
        "date": "07212015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Amgen wins first approval for new class of cholesterol drugs "
    },
    {
        "content": "July 21 Amgen Inc's cholesterol fighting drug was approved by the European Commission  giving the keenly anticipated treatment a head start over a rival drug being developed by Regeneron Pharmaceuticals Inc and Sanofi SA.",
        "date": "07212015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 1-Amgen wins first approval for new class of cholesterol drugs "
    },
    {
        "content": "WASHINGTON The U.S. Food and Drug Administration approved a potent new cholesterol-lowering drug from Sanofi SA and Regeneron Pharmaceuticals Inc on Friday but limited its approved use to patients with a hereditary form of the condition and those with cardiovascular disease.",
        "date": "07242015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "FDA approves Sanofi/Regeneron cholesterol drug with limits "
    },
    {
        "content": "WASHINGTON  July 24 The U.S. Food and Drug Administration approved a potent new cholesterol-lowering drug from Sanofi SA and Regeneron Pharmaceuticals Inc  on Friday but limited its approved use to patients with a hereditary form of the condition and those with cardiovascular disease.",
        "date": "07242015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 3-FDA approves Sanofi/Regeneron cholesterol drug with limits "
    },
    {
        "content": "LONDON  July 24 A new type of cholesterol drug from Sanofi and Regeneron Pharmaceuticals won a green light from European regulators on Friday  two months behind a rival product from Amgen.",
        "date": "07242015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi's big new cholesterol drug wins European green light "
    },
    {
        "content": "* Praluent to compete with Amgen's rival product Repatha   (Adds comment from companies  more details on drug dose and use)",
        "date": "07242015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 1-Sanofi's big new cholesterol drug wins European green light "
    },
    {
        "content": "* EU Medicines Agency recommends approval of high cholesterol drug Praluent from Sanofi SA/Regeneron Pharmaceuticals",
        "date": "07242015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "BRIEF-Sanofi  Regeneron's high cholesterol drug Praluent gets EMA nod "
    },
    {
        "content": "June 9 A new type of cholesterol-lowering drug made by Sanofi SA and Regeneron Pharmaceuticals  should be approved  an advisory committee to the U.S. Food and Drug Administration concluded on Tuesday.",
        "date": "06092015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "UPDATE 2-FDA panel backs Sanofi/Regeneron cholesterol drug with limits "
    },
    {
        "content": " (This version of the June 9th story corrects dosing schedule in last paragraph to every other week)",
        "date": "06102015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "FDA panel backs Sanofi/Regeneron cholesterol drug with limits "
    },
    {
        "content": "June 10 A new type of cholesterol-lowering drug made by Sanofi SA and Regeneron Pharmaceuticals  should be approved  an advisory committee to the U.S. Food and Drug Administration concluded on Tuesday.",
        "date": "06102015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "CORRECTED-UPDATE 3-FDA panel backs Sanofi/Regeneron cholesterol drug with limits "
    },
    {
        "content": "Amgen Inc's closely watched new cholesterol drug  Repatha  has been recommended for approval in Europe  putting the U.S. drugmaker ahead in a race with rival Sanofi SA.",
        "date": "05222015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Amgen first to win EU backing for new kind of cholesterol drug "
    },
    {
        "content": "May 7 Regeneron Pharmaceuticals Inc  said it expects sales of blockbuster eye drug Eylea to grow even more quickly following data that showed it was superior to rival treatments.",
        "date": "05072015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "UPDATE 2-Regeneron expects Eylea sales to grow faster than expected "
    },
    {
        "content": "May 7 Regeneron Pharmaceuticals Inc  reported an 11 percent rise in quarterly profit  driven by surging demand for its top-selling eye drug  Eylea.",
        "date": "05072015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "REFILE-Regeneron profit rises as Eylea sales jump "
    },
    {
        "content": "March 25 U.S. health regulators on Wednesday approved Regeneron Pharmaceuticals Inc's big-selling eye drug Eylea to treat diabetic retinopathy  the most common diabetic eye disease and a leading cause of blindness in adults.",
        "date": "03252015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "CORRECTED-U.S. FDA again expands usage of Regeneron eye drug Eylea "
    },
    {
        "content": "* Announced on Sunday the 18-month results of a Phase 3 long term trial with praluent (alirocumab) with Regeneron Pharmaceuticals Inc",
        "date": "03162015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "BRIEF-Sanofi and Regeneron announce 18-month results of ODYSSEY long term trial with praluent (alirocumab) "
    },
    {
        "content": "Feb 10 Regeneron Pharmaceuticals Inc  reported better-than-expected fourth-quarter sales  driven by surging demand for its blockbuster eye drug Eylea.",
        "date": "02102015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "UPDATE 1-Regeneron revenue beats Street on strong Eylea sales "
    },
    {
        "content": "Feb 10 Regeneron Pharmaceuticals Inc  reported a nearly 14 percent jump in quarterly profit  driven by strong demand for its blockbuster eye drug Eylea.",
        "date": "02102015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron's profit rises about 14 pct on strong Eylea sales "
    },
    {
        "content": "Jan 26 Regeneron Pharmaceuticals on Monday said U.S. health regulators accepted its application to review a potent  cholesterol drug on a priority basis  potentially giving it the upper hand in a fierce race with Amgen  to bring a new medicine from the promising class to market.",
        "date": "01262015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Regeneron/Sanofi cholesterol drug gets FDA priority review "
    },
    {
        "content": "Jan 13 Express Scripts  the largest U.S. pharmacy benefit manager  on Tuesday said cost savings on expensive cancer treatments could be achieved if the company were involved earlier in the decision-making process.",
        "date": "01132015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "UPDATE 1-Express Scripts sees opportunity to lower cancer treatment cost "
    },
    {
        "content": "PARIS  Jan 12 The European Medicines Agency has agreed to review an application by Sanofi and Regeneron for their cholesterol-lowering drug alirocumab  the pharmaceutical groups said in a statement.",
        "date": "01122015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi  Regeneron submit new cholesterol drug to EMA for review "
    },
    {
        "content": "PARIS  Jan 12 The European Medicines Agency has agreed to review an application by Sanofi and Regeneron for their cholesterol-lowering drug alirocumab  the pharmaceutical groups said in a statement on Monday.",
        "date": "01122015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 1-Sanofi  Regeneron submit new cholesterol drug to EMA for review "
    },
    {
        "content": "An experimental drug from Sanofi SA and Regeneron Pharmaceuticals was found to be effective in lowering \"bad\" cholesterol even when administered once every four weeks  instead of every two weeks.",
        "date": "01092015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "REGN",
        "title": "Sanofi  Regeneron cholesterol drug also effective in monthly doses "
    },
    {
        "content": "Jan 9 An experimental drug from Sanofi SA   and Regeneron Pharmaceuticals was found to be effective in lowering \"bad\" cholesterol even when administered once every four weeks  instead of every two weeks.",
        "date": "01092015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "UPDATE 2-Sanofi  Regeneron cholesterol drug also effective in monthly doses "
    },
    {
        "content": "PARIS  Jan 9 Pharmaceutical groups Sanofi  and Regeneron announced on Friday that two clinical trials showed that a monthly dose of experimental drug alirocumab was effective in patients with high cholesterol.",
        "date": "01092015",
        "name": "Regeneron Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "REGN",
        "title": "Sanofi  Regeneron announce positive trials of cholesterol drug "
    }
]