[
    {
        "content": "* ‍underlying revenue growth +4% in first nine months of 2017​",
        "date": "10262017",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "BRIEF-Relx reiterates outlook as revenue growth remains stable "
    },
    {
        "content": "* Will implement a programme to repurchase shares up to value of 160 million stg in total between 27 July 2017 and 5 December 2017",
        "date": "07272017",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "BRIEF-Relx says to buy back shares worth up to 160 million stg "
    },
    {
        "content": "* UNDERLYING REVENUE GROWTH +4%; H1 REPORTED TOTAL £3 718M/EUR 4 313M",
        "date": "07272017",
        "name": "RELX PLC",
        "news_type": "normal",
        "symbol": "RELX",
        "title": "BRIEF-Relx posts H1 adjusted operating profit of 1.15 bln pounds "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 05 (Fitch) Fitch Ratings has affirmed UK- and Netherlands-based media groups RELX PLC's and RELX NV's (together  RELX) Long-Term Issuer Default Ratings (IDR) and senior unsecured rating at 'BBB+'. The Outlook is Stable. A full list of rating actions is available below. RELX has a high quality portfolio of scaled businesses that are well diversified from a geographic and product perspective. The company has a leading market p",
        "date": "05052017",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "Fitch Affirms RELX at 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Key business trends so far in 2017 are consistent with same period in 2016",
        "date": "04192017",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "BRIEF-Relx reaffirms full-year outlook "
    },
    {
        "content": "* Underlying revenue growth +4 percent in first nine months of 2016",
        "date": "10272016",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "BRIEF-Relx reiterates outlook after maintaining 4 pct growth rate "
    },
    {
        "content": "* Trends in Q1 of 2016 were consistent with 2015 across our business",
        "date": "04202016",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "BRIEF-Relx says trends in Q1 consistent;full-year outlook remains unchanged "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  March 21 (Fitch) Fitch Ratings has affirmed London- and  Netherlands-based media groups RELX PLC's and RELX NV's (together  RELX)  Long-term Issuer Default Ratings (IDR) and senior unsecured rating at 'BBB+'.  The Outlook is Stable. A full list of rating actions is available below. RELX has a high quality  balanced portfolio of businesses that are competitively  well positioned and geographically diversified. The businesses are ",
        "date": "03212016",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "Fitch Affirms RELX at 'BBB+'; Outlook Stable "
    },
    {
        "content": "Feb 25 RELX Plc  Europe's largest media group  said it raised its dividend for 2015 and enhanced its share buyback target for this year.",
        "date": "02252016",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "UPDATE 1-RELX Plc hikes full-year dividend  raises buyback target "
    },
    {
        "content": "Feb 25 RELX Plc   Europe's largest media group  said it increased its dividend for 2015 and also its buyback target for 2016.",
        "date": "02252016",
        "name": "RELX PLC",
        "news_type": "normal",
        "symbol": "RELX",
        "title": "RELX Plc raises full-year dividend  ups buyback target for 2016 "
    },
    {
        "content": "* \u007fToday accepted undertakings given by Relx  trading as LexisNexis regarding merger between LexisNexis and Jordan Publishing",
        "date": "01142016",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "BRIEF-CMA accepts undertakings given by Relx regarding Jordan Publishng deal "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  April 09 (Fitch) This announcement corrects the version published on 2  April 2015 to include the Elsevier Finance SA senior unsecured notes issued by  ELM BV as well as by Aquarius + Investments PLC. Fitch Ratings has downgraded Reed Elsevier PLC's and Reed Elsevier NV's  (together  Reed) Long-term Issuer Default Ratings (IDR) to 'BBB+' from 'A-'. The  Outlook is Stable. A full list of rating actions is available below. Reed's ",
        "date": "04092015",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "Correct: Fitch Downgrades Reed Elsevier to 'BBB+'; Outlook Stable "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  April 02 (Fitch) Fitch Ratings has downgraded Reed Elsevier PLC's and  Reed Elsevier NV's (together  Reed) Long-term Issuer Default Ratings (IDR) to  'BBB+' from 'A-'. The Outlook is Stable. A full list of rating actions is  available below. Reed's core business portfolio continues to perform strongly and in line with  Fitch's expectations.   The downgrade in Reed's ratings is triggered by management's propensity to  accept slig",
        "date": "04022015",
        "name": "RELX PLC",
        "news_type": "topStory",
        "symbol": "RELX",
        "title": "Fitch Downgrades Reed Elsevier to 'BBB+'; Outlook Stable "
    }
]