[
    {
        "content": "* Collaboration with Red Hat to offer HCL application PaaS services to enterprise customers globally Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-HCL Technologies announces collaboration with Red Hat "
    },
    {
        "content": "Red Hat Inc  reported a better-than-expected quarterly profit and raised its full-year forecasts  driven by strong demand for the company's products that help make the transition to the cloud.",
        "date": "09252017",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "Linux distributor Red Hat beats profit estimate  raises forecasts "
    },
    {
        "content": "Sept 25 Red Hat Inc reported a better-than-expected quarterly profit and raised its full-year forecasts  driven by strong demand for the company's products that help make the transition to the cloud.",
        "date": "09252017",
        "name": "Red Hat Inc",
        "news_type": "normal",
        "symbol": "RHT",
        "title": "UPDATE 1-Linux distributor Red Hat beats profit estimate  raises forecasts "
    },
    {
        "content": "* Red Hat appoints Narendra Gupta as new chairman of the board",
        "date": "08292017",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Red Hat appoints Narendra Gupta as chairman of the board "
    },
    {
        "content": "* Red Hat acquires Permabit assets  eases barriers to cloud portability with data deduplication technology",
        "date": "07312017",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Red Hat acquires Permabit assets "
    },
    {
        "content": "* ceo James Whitehurst's FY 2017 total compensation was $11.1 million versus $12.7 million in fy 2016 - sec filing Source text: (http://bit.ly/2sZxFRA) Further company coverage:",
        "date": "06222017",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Red Hat CEO James Whitehurst's FY 2017 total compensation was $11.1 mln "
    },
    {
        "content": "* Sees fy 2018 non-gaap earnings per share about $2.66 to $2.70",
        "date": "06202017",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Red Hat Q1 adjusted non-GAAP earnings per share $0.56 "
    },
    {
        "content": "* Red Hat names Eric Shander as executive vice president and chief financial officer Source text for Eikon: Further company coverage:",
        "date": "04182017",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Red Hat names Eric Shander as chief financial officer "
    },
    {
        "content": "* Red Hat reports fourth quarter and fiscal year 2017 results",
        "date": "03272017",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Red Hat reports Q4 and fiscal year 2017 results "
    },
    {
        "content": "* Red Hat Inc - on January 18  2017  board appointed Eric R. Shander  to serve as company's acting chief financial officer and principal financial officer",
        "date": "01242017",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Red Hat names Eric Shander as company's acting CFO "
    },
    {
        "content": "* Says it collaborates with Red Hat on Eclipse Kapua platform providing services to manage IoT gateways and smart edge devices  Source text: www.1info.it Further company coverage:    (Gdynia Newsroom)",
        "date": "10182016",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Eurotech collaborates with Red Hat on Eclipse Kapua platform "
    },
    {
        "content": "* Boston facility will house a new Executive Briefing Center  Red Hat Open Innovation Labs  and Red Hat Engineering Lab",
        "date": "09162016",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Red Hat announces plans for new facility in Boston "
    },
    {
        "content": "* Red Hat Inc Says Ceo James M. Whitehurst's Total Compensation For 2015 Was $16.7 Mln - SEC filing",
        "date": "06232016",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Red Hat CEO James Whitehurst total 2016 compensation $12.7 mln "
    },
    {
        "content": "* New program is to replace previous $500 million repurchase program that will be terminated effective June 30  2016",
        "date": "06222016",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Red Hat announces $1 bln stock repurchase program "
    },
    {
        "content": "* Signs strategic collaboration with Red Hat to accelerate the group's  global transformation and technology-driven innovation processes",
        "date": "05252016",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-BBVA signs strategic collaboration with Red Hat "
    },
    {
        "content": "Red Hat Inc shares could rise 30 percent in a year as more companies use its server software  according to a report on Sunday in the financial publication Barron's.",
        "date": "05222016",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "Red Hat shares could rise 30 percent in a year: Barron's "
    },
    {
        "content": "May 22 Red Hat Inc shares could rise 30 percent in a year as more companies use its server software  according to a report on Sunday in the financial publication Barron's.",
        "date": "05222016",
        "name": "Red Hat Inc",
        "news_type": "normal",
        "symbol": "RHT",
        "title": "Red Hat shares could rise 30 percent in a year -Barron's "
    },
    {
        "content": "Red Hat Inc   the world's largest commercial distributor of the Linux operating system  reported a 17.1 percent rise in quarterly revenue  helped by higher demand for open-source software and cloud offerings.",
        "date": "03222016",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "Red Hat quarterly revenue rises 17.1 percent "
    },
    {
        "content": "March 22 Red Hat Inc  the world's largest commercial distributor of the Linux operating system  reported a 17.1 percent rise in quarterly revenue  helped by higher demand for open-source software and cloud offerings.",
        "date": "03222016",
        "name": "Red Hat Inc",
        "news_type": "normal",
        "symbol": "RHT",
        "title": "Red Hat quarterly revenue rises 17.1 pct "
    },
    {
        "content": "* Collaborates with Red Hat to integrate operational data with cloud-based back-end services for end-to-end internet-of-things implementations",
        "date": "03012016",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Eurotech collaborates with Red Hat for end-to-end internet-of-things implementations "
    },
    {
        "content": "* Agreements aim to accelerate delivery of virtualized radio access networks  Source text: http://bit.ly/1Ycsd7o Further company coverage:    (Gdynia Newsroom)",
        "date": "12152015",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "BRIEF-Alcatel-Lucent signs agreements with Red Hat  Advantech and 6Wind "
    },
    {
        "content": "Red Hat Inc   the world's largest commercial distributor of the Linux operating system  reported a 13 percent rise in quarterly revenue  helped by higher demand for open-source software and cloud offerings.",
        "date": "09212015",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "Red Hat revenue rises 13 percent "
    },
    {
        "content": "Sept 21 Red Hat Inc  the world's largest commercial distributor of the Linux operating system  reported a 13 percent rise in quarterly revenue  helped by higher demand for open-source software and cloud offerings.",
        "date": "09212015",
        "name": "Red Hat Inc",
        "news_type": "normal",
        "symbol": "RHT",
        "title": "Red Hat revenue rises 13 pct "
    },
    {
        "content": "June 18 Red Hat Inc  the world's largest commercial distributor of the Linux operating system  reported a 13.5 percent rise in quarterly revenue  helped by increasing adoption of open-source software and its cloud-based products.",
        "date": "06182015",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "Red Hat revenue rises 13.5 pct "
    },
    {
        "content": "* Indexes off: Dow 0.23 pct  S&P 0.24 pct  Nasdaq 0.27 pct   (Updates prices  changes comment  byline)",
        "date": "03262015",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "US STOCKS-Wall St ends down in choppy session  but off lows "
    },
    {
        "content": "Red Hat Inc   the world's largest commercial distributor of the Linux operating system  forecast a profit for the first quarter that matched analysts' estimates despite warning on a strong dollar hurting its revenue.",
        "date": "03252015",
        "name": "Red Hat Inc",
        "news_type": "topStory",
        "symbol": "RHT",
        "title": "Red Hat profit forecast matches estimates despite strong dollar "
    },
    {
        "content": "March 25 Red Hat Inc  the world's largest commercial distributor of the Linux operating system  forecast a profit for the first quarter that matched analysts' estimates despite warning on a strong dollar hurting its revenue.",
        "date": "03252015",
        "name": "Red Hat Inc",
        "news_type": "normal",
        "symbol": "RHT",
        "title": "UPDATE 2-Red Hat profit forecast matches estimates despite strong dollar "
    },
    {
        "content": "* Indexes off: Dow 1.62 pct  S&P 1.46 pct  Nasdaq 2.37 pct   (Adds Red Hat earnings)",
        "date": "03252015",
        "name": "Red Hat Inc",
        "news_type": "normal",
        "symbol": "RHT",
        "title": "US STOCKS-Wall St drops as biotechs  semis sink Nasdaq "
    },
    {
        "content": "March 25 Red Hat Inc  the world's largest commercial distributor of the Linux operating system  reported a 16 percent jump in quarterly revenue  as the company benefits from increasing adoption of open-source software and its cloud-based products.",
        "date": "03252015",
        "name": "Red Hat Inc",
        "news_type": "normal",
        "symbol": "RHT",
        "title": "Red Hat's revenue jumps 16 pct as demand rises for cloud software "
    },
    {
        "content": "BOSTON  Jan 27 Red Hat Inc and other makers of the widely used Linux operating system for business computers updated their software on Tuesday to thwart a serious new cyber threat they warned could allow hackers to gain remote control of their systems.",
        "date": "01272015",
        "name": "Red Hat Inc",
        "news_type": "normal",
        "symbol": "RHT",
        "title": "Linux makers release patch to thwart new 'Ghost' cyber threat "
    }
]