[
    {
        "content": "SYDNEY Rio Tinto investors gave a mixed reaction to a report that former senior mining executive Mick Davis  now chief executive of Britain's ruling Conservative Party  was well-placed to become the Anglo-Australian miner's next chairman.",
        "date": "11142017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Ex-Xstrata chief Davis eyed for Rio Tinto chairman's job: FT "
    },
    {
        "content": "* Currently chief executive of British Conservative Party (Adds investor comment  details)",
        "date": "11142017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Ex-Xstrata chief Davis eyed for Rio Tinto chairman's job -FT "
    },
    {
        "content": "Nov 14 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11142017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "PRESS DIGEST- Financial Times - Nov 14 "
    },
    {
        "content": "OTTAWA  Nov 1 The current state of talks to update the NAFTA trade pact is creating uncertainty among businesses and could hurt investments and growth  Rio Tinto Aluminium chief executive Alf Barrios said on Wednesday.",
        "date": "11022017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "NAFTA talks causing business uncertainty: Rio Tinto executive "
    },
    {
        "content": "SYDNEY Rio Tinto is attracting renewed interest in selling its Pacific Aluminium smelting unit by adding two alumina refineries in Australia to the portfolio  according to three sources familiar with the matter.",
        "date": "10312017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto adds alumina refineries to aluminum smelters sale: sources "
    },
    {
        "content": "SYDNEY  Oct 31 Rio Tinto  is attracting renewed interest in selling its Pacific Aluminium smelting unit by adding two alumina refineries in Australia to the portfolio  according to three sources familiar with the matter.",
        "date": "10312017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto adds alumina refineries to aluminium smelters sale -sources "
    },
    {
        "content": "LONDON  Nov 1 Africa  as the largest untapped source of growth in the mining sector  is pivotal in helping Rio Tinto  and other resources companies to supply the changing needs of the huge Asian market  a senior company official said on Wednesday.",
        "date": "11012017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "LMEWEEK-Rio Tinto throws its weight behind Africa as mining central "
    },
    {
        "content": "TORONTO/VANCOUVER  Oct 25 Freeport-McMoRan Inc is encouraged by talks to finalize an agreement for its massive Grasberg copper and gold mine in Indonesia this year  though it has not made as much progress as hoped  Chief Executive Richard Adkerson said on Wednesday.",
        "date": "10252017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 3-Freeport CEO sees some progress in mine deal talks with Indonesia "
    },
    {
        "content": "SYDNEY  Oct 24 A U.S. law firm has filed a class action suit against mining giant Rio Tinto   which is facing U.S. Securities and Exchange Commission (SEC) fraud charges stemming from an ill-fated investment in Mozambique coal mining.",
        "date": "10242017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "U.S. law firm files class suit against Rio Tinto over Mozambique coal "
    },
    {
        "content": "* 1st publicly announced class action vs Rio on Mozambique deal",
        "date": "10242017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-U.S. law firm files class suit against Rio Tinto over Mozambique coal "
    },
    {
        "content": "NEW DELHI Indian resources conglomerates Adani and Vedanta are considering bidding for a $9 billion diamond project in the country that was abandoned by global miner Rio Tinto   this year  according to multiple sources with knowledge of the matter.",
        "date": "10262017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Exclusive: Vedanta  Adani may bid for $9 billion Indian diamond mine left by Rio "
    },
    {
        "content": "LONDON Former Rio Tinto  chief financial officer Guy Elliott has stepped down from Britain's Takeover Panel following fraud charges brought by the U.S. Securities and Exchange Commission (SEC) related to his time at the miner.",
        "date": "10202017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Former Rio Tinto CFO Elliott resigns from Britain's Takeover Panel "
    },
    {
        "content": "SYDNEY Global miner Rio Tinto has opened its books to more than a half-dozen potential buyers of its remaining two Australian coal mines as it winds down the sales process  two people familiar with the sale process said on Friday.",
        "date": "10202017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio opens books to over half-dozen possible suitors for Australia coal mines: sources "
    },
    {
        "content": "* Analyst says gap narrowing between BHP  Rio (Adds detail on Resolution copper mine)",
        "date": "10192017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 3-BHP presents united front against activist Elliott "
    },
    {
        "content": "SYDNEY/NEW YORK The U.S. Securities and Exchange Commission (SEC) on Tuesday charged mining company Rio Tinto Plc   and two of its former top executives with fraud  saying they inflated the value of coal assets in Mozambique and concealed critical information while tapping the market for billions of dollars. | Video ",
        "date": "10182017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "U.S. SEC charges Rio Tinto  former top executives with fraud "
    },
    {
        "content": "WASHINGTON  Oct 17 The U.S. Securities and Exchange Commission said it charged  mining company Rio Tinto Plc  and two of its former top executives on Tuesday with fraud for inflating the value of coal assets acquired for $3.7 billion and sold a few years later for $50 million.",
        "date": "10172017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-Rio Tinto  former top executives  charged with fraud -U.S. SEC "
    },
    {
        "content": "* Sale seen fetching around $2 bln - sources (Adds analyst comment  industry context)",
        "date": "10202017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio opens books to over half-dozen possible suitors for Australia coal mines –sources "
    },
    {
        "content": "* Says CGI and Rio Tinto expand outsourcing partnership to include industry 4.0 digital transformation initiatives",
        "date": "10192017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BRIEF-CGI and Rio Tinto expand outsourcing partnership "
    },
    {
        "content": "* SEC seeks to bar Albanese  Elliott from roles at public companies. (Adds detail on SEC  US bonds)",
        "date": "10182017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 5-U.S. SEC charges Rio Tinto  former top executives with fraud "
    },
    {
        "content": "WASHINGTON  Oct 17 The U.S. Securities and Exchange Commission said it charged  mining company Rio Tinto Plc and two of its former top executives on Tuesday with fraud for inflating the value of coal assets acquired for $3.7 billion and sold a few years later for $50 million.",
        "date": "10172017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto  former top executives  charged with fraud -U.S. SEC "
    },
    {
        "content": "Global miner Rio Tinto declared force majeure last Friday on shipments of refined copper from its Kennecott mine in the United States following the death of a worker  a spokesman said on Tuesday.",
        "date": "10172017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto declares force majeure on copper from U.S. mine "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Rio Tinto bought a coal mine in Mozambique in 2011 for too much money. U.S. and UK regulators now say it came clean about the real  diminished value of the mine too late. The second type of problem is less likely to recur. Rio has settled one case already and  in any event  the accounting rules for writing down badly priced acquisitions are relatively clear. If only there were similar safeguards against mining bosses getting carried away with deals in the first p",
        "date": "10182017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Breakingviews - Mistimed writedowns lesser of mining M&A evils "
    },
    {
        "content": "The U.S. Securities and Exchange Commission (SEC) has charged mining company Rio Tinto  and two of its former top executives with inflating the value of coal assets in Mozambique and concealing critical information while tapping the market for billions of dollars.",
        "date": "10182017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Factbox: Excerpts from U.S. SEC fraud filing against Rio Tinto former top executives "
    },
    {
        "content": "Global miner Rio Tinto on Tuesday said it had lifted its third quarter iron ore shipments by 6 percent after modernizing its haulage railway in Australia's outback  but cut its production target for copper due to delays at a major mine in Chile.",
        "date": "10172017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto iron ore shipments climb on rail upgrade  on track for annual target "
    },
    {
        "content": "* But cuts copper output guidance due to delays at Chile mine (Adds byline  analyst comment  detail on rail line and copper shipments)",
        "date": "10172017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio Tinto iron ore shipments climb on rail upgrade  on track for annual target "
    },
    {
        "content": "SYDNEY The U.S. Securities and Exchange Commission on Tuesday charged  mining company Rio Tinto Plc   and two of its former top executives with fraud  saying they inflated the value of coal assets in Mozambique and concealed critical information while tapping the market for billions of dollars.",
        "date": "10182017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Timeline: Rio Tinto faces fraud charges over Mozambique coal investment "
    },
    {
        "content": "SYDNEY  Oct 18 The U.S. Securities and Exchange Commission on Tuesday charged  mining company Rio Tinto Plc and two of its former top executives with fraud  saying they inflated the value of coal assets in Mozambique and concealed critical information while tapping the market for billions of dollars.",
        "date": "10182017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "TIMELINE-Rio Tinto faces fraud charges over Mozambique coal investment "
    },
    {
        "content": "LONDON A group of investors including buyout firm Apollo and pension fund Canada Pension Plan (CPP) is bidding for coal assets put up for sale by mining giant Rio Tinto   which could fetch $2 billion  sources familiar with the matter told Reuters.",
        "date": "10122017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto's $2 billion coal assets attract investor consortium: sources "
    },
    {
        "content": "LONDON  Oct 12 A group of investors including buyout firm Apollo and pension fund Canada Pension Plan (CPP) is bidding for coal assets put up for sale by mining giant Rio Tinto  which could fetch $2 billion  sources familiar with the matter told Reuters.",
        "date": "10122017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto's $2 bln coal assets attract investor consortium - sources "
    },
    {
        "content": "MELBOURNE  Oct 2 Rio Tinto is set to use driverless iron ore trains in Western Australia in 2018  the world No.2 miner of the steelmaking commodity said on Monday after completing its first long-haul journey with a completely autonomous locomotive.",
        "date": "10022017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto on track to go driverless on iron ore trains in 2018 "
    },
    {
        "content": "Major miner Rio Tinto  on Friday said its Chief Financial Officer Chris Lynch would retire from his role by the end of September 2018  when he will be 65.",
        "date": "09152017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Miner Rio Tinto's CFO Chris Lynch to retire in September 2018 "
    },
    {
        "content": "* RIO TINTO HOLDINGS AND TURQUOISE HILL HAVE AGREED TO SELL  RESPECTIVELY 7.5 MLN COMMON SHARES AND 6.2 MLN COMMON SHARES OF MASON RESOURCES CORP",
        "date": "08042017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BRIEF-Rio Tinto says to sell Mason Resources Corp stake "
    },
    {
        "content": "SYDNEY/LONDON Global miner Rio Tinto more than doubled its first-half profit buoyed by Chinese iron ore demand and rewarded shareholders with a record interim dividend and $1 billion in share buybacks. | Video ",
        "date": "08022017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto doubles first-half profit  offers record dividend "
    },
    {
        "content": "* William Hill jumps on stronger online revenue (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon - see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "08022017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Standard Chartered  Rio Tinto weigh on Britain's FTSE as results disappoint "
    },
    {
        "content": "* Underlying earnings $3.94 bln vs $1.56 bln (poll: $4.19 bln)",
        "date": "08022017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-Rio Tinto doubles H1 profit  offers record dividend "
    },
    {
        "content": "Aug 2 Miner Rio Tinto is making good progress in the deal to sell its stake in the Simandou project in Guinea  Chief Financial Officer  Christopher Lynch said on Wednesday.",
        "date": "08022017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto CFO says good progress being made in Simandou deal "
    },
    {
        "content": "LONDON  Aug 2 Britain's major share index slipped on Wednesday as basic resources and financial stocks weighed on another full day of earnings with Standard Chartered and Rio Tinto among the large companies reporting disappointing results.",
        "date": "08022017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "StanChart  miners weigh on Britain's FTSE as results disappoint "
    },
    {
        "content": "Aug 2 Global miner Rio Tinto  on Wednesday reported its first-half profit more than doubled from a year earlier following a rebound in iron ore prices and announced an additional $1 billion share buyback.",
        "date": "08022017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto H1 earnings more than double on higher commodity prices "
    },
    {
        "content": "LONDON Britain's anti-fraud regulator has opened an investigation into suspected corruption in Australian-British miner Rio Tinto Plc's  business conduct in the Republic of Guinea  the agency said.",
        "date": "07242017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UK fraud regulator says probing Rio Tinto's Guinea operations "
    },
    {
        "content": "LONDON  July 24 Britain's anti-fraud regulator has opened an investigation into suspected corruption in Australian-British miner Rio Tinto Plc's business conduct in the Republic of Guinea  the agency said.",
        "date": "07242017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-UK fraud regulator says probing Rio Tinto's Guinea operations "
    },
    {
        "content": "LONDON  July 24 Britain's anti-fraud regulator said it has opened an investigation into how the miner Rio Tinto conducted business in the Republic of Guinea.",
        "date": "07242017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UK's SFO says opens investigation into Rio Tinto Group "
    },
    {
        "content": "* Rio blames rail work  bad weather (Updates with copper guidance  output)",
        "date": "07182017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio cuts 2017 iron ore guidance as rail work hits shipments "
    },
    {
        "content": "July 18 Australian shares faltered on Tuesday as banks were sold off and Rio Tinto stocks slipped after the company cut its 2017 iron ore guidance.",
        "date": "07182017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Australia shares stumble as bank stocks sell off  NZ ticks up "
    },
    {
        "content": "SUPERIOR  Arizona Rio Tinto's proposed Resolution Copper Mine in Arizona would tunnel 7 000 feet underground  where rocks radiate heat from the earth’s molten core. It would suck up enough water to supply a city and leave a crater a mile and a half wide and 1 000 feet deep. | Video ",
        "date": "07132017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Massive copper mine tests Trump's push to slash regulation "
    },
    {
        "content": "TORONTO  July 14 Canada's Dominion Diamond Corp   the world's third-largest diamond producer by market value  is in advanced and friendly talks with The Washington Companies on a sweetened cash takeover bid  sources told Reuters this week.",
        "date": "07142017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-EXCLUSIVE-Washington Companies in talks to buy Canada's Dominion Diamond -sources "
    },
    {
        "content": "TORONTO  July 14 Canada's Dominion Diamond Corp   the world's third-largest diamond producer by market value  is in advanced and friendly talks with The Washington Companies on a sweetened cash takeover bid  sources told Reuters this week.",
        "date": "07142017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Washington Companies in talks to buy Canada's Dominion Diamond -sources "
    },
    {
        "content": "SYDNEY Rio Tinto shareholders approved the sale of a suite of Australian coal assets to China-backed Yancoal Australia for $2.69 billion  ending a bidding war with commodities trader Glencore.",
        "date": "06292017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto shareholders okay $2.69 billion coal assets sale to China-backed Yancoal "
    },
    {
        "content": "* 97 pct of Rio shareholders back coal assets sale to Yancoal",
        "date": "06292017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto shareholders okay $2.69 bln coal assets sale to China-backed Yancoal "
    },
    {
        "content": "SYDNEY  June 29 Rio Tinto shareholders approved the sale of a suite of Australian coal assets to China-backed Yancoal Australia for $2.69 billion  ending a bidding war with commodities trader Glencore .",
        "date": "06292017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto shareholders approve $2.69 bln coal sale to Yancoal "
    },
    {
        "content": "SYDNEY/LONDON Rio Tinto on Monday confirmed Yancoal Australia as the preferred buyer for its Australian Coal & Allied unit after the China-backed company added an eleventh-hour sweetener to top a rival bid from Glencore.",
        "date": "06262017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio picks China-backed Yancoal over Glencore for coal sale "
    },
    {
        "content": "* Rio CEO says Yancoal bid offers \"compelling value\" (Adds share price  shareholder votes  analyst  context)",
        "date": "06262017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio picks China-backed Yancoal over Glencore for coal sale "
    },
    {
        "content": "SYDNEY  June 26 Rio Tinto  on Monday confirmed Yancoal Australia as the preferred buyer for its Australian Coal & Allied unit after the China-backed company lifted its offer to $2.69 billion to top a rival bid from Glencore.",
        "date": "06262017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto confirms China-backed Yancoal as preferred buyer for coal assets "
    },
    {
        "content": "Miner and trader Glencore  on Friday hit back with an increased offer of $2.675 billion in cash to buy Australian coal assets from Rio Tinto   that earlier this week said it was favoring a Chinese bid.",
        "date": "06232017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Glencore in bidding war with China to buy Rio coal assets "
    },
    {
        "content": "* Rio no immediate comment (Adds Rio statement  updates share price)",
        "date": "06232017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-Glencore in bidding war with China to buy Rio coal assets "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Rio Tinto prefers Chinese money today to Swiss cash tomorrow. Late on Tuesday  the Anglo-Australian miner's board opted for an upgraded $2.45 billion bid from Yancoal  instead of taking $100 million more from Glencore. Concerns about Chinese regulators must have played a role. The Swiss trader might need to come up with lots more money to stay in the game.",
        "date": "06212017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Glencore misreads Chinese tea leaves in bid battle "
    },
    {
        "content": "Rio Tinto   said on Friday it has completed a planned bond buyback  reducing gross debt by $2.5 billion  with the early redemption costs likely to reduce first-half underlying profit by about $180 million.",
        "date": "06222017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio flags $180 million hit to first-half underlying profit after bond buyback "
    },
    {
        "content": "SYDNEY/LONDON Rio Tinto   selected Yancoal  on Tuesday to buy its Coal & Allied division in Australia for $2.45 billion  surprising commodities trading giant Glencore   which had put in a higher bid.",
        "date": "06202017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto recommends Yancoal coal offer over Glencore "
    },
    {
        "content": "* Acknowledges it received revised proposal from Glencore to buy Coal & Allied Industries Limited",
        "date": "06232017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BRIEF-Rio Tinto to adjourn general meeting if Glencore offer deemed superior "
    },
    {
        "content": "June 23 Miner and trader Glencore Plc said on Friday it had submitted an improved proposal to buy Australian miner Rio Tinto's  stake in Coal & Allied Industries Ltd for $2.675 billion in cash plus a coal price-linked royalty.",
        "date": "06232017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Glencore increases offer to buy Rio's stake in Coal & Allied "
    },
    {
        "content": "* Shareholders to vote later this month (Adds detail of termination fee  updates share prices)",
        "date": "06202017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-Rio Tinto recommends Yancoal coal offer over Glencore "
    },
    {
        "content": "* Says Glencore increases fully funded offer for Coal & Allied",
        "date": "06232017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BRIEF-Glencore increases offer for Coal & Allied "
    },
    {
        "content": "ULAANBAATAR  June 20 Anglo-Australian miner Rio Tinto  has started new exploration work in Mongolia's Gobi desert after a gap of around five years  in a sign that Mongolia is having some success at bringing back foreign investors.",
        "date": "06202017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto starts new exploration in Mongolia's Gobi desert "
    },
    {
        "content": "LONDON Glencore  on Tuesday said it would review its options after Rio Tinto  said it was sticking to a recommendation of China-backed Yancoal  as the preferred buyer of its Coal & Allied division in Australia.",
        "date": "06202017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Glencore says will respond in due course after Rio favors Yancoal bid "
    },
    {
        "content": "LONDON  June 20 Glencore on Tuesday said it would review its options after Rio Tinto said it was sticking to a recommendation of China-backed Yancoal as the preferred buyer of its Coal & Allied division in Australia.",
        "date": "06202017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Glencore says will respond in due course after Rio favours Yancoal bid "
    },
    {
        "content": "MONTREAL  June 13 The chief executive of Anglo-Australian miner Rio Tinto   which owns iron ore  diamond and aluminum mines and processing facilities in Canada  said on Tuesday that it was becoming tougher to do business in the resource-rich country.",
        "date": "06132017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto CEO sees Canada as less business-friendly than in past "
    },
    {
        "content": "* Yancoal receives key prc regulatory approvals for coal & allied acquisition",
        "date": "06122017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BRIEF-Yancoal Australia receives Chinese regulatory approvals for Coal & Allied Acquisition "
    },
    {
        "content": "SYDNEY Glencore will pitch its $2.55 billion bid for Rio Tinto's Australian Coal & Allied unit directly to Rio Tinto's board in Canada on Thursday  two sources familiar with the matter told Reuters.",
        "date": "06142017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Glencore to pitch to Rio board for Australian coal unit: sources "
    },
    {
        "content": "* ‍Rio Tinto board and management will give proposal appropriate consideration and respond in due course​",
        "date": "06122017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BRIEF-Rio Tinto says gets Glencore proposal  to respond in due course "
    },
    {
        "content": "SYDNEY  June 14 Glencore will pitch its $2.55 billion bid for Rio Tinto's  Australian Coal & Allied unit directly to Rio Tinto's board in Canada on Thursday  two sources familiar with the matter told Reuters.",
        "date": "06142017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Glencore to pitch to Rio board for Australian coal unit - sources "
    },
    {
        "content": "HONG KONG China's Yancoal has gained Chinese regulatory approval for its $2.45 billion purchase of Rio Tinto's Australian unit Coal & Allied Industries Ltd  the company said in a stock exchange filing on Sunday which also acknowledged Glencore's counterbid for the assets on Friday.",
        "date": "06112017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "China's Yancoal gets regulatory approval for $2.45 billion Rio Tinto deal "
    },
    {
        "content": "HONG KONG  June 11 China's Yancoal has gained Chinese regulatory approval for its $2.45 billion purchase of Rio Tinto's Australian unit Coal & Allied Industries Ltd  the company said in a stock exchange filing on Sunday which also acknowledged Glencore's counterbid for the assets on Friday.",
        "date": "06112017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "China's Yancoal gets regulatory approval for $2.45 bln Rio Tinto deal "
    },
    {
        "content": "    June 8 Britain's FTSE 100 index is seen opening down 2 points at 7477 on Thursday  according to financial bookmakers.       * ELECTIONS: Prime Minister Theresa May is on course to increase her majority in parliament in Britain's election on Thursday  opinion polls showed on Wednesday  suggesting her gamble to call the vote to bolster her position in Brexit negotiations will pay off.     * SHELL: Royal Dutch Shell said on Wednesday its business is not experiencing any operational ",
        "date": "06082017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UK Stocks-Factors to watch on June 8 "
    },
    {
        "content": "Miner-trader Glencore  on Friday said it had offered $2.55 billion cash for coal mines owned by Rio Tinto   in Hunter Valley  Australia  outbidding a previous offer from Chinese-owned Yancoal.",
        "date": "06092017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Glencore outbids Yancoal for Rio Tinto's Hunter Valley coal mines "
    },
    {
        "content": "LONDON Rio Tinto and China Minmetals Corp on Tuesday signed an outline deal on collaboration in mineral exploration  saying the partnership would position it to find the reserves needed for today's economy.",
        "date": "06062017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto  China's Minmetals sign deal on exploration "
    },
    {
        "content": "* Rio Tinto says will respond 'in due course' (Adds Rio comment  paragraph 6  bullet point)",
        "date": "06092017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-Glencore outbids Yancoal for Rio Tinto's Hunter Valley coal mines "
    },
    {
        "content": "June 9 Miner and trader Glencore Plc said on Friday it had submitted a proposal to buy Australian miner Rio Tinto's  stake in Coal & Allied Industries Ltd for $2.55 billion in cash.",
        "date": "06092017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Glencore to buy Rio Tinto's stake in Coal & Allied for $2.55 bln "
    },
    {
        "content": "* Submits fully funded proposal to acquire Coal & Allied and agrees conditional acquisition of Mitsubishi's interest in coal & allied mines",
        "date": "06092017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BRIEF-Glencore to buy Rio Tinto's stake in Coal & Allied for $2.5 bln "
    },
    {
        "content": "* Unit acquires Rio Tinto exploration properties in Michigan  consideration for the acquisition is US$18.0 million",
        "date": "05312017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BRIEF-Highland Copper Company's unit acquires Rio Tinto exploration properties in Michigan for $18.0 mln "
    },
    {
        "content": "* Australian state eyes Rio  BHP iron ore fee to plug budget hole",
        "date": "05292017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Australian state asks Rio  BHP for upfront cash "
    },
    {
        "content": "SYDNEY Yancoal Australia said it was not concerned \"at this stage\" over the financial strength of its No.2 shareholder Noble Group  and that its acquisition of Rio Tinto's coal mines did not hinge on funding from the commodities trader.",
        "date": "05262017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Yancoal not concerned for now over Noble Group's financial strength "
    },
    {
        "content": "LONDON Global miner Rio Tinto   said on Monday it would launch a new bond buyback of up to $2.5 billion in an effort to cut debt.",
        "date": "05222017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Miner Rio Tinto launches $2.5 billion bond buyback "
    },
    {
        "content": "SYDNEY Rio Tinto said on Tuesday it could match last year's $2.7 billion cash return to shareholders in 2017 even if iron ore prices plummet to near record lows of $42 a ton.",
        "date": "05162017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto can maintain cash returns even if iron ore prices sink: CEO "
    },
    {
        "content": "TORONTO/VANCOUVER  May 11 The Canada Pension Plan Investment Board (CPPIB))  the country's biggest public pension fund  is considering a bid for Dominion Diamond Corp and is studying the miner's books  people familiar with the process told Reuters.",
        "date": "05112017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Canada's CPPIB pension fund may bid for Dominion Diamond -sources "
    },
    {
        "content": "LONDON Aluminum is one of the materials benefiting from the greening of the world's economy.",
        "date": "05112017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "How would you like your aluminum? Green or black? Andy Home "
    },
    {
        "content": "LONDON  May 10 Aluminium is one of the materials benefiting from the greening of the world's economy.",
        "date": "05112017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-COLUMN-How would you like your aluminium? Green or black? Andy Home "
    },
    {
        "content": "SYDNEY The sale of two Rio Tinto   coking coal mines in Australia is attracting scores of interested buyers as private equity and public companies compete for a foothold in one of the year's hottest commodities  four sources familiar with the matter said on Friday.",
        "date": "05052017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Buyers ready to pounce on Rio Tinto coking coal mines: sources "
    },
    {
        "content": "ULAANBAATAR  May 5 Mongolia's legislature removed the main obstacle to an International Monetary Fund-led bailout for its crisis-ridden economy by annulling a controversial banking requirement for foreign-invested projects  state news agency Montsame said Friday.",
        "date": "05052017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Mongolia annuls forex regulation to pave way for IMF bailout "
    },
    {
        "content": "SYDNEY  May 4 Global miner Rio Tinto said on Thursday it is watching for signs of a revival in domestic iron ore mining in China later this year to reduce reliance on imports amid firmer ore prices.",
        "date": "05042017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto watching for revival in China iron ore mining "
    },
    {
        "content": "* Coal demand comes from Asian steel mills (Adds Wesfarmers  Mt Gibson quotes  details)",
        "date": "05052017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Buyers ready to pounce on Rio Tinto coking coal mines -sources "
    },
    {
        "content": "SYDNEY  May 5 The sale of two Rio Tinto coking coal mines in Australia is attracting scores of interested buyers as private equity and public companies compete for a foothold in one of the year's hottest commodities  four sources familiar with the matter said on Friday.",
        "date": "05052017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Buyers ready to pounce on Rio Tinto coking coal mines -sources "
    },
    {
        "content": "CONAKRY Guinea will not accept any major changes to the terms of the Simandou iron ore project that Chinalco bought from Rio Tinto  including building a 650-km railway rather than taking a shorter route via its neighbors  the mines minister said on Wednesday.",
        "date": "04262017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Guinea will not accept any big changes to Chinalco iron ore deal "
    },
    {
        "content": "SYDNEY Global miner Rio Tinto   on Thursday said first-quarter iron production from Australia fell 3 percent from the same period a year ago due to wet weather at its mines  but kept its full-year guidance intact despite weakening ore prices.",
        "date": "04192017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rains cut Rio first-quarter iron ore output 3 percent "
    },
    {
        "content": "* Cuts mined copper guidance (Adds iron ore  aluminium  copper figures  quote)",
        "date": "04192017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rains cut Rio Q1 iron ore output 3 pct "
    },
    {
        "content": "SYDNEY  April 20 Global miner Rio Tinto said first quarter iron production from Australia fell 3 percent from the same period a year ago due to wet weather at its mines  but kept its full-year guidance intact.",
        "date": "04192017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto 1st qtr iron ore output slips 3 pct "
    },
    {
        "content": "SYDNEY Australia's foreign investment watchdog has cleared Chinese- backed coal miner Yancoal Australia Ltd  to pursue its $2.45 billion acquisition of Rio Tinto's   Coal and Allied Division  Yancoal said on Thursday.",
        "date": "04132017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Yancoal says Australia government clears Rio coal sale "
    },
    {
        "content": "Diversified miner Rio Tinto Plc said on Wednesday it was continuing talks on the long-term future of its stake in the Grasberg copper mine in Indonesia and one of its top executives would visit the country for talks over the coming weeks.",
        "date": "04122017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio ponders future in Indonesia's Grasberg copper mine "
    },
    {
        "content": "* Rio has 40 percent share of production (Adds detail on length of talks  Rio visit)",
        "date": "04122017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio ponders future in Indonesia's Grasberg copper mine "
    },
    {
        "content": "April 12 Diversified miner Rio Tinto Plc reiterated its decision to continue discussions regarding the future of its stake in the Grasberg mine in Indonesia.",
        "date": "04122017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto to continue talks on Grasberg mine stake future "
    },
    {
        "content": "* BHP vs peers over two and 15 years: http://reut.rs/2oQXpNR http://reut.rs/2oQXCR9)",
        "date": "04122017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-COLUMN-Elliott's BHP plan was doomed  but the ulterior motive isn't: Russell "
    },
    {
        "content": "* BHP vs peers over two and 15 years: http://reut.rs/2oQXpNR http://reut.rs/2oQXCR9)",
        "date": "04122017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Elliott's BHP plan was doomed  but the ulterior motive isn't: Russell "
    },
    {
        "content": "SANTIAGO  April 2 The copper market is likely to see a small shortage as early as this year because of a lack of new supply and the removal of up to 800 000 tonnes over the past 18 months in response to modest prices  Rio Tinto's copper and diamonds chief will say on Tuesday.",
        "date": "04022017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto's copper boss sees small market deficit this year "
    },
    {
        "content": "LAUSANNE  Switzerland  March 28 Top executives from the world's largest commodity trading houses discuss trends in trading at the FT Commodities Global Summit in Lausanne  Switzerland  this week.",
        "date": "03282017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "REFILE-HIGHLIGHTS-Top trading houses at commodities conference "
    },
    {
        "content": "PERTH The potential restart of idled Chinese iron ore capacity will cause the most uncertainty for prices in 2017 and is likely to add to volatility for the rest of year  said a senior official of the world's No. 2 iron ore miner Rio Tinto.",
        "date": "03302017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio says reboot in Chinese iron ore production may lead to volatility "
    },
    {
        "content": "LONDON  March 21 London bankers are vying for contracts after Rio Tinto  said it had set up a new unit  Rio Tinto Ventures  to develop more specialised mining prospects as it seeks to reduce its reliance on bulk commodities  three banking sources said.",
        "date": "03212017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Big banks talking to Rio Tinto's specialist new Ventures arm "
    },
    {
        "content": "* Rio to announce successor this year   (Adds detail on Rio succession  analyst comment  shares)",
        "date": "03092017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 2-Britain's BT appoints Jan du Plessis as next chairman "
    },
    {
        "content": "LONDON  March 9 Britain's BT has appointed Jan du Plessis  chairman of miner Rio Tinto  as its next chairman  taking over from Mike Rake who has led the telecoms group for 10 years.",
        "date": "03092017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Britain's BT appoints Jan du Plessis as next chairman "
    },
    {
        "content": "LONDON The world's second biggest miner Rio Tinto has deferred for at least two years a decision on former chief executive Sam Walsh's performance-related pay  after a scandal over $10.5 million in payments to a consultant in Guinea.",
        "date": "03022017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto postpones decision on former CEO's bonus over Guinea scandal "
    },
    {
        "content": "* Walsh says always acted lawfully  confirms agreed deferral   (Updates with comment from Sam Walsh)",
        "date": "03022017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto postpones decision on former CEO's bonus over Guinea scandal "
    },
    {
        "content": "* Iron ore price nearly doubles in a year  closing in on $100/T",
        "date": "03022017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Back from the dead? Chinese iron ore miners plot return as prices surge "
    },
    {
        "content": "HOLLYWOOD  Fla.  Feb 27 Shareholders are pressuring miner Freeport-McMoRan to stand up to the Indonesian government over changes the southeast Asian country wants to make to the U.S. miner's contract of work  Freeport's chief executive said on Monday.",
        "date": "02272017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Shareholders want miner Freeport to get tough with Indonesia - CEO "
    },
    {
        "content": "Feb 23 Australian shares fell on Thursday  dragged by weakness in the materials sector with miner Rio Tinto  tumbling after  going ex-dividend  though rises in Qantas Airways and Casino operator Crown Resorts after their earnings contained losses.",
        "date": "02232017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Australia shares hit by materials  Qantas up after results; NZ edge higher "
    },
    {
        "content": "JOHANNESBURG  Feb 15 Reuters) - Mining company super profits appear to be back on the agenda as earnings stand to be turbo-charged by higher-than-expected prices for iron ore and other metals  while volumes are also likely to be strong.",
        "date": "02152017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-COLUMN-Iron ore rally fires up Rio Tinto's commodity merry-go-round: Russell "
    },
    {
        "content": " (The opinions expressed here are those of the author  a columnist for Reuters.)",
        "date": "02152017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Iron ore rally fires up Rio Tinto's commodity merry-go-round: Russell "
    },
    {
        "content": "JOHANNESBURG  Feb 15 Reuters) - Mining company super profits appear to be back on the agenda as earnings stand to be turbo-charged by higher-than-expected prices for iron ore and other metals  while volumes are also likely to be strong.",
        "date": "02152017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Iron ore rally fires up Rio Tinto's commodity merry-go-round: Russell "
    },
    {
        "content": "* Simon Henry  Sam Laidlaw  David Constable named as non-execs",
        "date": "02102017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto recruits three energy executives to board "
    },
    {
        "content": "JAKARTA  Feb 9 Rio Tinto  is considering walking away from its interest in the giant Grasberg copper mine operated by Freeport McMoRan Inc in Indonesia  The Australian newspaper reported on Thursday  citing the mining giant's chief executive.",
        "date": "02092017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto considers exiting interest in Freeport Indonesia mine -The Australian "
    },
    {
        "content": "SYDNEY Global miner Rio Tinto   put its focus on returning cash to shareholders on Wednesday after beating profit forecasts on the back of cost-cutting and a strong recovery in iron ore prices. | Video ",
        "date": "02082017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Confident Rio Tinto hands back cash as iron ore booms "
    },
    {
        "content": "LONDON/CAPE TOWN Rio Tinto   shrugged off concerns on Wednesday that its sale of Guinea's Simandou project to Chinalco  had stalled after an investigation into payments to a consultant who helped it win rights to the huge iron ore deposit.",
        "date": "02082017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto denies Guinea iron ore sale has stalled after investigation "
    },
    {
        "content": "* Underlying earnings up 12 pct   (Recasts  adds analyst comments)",
        "date": "02082017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Confident Rio Tinto hands back cash as iron ore booms "
    },
    {
        "content": "SYDNEY  Feb 8 Global miner Rio Tinto   said on Wednesday it will pay a bigger-than-expected annual dividend of $1.70 per share on the back of a strong recovery in mineral commodities markets in 2016 and cost-cutting.",
        "date": "02082017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto boosts dividend on commodities recovery "
    },
    {
        "content": "* Arianne Phosphate Inc says signing of a project agreement with Rio Tinto to review potential maritime services sharing",
        "date": "01252017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BRIEF-Arianne Phosphate Inc signs project agreement with Rio Tinto to review potential maritime services sharing "
    },
    {
        "content": "SYDNEY  Jan 25 Chinese-owned Yancoal's  $2.45 billion purchase of the Coal & Allied division of Rio Tinto is setting the stage for more big-ticket coal mining acquisitions in Australia  where more than $10 billion in assets are waiting to be sold.",
        "date": "01252017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto sale to Yancoal resets mood for Australian coal mine deals "
    },
    {
        "content": "Jan 25 Britain's FTSE 100 index is seen opening 13 to 19 points higher  or up as much as 0.3 percent on Wednesday  according to financial bookmakers  with futures up 0.5 percent ahead of the cash market open.",
        "date": "01252017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-UK Stocks-Factors to watch on Jan 25 "
    },
    {
        "content": "Jan 25 Britain's FTSE 100 index is seen opening 13 to 19 points higher  or up as much as 0.3 percent on Wednesday  according to financial bookmakers.           * The UK blue chip index   which touched a three-week low the previous day  had a volatile session after the UK Supreme Court ruled that Prime Minister Theresa May must gain parliament's approval before she begins Britain's formal exit from the European Union. The top share index ended little changed on Tuesday.      * BHP BIL",
        "date": "01252017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UK Stocks-Factors to watch on Jan 25 "
    },
    {
        "content": "SYDNEY Rio Tinto Plc   said it agreed to sell Australian unit Coal & Allied Industries Ltd to Chinese government-controlled Yancoal Australia Ltd  for up to $2.45 billion in cash.",
        "date": "01242017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto sells coal assets to China's Yancoal for up to $2.45 billion "
    },
    {
        "content": "* Coal price strength last year made deals difficult   (Adds Yancoal statement  closing share price)",
        "date": "01242017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-Rio Tinto sells coal assets to China's Yancoal for up to $2.45 bln "
    },
    {
        "content": "SINGAPORE  Jan 24 Global miner Rio Tinto  is looking to hire eight Singapore-based experts to improve its supply and demand analysis in commodity markets.",
        "date": "01242017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Miner Rio Tinto hiring commodity market analysts in Singapore "
    },
    {
        "content": "SYDNEY Global miner Rio Tinto could be in a position to reward shareholders with a strong dividend hike or even a share buyback next year as it benefits from a sharp rise in metals prices  fund managers and analysts said on Tuesday.",
        "date": "01172017",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto payout hopes brighten on solid outlook for 2017 "
    },
    {
        "content": "* Capital return possible in 2017 - fund manager   (Recasts to focus on shareholder returns)",
        "date": "01172017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio Tinto payout hopes brighten on solid outlook for 2017 "
    },
    {
        "content": "SYDNEY  Jan 24 Rio Tinto Plc   said it agreed to sell Australian unit Coal & Allied Industries Ltd to Chinese government-controlled Yancoal Australia Ltd  for up to $2.45 billion in cash.",
        "date": "01242017",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto sells coal assets to China's Yancoal for up to $2.45 bln "
    },
    {
        "content": "LONDON Rio Tinto said on Monday it would defend itself robustly if rival miner BSG Resources (BSGR) pursues a threat to file a law suit over mining rights in Guinea.",
        "date": "12122016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto to defend itself if BSGR pursues action over Guinea "
    },
    {
        "content": "LONDON Multinational companies need to do more to gain the trust of wider society  including better explaining why top executives are so highly rewarded in comparison to workers  the chairman of global miner Rio Tinto  told British lawmakers.",
        "date": "12062016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Companies need to work harder to gain societies' trust-Rio chairman "
    },
    {
        "content": "SYDNEY Global miner Rio Tinto said on Thursday it was cooperating with the U.S. Securities Exchange Commission over financial impairments in 2012 related to its coal operations in Mozambique.",
        "date": "12012016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto says target of SEC probe over Mozambique coal "
    },
    {
        "content": "SYDNEY The U.S. Securities and Exchange Commission is investigating a $3 billion impairment charge booked by miner Rio Tinto  in 2013 on the value of a Mozambican coal asset  two sources familiar with the matter said on Tuesday.",
        "date": "11292016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "U.S. authorities scrutinize Rio's 2013 coal writedown: sources "
    },
    {
        "content": "SYDNEY  Nov 29 The U.S. Securities and Exchange Commission is investigating a $3 billion impairment charge booked by miner Rio Tinto in 2013 on the value of a Mozambican coal asset  two sources familiar with the matter said on Tuesday.",
        "date": "11292016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "U.S. authorities scrutinise Rio's 2013 coal writedown - sources "
    },
    {
        "content": "SYDNEY Rio Tinto Chief Executive Jean-Sébastien Jacques said on Thursday that the fallout from its discovery of  payments in Guinea has been \"very challenging\"  in his first public appearance since the scandal erupted.",
        "date": "11242016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto says Simandou payments scandal 'very challenging' "
    },
    {
        "content": "MANILA Australian miner Rio Tinto is asking Chinese steel mills to pay a premium for its highest grade iron ore product for the first time since an annual pricing system collapsed in 2010  two sources familiar with the situation said.",
        "date": "11292016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio seeks iron ore premium from China mills in likely pricing war revival: sources "
    },
    {
        "content": "MANILA  Nov 29 Australian miner Rio Tinto   is asking Chinese steel mills to pay a premium for its highest grade iron ore product for the first time since an annual pricing system collapsed in 2010  two sources familiar with the situation said.",
        "date": "11292016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio seeks iron ore premium from China mills in likely pricing war revival - sources "
    },
    {
        "content": "* Skirts questions on Guinea Simandou investigation   (Adds executive comment on Trump  response on Simandou)",
        "date": "11252016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto sees potential demand boost  less red tape in Trump presidency "
    },
    {
        "content": "SYDNEY  Nov 24 Rio Tinto  Chief Executive Jean-Sébastien Jacques said on Thursday that the fallout from its discovery of  payments in Guinea has been \"very challenging\"  in his first public appearance since the scandal erupted.",
        "date": "11242016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio Tinto says Simandou payments scandal \"very challenging\" "
    },
    {
        "content": "MELBOURNE Rio Tinto   Chief Executive Jean-Sébastien Jacques said on Friday the election of Donald Trump in the United States could help boost commodities demand and cut red tape  which would benefit the mining industry.",
        "date": "11252016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto sees potential gains from Trump's election "
    },
    {
        "content": "SYDNEY Miner Rio Tinto is preparing to cut hundreds of jobs at its Australian iron ore business following a restructuring of the global giant's most profitable sector  the company confirmed on Monday.",
        "date": "11212016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto to cut iron ore jobs as it braces for tough market "
    },
    {
        "content": "LAUNCESTON  Australia Almost unnoticed  Rio Tinto Chief Executive Jean Sebastien Jacques has ushered the China iron ore elephant out of the room.",
        "date": "11282016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto disposes of iron ore elephant  signals flexibility: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Nov 28 Almost unnoticed  Rio Tinto Chief Executive Jean Sebastien Jacques has ushered the China iron ore elephant out of the room.",
        "date": "11282016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-COLUMN-Rio Tinto disposes of iron ore elephant  signals flexibility: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Nov 28 Almost unnoticed  Rio Tinto Chief Executive Jean Sebastien Jacques has ushered the China iron ore elephant out of the room.",
        "date": "11282016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Rio Tinto disposes of iron ore elephant  signals flexibility: Russell "
    },
    {
        "content": "MELBOURNE Facing international pressure to get tougher on corruption  Australian authorities say they are targeting the resources industry but have yet to be formally asked to look into a high-profile probe into payments at miner Rio Tinto  .",
        "date": "11182016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto in spotlight as Australia fraud police targets resources industry "
    },
    {
        "content": "SYDNEY Rio Tinto has axed two of its top 10 executives  sparking a feud with one of them  amid a probe over $10.5 million in payments to a consultant who helped it win rights to develop the world's largest untapped iron ore lode in Guinea. | Video ",
        "date": "11172016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto fires two top executives over Guinea payments "
    },
    {
        "content": "* Legal and regulatory head axed  despite upcoming retirement   (Adds Rio response on Davies statement  comment from Davies and background details)",
        "date": "11172016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 4-Rio Tinto fires two top executives over Guinea payments "
    },
    {
        "content": "Nov 15 Britain's FTSE 100 index is seen opening up 24 to 33 points  or 0.5 percent on Tuesday  according to financial bookmakers.           * The UK blue chip index closed up 0.34 percent at 6 753.18 points on Monday following a rally in banking and mining stocks  although a slump in utilities kept a lid on broader market gains.      * REYNOLDS AMERICA/BATS: U.S. cigarette maker Reynolds American Inc  is seeking a higher price from British American Tobacco Plc after rejecting its $47",
        "date": "11152016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UK Stocks-Factors to watch on Nov. 15 "
    },
    {
        "content": "Nov 17 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11172016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "PRESS DIGEST- British Business - Nov 17 "
    },
    {
        "content": "LAUNCESTON  Australia  Nov 16 There are two ways of looking at Rio Tinto's decision to close one of its major iron ore mines over the Christmas period: to take the company's explanation of operational reasons at face value or to see the move as part of a wider strategy.",
        "date": "11162016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-COLUMN-Rio gives Christmas gift to itself and the iron ore market: Russell "
    },
    {
        "content": "SYDNEY BHP Billiton will run its iron ore mines full speed through the year-end amid a surge in global prices for the commodity rather than suspending some Australia operations like rival Rio Tinto  the company said on Wednesday.",
        "date": "11162016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BHP to keep iron ore mines running despite Rio's Christmas suspension "
    },
    {
        "content": "LAUNCESTON  Australia  Nov 16 There are two ways of looking at Rio Tinto's decision to close one of its major iron ore mines over the Christmas period: to take the company's explanation of operational reasons at face value or to see the move as part of a wider strategy.",
        "date": "11162016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Rio gives Christmas gift to itself and the iron ore market: Russell "
    },
    {
        "content": "LONDON  Nov 14 Rio Tinto called a board meeting on Monday to discuss payments of $10.5 million made to a consultant on its project to develop the world's largest untapped iron ore reserves in Guinea  industry sources said.",
        "date": "11142016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto debates Guinea payments at London board meeting "
    },
    {
        "content": "KOBE  Japan Rio Tinto is \"cautiously optimistic\" about the current copper market that has spiked in recent weeks  a senior executive at the world's second-largest miner said on Monday.",
        "date": "11142016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto 'cautiously optimistic' about copper market in short term "
    },
    {
        "content": "MELBOURNE/CONAKRY Rio Tinto  the world's second-largest miner  has suspended one senior executive  accepted the resignation of a second and alerted U.S. and UK authorities after discovering $10.5 million in unexplained payments to a consultant in Guinea.",
        "date": "11092016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto suspends senior executive after Guinea investigation "
    },
    {
        "content": "* Rio Tinto announced sale of Simandou stake late Oct   (Adds reference in para 8 to Financial Times report on identity of consultant)",
        "date": "11092016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 4-Rio Tinto suspends senior executive after Guinea investigation "
    },
    {
        "content": "LAUNCESTON  Australia  Nov 4 Rio Tinto's decision to quit the world's largest undeveloped iron ore deposit in Guinea is essentially a bet on how quickly and cheaply the new Chinese owners can develop the mine.",
        "date": "11042016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-COLUMN-Rio Tinto bets Simandou's iron ore will take time to come: Russell "
    },
    {
        "content": "LAUNCESTON  Australia Rio Tinto's decision to quit the world's largest undeveloped iron ore deposit in Guinea is essentially a bet on how quickly and cheaply the new Chinese owners can develop the mine.",
        "date": "11042016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto bets Simandou's iron ore will take time to come: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Nov 4 Rio Tinto's decision to quit the world's largest undeveloped iron ore deposit in Guinea is essentially a bet on how quickly and cheaply the new Chinese owners can develop the mine.",
        "date": "11042016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Rio Tinto bets Simandou's iron ore will take time to come: Russell "
    },
    {
        "content": "LONDON/BENGALURU Rio Tinto  has signed a preliminary deal to sell its stake in Guinea's Simandou project to Chinalco   it said on Friday  injecting impetus into the long-stalled scheme to develop the world's largest untapped iron ore reserves.",
        "date": "10282016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto set to quit Guinea iron ore project with sale to Chinalco "
    },
    {
        "content": "* Rio says aiming for final deal in less than six months   (Adds detail on spending  statement from Guinea)",
        "date": "10282016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-Rio Tinto set to quit Guinea iron ore project with sale to Chinalco "
    },
    {
        "content": "LONDON/BENGALURU  Oct 28 Mining company Rio Tinto  has agreed to sell its stake in Guinea's Simandou project to Chinalco  it said on Friday  potentially kickstarting the long-stalled scheme to develop the world's largest untapped iron ore reserves.",
        "date": "10282016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-UPDATE 2-Rio Tinto set to quit Guinea iron ore project with sale to Chinalco "
    },
    {
        "content": "SYDNEY Global miner Rio Tinto on Thursday cut its 2016 guidance for iron ore shipments by as much as 5 million tonnes after releasing lower third-quarter production data  citing shipping interruptions.",
        "date": "10202016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio cuts 2016 iron ore guidance; Fortescue shipments up "
    },
    {
        "content": "SYDNEY  Oct 20 Global miner Rio Tinto  on Thursday cut its 2016 guidance for iron ore shipments by as much as 5 million tonnes after releasing lower third-quarter production data  citing shipping interruptions.",
        "date": "10202016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio cuts 2016 iron ore guidance; Fortescue shipments up "
    },
    {
        "content": "SYDNEY  Oct 20 Global miner Rio Tinto  has lowered its 2016 guidance for iron ore shipments to between 325 million and 330 million tonnes after releasing lower third quarter shipping data.",
        "date": "10192016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto 3rd qtr iron ore shipments fall 5 pct  guidance changed "
    },
    {
        "content": "DAKAR  Oct 10 Mining giant Rio Tinto  said on Monday that the International Finance Corporation  a partner in its $20 billion Simandou iron ore project in Guinea  is selling its stake.",
        "date": "10102016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto says Guinea iron ore partner IFC to sell stake "
    },
    {
        "content": "DAKAR  Oct 10 Mining giant Rio Tinto  said on Monday that the International Finance Corporation (IFC)  a partner in its $20 billion Simandou iron ore project in Guinea  is selling its 4.6 percent stake.",
        "date": "10102016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto says Guinea iron ore partner IFC to sell stake "
    },
    {
        "content": "SYDNEY  Oct 4 Mining giants Rio Tinto   and BHP Billiton  on Tuesday rebuffed proposals to replace one of the taxes they must pay on their iron ore businesses in the state of Western Australia with annual upfront payments.",
        "date": "10042016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "REFILE-BHP  Rio rebuff proposed iron ore tax change in Australian state "
    },
    {
        "content": "LONDON Rio Tinto on Monday announced a bond buyback plan for up to $3 billion  saying it was using spare cash to further cut its debt.",
        "date": "09262016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto aims to cut debt with bond buyback "
    },
    {
        "content": "LONDON  Sept 7 The backgrounds of the leaders of the world's top mining companies illustrate the choice facing investors  with BHP Billiton's chief executive having worked in the oil industry and Rio Tinto's new boss more focused on copper.",
        "date": "09072016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio versus BHP boils down to investors' choice of commodity "
    },
    {
        "content": "* Mines agency says will talk to parties interested in Bunder",
        "date": "08302016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "India may auction diamond mine abandoned by Rio Tinto "
    },
    {
        "content": "* Mines agency says will talk to parties interested in Bunder   (Adds details about spending  environmental issues)",
        "date": "08302016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-India may auction diamond mine abandoned by Rio Tinto "
    },
    {
        "content": "ULAANBAATAR Mongolia's prime minister has asked Anglo-Australian miner Rio Tinto to step up the pace of construction at the giant Oyu Tolgoi copper-gold mine  part of efforts to revive the country's debt-ridden economy.",
        "date": "08302016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Mongolia asks Rio Tinto to speed up work on giant copper mine "
    },
    {
        "content": "LAUNCESTON  Australia Here we go again! Another political attempt rooted more in populism than economics to grab more tax revenue from Australia's top iron ore miners  Rio Tinto and BHP Billiton.",
        "date": "08112016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "New iron ore tax on Rio  BHP unlikely  but issue is back: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Aug 11 Here we go again! Another political attempt rooted more in populism than economics to grab more tax revenue from Australia's top iron ore miners  Rio Tinto and BHP Billiton.",
        "date": "08112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-COLUMN-New iron ore tax on Rio  BHP unlikely  but issue is back: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Aug 11 Here we go again! Another political attempt rooted more in populism than economics to grab more tax revenue from Australia's top iron ore miners  Rio Tinto and BHP Billiton.",
        "date": "08112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-New iron ore tax on Rio  BHP unlikely  but issue is back: Russell "
    },
    {
        "content": "* Rio confirms plans to expand copper output   (Recasts  adds closing prices  details)",
        "date": "08032016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "METALS-Copper hits two-week low on stimulus doubts  dollar rebound "
    },
    {
        "content": "MELBOURNE/LONDON Global miner Rio Tinto reported a 47 percent slump in first-half profit to its weakest in 12 years on Wednesday  still beating forecasts and a strong balance sheet allowed it to pay a higher dividend than expected. | Video ",
        "date": "08032016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto earnings slump to 12-year low  warns conditions still tough "
    },
    {
        "content": "MELBOURNE/LONDON Aug 3 Global miner Rio Tinto reported a 47 percent slump in first-half profit to its weakest in 12 years on Wednesday  still beating forecasts and a strong balance sheet allowed it to pay a higher dividend than expected.",
        "date": "08032016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-Rio Tinto earnings slump to 12-year low  warns conditions still tough "
    },
    {
        "content": "Aug 2 Rio Tinto Plc/Ltd  said on Tuesday it would invest $338 million to complete the development of its Silvergrass iron ore mine in Western Australia.",
        "date": "08022016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto to invest $338 mln in Silvergrass iron ore mine "
    },
    {
        "content": "Aug 2 Rio Tinto Plc/Ltd  said on Tuesday it would invest $338 million to complete the development of its Silvergrass iron ore mine in Western Australia.",
        "date": "08022016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto to invest $338 mln in Silvergrass iron ore mine "
    },
    {
        "content": "LONDON  July 19 Britain's top share index fell on Tuesday  easing back from an 11-month closing high  with miners dropping after a production update from Rio Tinto.",
        "date": "07192016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Britain's FTSE pulls back from 11-month closing high "
    },
    {
        "content": "SYDNEY Rio Tinto said on Tuesday it was on track to meet its full-year iron ore shipment guidance from its Australian mines of roughly 330 million tonnes  underscoring the strength of sales to China  despite concerns of oversupply.",
        "date": "07182016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto keeps iron ore mines running at full steam "
    },
    {
        "content": "* Signs oversupply in China easing   (Adds more data  forecasts)",
        "date": "07182016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto keeps iron ore mines running at full steam "
    },
    {
        "content": "NEW YORK  July 14 Impala Asset Management is forming a new hedge fund to bet on rising commodities prices  according to a letter sent to clients and seen by Reuters on Thursday.",
        "date": "07142016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Impala prepares hedge fund to bet on commodity rebound "
    },
    {
        "content": "SYDNEY Rio Tinto   will keep a newly formed division that includes troublesome coal and uranium assets  its newly appointed chief executive told Reuters  brushing off expectations it would consider a spin off and eventual sale.",
        "date": "07032016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto's new boss sees no BHP-style spin off for unloved assets "
    },
    {
        "content": "CONAKRY Rio Tinto has shelved its $20 billion Simandou iron ore project in Guinea because of a sustained slump in prices  the company's new Chief Executive Jean-Sebastien Jacques said in an interview with The Times newspaper.",
        "date": "07042016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto chief shelves giant Guinea iron ore project: newspaper "
    },
    {
        "content": "CONAKRY July 4 Rio Tinto has shelved its $20 billion Simandou iron ore project in Guinea because of a sustained slump in prices  the company's new Chief Executive Jean-Sebastien Jacques said in an interview with The Times newspaper.",
        "date": "07042016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto chief  shelves giant Guinea iron ore project -newspaper "
    },
    {
        "content": "July 4 Rio Tinto has shelved its $20 billion Simandou iron ore project in Guinea because of a sustained slump in prices  the company's new Chief Executive Jean-Sebastien Jacques said in an interview with The Times newspaper.",
        "date": "07042016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto chief tells Times shelves giant Guinea iron ore project "
    },
    {
        "content": "LAUNCESTON  Australia - The beautiful thing about cleaning out the executive ranks is that it gives a company an opportunity to press the reset button on strategies and positions.",
        "date": "06272016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto's cleared the decks  now time to change iron ore tack: Russell "
    },
    {
        "content": "* Says investing more in exploration while others cut   (Recasts  adds analyst comments  detail)",
        "date": "06272016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-BHP boosts exploration spend as focus narrows to oil  copper "
    },
    {
        "content": "LAUNCESTON  Australia  June 23 - The beautiful thing about cleaning out the executive ranks is that it gives a company an opportunity to press the reset button on strategies and positions.",
        "date": "06232016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-COLUMN-Rio Tinto's cleared the decks  now time to change iron ore tack: Russell "
    },
    {
        "content": "LAUNCESTON  Australia - The beautiful thing about cleaning out the executive ranks is that it gives a company an opportunity to press the reset button on strategies and positions.",
        "date": "06232016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto's cleared the decks  now time to change iron ore tack: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  June 23 - The beautiful thing about cleaning out the executive ranks is that it gives a company an opportunity to press the reset button on strategies and positions.",
        "date": "06232016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Rio Tinto's cleared the decks  now time to change iron ore tack: Russell "
    },
    {
        "content": "* Analysts say reshuffle was expected   (Updates throughout with comment  context)",
        "date": "06212016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 3-Rio Tinto drops iron ore chief as incoming CEO makes his mark "
    },
    {
        "content": "June 21 Global miner Rio Tinto Plc said it appointed Chris Salisbury as head of its iron ore business  replacing veteran Andrew Harding.",
        "date": "06212016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto replaces iron ore chief  shuffles executive team "
    },
    {
        "content": "SYDNEY  June 9 BHP Billiton  is studying an option to develop a massive new iron ore deposit in Australia to replace lost tonnes as operations age and reserves decline  according to the company and documents filed with environmental regulators.",
        "date": "06092016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BHP sets sights on a new iron mine to replace ageing one "
    },
    {
        "content": "* Rio Tinto Plc says  offer for any and all securities  will expire on 13 June 2016   unless extended",
        "date": "06072016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BRIEF-Rio Tinto launches new cash tender offers for up to $3 bln "
    },
    {
        "content": "MELBOURNE  June 8 Jacobs Engineering has won the main contract to build the $5.3 billion Oyu Tolgoi underground copper and gold mine in Mongolia  the companies said on Wednesday.",
        "date": "06082016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Jacobs Engineering to build Rio Tinto's $5.3 bln Mongolian mine "
    },
    {
        "content": "* Got extension from Rio Tinto Exploration to complete certain work programs related to earn-in periods on Rio Tinto Murphy Farm-In  JV tenements",
        "date": "05242016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BRIEF-Laramide Resources plans to commence exploration program in Rio Tinto Murphy Farm-In "
    },
    {
        "content": "LAUNCESTON  Australia  May 23 China's imports of iron ore are likely to have maintained their recent strength in May  as top suppliers Australia and Brazil continue to squeeze market share from smaller rivals.",
        "date": "05232016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-COLUMN-China's May iron ore imports stay robust  majors squeeze rivals: Russell "
    },
    {
        "content": "LAUNCESTON  Australia China's imports of iron ore are likely to have maintained their recent strength in May  as top suppliers Australia and Brazil continue to squeeze market share from smaller rivals.",
        "date": "05232016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Column: China's May iron ore imports stay robust  majors squeeze rivals "
    },
    {
        "content": "LAUNCESTON  Australia  May 23 China's imports of iron ore are likely to have maintained their recent strength in May  as top suppliers Australia and Brazil continue to squeeze market share from smaller rivals.",
        "date": "05232016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-China's May iron ore imports stay robust  majors squeeze rivals: Russell "
    },
    {
        "content": "CONAKRY Anglo-Australian mining giant Rio Tinto  has submitted feasibility studies to the Guinean government for its massive Simandou project  considered the world's biggest untapped iron ore deposit.",
        "date": "05172016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto submits feasibility study for Guinea's giant iron ore deposit "
    },
    {
        "content": "LONDON The outcome of Mongolia's election next month will have no impact on Rio Tinto's $5.3 billion Oyu Tolgoi copper mine extension plan  the head of country's state-owned joint partner in the deal said on Wednesday.",
        "date": "05112016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Mongolia election won't impact Rio Tinto's $5.3 billion deal: mining CEO "
    },
    {
        "content": "BRUSSELS/MELBOURNE BHP Billiton has talked up its future growth options  joining fellow mining giant Rio Tinto in marking a shift in focus after four years of aggressive cost cutting.",
        "date": "05112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BHP Billiton joins Rio in shifting focus to growth "
    },
    {
        "content": "* Capital expenditure on horizon after next year - BHP   (Adds BHP  investor comments)",
        "date": "05112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-BHP Billiton joins Rio in shifting focus to growth "
    },
    {
        "content": "* Oyu Tolgoi extension could help energize investor confidence",
        "date": "05092016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio's $5.3 bln go-ahead fuels hopes of end to Mongolia's hangover "
    },
    {
        "content": "SYDNEY/ULANBAATAR Global miner Rio Tinto has given the green light to a $5.3 billion expansion of the Oyu Tolgoi mine in Mongolia  a key plank in its push to become a global copper powerhouse. | Video ",
        "date": "05062016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto bets on copper with $5.3 billion Oyu Tolgoi expansion "
    },
    {
        "content": "* Oyu Tolgoi extension could help energize investor confidence",
        "date": "05092016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio's $5.3 bln go-ahead fuels hopes of end to Mongolia's hangover "
    },
    {
        "content": "LAUNCESTON  Australia If you are looking for signs that the China-led surge in iron ore and steel prices is likely to fizzle  the fact that the share prices of producers are lagging miles behind is a strong indicator that the commodity rally may be shaky.",
        "date": "05062016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio  BHP investors may be too cautious on iron ore rally "
    },
    {
        "content": "May 6 Britain's FTSE 100 index is seen opening down 12 points  or 0.19 percent  on Friday  according to financial bookmakers  with futures down about 0.2 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "05062016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-UK Stocks-Factors to watch on May 6 "
    },
    {
        "content": "MELBOURNE  May 4 Rio Tinto's Energy Resources of Australia said on Wednesday it plans to sell uranium from a stockpile over the next four years to fund the closure of its Ranger mine  while it tries to keep options open to develop a new mine.",
        "date": "05042016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto's ERA to sell stockpiled uranium to cover mine closure "
    },
    {
        "content": "LAUNCESTON  Australia If you are looking for signs that the China-led surge in iron ore and steel prices is likely to fizzle  the fact that the share prices of producers are lagging miles behind is a strong indicator that the commodity rally may be shaky.",
        "date": "05052016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio  BHP investors may be too cautious on iron ore rally "
    },
    {
        "content": "* Development of underground mine will start in mid-2016 following approval of a $5.3 billion investment by partners and recent granting of all necessary permits",
        "date": "05062016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BRIEF-Rio Tinto approves $5.3 bln Oyu Tolgoi copper expansion in Mongolia "
    },
    {
        "content": "SYDNEY/MELBOURNE Mining giant Rio Tinto is not counting on an upturn in commodities markets anytime soon despite recent gains in prices of iron ore  its main source of revenue  as much of the world's economies continue to underperform.    Chief Executive Sam Walsh said factors such as the looming U.S. election  a softer outlook in China and immigration woes facing Europe were suppressing a recovery in commodities. His view  however  is a departure from others calling for an end soon ",
        "date": "05052016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto CEO a non-believer in commodities rebound "
    },
    {
        "content": "SYDNEY Rio Tinto on Tuesday cut its 2017 production guidance from its Australian iron ore mines due to a delay in the rollout of its autonomous transport technology  based on driverless trains.",
        "date": "04192016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto cuts 2017 iron ore guidance as first-quarter shipments rise "
    },
    {
        "content": "* Rio sees 10-20 mln/t drop in 2017 Australia output guidance",
        "date": "04192016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio Tinto cuts 2017 iron ore guidance as Q1 shipments rise "
    },
    {
        "content": "MELBOURNE Rio Tinto has dropped a plan to stretch out the amount of time its suppliers must wait for payment  after widespread pushback from mining services firms and a request from the country's resources minister.",
        "date": "04142016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto drops plan to push out supplier payments "
    },
    {
        "content": "SYDNEY  April 13 Australia's Fortescue Metals Group shipped a flat 42 million tonnes of iron ore in the March quarter  putting it on track to exceed its annual production target  while lowering cash costs by 6 percent from the previous quarter.",
        "date": "04132016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Australia's Fortescue says could exceed iron ore output target "
    },
    {
        "content": "SYDNEY  April 9 Rio Tinto  one of the world's biggest miners  has doubled its payment terms in a move that will force embattled suppliers to wait up to 90 days to be paid.",
        "date": "04092016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Australia's Rio Tinto to take longer to pay as resource slump bites "
    },
    {
        "content": "SYDNEY  April 9 Rio Tinto  one of the world's biggest miners  has doubled its payment terms in a move that will force embattled suppliers to wait up to 90 days to be paid.",
        "date": "04102016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-Australia's Rio Tinto to take longer to pay as resource slump bites "
    },
    {
        "content": "WINNIPEG/SANTIAGO  April 6 Dealers of used mining equipment  from the United States to Chile and Australia  are making a risky bet that an end to the industry's four-year slump may be in sight  stocking up on a glut of crushers and conveyors.",
        "date": "04062016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "In mining slump  used equipment dealers stockpile in rebound bet "
    },
    {
        "content": "WINNIPEG/SANTIAGO  April 6 Dealers of used mining equipment  from the United States to Chile and Australia  are making a risky bet that an end to the industry's four-year slump may be in sight  stocking up on a glut of crushers and conveyors.",
        "date": "04062016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-In mining slump  used equipment dealers stockpile in rebound bet "
    },
    {
        "content": "TOKYO  March 22 Some Japanese aluminium buyers have agreed to pay a premium of $115 per tonne for primary metal for shipment in the April-June quarter  three sources directly involved in the quarterly pricing talks said.",
        "date": "03222016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Some Japanese aluminium buyers agree to Q2 premium of $115/T -sources "
    },
    {
        "content": "TOKYO  March 22 Some Japanese aluminium buyers have agreed to pay a premium of $115 per tonne for primary metal to be shipped in the April-June quarter  three sources directly involved in the quarterly pricing talks said.",
        "date": "03222016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Some Japanese aluminium buyers agree to pay Q2 premium of $115/T -sources "
    },
    {
        "content": "* Reports 56 pct slide in half-year net profit   (Adds comment from New Hope CEO  analyst)",
        "date": "03222016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Australia's New Hope sees Asia coal market bottoming out "
    },
    {
        "content": "* Signs ten-year integrated facilities management contract with Rio Tinto",
        "date": "03162016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BRIEF-Sodexo signs facilities management contract with Rio Tinto "
    },
    {
        "content": "SYDNEY Rio Tinto has named its copper and coal division head  Jean-Sébastien Jacques  as its chief executive  replacing veteran Sam Walsh and marking a shift for the Anglo-Australian mining major that has long focused on iron ore.",
        "date": "03172016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio  shifting focus  replaces veteran Walsh with copper boss "
    },
    {
        "content": "* Copper  coal head Jean-Sébastien Jacques to replace Walsh   (Recasts; adds comments  details)",
        "date": "03172016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio  shifting focus  replaces veteran Walsh with copper boss "
    },
    {
        "content": "SYDNEY  Feb 29 Australian shares were little changed on Monday  ending less than one point firmer  with major miners BHP Billiton and Rio Tinto showing only slight movement.",
        "date": "02292016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Australia stocks end flat as miners stagnate "
    },
    {
        "content": "LONDON  Feb 22 \"Short interest\" in miners Rio Tinto and Antofagasta have surged to multi-year highs  suggesting that some investors are not convinced about the sustainability of their recent share price rally  analysts said.",
        "date": "02222016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "'Short interest' in Rio and Antofagasta hit multi-year highs "
    },
    {
        "content": "REYKJAVIK  Feb 17 Workers at Rio Tinto's  unit in Iceland voted to block exports of aluminium from the Hafnarfjordur plant in the southwest of the North Atlantic island due to a long-running dispute over wage contracts.",
        "date": "02172016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Icelandic workers to block Rio Tinto aluminium exports over wage dispute "
    },
    {
        "content": "LAUNCESTON  Australia  Feb 15 - \"We don't run our business on hope  we run it with foresight and focus.\" These are Rio Tinto Chief Executive Sam Walsh's words  but he's only half right.",
        "date": "02152016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-COLUMN-Rio Tinto's iron ore hope at odds with foresight claim: Russell "
    },
    {
        "content": "LAUNCESTON  Australia - \"We don't run our business on hope  we run it with foresight and focus.\" These are Rio Tinto Chief Executive Sam Walsh's words  but he's only half right.",
        "date": "02152016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto's iron ore hope at odds with foresight claim: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Feb 15 - \"We don't run our business on hope  we run it with foresight and focus.\" These are Rio Tinto Chief Executive Sam Walsh's words  but he's only half right.",
        "date": "02152016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Rio Tinto's iron ore hope at odds with foresight claim: Russell "
    },
    {
        "content": "MELBOURNE  Feb 12 Australian shares are set to open lower on Friday amid worldwide investor jitters with the banks under pressure and resources stocks set to drop after world No. 2 miner Rio Tinto warned 2016 would be tougher than last year.     Pointing to a weaker opening  local share price index futures fell to 4 731.0 to sit at a 1.9 percent discount to the underlying S&P/ASX 200 index close.  The benchmark rose 0.95 percent on Thursday.     New Zealand's benchmark S&P/NZX 50 ind",
        "date": "02112016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Australia shares set to slide on global uncertainty "
    },
    {
        "content": "* Rio Tinto falls after dropping dividend commitment   (Updates prices)",
        "date": "02112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Slump in banks and resources pushes European shares to 2-1/2 year low "
    },
    {
        "content": "MELBOURNE/SYDNEY Rio Tinto   scrapped its generous payout policy in the face of a bleak outlook for the global economy after it slumped to a net loss for 2015 and posted its worst underlying earnings in 11 years. | Video ",
        "date": "02112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto ditches boom time payout policy as profit plunges "
    },
    {
        "content": "* Rio Tinto falls after dropping dividend commitment   (Updates prices  adds detail and quote)",
        "date": "02112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Bank and resources slump sees European shares slide to 2-1/2 year low "
    },
    {
        "content": "* Aims to cut $2 bln in costs over two years   (Adds more CEO  CFO comments  analysts  updates shares)",
        "date": "02112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-Rio Tinto ditches boom time payout policy as profit plunges "
    },
    {
        "content": "LONDON  Feb 11 A top European share index plunged to its lowest level in 2-1/2 years on Thursday  led down by a renewed slump in banks and miners  with Societe Generale  sliding after disappointing results.",
        "date": "02112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Bank and miner slump sees European shares slide to 2-1/2 year low "
    },
    {
        "content": "LONDON  Feb 11 European shares fell on Thursday  led down by a renewed drop in banks and miners  with Societe Generale and Rio Tinto both under pressure after disappointing with their latest results.",
        "date": "02112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "European shares knocked back by banks and miners "
    },
    {
        "content": "MELBOURNE  Feb 11 Global miner Rio Tinto   slumped to a net loss for 2015  hit by a rout in commodities  and scrapped its promise to pay a steady or higher dividend annually due to the tough outlook.",
        "date": "02112016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto slides to annual loss  abandons payout policy "
    },
    {
        "content": "ULAN BATOR  Feb 4 Canada's Centerra Gold Inc  has been given the go-ahead from Mongolia's lawmakers to mine the Gatsuurt Gold deposit after a five-year delay  as the resource-rich country looks to bolster its economic activity and gold reserves.",
        "date": "02042016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "CORRECTED-Canada's Centerra given go-ahead to mine Mongolian gold deposit "
    },
    {
        "content": "MELBOURNE Global miner Rio Tinto Plc   has agreed to sell one of its remaining coal mines in Australia to a group owned by Indonesia's third-richest man  Anthoni Salim  continuing an exit from coal as it battles a sharp slump in prices.",
        "date": "01272016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Indonesia's Salim buys huge Australian coal project from Rio Tinto "
    },
    {
        "content": "LAUNCESTON  Australia  Jan 27 - Iron ore heavyweights Australia and Brazil are gaining market share in top buyer China  but aren't quite destroying their smaller rivals as quickly as they need to.",
        "date": "01272016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-COLUMN-Australia  Brazil boost China iron ore import share  but not enough: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Jan 27 - Iron ore heavyweights Australia and Brazil are gaining market share in top buyer China  but aren't quite destroying their smaller rivals as quickly as they need to.",
        "date": "01272016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Australia  Brazil boost China iron ore import share  but not enough: Russell "
    },
    {
        "content": "MELBOURNE Global miner Rio Tinto plans to increase iron ore production and shipments in 2016  defying a collapse in prices as it takes advantage of its position as the world's lowest cost producer.",
        "date": "01192016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto to ship more iron ore in 2016 despite price rout "
    },
    {
        "content": "* Rio flags flat coal output in 2016   (Adds production forecasts)",
        "date": "01182016",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto to ship more iron ore in 2016 despite price rout "
    },
    {
        "content": "MELBOURNE  Jan 19 Global miner Rio Tinto   reported an 11 percent rise in annual iron ore shipments on Tuesday  roughly in line with its full-year guidance of 340 million tonnes  and said it expected to boost production and shipments in 2016.",
        "date": "01182016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto 4th quarter iron ore shipments jump 11 pct "
    },
    {
        "content": "MELBOURNE  Jan 18 In the decimated mining sector  Anglo-Australian Rio Tinto is set to be the last man standing for investors as sliding commodities prices force its peers to slash dividends  in a reversal of fortunes against arch rival BHP Billiton.",
        "date": "01182016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Oil rout favours Rio Tinto over BHP  at least for now "
    },
    {
        "content": "SYDNEY/WELLINGTON  Jan 18 Australian and New Zealand shares started the week on a sour note  tracking Wall Street's tumble as deepening oil woes reinforced global growth concerns.",
        "date": "01182016",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Australia stocks hit 2-1/2-yr lows  NZ shares fall hard on global headwinds "
    },
    {
        "content": "SYDNEY  Dec 15 Rio Tinto  locked in $4.4 billion in financing on Tuesday to fund a massive expansion of a copper mine in Mongolia and a final decision whether to proceed with construction will be made in the first half of 2016.",
        "date": "12152015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto seals $4.4 bln financing for Mongolia copper expansion "
    },
    {
        "content": "LONDON  Dec 15 Development bank EBRD said on Tuesday it had arranged its biggest ever syndicated loan  a $1.2 billion facility that will contribute towards an overall $4.4 billion package of financing for Mongolia's Oyu Tolgoi copper mine.",
        "date": "12152015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "EBRD says arranges $1.2 bln syndicated loan for Mongolian mine "
    },
    {
        "content": "TORONTO  Dec 2 Rio Tinto announced it has unearthed one of Canada's largest-ever  gem-quality rough diamonds at its Diavik diamond mine in the remote Northwest Territories  a 187.7-carat stone called the Diavik Foxfire.",
        "date": "12022015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto finds one of Canada's largest diamonds at Arctic mine "
    },
    {
        "content": "SYDNEY Rio Tinto is poised to approve its long-stalled $1 billion South of Embley bauxite expansion project as early as this week  the Australian Financial Review said on Thursday.",
        "date": "11252015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto set to approve $1 billion bauxite expansion: media "
    },
    {
        "content": "* One of three top projects for Rio  Mongolia copper next   (Adds Rio Tinto aluminium boss  analyst comments)",
        "date": "11272015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto to go ahead with $1.9 bln bauxite expansion "
    },
    {
        "content": "LONDON  Nov 27 European stocks were set to edge lower on Friday and fall away from three month highs hit in the previous session after data showed fresh signs of weakness in China.",
        "date": "11272015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "European Factors to Watch-Shares set to fall from 3-month highs "
    },
    {
        "content": "LONDON Nov 27 Britain's FTSE 100 index is seen opening 21 points lower  or down 0.3 percent on Friday  according to financial bookmakers. For more on the factors affecting European stocks  please click on            * The UK blue chip index closed 0.9 percent higher on Thursday at 6 391.13.            * Britain's shopping streets  out-of-town malls and websites will be awash with discounted goods on Friday as shoppers chase \"Black Friday\" deals in a spending frenzy expected to top la",
        "date": "11272015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UK Stocks-Factors to watch on Friday Nov 27 "
    },
    {
        "content": "MELBOURNE  Nov 27 Rio Tinto  gave the go-ahead on Friday to expand its bauxite output in northern Australia with a $1.9 billion project  approving a major mine at a time when most miners worldwide are slashing spending.",
        "date": "11272015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto to go ahead with $1.9 bln bauxite expansion "
    },
    {
        "content": "SYDNEY  Nov 5 Rio Tinto said on Thursday it expects to see strong growth in iron ore demand in countries outside of China as the global seaborne market expands.",
        "date": "11052015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto sees strong growth in iron ore demand outside China "
    },
    {
        "content": "SYDNEY  Oct 14 Rio Tinto Plc   will have to pay more than A$200 million ($144 million) in royalties and court fees after losing an Australian legal battle with iron ore magnate Gina Rinehart.",
        "date": "10142015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto to pay millions in royalties to mining magnate Rinehart "
    },
    {
        "content": "** Metals trader and miner Glencore up more than 3 pct & top gainer on slightly-negative FTSE 100 index",
        "date": "10122015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BUZZ-Glencore: plans to sell copper mines in Australia  Chile "
    },
    {
        "content": "LONDON  Oct 14 (IFR) - BHP Billiton has already lured US$12bn-equivalent of demand for a multi-tranche  multi-currency hybrid bond  demonstrating that investors are still willing to add risk in the battered metals and mining sector at the right price.",
        "date": "10142015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BHP Billiton goes all guns blazing with jumbo hybrid "
    },
    {
        "content": "** Basic resources easily the top performing sector across Europe  up 4.1%  as Morgan Stanley upgrades European miners to \"overweight\"",
        "date": "10072015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BUZZ-Miners: Morgan Stanley grows bullish on China exposure "
    },
    {
        "content": "LAUNCESTON  Australia - It must be tempting for Rio Tinto Chief Executive Sam Walsh to contemplate whether he should buy Glencore  almost a year after fending off an unwelcome approach from his now beleaguered rival.",
        "date": "09302015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Glencore's Glasenberg  once the hunter  now the hunted: Russell "
    },
    {
        "content": "SYDNEY  Sept 30 Australian iron ore miner Rio Tinto on Wednesday said it has agreed to sell a 40 percent stake in its thermal coal mine to New Hope Corporation Ltd for $606 million.",
        "date": "09292015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto to sell stake in Australian coal mine to New Hope "
    },
    {
        "content": "SYDNEY/MELBOURNE Global miner Rio Tinto  on Wednesday said it had agreed to sell its 40 percent stake in the Bengalla coal mine in Australia to New Hope Corp  for $606 million  the latest shuffle of Australian coal assets amid a sector-wide downturn.",
        "date": "09302015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto defies coal slump  fetching $606 million for mine stake "
    },
    {
        "content": "* Glencore still seen interested in remaining Rio coal stakes   (Adds banker  Mitsubishi comments)",
        "date": "09302015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio Tinto defies coal slump  fetching $606 mln for mine stake "
    },
    {
        "content": "LAUNCESTON  Australia - It must be tempting for Rio Tinto Chief Executive Sam Walsh to contemplate whether he should buy Glencore  almost a year after fending off an unwelcome approach from his now beleaguered rival.",
        "date": "09292015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Glencore's Glasenberg  once the hunter  now the hunted: Russell "
    },
    {
        "content": "VANCOUVER  Sept 22 Global aluminum demand will rise by 24 million tonnes to reach 78 million tonnes a year by 2025  a Rio Tinto executive said at an industry conference on Tuesday  but oversupply will continue to force further capacity closures.",
        "date": "09222015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Aluminum market to return to balance but more cuts needed -Rio Tinto "
    },
    {
        "content": "VANCOUVER  Sept 22 Global aluminum demand will rise by 24 million tonnes to 78 million tonnes annually by 2025  a Rio Tinto executive said at an industry conference on Tuesday  though market fundamentals will continue to force further capacity closures.",
        "date": "09222015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Aluminum demand to rise to 78 million tonnes by 2025 -Rio Tinto "
    },
    {
        "content": "OYU TOLGOI  Mongolia  Sept 17 Rio Tinto  said it is committed to expanding its Oyu Tolgoi copper mine in Mongolia based on a positive outlook for the metal and confidence that low production costs can buoy profits even as competitors cut output.",
        "date": "09172015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-As rivals blink  Rio Tinto plans to expand Mongolia copper mine "
    },
    {
        "content": "OYU TOLGOI  Mongolia  Sept 17 Rio Tinto  said it is committed to expanding its Oyu Tolgoi copper mine in Mongolia based on a positive outlook for the metal and confidence that low production costs can buoy profits even as competitors cut output.",
        "date": "09172015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "As rivals blink  Rio Tinto plans to expand Mongolia copper mine "
    },
    {
        "content": "SYDNEY There's been considerable debate over who is right on the outlook for China's vast steel sector - the bullish iron ore miners or the bearish analysts and steel producers.",
        "date": "09172015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "For Rio Tinto  it doesn't matter being right on iron ore: Russell "
    },
    {
        "content": "** Shares in UK miners such as Anglo  Rio  and Glencore up 1-2 pct  amongst the top FTSE 100 risers and ending a choppy week on a high",
        "date": "09112015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BUZZ-UK mining cos top FTSE-100 gainers list "
    },
    {
        "content": "SYDNEY  Sept 17 There's been considerable debate over who is right on the outlook for China's vast steel sector - the bullish iron ore miners or the bearish analysts and steel producers.",
        "date": "09172015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-For Rio Tinto  it doesn't matter being right on iron ore: Russell "
    },
    {
        "content": "* Glencore shares vs copper: http://link.reuters.com/tut55w   (Adds analysts on track record of trading business)",
        "date": "09072015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 4-Glencore reins in debt as commodity price slump persists "
    },
    {
        "content": "SYDNEY Rio Tinto signaled on Thursday it will continue to boost iron ore production but had yet to give construction approval for a new mine in Australia amid board promises to rein in spending.",
        "date": "09032015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto still aims to hit 360 million T iron ore output target "
    },
    {
        "content": "LAUNCESTON  Australia  It's tempting to mould events to suit your view of how the world should be  and there seems to be plenty of that in the coal debate.",
        "date": "09032015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Seaborne coal market may shrink  total demand won't: Russell "
    },
    {
        "content": "** Shares in London-listed mining cos among top FTSE 100 gainers in early trade following Rio Tinto's positive market outlook",
        "date": "09032015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BUZZ-Miner relief "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "09032015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Seaborne coal market may shrink  total demand won't: Russell "
    },
    {
        "content": "LONDON  Aug 14 Britain's FTSE 100 index is seen opening flat to 1 point lower on Friday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed down 2.86 points - flat in percentage terms - at 6 568.33 on Thursday  trimming the gains seen earlier in the session and underperforming broader European equities.          * Britain's opposition Labour Party on Friday begins voting for a new leader in a",
        "date": "08142015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UK Stocks-Factors to watch on August 14 "
    },
    {
        "content": "SYDNEY  Aug 14 China's Shenhua Group  is among six parties assessing bids for Rio Tinto's   $4 billion thermal coal business  the Australian Financial Review reported on Friday.",
        "date": "08132015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "China's Shenhua among potential bidders for Rio's coal business - report "
    },
    {
        "content": "LONDON  Aug 14 European stocks were seen opening steady on Friday  although a top share index was set for its biggest weekly loss in six weeks following moves by China to let its currency weaken.     After devaluing the yuan earlier in the week  China's central bank said on Thursday there was no reason for the currency to fall further given the country's strong economic fundamentals  helping to restore calm to jittery global markets.      Those reassurances helped the pan-European FT",
        "date": "08142015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "European Factors to Watch-Shares set for biggest weekly drop in 6 weeks "
    },
    {
        "content": "SYDNEY Global miner Rio Tinto on Thursday posted sharply lower first-half profits on sliding metal prices and pledged $1 billion in cost cuts this year. | Video ",
        "date": "08062015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto earnings sink on metals price plunge; deepens capex cuts "
    },
    {
        "content": "WELLINGTON  Aug 3 Meridian Energy said on Monday it had reached a power supply contract with Rio Tinto's New Zealand aluminium smelter that will keep the plant open at least for another three years.",
        "date": "08022015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "NZ's Meridian cuts power deal to keep Rio Tinto smelter open "
    },
    {
        "content": "* CEO says iron ore market heading for \"equilibrium\"   (Adds detail  comment from CEO and analysts)",
        "date": "08062015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio Tinto earnings sink on metals price plunge; deepens capex cuts "
    },
    {
        "content": "(Updates futures  company news)     LONDON  Aug 6 Britain's FTSE 100 index is seen opening down by 39-41 points  or 0.6 percent lower on Thursday  according to financial bookmakers. Futures were down 0.4 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on            * The UK blue chip index closed up 1 percent at 6 752.41 points on Wednesday  boosted by better than expected results from Legal & General  and London Stock Exchang",
        "date": "08062015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UK Stocks-Factors to watch on July 6 "
    },
    {
        "content": "SYDNEY  Aug 6 Rio Tinto Chief Executive Sam Walsh said on Thursday he sees 120 million tonnes of global iron ore capacity exiting the market this year.",
        "date": "08062015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto CEO says iron ore market at equilibrium "
    },
    {
        "content": "SYDNEY  Aug 6 Global miner Rio Tinto   on Thursday posted a 43 percent drop in first-half underlying earnings to $2.9 billion from the same period a year ago  hit by weak iron ore  coal and metals prices.",
        "date": "08062015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Weak metals prices drag Rio Tinto H1 underlying earnings down 43 pct "
    },
    {
        "content": "LAUNCESTON  Australia Rio Tinto's announcement of a reduction of 10 million tonnes in its forecast shipments of iron ore to 340 million tonnes in 2015 is largely inconsequential.",
        "date": "07162015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Can Rio Tinto's iron ore strategy work for shareholders?: Russell "
    },
    {
        "content": "WASHINGTON  July 21 Scores of Native American demonstrators protested at the U.S. Capitol on Tuesday against a proposed $6 billion copper mine in Arizona at a site that members of the Apache tribe say is sacred.",
        "date": "07212015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "At U.S. Capitol  Arizona Apaches protest planned copper mine "
    },
    {
        "content": "SYDNEY As Rio Tinto and BHP Billiton ship more iron ore than ever to China  the Australia mining giants face a fightback from Brazil's Vale for market share that threatens to drive already weak prices even lower.",
        "date": "07162015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Vale's designs on China add to Rio  BHP drive for more iron ore "
    },
    {
        "content": "SYDNEY Rio Tinto on Thursday posted a sharp rise in second quarter iron ore output from a year ago as it battled to maintain its top market position in China  even as selling prices deteriorate and bad weather disrupted operations.",
        "date": "07152015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto shows second quarter iron ore boost but cuts shipping guidance "
    },
    {
        "content": "SYDNEY  July 16 Rio Tinto  on Thursday posted a sharp rise in second quarter iron ore output from a year ago as it battled to maintain its top market position in China  even as selling prices deteriorate and bad weather disrupted operations.",
        "date": "07152015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto shows 2nd qtr iron ore boost but cuts shipping guidance "
    },
    {
        "content": "LONDON  July 10 Hit hard by the accelerated downturn in metal prices in recent months  global mining companies preparing to report results are likely to announce another round of austerity measures to cut costs and convince investors to remain committed to the sector.",
        "date": "07132015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-Miners' focus shifts from investor returns to survival "
    },
    {
        "content": "LONDON  July 10 Hit hard by the accelerated downturn in metal prices in recent months  global mining companies preparing to report results are likely to announce another round of austerity measures to cut costs and convince investors to remain committed to the sector.",
        "date": "07102015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Miners' focus shifts from investor returns to survival "
    },
    {
        "content": "July 15 A project financing agreement for the underground expansion of Oyu Tolgoi  a massive copper and gold mine in Mongolia  is expected to be signed by year end  mine owner Rio Tinto's Turquoise Hill Resources unit said on Wednesday.",
        "date": "07152015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Oyu Tolgoi project financing seen signed by year-end -Turquoise Hill "
    },
    {
        "content": "SYDNEY  July 16 As Rio Tinto and BHP Billiton ship more iron ore than ever to China  the Australia mining giants face a fightback from Brazil's Vale  for market share that threatens to drive already weak prices even lower.",
        "date": "07152015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Vale's designs on China add to Rio  BHP drive for more iron ore "
    },
    {
        "content": "July 15 A project financing agreement for the underground expansion of Oyu Tolgoi  a massive copper and gold mine in Mongolia  is expected to be signed by year end  mine owner Rio Tinto's Turquoise Hill Resources unit said on Wednesday.",
        "date": "07152015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Oyu Tolgoi project financing seen signed by year-end -Turquoise Hill "
    },
    {
        "content": "SYDNEY  July 8 Rio Tinto  said on Wednesday it was looking to lift its market share in North America and the Asia-Pacific region after revamping its Kitimat aluminium smelter in western Canada to produce nearly 50 percent more metal.",
        "date": "07082015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio targets N.America  Asia-Pacific after aluminium smelter revamp "
    },
    {
        "content": "LONDON  July 15 Financial spreadbetters expected Britain's FTSE 100 to open up 6 to 20 points or as much as 0.3 percent higher  Germany's DAX to open 36 to 49 points or as much as 0.4 percent up  and France's CAC 40 to open 10 to 27 points or as much as 0.5 percent higher.          MAJOR EUROPEAN COMPANIES REPORTING:     SVT.L   Severn Trent PLC            Severn Trent PLC Interim Management                                      Statement Release  BON.OL  Bonheur ASA                 Q",
        "date": "07152015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "European Factors to Watch on June 15 "
    },
    {
        "content": "LONDON Its nuclear deal with world powers bodes well for Iran's crude oil sales but offers less for Tehran's second biggest export  iron ore  as low prices squeeze private miners out of business.",
        "date": "07152015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Little joy for Iran's private iron ore exporters from nuclear deal "
    },
    {
        "content": "LAUNCESTON  Australia  Australia's major iron ore miners have had a torrid year so far  battling low prices  engaging in an ugly slanging match with each other and dealing with persistent questions about the wisdom of their expansion strategies.",
        "date": "07082015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Miners paint rosy iron ore picture by skirting tough issues "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "07082015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Miners paint rosy iron ore picture by skirting tough issues: Russell "
    },
    {
        "content": "LONDON  July 3 Investors in industrial metals will keep a close watch on miners' results in coming weeks for possible announcements of production cutbacks that could bolster weak prices.",
        "date": "07032015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Metals investors look for miners to cut supplies to lift prices "
    },
    {
        "content": "LONDON  July 2 The head of global mining firm Rio Tinto  urged governments not to be tempted by protectionism as they try to preserve revenues at a time of weakening commodity prices.",
        "date": "07022015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto CEO urges governments to avoid protectionism "
    },
    {
        "content": "LONDON The head of global mining firm Rio Tinto urged governments on Wednesday not to be tempted to introduce protectionist measures as they aim to preserve revenue at a time of weakening commodity prices.",
        "date": "07012015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto CEO urges governments against protectionism "
    },
    {
        "content": "TOKYO  July 3 Japan's aluminium premiums for July-September shipments were mostly set at a six-year low of $100 per tonne  plunging 74 percent from the previous quarter due to a supply glut  five sources directly involved in the talks said.",
        "date": "07032015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Japan Q3 aluminium premiums mostly set at six-year low of $100/T -sources "
    },
    {
        "content": "* Investors hoping Greece will stay in Euro - analyst   (Adds analysis  quotes  stocks on the move)",
        "date": "07012015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Australia shares up  hopes pinned on 11th-hour Greece deal "
    },
    {
        "content": "WELLINGTON  July 1 Meridian Energy said on Wednesday that it would extend until August the deadline for when Rio Tinto's New Zealand aluminium smelter must decide whether to extend its power supply contract with the utility company.",
        "date": "06302015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "NZ's Meridian extends deadline for Rio Tinto smelter contract "
    },
    {
        "content": "June 30 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06302015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Sources doubt X2 ability to close first deal   (Adds comments from second source  X2)",
        "date": "06302015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Outbid in copper  Mick Davis turns to coal to try for X2's first deal "
    },
    {
        "content": "SYDNEY  June 30 Australian shares are set to open lower on Tuesday  tracking a global stock selloff as fears intensify that Greece will default on its debt.     Rio Tinto shares may get a boost on a Financial Times report that X2 Resources has entered \"serious talks\" to purchase some of Rio Tinto's Australian coal assets.       Local share price index futures fell 35 points or 0.6 percent to 5 345.0  a 77.5-point discount to the underlying S&P/ASX 200 index close. The benchmark fell ",
        "date": "06292015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Australia shares seen lower on Greece; Rio may rise on report of X2 talks "
    },
    {
        "content": "LONDON  June 30 X2 Resources  the private equity fund set up by former Xstrata boss Mick Davis  is now in initial bi-lateral talks to buy some of Rio Tinto's Australian coal assets  a source close to the situation said on Tuesday.",
        "date": "06302015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Outbid in copper  Mick Davis turns to coal to try for X2's first deal "
    },
    {
        "content": "WELLINGTON  June 30 Rio Tinto's aluminium smelter in New Zealand  which has suffered losses in two of the last three years  faces a July 1 deadline to decide whether to extend its power supply contract with utility Meridian Energy .",
        "date": "06302015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto aluminium smelter in New Zealand faces possible power crunch "
    },
    {
        "content": "June 29 Former Xstrata boss Mick Davis' X2 Resources is in \"serious\" talks to purchase some of Rio Tinto Plc's Australian coal assets  the Financial Times reported citing people familiar with the matter.",
        "date": "06302015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-UPDATE 1-X2 in 'serious' talks for Rio Tinto's coal assets in Australia -FT "
    },
    {
        "content": "Former Xstrata boss Mick Davis' X2 Resources is in \"serious\" talks to purchase some of Rio Tinto Plc's  Australian coal assets  the Financial Times reported citing people familiar with the matter.",
        "date": "06292015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "X2 in 'serious' talks for Rio Tinto's coal assets in Australia: FT "
    },
    {
        "content": "SYDNEY  June 22 Half of the board at uranium miner Energy Resources of Australia resigned on Monday  saying majority owner Rio Tinto's  decision to abandon work on a major mine expansion made it difficult for the company to pursue its goals.",
        "date": "06222015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Half of Australian uranium miner's board quits after Rio shelves project "
    },
    {
        "content": "Rio Tinto may have to book a $300 million provision after its subsidiary Energy Resources of Australia (ERA) decided to shelve a uranium project due to weak market conditions.",
        "date": "06122015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto faces $300 million charge for aborted uranium project "
    },
    {
        "content": "June 12 Rio Tinto  may have to book a $300 million provision after its subsidiary Energy Resources of Australia (ERA) decided to shelve a uranium project due to weak market conditions.",
        "date": "06122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto faces $300 mln charge for aborted uranium project "
    },
    {
        "content": "LONDON  June 9 Britain's top shares fell on Tuesday as a new turnaround plan from Europe's biggest bank HSBC  failed to impress markets.",
        "date": "06092015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UK stocks fall as HSBC overhaul fails to impress "
    },
    {
        "content": "LONDON  June 9 Britain's top equity index edged lower on Tuesday  weighed down by weaker mining stocks and a dip in bank HSBC.",
        "date": "06092015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Britain's FTSE falters as miners and HSBC dip lower "
    },
    {
        "content": "May 23 Australia and Canada have qualified for the women's rugby sevens tournament at the 2016 Rio Olympics after making the quarter-finals at the Amsterdam tournament in the world sevens series.",
        "date": "05232015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rugby-Canada  Australia grab Olympic sevens spots "
    },
    {
        "content": "* 94 shares up  90 shares down  17 unchanged   (Adds analysis  quotes  stocks on the move)",
        "date": "05202015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Australia shares hit 3-1/2 months lows as banks  miners slide "
    },
    {
        "content": "LONDON Global miner Rio Tinto   plans to sell some of its aluminum assets in a potential $1 billion deal  the Financial Times reported  reviving a sale plan for its Pacific Aluminium unit two years after it was canceled.",
        "date": "05172015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto to sell aluminum assets in $1 billion deal: paper "
    },
    {
        "content": "MONTREAL  May 19 A worker at Rio Tinto's   Fer et Titane unit died after being injured at its facility at Sorel-Tracy in the Canadian province of Quebec  the global mining company said on Tuesday.",
        "date": "05192015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto unit says injured Quebec worker dies  output halts "
    },
    {
        "content": "LONDON  May 17 Global miner Rio Tinto   plans to sell some of its aluminium assets in a potential $1 billion deal  the Financial Times reported  reviving a sale plan for its Pacific Aluminium unit two years after it was cancelled.",
        "date": "05172015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto to sell aluminium assets in $1 bln deal -paper "
    },
    {
        "content": "LONDON  May 17 Global miner Rio Tinto   plans to sell some of its aluminium assets in a potential $1 billion deal  the Financial Times reported  reviving a sale plan for its Pacific Aluminium unit two years after it was cancelled.",
        "date": "05172015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto to sell aluminium assets in $1 bln deal -paper "
    },
    {
        "content": "ULAN BATOR/MELBOURNE Mongolia and Rio Tinto have reached an agreement paving the way for work to resume on a stalled $5 billion underground copper mine that is expected to drive growth for both the country and the global miner.",
        "date": "05192015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto  Mongolia end stand-off to build huge copper mine "
    },
    {
        "content": "* Bellwether project seen reviving investment in Mongolia mining",
        "date": "05192015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 4-Rio Tinto  Mongolia end stand-off to build huge copper mine "
    },
    {
        "content": "SINGAPORE  May 19 (IFR) - Mongolian bonds were the day's outperformers  after Mongolia  Rio Tinto and Turquoise Hill Resources signed an agreement for the next stage of development of the Oyu Tolgoi copper and gold mining project.",
        "date": "05192015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "ASIA CREDIT CLOSE:Mongolia steps up as IG investors manage rates "
    },
    {
        "content": "MELBOURNE  May 19 Mongolia sparked hopes on Tuesday that financing will start to flow for a string of stalled mining projects after it ended a long-running dispute with Rio Tinto  over the huge Oyu Tolgoi copper mine.",
        "date": "05192015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Mongolia pact with Rio Tinto raises hopes for investment revival "
    },
    {
        "content": "SYDNEY/MELBOURNE  May 15 Australian Prime Minister Tony Abbott on Friday threw his support behind a proposed Senate inquiry into the economic impact of a slump in the price of iron ore  ratcheting up pressure on top producers Rio Tinto and BHP Billiton.",
        "date": "05152015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "REFILE-UPDATE 2-Australian PM backs Senate probe into iron ore slump "
    },
    {
        "content": "SYDNEY  May 19 An agreement to develop the OYU Tolgoi copper mine in Mongolia has been reached  Rio Tinto   said on Tuesday  ending a two-year hiatus that saw the underground project delayed amid disputes over costs and taxes after the open pit mine was built.",
        "date": "05182015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-OYU Tolgoi copper mine agreement reached  Rio Tinto says "
    },
    {
        "content": "SINGAPORE  May 19 (IFR) - Mongolia's sovereign bonds jumped three points this morning after the government  Rio Tinto  and Turquoise Hill Resources signed an agreement for the next stage of development of the Oyu Tolgoi copper and gold mining project.",
        "date": "05192015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Mongolian bonds soar on Oyu Tolgoi deal "
    },
    {
        "content": "SINGAPORE Any inquiry into the collapse of iron ore prices by the Australian Senate is likely to provide a great opportunity for political point-scoring for a domestic audience  but won't address the main issue.",
        "date": "05152015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Any Australian iron ore inquiry won't solve major issue: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "05152015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-Any Australian iron ore inquiry won't solve major issue: Russell "
    },
    {
        "content": "LONDON  May 12 BHP Billiton   said on Tuesday it would slash its iron ore production cost further and cut spending to better withstand a downturn in commodity prices that is testing even mining industry heavyweights.",
        "date": "05122015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-UPDATE 3-BHP plans deeper cost cuts to battle commodity rout "
    },
    {
        "content": "* Cuts 2016 spending by deferring shale oil  iron projects   (Adds Rio Tinto CEO comments  details on BHP capex cuts)",
        "date": "05122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-BHP plans deeper cost cuts to battle commodity rout "
    },
    {
        "content": "DUBAI  May 12 Rio Tinto Alcan <RIOXXA.UL]  the mining giant's aluminium business  expects a global deficit in the aluminum market in 2015 despite good figures in the first quarter  the company's chief executive said on Tuesday.",
        "date": "05122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto Alcan sees possible deficit in 2015 in aluminium market "
    },
    {
        "content": "SYDNEY  May 13 BHP Billiton and Rio Tinto face mounting political pressure in Australia over taxes and flooding the global iron ore market while the price of the steel-making commodity plummeted.",
        "date": "05132015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-BHP  Rio Tinto face political heat in Australia over strategies "
    },
    {
        "content": "SYDNEY  May 11 Fortescue Metals Group  Chairman Andrew \"Twiggy\" Forrest on Monday called on Australians to urge the government to stop expansion plans by iron ore miners Rio Tinto and BHP Billiton  saying they were jeopardizing the economy.",
        "date": "05112015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Fortescue founder asks Australians to fight Rio  BHP iron ore plans "
    },
    {
        "content": "SINGAPORE/MELBOURNE  May 6 Rio Tinto  the most profitable iron ore producer  is in a strong position to keep its mines running at full tilt  even as rivals BHP Billiton and Brazil's Vale  apply the brakes in a market suffering a supply glut.",
        "date": "05062015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto tipped to stick to no-output cut mantra on iron ore "
    },
    {
        "content": "PERTH/LONDON Rio Tinto is to stick with plans to produce iron ore at full tilt despite a plunge in prices  turning up the heat on rivals large and small  which are struggling to cope with the consequences of a supply glut.",
        "date": "05072015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto unshakeable on iron ore expansion plans "
    },
    {
        "content": "SYDNEY  May 13 BHP Billiton and Rio Tinto face mounting political pressure in Australia over taxes and flooding the global iron ore market while the price of the steel-making commodity plummeted.",
        "date": "05132015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "BHP  Rio Tinto face political heat in Australia over strategies "
    },
    {
        "content": "* Fortescue  IOC  Kumba under pressure from low prices   (Changes dateline  adds analyst comment  detail on rivals)",
        "date": "05072015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-Rio Tinto unshakeable on iron ore expansion plans "
    },
    {
        "content": "* CSL  Woolworths  IAG  QBE among bottom movers by index weight",
        "date": "05012015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Australia shares snap 3 days of fall; rise 0.5 pct "
    },
    {
        "content": "April 29 Cliffs Natural Resources Inc  which is struggling to cope with an over-supplied iron ore market  blamed industry leaders BHP Billiton Ltd  Rio Tinto PLC and Vale SA for weak prices for the commodity.",
        "date": "04292015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Cliffs Natural blames Rio  BHP  Vale for weak iron-ore prices "
    },
    {
        "content": "April 29 Cliffs Natural Resources Inc  which is struggling to cope with oversupply in the iron ore market  blamed industry leaders BHP Billiton Ltd  Rio Tinto Plc and Vale SA for weak prices of the commodity.",
        "date": "04292015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Cliffs Natural blames Rio  BHP  Vale for weak iron-ore prices "
    },
    {
        "content": "* Minas Rio currently breaking even after capital-CEO   (Adds CEO  chairman comments)",
        "date": "04232015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 2-Listing preferred option for Anglo's South Africa platinum mines- CEO "
    },
    {
        "content": "DALANZADGAD  Mongolia  April 22 Rio Tinto   committed on Wednesday to spending $5 million a year to help resolve conflicts with nomadic herders and water problems that have stoked political opposition to the expansion of a huge copper mine in Mongolia's South Gobi desert.",
        "date": "04222015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto seeks to build goodwill for huge Mongolian copper mine "
    },
    {
        "content": "SYDNEY  April 21 Rio Tinto  on Tuesday posted a sharp rise in quarterly iron ore output amid a push to capture more of the global market despite a mounting supply glut driving ore prices to 10-year lows.",
        "date": "04202015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto Q1 iron ore output rises amid glut "
    },
    {
        "content": "SYDNEY/MELBOURNE Rio Tinto on Tuesday missed first quarter analyst forecasts for iron ore shipments due to bad weather and transport delays  but maintained its full year production target in a bearish sign for prices already at 10-year lows.",
        "date": "04212015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto first quarter iron ore output misses forecasts "
    },
    {
        "content": "* Still expects to ship around 350 mln tonnes iron ore in 2015   (Recasts  adds investor comment)",
        "date": "04212015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio Tinto Q1 iron ore output misses forecasts "
    },
    {
        "content": "LONDON Rio Tinto  the world's second largest mining company  warned of \"continued bumps\" in its key iron ore market and vowed to stay focused on slashing costs to be the last man standing at a tough time for the sector.",
        "date": "04172015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto to slash costs further to endure bumpy ride in iron ore "
    },
    {
        "content": "SYDNEY  April 14 Australian shares fell 0.2 percent on Tuesday as investors backed away from testing 6 000 points on the benchmark index  selling mining stocks like BHP Billiton and Rio Tinto amid a slump in iron ore prices.",
        "date": "04142015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "REFILE-Australia shares retreat from 6 000 barrier as iron ore slumps "
    },
    {
        "content": "LONDON  April 16 Rio Tinto  the world's second largest mining company  warned of \"continued bumps\" in its key iron ore market and vowed to stay focused on slashing costs to be the last man standing at a tough time for the sector.",
        "date": "04162015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "CORRECTED-UPDATE 1-Rio Tinto to slash costs further to endure bumpy ride in iron ore "
    },
    {
        "content": "* Consumer sentiment sluggish   (Adds quotes  stocks on the move)",
        "date": "04142015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Australia shares slip as investors baulk at 6 000  iron ore weakness "
    },
    {
        "content": "LONDON  April 16 Rio Tinto's   iron ore cost of production has fallen from an average of $19.50 a tonne in 2014 to around $17 so far this year  the head of the world's second-largest mining company said on Thursday.",
        "date": "04162015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Lower oil price  weaker Aussie dollar cut Rio's iron ore costs "
    },
    {
        "content": "ULAN BATOR  April 6 Mongolia will soon finalise negotiations that will free up $8 billion for expansions at the country's largest coal and copper mines  its prime minister said in a national address on Sunday.",
        "date": "04062015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Deals to soon yield $8 bln in investments for Mongolia copper  coal mines -PM "
    },
    {
        "content": "MELBOURNE  April 10 BHP Billiton   came under fire from Australian Senators on Friday for not revealing how much profit it made or tax it paid at its Singapore marketing hub  amid a wider inquiry into profit-shifting by multinationals to avoid tax.",
        "date": "04102015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BHP  Rio Tinto grilled over Singapore marketing hubs "
    },
    {
        "content": "MELBOURNE Australia's treasurer has told business representatives he would not allow Glencore Plc to merge with Rio Tinto due to concerns about losing tax revenue  a person familiar with his comments said on Wednesday.",
        "date": "04082015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Australia treasurer would block a Glencore-Rio Tinto merger "
    },
    {
        "content": "MELBOURNE Australia is pursuing global miners BHP Billiton and Rio Tinto for shifting billions of dollars in iron ore profits through marketing hubs in Singapore that pay almost no tax  the Australian Financial Review reported on Tuesday.",
        "date": "04072015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Australia chases BHP  Rio Tinto on Singapore tax shelter: AFR "
    },
    {
        "content": "* Commodity price slump weighs on Glencore firepower in any bid   (Recasts; adds comment from source  treasurer's office)",
        "date": "04082015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Australia treasurer would block a Glencore-Rio Tinto merger "
    },
    {
        "content": "* Glencore  Tohoku set thermal coal price at $67.80/T -sources",
        "date": "04072015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Glencore  Japan's Tohoku set annual coal price down 17 pct -sources "
    },
    {
        "content": "* Australia pursuing multibillion-dollar claims on BHP  Rio -AFR",
        "date": "04072015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Australia chases BHP  Rio Tinto on Singapore tax shelter - AFR "
    },
    {
        "content": "TOKYO  April 3 Tohoku Electric Power  has agreed an annual thermal-coal import deal at prices 17 percent lower than a year ago with Rio Tinto   after not coming to terms with longtime supplier Glencore   the Nikkei newspaper said on Friday.",
        "date": "04032015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio  Tohoku set annual coal contract at price down 17 pct y/y -Nikkei "
    },
    {
        "content": "ULAN BATOR  March 31 Rio Tinto   and Mongolia have made a breakthrough in a tax dispute that has been among issues stalling development of the $6.5 billion Oyu Tolgoi copper mine  according to an official familiar with the government's position.",
        "date": "03312015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Tax breakthrough at Rio Tinto's Mongolia copper mine -source "
    },
    {
        "content": "(Adds company news)     LONDON  March 30 Britain's FTSE 100 index is seen opening up 27 to 35 points  or 0.5 percent higher on Monday  according to financial bookmakers  with futures up 0.5 percent at 0627 GMT. For more on the factors affecting European stocks  please click on           * The blue-chip FTSE 100 index  which hit a record intraday high of 7 065.08 points on Tuesday  fell 0.6 percent to 6 855.02 points on Friday  pulled down by commodity stocks as iron ore prices plu",
        "date": "03302015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UK Stocks-Factors to watch on Monday  March 30 "
    },
    {
        "content": "* Rio in talks with Mongolia on \"detail\" of Oyu Tolgoi restart",
        "date": "03282015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto CEO says Nov plan to restart Oyu Tolgoi was \"best and final offer\" "
    },
    {
        "content": "ULAN BATOR  April 3 Mongolia must take much of the blame for a dispute with Rio Tinto that has delayed the expansion of a $6.5 billion copper mine and disrupted economic growth  the country's prime minister said.",
        "date": "04032015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Mongolia must accept blame over Rio Tinto mine dispute - PM "
    },
    {
        "content": "ULAN BATOR  March 28 Proposals made to the Mongolian government by global mining giant Rio Tinto   last November to restart the long-delayed Oyu Tolgoi copper mine were the firm's \"best and final offer\" and won't be changed  Rio's chief executive said.",
        "date": "03282015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto CEO says Nov plan to restart Oyu Tolgoi was \"best and final offer\" "
    },
    {
        "content": "LONDON  March 24 Just two weeks before Glencore  can make a new approach for Rio Tinto  the rival that rejected it last summer  the Swiss firm once seen as a deal machine seems unlikely to strike again or charm investors with any other major move soon.",
        "date": "03242015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Bounce in Glencore's commodity prices could kick-start dormant deal machine "
    },
    {
        "content": "SINGAPORE Spot iron ore prices hit new record lows on Friday while futures in China and Singapore slid as much as 4 percent before paring losses  on worries that global producers would continue to lift output in a well supplied market.",
        "date": "03272015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Iron ore sinks to record low as Rio comment stokes glut worries "
    },
    {
        "content": "LONDON  March 24 Anglo Australian miner Rio Tinto  plans to cut jobs in mergers and acquisitions and business development  three sources said  to cut costs as it battles a slump in commodity prices.",
        "date": "03262015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-Rio Tinto to cut M&A headcount in saving drive - sources "
    },
    {
        "content": "* Shanghai rebar also hits record low  but cuts losses   (Updates spot price)",
        "date": "03272015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Iron ore sinks to record low as Rio comment stokes glut worries "
    },
    {
        "content": "ULAN BATOR  March 26 Rio Tinto's chief executive will visit its $6.5 billion Oyu Tolgoi copper mine in Mongolia on Sunday  two people familiar with the visit said  amid signs the country's new prime minister is keen to end disputes that have delayed an expansion project.",
        "date": "03262015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-REFILE-Rio CEO to visit troubled Mongolia copper mine - sources "
    },
    {
        "content": "ULAN BATOR  March 26 Rio Tinto's chief executive will visit its $6.5 billion Oyu Tolgoi copper mine in Mongolia on Sunday  two people familiar with the visit said  amid signs the country's new prime minister is keen to end disputes that have delayed an expansion project.",
        "date": "03262015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "REFILE-Rio CEO to visit troubled Mongolia copper mine - sources "
    },
    {
        "content": "LONDON  March 26 Anglo Australian miner Rio Tinto  plans to cut jobs in mergers and acquisitions and business development  three sources said  to cut costs as it battles a slump in commodity prices.",
        "date": "03272015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "REFILE--Rio Tinto to cut M&A headcount in saving drive - sources "
    },
    {
        "content": "LONDON Anglo Australian miner Rio Tinto plans to cut jobs in mergers and acquisitions and business development  three sources said  to cut costs as it battles a slump in commodity prices.",
        "date": "03262015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto to cut M&A headcount in saving drive: sources "
    },
    {
        "content": "LONDON  March 24 Anglo Australian miner Rio Tinto  plans to cut jobs in mergers and acquisitions and business development  three sources said  to cut costs as it battles a slump in commodity prices.",
        "date": "03262015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto to cut M&A headcount in saving drive - sources "
    },
    {
        "content": "* Says Rio does not collude on iron ore production   (Recasts lead  adds analyst comment)",
        "date": "03262015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 2-Rio Tinto dismisses 'harebrained' Fortescue iron ore plan "
    },
    {
        "content": "MELBOURNE  March 26 Rio Tinto   Chief Executive Sam Walsh said  putting a cap on iron ore production was not in Australia's national interest  dismissing a suggestion it could help lift the traded price of the steelmaking commodity.",
        "date": "03262015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto says iron ore output cap not in Australia's interest "
    },
    {
        "content": "HARARE Zimbabwe is planning to merge all diamond mining companies  including the local unit of Rio Tinto  into one big firm in which the state will own half of the shares  the minister of mines said on Thursday.",
        "date": "03122015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Zimbabwe says to merge all diamond mines under one company "
    },
    {
        "content": "PERTH  Australia  March 10 Global miner Rio Tinto  expects some 85 million tonnes of iron ore capacity to be taken out of the world market in 2015 because a price slump has made it too costly to produce  on top of an estimated 125 million tonnes last year.",
        "date": "03102015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-UPDATE 1-Rio Tinto sees iron ore mines closing at slower pace in 2015 "
    },
    {
        "content": "PERTH  Australia Global miner Rio Tinto expects some 85 million tonnes of iron ore capacity to be taken out of the world market in 2015 because a price slump has made it too costly to produce  on top of an estimated 125 million tonnes last year.",
        "date": "03102015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto sees iron ore mines closing at slower pace in 2015 "
    },
    {
        "content": "LONDON Global mining firm Rio Tinto plans to cut costs and jobs across six divisions  sources said this week  as the company battles a slump in world commodity prices.",
        "date": "03052015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto to slim workforce as it battles weak metal prices "
    },
    {
        "content": "* Iron ore plumbs record-low price due to oversupply   (Adds comments  details)",
        "date": "03102015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto sees iron ore mines closing at slower pace in 2015 "
    },
    {
        "content": "MELBOURNE/LONDON  Feb 27 In its latest effort to slash costs as commodity prices fall  Rio Tinto   is letting go its energy chief and rolling its coal and uranium businesses into two other units  a move that could signal its intention to divest its coal assets.",
        "date": "03012015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-UPDATE 1-Rio Tinto energy chief's job cut may signal coal exit "
    },
    {
        "content": "LONDON  March 5 Britain's top share index steadied near a record high on Thursday  with a rally in insurers after positive results offsetting weakness in companies trading without the attraction of their latest dividend payout.",
        "date": "03052015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Britain's FTSE steadies near record high  Aviva gains "
    },
    {
        "content": "TOKYO  March 5 A major Japanese aluminium buyer has agreed to pay a producer premium of $380 per tonne for metal to be shipped in the April-June period  down from the previous quarter  a buyer source directly involved in the quarterly pricing talks said.",
        "date": "03052015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-Japanese aluminium buyer secures lower $380 premium in Q2 -source "
    },
    {
        "content": "SYDNEY  March 4 Australia's Bengalla coal mine has been cleared to boost output by a third and operate for another two decades  majority owner Rio Tinto   said on Wednesday.",
        "date": "03042015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto thermal coal mine in Australia cleared to expand "
    },
    {
        "content": "* Glencore  Mick Davis among the potential buyers-sources   (Recasts with comments on potential exit from coal)",
        "date": "02272015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Rio Tinto energy chief's job cut may signal coal exit "
    },
    {
        "content": "DAKAR/MONROVIA/CONAKRY In the marble atrium of the Mammy Yoko hotel in Freetown  manager Nuno Neves has spotted something he has not seen since the Ebola virus struck Sierra Leone nine months ago: foreign businessmen.",
        "date": "02272015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Thoughts turn to recovery as Ebola slowly ebbs in West Africa "
    },
    {
        "content": "MELBOURNE  Feb 25 Global miner Rio Tinto   will not be taken over by rival Glencore  because there is no value in it for shareholders and regulators will never let it happen  Rio Tinto chief executive Sam Walsh said.",
        "date": "02252015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-Rio Tinto CEO sees no chance of a Glencore merger "
    },
    {
        "content": "MELBOURNE  Feb 25 Global miner Rio Tinto   will not be taken over by rival Glencore  because there is no value in it for shareholders and regulators will never let it happen  Rio Tinto chief executive Sam Walsh said.",
        "date": "02252015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto CEO sees no chance of a Glencore merger "
    },
    {
        "content": "LAUNCESTON  Australia  Iron ore should go back to the future and reinstate annual contract pricing  according a former executive of top miner Rio Tinto. He's wrong.",
        "date": "02232015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Iron ore can't go back to the future to annual pricing: Russell "
    },
    {
        "content": "SYDNEY Fortescue Metals Group  Australia's third biggest iron ore miner  posted a 81 percent dive in first-half profits after a halving in the price of the steel making ingredient hammered margins and outweighed record production.",
        "date": "02162015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Australia's Fortescue first-half profit plunges on weaker iron ore price "
    },
    {
        "content": "SYDNEY  Feb 17 A cyclone gaining strength in waters off northern Australia is threatening coastal mining sites operated by BHP Billiton  Glencore and Rio Tinto.",
        "date": "02172015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Australian cyclone's forecast path crosses BHP  Rio  Glencore mines "
    },
    {
        "content": "LONDON  Feb 12 Global miner Rio Tinto   is not interested in a proposal by Mongolia to cut its equity stake in key mines such as Rio's Oyu Tolgoi in exchange for more royalties  Chief Executive Sam Walsh said on Thursday.",
        "date": "02122015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio shuns Mongolia plan to swap Oyu Tolgoi equity for royalties "
    },
    {
        "content": "LONDON  Feb 12 Britain's top share index rose on Thursday  with bottler Coca Cola HBC leading the market higher after news of a general ceasefire from Sunday in Ukraine's east  where Kiev is fighting pro-Russian separatists.",
        "date": "02122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Ukraine ceasefire boost for Coca Cola bottler helps FTSE "
    },
    {
        "content": "MELBOURNE Global miner Rio Tinto handed $2 billion in capital to shareholders on top of a higher than expected dividend on Thursday  despite reporting its worst half-year profit in two years.",
        "date": "02122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Rio Tinto defies commodity rout with big payout "
    },
    {
        "content": "MELBOURNE/LONDON Rio Tinto is expected to star among the top five global miners with a return of billions of dollars to shareholders at its annual results  even as the firm is set to report its worst half-year profit since 2009.",
        "date": "02102015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Rio Tinto to defy mining pain with big payout while rivals suffer "
    },
    {
        "content": "* Rio Tinto has long been against re-opening investment agreement   (Adds comment from analyst  Turquoise Hill  Rio Tinto)",
        "date": "02062015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Mongolia looks at equity for royalties swap to break mining deadlock "
    },
    {
        "content": "* Rio Tinto UK shares up 2.6 percent   (Adds analyst quote  updates shares)",
        "date": "02122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 3-Rio Tinto defies commodity rout with big payout "
    },
    {
        "content": "LONDON  Feb 12 Britain's top share index rose on Thursday  with Rio Tinto leading the market higher after announcing plans to return $2 billion to shareholders and offering a higher than expected dividend despite its worst half-year profit in two years.",
        "date": "02122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Miners help FTSE to recover  Rio Tinto leads higher "
    },
    {
        "content": "PARIS  Feb 12 European shares were steady in early trading on Thursday  with investors focusing on a big batch of quarterly results from companies including EDF   Rio Tinto and Credit Suisse.",
        "date": "02122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "European shares steady; Credit Suisse  Renault surge "
    },
    {
        "content": "SYDNEY  Feb 12 Rio Tinto  has been struggling for years to recover from the $38 billion purchase that elevated it to the world's biggest aluminium company but also brought it to the verge of bankruptcy.",
        "date": "02122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Aluminium overtakes copper for No.2 spot at Rio Tinto "
    },
    {
        "content": "SINGAPORE/SHANGHAI  Feb 12 The world's big three iron ore miners appear to be entering the final phase of a fight to increase market share in China as massive expansions drive more high-cost rivals out of business.",
        "date": "02122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "UPDATE 1-The end battle? Big iron ore miners tighten grip on market "
    },
    {
        "content": "PARIS  Feb 12 European stocks were set for a slightly lower open on Thursday  with investors focusing on a big batch of quarterly results from companies including EDF  Rio Tinto and Credit Suisse.     Ukraine was also in the spotlight  with President Petro Poroshenko said certain conditions set by Russia at talks in Minsk on the Ukraine conflict were unacceptable but there still was hope  Russian news agency reported on Thursday.       At 0744 GMT  futures for Euro STOXX 50  for Germ",
        "date": "02122015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Europe Factors to Watch-Futures edge down; earnings in focus "
    },
    {
        "content": "LONDON  Jan 20 Britain's top share index rose for its fourth straight session on Tuesday to hit its highest level in three weeks  buoyed by growth-sensitive stocks after Chinese data beat expectations.",
        "date": "01202015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "Chinese boost helps Britain's FTSE hit 3-week high "
    },
    {
        "content": "LAUNCESTON  Australia  The latest production reports from mining giants BHP Billiton and Rio Tinto hammer home an uncomfortable truth: No matter how much output increases and costs are cut  falling commodity prices triumph.",
        "date": "01212015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "BHP  Rio production show scale of commodity price challenge: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "01212015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "RPT-COLUMN-BHP  Rio production show scale of commodity price challenge: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "01212015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "COLUMN-BHP  Rio production show scale of commodity price challenge: Russell "
    },
    {
        "content": "* Analysts' consensus last Oct was for 350 000 T surplus this year",
        "date": "01152015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "RPT-UPDATE 1-Big global copper surplus? Mine cutbacks force rethink "
    },
    {
        "content": "* Analysts' consensus last Oct was for 350 000 T surplus this year",
        "date": "01142015",
        "name": "Rio Tinto Plc",
        "news_type": "topStory",
        "symbol": "RIO",
        "title": "UPDATE 1-Big global copper surplus? Mine cutbacks force rethink "
    },
    {
        "content": "LONDON A sudden plunge in the price of copper pulled the shares of global miner Glencore to their lowest level on record on Wednesday and risks frustrating any intention to make a fresh move on larger rival Rio Tinto.",
        "date": "01142015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Copper tumble threatens Glencore's takeover ambitions "
    },
    {
        "content": "* Analysts' consensus last Oct was for 350 000 T surplus this year",
        "date": "01142015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Big global copper surplus? Mine cutbacks force rethink "
    },
    {
        "content": "LONDON  Jan 14 A sudden plunge in the price of copper pulled the shares of global miner Glencore to their lowest level on record on Wednesday and risks frustrating any intention to make a fresh move on larger rival Rio Tinto.",
        "date": "01142015",
        "name": "Rio Tinto Plc",
        "news_type": "normal",
        "symbol": "RIO",
        "title": "Copper tumble risks hampering Glencore's takeover ambitions "
    }
]