[
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 27 (Fitch) Fitch Ratings has affirmed Royal Bank of Canada (RY) Long- and Short-Term Issuer Default Ratings (IDRs) at 'AA' and 'F1+'  respectively. The Rating Outlook has been revised to Stable from Negative. This rating action follows Fitch's periodic review of the Canadian Banks Peer Group  which includes Bank of Montreal (BMO)  Bank of Nova Scotia (BNS)  Canadian Imperial Bank of Commerce (CIBC)  Federation des caiss",
        "date": "10272017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Fitch Affirms Royal Bank of Canada at 'AA/F1+'; Outlook Revised to Stable "
    },
    {
        "content": "Oct 26 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10262017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES-Eaton Vance  Royal Bank of Canada "
    },
    {
        "content": "Oct 24 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10242017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES- Adams Street Partners  RBC Investor & Treasury Services "
    },
    {
        "content": "Oct 24 RBC Investor & Treasury Services  a Royal Bank of Canada unit  appointed Geert Pick as managing director  global head of product management  shareholder services.",
        "date": "10242017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "MOVES-RBC Investor & Treasury Services names Geert Pick managing director "
    },
    {
        "content": "* Jeffery Yabuki appointed to the board of directors of Royal Bank Of Canada Source text for Eikon: Further company coverage:",
        "date": "10192017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "BRIEF-Jeffery Yabuki appointed to board of directors of Royal Bank Of Canada "
    },
    {
        "content": "* Royal Bank Of Canada announces specific share repurchase program as part of its normal course issuer bid",
        "date": "10112017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "BRIEF-Royal Bank Of Canada enters deal to repurchase shares between Oct 16-Oct 30 "
    },
    {
        "content": "Sept 28 Tune in now to watch live: http://reut.rs/2fy9gwC",
        "date": "09282017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "LIVE REUTERS NEWSMAKER - Interview with Royal Bank of Canada CEO  David McKay "
    },
    {
        "content": "Sept 28 Royal Bank of Canada CEO  David McKay  joins Reuters Editor-in-Chief  Steve Adler  to discuss how financial institutions are approaching artificial intelligence and blockchain  with particular focus on how these disruptive technologies will affect consumer platforms.",
        "date": "09282017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "UPCOMING REUTERS NEWSMAKER - Interview with Royal Bank of Canada CEO  David McKay "
    },
    {
        "content": "TORONTO Royal Bank of Canada  is experimenting with blockchain to help move payments between its U.S. and Canadian banks  one of the bank's senior executives told Reuters on Thursday.",
        "date": "09272017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Exclusive: Royal Bank of Canada using blockchain for U.S./Canada payments - executive "
    },
    {
        "content": "TORONTO  Sept 28 The chief executive of Canada's biggest lender on Thursday pushed back on a suggestion by JPMorgan Chief Executive Jamie Dimon that bitcoin is a fraud  though he said the cryptocurrency needs monitoring.",
        "date": "09292017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "RPT-UPDATE 2-RBC's CEO pushes back on suggestion bitcoin is a fraud "
    },
    {
        "content": "* Expects competition to emerge from non-traditional lenders (Recasts  adds comments on bitcoin)",
        "date": "09292017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "UPDATE 2-RBC's CEO pushes back on suggestion bitcoin is a fraud "
    },
    {
        "content": "TORONTO  Sept 28 Royal Bank of Canada's chief executive  Dave McKay  said on Thursday that artificial intelligence (AI) is helping the bank reduce credit card fraud  and he said the bank expects to use blockchain technology in its loyalty programs next year.",
        "date": "09292017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC CEO McKay says AI helping to curb credit card fraud "
    },
    {
        "content": "* Signed a contract with Royal Bank of Canada (RBC)  to provide a white-label version of 9 spokes platform Source text for Eikon: Further company coverage:",
        "date": "09192017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "BRIEF-9 Spokes International signs a contract with Royal Bank of Canada "
    },
    {
        "content": "TORONTO  Sept 6 Royal Bank of Canada's Chief Executive Dave McKay said on Wednesday he expected the Bank of Canada's decision to raise interest rates to add more than C$300 million ($245 million) to its revenues over 5 years.",
        "date": "09062017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "RBC says rate hike will add more than C$300 million to revenues "
    },
    {
        "content": "* Nuvo Pharmaceuticals secures credit facility from The Royal Bank of Canada",
        "date": "08242017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "BRIEF-Nuvo Pharmaceuticals secures credit facility from RBC "
    },
    {
        "content": "TORONTO  Aug 23 Canada's main stock index ended higher on Wednesday  boosted by a sharp jump in banking stocks after Royal Bank of Canada reported earnings and as a jump in oil prices helped energy companies.",
        "date": "08232017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "CANADA STOCKS-TSX up as RBC earnings boost banks  energy stocks jump with oil "
    },
    {
        "content": "* ‍As at July 31  2017  CET1 ratio was 10.9%  up 30 BPS as compared to prior quarter​",
        "date": "08232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "BRIEF-Royal Bank Of Canada says Qtrly net income per share  excluding items $1.85 "
    },
    {
        "content": "TORONTO Royal Bank of Canada  on Wednesday reported a rise in third-quarter profit  helped by double-digit growth at its wealth management business which offset a weaker showing in its capital markets unit.      Net income at Canada's biggest lender  excluding one-off items such as a gain on the sale of its home and auto insurance business last year  increased to C$2.8 billion ($2.2 billion) for the quarter to June 30  5 percent higher than a year earlier.",
        "date": "08232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC lifts profit  helped by wealth management strength "
    },
    {
        "content": "* CEO says encouraged by measures to cool housing markets (Adds comments by executives on housing market  share movement)",
        "date": "08232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "UPDATE 4-RBC lifts profit  helped by wealth management strength "
    },
    {
        "content": "TORONTO  Aug 23 Canada's main stock index rose on Wednesday  boosted by a jump in financial shares led by Royal Bank of Canada after the country's biggest lender reported a rise in third-quarter profit.",
        "date": "08232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "CANADA STOCKS-TSX rises as RBC earns boosts financial stocks "
    },
    {
        "content": "TORONTO  Aug 23 Canada's main stock index turned slightly higher in early trade on Wednesday  helped by gains in financial shares led by Royal Bank of Canada after the country's biggest lender reported a rise in third-quarter profit.",
        "date": "08232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "CANADA STOCKS-TSX rises as RBC leads financial gains after earnings "
    },
    {
        "content": "TORONTO  Aug 23 Royal Bank of Canada on Wednesday reported an increase in third-quarter earnings  helped by double digit earnings growth at its wealth management business which offset a weaker showing in capital markets.",
        "date": "08232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Canada's RBC posts 5 percent increase in third-quarter earnings "
    },
    {
        "content": "* Royal Bank of Canada to redeem non-cumulative first preferred shares series AB and non-cumulative perpetual first preferred shares series c-1",
        "date": "08232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "BRIEF-Royal Bank of Canada to redeem non-cumulative first preferred shares series AB "
    },
    {
        "content": "* Royal Bank of Canada - qtrly net income per share excluding items $1.72‍​",
        "date": "08232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "BRIEF-Royal Bank of Canada Q3 diluted EPS $1.85‍​ "
    },
    {
        "content": "Aug 7 RBC Investor & Treasury Services  a Royal Bank of Canada unit  appointed Wendy Phillis as managing director of governance and regulatory solutions for the Europe and Asia-Pacific regions.",
        "date": "08072017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES-RBC names new regulatory solutions director for Europe  APAC "
    },
    {
        "content": "LONDON  Aug 7 (IFR) - Royal Bank of Canada has hired Wendy Phillis as managing director of governance and regulatory solutions in Europe and Asia-Pacific for its investor and treasury services unit.",
        "date": "08072017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "MOVES-RBC hires Phillis for regulatory role "
    },
    {
        "content": "* Royal Bank Of Canada - RBC also launched seamless Interac e-transfer payments within iMessage Source text for Eikon: Further company coverage:",
        "date": "08012017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "BRIEF-Royal Bank Of Canada - launched seamless Interac e-transfer payments within iMessage "
    },
    {
        "content": "LONDON  July 18 (IFR) - Royal Bank of Canada has hired James Agnew from KPMG as chairman of corporate broking for RBC Capital Markets in Europe.",
        "date": "07182017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES-RBC hires Agnew as chairman of EMEA corporate broking "
    },
    {
        "content": "TORONTO  July 6 Janice Fukakusa  a former Royal Bank of Canada chief financial officer  was appointed on Thursday as the first chairperson of Canada's new infrastructure bank  the country's infrastructure minister said.",
        "date": "07062017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Canada appoints ex-RBC executive Fukakusa as infrastructure bank chair "
    },
    {
        "content": "* Announced a strategic relationship with Royal Bank Of Canada RBC Source text for Eikon: Further company coverage:",
        "date": "07062017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "BRIEF-Versapay reports strategic relationship with Royal Bank Of Canada RBC "
    },
    {
        "content": "July 6 RBC Investor & Treasury Services  a unit of the Royal Bank of Canada  named Hong Paterson to lead its investor and  treasury services business in Singapore.",
        "date": "07062017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "MOVES-RBC unit names Singapore country head "
    },
    {
        "content": "* Versapay Corp- Royal Bank Of Canada enters agreement with Versapay to offer ARC to business customers under RBC brand Source text for Eikon: Further company coverage:",
        "date": "07062017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "BRIEF-Versapay  RBC enters agreement to offer ARC to business customers "
    },
    {
        "content": "TORONTO Royal Bank of Canada on Tuesday agreed to pay C$21.8 million ($16.5 million) in compensation to clients who were charged excess fees for mutual fund products and fee-based accounts.",
        "date": "06272017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "RBC to pay $16.5 mln to clients in regulatory settlement "
    },
    {
        "content": "TORONTO  June 27 Royal Bank of Canada on Tuesday agreed to pay C$21.8 million ($16.5 million) in compensation to clients who were charged excess fees for mutual fund products and fee-based accounts.",
        "date": "06272017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "UPDATE 1-RBC to pay $16.5 mln to clients in regulatory settlement "
    },
    {
        "content": "TORONTO  June 27 Royal Bank of Canada on Tuesday agreed to pay C$21.8 million ($16.5 million) in compensation to clients who were charged excess fees for mutual fund products and fee-based accounts.",
        "date": "06272017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC to pay $16.5 mln to clients as part of regulatory settlement "
    },
    {
        "content": "TORONTO  June 21 Royal Bank of Canada  Canada's biggest lender  said on Wednesday that it would cut 450 jobs  primarily from its head offices in Toronto  as part of a restructuring enabling it to invest more in new technology.",
        "date": "06212017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Royal Bank of Canada to cut 450 jobs "
    },
    {
        "content": "MOSCOW  June 16 Russian tycoon Mikhail Prokhorov has completed the sale of his RBC media holding to a fellow businessman  Grigory Berezkin  Berezkin's ESN group said in a statement on Friday.",
        "date": "06162017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Russian tycoon Prokhorov completes sale of RBC media - statement "
    },
    {
        "content": "June 14 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06142017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES-Royal Bank of Canada  Evercore  BNP Paribas  BCS Global Markets "
    },
    {
        "content": "NEW YORK Jonathan Yalmokas has resigned as Bank of America Corp's head of prime brokerage in the Americas to lead an equity financing business at Royal Bank of Canada  a person familiar with the move said on Wednesday.",
        "date": "06142017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Bank of America prime brokerage executive jumps to RBC "
    },
    {
        "content": "NEW YORK  June 14 Jonathan Yalmokas has resigned as Bank of America Corp's head of prime brokerage in the Americas to lead an equity financing business at Royal Bank of Canada  a person familiar with the move said on Wednesday.",
        "date": "06142017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "UPDATE 1-MOVES-Bank of America prime brokerage executive jumps to RBC "
    },
    {
        "content": "NEW YORK  June 14 Jonathan Yalmokas has resigned as Bank of America Corp's head of prime brokerage in the Americas to lead an equity financing business at Royal Bank of Canada  a person familiar with the move said on Wednesday.",
        "date": "06142017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "MOVES-Bank of America prime brokerage executive jumps to RBC "
    },
    {
        "content": "* Royal bank of canada ceo says not a systemic risk if home capital were to continue to experience trouble",
        "date": "05252017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "BRIEF-RBC CEO says Home Capital issues \"not a systemic risk\" "
    },
    {
        "content": "TORONTO  May 25 Royal Bank of Canada reported an 11 percent increase in second quarter earnings  beating market forecasts  helped by a strong performance in its capital markets and wealth management businesses.",
        "date": "05252017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Royal Bank of Canada's quarterly earnings beat market forecasts "
    },
    {
        "content": "* ‍return on common equity of 17.2% at Q2-end  up 100 basis points (BPS) from 16.2%",
        "date": "05252017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "BRIEF-Royal Bank of Canada Q2 diluted EPS $1.85 "
    },
    {
        "content": "* Royal Bank of Canada - intention to redeem all outstanding 2.86 per cent subordinated debentures due june 26  2037",
        "date": "04282017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "BRIEF-Royal Bank of Canada to redeem subordinated debentures "
    },
    {
        "content": "* RBC ceo says media reports about sales practices not consistent with bank's culture",
        "date": "04062017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "BRIEF-RBC says supply issues biggest factor behind house price rises "
    },
    {
        "content": "* RBC CEO defends sales practices following media reports (Adds comments  by RBC CEO)",
        "date": "04062017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "UPDATE 2-Overheated housing markets may hamper Canada's growth -RBC "
    },
    {
        "content": "* RBC global asset management inc. Announces march sales results for RBC funds  ph&n funds and bluebay funds and first quarter sales results for RBC etfs",
        "date": "04062017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "BRIEF-RBC Global Asset Management provides March sales results "
    },
    {
        "content": "TORONTO  April 6 Royal Bank of Canada  JPMorgan and Bank of Montreal took the top three positions advising on Canadian equity issues in the first quarter  according to Thomson Reuters data released on Thursday.",
        "date": "04062017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC  JPMorgan lead Canadian equity advisory in first quarter "
    },
    {
        "content": "* RBC board of directors to engage with shareholders and other stakeholders on proxy access",
        "date": "03222017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "BRIEF-Royal Bank of Canada board to engage with shareholders on proxy access "
    },
    {
        "content": "March 23 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03232017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES-Royal Bank of Canada  Lazard  Barclays "
    },
    {
        "content": "Mark Cohen  the head of restructuring finance at Deutsche Bank AG  will join Royal Bank of Canada as head of its U.S. capital solutions group in New York in June  people familiar with the matter said on Thursday.",
        "date": "03232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Deutsche Bank head of restructuring finance joins RBC: sources "
    },
    {
        "content": "March 23 Mark Cohen  the head of restructuring finance at Deutsche Bank AG  will join Royal Bank of Canada as head of its U.S. capital solutions group in New York in June  people familiar with the matter said on Thursday.",
        "date": "03232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "MOVES-Deutsche Bank head of restructuring finance joins RBC -sources "
    },
    {
        "content": "March 23 Royal Bank of Canada (RBC) named Jim Pettigrew chairman of the board of RBC Europe Ltd  replacing John Roberts  who retired after holding the position for eight years.",
        "date": "03232017",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "MOVES-RBC names Jim Pettigrew chairman of its European board "
    },
    {
        "content": "* Royal Bank Of Canada to repurchase up to 30 million of its common shares",
        "date": "03092017",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "BRIEF-Royal Bank Of Canada to repurchase up to 30 mln of its common shares "
    },
    {
        "content": "Aug 13 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "08132015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES- Lloyds Bank  Julius Baer  Berenberg Bank "
    },
    {
        "content": "Aug 12 Royal Bank of Canada has hired a new semiconductor investment banker  John McClure  who joins from Intel Corp  according to an internal memo and the banker's LinkedIn page.",
        "date": "08132015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "MOVES-RBC hires new U.S. semiconductor banker from industry "
    },
    {
        "content": "* Latest foreign player to leave Switzerland   (Adds RBC's remaining activities in Switzerland)",
        "date": "07142015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "UPDATE 2-Banque Syz to buy Royal Bank of Canada's Swiss private bank "
    },
    {
        "content": "ZURICH  July 14 Swiss bank Syz & Co said it would buy Royal Bank of Canada's Swiss private bank  including 10 billion Swiss francs  ($10.5 billion) under management  the latest move by a foreign bank to exit Switzerland.",
        "date": "07142015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Banque Syz says will buy Royal Bank of Canada Swiss unit "
    },
    {
        "content": "July 7 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "07072015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES- Goldman Sachs  RSA Insurance  Royal Bank of Canada "
    },
    {
        "content": "TORONTO  July 7 Royal Bank of Canada  said on Tuesday that Doug Guzman  head of global investment banking  has been promoted to group head of wealth management and insurance business.",
        "date": "07072015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC names new head of wealth management and insurance "
    },
    {
        "content": "TORONTO  July 2 Royal Bank of Canada and Bank of Montreal were the top two advisers on Canadian M&A deals in the first half of 2015  a period during which the overall dollar value of deals surged despite a decline in the actual number of transactions.",
        "date": "07022015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "RBC  BMO grab top spots in Canadian M&A adviser rankings "
    },
    {
        "content": "TORONTO  July 2 Royal Bank of Canada was the top adviser on Canadian equity issues in the first half of 2015 as acquisitions and the energy industry's need to strengthen balance sheets fueled record high deal flow  according to data from Thomson Reuters.",
        "date": "07022015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC top adviser on Canadian equity issues in blowout first half "
    },
    {
        "content": "June 23 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06232015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES- HSBC Bank USA  Barclays  RBC  Waypoint Capital  PwC "
    },
    {
        "content": "where assigned  and hit the newskey (F9 on Reuters terminals)",
        "date": "06102015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "New Issue-RBC prices 1.0 bln euro 2022 bond "
    },
    {
        "content": "TORONTO  May 28 Royal Bank of Canada  the country's top lender  posted a stronger-than-expected quarterly profit on Thursday  helped by growth in its domestic banking and capital markets divisions.",
        "date": "05282015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "UPDATE 3-RBC profit tops expectations on domestic banking  capital markets "
    },
    {
        "content": "TORONTO  May 28 Royal Bank of Canada  the country's top lender  posted a rise in quarterly profit on Thursday  helped by strength in its domestic banking and capital markets divisions.",
        "date": "05282015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC second-quarter profit rises on domestic banking  capital markets gains "
    },
    {
        "content": "May 13 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05132015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES- RBC  Tilney Bestinvest  Neuberger Berman "
    },
    {
        "content": "April 23 A U.S. regulator ordered a Royal Bank of Canada unit to pay $1.43 million to resolve charges it sold high-yielding securities known as reverse convertibles without properly assessing whether they were suitable for investors who bought them.",
        "date": "04232015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC fined in U.S. over sale of reverse convertibles "
    },
    {
        "content": "NEW YORK Tom Buck  the Indiana broker who managed $1.2 billion in client assets at Bank of America Merrill Lynch before he was fired last month  has joined Royal Bank of Canada's RBC Wealth Management  an RBC spokeswoman said Friday.",
        "date": "04102015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Ex-Merrill Lynch broker Tom Buck joins RBC "
    },
    {
        "content": "NEW YORK  April 10 Tom Buck  the Indiana broker who managed $1.2 billion in client assets at Bank of America  Merrill Lynch before he was fired last month  has joined Royal Bank of Canada's RBC Wealth Management  an RBC spokeswoman said Friday.",
        "date": "04102015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "UPDATE 1-Ex-Merrill Lynch broker Tom Buck joins RBC "
    },
    {
        "content": "TORONTO  April 10 Technology companies pose a competitive threat to established lenders  the head of Royal Bank of Canada said on Friday  adding he was keen to work with start-ups to improve the company's mobile offerings.",
        "date": "04102015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC CEO says tech firms pose threat  eyes start-up partnerships "
    },
    {
        "content": "TORONTO  April 1 Royal Bank of Canada  said on Wednesday it has entered into a definitive agreement to sell its Suriname operations to Republic Bank Ltd  as it continues to exit some of its marginal operations in the Caribbean region.",
        "date": "04012015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Royal Bank of Canada selling Suriname unit to Republic Bank "
    },
    {
        "content": "March 10 Bank of America Corp's Merrill Lynch unit has hired financial adviser Ronald Slevin and his wealth management team from Royal Bank of Canada for its New York office.",
        "date": "03102015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "UPDATE 1-ON THE MOVE-BofA Merrill Lynch hires adviser from RBC "
    },
    {
        "content": "March 10 Bank of America Corp's Merrill Lynch unit has hired financial adviser Ronald Slevin and his wealth management team from Royal Bank of Canada for its New York office.",
        "date": "03102015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "ON THE MOVE-BofA Merrill Lynch hires adviser from RBC "
    },
    {
        "content": "TORONTO Royal Bank of Canada   the country's top lender  posted a better-than-expected quarterly profit on Wednesday  driven by significant gains in its personal and commercial banking and capital markets businesses.",
        "date": "02252015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "RBC profit tops expectations  lifted by capital markets arm "
    },
    {
        "content": "TORONTO  Feb 25 Royal Bank of Canada  the country's top lender  posted a better-than-expected quarterly profit on Wednesday  driven by significant gains in its personal and commercial banking and capital markets businesses.",
        "date": "02252015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "UPDATE 3-RBC profit tops expectations  lifted by capital markets arm "
    },
    {
        "content": "TORONTO  Feb 25 Canada's main stock index was little changed on Wednesday as gains in Royal Bank of Canada  and Hudson's Bay Co offset a drop in the shares of energy producers as oil prices fell.",
        "date": "02252015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "CANADA STOCKS-TSX steady as RBC  HBC gains offset impact of lower oil "
    },
    {
        "content": "TORONTO  Feb 25 Canada's main stock index opened higher on Wednesday  boosted by gains in Royal Bank of Canada  after the lender reported quarterly results and a surge in Hudson's Bay Co after the retailer entered some real estate joint deals.",
        "date": "02252015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "CANADA STOCKS-TSX opens higher as RBC  Hudson's Bay gain "
    },
    {
        "content": "Feb 25 Royal Bank of Canada  Canada's biggest lender  said quarterly net profit jumped 17 percent  helped by gains at its personal and commercial banking as well as capital markets businesses.",
        "date": "02252015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Canada's RBC reports higher first-quarter profit "
    },
    {
        "content": "Feb 9 Raymond James & Associates  a unit of Raymond James Financial Inc  said it had hired two advisers from Royal Bank of Canada's wealth management division.",
        "date": "02092015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "UPDATE 1-ON THE MOVE-Raymond James unit hires two advisers from RBC "
    },
    {
        "content": "Feb 9 Raymond James & Associates  a unit of Raymond James Financial Inc  said it hired two advisers from Royal Bank of Canada's (RBC) wealth management division.",
        "date": "02092015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "ON THE MOVE-Raymond James unit hires two advisers from RBC "
    },
    {
        "content": "Royal Bank of Canada (RBC) and Canadian Imperial Bank of Commerce (CIBC)  two of Canada's biggest banks  looked at buying U.S. lender Boston Private Bank & Trust Co  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02062015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Canada's RBC  CIBC looked at buying Boston Private Bank: WSJ "
    },
    {
        "content": "Feb 5 Royal Bank of Canada (RBC) and Canadian Imperial Bank of Commerce (CIBC)  two of Canada's biggest banks  looked at buying U.S. lender Boston Private Bank & Trust Co  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02062015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "CORRECTED-Canada's RBC  CIBC looked at buying Boston Private Bank - WSJ "
    },
    {
        "content": "Royal Bank of Canada (RBC)  and Canadian Imperial Bank of Commerce (CIBC)   two of Canada's biggest banks  looked at buying U.S. lender Boston Private Bank & Trust Co  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02052015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Canada's RBC  CIBC looked at buying Boston Private Bank:  WSJ "
    },
    {
        "content": "Feb 5 Royal Bank of Canada (RBC) and Canadian Imperial Bank of Commerce (CIBC)  two of Canada's biggest banks  looked at buying U.S. lender Boston Private Bank & Trust Co  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02052015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Canada's RBC  CIBC looked at buying Boston Private Bank - WSJ "
    },
    {
        "content": "TORONTO Royal Bank of Canada  the country's biggest lender  said on Tuesday it would cut its prime lending rate by 15 basis points  becoming the first of Canada's big banks to trim borrowing costs nearly a week after the central bank stunned markets with a rate cut.",
        "date": "01272015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Canada's RBC and BMO move to cut prime rates "
    },
    {
        "content": "TORONTO  Jan 27 Royal Bank of Canada  the country's biggest lender  said on Tuesday it would cut its prime lending rate by 15 basis points  becoming the first of Canada's big banks to trim borrowing costs nearly a week after the central bank stunned markets with a rate cut.",
        "date": "01272015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "UPDATE 1-Canada's RBC and BMO move to cut prime rates "
    },
    {
        "content": "Jan 27 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01272015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "MOVES- Royal Bank of Canada  Barclays  Franklin Resources "
    },
    {
        "content": "TORONTO  Jan 27 The Royal Bank of Canada  Canada's biggest lender  said on Tuesday it would cut its prime lending rate by 15 basis points  becoming the first of Canada's big banks to trim borrowing costs nearly a week after the central bank stunned markets with a rate cut.",
        "date": "01272015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Royal Bank of Canada first Canadian bank to cut prime rate "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 23 (Fitch) Fitch Ratings has affirmed Royal Bank of Canada's  (RY) Long and Short-term Issuer Default Ratings (IDRs) at 'AA' and 'F1+'  respectively. This affirmation reflects RY's good earnings performance over  multiple operating cycles  strong funding and liquidity position  and adequate  capital ratios.  The Rating Outlook for RY remains Stable.  This rating action follows a periodic review of the Canadian Banking s",
        "date": "01232015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Fitch Affirms Royal Bank of Canada's Ratings at 'AA/F1+'; Outlook Remains Stable "
    },
    {
        "content": "TORONTO Royal Bank of Canada  is pushing deeper into the U.S. wealth management business  saying on Thursday it will buy Los Angeles-based City National Corp  for $5.4 billion in a deal that targets City's stable of high-net worth clients. | Video ",
        "date": "01222015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "Canada's RBC targets U.S. wealthy with $5.4 billion City National deal "
    },
    {
        "content": "TORONTO  Jan 22 Royal Bank of Canada is pushing deeper into the U.S. wealth management business  saying on Thursday it will buy Los Angeles-based City National Corp  for $5.4 billion in a deal that targets City's stable of high-net worth clients.",
        "date": "01222015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "UPDATE 4-Canada's RBC targets U.S. wealthy with $5.4 bln City Nat'l deal "
    },
    {
        "content": "TORONTO Royal Bank of Canada  is in no rush to do more acquisitions now that its $5.4 billion deal for City National Corp  gives it a platform to expand in U.S. wealth management and commercial banking  RBC's chief executive said. | Video ",
        "date": "01222015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC CEO sees no need for big acquisitions after City National deal "
    },
    {
        "content": "NEW YORK U.S. stocks rose to session highs ahead of the close on Thursday after the European Central Bank announced larger than expected measures to stimulate the region's sagging economy.",
        "date": "01222015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Wall St. gains after ECB stimulus move; banks lead "
    },
    {
        "content": "TORONTO Royal Bank of Canada said on Thursday it will buy City National Corp  a U.S. lender serving high net worth clients  in a $5.4 billion deal that marks the latest move by Canada's major banks to expand their wealth management operations abroad.",
        "date": "01222015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "Royal Bank of Canada to buy City National in $5.4 bln deal "
    },
    {
        "content": "Jan 14 RBC Global Asset Management  the asset management division of Royal Bank of Canada  appointed John Donohue managing director and head of liquidity management.",
        "date": "01142015",
        "name": "Royal Bank Of Canada",
        "news_type": "topStory",
        "symbol": "RY",
        "title": "MOVES-John Donohue joins RBC Global as managing director "
    },
    {
        "content": "Jan 22 Royal Bank of Canada  said it would buy City National Corp  a U.S. lender serving high net worth clients  in a cash-and-stock deal valued at $5.4 billion.",
        "date": "01222015",
        "name": "Royal Bank Of Canada",
        "news_type": "normal",
        "symbol": "RY",
        "title": "RBC to buy City National in $5.4 bln deal "
    }
]