[
    {
        "content": "DUBLIN  Nov 17 A German pilots' union has told its members that industrial action against Irish carrier Ryanair is likely to be needed to force management to overhaul the way it negotiates with its staff.",
        "date": "11172017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "German union tells Ryanair pilots industrial action is likely "
    },
    {
        "content": "* third digital innovation hub following Dublin and Wroclaw  part of Ryanair's ambition to become \"Amazon of travel\"",
        "date": "11162017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair to hire 250 people in IT innovation hub in Madrid "
    },
    {
        "content": "DUBLIN Ryanair is to increase the number of pilots it employs directly and hire more staff to respond to their queries as part of a new program to improve its pilot management  according to an internal memo seen by Reuters.",
        "date": "11102017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair launches program to improve pilot management: memo "
    },
    {
        "content": "DUBLIN  Nov 10 Ryanair is to increase the number of pilots it employs directly and hire more staff to respond to their queries as part of a new programme to improve its pilot management  according to an internal memo seen by Reuters.",
        "date": "11102017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair launches programme to improve pilot management - memo "
    },
    {
        "content": "LONDON  Oct 26 A British union is asking Ryanair pilots pushing for better working conditions at the Irish budget airline whether they would be willing to take industrial action.",
        "date": "10262017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "REFILE-UPDATE 1-British union sounds out Ryanair pilots over industrial action "
    },
    {
        "content": "DUBLIN Ryanair  is on course to post record annual profits despite a rostering mess-up that forced it to cancel 20 000 flights  and does not expect problems hiring the pilots to expand by 50 percent in the next six years  it said on Tuesday. | Video ",
        "date": "10312017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair says cancellation fiasco won't stop record profit "
    },
    {
        "content": "* Shares up over 6 percent (Adds CEO comments  updates shares. Attention: Offensive language in paragraph 8)",
        "date": "10312017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Ryanair says cancellation fiasco won't stop record profit "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Twin tailwinds are helping Ryanair to weather its pilot crisis. The 20 billion euro no-frills airline will meet its full-year profit goal  despite a rostering mess that led to the cancellation of thousands of flights. Passenger numbers were up 11 percent to 72.1 million in the six months to Sept. 30  according to Tuesday’s half-year report from the company. Ryanair’s fare cuts helped  but it also got lucky with rivals’ bankruptcies.",
        "date": "10312017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Breakingviews - Twin tailwinds help Ryanair weather pilot crisis "
    },
    {
        "content": "DUBLIN  Oct 24 Ryanair will delay plans forcing non-priority customers to place any second larger carry-on bags in the hold to allow passengers \"more time to familiarise themselves with the changes \" it said on Tuesday.",
        "date": "10242017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair delays plans limiting carry on bags until January "
    },
    {
        "content": "* Pilots' association expects other bases to follow suit (Adds detail  quotes)",
        "date": "10202017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Pilots at Ryanair's largest base reject pay offer "
    },
    {
        "content": "* SAYS RYANAIR  GOOGLE & EDREAMS REACH RESOLUTION OF LEGAL PROCEEDINGS",
        "date": "10192017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-eDreams says Ryanair  Google & eDreams reach resolution of legal proceedings "
    },
    {
        "content": "KUALA LUMPUR Malaysia Airlines' outgoing chief executive Peter Bellew said on Wednesday his decision to leave the airline for Ryanair  was due to a sense of responsibility to his native country.",
        "date": "10182017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "'Love for country' behind move to Ryanair  says Malaysia Airlines' CEO "
    },
    {
        "content": "KUALA LUMPUR  Oct 20 Malaysia Airlines Berhad has appointed Izham Ismail as group chief executive officer designate  replacing Peter Bellew  who quit to join Ryanair after a little more than a year in the job.",
        "date": "10202017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Malaysia Airlines names new CEO after Bellew's abrupt departure "
    },
    {
        "content": "DUBLIN/SINGAPORE Malaysia Airlines CEO Peter Bellew is leaving after just over a year in charge to return to Ryanair  as chief operations officer to tackle the pilot shortages that has resulted in it cancelling more than 20 000 flights over the winter season.",
        "date": "10172017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Malaysia Airlines' CEO to return to Ryanair to help fix pilot problems "
    },
    {
        "content": "KUALA LUMPUR  Oct 18 Malaysia Airlines' outgoing chief executive Peter Bellew said on Wednesday his decision to leave the airline for Ryanair was due to a sense of responsibility to his native country.",
        "date": "10182017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "\"Love for country\" behind move to Ryanair  says Malaysia Airlines' CEO "
    },
    {
        "content": "* Malaysia must hire third CEO in three years (Adds Malaysia Airlines' reaction  analyst's comment)",
        "date": "10172017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Malaysia Airlines' CEO to return to Ryanair to help fix pilot problems "
    },
    {
        "content": "DUBLIN Ryanair's announcement on Tuesday that it had hired Malaysia Airline Chief Executive Peter Bellew was \"unexpected\" the Asian carrier said in a statement  adding that its board would meet to discuss the move.",
        "date": "10172017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Malaysia Airlines says announcement of CEO move to Ryanair 'unexpected' "
    },
    {
        "content": "DUBLIN  Oct 12 Ryanair resisted moves by pilots to unionise on Thursday  after one demanded the Irish airline adopts a new approach to industrial relations.",
        "date": "10122017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair resists pilot call for new industrial relations approach "
    },
    {
        "content": "LONDON  Oct 12 British regional airline Flybe sees high-profile cancellations by Ryanair after a rostering failure as a chance to boost its brand  its CEO told Reuters.",
        "date": "10122017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Flybe eyes Ryanair cancellations to push its flights "
    },
    {
        "content": "DUBLIN  Oct 12 Ryanair will refer rival Lufthansa's 210 million euro ($249 million) deal to buy large parts of insolvent Air Berlin - a process it has previously described as \"a stitch-up\" - to European Union competition authorities.",
        "date": "10122017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair to refer Air Berlin/Lufthansa deal to EU Commission "
    },
    {
        "content": "* Promises to improve pilots' job security (Adds quotes  details of new offer)",
        "date": "10052017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair promises pilots significant improvements in pay  conditions "
    },
    {
        "content": "DUBLIN Ryanair  chief operations officer Michael Hickey will resign from the end of the month  the airline said on Friday  becoming the first executive to leave since a rostering mess-up led to the cancellation of thousands of flights.",
        "date": "10062017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair COO to resign in wake of rostering mess-up "
    },
    {
        "content": "* Monarch becomes biggest UK carrier to go into administration",
        "date": "10022017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 6-Monarch Airlines goes bust  spoiling holiday plans for many Britons "
    },
    {
        "content": "DUBLIN  Oct 5 Ryanair on Thursday promised its pilots significant improvements in pay and conditions  saying it would exceed rates paid by rivals and improve job security  according to a letter to pilots seen by Reuters.",
        "date": "10052017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair promises pilots significant improvements in pay  conditions "
    },
    {
        "content": "ROME Italy's civil aviation authority said on Thursday it was preparing to impose sanctions on Ryanair over its handling of mass cancellations of flights last month.",
        "date": "10052017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Italian regulator says taking action against Ryanair over flight cancellations "
    },
    {
        "content": "* Ryanair says hires 210 new pilots in past 12 weeks (Adds details on cancellations  Hickey resignation)",
        "date": "10062017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair COO to resign in wake of rostering mess-up "
    },
    {
        "content": "* Ryanair seeks to improve relations with pilots (Adds details  quotes)",
        "date": "10062017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Britain's easyJet reports record summer despite tough market "
    },
    {
        "content": "DUBLIN Ryanair  on Thursday promised its pilots significant improvements in pay and conditions  saying it would exceed rates paid by rivals and improve job security  according to a letter to pilots seen by Reuters. | Video ",
        "date": "10062017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair promises pilots significant improvements in pay  conditions "
    },
    {
        "content": "DUBLIN Britain's aviation regulator said on Friday that Ryanair  had \"capitulated\" to pressure to inform passengers hit by flight cancellations of their rights  and would keep pushing the airline to fully compensate them.",
        "date": "09292017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UK regulator says Ryanair 'capitulates' to pressure on passengers' rights "
    },
    {
        "content": "Sept 28 Ryanair  Europe's busiest airline  was warned to deliver \"action  not words\" by British aviation authorities on Thursday after it failed to inform 400 000 customers of their full rights regarding cancelled flights through Christmas.",
        "date": "09282017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "As Ryanair cancellations mount  UK regulator urges 'action  not words' "
    },
    {
        "content": "DUBLIN/BERLIN Ryanair cancelled the flights of another 400 000 customers and scrapped a bid for Alitalia on Wednesday  in a plan to keep its pilots on side and draw a line under its rostering fiasco. | Video ",
        "date": "09272017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Grounded: Ryanair cancels flights of another 400 000 customers "
    },
    {
        "content": "DUBLIN  Sept 29 Britain's aviation regulator has given Ryanair a Friday deadline to inform customers on cancelled flights of their rights to be re-routed on rival airlines and compensated for some out-of-pocket expenses.",
        "date": "09292017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UK regulator gives Ryanair deadline to inform passengers of rights "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Ryanair is living down to its cheapskate reputation. The budget airline is facing irate passengers and an angry regulator after cancelling more than 20 000 flights over the coming seven months. This combination could be an existential threat for most companies. For the Irish carrier  however  indifference to customers is an integral part of its discount offering.",
        "date": "09292017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Breakingviews - Ryanair’s cheapskate reputation is its best asset "
    },
    {
        "content": "* Britain's CAA launches \"enforcement action\" against Ryanair",
        "date": "09272017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Grounded: Ryanair cancels flights of another 400 000 customers "
    },
    {
        "content": "DUBLIN  Sept 27 Ryanair will cancel flights for an additional five months  Europe's busiest airline said on Wednesday  adding \"less than 400 000\" cancellations to cuts that have already impacted the travel plans of more than 300 000 customers.",
        "date": "09272017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair extends flight cancellations  cuts fleet plans  growth forecasts "
    },
    {
        "content": "OSLO U.S. authorities have granted permission to budget airline Norwegian Air Shuttle's British subsidiary to fly to and from U.S. cities  a boost to a company trying to crack the transatlantic market by undercutting established rivals.",
        "date": "09232017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Norwegian Air's UK arm can fly transatlantic  boosting its prospects "
    },
    {
        "content": "DUBLIN/BERLIN Ryanair blames an internal \"cock up\"  but its cancellation of  2 000 flights exposes the struggle that low-cost carriers face as they risk growing faster than their ability to recruit experienced pilots.",
        "date": "09222017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair crisis exposes low-cost scramble for senior pilots "
    },
    {
        "content": "* Airline sparked wave of anger with 2 000 flight cancellations",
        "date": "09212017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Ryanair scrambles to please pilots  customers and investors "
    },
    {
        "content": "NEW YORK  Sept 20 Norwegian Air Shuttle on Wednesday said it was still open to the possibility of a future flight connection agreement with budget carrier Ryanair   just days after the two European rivals ended talks to establish a long-haul flight deal.",
        "date": "09202017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Norwegian Air still open to flight connection deal with Ryanair -CEO "
    },
    {
        "content": "DUBLIN  Sept 19 Ryanair has offered senior pilots who agree to work an additional 10 days a bonus of up to 12 000 euros in a bid to avoid additional passenger disruption after it cancelled more than 2 000 flights over staffing issues.",
        "date": "09192017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair offers pilots bonuses in bid to avoid more cancellations "
    },
    {
        "content": "DUBLIN/OSLO  Sept 18 Budget airlines Ryanair and Norwegian Air Shuttle have halted talks on a flight connection agreement  both companies said on Monday.",
        "date": "09182017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair  Norwegian Air end talks on flight connections "
    },
    {
        "content": "DUBLIN Ryanair boss Michael O'Leary on Thursday scrambled to placate pilots and reassure investors as the airline's annual general meeting was dominated by the cancellation of 2 000 flights in a \"cock-up\" that exposed major staffing issues. | Video ",
        "date": "09212017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair scrambles to please pilots  customers and investors "
    },
    {
        "content": "DUBLIN Ryanair  boss Michael O'Leary admitted on Monday to a \"cock up\" over pilot shortages that led him to cancel flights and disrupt the plans of hundreds of thousands of travelers in his bid to improve the budget airline's punctuality. | Video ",
        "date": "09192017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair CEO takes rap for costly cancellations 'cock up' "
    },
    {
        "content": "OSLO Norwegian Air Shuttle  said on Monday it was no longer discussing a flight connection agreement with Ryanair   after it reached a similar deal with easyJet .",
        "date": "09182017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Norwegian Air no longer in talks on connection deal with Ryanair "
    },
    {
        "content": "DUBLIN  Sept 21 Ryanair will hand pilots at some of its largest bases a 10 000 euro annual pay rise on top of a 12 000 euro bonus offered this week to those who help the airline alleviate a pilot shortage  Chief Executive Michael O'Leary said on Thursday.",
        "date": "09212017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair offers pay rise to some pilots on top of bonus "
    },
    {
        "content": "DUBLIN Ryanair's decision to cancel flights for the next six weeks to cope with a backlog of staff leave would not recur next year but had clearly caused reputational damage  chief executive Michael O'Leary said on Monday.",
        "date": "09182017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair CEO vows damaging cancellation 'mess' will not happen again "
    },
    {
        "content": "NEW YORK Norwegian Air Shuttle  on Wednesday said it was still open to the possibility of a future flight connection agreement with budget carrier Ryanair   just days after the two European rivals ended talks to establish a long-haul flight deal.",
        "date": "09212017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Norwegian Air still open to flight connection deal with Ryanair: CEO "
    },
    {
        "content": "DUBLIN Ryanair  Chief Executive Michael O'Leary said he was sure a series of flight cancellations would not help future bookings at the airline that were till now two percent up on a year ago.",
        "date": "09182017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair CEO says cancellations won't help forward bookings "
    },
    {
        "content": "LONDON  Sept 13 Norwegian Air Shuttle said it is still talking to Ryanair about a flight connection service after Norwegian agreed a partnership with rival easyJet .",
        "date": "09132017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Norwegian Air Shuttle still talking to Ryanair on flight connection deal -CCO "
    },
    {
        "content": "* Expects 20 mln euros in pay-outs  5 mln euros in lost fares",
        "date": "09182017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 6-Ryanair CEO takes rap for costly cancellations \"cock up\" "
    },
    {
        "content": "DUBLIN  Sept 18 Ryanair's decision to cancel flights for the next six weeks to cope with a backlog of staff leave would not recur next year but had clearly caused reputational damage  chief executive Michael O'Leary said on Monday.",
        "date": "09182017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair CEO vows damaging cancellation \"mess\" will not happen again "
    },
    {
        "content": "DUBLIN  Sept 18 Ryanair is preparing for up to 20 million euros in compensation claims after cancelling thousands of flights due to a shortage of staff  a spokeswoman for the Irish budget airline said on Monday.",
        "date": "09182017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair sees 20 million euros in compensation claims for cancelling flights "
    },
    {
        "content": "DUBLIN  Sept 15 Ryanair on Friday announced plans to cancel between 40 and 50 flights per day until the end of October  disrupting hundreds of thousands of journeys  in what it said was a bid to improve its ratio of on-time flights.",
        "date": "09152017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "RPT-Ryanair to cancel up to 50 flights per day 'to improve punctuality' "
    },
    {
        "content": "FRANKFURT  Sept 12 Irish low-cost carrier Ryanair said on Tuesday it would base three more aircraft at Frankfurt airport from summer 2018 to add 34 new routes including Athens  Lisbon and Marseille.",
        "date": "09122017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair adds more planes  routes at Frankfurt airport "
    },
    {
        "content": "LUXEMBOURG/BRUSSELS Ryanair lost an EU court battle on Thursday in which the airline had sought to continue forcing cabin crew based outside Ireland to take their disputes to Irish courts  in a case with implications across the low-cost airline sector. | Video ",
        "date": "09142017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair loses EU court battle to keep Irish law for crew abroad "
    },
    {
        "content": "BRUSSELS Ryanair  has to comply with EU passenger rights  including possible reimbursement and compensation  over its plans to cancel between 40 and 50 flights per day until the end of October  the European Commission said on Monday.",
        "date": "09182017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "EU warns Ryanair on cancellation reimbursement  compensation "
    },
    {
        "content": "OSLO Norwegian Air Shuttle has recruited more than 140 pilots from Irish rival Ryanair in 2017  a spokesman for the Nordic budget carrier said on Monday.",
        "date": "09182017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Norwegian Air says has recruited more than 140 pilots from Ryanair "
    },
    {
        "content": "* Belgian-based crew brought labour dispute before Belgian court",
        "date": "09142017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Ryanair loses EU court battle to keep Irish law for crew abroad "
    },
    {
        "content": "BERLIN Ryanair  is in the process of finalizing a binding offer for Alitalia  which will see it keep the brand  long-haul operations but changing the fleet for short-haul routes  CEO Michael O'Leary said on Thursday.",
        "date": "09142017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair CEO says in process of finalizing Alitalia offer "
    },
    {
        "content": "* says to cut checked-bag fees in bid to reduce delays; says measure will cost 50 million euros per year",
        "date": "09062017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair to cut checked-bag fees in bid to reduce delays "
    },
    {
        "content": "BERLIN  Sept 14 Ryanair is in the process of finalising a binding offer for Alitalia  which will see it keep the brand  long-haul operations but changing the fleet for short-haul routes  CEO Michael O'Leary said on Thursday.",
        "date": "09142017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair CEO says in process of finalising Alitalia offer "
    },
    {
        "content": "LONDON  Aug 31 Ryanair will bid to operate 90 planes under the Alitalia brand and using existing staff as part of the Italian airline's restructuring  Chief Executive Michael O'Leary said on Thursday.",
        "date": "08312017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair to bid to operate 90 Alitalia planes "
    },
    {
        "content": "* Ryanair ceo says will bid for 90 airbus jets from alitalia; thinks bid for entire airline would be blocked on competition grounds (not thinks bid for 90 planes would be blocked)",
        "date": "08312017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-CORRECTED-Ryanair says will bid to operate 90 leased Alitalia planes "
    },
    {
        "content": "Aug 31 Ryanair Holdings Plc Chief Executive Michael O'Leary",
        "date": "08312017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair says will bid to operate 90 leased Alitalia planes "
    },
    {
        "content": "* says expects European Comission to reluctantly intervene over Air Berlin",
        "date": "08312017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair sees EU acting on Air Berlin; Brexit disruption to flights unlikely "
    },
    {
        "content": "BERLIN Ryanair  will not bid for any assets of insolvent German airline Air Berlin   its Chief Executive Michael O'Leary said on Wednesday  describing the process as \"a stitch-up\". | Video ",
        "date": "08302017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Decrying 'stitch-up'  Ryanair won't bid for Air Berlin assets "
    },
    {
        "content": "* Bids for Air Berlin assets due by mid-September (Adds German ministry  union comment in paragraphs 14  15)",
        "date": "08292017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Lufthansa wants Air Berlin long-haul planes - source "
    },
    {
        "content": "* Says has asked regulators to probe insolvency process (Adds context  O'Leary quote)",
        "date": "08302017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Decrying \"stitch-up\"  Ryanair won't bid for Air Berlin assets "
    },
    {
        "content": "DUBLIN Ryanair  is not hopeful that its complaint to competition authorities over plans by Lufthansa  to take over parts of insolvent rival Air Berlin  will halt the deal  its chief commercial officer said on Tuesday.",
        "date": "08292017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair says not hopeful over Air Berlin/Lufthansa antitrust complaint "
    },
    {
        "content": "DUBLIN  Aug 29 Ryanair is interested in some assets belonging to insolvent rival Air Berlin  principally routes  the Irish airline's chief marketing officer said on Tuesday.",
        "date": "08292017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair is interested in some Air Berlin assets  mainly routes "
    },
    {
        "content": "BERLIN  Aug 30 Irish low-cost carrier Ryanair will not make an offer for assets of insolvent German airline Air Berlin  its Chief Executive Michael O'Leary said on Wednesday  citing what he said was an intransparent carve-up process.",
        "date": "08302017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair CEO says won't make offer for Air Berlin assets "
    },
    {
        "content": "DUBLIN  Aug 29 Ryanair is not hopeful that its complaint to competition authorities over plans by Lufthansa to take over parts of insolvent rival Air Berlin will halt the deal  its chief commercial officer said on Tuesday.",
        "date": "08292017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "REFILE-Ryanair says not hopeful over Air Berlin/Lufthansa antitrust complaint "
    },
    {
        "content": "BERLIN Ryanair  sees any plans by Lufthansa  to take over parts of insolvent rival Air Berlin  as a \"conspiracy\" to halt the Irish carrier's expansion  its chief executive told Reuters.",
        "date": "08162017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair CEO hits out at Air Berlin/Lufthansa deal "
    },
    {
        "content": "* German government rejects Ryanair's allegations (Adds additional quotes  comment from EU Commission  lawyer)",
        "date": "08162017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair CEO hits out at Air Berlin/Lufthansa deal "
    },
    {
        "content": "BERLIN Germany on Wednesday rejected accusations by low-cost airline Ryanair  that Air Berlin's  filing for insolvency protection was aimed at preparing the German carrier for a takeover by Lufthansa .",
        "date": "08162017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Germany rejects Ryanair claim that Air Berlin insolvency was staged "
    },
    {
        "content": "LONDON Major disruption to flights between Britain and the European Union from March 2019 is looking increasingly likely as Brexit talks proceed  Ryanair  Chief Executive Michael O'Leary warned on Wednesday. | Video ",
        "date": "08022017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair chief says Brexit threat to UK-EU flights increasing "
    },
    {
        "content": "LONDON  Aug 2 Disruption to flights between Britain and the European Union from March 2019 is becoming more likely as Brexit talks proceed  Ryanair Chief Executive Michael O'Leary said on Wednesday.",
        "date": "08022017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair says Brexit disruption to UK-EU flights more likely "
    },
    {
        "content": "DUBLIN  July 24 Ryanair has bid for Alitalia  but said on Monday it will only pursue it if the struggling airline is restructured and Italian government influence removed.",
        "date": "07242017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair lays down conditions as confirms Alitalia bid "
    },
    {
        "content": "* says considering limiting number of passengers eligible to take second free carry-on bag; says possible only passengers who pay for priority boarding eligible  but no decision yet",
        "date": "07242017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair says considering tightening second free carry-on bag rule "
    },
    {
        "content": "DUBLIN  July 24 Ryanair has held talks with Boeing about its new larger version of the 737 airliner  the MAX 10  but has made clear it would only be interested if the price is lowered  Ryanair Chief Executive Michael O'Leary said on Monday.",
        "date": "07242017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair says in talks with Boeing about possible Max 10 order "
    },
    {
        "content": "DUBLIN  July 24 Irish budget carrier Ryanair has submitted a non-binding bid for struggling Italian airline Alitalia  its chief financial officer said on Monday.",
        "date": "07242017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair has submitted non-binding bid for Alitalia "
    },
    {
        "content": "July 24 Ryanair Chief Financial Officer Neil Sorahan  speaking to Reuters:",
        "date": "07242017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair CFO sees fares down by up to 9 pct in Q2 "
    },
    {
        "content": "BRUSSELS  July 11 Ryanair could speed up share buybacks to comply with European Union ownership laws as a result of Britain leaving the EU  the Irish carrier's chief executive said on Tuesday.",
        "date": "07112017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair's CEO says Brexit may lead to more share buybacks "
    },
    {
        "content": "BERLIN Lufthansa  and Frankfurt airport operator Fraport  have signed a deal on cost savings  meaning Lufthansa will grow its business at its main hub  the two companies said in a joint statement on Wednesday.",
        "date": "07052017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Lufthansa  Fraport sign deal on cost savings after Ryanair row "
    },
    {
        "content": "DUBLIN Irish low-cost airline Ryanair  has canceled plans to start flying to Ukraine  saying on Monday that the main airport in Kiev had not honored terms agreed earlier this year.",
        "date": "07102017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair cancels plan to start flights to Ukraine "
    },
    {
        "content": "ROME  June 27 Ryanair would seek a majority stake in Alitalia if it decides to invest in the loss-making Italian airline  its chief executive said during a visit to Rome on Tuesday.",
        "date": "06272017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair would want majority stake if opts to bid for Alitalia "
    },
    {
        "content": "* Announced purchase of 10 more Boeing 737 max 200 aircraft  5 of which will deliver in first half of 2019  with second 5 delivering in first half of 2020",
        "date": "06202017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair buys 10 Boeing 737 max 200 aircrafts for over $1.1 bln "
    },
    {
        "content": "PARIS  June 16 Budget carrier Norwegian Air Shuttle hopes to have deal set up with either easyJet or Ryanair this year that would bring short-haul passengers to its long-haul network.",
        "date": "06162017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "AIRSHOW-Norwegian eyes flight pact with easyJet or Ryanair this year "
    },
    {
        "content": "PARIS/DUBLIN European low-cost airline Ryanair  is in talks with Boeing  about placing an order for its proposed new 737 MAX 10 airliner  two people familiar with the matter said on Tuesday.",
        "date": "06132017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair in talks with Boeing over new version of 737 - sources "
    },
    {
        "content": "DUBLIN Ryanair  announced a record annual profit on Tuesday in a vindication of its strategy of cutting fares to boost market share  and said it would turn up the heat further on rivals. | Video ",
        "date": "05302017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair looks to cut fares and expand after record profit "
    },
    {
        "content": "* To target Air Berlin  Alitalia (Recasts with CEO quotes  details on costs)",
        "date": "05302017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Ryanair looks to cut fares and expand after record profit "
    },
    {
        "content": "LONDON/BERLIN British Airways  must turn its attention to repairing its brand after a weekend of chaos and criticism caused by a major IT outage that grounded flights from London's two main airports.",
        "date": "05302017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "With flights back in the skies  British Airways must now repair damaged reputation "
    },
    {
        "content": "May 30 Ryanair Chief Financial Officer Neil Sorahan:",
        "date": "05302017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair CFO says 'a little less optimistic' than rivals on summer fare levels "
    },
    {
        "content": "* says expects FY results to be in line with current guidance",
        "date": "05242017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair CEO says expects FY results to be in line with current guidance "
    },
    {
        "content": "* Several rivals have declared interest in routes  not Alitalia (Adds quotes  background)",
        "date": "05232017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair says wants to take Alitalia routes  not buy airline "
    },
    {
        "content": "BRUSSELS  May 23 Ryanair could deploy up to 30 planes to Italy at short notice if Alitalia collapses or is forced to slash capacity as part of restructuring  the chief executive of the Irish airline Michael O'Leary said on Tuesday.",
        "date": "05232017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair could deploy up to 30 planes to Italy if Alitalia cuts services "
    },
    {
        "content": "LONDON  April 6 Ryanair will start offering connecting flights later this month  a senior executive said on Thursday  marking a break from its traditional point-to-point model as it looks to appeal to a broader spread of customers.",
        "date": "04062017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair to offer flight transfers in bid for wider appeal "
    },
    {
        "content": "LONDON  April 6 Ryanair  Europe's largest airline by passenger numbers  plans to pivot its growth away from Britain over the next two years as the country negotiates its exit from the European Union  its finance director said on Thursday.",
        "date": "04062017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair to pivot growth away from UK for next 2 years due to Brexit "
    },
    {
        "content": "BERLIN Airlines need Britain to hurry up with plans for aviation following its vote to leave the European Union  because the deadline for preparing flight schedules in a post-Brexit Europe is fast approaching  a Ryanair executive said on Friday.",
        "date": "03102017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Airlines demand clarity from Britain on post-Brexit flying "
    },
    {
        "content": "* Lufthansa considers offering budget flights from Frankfurt   (Adds CEO comments)",
        "date": "02282017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair steps up Frankfurt expansion "
    },
    {
        "content": "BERLIN  Feb 28 Irish low cost carrier Ryanair  ramped up expansion from Frankfurt airport  announcing 20 new routes and saying it will base seven planes there in a further challenge to Lufthansa at its home base.",
        "date": "02282017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair deepens push into Frankfurt airport with new routes "
    },
    {
        "content": "* Market will continue to be challenging-CEO O'Leary   (Adds comments on fare outlook for coming year)",
        "date": "02062017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Ryanair says profits on track as fares continue to fall "
    },
    {
        "content": "LONDON  Feb 8 (IFR) - Ryanair capitalised on favourable rates to raise \u007f750m in the bond market on Wednesday after CEO Michael O'Leary announced profit losses and a challenged outlook ahead of Brexit.",
        "date": "02082017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair to land new bond despite Brexit headwinds "
    },
    {
        "content": "BRUSSELS  Feb 8 Ryanair would be happy to buy jets from Airbus  breaking with its all-Boeing  fleet  but only if the price were right  chief executive Michael O'Leary said on Wednesday.",
        "date": "02082017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair CEO says would be happy to buy Airbus at right price "
    },
    {
        "content": "BERLIN Lufthansa's budget unit Eurowings is studying whether it can start flying from Frankfurt airport from summer 2018  as the airline group battles Ryanair's growth in its home market.",
        "date": "02022017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Eurowings eyes Frankfurt flights from summer 2018 "
    },
    {
        "content": "BERLIN  Jan 30 The German cartel office on Monday approved plans by Lufthansa to lease 38 crewed planes from smaller rival Air Berlin  a deal which had drawn criticism from rival Ryanair.",
        "date": "01302017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Lufthansa deal to lease Air Berlin planes approved by German watchdog "
    },
    {
        "content": "* Exec says costs to fall this year   (Recasts with Frankfurt plans  adds comments on load factors)",
        "date": "02022017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Eurowings eyes Frankfurt flights from summer 2018 "
    },
    {
        "content": "DUBLIN Ryanair  is in talks about providing connecting flights to AlItalia's long-haul services and has raised objections with German authorities about a Lufthansa-Air Berlin tie-up  as it tries to ease its expansion in continental Europe.",
        "date": "01252017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair in cooperation talks with AlItalia  to fight Lufthansa deal "
    },
    {
        "content": "DUBLIN Ryanair  is planning for major disruption in its business as a result of Brexit including the outside possibility it may have to move its entire UK fleet to continental Europe  Chief Executive Michael O'Leary told Reuters in an interview.",
        "date": "01252017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair CEO says Brexit contingencies include 'Armageddon' scenario "
    },
    {
        "content": "* Lufthansa's 109.7 mln passengers in 2016 below Ryanair's 117 mln",
        "date": "01102017",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-RPT-Ryanair seizes Lufthansa's crown as Europe's biggest airline by passengers "
    },
    {
        "content": "* Lufthansa's 109.7 mln passengers in 2016 below Ryanair's 117 mln",
        "date": "01102017",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair seizes Lufthansa's crown as Europe's biggest airline by passengers "
    },
    {
        "content": "BRUSSELS  Nov 11 EU state aid regulators ordered Irish budget airline Ryanair and German travel company TUI's unit TUIfly to repay millions of euros in illegal aid given by an Austrian airport.",
        "date": "11112016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "EU orders Ryanair  TUIfly to repay illegal Austrian airport aid "
    },
    {
        "content": "* Ryanair says to fight EU ruling  TUI to consider steps   (Adds TUI comment)",
        "date": "11112016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 2-EU orders Ryanair  TUIfly to repay illegal Austrian airport aid "
    },
    {
        "content": "DUBLIN Budget airline Ryanair raised its long-term passenger growth forecast by 10 percent on Monday to 200 million travelers a year by 2024  saying it planned to take advantage as intense fare competition forces higher-cost rivals to retrench. | Video ",
        "date": "11072016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair lifts passenger growth forecast as price war hits rivals "
    },
    {
        "content": "* says targeting Europe short-haul market share of up to 25 percent by 2024  depending on market size",
        "date": "11072016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair CEO says could reach 25 percent market share in Europe "
    },
    {
        "content": "* Announces share buyback of 550 mln euros   (Adds share price up 6 pct; non-fuel costs falling)",
        "date": "11072016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Ryanair lifts passenger growth forecast as price war hits rivals "
    },
    {
        "content": "FRANKFURT/PARIS  Nov 2 Irish low-cost carrier Ryanair aims to strike a deal next year to offer another airline transfer flights for long-haul connections  in what could shake up the hub model at airlines.",
        "date": "11022016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair aims for deal on long-haul feeder flights in 2017 "
    },
    {
        "content": "* Lufthansa shares flat  outperform blue chips   (Recasts with Ryanair and Frankfurt announcement)",
        "date": "11022016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Lufthansa  Ryanair face off in Frankfurt battle "
    },
    {
        "content": "* Ryanair has been expanding in Germany   (Adds more details  FAZ report)",
        "date": "11012016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair steps up Lufthansa challenge with flights from Frankfurt - source "
    },
    {
        "content": "FRANKFURT  Nov 2 Ryanair said on Wednesday it hoped to step up the number of flights it offers from Frankfurt airport in the winter of next year.",
        "date": "11022016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair eyes more flights from Frankfurt airport "
    },
    {
        "content": "FRANKFURT  Nov 2 Irish low cost carrier Ryanair  will start flying from Frankfurt airport to tourist destinations in Spain and Portugal  the airline and airport operator Fraport said on Wednesday.",
        "date": "11022016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair to fly from Frankfurt to Spain  Portugal from end-March "
    },
    {
        "content": "* Average fares to fall by as much as 15 pct   (Updates with share price rise; CEO quotes on growth opportunities)",
        "date": "10182016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Ryanair cuts profit forecast but says demand growing "
    },
    {
        "content": "* chief executive says doesn't see extra aircraft available in 2017 on new or second-hand markets  but would be open to taking on more aircraft in 2018 or 2019",
        "date": "10182016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair says may consider extra aircraft in 2018  2019 "
    },
    {
        "content": "* Eurowings expansion to help Lufthansa battle Ryanair  easyJet",
        "date": "09292016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Lufthansa shares knocked by Eurowings expansion deals "
    },
    {
        "content": "* Says to boost Italy operations after government reverses municipal tax increase  plans 10 pct growth in Italy in 2017",
        "date": "08172016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair to boost Italy operations after government tax move "
    },
    {
        "content": "* 'Significant downside risks' later in year   (Adds details of plans to move capacity from UK  plans to return cash to shareholders)",
        "date": "07252016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Ryanair sees record profits despite Brexit as it shifts planes from UK "
    },
    {
        "content": "DUBLIN  July 25 Low-cost giant Ryanair  remains on track for a record  profit this year  it said on Monday  dodging turbulence caused by Britain's vote to leave the European Union thanks to pre-referendum bookings and high exposure to continental Europe.",
        "date": "07252016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "CORRECTED-UPDATE 2-Ryanair shrugs off Brexit turbulence to promise record profits "
    },
    {
        "content": "* CEO says  sees 'similar level of shareholder return' in 2017 to this year's 'nearly 1 billion'",
        "date": "07252016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair CEO expects to return approx 1 bln euros to shareholders in 2017 "
    },
    {
        "content": "* CEO says reasonable to expect that Ryanair will exercise options on Boeing 737 Max aircraft",
        "date": "07252016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair sees 2 mln fewer London passengers next year due to Brexit "
    },
    {
        "content": "LONDON  July 25 European stocks rose on Monday  with low-cost airline Ryanair climbing after it issued a bullish outlook while shares in William Hill surged on bid interest from its rivals.",
        "date": "07252016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "European shares advance as Ryanair and William Hill surge "
    },
    {
        "content": "July 7 Britain's FTSE 100 index is seen opening up by 66-72 points  or 1-1.1 percent  on Thursday  according to spreadbetters at CMC and IG  with futures up 0.85 percent ahead of the cash market open.",
        "date": "07072016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-UK Stocks-Factors to watch on July 7 "
    },
    {
        "content": "July 7 Britain's FTSE 100 index is seen opening up by 66-72 points  or 1-1.1 percent  on Thursday  according to spreadbetters at CMC and IG.           * The UK blue chip index closed down 1.3 percent on Wednesday led lower by retail and property-related stocks  which extended losses made after Britons voted to leave the European Union  and by a decline in energy stocks as oil prices slipped.      * BARCLAYS: The U.S. Commodity Futures Trading Commission ordered Barclays Plc to pay $5",
        "date": "07072016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UK Stocks-Factors to watch on July 7 "
    },
    {
        "content": "* Ryanair to hold EGM on Wed 27 July board seeks approval to consider further share buybacks",
        "date": "07012016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair seeks investor approval to consider further share buybacks "
    },
    {
        "content": " ",
        "date": "06242016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "European airlines slump on Brexit vote  IAG warns on profit "
    },
    {
        "content": " ",
        "date": "06212016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair cofounder says budget travel coming to Argentina -report "
    },
    {
        "content": "BERLIN  June 9 Ryanair is to take on Airbnb by offering private rooms and homes on its website  its latest bid to boost revenues by selling directly to the tens of millions of budget-conscious consumers who use its website.",
        "date": "06092016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair to challenge Airbnb with private room rentals "
    },
    {
        "content": "* to launch new low price accommodation offer \"Ryanair Rooms\"",
        "date": "06092016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair to offer hostels  independent homestays via web site "
    },
    {
        "content": "* Ryanair Chief Commercial officer David O'Brien tells a news conference the airline will cut back on flights to Norway after new air fare tax was imposed on June 1",
        "date": "06012016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair says to cut Norway flights by 50 pct after new air fare tax "
    },
    {
        "content": "DUBLIN  May 23 Ryanair  Europe's largest low-cost airline  is prepared for a fare war to break out later this year and will cut its own fares sharply to increase its market share to sustain profits  it said on Monday.",
        "date": "05232016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "REFILE-UPDATE 3-Ryanair says to cut prices sharply as European fare war looms "
    },
    {
        "content": "DUBLIN  May 18 Howard Millar  one of the main architects of the rise of Europe's largest budget carrier Ryanair  joined aircraft lessor the Stellwagen Group on Wednesday to head up a subsidiary that aims to raise $1 billion this year  the company said.",
        "date": "05182016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "MOVES-Ex-Ryanair finance chief joins Irish aircraft leasing group "
    },
    {
        "content": "* CEO O'Leary says if there was a surprise on average fares 'it may be to the downside' - video presentation",
        "date": "05232016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair CEO says fares could fall even more than forecast "
    },
    {
        "content": "DUBLIN  May 23 Budget carrier Ryanair Holdings PLC said on Monday it plans to cut fares by 7 percent on average this fiscal year to bolster its market share as intensifying competition hits Europe's airline business.",
        "date": "05232016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair to cut fares by 7 pct on average this fiscal year as competition grows "
    },
    {
        "content": "STANSTED  England  May 16 Ryanair could cut the amount it invests in Britain if the country votes to leave the European Union in next month's referendum  Chief Executive Michael O'Leary said on Monday.",
        "date": "05162016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair to cut investment in Britain if it leaves EU-O'Leary "
    },
    {
        "content": "* Low cost airlines benefitted from liberalisation in EU   (Adds comment from KPMG  easyJet background)",
        "date": "05132016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Ryanair would cut investment in UK if it leaves EU "
    },
    {
        "content": "* Rolling annual traffic to april grew 17 pct to 107.4 mln customers  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "05042016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair April traffic grows 10 pct "
    },
    {
        "content": "DUBLIN  April 12 Ryanair is to launch its first loyalty scheme in decades  introduce customer satisfaction surveys and allow \"one-tap\" upgrades using mobile phones as it extends its efforts to rid itself of a reputation for poor service.",
        "date": "04122016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair extends charm offensive with loyalty rewards  one-tap upgrades "
    },
    {
        "content": "BERLIN  March 9 Lufthansa's low-cost unit Eurowings will not make a decision on expanding its long-haul fleet until it manages to stabilise an operation that has been beset by delays  a Lufthansa executive said on Wednesday.",
        "date": "03092016",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Eurowings holds long-haul expansion after initial delays "
    },
    {
        "content": "BERLIN  March 11 Ryanair  Europe's largest low-cost carrier  is capturing market share quicker than expected in Germany  an executive told Reuters on Friday.",
        "date": "03112016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair says German market share push ahead of plan "
    },
    {
        "content": "LONDON  Feb 9 British Airways said it would begin flying from Stansted Airport  establishing a presence at London's No.3 airport for the first time and bringing it into direct competition with budget carrier Ryanair on leisure routes.",
        "date": "02092016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BA goes head to head with Ryanair with new Stansted routes "
    },
    {
        "content": "* Load factor rises 5 percentage points to 88 percent  Further company coverage:    (Reporting By Conor Humphries)",
        "date": "02042016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair January traffic grows 25 pct to 7.5 million "
    },
    {
        "content": "VENICE  Italy  Feb 2 British low-cost airline easyJet said it would trial a new fuel cell system on planes that could cut its fuel bill by up to $35 million a year  as part of its battle to keep fares low and compete against Ryanair.",
        "date": "02022016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "easyJet to trial plane with fuel cells to help cut costs "
    },
    {
        "content": "* Says hopes to reduce volume of U.S. held stock   (Adds detail of share buyback programme  updates share price)",
        "date": "02012016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Ryanair says falling fares won't hit profit  announces record buyback "
    },
    {
        "content": "* CFO says \"likely we will exercise all\" 100 options on Boeing 737 max in addition to 100 firm orders  Further company coverage:    (Reporting By Conor Humphries)",
        "date": "01192016",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair says will likely exercise all 100 options on 737 Max order "
    },
    {
        "content": "* Ryanair November traffic grows 21 pct to 7.71 million customers",
        "date": "12032015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair traffic rises 21 pct in November "
    },
    {
        "content": "Ryanair has launched legal proceedings against Google and online travel agent eDreams  in the Irish High Court over what it says are misleading adverts for Ryanair flights  the airline said on Tuesday.",
        "date": "12012015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair to sue Google in Irish court over 'misleading adverts' "
    },
    {
        "content": "LONDON  Dec 1 Ryanair has launched legal proceedings against Google and online travel agent eDreams in the Irish High Court over what it says are misleading adverts for Ryanair flights  the airline said on Tuesday.",
        "date": "12012015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair to sue Google in Irish court over 'misleading adverts' "
    },
    {
        "content": "* Ceo says has been some softness in pricing since Paris attacks  but nothing material",
        "date": "12012015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair says some pricing weakness after Paris attacks  but nothing material "
    },
    {
        "content": "* Ryanair launches High Court action on behalf of consumers to prevent eDreams and Google deceiving consumers with misleading adverts and false prices",
        "date": "12012015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair says takes legal case against eDreams and Google "
    },
    {
        "content": "DUBLIN Ryanair  nudged up its annual profit forecast on Monday after a \"bumper summer\"  saying fuller planes would take profits to the upper end of its previously estimated range.",
        "date": "11022015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair lifts profit forecast  looks forward to fare wars "
    },
    {
        "content": "* Shares up 2.2 percent after initial falls   (Adds shares up after investor call; CEO quotes)",
        "date": "11022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Ryanair lifts profit forecast  looks forward to fare wars "
    },
    {
        "content": "* Ryanair oct traffic grows 15% to 9.68m customers  Source text for Eikon:  Further company coverage:    (Reporting By UK Bureau)",
        "date": "11042015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair traffic rises 15 pct in October "
    },
    {
        "content": "* Shares up 3 percent after investor call in which ceo said Q4 fares  passenger numbers may beat forecasts  Further company coverage:    (Reporting By Conor Humphries)",
        "date": "11022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair shares up 3 percent after investor call "
    },
    {
        "content": "* CEO tells analyst call that pricing in Q4 may be a little better than the forecast of -4 percent y/y",
        "date": "11022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair CEO says Q4 pricing  passenger numbers may beat forecasts "
    },
    {
        "content": "MILAN  Nov 2 European shares opened lower on Monday  tracking losses in Asia  as weak Chinese factory surveys fuelled global growth concerns  with Electrolux and Ryanair among the main losers.",
        "date": "11022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "European shares open lower on weak China data "
    },
    {
        "content": "* Shares open down 4.4 percent after Q2 results  but recover to -1.9 percent at 0802 GMT   Further company coverage:    (Reporting By Conor Humphries)",
        "date": "11022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair shares down 2 percent after Q2 results "
    },
    {
        "content": "* CFO says after 400 million euro share buyback and 398 million eur Aer Lingus distribution \"that is it for the year\" in terms of returning cash to shareholders  Further company coverage:    (Reporting By Conor Humphries)",
        "date": "11022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair CFO says no more cash to be returned to shareholders this year "
    },
    {
        "content": "DUBLIN  Nov 2 Ryanair on Monday said it expects to post annual profits at the upper end of its forecast range as fuller-than-expected planes lift passenger numbers.",
        "date": "11022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair lifts profit forecast to upper end of range on fuller planes "
    },
    {
        "content": "* Aer Lingus to fly three new U.S Routes  more in 2017   (Adds transatlantic expansion  IAG CEO quotes)",
        "date": "10212015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Aer Lingus says agreement on Ryanair connections possible by next year "
    },
    {
        "content": "* Rolling annual traffic to sept. Grew 16% to 97.3m customers.  Further company coverage:    (Reporting By Conor Humphries)",
        "date": "10052015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair September traffic up 12 percent from last year "
    },
    {
        "content": "* Supreme court of Spain rejected cassation appeal motion by Ryanair against online travel agency Rumbo  a Spanish subsidiary of the group  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "09302015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-lastminute.com says supreme court of Spain rejects cassation appeal motion by Ryanair against Rumbo "
    },
    {
        "content": "DUBLIN  Sept 24 Ryanair is to distribute the 398 million euros ($445 million) it earned from the sale of its 30 percent stake in Aer Lingus to shareholders before the end of the year  the airline said on Thursday.",
        "date": "09242015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair to distribute Aer Lingus sale proceeds to shareholders "
    },
    {
        "content": "ESSEN  Germany  Sept 17 Ryanair expects to be operating one-in-four European short-haul flights within the next 8-10 years  driven by expansion in countries such as Germany where it is moving in to take advantage of retrenching by rivals  its chief executive said.",
        "date": "09172015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair targets quarter of European traffic within decade "
    },
    {
        "content": "LONDON  Sept 9 European shares climbed for a third session to a two-week high on Wednesday  with miners tracking a rally in metals prices on expectations that the world's top consumer  China  would take further steps to boost its economy.",
        "date": "09092015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "European shares hit two-week high  miners boost "
    },
    {
        "content": "* Shares up 10 percent at all-time high   (Rewrites first paragraph  adds comment from management and analysts  also adds background and updates shares)",
        "date": "09092015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Ryanair hikes profit forecast after eclipsing rivals in bumper summer "
    },
    {
        "content": "LONDON  Sept 9 European shares climbed for a third session to a two-week high on Wednesday  with miners tracking a sharp rally in metals prices on expectations that world's top consumer  China  would take further steps to boost its economy.",
        "date": "09092015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Miners boost European shares to two-week highs "
    },
    {
        "content": "LONDON  Sept 9 European shares climbed for a third straight session to a two-week high on Wednesday  with miners tracking a sharp rally in metals prices on expectations that world's top metals consumer  China  would take further steps to boost its economy.",
        "date": "09092015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Rally in miners helps European shares hit two-week high "
    },
    {
        "content": "LONDON  Sept 9 European shares got a boost from a rally in Ryanair shares on Wednesday  which hit an all-time high after the airline lifted its full-year profit forecast by 25 percent.",
        "date": "09092015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "European shares boosted by Ryanair after profit forecast hike "
    },
    {
        "content": "LONDON  Sept 9 European shares rose on Wednesday  boosted by a rally in shares of Ryanair  which hit an all-time high after it lifted its full-year profit forecast.",
        "date": "09092015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "European shares rise  lifted by Ryanair after profit forecast hike "
    },
    {
        "content": "* Shares open up 10 percent after increases FY net profit forecast by 25 percent   Further company coverage:    (Reporting By Conor Humphries)",
        "date": "09092015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair shares soar 10 pct to record high after profit upgrade "
    },
    {
        "content": "DUBLIN  Sept 9 Ryanair hiked its annual profit forecast by 25 percent on Wednesday after its summer performance was boosted by bad weather in northern Europe and the strength of the British pound.",
        "date": "09092015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair hikes annual profit forecast by 25 pct after strong summer "
    },
    {
        "content": "* Ryanair August traffic grows 10 pct to 10.4 million customers",
        "date": "09022015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair says August traffic grows 10 pct "
    },
    {
        "content": "LONDON  Aug 25 Low-cost airline Ryanair  launched a car hire partnership with online brokerage CarTrawler on Tuesday  replacing a long-running deal with Hertz as part of its plan to take on online travel companies.",
        "date": "08252015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair chooses Ireland's CarTrawler as Hertz replacement "
    },
    {
        "content": "DUBLIN  Aug 11 Ryanair aims to take on the online travel companies with a new website that will offer its 100 million annual passengers flight price comparisons  cheap hotel rooms and location-sensitive restaurant discounts  its chief executive said.",
        "date": "08112015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "REFILE-Ryanair's CEO aims to eclipse Skyscanner  Booking.com with new website "
    },
    {
        "content": "DUBLIN  Aug 10 Ryanair is in talks with International Airlines Group and Aer Lingus  and Portugal's TAP about providing feeder flights to rivals' long-haul services for the first time  Chief Executive Michael O'Leary told Reuters on Monday.",
        "date": "08102015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "RPT-Ryanair in talks on feeding long-haul flights for first time "
    },
    {
        "content": "DUBLIN  Aug 10 Ryanair is in talks with International Airlines Group and Aer Lingus  and Portugal's TAP about providing feeder flights to rivals' long-haul services for the first time  Chief Executive Michael O'Leary told Reuters on Monday.",
        "date": "08102015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair in talks with IAG  Aer Lingus on feeding long haul flights "
    },
    {
        "content": "* July load factor rose 4 pct points to 95 pct  July rolling annual traffic to July grew 15 pct to 95.3m customers.  Source text for Eikon:  Further company coverage:",
        "date": "08052015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair says July traffic up 11 pct to 10.1m customers "
    },
    {
        "content": "* Etihad took 49 percent stake of Alitalia  promising turnaround   (Adds Ryanair statement  ownership structure of ADR)",
        "date": "07302015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Rome's Fiumicino - How unlucky can an airport be? "
    },
    {
        "content": "* Keeps to 2015 underlying profit forecast of over 1.5 bln euros   (Recasts with comments on competition in Germany)",
        "date": "07302015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 4-Lufthansa braces for battle with budget rivals in home market "
    },
    {
        "content": "* Says FY profit to be at upper end of range   (Adds details of fare cuts  Lufthansa move to low-cost style fares)",
        "date": "07272015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Ryanair to target rivals with aggressive winter fare cuts "
    },
    {
        "content": "* CFO says loss of revenue due to lack of car hire partner 'wont be hugely material'; expects to have replacement for Hertz  by Oct 1",
        "date": "07272015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair asks rivals to help cut out price-comparison sites "
    },
    {
        "content": "DUBLIN  July 27 Ryanair boosted its passenger target for the year on Monday and said its full-year profit would be at the higher end of its earlier guidance on strong summer bookings.",
        "date": "07272015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair sees full-year profit at higher end of forecast range "
    },
    {
        "content": "LONDON  July 16 British Airways-owner IAG's  takeover of Aer Lingus moved closer on Thursday as the U.S. regulator gave its approval and the Irish carrier's shareholders backed special resolutions linked to the deal.",
        "date": "07162015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-IAG extends offer for Aer Lingus as final conditions ticked off "
    },
    {
        "content": "BRUSSELS Ryanair  will bid for the slots IAG  has agreed to release at London's Gatwick airport as a condition of its takeover of Aer Lingus   Ryanair Chief Executive Michael O'Leary said on Wednesday.",
        "date": "07152015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair to bid for IAG slots at London's Gatwick "
    },
    {
        "content": "BRUSSELS  July 15 Ryanair will bid for the slots IAG has agreed to release at London's Gatwick airport as a condition of its takeover of Aer Lingus  Ryanair Chief Executive Michael O'Leary said on Wednesday.",
        "date": "07152015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Ryanair to bid for IAG slots at London's Gatwick "
    },
    {
        "content": "July 10 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "07102015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "LONDON  July 10 Britain's top share index climbed to its highest level in more than a week on Friday after Greece presented a tough reform package in its bid to seal a debt agreement  with energy and insurance stocks featuring among top gainers.",
        "date": "07102015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Britain's FTSE sets one-week high on Greece hopes  insurers up "
    },
    {
        "content": "July 8 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "07082015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "DUBLIN/BRUSSELS IAG  is set to complete its takeover of Aer Lingus  after Ryanair  said it would accept the offer and a source familiar with the matter told Reuters the British Airways-owner would gain conditional EU approval.",
        "date": "07102015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "IAG set to take over Aer Lingus after Ryanair  EU backing "
    },
    {
        "content": "COPENHAGEN  July 8 Danish trade unions have said they would launch action at airports from which Ryanair  flies that would effectively stop its services after  they said  the low-cost Irish airline refused to sign up to national collective agreements.",
        "date": "07082015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Danish unions vow action against Ryanair after talks fail "
    },
    {
        "content": "* Shares in IAG  Aer Lingus and Ryanair all rise   (Adds background on IAG strategy  updates shares)",
        "date": "07102015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 3-IAG set to take over Aer Lingus after Ryanair  EU backing "
    },
    {
        "content": "LONDON  July 10 Britain's top share index climbed to its highest level in more than a week on Friday after Greece presented a tough reform package in its bid to seal a debt agreement  with energy and insurance stocks featuring among top gainers.",
        "date": "07102015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "FTSE hits one-week high on Greece hopes  insurers rally "
    },
    {
        "content": "LONDON  July 10 Britain's top share index rose on Friday but lagged behind euro zone shares after Athens submitted fresh reform proposals to its creditors  offering a glimmer of hope for some kind of progress over Greece's debt crisis.",
        "date": "07102015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Britain's FTSE boosted by Greece  IHG and IAG deal talk "
    },
    {
        "content": "LONDON  July 10 Budget airline Ryanair  said it would accept IAG's offer for its stake in Aer Lingus  paving the way for the British Airways-owner's 1.3 billion euro takeover of the Irish carrier to go ahead.",
        "date": "07102015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair plans to accept IAG offer for Aer Lingus "
    },
    {
        "content": "* Many online suppliers handle payment from single European centre",
        "date": "06302015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Capital controls mean Greeks can click  but not buy "
    },
    {
        "content": "* Hertz says will pursue case vigorously through the courts   (Adds Hertz statement)",
        "date": "07022015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Ryanair says to take legal action after Hertz ends partnership "
    },
    {
        "content": "DUBLIN Europe's largest low-cost carrier Ryanair  will allow Greek customers to pay with cash after capital controls caused problems with credit card payments on its web site.",
        "date": "06302015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair to allow Greek customers to pay cash "
    },
    {
        "content": "* Rolling annual traffic to June grew 14 pct to 94.3 mln customers  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +44 207 542 1810)",
        "date": "07022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair June traffic grows 14 pct "
    },
    {
        "content": "* Many online suppliers handle payment from single European centre",
        "date": "06302015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Capital controls mean Greeks can click  but not buy "
    },
    {
        "content": "DUBLIN Ryanair  is unlikely to agree to sell its 30 percent stake in Irish airline Aer Lingus  until after an European Union competition probe that could take months  Chief Executive Michael O'Leary told Reuters on Thursday.",
        "date": "06112015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair won't move on Aer Lingus sale until after EU probe "
    },
    {
        "content": "DUBLIN  June 11 Britain's competition watchdog has told Ryanair in a final ruling to cut its 30 percent stake in Aer Lingus  potentially making it easier for British Airways-owner IAG to take over the airline.",
        "date": "06112015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 1-Competition watchdog tells Ryanair to cut Aer Lingus stake "
    },
    {
        "content": "DUBLIN Britain's competition watchdog has told Ryanair in a final ruling to cut its 30 percent stake in Aer Lingus  potentially making it easier for British Airways-owner IAG to take over the airline.",
        "date": "06112015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Competition watchdog tells Ryanair to cut Aer Lingus stake "
    },
    {
        "content": "* Rolling annual traffic to May grew 13 pct to 93.1 mln customers  Source text for Eikon:  Further company coverage:",
        "date": "06032015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair May traffic rises 16 pct "
    },
    {
        "content": "LONDON After securing approval of the Irish government for its takeover offer for Aer Lingus   British Airways-owner IAG  must now seek the backing of the Irish airline's other major shareholder  Ryanair   to seal the deal.",
        "date": "05272015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Focus turns to Ryanair as IAG looks to seal Aer Lingus deal "
    },
    {
        "content": "* Aer Lingus shares up 1.7 pct  IAG up 0.5 pct   (Adds more IAG CEO comments  updates shares)",
        "date": "05272015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Focus turns to Ryanair as IAG looks to seal Aer Lingus deal "
    },
    {
        "content": "DUBLIN The chief executive of British Airways owner IAG  on Wednesday ruled out any increase in the price offered for Aer Lingus  shares to convince 30-percent shareholder Ryanair  to back the deal.",
        "date": "05272015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "IAG says will not increase Aer Lingus share price offer "
    },
    {
        "content": "* Unions say deal is bad for workers   (Adds share prices  analyst comment)",
        "date": "05272015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 6-Irish government backs sale of Aer Lingus to IAG "
    },
    {
        "content": "LONDON  May 27 Eastern European-focused budget airline Wizz Air reported a 67 percent jump in annual profit and said it was confident of further profit growth this year as it continues to expand capacity.",
        "date": "05272015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Wizz Air sees more growth as annual profit soars "
    },
    {
        "content": "* Unions says deal is bad for workers   (Adds statement from Labour MPs previously opposed to sale)",
        "date": "05262015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 5-Irish government backs sale of Aer Lingus to IAG "
    },
    {
        "content": "LONDON  May 26 European stock markets stumbled on Tuesday as Greece's debt problems and a battering for Spain's government in local elections offset a rise in airline shares.",
        "date": "05262015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "European shares stumble on Spanish and Greek worries "
    },
    {
        "content": "LONDON  May 26 Britain's top share index hit a two-week closing low on Tuesday  with banks slipping after Spanish regional election results put euro zone financials on the back foot  while falling oil and metals prices hit commodity stocks.",
        "date": "05262015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "FTSE sets 2-week closing low  commodity and banking stocks weigh "
    },
    {
        "content": "* Says half of 10 mln new passengers will be at primary airports",
        "date": "05262015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Ryanair targets easyJet to maintain profit momentum "
    },
    {
        "content": "LONDON  May 26 European stock markets stumbled on Tuesday  as Greece's debt problems and a battering for Spain's government in local elections offset a rise in airline shares.",
        "date": "05262015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Spanish and Greek concerns peg back European shares "
    },
    {
        "content": "LONDON  May 26 Britain's top share index fell on Tuesday as bank stocks came under pressure after a local poll in Spain put euro zone financials on the back foot.",
        "date": "05262015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Banks and energy shares lead Britain's FTSE lower "
    },
    {
        "content": "LONDON  May 26 European shares fell on Tuesday  the first day of the trading week for several markets after a long holiday  with a local-election battering for Spain's government and Greece's ongoing debt drama offsetting bumper airline results.",
        "date": "05262015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Europe shares hit by Spanish  Greek concerns after long weekend "
    },
    {
        "content": "DUBLIN  May 26 Ryanair reported a 66 percent jump in profit after tax for the year to March after passenger numbers grew almost three times the targeted level  and forecast another rise in profit this year as improving service boosted load factors.",
        "date": "05262015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair profits up 66 pct as passenger numbers surge "
    },
    {
        "content": "* Ryanair's fares and ancillary products will be available on Sabre from beginning of June 2015  Further company coverage:",
        "date": "05062015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair announces agreement with Sabre "
    },
    {
        "content": "* Rolling annual traffic to april grew 12 pct to 91.8 mln customers  Source text for Eikon:  Further company coverage:",
        "date": "05052015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair Holdings says April traffic rises 16 pct "
    },
    {
        "content": "DUBLIN  April 29 Almost $5 million was fraudulently taken from one of Ryanair's bank accounts  the budget airline on Wednesday  adding that it understood the funds had been frozen and would be repaid shortly.",
        "date": "04292015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Almost $5 mln fraudulently taken from Ryanair bank account "
    },
    {
        "content": "* March rolling annual traffic to march grew 11 pct to 90.5 mln customers  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +44 207 542 1810)",
        "date": "04072015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair March traffic rises 28 pct "
    },
    {
        "content": "DUBLIN European budget airline Ryanair has no plans to directly operate transatlantic flights  it said on Thursday  but a source with knowledge of matter said the company was still considering establishing a sister company to fly to North America.",
        "date": "03192015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair says has no plans to directly operate transatlantic routes "
    },
    {
        "content": "MADRID Irish airline Ryanair will announce on Wednesday commercial flights from Spanish 'ghost' airport Castellon  a symbol of profligate government spending during the country's property boom  El Pais reported on Tuesday.",
        "date": "03102015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair to start flights from Spain's 'ghost' airport:  report "
    },
    {
        "content": "* Valued at $280 million at current list prices  bringing its total order to 183 737 ngs  in addition to orders for 200 \"gamechanger\" Boeing Max 200 aircraft",
        "date": "03042015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair adds 3 more 737s to Boeing order "
    },
    {
        "content": "DUBLIN  March 3 Ryanair raised 850 million euros ($951.32 million) in a bond issue on Tuesday at a rate of 1.12 percent  its second issuance as it seeks to use the highest credit rating in the industry to cut its financing costs.",
        "date": "03032015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair raises 850 mln in second ever bond issue "
    },
    {
        "content": "* Rolling annual traffic to February grew 9 pct to 89.1 mln customers  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +44 207 542 1810)",
        "date": "03042015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair February traffic grows 29 pct to 5.8 mln customers "
    },
    {
        "content": "DUBLIN  Feb 12 Ryanair will continue its legal battle against a UK Competition and Markets Authority (CMA) order for it to sell most of its stake in Irish rival Aer Lingus  the company said on Thursday.",
        "date": "02122015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair says to appeal UK court ruling on Aer Lingus stake "
    },
    {
        "content": "* Offer to complete in first quarter   (Adds management comment  analyst comment)",
        "date": "02042015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Wizz Air resurrects London share listing plan "
    },
    {
        "content": "DUBLIN  Feb 1 The owner of British Airways must provide some sort of \"cast iron permanent guarantee\" on flights to Ireland if the government is to even consider its bid for Aer Lingus  Prime Minister Enda Kenny said on Sunday.",
        "date": "02012015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Irish PM wants \"cast iron\" guarantees on Aer Lingus sale "
    },
    {
        "content": "LONDON/BERLIN British Airways is facing a backlash from customers after making changes to the way passengers can earn and spend miles under its Avios frequent flyer program  with some threatening to switch to rival airlines such as Virgin Atlantic  Ryanair and easyJet.",
        "date": "01292015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Business class you win  economy you lose: British Airways faces backlash over points changes "
    },
    {
        "content": "* Ryanair CEO says will examine competition proposals   (Adds transport minister comment  govt set to engage with IAG)",
        "date": "01272015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 4-Aer Lingus board recommends $1.5 bln offer from BA-owner IAG "
    },
    {
        "content": "* Budget airlines fall after Ryanair update   (Adds quote  updates prices)",
        "date": "02022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "CRH surge leads Britain's FTSE to modest gains "
    },
    {
        "content": "LONDON/BERLIN  Jan 29 British Airways is facing a backlash from customers after making changes to the way passengers can earn and spend miles under its Avios frequent flyer programme  with some threatening to switch to rival airlines such as Virgin Atlantic  Ryanair and easyJet.",
        "date": "01292015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Business class you win  economy you lose: BA faces backlash over points changes "
    },
    {
        "content": "DUBLIN  Jan 29 Opposition to a takeover of Aer Lingus by the owner of British Airways is building within Irish government parties  pushing shares in the Irish airline lower for the second successive day.",
        "date": "01292015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Aer Lingus shares fall as government opposition to sale grows "
    },
    {
        "content": "DUBLIN  Jan 27 The board of Irish airline Aer Lingus has recommended a raised 1.36-billion-euro ($1.5 billion) takeover offer from the owner of British Airways  which must now soothe Irish government concerns to win approval.",
        "date": "01272015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "CORRECTED-UPDATE 3-Aer Lingus board recommends $1.5 bln offer from BA-owner IAG "
    },
    {
        "content": "LONDON  Feb 2 British Airways's owner committed to serving London to Ireland routes for five years on Monday in a bid to win backing from the Irish government for its takeover of partly state-owned airline Aer Lingus.",
        "date": "02022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "BA owner offers route pledge to Dublin in Aer Lingus bid "
    },
    {
        "content": "* Opposition parties  unions urge government to reject bid   (Adds RTE report on board set to recommend proposal)",
        "date": "01262015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "UPDATE 3-Aer Lingus to recommend $1.5 bln offer from BA-owner - RTE "
    },
    {
        "content": "DUBLIN  Jan 21 Ryanair could return to the bond market in the next 12-18 months after its debut bond in June was well received  the airline's Chief Financial Officer told Reuters on Wednesday.",
        "date": "01212015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair says may return to bond market in next 12-18 months "
    },
    {
        "content": "* Expects 2014/15 profit of 840 to 850 mln euros as costs fall",
        "date": "02022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "UPDATE 2-Ryanair sees cheap oil fuelling competition on fares "
    },
    {
        "content": "DUBLIN  Jan 21 Ryanair could return to the bond market in the next 12-18 months after its debut bond in June was well received  the airline's chief financial officer told Reuters on Wednesday.",
        "date": "01212015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "CORRECTED-UPDATE 1-Ryanair says may return to bond market in next 12-18 months "
    },
    {
        "content": "LONDON  Feb 2 Britain's top share index edged up in morning trading on Monday  with Irish building supplies groups CRH leading the market higher after agreeing to buy assets from rivals.",
        "date": "02022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "FTSE gains  CRH leads as asset purchase deal seen positive "
    },
    {
        "content": "PARIS  Feb 2 European stock index futures inched higher on Monday  with the airline sector in focus after Ryanair raised its profit forecast.     Ryanair  Europe's largest airline by passenger numbers  lifted its profit forecast for the third time in as many months  as costs fell and traffic grew  but it cautioned that profit growth will be modest next year as rivals' cheaper fuel push fares down.      At 0738 GMT  futures for Euro STOXX 50  for Germany's DAX  and for France's CAC we",
        "date": "02022015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Europe Factors to Watch-Shares set to inch up; Ryanair eyed "
    },
    {
        "content": "DUBLIN  Jan 13 Ryanair plans to trial inflight entertainment and possibly wifi on some of its flights this year in its latest attempt to attract business travellers and families who were turned off in the past by its bare basics offerings.",
        "date": "01132015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Ryanair to trial wifi  inflight entertainment this year "
    },
    {
        "content": "* Limited fuel volumes hedged after oil falls below $50/b -trader",
        "date": "01142015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Airlines prepare to hedge more jet fuel to lock in huge savings "
    },
    {
        "content": "LONDON The owner of British Airways said on Friday that Aer Lingus had rejected a revised takeover approach valuing the Irish airline at 2.40 euros per share.",
        "date": "01092015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Aer Lingus rejects revised approach from BA owner "
    },
    {
        "content": "* Court also directed eDreams to pay compensation for trademark infringement",
        "date": "01082015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "BRIEF-Ryanair says wins case against eDreams "
    },
    {
        "content": "* With oil prices locked in  Ryanair reliant on new strategy",
        "date": "01052015",
        "name": "Ryanair Holdings plc",
        "news_type": "topStory",
        "symbol": "RYAAY",
        "title": "Ryanair shares hit all-time high on further surge in passengers "
    },
    {
        "content": "* Multi-year lows for euro and crude oil help consumer stocks",
        "date": "01052015",
        "name": "Ryanair Holdings plc",
        "news_type": "normal",
        "symbol": "RYAAY",
        "title": "Greek jitters weigh on European shares "
    }
]