[
    {
        "content": "* To roll out national U.S. 5G network by 2020 (Adds context)",
        "date": "11162017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 1-T-Mobile US to propose significant share buyback "
    },
    {
        "content": "BARCELONA  Nov 16 U.S. No.3 carrier T-Mobile US will propose a \"significant\" share buyback that could start in December  finance chief Braxton Carter said on Thursday  a sign of confidence after the collapse of its merger with Sprint Corp.",
        "date": "11162017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "T-Mobile US to propose significant share buyback - CFO "
    },
    {
        "content": "NEW YORK  Nov 15 Sprint Corp will offer its unlimited data plan customers free subscriptions to the streaming service Hulu LLC  the companies said on Wednesday  marking the latest move by a U.S. wireless carrier to bundle content with mobile service.",
        "date": "11152017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint to offer free Hulu service in bid to compete with rivals "
    },
    {
        "content": "* Softbank Group Corp reports open market purchase of 6 484 367 shares of Sprint Corp's common stock between Nov 6 and Nov 7 - SEC filing Source text: (http://bit.ly/2znUBwq) Further company coverage:",
        "date": "11082017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Softbank Group buys about 6.5 mln shares of Sprint Corp's common stock "
    },
    {
        "content": "FRANKFURT  Nov 7 Deutsche Telekom ended talks on a merger between its T-Mobile US business and Sprint Corp because it would not have created value  CEO Tim Hoettges told staff after the deal collapsed at the weekend.",
        "date": "11072017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "T-Mobile-Sprint merger would not have created value-D.Telekom CEO "
    },
    {
        "content": "NEW YORK Sprint Corp will accelerate investment in its network as it plots a future as a standalone company  its chief executive officer said on Wednesday  days after the No. 4 U.S. wireless carrier and rival T-Mobile US Inc said merger talks had failed.",
        "date": "11082017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint to accelerate network investment  CEO says "
    },
    {
        "content": "* Coalition talks consider asset sales to fund glass-fibre rollout",
        "date": "11072017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Merkel's party opposes Telekom selloff to fund broadband upgrade - sources "
    },
    {
        "content": "FRANKFURT Deutsche Telekom  CEO Tim Hoettges said its T-Mobile US  unit was ideally positioned for an independent future after the failure of merger talks with Sprint Corp   but left the door open to consolidation.",
        "date": "11092017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Deutsche Telekom CEO: T-Mobile U.S. can stand alone but open to consolidation "
    },
    {
        "content": "FRANKFURT Deutsche Telekom  left the door open to a merger of its T-Mobile US business  days after the collapse of a deal between its U.S. business and Sprint Corp .",
        "date": "11092017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Deutsche Telekom still open to T-Mobile deal  raises guidance "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  Nov 4 Sprint Corp and T-Mobile US Inc said on Saturday they have called off merger talks to create a stronger U.S. wireless company to rival market leaders  leaving No. 4 provider Sprint to engineer a turnaround on its own.",
        "date": "11042017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 4-Sprint  T-Mobile call off merger after months of talks "
    },
    {
        "content": "TOKYO Japan's SoftBank Group Corp  said on Thursday it has secured a 2.65 trillion yen ($23.3 billion) senior loan agreement to refinance the acquisition loans for U.S. telco Sprint Corp  and British chip designer ARM.",
        "date": "11022017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "SoftBank secures $23.3 billion refinancing for Sprint and ARM buys "
    },
    {
        "content": "FRANKFURT  Nov 9 Deutsche Telekom CEO Tim Hoettges said its T-Mobile US unit was ideally positioned for an independent future after the failure of merger talks with Sprint Corp  but left the door open to consolidation.",
        "date": "11092017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "D.Telekom CEO: T-Mobile US can stand alone but open to consolidation "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  Nov 4 Sprint Corp and T-Mobile US Inc said on Saturday they have called off merger talks to create a stronger U.S. wireless to rival to market leaders  leaving No. 4 provider Sprint to engineer a turnaround on its own.",
        "date": "11042017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "CORRECTED-UPDATE 2-Sprint and T-Mobile call off merger after months of talks "
    },
    {
        "content": "TOKYO  Nov 2 Japan's SoftBank Group Corp said on Thursday it has secured a 2.65 trillion yen ($23.3 billion) senior loan agreement to refinance the acquisition loans for U.S. telco Sprint Corp and British chip designer ARM.",
        "date": "11022017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "SoftBank secures $23.3 bln refinancing for Sprint and ARM buys "
    },
    {
        "content": "FRANKFURT  Nov 9 Deutsche Telekom reported a gain of 3.3 percent in third-quarter core profits and raised its outlook for 2017 as it tries to move from the collapse of a merger between its T-Mobile US unit and Sprint Corp.",
        "date": "11092017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Deutsche Telekom raises guidance after collapse of U.S. deal "
    },
    {
        "content": "FRANKFURT T-Mobile US  will pursue a growth strategy in the United States after ending merger talks with Sprint Corp  on Saturday  majority owner Deutsche Telekom  said.",
        "date": "11042017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "T-Mobile to pursue growth after Sprint talks end: Deutsche Telekom "
    },
    {
        "content": "NEW YORK Sprint Corp's   shares fell more than 13 percent on Monday after the No. 4 U.S. wireless carrier called off merger talks with T-Mobile US Inc  and a wireless partnership with cable company Altice USA  failed to appease investors.",
        "date": "11062017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint shares plunge after T-Mobile merger talks called off "
    },
    {
        "content": "* Softbank Group Corp. Announces intention to increase stake in Sprint",
        "date": "11052017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Softbank Group says intends to increase stake in Sprint Corp "
    },
    {
        "content": "FRANKFURT  Nov 4 T-Mobile US will pursue a growth strategy in the United States after ending merger talks with Sprint Corp on Saturday  majority owner Deutsche Telekom said.",
        "date": "11042017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "T-Mobile to pursue growth after Sprint talks end - Deutsche Telekom "
    },
    {
        "content": "* SocGen hit by string of broker target price cuts (Adds quotes  closing prices)",
        "date": "11062017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 2-European shares take a breather near two-year highs "
    },
    {
        "content": "NEW YORK  Nov 6 Sprint Corp's  shares fell more than 13 percent on Monday after the No. 4 U.S. wireless carrier called off merger talks with T-Mobile US Inc and a wireless partnership with cable company Altice USA failed to appease investors.",
        "date": "11062017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 2-Sprint shares plunge after T-Mobile merger talks called off "
    },
    {
        "content": "FRANKFURT Deutsche Telekom shares dropped in early Monday trading after the collapse of the merger of its T-Mobile US unit with Sprint Corp  which would have created a strong No.3 player on the U.S. market.",
        "date": "11062017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Failure of U.S. deal hits Deutsche Telekom shares  growth prospects "
    },
    {
        "content": "Nov 5 Altice USA  the fourth-largest U.S. cable operator  said it would introduce mobile service on Sprint Corp's network  becoming the latest in its industry to plan to enter the wireless market in an effort to retain customers.",
        "date": "11052017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Altice to sell wireless service on Sprint's network "
    },
    {
        "content": "* Main owner Deutsche Telekom plays up T-Mobile growth prospects",
        "date": "11052017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Growth without scale: Deutsche Telekom's T-Mobile headache "
    },
    {
        "content": "SoftBank Group Corp and Deutsche Telekom AG have reached an impasse in their talks to merge Sprint Corp and T-Mobile US Inc  sources said  sending shares in the Japanese Internet giant sliding. | Video ",
        "date": "10312017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "SoftBank  Deutsche Telekom hit wall in Sprint  T-Mobile talks: sources "
    },
    {
        "content": "SAN FRANCISCO  Nov 4 Sprint Corp and T-Mobile USA Inc have ended merger negotiations  the companies said in a joint statement on Saturday.",
        "date": "11042017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint and T-Mobile end merger negotiations "
    },
    {
        "content": "* Some analysts praise Telekom management for not overpaying (Adds analysts  broker downgrades  context)",
        "date": "11062017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Failure of U.S. deal hits D.Telekom shares  growth prospects "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK Sprint Corp  and T-Mobile US Inc  said on Saturday they have called off merger talks to create a stronger U.S. wireless company to rival market leaders  leaving No. 4 provider Sprint to engineer a turnaround on its own. | Video ",
        "date": "11052017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint  T-Mobile call off merger after months of talks "
    },
    {
        "content": "NEW YORK  Oct 31 A hitch in a proposed merger of U.S. wireless carriers Sprint Corp and T-Mobile US has further boosted buoyant shares of cell tower stocks  which could benefit if there is no combined company to cut costs by reducing tower usage.",
        "date": "10312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Buy signal blares for cell-tower stocks in 2017 "
    },
    {
        "content": "Oct 31 The following bids  mergers  acquisitions and disposals were reported by 1300 GMT on Tuesday:",
        "date": "10312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "FRANKFURT  Nov 6 Shares in Deutsche Telekom opened 2.9 percent lower on Monday after the attempt by its T-Mobile US unit to merge with Sprint Corp to create a strong No.3 player on the U.S. market collapsed at the weekend.",
        "date": "11062017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Deutsche Telekom shares down after U.S. deal collapses "
    },
    {
        "content": "* Sprint Corp  T-Mobile US Inc merger would have meant a loss of control",
        "date": "11062017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Softbank CEO: Finalising conditions for investment in Uber but conditions need to be met "
    },
    {
        "content": "FRANKFURT A strong No. 3 player in the U.S. wireless market would enhance competition  the chief of Deutsche Telekom  told a German newspaper  as T-Mobile US Inc  seeks to merge with Sprint Corp .",
        "date": "10282017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Telekom CEO argues for strong No. 3 player in U.S. wireless market: newspaper "
    },
    {
        "content": "Oct 30 Japan's SoftBank Group Corp plans to break off negotiations of a merger between subsidiary Sprint Corp and T-Mobile US Inc amid a failure to agree on ownership of the combined company  Nikkei reported. (http://s.nikkei.com/2z03Bb0)",
        "date": "10302017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Japan's SoftBank calling off talks to merge Sprint  T-Mobile - Nikkei "
    },
    {
        "content": "* BOJ's decision to keep ETF purchase unchanged relieves market - analyst",
        "date": "10312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "REFILE-Nikkei flat as BOJ decision shows optimism but SoftBank's drop weighs "
    },
    {
        "content": "Oct 30 SoftBank Group Corp and Deutsche Telekom AG have reached an impasse in their talks to merge Sprint Corp and T-Mobile US Inc  sources said  sending shares in the Japanese Internet giant sliding.",
        "date": "10312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 5-SoftBank  Deutsche Telekom hit wall in Sprint  T-Mobile talks -sources "
    },
    {
        "content": "TOKYO Softbank Group Corp  shares fell on Tuesday after sources said it reached an impasse with Deutsche Telekom AG  in their talks to merge Sprint Corp  and T-Mobile US Inc .",
        "date": "10312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Softbank shares skid as Sprint  T-Mobile merger said to reach impasse "
    },
    {
        "content": "U.S. cable operator Altice USA will sell mobile service on wireless carrier Sprint Corp's network under a new multi-year agreement announced on Sunday  becoming the latest firm to enter the wireless market in a bid to retain customers.",
        "date": "11062017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Altice USA  Sprint agree to wireless partnership "
    },
    {
        "content": "Nov 5 U.S. cable operator Altice USA will sell mobile service on wireless carrier Sprint Corp's network under a new multi-year agreement announced on Sunday  becoming the latest firm to enter the wireless market in a bid to retain customers.",
        "date": "11062017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 2-Altice USA  Sprint agree to wireless partnership "
    },
    {
        "content": "T-Mobile US Inc  and Sprint Corp  are laying the groundwork for special committees of their boards of directors to decide on a merger between the third and fourth largest U.S. wireless carriers  according to people familiar with the matter.",
        "date": "10252017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "T-Mobile  Sprint ready board committees to decide on merger: sources "
    },
    {
        "content": "NEW YORK Sprint Corp  reported a narrower quarterly loss on Wednesday than analysts estimated as it added subscribers  and the wireless carrier declined to hold a post-earnings conference call amid expectations of a merger with rival T-Mobile US Inc .",
        "date": "10252017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint's quarterly loss narrower than estimated; merger expected "
    },
    {
        "content": "NEW YORK T-Mobile US Inc's  quarterly profit topped Wall Street analyst estimates and the No. 3 U.S. wireless carrier raised the lower end of its expected range of customer additions for the year but didn't elaborate on a potential deal with rival Sprint Corp .",
        "date": "10232017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "T-Mobile quarterly profit tops estimates as subscribers grow "
    },
    {
        "content": "NEW YORK  Oct 25 Sprint Corp reported a narrower quarterly loss on Wednesday than analysts estimated as it added subscribers  and the wireless carrier declined to hold a post-earnings conference call amid expectations of a merger with rival T-Mobile US Inc.",
        "date": "10252017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Sprint's quarterly loss narrower than estimated; merger expected "
    },
    {
        "content": "NEW YORK  Oct 23 T-Mobile US Inc's quarterly profit topped Wall Street analyst estimates and the No. 3 U.S. wireless carrier raised the lower end of its expected range of customer additions for the year but didn't elaborate on a potential deal with rival Sprint Corp.",
        "date": "10232017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-T-Mobile quarterly profit tops estimates as subscribers grow "
    },
    {
        "content": "Oct 25 T-Mobile US Inc and Sprint Corp are laying the groundwork for special committees of their boards of directors to decide on a merger between the third and fourth largest U.S. wireless carriers  according to people familiar with the matter.",
        "date": "10252017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-T-Mobile  Sprint ready board committees to decide on merger-sources "
    },
    {
        "content": "* Sprint Corp says quarter to date total net operating revenues $7 927 million versus $8 247 million ​",
        "date": "10252017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint reports quarter to date loss per share of $0.01 "
    },
    {
        "content": "NEW YORK  Oct 25 Sprint Corp's quarterly loss was narrower than Wall Street analyst estimates as the wireless carrier added subscribers  while the company declined to hold a post-earnings conference call amid speculation it would announce a merger with rival T-Mobile US Inc.",
        "date": "10252017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint's quarterly loss narrower than estimates amid T-Mobile deal chatter "
    },
    {
        "content": "Oct 25 T-Mobile US Inc and Sprint Corp are laying the groundwork for special committees of their board of directors to decide on a merger between the third and fourth largest U.S. wireless carriers  according to people familiar with the matter.",
        "date": "10252017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "T-Mobile  Sprint ready board committees to decide on merger - sources "
    },
    {
        "content": "T-Mobile U.S. Inc  and Sprint Corp  plan to announce a merger agreement without any immediate asset sales  as they seek to preserve as much of their spectrum holdings and cost synergies as they can before regulators ask for concessions  according to people familiar with the matter. | Video ",
        "date": "10162017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Exclusive: T-Mobile  Sprint plan merger without selling assets "
    },
    {
        "content": "WASHINGTON When Sprint and T-Mobile bring their expected merger plans to the U.S. Department of Justice for antitrust review  the career staff who do the bulk of the probe into whether the deal will hurt customers will likely recommend that it be stopped  three people familiar with their thinking told Reuters.",
        "date": "10112017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "T-Mobile  Sprint deal likely opposed by Justice Dept staff: sources "
    },
    {
        "content": "* Nikkei gains for 10 days  winning streak at longest since 2015",
        "date": "10162017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Nikkei rises for 10 straight days as dollar-yen stable; large caps gain "
    },
    {
        "content": "WASHINGTON  Oct 11 When Sprint and T-Mobile bring their expected merger plans to the U.S. Department of Justice for antitrust review  the career staff who do the bulk of the probe into whether the deal will hurt customers will likely recommend that it be stopped  three people familiar with their thinking told Reuters.",
        "date": "10112017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "T-Mobile  Sprint deal likely opposed by Justice Dept staff -sources "
    },
    {
        "content": "* SoftBank-controlled Sprint and T-Mobile plan to merge - Reuters",
        "date": "10162017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Nikkei rises to fresh 21-year high; SoftBank surges "
    },
    {
        "content": "WASHINGTON  Sept 26 A divided Federal Communications Commission on Tuesday approved a report that found for the first time since 2009 there is \"effective competition\" in the wireless market  a finding that could help Sprint Corp and T-Mobile US Inc to merge.",
        "date": "09262017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "FCC finds 'effective competition' in U.S. wireless market "
    },
    {
        "content": "A federal judge in Manhattan on Wednesday said a Sprint Corp unit and an outsourcing firm were not joint employers of workers hired by an independent sales office to sign up low-income people for free phone services.",
        "date": "09282017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Judge tosses Sprint sales workers' joint employer  misclassification claims "
    },
    {
        "content": "* Sprint Corp says on Sept 20 entered into a commitment letter with JP Morgan Chase Bank  Goldman Sachs Bank USA  other commitment parties - sec filing",
        "date": "09252017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint says entered into a commitment letter with JP Morgan Chase  Goldman Sachs USA "
    },
    {
        "content": "* SoftBank rises on news T-Mobile and Sprint close to tentative terms on merger",
        "date": "09252017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Nikkei rises on weak yen  stimulus hopes; exporters shine "
    },
    {
        "content": "* SoftBank rises on news T-Mobile and Sprint close to tentative terms on merger",
        "date": "09252017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Nikkei rises on weak yen  snap election hopes "
    },
    {
        "content": "WASHINGTON Sprint Corp  hired a lobbying firm with close ties to U.S. President Donald Trump's administration on Sept. 1  adding to Sprint's stable of federal lobbyists as it nears a deal to merge with wireless rival T-Mobile US Inc  according to disclosures filed with the U.S. Congress this week.",
        "date": "09232017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint hired Trump-connected lobbyist amid deal talks "
    },
    {
        "content": "U.S. wireless carrier T-Mobile US Inc is exploring taking over rival Sprint Corp in an all-stock deal  after SoftBank Group Corp offered to give up its majority ownership of Sprint  a person familiar with the matter said.",
        "date": "09202017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "T-Mobile U.S. explores takeover of Sprint: source "
    },
    {
        "content": "T-Mobile US Inc  is close to agreeing tentative terms on a deal to merge with Sprint Corp   people familiar with the matter said on Friday  a major breakthrough in efforts to merge the third and fourth largest U.S. wireless carriers. | Video ",
        "date": "09232017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Exclusive: T-Mobile  Sprint close to agreeing on deal terms - sources "
    },
    {
        "content": "Sept 19 U.S. wireless carrier T-Mobile US Inc is exploring taking over rival Sprint Corp in an all-stock deal  after SoftBank Group Corp offered to give up its majority ownership of Sprint  a person familiar with the matter said.",
        "date": "09192017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 3-T-Mobile US explores takeover of Sprint-source "
    },
    {
        "content": "WASHINGTON  Sept 22 Sprint Corp hired a lobbying firm with close ties to U.S. President Donald Trump's administration on Sept. 1  adding to Sprint's stable of federal lobbyists as it nears a deal to merge with wireless rival T-Mobile US Inc  according to disclosures filed with the U.S. Congress this week.",
        "date": "09222017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 1-Sprint hired Trump-connected lobbyist amid deal talks "
    },
    {
        "content": "Sept 19 U.S. wireless carriers T-Mobile US Inc and Sprint Corp are said to be in active merger talks  CNBC reported   citing sources.",
        "date": "09192017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "T-mobile  Sprint in merger talks - CNBC "
    },
    {
        "content": "WASHINGTON  Sept 22 Sprint Corp hired a lobbying firm with close ties to U.S. President Donald Trump's administration on Sept. 1  adding to its stable of federal lobbyists as it nears a deal to merge with wireless rival T-Mobile US Inc  according to disclosures filed with the U.S. Congress this week.",
        "date": "09222017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint hired Trump-connected lobbyist in early September -filing "
    },
    {
        "content": "Sept 22 T-Mobile US Inc is close to agreeing tentative terms on a deal to merge with Sprint Corp   people familiar with the matter said on Friday  a major breakthrough in efforts to merge the third and fourth largest U.S. wireless carriers.",
        "date": "09222017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "EXCLUSIVE-T-Mobile  Sprint close to agreeing deal terms -sources "
    },
    {
        "content": "Sept 22 T-Mobile US Inc is close to agreeing tentative terms on a deal to merge with peer Sprint Corp  people familiar with the matter said  a major breakthrough in efforts to merge the third and fourth largest U.S. wireless carriers.",
        "date": "09222017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "EXCLUSIVE-T-Mobile  Sprint close to agreeing deal terms-sources "
    },
    {
        "content": "Sept 18 Sprint Corp said on Monday it will offer Apple Inc's new iPhone 8 for free with a qualifying phone trade-in  following AT&T Inc's buy one  get one free promotion on Friday for DirecTV and U-verse TV customers.",
        "date": "09182017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint follows AT&T with free iPhone 8 offer for trade-in "
    },
    {
        "content": "* Sprint Corp CEO says \"no comment\" on M&A -Goldman Sachs conference",
        "date": "09142017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint CEO says \"no comment\" on M&A "
    },
    {
        "content": "* Sprint Corp - ‍effective immediately  Sprint will offer iPhone 8 64GB for $0 with an eligible trade-in of select devices​",
        "date": "09182017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint Corp will offer iPhone 8 64GB for $0 with eligible trade-in of select devices​ "
    },
    {
        "content": "* Sprint- Announced its first in-house digital marketing agency  plans to hire about 100 digital positions in remainder of 2017 and more in 2018 Source text for Eikon: Further company coverage:",
        "date": "09062017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint announced its first in-house digital marketing agency "
    },
    {
        "content": "* Sprint names Ivo Rook Senior VP of IoT Source text for Eikon: Further company coverage:",
        "date": "09082017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint names Ivo Rook Senior VP of IoT "
    },
    {
        "content": "A federal judge on Wednesday partially dismissed an infringement case the patent holding company Intellectual Ventures brought against T-Mobile USA Inc  Sprint Corp and United States Cellular Corporation.",
        "date": "08242017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint  T-Mobile knock out 'abstract' Intellectual Ventures patents "
    },
    {
        "content": "Aug 9 Netherlands-based telecom conglomerate Altice NV and its U.S. cable unit are in the early stages of working on an offer to buy Charter Communications Inc   sources told Reuters on Wednesday  in a move that would build more scale in the United States.",
        "date": "08092017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 4-Altice weighing takeover offer for Charter -sources "
    },
    {
        "content": "SAN FRANCISCO  Aug 9 Essential Products  the smartphone startup founded by a co-creator of the Android mobile operating system  has raised $300 million in new funding and signed up retailers to sell its first device  it said on Wednesday.",
        "date": "08102017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "CORRECTED-UPDATE 2-Android creator's startup raises $300 mln  first smartphone due soon "
    },
    {
        "content": "NEW YORK Sprint Corp  shares jumped 11 percent on Tuesday after its chief executive said an announcement on merger talks should come in the \"near future\" and the company reported a quarterly profit for the first time in three years.",
        "date": "08012017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint hints at deal prospects  shares surge "
    },
    {
        "content": "July 31 U.S. cable operator Charter Communications Inc's shares shot up nearly 14 percent on Monday after the company said it was not interested in buying wireless carrier Sprint Corp.",
        "date": "07312017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "CORRECTED-Charter surges after company says not interested in Sprint "
    },
    {
        "content": "NEW YORK  Aug 1 Sprint Corp shares jumped 11 percent on Tuesday after its chief executive said an announcement on merger talks should come in the \"near future\" and the company reported a quarterly profit for the first time in three years.",
        "date": "08012017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 5-Sprint hints at deal prospects  shares surge "
    },
    {
        "content": "Aug 1 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "08012017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Sprint reports net income for the first time in three years with first quarter of fiscal 2017 results",
        "date": "08012017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint reports first quarterly profit in three years "
    },
    {
        "content": "* Indexes: Dow +0.41 pct; S&P +0.06 pct; Nasdaq -0.35 pct (Updates with details  investor comment  prices)",
        "date": "07312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "US STOCKS-Dow hits record high while tech cedes ground "
    },
    {
        "content": "NEW YORK  Aug 1 Sprint Corp on Tuesday swung to a quarterly profit for the first time in three years as the No. 4 U.S. wireless carrier launched aggressive new promotions during the period to win subscribers.",
        "date": "08012017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint swings to a profit as subscribers grow "
    },
    {
        "content": "* Indexes: Dow up 0.29 pct; S&P down 1.38 pct; Nasdaq down 0.34 pct (Adds comments  updates prices)",
        "date": "07312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "US STOCKS-Tech stocks drag S&P  Nasdaq; Boeing lifts Dow "
    },
    {
        "content": "* Indexes up: Dow 0.28 pct; S&P 0.19 pct; Nasdaq 0.29 pct (Updates to open)",
        "date": "07312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "US STOCKS-Wall St opens higher  Dow rises to record high "
    },
    {
        "content": "* Futures up: Dow 58 pts; S&P 3.25 pts; Nasdaq 13.5 pts (Adds details  comment  updates prices)",
        "date": "07312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "US STOCKS-Wall St set to open higher on earnings optimism "
    },
    {
        "content": "U.S. cable operator Charter Communications Inc said on Sunday it was not interested in acquiring U.S. wireless carrier Sprint Corp  leaving the latter's majority owner  SoftBank Group Corp  pondering how to orchestrate a merger.",
        "date": "07312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Charter Communications says 'no interest' in buying Sprint "
    },
    {
        "content": "July 30 U.S. cable operator Charter Communications Inc said on Sunday it was not interested in acquiring U.S. wireless carrier Sprint Corp  leaving the latter's majority owner  SoftBank Group Corp  pondering how to orchestrate a merger.",
        "date": "07312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 2-Charter Communications says 'no interest' in buying Sprint "
    },
    {
        "content": "July 28 Sprint Corp has proposed a merger with Charter Communications Inc as the wireless carrier seeks an alternative to a deal with T-Mobile US Inc that has so far not come to fruition  according to sources familiar with the matter.",
        "date": "07292017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 3-Sprint seeks alternatives to a merger with T-Mobile -sources "
    },
    {
        "content": "NEW YORK  July 27 Comcast Corp's quarterly results topped Wall Street analysts' estimates on higher revenue in its filmed entertainment and theme parks businesses  even as the No. 1 U.S. cable operator lost video subscribers.",
        "date": "07272017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Comcast results top estimates on film  theme parks growth "
    },
    {
        "content": "July 30 Charter Communications Inc is not interested in Sprint Corp's proposal to be acquired by Charter  a company spokesman said.",
        "date": "07312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Charter Communications says \"no interest\" in buying Sprint "
    },
    {
        "content": "Sprint Corp  has proposed a merger with Charter Communications Inc  as the wireless carrier seeks an alternative to a deal with T-Mobile US Inc  that has so far not come to fruition  according to sources familiar with the matter.",
        "date": "07312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint seeks alternatives to a merger with T-Mobile: sources "
    },
    {
        "content": "* Sprint Corp has proposed a merger with Charter Communications Inc - source",
        "date": "07292017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint Corp has proposed a merger with Charter Communications - source "
    },
    {
        "content": "* Investment in northern California with plans to add more than 300 new jobs and 43 new retail locations throughout area by end of 2017 Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint expands in northern California with 43 new retail stores "
    },
    {
        "content": "July 28 U.S. wireless carrier Sprint Corp has proposed a merger with cable provider Charter Communications Inc in a deal that would create a new publicly traded company  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "07282017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint proposes merger with Charter Communications - WSJ "
    },
    {
        "content": "The RadioShack brand will live on after a family office already owed $23 million by the bankrupt U.S. electronics chain agreed to assume ownership of it  as no other buyers submitted better bids this week  people familiar with the matter said.",
        "date": "07192017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "RadioShack brand to survive under new owner: sources "
    },
    {
        "content": "WILMINGTON  Del A Delaware judge ruled Friday that wireless carrier Clearwire Corp was sold in 2013 for more than twice its fair value  a decision that dealt a stinging loss to the Aurelius Capital Management hedge fund which spent years battling to prove Clearwire was vastly underpriced.",
        "date": "07212017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Hedge fund stung by unusual ruling over Sprint-Clearwire deal "
    },
    {
        "content": "* Sprint expands in Washington with 12 new retail stores creating more than 80 jobs",
        "date": "07202017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint expands in Washington with 12 new retail stores "
    },
    {
        "content": "July 19 The RadioShack brand will live on after a family office already owed $23 million by the bankrupt U.S. electronics chain agreed to assume ownership of it  as no other buyers submitted better bids this week  people familiar with the matter said.",
        "date": "07192017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "RadioShack brand to survive under new owner -sources "
    },
    {
        "content": "Warren Buffett's Berkshire Hathaway Inc and John Malone's Liberty Media Corp are exploring an investment of between $10 billion and $20 billion in U.S. wireless carrier Sprint Corp  people familiar with the matter said.",
        "date": "07142017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Buffett  Malone explore investment in Sprint: sources "
    },
    {
        "content": "July 14 Warren Buffett's Berkshire Hathaway Inc and John Malone's Liberty Media Corp are exploring an investment of between $10 billion and $20 billion in U.S. wireless carrier Sprint Corp  people familiar with the matter said.",
        "date": "07142017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 2-Buffett  Malone explore investment in Sprint -sources "
    },
    {
        "content": "July 14 Sprint Corp's chairman  Masayoshi Son  has engaged in talks with Berkshire Hathaway Inc's Warren Buffett and media mogul John Malone to discuss a potential investment in the U.S. wireless company  the Wall Street Journal reported on Friday.",
        "date": "07142017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint chairman engages Warren Buffett for possible investment-WSJ "
    },
    {
        "content": "NEW YORK  July 14 Sprint Corp said on Friday that it was launching new leasing options aimed at price-sensitive customers who want to upgrade their phones more often  the carrier’s latest effort to lure subscribers in an oversaturated market for wireless service.",
        "date": "07142017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint launches new leasing options for cost-conscious consumers "
    },
    {
        "content": "July 6 Dish Network Corp Chief Executive Charlie Ergen and Amazon.com Inc head Jeff Bezos have discussed a partnership to enter the wireless business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "07062017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Dish  Amazon chiefs discuss wireless partnership - WSJ "
    },
    {
        "content": "July 6 Dish Network Corp Chief Executive Charlie Ergen and Amazon.com Inc head Jeff Bezos have discussed a partnership to enter the wireless business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "07062017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Dish  Amazon chiefs discuss wireless partnership - WSJ "
    },
    {
        "content": "WILMINGTON  Del./BOSTON Sprint Corp used confidential information from its alliance with RadioShack Corp to open competing mobile phone stores  dooming the comeback by the electronics retailer and destroying jobs  according to a lawsuit filed on Wednesday by RadioShack creditors.",
        "date": "06302017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "RadioShack creditors' lawsuit says Sprint killed 6 000 jobs "
    },
    {
        "content": "WILMINGTON  Del./BOSTON  June 29 Sprint Corp used confidential information from its alliance with RadioShack Corp to open competing mobile phone stores  dooming the comeback by the electronics retailer and destroying jobs  according to a lawsuit filed on Wednesday by RadioShack creditors.",
        "date": "06292017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "RadioShack creditors' lawsuit says Sprint killed 6 000 jobs "
    },
    {
        "content": "Sprint Corp  shares jumped as much as 6 percent on Tuesday on news the carrier is in talks with Charter Communications Inc  and Comcast Corp  about a wireless partnership  a move that added a new dimension to speculation about possible telecom sector tie-ups. | Video ",
        "date": "06272017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint shares jump on cable wireless talks  T-Mobile sinks "
    },
    {
        "content": "June 27 Sprint Corp shares jumped as much as 6 percent on Tuesday on news the carrier is in talks with Charter Communications Inc and Comcast Corp about a wireless partnership  a move that added a new dimension to speculation about possible telecom sector tie-ups.",
        "date": "06272017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Sprint shares jump on cable wireless talks  T-Mobile sinks "
    },
    {
        "content": "U.S. wireless carrier Sprint Corp is in talks with Charter Communications Inc and Comcast Corp about a partnership to boost the two U.S. cable companies' wireless offerings  according to sources familiar with the matter. | Video ",
        "date": "06272017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Charter  Comcast explore wireless partnership with Sprint: sources "
    },
    {
        "content": "* Marcelo Claure elected to Softbank board of directors Source text for Eikon: Further company coverage:",
        "date": "06212017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint's Marcelo Claure elected to Softbank board "
    },
    {
        "content": "NEW YORK  June 20 A federal judge on Tuesday faulted the U.S. Consumer Financial Protection Bureau's apparent \"indifference\" toward how to distribute money left over from its 2015 settlement with Sprint Corp over unauthorized customer charges.",
        "date": "06202017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "U.S. judge faults CFPB 'indifference' toward Sprint settlement "
    },
    {
        "content": "Sprint Corp's talks with Charter Communications Inc and Comcast Corp about a wireless partnership added another layer of uncertainty to the outlook for potential deals in the cable and telecommunications sector.",
        "date": "06272017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint  cable wireless talks scramble deal outlook "
    },
    {
        "content": "June 26 U.S. wireless carrier Sprint Corp is in talks with Charter Communications Inc and Comcast Corp about a partnership to boost the two U.S. cable companies' wireless offerings  according to sources familiar with the matter.",
        "date": "06272017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Charter  Comcast explore wireless partnership with Sprint-sources "
    },
    {
        "content": "June 26 Sprint Corp is in exclusive talks with Charter Communications Inc and Comcast Corp to explore a deal that could boost the cable companies' wireless service  The Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06272017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "REFILE-Sprint in exclusive talks with Charter  Comcast on wireless deal -WSJ "
    },
    {
        "content": "The U.S. Supreme Court on Monday declined to revive Cox Communications Inc's challenge to the validity of six Sprint Corp patents on how voice calls may be handed off from traditional phone lines to networks like the internet.",
        "date": "06212017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "U.S. Supreme Court declined to revive Cox challenge to Sprint patents "
    },
    {
        "content": "* CEO Marcelo Claure's FY 2016 total compensation was $7.5 million versus about $30 million in FY 2015 - SEC filing",
        "date": "06192017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint CEO Marcelo Claure's FY16 total compensation was $7.5 mln "
    },
    {
        "content": "NEW YORK  June 13 Sprint Corp is offering free unlimited data  talk and text for a year in an aggressive promotion launched on Tuesday  aimed at Verizon customers in an oversaturated U.S. wireless market.",
        "date": "06132017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint offers one-year free unlimited service aimed at Verizon users "
    },
    {
        "content": "* Sprint to offer all-new 10.5-inch ipad pro and new 12.9-inch ipad pro; orders begin today Source text for Eikon: Further company coverage:",
        "date": "06092017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint to offer all-new 10.5-inch Ipad Pro and new 12.9-inch Ipad pro; orders begin today "
    },
    {
        "content": "* Sprint announces early tender results and upsizing of its cash tender offers for its 9.000pct guaranteed notes due 2018 and its 8.375pct notes due 2017",
        "date": "05232017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint announces early tender results and upsizing of its cash tender offers "
    },
    {
        "content": "NEW YORK T-Mobile US Inc  would benefit from greater scale in the industry if it were to combine with rival Sprint Corp    the chief financial officer of the No. 3 wireless carrier said at a conference on Thursday.",
        "date": "05182017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "T-Mobile sees benefits in merger with Sprint: CFO "
    },
    {
        "content": "NEW YORK  May 18 T-Mobile US Inc would benefit from greater scale in the industry if it were to combine with rival Sprint Corp   the chief financial officer of the No. 3 wireless carrier said at a conference on Thursday.",
        "date": "05182017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "T-Mobile sees benefits in merger with Sprint -CFO "
    },
    {
        "content": "TOKYO  May 10 Japan's SoftBank Group Corp reported a 13 percent rise in full-year operating profit  benefiting from cost cuts and a rise in subscribers at its U.S. wireless unit Sprint Corp.",
        "date": "05102017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "SoftBank annual profit up 13 pct on better performance by Sprint "
    },
    {
        "content": "May 7 Comcast Corp and Charter Communications Inc will announce a wireless partnership on Monday  according to a source familiar with the matter  as the cable providers prepare to enter a highly competitive and oversaturated market for mobile service in the United States.",
        "date": "05082017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Comcast  Charter to announce wireless partnership on Monday -source "
    },
    {
        "content": "* Sprint-Continues to expand investment in Florida with plans to add more than 250 jobs and open over 15 new retail stores in south Florida by end of 2018 Source text for Eikon: Further company coverage:",
        "date": "05092017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint says continues to expand investment in Florida "
    },
    {
        "content": "Sprint Corp's shares slid 10 percent on Wednesday after the No. 4 U.S. wireless carrier did not give specifics on deals it would pursue  even as its quarterly loss narrowed and it recorded strong subscriber growth.",
        "date": "05032017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint mum on M&A plans as quarterly loss narrows; shares down "
    },
    {
        "content": "May 3 Sprint Corp's shares closed down 14 percent on Wednesday after the No. 4 U.S. wireless carrier did not give specifics on deals it would pursue  even as it narrowed its quarterly loss.",
        "date": "05032017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 5-Sprint mum on M&A plans as quarterly loss narrows; shares down "
    },
    {
        "content": "* Sprint corp says unveiled sprint magic box  an all-wireless small cell Source text for Eikon: Further company coverage:",
        "date": "05032017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint unveils first \"All-Wireless Small Cell\" "
    },
    {
        "content": "* Q4 earnings per share view $-0.04 -- Thomson Reuters I/B/E/S",
        "date": "05032017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint Q4 loss per share $0.07 "
    },
    {
        "content": "May 3 Sprint Corp reported a smaller quarterly loss on Wednesday  as the No. 4 U.S. wireless carrier added more postpaid phone subscribers.",
        "date": "05032017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint's loss narrows as postpaid subscriptions rise "
    },
    {
        "content": "* TO EXPAND PRESENCE AND INVESTMENT IN TEXAS WITH PLANS TO ADD MORE THAN 550 NEW JOBS AND 79 NEW RETAIL LOCATIONS ACROSS STATE BY END OF 2017 Source text for Eikon: Further company coverage:",
        "date": "04242017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-SPRINT TO EXPAND IN TEXAS WITH 79 NEW RETAIL STORES "
    },
    {
        "content": "NEW YORK  April 13 T-Mobile US Inc bid $8 billion and Dish Network Corp $6.2 billion to win the bulk of broadcast airwaves spectrum for sale in a government auction  the U.S. Federal Communications Commission said on Thursday.",
        "date": "04132017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-T-Mobile  Dish bid combined $14 bln in U.S. airwaves auction -FCC "
    },
    {
        "content": "March 23 A federal judge on Thursday dismissed a $159.4 million lawsuit by two former top Sprint Corp executives who were caught up in a 2003 tax shelter scandal  and said the Internal Revenue Service was to blame for costing them their jobs.",
        "date": "03232017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "IRS beats ex-Sprint CEO  COO lawsuit over tax shelter scandal "
    },
    {
        "content": "U.S. electronics chain RadioShack Corp filed for bankruptcy on Wednesday for the second time in a little over two years  faced with a challenging retail environment and an unsatisfying partnership with wireless provider Sprint Corp. | Video ",
        "date": "03092017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Electronics store RadioShack files for bankruptcy again "
    },
    {
        "content": "March 8 U.S. electronics chain RadioShack Corp filed for bankruptcy on Wednesday for the second time in a little over two years  faced with a challenging retail environment and an unsatisfying partnership with wireless provider Sprint Corp.",
        "date": "03092017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Electronics store RadioShack files for bankruptcy again "
    },
    {
        "content": "* Sprint and open mobile announce joint venture in Puerto Rico and U.S. Virgin islands",
        "date": "02232017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint  Open Mobile announce joint venture in Puerto Rico  U.S. Virgin islands "
    },
    {
        "content": "TOKYO Shares in SoftBank Group Corp  rose nearly 3 percent in morning trade on Monday after a Reuters report that the Japanese company is prepared to cede control of Sprint Corp  to T-Mobile US Inc  to clinch a merger of the two U.S. wireless carriers.",
        "date": "02202017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "SoftBank shares up; sources say company willing to cede control of Sprint "
    },
    {
        "content": "* Potential deal could improve SoftBank's credit rating-analyst   (Adds analyst comment  background)",
        "date": "02202017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-SoftBank shares up; sources say co willing to cede control of Sprint "
    },
    {
        "content": "TOKYO  Feb 20 Shares in SoftBank Group Corp  rose 2 percent in morning trade on Monday after a Reuters report that the Japanese company is prepared to cede control of Sprint Corp to T-Mobile US Inc to clinch a merger of the two U.S. wireless carriers.",
        "date": "02202017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "SoftBank shares up; sources say co willing to cede control of Sprint "
    },
    {
        "content": "NEW YORK Japan's SoftBank Group Corp  is prepared to give up control of Sprint Corp  to Deutsche Telekom AG's  T-Mobile US Inc  to clinch a merger of the two U.S. wireless carriers  according to people familiar with the matter. | Video ",
        "date": "02182017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Exclusive: SoftBank willing to cede control of Sprint to entice T-Mobile - sources "
    },
    {
        "content": "* Unlimited offer now includes \"HD-quality video  10GB mobile hotspot per line\"  Source text for Eikon:  Further company coverage:",
        "date": "02162017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint Corp launches unlimited HD plan "
    },
    {
        "content": "* Sprint Corp-  On February 3  2017 subsidiary  Sprint Communications  Inc entered into a new $6.0 billion secured revolving and term loan credit facility",
        "date": "02062017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint Corp says on Feb 3 its unit Sprint Communications entered into a new $6 bln secured revolving and term loan credit facility "
    },
    {
        "content": "Sprint Corp  reported on Tuesday a slimmer quarterly loss and revenue that beat estimates as the No. 4 U.S. wireless carrier added more subscribers than Wall Street expected.",
        "date": "01312017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint third-quarter loss narrows as subscriber growth beats estimates "
    },
    {
        "content": "Jan 31 Sprint Corp reported on Tuesday a slimmer quarterly loss and revenue that beat estimates as the No. 4 U.S. wireless carrier added more subscribers than Wall Street expected.",
        "date": "01312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 4-Sprint 3rd-qtr loss narrows as subscriber growth beats estimates "
    },
    {
        "content": "* Sprint CEO - plans to open anywhere between 500 -1000 stores in the next 18 months;  with every store carrying between 6 to 10 people - Conf call   Further company coverage:",
        "date": "01312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint CEO says Co plans to open 500 -1000 stores in the next 18 months "
    },
    {
        "content": "* Sprint continues year-over-year growth in net operating revenues and postpaid phone net additions with third quarter of fiscal year 2016 results",
        "date": "01312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint posts Q3 loss per share $0.12 "
    },
    {
        "content": "Jan 31 Sprint Corp posted a smaller quarterly loss as the No. 4 U.S. wireless carrier cut costs as part of a turnaround plan.",
        "date": "01312017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint reports smaller quarterly loss "
    },
    {
        "content": "* Employment agreement with Nestor Cano provides for an annual base salary of $1.3 million - SEC filing  Source text: [http://bit.ly/2jWHk5X] Further company coverage:",
        "date": "01242017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint Corp employment agreement with Nestor Cano provides for an annual base salary of $1.3 mln "
    },
    {
        "content": "* Sprint Corp - Cano's appointment is effective Feb. 2  Source text for Eikon:  Further company coverage:",
        "date": "01242017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint names Néstor Cano chief operating officer "
    },
    {
        "content": "Jan 23 U.S. wireless carrier Sprint Corp  said on Monday it would buy 33 percent of Tidal  a music streaming service owned by rapper Jay Z.",
        "date": "01232017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint to buy a third of Jay Z's music streaming service Tidal "
    },
    {
        "content": "Jan 24 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "01242017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "PRESS DIGEST - Wall Street Journal - Jan 24 "
    },
    {
        "content": "Jan 23 U.S. wireless carrier Sprint Corp  said on Monday it would buy 33 percent of Tidal  a music streaming service owned by rapper Jay Z  marking a move to more content driven services in a highly competitive wireless market.",
        "date": "01232017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Sprint to buy a third of Jay Z's music streaming service Tidal "
    },
    {
        "content": "* Sprint acquires 33 percent of tidal and creates game-changing partnership",
        "date": "01232017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint acquires 33 percent of tidal and creates game-changing partnership "
    },
    {
        "content": "U.S. telecom sector could be on the brink of a major consolidation under President Donald Trump's likely more merger-friendly administration  said JP Morgan Securities  which now sees a 90 percent chance of T-Mobile US being involved in a strategic transaction in the next five years.",
        "date": "01232017",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "JP Morgan sees U.S. telecom sector consolidation  T-Mobile deal "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 11 (Fitch) Fitch Ratings has affirmed Sprint Corporation  (Sprint) and its wholly owned subsidiaries Sprint Communications Inc. and  Clearwire Communications LLC's Issuer Default Ratings (IDR) at 'B+'. In  addition  Fitch has assigned a 'BB+/RR1' rating to Sprint's new $3.5 billion  senior secured credit facility  including a $2 billion four-year senior secured  revolving facility and $1.5 billion seven-year secured te",
        "date": "01112017",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Fitch Rates Sprint's Secured Credit Facility 'BB+/RR1'; Affirms IDRs at 'B+' "
    },
    {
        "content": "PALM BEACH  Fla. U.S President-elect Donald Trump said on Wednesday wireless carrier Sprint Corp  will bring 5 000 jobs back to the United States and OneWeb  a new company  will be hiring 3 000 people.",
        "date": "12282016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Trump says Sprint to bring 5 000 jobs back to U.S. "
    },
    {
        "content": "PALM BEACH  Fla. U.S. President-elect Donald Trump on Wednesday said telecommunications group Sprint Corp  and a U.S. satellite company OneWeb will bring 8 000 jobs to the United States  and the companies said the positions were part of a previously disclosed pledge by Japan's SoftBank Group Corp. | Video ",
        "date": "12292016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint  OneWeb say 8 000 jobs announced by Trump are part of SoftBank pledge "
    },
    {
        "content": "Sprint Corp said on Wednesday it would partner with the developer of Pokemon Go  Niantic Inc  in a bid to pull fans of the wildly popular location-based game into more than 10 500 of its stores in the United States.",
        "date": "12072016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint to partner with Pokemon Go developer "
    },
    {
        "content": "* Sprint Corp CEO Marcelo Claure on AT&T-Time Warner deal says its a bold move by AT&T- CNBC",
        "date": "10252016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint CEO on AT&T-Time Warner deal says its a bold move by AT&T- CNBC "
    },
    {
        "content": "* Q2 earnings per share view $-0.07 -- Thomson Reuters I/B/E/S",
        "date": "10252016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint posts 2nd-qtr loss per share of $0.04 "
    },
    {
        "content": "* Sprint Corporation announces pricing of private placement offering of wireless spectrum-backed notes",
        "date": "10202016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint Corp announces pricing of private placement offering "
    },
    {
        "content": "Sprint Corp  the No. 4 U.S. wireless carrier  estimated quarterly operating revenue above analysts' expectations as heavy promotions helped attract more postpaid customers.",
        "date": "10182016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint sees quarterly operating revenue above estimates "
    },
    {
        "content": "* Shares reverse course  down 3.3 pct   (Adds analyst comment  updates share movements)",
        "date": "10182016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Sprint sees quarterly operating revenue above estimates "
    },
    {
        "content": "Oct 18 Sprint Corp  the No. 4 U.S. wireless carrier  estimated a 3 percent rise in second-quarter operating revenue as heavy promotions helped attract more customers.",
        "date": "10182016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint estimates Q2 revenue rose 3 pct "
    },
    {
        "content": "* Sprint waives fees to bermuda following impact of hurricane nicole",
        "date": "10142016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint waives fees to Bermuda following impact of Hurricane Nicole "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 13 (Fitch) Fitch Ratings has affirmed the 'B+' Issuer Default  Rating (IDR) assigned to Sprint Corporation (Sprint) and its wholly owned  subsidiaries Sprint Communications Inc. and Clearwire Communications LLC. The  Rating Outlook is Stable. A full list of ratings follows at the end of the  release. KEY RATING DRIVERS Increased 2.5GHz Portfolio Transparency The affirmation reflects Sprint's expected offering of up to $",
        "date": "10132016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Fitch Affirms Sprint's IDR at 'B+'; Outlook Stable "
    },
    {
        "content": "By Abinaya Vijayaraghavan  Nayyar Rasheed and Sriraj Kalluvila | Video ",
        "date": "10122016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint plans to raise $3.5 billion via sale  lease-back of airwaves "
    },
    {
        "content": "Oct 12 Sprint Corp  the No. 4 U.S. wireless carrier  said on Wednesday it planned to raise an initial $3.5 billion by mortgaging about 14 percent of its wireless airwaves.",
        "date": "10122016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Sprint plans to raise $3.5 bln via sale  lease-back of airwaves "
    },
    {
        "content": "* Sprint Corporation announces private placement offering of wireless spectrum-backed notes",
        "date": "10122016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint Corp announces private placement offering of wireless spectrum-backed notes "
    },
    {
        "content": "Oct 12 Sprint Corp  the No. 4 U.S. wireless carrier  is preparing to mortgage a little more than 10 percent of its wireless airwaves to raise cash  the Wall Street Journal reported on Tuesday  citing people familiar with the matter.",
        "date": "10122016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint to raise $3.5 bln through sale  lease-back of airwaves-WSJ "
    },
    {
        "content": "A U.S. appeals court on Friday revived six Sprint Corp patents at issue in an infringement battle with cable and telephone provider Cox Communications Inc  overturning a Delaware federal judge who had ruled they were too vague to be legally valid.",
        "date": "09232016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint patents ruled valid in Cox Communications fight "
    },
    {
        "content": "* Sprint Samsung Galaxy Note7 customers can get replacement devices beginning next week  Source text for Eikon:  Further company coverage:",
        "date": "09152016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint Samsung Galaxy Note7 customers can get replacement devices beginning next week "
    },
    {
        "content": "* Sprint pre-orders of iPhone 7 and iPhone 7 plus increase nearly four times",
        "date": "09132016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint pre-orders of iPhone 7 and iPhone 7 plus increase nearly 4 times "
    },
    {
        "content": "NEW YORK  Aug 18 Wireless providers T-Mobile US Inc and Sprint Corp on Thursday introduced revamped plans that offer unlimited data  as wireless carriers step up efforts to woo customers.",
        "date": "08182016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "T-Mobile  Sprint roll out revamped unlimited data plans "
    },
    {
        "content": "* Sprint names Jan Geldmacher  former ceo of vodafone global enterprise  as president of Sprint Enterprise  Source text for Eikon:  Further company coverage:",
        "date": "08052016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint names Jan Geldmacher as president of Sprint Enterprise "
    },
    {
        "content": "TOKYO Japan's SoftBank Group Corp  on Thursday flagged a sharp recovery for struggling U.S. unit Sprint  and was bullish about long-term prospects for soon-to-be-acquired UK chip designer ARM .",
        "date": "07282016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "SoftBank sees sharp recovery for Sprint  flags much investment for ARM "
    },
    {
        "content": "* Son to spend much of his time on ARM  wants proactive investment",
        "date": "07282016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 2-SoftBank sees sharp recovery for Sprint  flags much investment for ARM "
    },
    {
        "content": "TOKYO  July 28 SoftBank Group Corp  reported a 0.2 percent increase in first-quarter operating profit as solid profits in its domestic telecommunications business offset losses at U.S. unit Sprint Corp.",
        "date": "07282016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "SoftBank Q1 profit flat  profits at domestic telecoms business solid "
    },
    {
        "content": "Sprint Corp  reported better-than-expected first-quarter revenue as big discounts attracted more postpaid subscribers  and the No. 4 U.S. wireless carrier said it expected to be cash flow positive next fiscal year after breaking even this year.",
        "date": "07252016",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint says to be cash-flow positive next year  shares soar "
    },
    {
        "content": "July 25 Sprint Corp reported better-than-expected first-quarter revenue as big discounts attracted more postpaid subscribers  and the No. 4 U.S. wireless carrier said it expected to be cash flow positive next fiscal year after breaking even this year.",
        "date": "07252016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Sprint says to be cash-flow positive next year  shares soar "
    },
    {
        "content": "* Says expects to have adequate sources to provide capital to fund business and repay debt maturities due in fy16 - conf call  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07252016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint expects to have enough funds to repay FY16 debt-conf call "
    },
    {
        "content": "* Continues to expect fiscal year 2016 operating income of $1 billion to $1.5 billion and adjusted EBITDA of $9.5 billion to $10 billion",
        "date": "07252016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint Q1 loss per share $0.08 "
    },
    {
        "content": "July 25 Sprint Corp  the No.4 U.S. wireless carrier  reported a bigger quarterly loss as the company provided heavy discounts to attract customers.",
        "date": "07252016",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint reports bigger quarterly loss "
    },
    {
        "content": "Patent-assertion entity Prism Technologies LLC cannot claim ongoing royalties on top of the $30 million a jury awarded it in June for infringement by Sprint PCS  a federal judge ruled on Friday.",
        "date": "12222015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Judge: $30 mln patent award against Sprint is enough "
    },
    {
        "content": "* Sprint extends support contract with Birdstep Technology through 2016",
        "date": "12232015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Sprint extends support contract with Birdstep Technology through 2016 "
    },
    {
        "content": "Sprint Corp  said it would raise about $1.1 billion in cash through a sale and lease-back deal with a company whose backers include Japan's SoftBank Group Corp   the U.S. telecom company's majority owner.",
        "date": "11202015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint to raise $1.1 billion from financing deal led by SoftBank "
    },
    {
        "content": "Nov 20 Sprint Corp said it would raise about $1.1 billion in cash through a sale and lease-back deal with a company whose backers include Japan's SoftBank Group Corp   the U.S. telecom company's majority owner.",
        "date": "11202015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Sprint to raise $1.1 bln from financing deal led by SoftBank "
    },
    {
        "content": "Nov 20 Sprint Corp said it would raise about $1.1 billion in cash by selling and then leasing back some leased-out mobile devices to a company whose backers include SoftBank Group Corp.",
        "date": "11202015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint set to raise $1.1 bln from sale/lease-back deal "
    },
    {
        "content": "Customers who switch to Sprint Corp from Verizon  AT&T and T-Mobile will have to pay only half of what they pay for their existing plans  the No.4 U.S. carrier said in a bid to lure users to its network ahead of the holiday season.",
        "date": "11182015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint to halve bills for those who switch from rival networks "
    },
    {
        "content": "Nov 18 Customers who switch to Sprint Corp  from Verizon  AT&T and T-Mobile will have to pay only half of what they pay for their existing plans  the No.4 U.S. carrier said in a bid to lure users to its network ahead of the holiday season.",
        "date": "11182015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Sprint to halve bills for those who switch from rival networks "
    },
    {
        "content": "Nov 18 Customers who switch to Sprint from Verizon  AT&T and T-Mobile will have to pay only half of what they pay for their existing plans  the No.4 U.S. carrier said.",
        "date": "11182015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint offers 50 pct off for users to switch from other carriers "
    },
    {
        "content": "By Jaime Hamre     HAVANA  Nov 6 About 50 American businesses came to Havana this week for a trade expo  many of them intrigued but still unclear how to make money in a Communist-ruled country of 11 million people who have little purchasing power.         With detente raising hopes that full commercial ties could be restored  U.S. companies are being drawn to Cuba. But it is a market whose attraction defies convention  given that foreign businesses complain about the island's bizarre",
        "date": "11062015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "U.S. companies drawn to Cuba  unsure if profits will follow "
    },
    {
        "content": "* Signs co-operation contract for 5 years with Zarzad Drog i Transportu in Lodz (ZDiT in Lodz) and Sprint SA from Olsztyn  Poland",
        "date": "11102015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "BRIEF-Neptis signs co-operation contract with ZDiT in Lodz and Sprint for 5 years "
    },
    {
        "content": "* CEO Son says \"confident\" of Sprint turnaround   (Adds details on Sprint job cuts  details)",
        "date": "11042015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 1-SoftBank Q2 profit rises 39 pct on cost cuts  Sprint improvement "
    },
    {
        "content": "Sprint Corp   the fourth largest U.S. wireless carrier  reported lower-than-expected quarterly results on Tuesday as promotional price cuts drove customer gains but weighed on growth.",
        "date": "11032015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint quarterly results miss forecasts  shares fall 7 percent "
    },
    {
        "content": "- says can save $2 billion a year in Sprint's fixed costs   (Reporting by Makiko Yamazaki)",
        "date": "11042015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Softbank CEO plans Sprint savings  to axe thousands of jobs "
    },
    {
        "content": "Wireless carrier Sprint Corp  on Sunday said it aims to slash its expenses in fiscal year 2016 by as much as $2.5 billion as an essential element of its ongoing turnaround effort  including layoffs and a wide array of cost controls.",
        "date": "11012015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint says aims to slash costs up to $2.5 billion in turnaround effort "
    },
    {
        "content": "Nov 3 Sprint Corp  the fourth largest U.S. wireless carrier  reported lower-than-expected quarterly results on Tuesday as promotional price cuts drove customer gains but weighed on growth.",
        "date": "11032015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 4-Sprint quarterly results miss forecasts  shares fall 7 percent "
    },
    {
        "content": "Nov 1 Wireless carrier Sprint Corp on Sunday said it aims to slash its expenses in fiscal year 2016 by as much as $2.5 billion as an essential element of its ongoing turnaround effort  including layoffs and a wide array of cost controls.",
        "date": "11012015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint says aims to slash costs up to $2.5 bln in turnaround effort "
    },
    {
        "content": "* Says plans to cut fy 2016 operating budget by $2 billion to $2.5 billion through job cuts  cost controls  other means",
        "date": "11012015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Sprint says also evaluating ways to improve wireless network  to match or exceed rivals in quality  speed and capacity "
    },
    {
        "content": "Nov 3 Sprint Corp  the fourth-largest U.S. wireless carrier   reported a smaller quarterly loss as the company turns around its business by cutting costs and upgrading its networks.",
        "date": "11032015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint's net loss narrows as cost cuts take hold "
    },
    {
        "content": "Wireless carrier Sprint Corp  said on Sunday it aims to slash fiscal 2016 expenses by as much as $2.5 billion  through layoffs and a wide array of cost controls  as an essential part of its ongoing turnaround efforts.",
        "date": "11022015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint says aims to slash costs up to $2.5 billion  layoffs loom "
    },
    {
        "content": "Nov 1 Wireless carrier Sprint Corp said on Sunday it aims to slash fiscal 2016 expenses by as much as $2.5 billion  through layoffs and a wide array of cost controls  as an essential part of its ongoing turnaround efforts.",
        "date": "11022015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 2-Sprint says aims to slash costs up to $2.5 bln  layoffs loom "
    },
    {
        "content": "KANSAS CITY  Kan. -- Joey Logano remained the only driver to win a race in the second round of the NASCAR Chase for the Sprint Cup with his victory Sunday in the Hollywood Casino 400 at Kansas Speedway. Logano also won a week earlier at Charlotte Motor Speedway.",
        "date": "10182015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Logano takes second straight chase race "
    },
    {
        "content": "Oct 20 Sprint Corp must face a $300 million fraud lawsuit by New York state claiming the company deliberately failed to bill customers for taxes on its wireless services over seven years  the state's top court ruled on Tuesday.",
        "date": "10202015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint loses bid to dismiss $300 mln N.Y. tax fraud lawsuit "
    },
    {
        "content": "Sprint Corp  must face a $300 million fraud lawsuit by New York state claiming the company deliberately failed to bill customers for taxes on its wireless services over seven years  the state's top court ruled on Tuesday.",
        "date": "10202015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint loses bid to dismiss $300 million N.Y. tax fraud lawsuit "
    },
    {
        "content": "Oct 20 Sprint Corp must face a $300 million fraud lawsuit by New York state claiming the company deliberately failed to bill customers for taxes on its wireless services over seven years  the state's top court ruled on Tuesday.",
        "date": "10202015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Sprint loses bid to dismiss $300 mln N.Y. tax fraud lawsuit "
    },
    {
        "content": "* Domino's Pizza Enterprises Ltd says: initial cash consideration of 31.5 million euros  with a further 3.5 million euros in cash in instalments",
        "date": "10142015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "CORRECTED-Brief-Dominos Pizza Enterprises enters agreement to acquire Pizza Sprint chain in France "
    },
    {
        "content": "Sprint Corp plans to cut an unspecified amount of jobs and about $2-$2.5 billion in costs in the next six months  the Wall Street Journal reported  citing an internal memo.",
        "date": "10012015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint to cut jobs  reduce up to $2.5 billion in costs: WSJ "
    },
    {
        "content": "Oct 1 Sprint Corp plans to cut an unspecified amount of jobs and about $2-$2.5 billion in costs in the next six months  the Wall Street Journal reported  citing an internal memo.",
        "date": "10012015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint to cut jobs  reduce up to $2.5 bln in costs - WSJ "
    },
    {
        "content": "NEW YORK  Sept 26 Sprint Corp will not join the U.S. government's auction of airwaves set for early 2016  as it has adequate airwaves to currently build out its network and for its future needs  the company said on Saturday.",
        "date": "09262015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint says will sit out of 2016 airwaves auction "
    },
    {
        "content": "NEW YORK  Sept 26 Sprint Corp will not join the U.S. government's auction of airwaves set for early 2016  as it has adequate airwaves to currently build out its network and for its future needs  the company said on Saturday.",
        "date": "09262015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Sprint says will sit out of 2016 airwaves auction "
    },
    {
        "content": "NEW YORK Sprint Corp  could be stronger if merged with a cable company  the U.S wireless company's chief executive said on Thursday  adding that he was not engaged in any such merger talks.",
        "date": "09242015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint could be 'formidable' after merger with cable company  CEO says "
    },
    {
        "content": "Sprint Corp announced a $1 per month plan for Apple Inc's new iPhone  upping the ante in a battle among top U.S. carriers to sign up customers ahead of the phone's launch on Friday.",
        "date": "09242015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint unveils $1 plan ahead of new iPhone launch "
    },
    {
        "content": "Sept 24 Sprint Corp announced a $1 per month plan for Apple Inc's new iPhone  upping the ante in a battle among top U.S. carriers to sign up customers ahead of the phone's launch on Friday.",
        "date": "09242015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "REFILE-UPDATE 1-Sprint unveils $1 plan ahead of new iPhone launch "
    },
    {
        "content": "Sept 24 Sprint Corp announced a $1 per month plan for Apple Inc's new iPhone  upping the ante in a battle among top U.S. carriers to sign up customers ahead of the phone's launch on Friday.",
        "date": "09242015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint unveils $1 plan for new iPhones "
    },
    {
        "content": "SAN FRANCISCO  Sept 18 Sprint Corp said it plans to expand roaming to Cuba but did not offer a set time frame or any additional details.",
        "date": "09182015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint says to expand roaming to Cuba "
    },
    {
        "content": "Sept 11 Want to own the new iPhone without burning a hole in your pocket every month? Sprint seems to be the cheapest option in the United States.",
        "date": "09112015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint's plan for new iPhone trumps other U.S. carriers "
    },
    {
        "content": "Japanese telecoms group SoftBank Group Corp   the majority owner of U.S. wireless carrier Sprint Corp   said it bought an additional 22.9 million shares in Sprint at a weighted average price of $3.80.",
        "date": "08132015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "SoftBank acquires more shares in Sprint for about $87 million "
    },
    {
        "content": "Aug 12 Japanese telecoms group SoftBank Group Corp  the majority owner of U.S. wireless carrier Sprint Corp  said it bought an additional 22.9 million shares in Sprint at a weighted average price of $3.80.",
        "date": "08132015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-SoftBank acquires more shares in Sprint for about $87 mln "
    },
    {
        "content": "TOKYO SoftBank Corp  announced a near $1 billion share buyback and a higher quarterly profit as loss-making Sprint Corp  fared better than expected  with the Japanese telecoms group forecasting \"light at the end of the tunnel\" for its U.S. unit.",
        "date": "08062015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "SoftBank plans near $1 billion buyback as confidence in Sprint renewed "
    },
    {
        "content": "* Q1 operating profit 344 bln Y vs 320 bln analysts' avg estimate",
        "date": "08062015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 2-SoftBank plans near $1 bln buyback as confidence in Sprint renewed "
    },
    {
        "content": "TOKYO  Aug 6 Japanese telecoms conglomerate SoftBank Corp reported on Thursday its quarterly operating profit rose 8 percent and declared it was seeing \"the light at the end of the tunnel\" for its loss-making U.S. unit Sprint Corp.",
        "date": "08062015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "SoftBank Q1 profit rises  sees light at end of tunnel on Sprint "
    },
    {
        "content": "* SoftBank says sees \"light at the end of the tunnel\" for Sprint   Source text for Eikon:  Further company coverage:    (Reporting by Ritsuko Ando)",
        "date": "08062015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-SoftBank says sees 'light at the end of the tunnel' for Sprint "
    },
    {
        "content": "NEW YORK SoftBank Group Corp  the majority owner of Sprint Corp  said on Tuesday it will set up two financing vehicles to help the struggling U.S. wireless carrier reverse its fortunes  but a long road to recovery lies ahead.",
        "date": "08042015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "SoftBank to help provide financing to rein in Sprint's cash burn "
    },
    {
        "content": "Aug 3 Sprint Corp on Monday said Chief Financial Officer Joseph Euteneuer will be leaving the company  and named Tarek Robbiati to succeed him.",
        "date": "08032015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint names new CFO in management shake-up "
    },
    {
        "content": "NEW YORK  Aug 4 SoftBank Group Corp  the majority owner of Sprint Corp  said on Tuesday it will set up two financing vehicles to help the struggling U.S. wireless carrier reverse its fortunes  but a long road to recovery lies ahead.",
        "date": "08042015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "REFILE-SoftBank to help provide financing to rein in Sprint's cash burn "
    },
    {
        "content": "Sprint Corp  reported a much smaller-than-expected quarterly loss on Tuesday  and majority owner SoftBank Corp  assuaged investors' concerns by saying it had no plans to sell its stake in the wireless carrier.",
        "date": "08042015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint reports smaller-than-expected loss; SoftBank to keep stake "
    },
    {
        "content": "Aug 3 Sprint Corp  the No. 3 U.S. cellular operator  said Chief Financial Officer Joseph Euteneuer will be leaving the company and named Tarek Robbiati as his successor in one of many executive changes announced on Monday.",
        "date": "08032015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Sprint names new CFO in management shake-up "
    },
    {
        "content": "* Shares up nearly 5 percent   (Adds analyst quote  details on SoftBank)",
        "date": "08042015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Sprint reports smaller-than-expected loss; SoftBank to keep stake "
    },
    {
        "content": "Aug 4 Sprint Corp's quarterly revenue fell 8.7 percent as revenue from its wireless business declined  and new and existing customers opted for its installment plans.",
        "date": "08042015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Wireless carrier Sprint's revenue falls 8.7 pct "
    },
    {
        "content": "LONDON British electrical goods and mobile phone retailer Dixons Carphone  has sealed a deal with Sprint Corp.   the U.S. mobile network operator  that could see it open and manage up to 500 Sprint-branded stores in the United States.",
        "date": "07022015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Dixons Carphone in deal with Sprint to open U.S. stores "
    },
    {
        "content": "LONDON  July 2 British electrical goods and mobile phone retailer Dixons Carphone has sealed a deal with Sprint Corp.  the U.S. mobile network operator  that could see it open and manage up to 500 Sprint-branded stores in the United States.",
        "date": "07022015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Dixons Carphone in deal with Sprint to open U.S. stores "
    },
    {
        "content": "LONDON  July 2 British electrical goods and mobile phone retailer Dixons Carphone said its Connected World Services (CWS) division has signed a deal with Sprint Corp.  the U.S. mobile network operator  to open and manage Sprint-branded stores in the U.S..",
        "date": "07022015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Dixons Carphone unit in deal with Sprint Corp to open U.S. stores "
    },
    {
        "content": "NEW YORK  June 30 A U.S. judge signed off on Tuesday on a $50 million settlement between the Consumer Financial Protection Bureau and Sprint Corp over claims the mobile carrier added unauthorized charges to customer phone bills.",
        "date": "06302015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "U.S. judge signs off on Sprint's $50 mln 'cramming' settlement "
    },
    {
        "content": "* Connected World Services signs agreement with Sprint Corporation to open U.S. stores.",
        "date": "07022015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-Dixons Carphone arm in deal with Sprint Corp to open U.S. stores "
    },
    {
        "content": "NEW YORK A U.S. judge signed off on Tuesday on a $50 million settlement between the Consumer Financial Protection Bureau and Sprint Corp over claims the mobile carrier added unauthorized charges to customer phone bills.",
        "date": "06302015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "U.S. judge signs off on Sprint's $50 million 'cramming' settlement "
    },
    {
        "content": "NEW YORK  June 30 Sprint Corp said on Tuesday it will offer an $80 a month cellular phone plan  including both service and smartphone device fees  hoping to draw users who dislike complex price plans and hidden costs.",
        "date": "06302015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint rolls out all-included rate plan "
    },
    {
        "content": "(Corrects headline to \"for intelligent Wi-Fi network\" from \"to construct and manage an intelligent\")  June 8 Cisco Systems Inc :   * Cisco  Sprint  and Kansas City  announce agreement to deploy smart+connected city framework   * Says Sprint will deploy Cisco hardware to construct and manage an intelligent wi-fi network   * Source text for Eikon    * Further company coverage",
        "date": "06082015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "CORRECTED-BRIEF- Cisco says Sprint to deploy Cisco hardware for intelligent Wi-Fi network "
    },
    {
        "content": "NEW YORK  June 4 A merger of T-Mobile US Inc  and satellite TV company Dish Network Corp  could force Sprint Corp to pursue a deal or partnership itself.",
        "date": "06052015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "RPT-Deal between T-Mobile and Dish could spell trouble for Sprint "
    },
    {
        "content": "* Deutsche Telekom shares top German blue-chips   (Adds Sprint's strategic options)",
        "date": "06042015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 8-Dish  T-Mobile US talk merger  wireless spectrum a key factor "
    },
    {
        "content": "NEW YORK  June 4 A merger of T-Mobile US Inc  and satellite TV company Dish Network Corp  could force Sprint Corp to pursue a deal or partnership itself.",
        "date": "06042015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Deal between T-Mobile and Dish could spell trouble for Sprint "
    },
    {
        "content": "* SoftBank expands overseas to counter slow growth at home   (Adds details from announcement  background on Korea e-commerce market)",
        "date": "06032015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 1-SoftBank to invest $1 bln in Korean e-commerce site Coupang "
    },
    {
        "content": "NEW YORK A federal judge said on Tuesday he would not approve a proposed $50 million settlement between the Consumer Financial Protection Bureau and Sprint Corp over claims the mobile carrier added unauthorized charges to phone bills unless the two sides provide additional details about its fairness.",
        "date": "05192015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Federal judge demands details on Sprint $50 million 'cramming' settlement "
    },
    {
        "content": "NEW YORK  May 19 A federal judge said on Tuesday he would not approve a proposed $50 million settlement between the Consumer Financial Protection Bureau and Sprint Corp  over claims the mobile carrier added unauthorized charges to phone bills unless the two sides provide additional details about its fairness.",
        "date": "05192015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "U.S. judge demands details on Sprint $50 mln 'cramming' settlement "
    },
    {
        "content": "TOKYO  May 11 SoftBank Corp reported on Monday a 9 percent fall in profit for the fiscal year just ended  hurt by the absence of one-time gains enjoyed the year before  while it has been weighed down by the costs of trying to turn around U.S. unit Sprint.",
        "date": "05112015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "SoftBank posts 9 pct drop in full-year profit  skips forecast "
    },
    {
        "content": "WASHINGTON Verizon Communications Inc will pay $90 million and Sprint Corp will pay $68 million to settle U.S. government probes into unauthorized charges tacked onto their customers' phone bills  federal agencies said on Tuesday.",
        "date": "05122015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Verizon  Sprint to pay $158 million over unauthorized phone charges "
    },
    {
        "content": "SAN FRANCISCO  May 13 The auction for bankrupt electronic retailer RadioShack's brand and customer data has closed with the Standard General hedge fund posting a winning bid of $26.2 million after objections piled up to their sale.",
        "date": "05132015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Standard General makes top offer for RadioShack name  customer data "
    },
    {
        "content": "SAN FRANCISCO The auction for bankrupt electronic retailer RadioShack's name and customer data will resume on Tuesday with bidding at $15 million  according to a lawyer tracking the sale.",
        "date": "05122015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "In auction for RadioShack name  bid stands at $15 million "
    },
    {
        "content": "WASHINGTON  May 12 Verizon Communications Inc  will pay $90 million and Sprint Corp will pay $68 million to settle U.S. government probes into unauthorized charges tacked onto their customers' phone bills  federal agencies said on Tuesday.",
        "date": "05122015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Verizon  Sprint to pay $158 million over unauthorized phone charges "
    },
    {
        "content": "SAN FRANCISCO  May 12 The auction for bankrupt electronic retailer RadioShack's name and customer data will resume on Tuesday with bidding at $15 million  according to a lawyer tracking the sale.",
        "date": "05122015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "In auction for RadioShack name  bid stands at $15 mln "
    },
    {
        "content": "WASHINGTON  May 12 Verizon Communications Inc  will pay $90 million and Sprint Corp will pay $68 million to settle federal government probes into unauthorized charges tacked onto their customers' phone bills in a practice known as cramming  U.S. agencies said on Tuesday.",
        "date": "05122015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Verizon  Sprint to pay millions over unauthorized phone charges "
    },
    {
        "content": " ",
        "date": "05122015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "REUTERS BUSINESS NEWS SCHEDULE 1500 GMT/11 AM ET "
    },
    {
        "content": "NEW YORK  May 12 Sprint Corp has agreed to provide as much as $50 million of consumer relief to resolve a U.S. government lawsuit accusing the mobile carrier of letting third parties tack unauthorized charges on to customers' bills  a practice known as cramming.",
        "date": "05122015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-Sprint offers to reimburse up to $50 mln for unauthorized charges "
    },
    {
        "content": "NEW YORK  May 12 Sprint Corp has agreed to provide as much as $50 million of consumer relief to resolve a U.S. Consumer Financial Protection Bureau lawsuit accusing the phone company of letting third parties tack unauthorized charges on to customers' phone bills.",
        "date": "05122015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint settles 'cramming' lawsuit  offers up to $50 mln relief "
    },
    {
        "content": "Sprint Corp  added 1.2 million net customers and reported a 6.7 percent drop in revenue in the fiscal fourth quarter as the No.3 U.S. wireless company ramped up its turnaround efforts.",
        "date": "05052015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint adds customers  revenues slip during turnaround "
    },
    {
        "content": "May 5 Sprint Corp added 1.2 million net customers and reported a 6.7 percent drop in revenue in the fiscal fourth quarter as the No.3 U.S. wireless company ramped up its turnaround efforts.",
        "date": "05052015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Sprint adds customers  revenues slip during turnaround "
    },
    {
        "content": "May 5 Sprint Corp's quarterly revenue fell 6.7 percent as the U.S. mobile provider aggressively cut prices and offered promotions to attract more subscribers.",
        "date": "05052015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint revenue falls 6.7 pct as promotion costs weigh "
    },
    {
        "content": "NEW YORK/WASHINGTON Comcast Corp's  board was meeting late on Thursday to finalize plans to abandon its proposed $45 billion merger with  Time Warner Cable Inc   according to a person directly familiar with the matter.",
        "date": "04242015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Comcast plans to drop Time Warner Cable merger -source "
    },
    {
        "content": "* Senator Franken: Collapse would be \"huge victory\" for consumers   (Recasts with new sourcing; adds quote from advocacy group  background)",
        "date": "04232015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Comcast looking to drop Time Warner Cable merger -source "
    },
    {
        "content": "* Internet service  online video key competitive issues   (Adds market share  lobbying  CEO outreach to FCC)",
        "date": "04242015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 4-Comcast plans to drop Time Warner Cable merger -source "
    },
    {
        "content": "MIAMI Boost Mobile  part of Sprint Corp  on Thursday launched a prepaid plan for U.S. consumers calling and texting Cuba  taking advantage of new  relaxed U.S. commercial regulations with the Communist-run island nation.",
        "date": "04162015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint unit launches prepaid cell-phone service to Cuba "
    },
    {
        "content": "MIAMI  April 16 Boost Mobile  part of Sprint Corp  on Thursday launched a prepaid plan for U.S. consumers calling and texting Cuba  taking advantage of new  relaxed U.S. commercial regulations with the communist-run island nation.",
        "date": "04162015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint unit launches prepaid cellphone service to Cuba "
    },
    {
        "content": "A plan to salvage RadioShack Corp's  business by co-branding most of its 1 740 surviving stores with cellular phone provider Sprint Corp earned U.S. bankruptcy court approval on Tuesday  ending four days of contested court hearings.",
        "date": "03312015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "RadioShack co-branding of stores with Sprint wins court approval "
    },
    {
        "content": "March 31 A plan to salvage RadioShack Corp's  business by co-branding most of its 1 740 surviving stores with cellular phone provider Sprint Corp earned U.S. bankruptcy court approval on Tuesday  ending four days of contested court hearings.",
        "date": "03312015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 1-RadioShack co-branding of stores with Sprint wins court approval "
    },
    {
        "content": "Sprint Corp has agreed to a $131 million settlement of a class-action lawsuit accusing the third-largest U.S. wireless carrier of defrauding investors about problems dating back to its $36 billion merger with Nextel Communications Inc in 2005.",
        "date": "03312015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint settles U.S. class-action lawsuit for $131 million "
    },
    {
        "content": "March 31 Sprint Corp has agreed to a $131 million settlement of a class-action lawsuit accusing the third-largest U.S. wireless carrier of defrauding investors about problems dating back to its $36 billion merger with Nextel Communications Inc in 2005.",
        "date": "03312015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 2-Sprint settles U.S. class-action lawsuit for $131 million "
    },
    {
        "content": "March 31 Sprint Corp has agreed to a $131 million settlement of a lawsuit accusing it of defrauding shareholders by issuing false and misleading statements about its tightened credit standards  improvements in its subscriber base  and the success of its merger with Nextel Communications Inc.",
        "date": "03312015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint settles shareholder lawsuit for $131 mln "
    },
    {
        "content": "March 24 Hedge fund Standard General has raised its bid to buy about 1 740 stores of bankrupt electronics retailer RadioShack Corp in a court-supervised auction  according to people familiar with the process  which entered its second day on Tuesday.",
        "date": "03242015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Standard General raises bid for RadioShack in bankruptcy auction "
    },
    {
        "content": "WILMINGTON  Del  Feb 20 Bankrupt electronics retailer RadioShack Corp received court approval on Friday for its plan to try to sell the leases to more than 1 100 stores that it will close by the end of February.",
        "date": "02202015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "RadioShack cleared to sell leases to 1 100 abandoned stores "
    },
    {
        "content": "Feb 12 Bankrupt electronics retailer RadioShack Corp kicked off a process to auction leases of about 1 700 stores to avoid paying an estimated $7 million in rent next month.",
        "date": "02122015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "RadioShack starts process to auction 1 700 store leases "
    },
    {
        "content": "TOKYO Japan's SoftBank Corp said third-quarter operating profit slid nearly 6 percent  missing estimates  as the ambitious mobile telecom firm continues to soak up the cost of trying to turn around loss-making U.S. unit Sprint Corp.",
        "date": "02102015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Japan's SoftBank third quarter profit slips 5.9 percent  dragged down by Sprint costs "
    },
    {
        "content": "* CEO repeats Sprint still faces 'long  tough battle'   (Adds details on Sprint strategy  earnings)",
        "date": "02102015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 2-Japan's SoftBank Q3 profit slips 5.9 pct  dragged down by Sprint costs "
    },
    {
        "content": "* Says SoftBank in general doing well but Sprint has a long battle to fight   Further company coverage:     (Reporting by Teppei Kasai)",
        "date": "02102015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "BRIEF-SoftBank CEO says in general doing well but Sprint has long battle "
    },
    {
        "content": "TOKYO  Feb 10 Japan's SoftBank Corp  said on Tuesday its third-quarter operating profit slipped 5.9 percent  missing estimates  as the ambitious mobile telecom firm continues to soak up costs in its drive to turn around loss-making U.S. unit Sprint Corp.",
        "date": "02102015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Japan's SoftBank Q3 operating profit slips 5.9 pct as Sprint costs weigh "
    },
    {
        "content": "SAN FRANCISCO With its surprise endorsement of a stricter U.S. regulatory regime for Internet service providers  Sprint Corp  wanted to show that tougher rules would not stop rival telecom players from investing  Chief Technology Officer Stephen Bye said in an interview.",
        "date": "02112015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Sprint says U.S. telecoms will invest despite stronger net neutrality "
    },
    {
        "content": "Comcast Corp  the largest U.S. cable operator  has been ordered to pay nearly $28 million in damages after a federal jury in Delaware found it infringed two fiber optics patents owned by Sprint Corp.",
        "date": "02062015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "Comcast to pay $27.6 mln for infringing two Sprint patents "
    },
    {
        "content": "Feb 6 A lawyer for RadioShack on Friday said the bankrupt electronics chain would accept all kinds of bids for its assets  including from liquidators  although any transaction would require court approval.",
        "date": "02062015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "RadioShack would accept liquidation bids -lawyer "
    },
    {
        "content": "Feb 5 Electronics retailer RadioShack Corp  filed for U.S. bankruptcy protection on Thursday and said it had a deal in place to sell as many as 2 400 stores to an affiliate of hedge fund Standard General  its lender and largest shareholder.",
        "date": "02052015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 2-RadioShack files for bankruptcy  sell up to 2 400 stores "
    },
    {
        "content": "Electronics retailer RadioShack Corp  filed for U.S. bankruptcy protection on Thursday and said it had a deal in place to sell as many as 2 400 stores to an affiliate of hedge fund Standard General  its lender and largest shareholder.",
        "date": "02062015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "RadioShack files for bankruptcy; Sprint to take over some stores "
    },
    {
        "content": "Feb 5 Electronics retailer RadioShack Corp  filed for U.S. bankruptcy protection on Thursday and said it had a deal in place to sell as many as 2 400 stores to an affiliate of hedge fund Standard General  its lender and largest shareholder.",
        "date": "02062015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-RadioShack files for bankruptcy; Sprint to take over some stores "
    },
    {
        "content": "Electronics retailer RadioShack Corp  filed for U.S. bankruptcy protection on Thursday and said it had a deal in place to sell as many as 2 400 stores to Sprint and an affiliate of hedge fund Standard General  its lender and largest shareholder.",
        "date": "02052015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "RadioShack files for bankruptcy  sell up to 2 400 stores "
    },
    {
        "content": "Feb 5 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "02052015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Feb 2 Amazon.com Inc and Sprint Corp  are considering acquiring some RadioShack stores after the troubled electronics retailer files for bankruptcy  Bloomberg reported  citing people with knowledge of the discussions.",
        "date": "02032015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 3-Amazon.com  Sprint consider buying some Radioshack stores - BBG "
    },
    {
        "content": "Sprint Corp's  quarterly revenue fell less than expected as the U.S. mobile provider attracted more subscribers by cutting prices and offering promotions  driving its shares up more than 6 percent on Thursday.",
        "date": "02052015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint's revenue beats estimates as price cuts draw subscribers "
    },
    {
        "content": "SAN FRANCISCO  Feb 5 Sprint Corp aims to expand its retail footprint with 500 stores this year and is considering troubled electronics retail chain Radioshack's  prime real estate  Chief Executive Marcelo Claure told Reuters on Friday.",
        "date": "02052015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint to add 500 stores  eyeing Radioshack 'real estate' -CEO "
    },
    {
        "content": "Feb 2 Troubled electronics retailer RadioShack Corp is preparing to shut down the chain in a bankruptcy deal that would see half the stores taken over by Sprint Corp   Bloomberg News reported  citing people with knowledge of the discussions.",
        "date": "02022015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "UPDATE 2-RadioShack may close  Sprint to get half of chain - BBG "
    },
    {
        "content": "Feb 2 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "02022015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Feb 2 Troubled electronics retailer RadioShack Corp is preparing to shut down the chain in a deal that would see half the stores taken over by Sprint Corp  Bloomberg News reported  citing people with knowledge of the discussions.",
        "date": "02022015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "Sprint to take over half of RadioShack stores - Bloomberg "
    },
    {
        "content": "Feb 5 Sprint Corp's quarterly revenue fell less than expected as the U.S. mobile provider attracted more subscribers by cutting prices and offering promotions  driving its shares up more than 6 percent on Thursday.",
        "date": "02052015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "UPDATE 3-Sprint's revenue beats estimates as price cuts draw subscribers "
    },
    {
        "content": "TOKYO Japan's SoftBank Corp  said on Thursday it would not recognize in its consolidated financial statements the $2.1  billion impairment charge made by its majority-owned U.S. telecoms network operator Sprint Corp   because of differing accounting standards.",
        "date": "02052015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "SoftBank says will not consolidate Sprint's $2 billion impairment charge "
    },
    {
        "content": "TOKYO Japan's SoftBank Corp said on Monday it plans to sell a 450 billion yen ($3.8 billion) unsecured subordinated bond  mainly to retail investors  with proceeds earmarked for investment and to repay loans.",
        "date": "01262015",
        "name": "Sprint Corporation",
        "news_type": "topStory",
        "symbol": "S",
        "title": "SoftBank to sell $3.8 billion bond to retail investors "
    },
    {
        "content": "TOKYO  Feb 5 Japan's SoftBank Corp said on Thursday it would not recognise in its consolidated financial statements the $2.1  billion impairment charge made by its majority-owned U.S. telecoms network operator Sprint Corp  because of differing accounting standards.",
        "date": "02052015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "CORRECTED-SoftBank says will not consolidate Sprint's $2 bln impairment charge "
    },
    {
        "content": "RadioShack Corp  expected to file for bankruptcy next month  is in talks to sell leases on some of its stores to telecoms operator Sprint Corp  Bloomberg said  citing a person with direct knowledge of the matter.",
        "date": "01152015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "RadioShack in talks to sell leases on stores to Sprint: Bloomberg "
    },
    {
        "content": "Jan 15 RadioShack Corp  expected to file for bankruptcy next month  is in talks to sell leases on some of its stores to telecoms operator Sprint Corp  Bloomberg said  citing a person with direct knowledge of the matter.",
        "date": "01152015",
        "name": "Sprint Corporation",
        "news_type": "normal",
        "symbol": "S",
        "title": "RadioShack in talks to sell leases on stores to Sprint - Bloomberg "
    }
]