[
    {
        "content": "LONDON  Nov 13 British car insurance underwriter Sabre will seek to raise around 213 million pounds ($279.22 million) in an initial public offering in London next month  the company said on Monday.",
        "date": "11132017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "UPDATE 1-British car insurer Sabre seeks $280 mln listing in London "
    },
    {
        "content": "LONDON  Nov 13 British car insurance underwriter Sabre will seek to raise around 213 million pounds ($279.22 million) in an initial public offering on the London Stock Exchange in December  the company said on Monday.",
        "date": "11132017",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "British car insurer Sabre seeks $280 mln listing in London "
    },
    {
        "content": "* Sabre Corp- ‍Consolidated Q3 revenue increased 7.3 pct to $900.6 million​",
        "date": "10312017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre posts 7.3 pct rise in revenue "
    },
    {
        "content": "* Sabre Corp -  Co renewed partnership with Avianca for Sabre Aircentre Flight Explorer Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Avianca Airlines and Sabre renew technology partnership "
    },
    {
        "content": "LONDON  Sept 12 British motor insurer Sabre is planning an initial public offering (IPO) that could value it at 600 million pounds ($800 million) after failing to find a buyer  sources with knowledge of the matter said.",
        "date": "09122017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "British motor insurer Sabre to pursue $800 mln listing - sources "
    },
    {
        "content": "* Ethiopian Airlines signs up for Sabre passenger reservations technology solution Source text for Eikon: Further company coverage:",
        "date": "08312017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Ethiopian Airlines signs up for Sabre passenger reservations technology solution "
    },
    {
        "content": "* Sabre Corporation announces refinancing of term loan B  term loan A and revolver",
        "date": "08232017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre Corp announces refinancing of term loan B  term loan A and revolver "
    },
    {
        "content": "* Sabre Corp - ‍ Saoji will join Sabre from GE Healthcare Digital  where he serves as CTO for software engineering​ Source text for Eikon: Further company coverage:",
        "date": "08142017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre names Vish Saoji as chief technology officer "
    },
    {
        "content": "* Hartz Hotel - ‍beginning on June 6  Sabre notified affected entities that unauthorized party gained access to account credentials",
        "date": "08032017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Hartz Hotel Services says notified that unauthorized party gained access to account credentials "
    },
    {
        "content": "* Sabre names Clinton Anderson as president  Hospitality Solutions Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre names Clinton Anderson as president  Hospitality Solutions "
    },
    {
        "content": "* Woodside Hotels and Resorts notifies customers of third party payment card security incident",
        "date": "07212017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Woodside Hotels and Resorts notifies customers of third party payment card security incident "
    },
    {
        "content": "July 12 Trump International Hotels Management LLC said late on Tuesday a data breach at a service provider compromised card payment details at 14 of its properties.",
        "date": "07122017",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "Trump Hotels discloses data breach at 14 properties "
    },
    {
        "content": "* Brown Brothers Harriman reports 5.15 pct passive stake in Sabre Corp as of June 27 - SEC filing Source text: (http://bit.ly/2sWoFvj) Further company coverage:",
        "date": "06292017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Brown Brothers Harriman reports 5.15 pct passive stake in Sabre "
    },
    {
        "content": "* Sabre chooses inap for new multi-year ip services agreement at inap's dallas data center Source text for Eikon: Further company coverage:",
        "date": "05102017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre sign multi-year IP services agreement with Internap "
    },
    {
        "content": "* Q1 adjusted earnings per share $0.42 from continuing operations",
        "date": "05022017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre Q1 earnings per share $0.27 "
    },
    {
        "content": "* Says will provide consulting services to several of its member airlines through a new agreement with African Airlines Association Source text for Eikon: Further company coverage:",
        "date": "04052017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre Corp to provide consulting services to AFRAA member airlines "
    },
    {
        "content": "* Sabre Corp- CEO Sean Menke's 2016 total compensation $5.5 million versus $3.8 million - sec filing",
        "date": "03212017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre CEO Sean Menke's 2016 total compensation $5.5 mln vs $3.8 mln "
    },
    {
        "content": "* On Feb. 22  co's unit entered into term facility amendment dated feb 22 to its senior secured credit facilities",
        "date": "02242017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre's unit entered into term facility amendment "
    },
    {
        "content": "* Sabre Corporation announces closing of incremental term loan and amendments to its credit facility  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre Corp announces closing of incremental term loan "
    },
    {
        "content": "* SABRE CORP SAYS HAS SIGNED A NEW AGREEMENT WITH KINGDOM OF BAHRAIN'S NATIONAL CARRIER  GULF AIR",
        "date": "02082017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-SABRE CORP SAYS SIGNED NEW AGREEMENT WITH GULF AIR "
    },
    {
        "content": "* Announced increase in quarterly targeted dividend to $0.14 per shar",
        "date": "02072017",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre posts Q4 earnings per share of $0.09 "
    },
    {
        "content": "NEW YORK American Airlines Group Inc  on Tuesday won about $15.3 million in an antitrust lawsuit that accused airline booking service Sabre Corp  of harming competition and charging grossly inflated booking fees.",
        "date": "12202016",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "American Airlines wins $15 million in antitrust case against Sabre "
    },
    {
        "content": "American Airlines Group Inc and Alaska Air Group Inc said on Friday an outage related to a technical issue at reservation services provider Sabre Corp's computer systems has been resolved.",
        "date": "11112016",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "U.S. airlines say outage linked to tech glitch at Sabre resolved "
    },
    {
        "content": "Nov 11 American Airlines Group Inc and Alaska Air Group Inc on Friday experienced a brief computer outage caused due to a technical issue at reservation vendor Sabre Corp.",
        "date": "11112016",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "U.S. airlines face brief computer outage "
    },
    {
        "content": "* American Airlines says earlier today  Sabre had brief technical issue that impacted multiple carriers  issue has been resolved- Spokesman  Further company coverage:",
        "date": "11112016",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "BRIEF-American Airlines says Sabre technical issue that impacted multiple carriershas been resolved "
    },
    {
        "content": "* Sabre Corp on system outage says 'systems have recovered'- tweet",
        "date": "11112016",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "BRIEF-Sabre Corp says systems have recovered after outage- tweet "
    },
    {
        "content": "* Sabre announces $100 million share repurchase program  Source text for Eikon:  Further company coverage:",
        "date": "11032016",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre announces $100 million share repurchase program "
    },
    {
        "content": "* Q3 adjusted earnings per share $0.27 from continuing operations",
        "date": "11022016",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre posts Q3 earnings of $0.14/share "
    },
    {
        "content": "Sabre Corp said on Monday it had fixed a technical issue that affected booking services of its U.S. airline partners such as Southwest Airlines Co  Virgin America and JetBlue Airways Corp.",
        "date": "10182016",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "U.S. airlines booking services resume after Sabre fixes tech glitch "
    },
    {
        "content": "Oct 17 Sabre Corp said on Monday it had fixed a technical issue that affected booking services of its U.S. airline partners such as Southwest Airlines Co  Virgin America and JetBlue Airways Corp.",
        "date": "10182016",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "UPDATE 2-U.S. airlines booking services resume after Sabre fixes tech glitch "
    },
    {
        "content": "* Sabre - Technical issue that impacted some of airline  travel agent customers has been resolved; partners  subscribers reporting systems are back up",
        "date": "10182016",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "BRIEF-Sabre says technical issue that impacted some of airline  travel agent customers has been resolved "
    },
    {
        "content": "* Jetblue Airways - Earlier issues with Sabre have been resolved  and customers can now book flights or change existing reservations",
        "date": "10182016",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "BRIEF-Jetblue Airways says earlier issues with Sabre have been resolved "
    },
    {
        "content": "* Q2 adjusted earnings per share $0.37 from continuing operations",
        "date": "08022016",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre reports Q2 adj EPS $0.37 from continuing operations "
    },
    {
        "content": "* Closing of an incremental revolving credit facility and an incremental term loan credit facility",
        "date": "07182016",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre Corp announces closing of incremental revolver "
    },
    {
        "content": "* Says reiterates Full-Year 2016 guidance and medium-term goals",
        "date": "06202016",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-CEO of Sabre Tom Klein to resign effective Dec. 31 "
    },
    {
        "content": "* Q1 adjusted earnings per share $0.41 from continuing operations",
        "date": "04282016",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Sabre posts Q1 earnings $0.33/shr from continuing operations "
    },
    {
        "content": "NEW YORK  Dec 8 A federal judge on Tuesday restored US Airways Inc's ability to seek roughly $210 million of damages in its antitrust lawsuit accusing Sabre Corp  of inflating booking fees  even after the carrier had waived damages exceeding a mere $20.",
        "date": "12082015",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "U.S. judge restores US Airways' damages claims in Sabre antitrust case "
    },
    {
        "content": "NEW YORK A federal judge on Tuesday restored US Airways Inc's ability to seek roughly $210 million of damages in its antitrust lawsuit accusing Sabre Corp of inflating booking fees  even after the carrier had waived damages exceeding a mere $20.",
        "date": "12082015",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "Judge restores U.S. Airways' damages claims in Sabre antitrust case "
    },
    {
        "content": "China-linked hackers attacked the computer systems of travel reservations distributor Sabre Corp  and American Airlines Group Inc   Bloomberg reported  although the world's largest airline said there was no evidence of such a breach.",
        "date": "08072015",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "China-linked hackers attack American Airlines  Sabre systems: Bloomberg "
    },
    {
        "content": "Aug 7 China-linked hackers attacked the computer systems of travel reservations distributor Sabre Corp  and American Airlines Group Inc  Bloomberg reported  although the world's largest airline said there was no evidence of such a breach.",
        "date": "08072015",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "UPDATE 2-China-linked hackers attack American Airlines  Sabre systems - Bloomberg "
    },
    {
        "content": "Aug 7 China-linked hackers have breached the computer systems of U.S. airline company American Airline Group Inc and travel reservations platform provider Sabre Corp   Bloomberg reported  citing people familiar with the investigations.",
        "date": "08072015",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "China-linked hackers breach American Airlines  Sabre systems - Bloomberg "
    },
    {
        "content": "* Ryanair's fares and ancillary products will be available on Sabre from beginning of June 2015  Further company coverage:",
        "date": "05062015",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "BRIEF-Ryanair announces agreement with Sabre "
    },
    {
        "content": "Jan 23 Expedia Inc has acquired online travel agency Travelocity from technology company Sabre Corp  for $280 million in cash  the companies said in a statement on Friday  as consolidation in the online booking industry continues.",
        "date": "01232015",
        "name": "Sabre Corporation",
        "news_type": "topStory",
        "symbol": "SABR",
        "title": "Expedia Inc acquires Travelocity in $280 million deal "
    },
    {
        "content": "NEW YORK  Jan 7 A federal judge has significantly narrowed an antitrust lawsuit in which US Airways Inc  now part of American Airlines Group Inc  accused Sabre Corp  which distributes airfare information  of charging inflated booking fees and suppressing competition.",
        "date": "01072015",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "U.S. judge narrows US Airways pricing lawsuit vs Sabre "
    },
    {
        "content": "(Adds details from Sabre filing  estimated damages reduction  American comment)",
        "date": "01072015",
        "name": "Sabre Corporation",
        "news_type": "normal",
        "symbol": "SABR",
        "title": "UPDATE 2-U.S. judge narrows US Airways pricing lawsuit vs Sabre "
    }
]