[
    {
        "content": "LOS ANGELES  Sept 13 Sanderson Farms Inc shareholders have filed another proposal aimed at convincing the third-largest U.S. poultry producer to stop giving medically important antibiotics to healthy chickens for disease prevention.",
        "date": "09132017",
        "name": "Sanderson Farms Inc",
        "news_type": "normal",
        "symbol": "SAFM",
        "title": "Investors renew push to get Sanderson Farms to cut antibiotic use "
    },
    {
        "content": "* Q3 earnings per share view $4.49 -- Thomson Reuters I/B/E/S Source text for Eikon: Further company coverage:",
        "date": "08242017",
        "name": "Sanderson Farms Inc",
        "news_type": "normal",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms reports Q3 EPS $5.09 "
    },
    {
        "content": "* The three non-profit corporations seek  among other things  an order enjoining co from continuing its \"100% natural\" marketing program",
        "date": "06232017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms comments on complaint filed in California "
    },
    {
        "content": "LOS ANGELES  June 22 The parent of Burger King and Tim Hortons on Thursday vowed to  cut the use of antibiotics in its chicken supply  joining other major fast-food chain operators in the battle against the rise of dangerous antibiotic-resistant bacteria known as superbugs.",
        "date": "06222017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "UPDATE 3-Parent of Burger King  Tim Hortons to curb antibiotics in chicken "
    },
    {
        "content": "* Q2 earnings per share view $2.72 -- Thomson Reuters I/B/E/S",
        "date": "05252017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms reports Q2 earnings per share $2.94 "
    },
    {
        "content": "* Says approved an agreement  effective April 28  2017  for a new $900 million revolving credit facility through a consortium of banks",
        "date": "04282017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms announces new credit agreement "
    },
    {
        "content": "* Sanderson Farms Inc announces production agreement with House of Raeford Farms",
        "date": "04172017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms enters production agreement with House of Raeford Farms "
    },
    {
        "content": "CHICAGO  April 13 Global outbreaks of bird flu in poultry have altered the flow of U.S. chicken meat  eggs and grain around the world  adding to challenges faced by domestic exporters and giving a leg up to Brazil  which has so far escaped the disease.",
        "date": "04132017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "Bird flu redirects trade flow of U.S. chicken  eggs  grains "
    },
    {
        "content": "* Sanderson Farms Inc. Announces site for new poultry complex in texas",
        "date": "03162017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms Announces site for new poultry complex in Texas "
    },
    {
        "content": "* Sanderson Farms says on Feb 21  received antitrust civil investigative demand from office of Attorney General  Department of Legal Affairs  Florida",
        "date": "02222017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms says received antitrust civil investigative demand from office of Attorney General  Department of Legal Affairs  Florida "
    },
    {
        "content": "* AJO LP reports 5.4 percent passive stake in Sanderson farms Inc as of December 31  2016 - sec filing  Source text (http://bit.ly/2kQ2h0U) Further company coverage:",
        "date": "02102017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-AJO LP reports 5.4 pct passive stake in Sanderson Farms as of Dec. 31  2016 "
    },
    {
        "content": "LOS ANGELES A Sanderson Farms Inc shareholder proposal requesting the third-largest U.S. poultry producer phase out the use of medically important antibiotics for growth promotion and disease prevention failed to pass on Thursday  the company said.",
        "date": "02092017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "Sanderson Farms shareholder proposal on antibiotics fails "
    },
    {
        "content": "LOS ANGELES  Feb 9 A Sanderson Farms Inc  shareholder proposal requesting the third-largest U.S. poultry producer phase out the use of medically important antibiotics for growth promotion and disease prevention failed to pass on Thursday  the company said.",
        "date": "02092017",
        "name": "Sanderson Farms Inc",
        "news_type": "normal",
        "symbol": "SAFM",
        "title": "UPDATE 3-Sanderson Farms shareholder proposal on antibiotics fails "
    },
    {
        "content": "LOS ANGELES  Feb 9 Sanderson Farms Inc  investors on Thursday will vote on a shareholder proposal requesting the third-largest U.S. poultry producer phase out the use of medically important antibiotics for growth promotion and disease prevention.",
        "date": "02092017",
        "name": "Sanderson Farms Inc",
        "news_type": "normal",
        "symbol": "SAFM",
        "title": "Sanderson Farms faces shareholder vote on curbing antibiotic use "
    },
    {
        "content": "* Sanderson Farms-co  units named defendants with 4 other poultry producers  certain of their affiliated cos in putative class action lawsuit - SEC filing",
        "date": "02022017",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms  units named defendants in putative class action lawsuit "
    },
    {
        "content": "Former world junior champion Grayson Murray made a tap-in birdie at the final hole to earn a two-shot lead after the second round of the Sanderson Farms Championship in Mississippi on Friday.",
        "date": "10292016",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "Former junior champion Murray two ahead in Jackson "
    },
    {
        "content": "* Sanderson Farms  Inc. Announces Increase In Quarterly Dividend And Declares Special Dividend",
        "date": "09222016",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms ups qtrly dividend by $0.02  declares special dividend "
    },
    {
        "content": "* Sanderson farms  inc. reports results for third quarter of fiscal 2016",
        "date": "08252016",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms Q3 EPS $2.42 "
    },
    {
        "content": "* Sets regular quarterly cash dividend of $0.22 per share  Source text for Eikon:  Further company coverage:",
        "date": "07282016",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms sets quarterly cash dividend of $0.22/shr "
    },
    {
        "content": "* Sanderson Farms Inc reports results for second quarter of fiscal 2016",
        "date": "05262016",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms reports Q2 earnings per share $2.11 "
    },
    {
        "content": "* Sets regular quarterly cash dividend of $0.22 per share  Source text for Eikon:  Further company coverage:",
        "date": "04282016",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "BRIEF-Sanderson Farms sets quarterly cash dividend of $0.22/shr "
    },
    {
        "content": "Peter Malnati churned through the Mississippi mud to clinch a one-stroke victory at the $4.1 million Sanderson Farms Championship in Jackson on Monday.",
        "date": "11092015",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "Malnati wins PGA Tour event by one stroke over Toms  McGirt "
    },
    {
        "content": "* Strong dollar  avian flu outbreak hurt U.S. exports   (Adds company comment  poultry price forecasts)",
        "date": "05282015",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "UPDATE 2-Sanderson Farms CEO sees more pressure on chicken prices "
    },
    {
        "content": "May 28 Sanderson Farms Inc  the third-largest U.S. poultry producer  reported an 8.5 percent rise in quarterly net sales  helped by higher demand for chicken from its food service customers such as restaurants.",
        "date": "05282015",
        "name": "Sanderson Farms Inc",
        "news_type": "normal",
        "symbol": "SAFM",
        "title": "Poultry producer Sanderson Farms' net sales rise 8.5 pct "
    },
    {
        "content": "NEW YORK Sanderson Farms Inc  the third largest U.S. poultry producer  plans to continue using antibiotics on its birds partly because there are no alternatives on the horizon for treating a deadly but common gut disease  Chief Executive Officer Joe Sanderson said on Wednesday.",
        "date": "05202015",
        "name": "Sanderson Farms Inc",
        "news_type": "topStory",
        "symbol": "SAFM",
        "title": "Sanderson sees no alternatives to antibiotic use in chicken production "
    }
]