[
    {
        "content": "WARSAW/FRANKFURT Spanish bank Santander  has entered exclusive talks to buy the bulk of Deutsche Bank's  business in Poland in a bid to strengthen its position in the highly competitive market  two sources familiar with the matter said.",
        "date": "11172017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander in exclusive talks to buy Deutsche's Polish assets: sources "
    },
    {
        "content": "WARSAW/FRANKFURT  Nov 17 Spanish bank Santander has entered exclusive talks to buy the bulk of Deutsche Bank's business in Poland in a bid to strengthen its position in the highly competitive market  two sources familiar with the matter said.",
        "date": "11172017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 1-Santander in exclusive talks to buy Deutsche's Polish assets-sources "
    },
    {
        "content": "WARSAW/FRANKFURT  Nov 17 Spanish bank Santander has entered exclusive talks to buy the bulk of Deutsche Bank's business in Poland in a bid to strengthen its position in the highly competitive market  two sources familiar with the matter said.",
        "date": "11172017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander in exclusive talks to buy Deutsche's Polish assets-sources "
    },
    {
        "content": "* Spanish banks have highest number of branches per person in EU (Adds details  and background)",
        "date": "11082017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-Banco Santander to lay off 2 000 workers due to Popular integration -union "
    },
    {
        "content": "MADRID Spain's biggest bank Banco Santander plans to lay off more than 2 000 employees due to the integration of Banco Popular  which it acquired in June  a union official said on Wednesday.",
        "date": "11082017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Banco Santander plans to lay off 2 000 workers due to Popular integration: union "
    },
    {
        "content": "* STARTS NEGOTIATIONS WITH UNIONS ABOUT BANCO POPULAR HEADQUARTER INTEGRATION‍​",
        "date": "11032017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander starts talks with unions about Popular HQ integration‍​ "
    },
    {
        "content": "MADRID  Nov 8 Spain's biggest bank Banco Santander plans to lay off more than 2 000 employees due to the integration of Banco Popular  which it acquired in June  a union official said on Wednesday.",
        "date": "11082017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Banco Santander plans to lay off 2 000 workers due to Popular integration -union "
    },
    {
        "content": "SAO PAULO  Nov 1 Banco Santander Brasil SA will offer hedging contracts and expand its loan book to Brazilian commodities producers  as the bank tries to grab market share in the  booming sector  a bank executive told Reuters.",
        "date": "11012017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander's Brazil unit to expand in trading  credit for agribusiness "
    },
    {
        "content": "MADRID Banco Santander  is in the process of selling its U.S. unit Totalbank  Chief Executive Jose Antonio Alvarez said on Thursday.",
        "date": "10262017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Banco Santander in process of selling U.S. unit Totalbank: CEO "
    },
    {
        "content": "MADRID  Oct 26 Banco Santander is in the process of selling its U.S. unit Totalbank  Chief Executive Jose Antonio Alvarez said on Thursday.",
        "date": "10262017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Banco Santander in process of selling U.S. unit Totalbank - CEO "
    },
    {
        "content": "MADRID  Oct 26 Banco Santander has seen no material impact on deposits in Spain linked to an independence bid by the wealthy region of Catalonia and has made no contingency plans contemplating the possibility of the region seceding  its chief executive said on Thursday.",
        "date": "10262017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Banco Santander says no material impact on deposits from Catalonia crisis "
    },
    {
        "content": "* Ends Q3 with NPLs of 4.24 pct vs 5.37 pct in Q2 (Adds comments from CEO on situation in Catalonia)",
        "date": "10262017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 3-Popular takes shine off Brazil-driven Santander profit "
    },
    {
        "content": "MADRID  Oct 26 Banco Santander posted on Thursday a 14 percent decline in third-quarter net profit from a year earlier after being hit by restructuring costs of 515 million euros ($609 million) due mainly to the integration of Banco Popular.",
        "date": "10262017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander posts 14 pct fall in Q3 net profit on Popular costs "
    },
    {
        "content": "* FULLY-LOADED CORE TIER 1 CAPITAL RATIO 10.80 PERCENT AT END-SEPT",
        "date": "10262017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander Q3 net profit down 14 pct at 1.46 bln euros "
    },
    {
        "content": "* SAID ON MONDAY IT RESOLVED TO EXECUTE SHARE CAPITAL INCREASE FOR SCRIP DIVIDEND SCHEME  WHICH SHALL BE APPLIED TO THE SECOND 2017 INTERIM DIVIDEND IN OCT./ NOV.",
        "date": "10172017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander announces scrip dividend of 0.04 euro/right "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - British taxpayers could end up funding Santander’s efforts to grab a larger share of the UK business banking market. Helping one of Europe’s biggest lenders sounds like an odd way to shake up the dominance of established banks. But small-business customers will probably benefit over time.",
        "date": "10112017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Breakingviews - Helping Santander helps UK bank competition "
    },
    {
        "content": "* Shares close down 2.9 pct (Adds details on different markets)",
        "date": "10102017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 2-Spain's Santander raises 2018 profitability target "
    },
    {
        "content": "* Says increases Santander UK return on equity (ROTE) target to 9-10 percent by 2018 versus previous target of 8-10 percent set out in its 2016 strategy plan",
        "date": "10102017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Santander UK ups profitability target to 9-10 pct by 2018 "
    },
    {
        "content": "MADRID  Oct 10 Spain's Banco Santander said on Tuesday it would increase its return on tangible equity (ROTE) target for 2018 to over 11.5 percent from 11 percent due to a improving economic outlook in its core markets.",
        "date": "10102017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Santander increases 2018 profitability target to above 11.5 pct "
    },
    {
        "content": "Sept 29 Italy's infrastructure group Atlantia says:",
        "date": "09292017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Atlantia says Santander is financial adviser on Abertis' bid "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA/PARIS/LONDON  September 27 (Fitch) Fitch Ratings has taken corrective action on certain issue level ratings for Banco Santander  S.A. (Santander). It has revised ratings on four issues to assign 'emr' suffixes following discovery of an error in the application of criteria with respect to these issues. The rating actions are as follows Suffixes of 'emr' have been assigned to the 'A-' ratings of the issues with ISIN numbers XS03",
        "date": "09272017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Fitch Corrects Certain Issue Level Ratings for Santander "
    },
    {
        "content": "MADRID  Sept 12 Spain's Banco Santander registered on Tuesday a prospectus to raise up to 981 million euros ($1.2 billion) in subordinated debt as part of a commercial offer to compensate some retail clients who acquired shares and subordinated debt of Banco Popular and were wiped out when the bank was wound down.",
        "date": "09122017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Spain's Santander to raise up to 981 mln euros in subordinated debt "
    },
    {
        "content": "WARSAW Spanish bank Santander  is the frontrunner to buy Deutsche Bank's  Polish assets ahead of Portugal's Millennium bcp   two sources familiar with the matter said.",
        "date": "09142017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander is frontrunner for Deutsche's Polish assets: sources "
    },
    {
        "content": "WARSAW  Sept 14 Spanish bank Santander is the frontrunner to buy Deutsche Bank's Polish assets ahead of Portugal's Millennium bcp  two sources familiar with the matter said.",
        "date": "09142017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander is frontrunner for Deutsche's Polish assets - sources "
    },
    {
        "content": "* SAID ON TUESDAY IT HAD APPROVED THE ACQUISITION OF 100 PERCENT OF BANCO POPULAR PORTUGAL SA FROM BANCO POPULAR ESPANOL SA",
        "date": "09062017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander buys Portuguese assets from Banco Popular "
    },
    {
        "content": "FRANKFURT  Aug 9 Spanish bank Santander has sold control of property worth 10 billion euros ($12 billion) to U.S. investor Blackstone Group  following its rescue of Banco Popular.",
        "date": "08092017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander seals biggest sale yet of Spanish property "
    },
    {
        "content": "* Expects to sell 51 pct stake in Popular property assets (Includes details on losses for Popular from news conference)",
        "date": "07282017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 3-Brazil growth helps Santander  Popular purchase hits capital "
    },
    {
        "content": "* Says has recovered some 3 billion euros ($3.51 billion) in tax credits from Banco Popular acquisition Source text for Eikon: Further company coverage: ($1 = 0.8543 euros) (Reporting by Madrid Newsroom)",
        "date": "07282017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander says recovered 3 bln euros in tax credits from Popular acquisition "
    },
    {
        "content": "* Says expects net interest income to increase in the next few quarters in Spain",
        "date": "07282017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander plans to sell a majority stake in Popular property assets "
    },
    {
        "content": "MADRID  July 28 Banco Santander posted on Friday a 37 percent increase in second-quarter net profit from a year earlier  in line with analysts' forecasts and boosted by a solid performance in its largest market  Brazil.",
        "date": "07282017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Santander posts 37 pct rise in Q2 profit on Brazil boost "
    },
    {
        "content": "* CONCLUDES ITS CAPITAL INCREASE WITH A 8.2 TIMES DEMAND Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "07262017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Santander says capital increase fully subscribed "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA/LONDON  July 26 (Fitch) Fitch Ratings has affirmed Spain-based Banco Santander  S.A.'s (Santander) Long-Term Issuer Default Rating (IDR) at 'A-' and its Viability Rating (VR) at 'a-'. The Outlook on the Long-Term IDR is Stable. The rating actions are at the end of this rating action commentary. The affirmation follows the revision of the Outlook on Spain's sovereign rating (see 'Fitch Revises Spain's Outlook to Positive; Affir",
        "date": "07262017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Fitch Affirms Santander at 'A-'; Outlook Stable "
    },
    {
        "content": "LONDON/MADRID  July 21 Spain's Banco Santander is seeking bids by next Monday for some 30 billion euros ($34.91 billion) of property assets from Banco Popular  three sources familiar with the matter said.",
        "date": "07212017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander seeks bids by July 24 for Popular property assets - sources "
    },
    {
        "content": "* Fiserv  co received letter of intent to vote in favour of deal from Banco Santander SA in respect of 108.2 million Monitise shares  or about 4.67 pct Source text for Eikon: Further company coverage:",
        "date": "07182017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander to vote in favour of Monitise  Fiserv deal "
    },
    {
        "content": "NEW YORK  July 11 Banco Santander has partnered with San Francisco-based startup Tradeshift to provide supply chain finance to the 1.5 million businesses on the financial technology company's digital platform.",
        "date": "07112017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander partners with supply chain finance startup Tradeshift "
    },
    {
        "content": "MADRID  July 3 Spain's Banco Santander on Monday launched a 7 billion euros ($7.95 billion) rights issue at a price of 4.85 euros per share  a move it had flagged a month ago when it took over rescued peer Banco Popular for a nominal euro.",
        "date": "07032017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Spain's Santander launches 7 bln euros rights issue at 4.85 eur/share "
    },
    {
        "content": "WASHINGTON The U.S. Supreme Court on Monday declined to widen the reach of a federal law targeting abusive debt-collection tactics such as harassment and threats  ruling it does not cover companies that buy debt  sometimes for pennies on the dollar  and then collect it.",
        "date": "06122017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "U.S. top court won't expand debt-collection abuse law in Santander case "
    },
    {
        "content": "WASHINGTON  June 12 The U.S. Supreme Court on Monday declined to widen the reach of a federal law targeting abusive debt-collection tactics such as harassment and threats  ruling it does not cover companies that buy debt  sometimes for pennies on the dollar  and then collect it.",
        "date": "06122017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 4-U.S. top court won't expand debt-collection abuse law in Santander case "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA  June 09 (Fitch) Fitch Ratings has affirmed Spain-based Banco Santander  S.A.'s (Santander) Long-Term Issuer Default Rating (IDR) at 'A-' and its Viability Rating (VR) at 'a-'. The Outlook on the Long-Term IDR is Stable. At the same time  Fitch has upgraded Banco Popular Espanol  S.A.'s (Popular) Long-Term IDR to 'A-' from 'B' with a Stable Outlook. We have also downgraded Popular's VR to 'f' from 'b' following the European Ce",
        "date": "06092017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Fitch Affirms Santander at 'A-'; Downgrades Popular's VR to 'f' "
    },
    {
        "content": "MADRID/BRUSSELS European authorities stepped in to avert a collapse of Spain's Banco Popular  following a run on the bank  orchestrating a last-minute rescue on Wednesday by Santander   the country's biggest lender. | Video ",
        "date": "06072017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "ECB triggers overnight Santander rescue of Spain's Banco Popular "
    },
    {
        "content": "* Banco Santander considering capital increase of above 5 billion euros as part of potential offer for its smaller rival Banco Popular Espanol - Bloomberg  citing sources Source text: https://bloom.bg/2rxlj0U",
        "date": "06062017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Santander said to eye stock sale as part of possible Popular bid - Bloomberg "
    },
    {
        "content": "MADRID Spanish Economy Minister Luis de Guindos said on Wednesday Santander's  acquisition of Popular  carried out under the guidelines of the European Central Bank was a good resolution for the troubled bank.",
        "date": "06072017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander purchase of Popular is good outcome: Spanish Economy Minister "
    },
    {
        "content": "* European authorities intervene  bondholders suffer (Adds comments from Santander chairman  detail)",
        "date": "06072017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 4-ECB triggers overnight Santander rescue of Spain's Banco Popular "
    },
    {
        "content": "* Shares in Banco Santander opened down around 3 percent after announcing a capital increase to buy Banco Popular",
        "date": "06072017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Shares in Santander down 2.5 pct after announcing acquisition of Banco Popular "
    },
    {
        "content": "MADRID  June 7 Spain's leading bank Santander on Wednesday said it would carry out a capital increase of around 7 billion euros  ($7.89 billion) to buy out troubled Spanish competitor Banco Popular.",
        "date": "06072017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander to carry out 7 bln euros capital raise to buy Popular "
    },
    {
        "content": "MADRID  May 19 Spain's biggest bank Santander or state-owned lender Bankia are most likely to step in to save troubled Banco Popular  sources familiar with the talks told Reuters  although a deal is still far from guaranteed.",
        "date": "05192017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander or Bankia viewed as likely saviours for Spain's Popular "
    },
    {
        "content": "MADRID  May 3 Spain's High Court is to question seven current and former Banco Santander bankers  including a current non-executive board member  as part of a probe triggered by leaks of tax information from HSBC's Swiss private bank.",
        "date": "05032017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-Spanish court to question Santander  BNP bankers in HSBC tax probe "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA/LONDON  April 28 (Fitch) Fitch Ratings has affirmed Spain-based Banco Santander  S.A.'s Long-Term Issuer Default Rating (IDR) at 'A-' and its Viability Rating (VR) at 'a-'. The Outlook on the Long-Term IDR is Stable. A full list of rating actions is at the end of this rating action commentary. In addition  Fitch has assigned an 'A-(dcr)' Derivative Counterparty Rating (DCR) to Banco Santander as part of its roll-out of DCRs to",
        "date": "04282017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Fitch Affirms Banco Santander at 'A-'; Outlook Stable "
    },
    {
        "content": "MADRID  April 26 Banco Santander is more confident now that Britain's decision to exit the European Union will not have a direct impact on its British business  Chief Executive Jose Antonio Alvarez said on Wednesday.",
        "date": "04262017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Banco Santander sees less impact from Brexit on its UK business "
    },
    {
        "content": "* Brazil's share of group's profits now at 26 pct (Adds details from conference call  shares)",
        "date": "04262017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 2-Brazil growth helps Banco Santander to beat forecasts "
    },
    {
        "content": "MADRID  April 26 Banco Santander opened Spain's bank reporting season on Wednesday with a 14 percent rise in first-quarter net profit from a year earlier  beating analysts' forecasts and helped by strong business in its largest market Brazil.",
        "date": "04262017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Banco Santander posts 14 pct profit rise in Q1 on Brazilian strength "
    },
    {
        "content": "WASHINGTON  April 18 The U.S. Supreme Court on Tuesday appeared skeptical of widening the scope of who can be subject to a federal law targeting debt collectors' abusive practices by including those who buy debt  sometimes for pennies on the dollar.",
        "date": "04182017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "U.S. Supreme Court hesitant to expand debt collection abuse law "
    },
    {
        "content": "WASHINGTON  April 18 The U.S. Supreme Court on Tuesday appeared skeptical of widening the scope of who can be subject to a federal law targeting debt collectors' abusive practices by including those who buy debt  sometimes for pennies on the dollar.",
        "date": "04182017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 1-U.S. Supreme Court hesitant to expand debt collection abuse law "
    },
    {
        "content": "SANTANDER  Spain  April 7 Banco Santander   the euro zone's largest by market value  said on Friday that it aims for a modest 5 percent increase in its dividend this year  the same as last year  as it seeks to preserve money to strengthen its capital.",
        "date": "04072017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-Banco Santander to increase 2017 dividend by 5 pct "
    },
    {
        "content": "SANTANDER  Spain  April 7 Spain's Banco Santander aims to address risk controls and better comply with regulations in the U.S. in 2017 in order to improve its profitability there  its chief executive said on Friday.",
        "date": "04072017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Banco Santander says will prioritize risk control in U.S. in 2017 "
    },
    {
        "content": "* Says bank expects to meet its 11 percent return-on-tangible equity (ROTE) - a measure of profitability - target for 2018 Source text for Eikon: Further company coverage: (Reporting By Madrid Newsroom)",
        "date": "04072017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander says expects to meet 11 pct ROTE target for 2018 "
    },
    {
        "content": "SANTANDER  Spain  April 7 Banco Santander's   Spain's biggest bank  aims to pay a dividend of 0.22 euros ($0.2340) per share against 2017 earnings  an increase of 5 percent compared to 2016  Chairman Ana Botin said on Friday.",
        "date": "04072017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Banco Santander aims to increase dividend by 5 pct in 2017 "
    },
    {
        "content": "* Files with U.S. SEC for potential mixed shelf; size not disclosed - SEC filing Source text : (http://bit.ly/2oC6oPq) Further company coverage:",
        "date": "04032017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander files with U.S. SEC for potential mixed shelf; size not disclosed - SEC filing "
    },
    {
        "content": "BOSTON  March 29 A unit of Banco Santander SA has agreed to pay $22 million in connection with what the attorney general in Massachusetts called a first-in-the-nation settlement involving subprime auto loan securitization.",
        "date": "03292017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander to pay $22 mln to resolve subprime auto loan probes "
    },
    {
        "content": "MADRID/MILAN Spain's Santander  and Italy's Intesa Sanpaolo  said on Tuesday they had agreed to sell a joint 75 percent stake in mutual fund platform Allfunds Bank for around 1.37 billion euros ($1.45 billion) to funds GIC and Hellman & Friedman.",
        "date": "03072017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander  Intesa Sanpaolo to sell Allfunds Bank in 1.8 billion euro deal "
    },
    {
        "content": "* Santander to sell 25 pct of Allfunds Bank for 470 mln euros",
        "date": "03072017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 1-Santander  Intesa Sanpaolo to sell Allfunds Bank in 1.8 bln euro deal "
    },
    {
        "content": "MADRID  March 7 Spain's Santander has sold a 25 percent stake in mutual fund platform Allfunds Bank for around 470 million euros ($498 million) to private equity Hellman & Friedman and Singapore sovereign wealth fund GIC  the Spanish lender said on Tuesday.",
        "date": "03072017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Santander sells 25 pct of Allfunds for 470 mln euros "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA  February 09 (Fitch) Fitch Ratings has assigned Banco Santander   S.A.'s (Santander) issue of EUR1.5 billion second ranking senior notes due 2022  a final rating of 'A-'. The final rating is in line with the expected rating Fitch assigned to the notes  on 25 January 2017 (see \"Fitch Rates Santander's Second Ranking Senior Notes  'A-(EXP)'\" at www.fitchratings.com). The introduction of this new debt class does not affect the 'A",
        "date": "02092017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Fitch Rates Santander's Second Ranking Senior Notes Final 'A-' "
    },
    {
        "content": "LONDON  Jan 26 (IFR) - Banco Santander has launched a \u007f1.5bn five-year debut senior non-preferred bond at 120bp over mid-swaps on orders of around \u007f4.25bn according to a lead.",
        "date": "01262017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Banco Santander launches \u007f1.5bn senior non-preferred "
    },
    {
        "content": "MADRID Strong underlying profit growth at Banco Santander  in 2016 and a better-than-expected performance in the last quarter drove its shares higher on Wednesday as it weathered the impact of falls in the pound and the Mexican peso. | Video ",
        "date": "01252017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander profit weathers currency storms  lifting shares "
    },
    {
        "content": "LISBON  Jan 25 The Portuguese unit of Spanish bank Santander hopes to end years of litigation with the state over 1.8 billion euros in swap contracts after resolving a similar dispute with Madeira's regional government  Santander-Totta's CEO said on Wednesday.",
        "date": "01252017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander sees Portugal swaps deal after region agrees to pay up "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA  January 25 (Fitch) Fitch Ratings has assigned Banco Santander  S.A.'s  (Santander) upcoming issue of second ranking senior notes an expected long-term  rating of 'A-(EXP)'. The assignment of the final rating is contingent on the receipt of final  documents conforming to the information already received.  The introduction of this new debt class does not affect the 'A-' long-term  rating on the bank's outstanding senior debt  w",
        "date": "01252017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Fitch Rates Santander's Second Ranking Senior Notes 'A-(EXP)' "
    },
    {
        "content": "MADRID  Jan 25 Strong underlying profit growth at Banco Santander in 2016 and a better-than-expected performance in the last quarter drove its shares higher on Wednesday as it weathered the impact of falls in the pound and the Mexican peso.",
        "date": "01252017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "REFILE-UPDATE 2-Santander profit weathers currency storms  lifting shares "
    },
    {
        "content": "Jan 25 Spain's Santander CEO Jose Antonio Alvarez:",
        "date": "01252017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Santander forecasts 2017 credit growth in Spain of 1-2 pct "
    },
    {
        "content": "MADRID  Jan 25 Banco Santander does not plan to relocate any of its employees at its British business due to Britain's planned exit from the European Union and the single market  Chairman Ana Botin said on Wednesday.",
        "date": "01252017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander not planning to relocate UK employees due to Brexit: chairman "
    },
    {
        "content": "* Banco Santander Chairman Ana Botin says not considering any acquisitions in the U.S. market  Source text for Eikon:  Further company coverage:    (Reporting By Jesús Aguado)",
        "date": "01252017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander says is not considering acquisitions in U.S. market "
    },
    {
        "content": "* Says is on track to meet fully-loaded capital target of over 11 percent by 2018",
        "date": "01252017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander says on track to meet capital target by 2018 "
    },
    {
        "content": "MADRID  Jan 25 Banco Santander opened Spain's bank reporting season on Wednesday with a 4 percent rise in its 2016 net profit from a year earlier  above analysts' forecasts and helped by strong business in its key Brazilian market.",
        "date": "01252017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Banco Santander posts 4 pct full-year profit rise  beats forecasts "
    },
    {
        "content": "MADRID Spain's Banco Santander  will issue between 43 billion and 57 billion euros ($45 billion-$60 billion) in debt over the next two years to meet capital targets aimed at enabling systemically important banks to absorb losses  it said on Wednesday.",
        "date": "01112017",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Banco Santander to issue up to 57 billion euros in debt over two years "
    },
    {
        "content": "MADRID  Jan 11 Spain's Banco Santander  will issue between 43 billion and 57 billion euros ($45 billion-$60 billion) in debt over the next two years to meet capital targets aimed at enabling systemically important banks to absorb losses  it said on Wednesday.",
        "date": "01112017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 1-Banco Santander to issue up to 57 bln euros in debt over two years "
    },
    {
        "content": "MADRID  Jan 11 Spain's Banco Santander  will issue between 43 billion and 57 billion euros ($45 billion-$60 billion) in debt over the next two years to meet capital targets aimed at enabling systemically important banks to absorb losses  it said on Wednesday.",
        "date": "01112017",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Banco Santander to issue up to 57 bln euros in debt over two years "
    },
    {
        "content": "WASHINGTON A U.S. bank regulator is poised to fault Spanish lender Banco Santander SA   for doing too little to reach poor neighborhoods and will fail the bank on a test of community lending  according to sources familiar with the situation.",
        "date": "12092016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "U.S. regulator to fail Santander on community lending: sources "
    },
    {
        "content": "MADRID  Nov 28 Spain's Santander has been fined 1 million euros  ($1.1 million) for its \"serious failure\" to prevent money laundering through an account held by the property group Rumasa between 2007 and 2011  the Spanish Supreme Court said on Monday.",
        "date": "11282016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Banco Santander fined 1 mln euros for failing to stop money laundering "
    },
    {
        "content": "* Santander said near deal to buy back asset-management stake - Bloomberg  citing sources",
        "date": "11162016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Santander nears deal to buy back asset-management stake - Bloomberg "
    },
    {
        "content": "Oct 28 Brazil's state-controlled oil company Petroleo Brasileiro SA Petrobras says:",
        "date": "10282016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Petrobras concludes $1.2 bln financing with Banco Santander SA "
    },
    {
        "content": "* CEO Jose Antonio Alvarez says will not change fees in the flagship 123 account in Spain  Source text for Eikon:  Further company coverage:    (Reporting by Madrid newsroom)",
        "date": "10262016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander says will not change fees on Spanish accounts "
    },
    {
        "content": "* Says expects net interest income (NII) to fall in Spain in next few quarters",
        "date": "10262016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander expects NII to fall in Spain  rise in UK "
    },
    {
        "content": "* Shares up 1.2 pct  hit six-month high   (Adds details  analyst  share price)",
        "date": "10262016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 2-Banco Santander beats forecasts as Brazil offsets pressure elsewhere "
    },
    {
        "content": "MADRID  Oct 26 Spain's Banco Santander  on Wednesday posted a 1 percent rise in third-quarter net profit from a year earlier  above analysts' forecasts and helped by strong business in its key Brazilian market.",
        "date": "10262016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Banco Santander posts 1 pct profit rise ahead of forecasts "
    },
    {
        "content": "Citigroup  agreed to sell its consumer business in Argentina to Banco Santander Rio  for an undisclosed amount  a day after it sold some of its Brazilian retail banking assets to Itaú Unibanco Holding SA .",
        "date": "10092016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Citi sells Argentinian consumer unit a day after Brazil sale "
    },
    {
        "content": "Oct 9 Citigroup agreed to sell its consumer business in Argentina to Banco Santander Rio  for an undisclosed amount.",
        "date": "10092016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Citi sells its Argentinian consumer business to Banco Santander "
    },
    {
        "content": "MADRID  Sept 29 Banco Santander is expected to adopt more conservative targets in Britain to reflect the immediate impact of the Brexit vote when the Spanish bank updates investors on its strategy on Friday.",
        "date": "09292016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander seen mapping out post-Brexit targets in investor update "
    },
    {
        "content": "MADRID Banco Santander  gave investors a sobering assessment of its prospects in Britain and Spain on Friday  with a warning that it would be less profitable than expected in the years ahead  knocking the Spanish bank's shares.",
        "date": "09302016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander sees tougher times ahead as cuts profitability goal "
    },
    {
        "content": "* Santander shares down 3.4 pct in weaker bank sector   (Adds details on core markets  analyst comment)",
        "date": "09302016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 2-Santander sees tougher times ahead as cuts profitability goal "
    },
    {
        "content": "* Says cuts return on tangible equity ratio target (ROTE) for Spain in 2018 to 13 percent from the 14 percent set out in the previous strategy plan",
        "date": "09302016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander lowers profitability target for Spain "
    },
    {
        "content": "MADRID  Sept 30 Spain's Banco Santander  said on Friday it had trimmed its profitability targets for 2018 to just above 11 percent by 2018 in a business environment it described as \"significantly worse\" than last year.",
        "date": "09302016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Banco Santander trims profitability target for 2018 "
    },
    {
        "content": "Banco Santander SA  has pulled out of talks to buy Royal Bank of Scotland Group's  Williams & Glyn unit  the Financial Times reported on Tuesday  citing people familiar with the matter.",
        "date": "09202016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander withdraws offer for RBS' Williams & Glyn unit: FT "
    },
    {
        "content": "Sept 20 Banco Santander SA has pulled out of talks to buy Royal Bank of Scotland Group's  Williams & Glyn unit  the Financial Times reported on Tuesday  citing people familiar with the matter.",
        "date": "09202016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander withdraws offer for RBS' Williams & Glyn unit - FT "
    },
    {
        "content": "BUENOS AIRES Santander will buy Citigroup's  retail operations in Argentina  a local newspaper reported late on Monday  citing market sources.",
        "date": "09132016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander to buy Citi's Argentina operations: report "
    },
    {
        "content": "BUENOS AIRES  Sept 13 Santander will buy Citigroup's retail operations in Argentina  a local newspaper reported late on Monday  citing market sources.",
        "date": "09132016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander to buy Citi's Argentina operations -report "
    },
    {
        "content": "WARSAW  Sept 7 State-run Polish lender PKO BP  and Alior Bank have filed bids to buy the local unit of Austria's Raiffeisen  a source familiar with the sale said  as part of the government's plan to increase control over the banking sector.",
        "date": "09072016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Polish banks PKO  Alior bid to buy Raiffeisen's local unit - source "
    },
    {
        "content": "LONDON  Aug 2 Banco Santander has made an offer to take over Royal Bank of Scotland's Williams & Glyn business  a source familiar with the situation told Reuters on Tuesday.",
        "date": "08022016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander makes offer for RBS's Williams & Glyn arm -source "
    },
    {
        "content": "MADRID Santander's  profit was slightly above forecasts in the second quarter  despite falling 50 percent year-on-year  and the euro zone's biggest bank's shares rose on Wednesday on lower provisions for bad loans and an improvement in Brazil.",
        "date": "07272016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander's Brazilian bounce offsets profit hit from one-offs  Brexit "
    },
    {
        "content": "MADRID  July 27 Banco Santander on Wednesday posted an almost 50 percent fall in second quarter net profit from a year earlier  hit by one-off charges linked to restructuring costs and payments into a EU banking resolution fund.",
        "date": "07272016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "CORRECTED-Santander posts 50 pct fall in Q2 net profit on extraordinary charges "
    },
    {
        "content": "WARSAW  July 8 BNP Paribas  France's largest listed bank  joined Polish state-run lenders PKO BP   Alior and Dutch ING in the race for Raiffeisen's Polish business  three sources said.",
        "date": "07082016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 1-France's BNP joins race for Raiffeisen Polish arm -sources "
    },
    {
        "content": "LONDON  July 1 (IFR) - Santander UK is marketing a sterling covered floater  the first financial deal in the European market since Britain's shock vote to leave the European Union last Friday.",
        "date": "07012016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander UK breaks Europe's post-Brexit financial drought "
    },
    {
        "content": "WARSAW  July 1 ING Bank Slaski is interested in buying Raiffeisen Bank International's  Polish business  joining Polish state-run banks PKO BP  and Alior Bank  two sources familiar with the matter said.",
        "date": "07012016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 1-ING interested in Raiffeisen's Polish business -sources "
    },
    {
        "content": "MILAN  May 27 The European Commission has approved a long-delayed deal between UniCredit and Santander to merge their fund managment businesses  it said on Friday  adding the tie-up did not raise competition concerns.",
        "date": "05272016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "EU Commission clears UniCredit  Santander fund management deal "
    },
    {
        "content": "* New UniCredit CEO could ditch accord with Santander-sources",
        "date": "05242016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-UniCredit puts Pioneer deal with Santander on hold before CEO change-sources "
    },
    {
        "content": "MILAN/LONDON  May 24 A long-delayed deal between UniCredit and Santander to merge their fund management businesses has been put on hold  as the Italian bank gears up for a new CEO before  reviewing options on the fate of its Pioneer unit  four sources with knowledge of the matter said.",
        "date": "05242016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "RPT-UniCredit freezes Pioneer deal with Santander  awaits new CEO-sources "
    },
    {
        "content": "MILAN/LONDON  May 24 A long-delayed deal between UniCredit and Santander to merge their fund management businesses has been put on hold  as the Italian bank gears up for a new CEO before  reviewing options on the fate of its Pioneer unit  four sources with knowledge of the matter said.",
        "date": "05242016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UniCredit freezes Pioneer deal with Santander  awaits new CEO-sources "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA/LONDON  May 13 (Fitch) Fitch Ratings has affirmed Spain-based Banco  Santander  S.A.'s (Santander) and Banco Bilbao Vizcaya Argentaria's (BBVA)  Long-term Issuer Default Ratings (IDRs) at 'A-' and Viability Ratings (VRs) at  'a-'. The Outlooks on the Long-term IDRs are Stable. Fitch has also affirmed  their Short-term IDRs at 'F2'. A full list of rating actions is at the end of  this rating action commentary. KEY RATING DRIVER",
        "date": "05132016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Fitch Affirms Santander and BBVA at 'A-'; Outlook Stable "
    },
    {
        "content": "* CEO says Brexit would impact bank's finances   (Adds comments from CEO on Brexit)",
        "date": "04272016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 4-Santander defies Brazil gloom  beats capital and profit forecasts "
    },
    {
        "content": "* Says \"nothing\" on the table regarding potential acquisition of Royal Bank of Scotland branches in Britain  Source text for Eikon:  Further company coverage:    (Reporting by Madrid newsroom)",
        "date": "04272016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Santander CEO says not considering acquisition of RBS branches in UK "
    },
    {
        "content": "MADRID  April 6 Spain's biggest bank Santander  plans to lay off 1 200 staff as part of a country-wide restructuring plan  the Comisiones Obreras union said on Wednesday after talks with the lender.",
        "date": "04062016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Spanish union says Santander plans to lay off 1 200 workers "
    },
    {
        "content": "MADRID  April 8 Spain's biggest bank Santander  plans to lay off 460 employees at its headquarters in Madrid on top of the 1 200 already announced as part of a country-wide restructuring plan  a union said on Friday.",
        "date": "04082016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Spanish bank Santander to lay off another 460 workers - union "
    },
    {
        "content": "MADRID Santander  is expected to earn the dubious distinction of being the only bank to fail the Federal Reserve's annual health check for three years running  despite efforts to improve controls at its U.S. unit  banking sources and analysts say.",
        "date": "04082016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander seen set for another U.S. stress test failure "
    },
    {
        "content": "MADRID  April 1 Spain's Santander plans to close around 450 small domestic branches as part of an overhaul in response to rising regulatory costs and a push into digital services  according to an internal memo from the bank's CEO seen by Reuters.",
        "date": "04012016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-Spain's Santander to close hundreds of domestic branches -CEO memo "
    },
    {
        "content": "MADRID  April 1 Spain's largest bank Santander  plans to close around 450 small domestic branches as part of an overhaul in response to rising regulatory costs and a push into digital services  a source close to negotiations with unions over the closures said.",
        "date": "04012016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Santander to close hundreds of domestic branches - source "
    },
    {
        "content": "SANTANDER  Spain  March 18 Spain's biggest bank Banco Santander announced a slight increase in this year's dividend policy on Friday in a bid to win back minority shareholder confidence after a more than 60 percent cut in the payout in 2015.",
        "date": "03182016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-Santander seeks to win over investors with dividend rise "
    },
    {
        "content": "March 18 Spain's Santander CEO Jose Antonio Alvarez:",
        "date": "03182016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Santander says has strengthened U.S. risk management  controls "
    },
    {
        "content": "SANTANDER  Spain  March 18 Spain's Banco Santander has not ruled out making purchases to grow in some of its key markets  Chairwoman Ana Botin said on Friday  though the bank aimed primarily to grow organically she said.",
        "date": "03182016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander's Botin does not rule out bolt-on acquisitions "
    },
    {
        "content": "* Says on conference call with analysts on track to reach capital ratio targets by building them up organically",
        "date": "01272016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Santander's Botin says bank not planning any capital hike "
    },
    {
        "content": "MADRID  Jan 27 Santander  the euro zone's biggest bank  on Wednesday posted an 0.3 percent rise in fourth-quarter net profit from a year earlier  helped by better than expected lending income.",
        "date": "01272016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander posts flat Q4 net profit  lending revenues up "
    },
    {
        "content": "MADRID  Jan 22 Spanish bank Santander  on Friday said it was not considering any potential acquisition of Italian lender Banca Montei dei Paschi di Siena  following press reports mentioning such a possibility earlier in the day.",
        "date": "01222016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Santander says not interested in buying Italy's Monte dei Paschi "
    },
    {
        "content": "LONDON  Jan 20 Banco Santander's  renewed interest in buying UK lender Williams & Glyn  has stoked concerns it may need to step up asset sales and even raise cash to strike a deal some investors say it can ill afford.",
        "date": "01212016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "DEALTALK-Santander's play for Williams & Glyn raises capital concerns "
    },
    {
        "content": "LONDON Banco Santander's  renewed interest in buying UK lender Williams & Glyn  has stoked concerns it may need to step up asset sales and even raise cash to strike a deal some investors say it can ill afford.",
        "date": "01202016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander's play for Williams & Glyn raises capital concerns "
    },
    {
        "content": "LONDON  Jan 20 Banco Santander's  renewed interest in buying UK lender Williams & Glyn  has stoked concerns it may need to step up asset sales and even raise cash to strike a deal some investors say it can ill afford.",
        "date": "01202016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "CORRECTED-DEALTALK-Santander's play for Williams & Glyn raises capital concerns "
    },
    {
        "content": "BRASILIA Banco Santander's head of Latin American equities  Ignacio Mendive  will leave his post as part of several changes in the bank's operations in New York  two sources familiar with the matter told Reuters on Friday.",
        "date": "01092016",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander's head of Latam equities Mendive to leave post: sources "
    },
    {
        "content": "BRASILIA  Jan 8 Banco Santander's head of Latin American equities  Ignacio Mendive  will leave his post as part of several changes in the bank's operations in New York  two sources familiar with the matter told Reuters on Friday.",
        "date": "01092016",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander's head of Latam equities Mendive to leave post -sources "
    },
    {
        "content": "* Says appoints Belen Romana as an independent board member  to fill a spot left by Sheila Bair",
        "date": "12222015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Spain's Santander says appoints former \"bad bank\" boss to board "
    },
    {
        "content": "* The resolution authority  decided to award Banco Banif's business to Banco Santander Totta  a subsidiary of Banco Santander\u007f\u007f",
        "date": "12212015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander's unit acquires Banco Banif for 150 mln euros "
    },
    {
        "content": "* Shares down 3 percent   (Adds comments on Brazil from conference call)",
        "date": "10292015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 3-Santander's profits hit by Brazilian currency fall "
    },
    {
        "content": "Oct 29 Banco Santander Chief Executive Jose Antonio Alvarez:",
        "date": "10292015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Spain's Santander could revisit bid for Novo Banco "
    },
    {
        "content": "Oct 29 Spain's Santander CEO Jose Antonio Alvarez:",
        "date": "10292015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Santander sees limited impact from VW scandal on car financing units "
    },
    {
        "content": "MADRID  Oct 29 Santander  the euro zone's biggest bank  said on Thursday net profit rose nearly 5 percent in the third quarter from a year ago to 1.7 billion euros ($1.9 billion)  even as it took a hit from depreciating currencies in Latin America.",
        "date": "10292015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Santander posts 5 pct rise in third-quarter profit "
    },
    {
        "content": "MADRID  Oct 7 Santander was fined 1 million euros ($1.12 million) in June for breaching laws on preventing money laundering and terrorism financing  a Spanish court said on Wednesday  adding the bank had sought to delay news of the sanction getting out.",
        "date": "10072015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Spain's Santander sought to delay news of fine  court says "
    },
    {
        "content": "MADRID Spanish lender Santander  evacuated the main building at its Madrid headquarters on Tuesday after envelopes containing white powder were sent to senior executives in what police said looked to have been a hoax.",
        "date": "10062015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander evacuates Madrid office after likely 'white powder' hoax "
    },
    {
        "content": "MADRID  Oct 6 Spanish lender Santander  evacuated the main building at its Madrid headquarters on Tuesday after envelopes containing white powder were sent to senior executives in what police said looked to have been a hoax.",
        "date": "10062015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 2-Santander evacuates Madrid office after likely 'white powder' hoax "
    },
    {
        "content": "MADRID  Oct 6 Spanish lender Santander  evacuated one of the buildings at its Madrid headquarters on Tuesday after staff received envelopes containing a suspicious powder  a source close to the bank said.",
        "date": "10062015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander evacuates Madrid building due to suspicious envelopes "
    },
    {
        "content": "* Pateman will take up role in January 2016   (Adds comments from Shawbrook chairman)",
        "date": "10022015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-New UK lender Shawbrook hires top Santander exec as CEO "
    },
    {
        "content": "* Steve Pateman has agreed to join group as its new chief executive officer",
        "date": "10022015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Shawbrook names Santander UK banking head as new CEO "
    },
    {
        "content": "MADRID Spain's \"bad bank\"  set up to relieve ailing lenders of their soured real estate assets  said on Friday it faced more charges from the falling value of its properties  which have already eaten into its earnings.",
        "date": "10022015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spanish 'bad bank' faces fresh charges from property valuations "
    },
    {
        "content": "MADRID  Oct 2 Spain's \"bad bank\"  set up to relieve ailing lenders of their soured real estate assets  said on Friday it faced more charges from the falling value of its properties  which have already eaten into its earnings.",
        "date": "10022015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spanish \"bad bank\" faces fresh charges from property valuations "
    },
    {
        "content": "LONDON  Sept 29 Anheuser-Busch InBev is asking banks to underwrite up to $70 billion in debt financing to back its potential takeover of SABMiller  banking sources said.",
        "date": "09292015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 2-LPC-AB InBev lining up $70 bln debt for SABMiller offer "
    },
    {
        "content": "LONDON  Sept 29 AB InBev is asking banks to underwrite up to $70 billion in debt financing to back its potential merger with SABMiller  banking sources said.",
        "date": "09292015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "LPC-AB InBev lining up $70 bln debt for SABMiller offer - bankers "
    },
    {
        "content": "MADRID  Sept 23 Spain's Santander said listing its subsidiaries was no longer a priority as it eyes more cost cuts and aims to strengthen its capital in the next three years  putting the spin-off of its British business on the back burner.",
        "date": "09232015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-Santander's Botin puts capital first amid lending push "
    },
    {
        "content": "LONDON  Sept 14 Santander's British arm is to more than double the fees for its current account customers and also raise charges on its credit cards  blaming rising costs and low interest rates.",
        "date": "09142015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander to lift charges on UK current account  cards "
    },
    {
        "content": "MADRID  July 30 Spanish bank Santander  said on Thursday former U.S. banking regulator Sheila Bair had resigned from its board after being named rector of Washington College in Maryland.",
        "date": "07302015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander says former U.S. regulator Bair resigns from board "
    },
    {
        "content": "MADRID  July 30 A buoyant performance from its British business helped Spain's Santander to increase second-quarter revenues  offsetting a weaker home market and driving an 18 percent rise in net profit.",
        "date": "07302015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 2-Britain's recovery gives boost to Santander profits  revenues "
    },
    {
        "content": "MADRID  July 30 Santander  the euro zone's biggest bank  on Thursday posted an 18 percent rise in second quarter net profit from a year ago  helped by rising revenues in Britain and the United States.",
        "date": "07302015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Santander posts 18 pct rise in Q2 net profit "
    },
    {
        "content": "MADRID  July 8 Spain's biggest bank Santander  has hired consultants PricewaterhouseCoopers to help it sell a package of soured home loans worth just under 800 million euros ($883 million)  a source with knowledge of the deal said.",
        "date": "07082015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Spain's Santander seeks to sell package of unpaid mortgages -source "
    },
    {
        "content": "* Venture to be led by Santander's head of innovation   (Adds details  background  share movement)",
        "date": "07012015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-Santander forms fintech joint venture with Monitise "
    },
    {
        "content": "LONDON  July 1 Spanish bank Santander  and British mobile banking software provider Monitise  have launched a joint venture to invest in fintech businesses  they said on Wednesday.",
        "date": "07012015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander forms fintech joint venture with Monitise "
    },
    {
        "content": "* Transcom's new contract with Banco Santander is valid for two years  starting on July 1  2015  Source text for Eikon:",
        "date": "06232015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Transcom renews its agreement with Banco Santander "
    },
    {
        "content": "LONDON  May 28 Banco Santander and two of Canada's largest pension funds said on Thursday they were launching a joint fund to invest in renewable energy projects  following the transfer of 19 assets previously owned by the Spanish lender.",
        "date": "05282015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander  Canada pension funds launch renewables fund "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA  May 22 (Fitch) Fitch Ratings has affirmed Spain-based Banco  Santander  S.A.'s (Santander) and Banco Bilbao Vizcaya Argentaria's (BBVA)  Long-term Issuer Default Ratings (IDRs) at 'A-' and Viability Ratings (VRs) at  'a-'. The Outlook on their Long-term IDRs is Stable. At the same time  Fitch has affirmed these banks' Short-term IDRs at 'F2'   Support Ratings (SRs) at '5' and Support Rating Floors (SRFs) at 'No Floor'. A  ful",
        "date": "05222015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Fitch Affirms Santander and BBVA at 'A-'; Outlook Stable "
    },
    {
        "content": "* Said on Wednesday it had placed 8.56 percent of NH Hotel Group SA on behalf of Banco Santander SA at 5.10 euros per share  153 million euros ($170 million) in total     Source text for Eikon:",
        "date": "05212015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Fidentiis places 8.56 pct of NH Hotels for Banco Santander at 5.10 euros per share "
    },
    {
        "content": "* Accelerated bookbuilding on NH Hotels is on behalf of Banco Santander",
        "date": "05202015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-Banco Santander sells 8.56 pct stake in NH Hotels "
    },
    {
        "content": "MADRID  April 28 Santander on Tuesday showed the benefits of a drive to boost lending across its main markets  which helped the bank to produce a 32 percent jump in first-quarter profits.",
        "date": "04282015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "REFILE-UPDATE 3-Santander lending drive lifts first-quarter profits "
    },
    {
        "content": "April 28 Banco Santander SA Chief Executive Jose Antonio Alvarez:",
        "date": "04282015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Santander's UK unit IPO not on the table right now-CEO "
    },
    {
        "content": "MADRID  April 28 The euro zone's biggest bank Santander on Tuesday  reported a 32 percent rise in first-quarter profit from a year earlier  boosted by rising net earnings from loans and a drop in bad debt charges.",
        "date": "04282015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Santander posts 32 pct profit jump in Q1 y/y "
    },
    {
        "content": "UniCredit  and Santander  have agreed to merge their asset management businesses in a deal where the Spanish bank will have no direct involvement in the new group's U.S. operations  three sources close to the matter said.",
        "date": "04222015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander to keep its distance from U.S. in Pioneer deal: sources "
    },
    {
        "content": "* bank expects to complete deal with Santander on asset management units by end of the year   Further company coverage:    (Reporting by Milan newsroom)",
        "date": "04242015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "BRIEF-UniCredit Ceo says to complete asset management deal by year-end "
    },
    {
        "content": "MILAN UniCredit  and Banco Santander  agreed on Thursday to merge their asset management businesses in a deal valuing the new group at some 5.4 billion euros ($5.8 billion).",
        "date": "04232015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UniCredit reaches asset management deal with Santander "
    },
    {
        "content": "* Santander to have stake in sub-holding company- sources   (Adds detail  background)",
        "date": "04222015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 1-Santander to keep its distance from US in Pioneer deal - sources "
    },
    {
        "content": "April 22 Italy's UniCredit and Spain's Santander have agreed a deal to merge their asset management businesses that will keep the Spanish bank out of any direct involvement in U.S. operations to address regulatory issues  three sources close to the matter said.",
        "date": "04222015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UniCredit deal on Pioneer keeps Santander out of US ops - sources "
    },
    {
        "content": "MILAN Italy's biggest bank by assets  UniCredit   is close to signing a deal with Spain's Santander  to combine their asset management businesses  UniCredit CEO Federico Ghizzoni said on Saturday.",
        "date": "04182015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UniCredit close to deal with Santander on asset management units: CEO "
    },
    {
        "content": "MILAN  April 18 Italy's biggest bank by assets  UniCredit  is close to signing a deal with Spain's Santander to combine their asset management businesses  UniCredit CEO Federico Ghizzoni said on Saturday.",
        "date": "04182015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UniCredit close to deal with Santander on asset management units-CEO "
    },
    {
        "content": "* Industry becalmed by political deadlock over renewables   (Adds comments  industry context)",
        "date": "04012015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-Spain's Banco Santander to sell Australian wind farm - source "
    },
    {
        "content": "SANTANDER  Spain Spain's largest bank Santander will meet U.S. regulatory demands as soon as possible and aims to strengthen its current position in the country  CEO Jose Antonio Alvarez said during the bank' shareholder meeting on Friday.",
        "date": "03272015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander will meet U.S. regulatory demands as soon as possible: CEO "
    },
    {
        "content": "SANTANDER  Spain  March 27 Spain's largest bank Santander will meet U.S. regulatory demands as soon as possible and aims to strengthen its current position in the country  CEO Jose Antonio Alvarez said during the bank' shareholder meeting on Friday.",
        "date": "03272015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander will meet U.S. regulatory demands as soon as possible -CEO "
    },
    {
        "content": "MADRID  March 21 Spain's Santander said it had presented a non-binding offer for Portugal's Novo Banco  the successor to rescued Banco Espirito Santo (BES)  in the second phase of a sale process that has attracted 14 other potential bidders.",
        "date": "03212015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander makes non-binding offer for Portugal's Novo Banco "
    },
    {
        "content": "March 2 Santander Holdings USA Inc has appointed a new chief executive  a source familiar with the matter said on Monday  with the Spanish bank facing setbacks in its U.S. operations and under pressure from regulators.",
        "date": "03022015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 2-Banco Santander U.S. unit to name Powell as new CEO "
    },
    {
        "content": "Santander Holdings USA Inc has appointed a new chief executive who will work to fortify relationships between U.S. regulators and the unit of the Spanish banking giant  the Wall Street Journal reported on Sunday  citing people close to the firm.",
        "date": "03012015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Banco Santander U.S. unit to name Powell as new CEO: WSJ "
    },
    {
        "content": "March 1 Santander Holdings USA Inc has appointed a new chief executive who will work to fortify relationships between U.S. regulators and the unit of the Spanish banking giant  the Wall Street Journal reported on Sunday  citing people close to the firm.",
        "date": "03012015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 1-Banco Santander U.S. unit to name Powell as new CEO -WSJ "
    },
    {
        "content": "March 1 Santander Holdings USA Inc has appointed a new chief executive who will work to fortify relationships between U.S. regulators and the unit of the Spanish banking giant  the Wall Street Journal reported on Sunday  citing people close to the firm.",
        "date": "03012015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Banco Santander U.S. unit to name Powell as new CEO -WSJ "
    },
    {
        "content": "NEW YORK A former Banco Santander SA executive has been indicted for insider trading ahead of a proposed 2010 takeover of Potash Corp of Saskatchewan Inc by the mining group BHP Billiton Ltd  U.S. prosecutors said on Tuesday.",
        "date": "02032015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "U.S. charges ex-Banco Santander executive with insider trading "
    },
    {
        "content": "NEW YORK  Feb 3 A former Banco Santander SA  executive has been indicted for insider trading ahead of a proposed 2010 takeover of Potash Corp of Saskatchewan Inc  by the mining group BHP Billiton Ltd  U.S. prosecutors said on Tuesday.",
        "date": "02032015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 2-U.S. charges ex-Banco Santander executive with insider trading "
    },
    {
        "content": "Feb 3   * U.S. says cedric cañas maillard  a former bank adviser  has been indicted for",
        "date": "02032015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Former adviser to Banco Santander CEO indicted in U.S. for insider trading "
    },
    {
        "content": "* Shares up 3.7 pct   (Adds comments on acquisitions outlook  US business  updates shares  quotes)",
        "date": "02032015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 3-Santander boss Botin targets lending push after profit jump "
    },
    {
        "content": "MADRID Santander  the euro zone's biggest bank  has trumpeted a turnaround in lending in 2014 after two years of shrinkage  paving the way for a loan drive by new boss Ana Botin.",
        "date": "02032015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander boss Botin targets lending push after profit jump "
    },
    {
        "content": "PARIS  Feb 3 European stocks were set to inch higher on Tuesday  lifted by hopes for an agreement on the Greek debt standoff after the country's new government dropped calls for a write-off of its foreign debt and proposed swapping debt for growth-linked bonds.     Finance Minister Yanis Varoufakis  in London to reassure private investors that he was not seeking a showdown with Brussels over a new debt agreement  said the new left-wing government would spare privately held bonds from",
        "date": "02032015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Europe Factors to Watch-Shares set to rise; Santander eyed "
    },
    {
        "content": "MADRID  Feb 3 The euro zone's biggest bank  Santander  on Tuesday posted a nearly 70 percent jump in fourth quarter profit from a year earlier  lifted by earnings from its lending business and as charges on soured loans fell.",
        "date": "02032015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Spain's Santander posts 70 pct profit jump in Q4 y/y "
    },
    {
        "content": "MADRID  Jan 15 Spanish builder Sacyr  has reached an agreement with Santander on restructuring part of 2.2 billion euros ($2.6 billion) of debt associated with its 9 percent Repsol stake  a source close to the negotiations said.",
        "date": "01152015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 1-Spain's Sacyr reaches deal with Santander on Repsol debt-source "
    },
    {
        "content": "Pedro Struck  a vice president with HSBC's debt capital markets business in Mexico  has left to join Spanish bank Santander  according to sources with knowledge of the situation.",
        "date": "01132015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "MOVES: Santander hires HSBC Mexico DCM banker "
    },
    {
        "content": "MADRID George Soros bought into a fundraising by Santander  last week  a source familiar with the matter said on Monday  in the latest bet by the U.S. billionaire on Spanish banks and companies trying to ride an economic recovery.",
        "date": "01122015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Soros bought into Santander share sale  raising bet on Spain "
    },
    {
        "content": "LONDON  Jan 12 European equities rebounded on Monday  led by airlines and auto stocks after positive updates by Continental and Lufthansa.",
        "date": "01122015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Lufthansa leads European stock bounce as oil slump boosts profit "
    },
    {
        "content": "MADRID/LONDON Santander  chief Ana Botin is expected to target Britain  the United States and the bank's Spanish home market under her plan to accelerate growth after raising 7.5 billion euros ($8.8 billion) via Europe's biggest-ever quick-fire share sale.",
        "date": "01092015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "Santander eyes UK  U.S. growth after 7.5 billion euro cash call "
    },
    {
        "content": "* Shares tumble 15 pct to 13-month low   (Updates with final demand figures  share price close)",
        "date": "01092015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "UPDATE 5-Santander eyes UK  U.S. growth after 7.5 bln euro cash call "
    },
    {
        "content": "MADRID  Jan 9 Shares in Santander  opened on Friday at more than 10 percent below the price at which a 7.5 billion euro ($8.85 billion) batch of new shares was sold to bolster its capital levels.",
        "date": "01092015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander shares more than 10 pct lower after capital hike "
    },
    {
        "content": "* Spanish bank raises 7.5 bln euros with quickfire share sale",
        "date": "01082015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "UPDATE 5-Santander to boost capital and cut dividends in Botin shake-up "
    },
    {
        "content": "MADRID  Jan 8 Spain's Santander said on Thursday it had set the price of its 7.5 billion euro ($8.84 billion) capital hike at 6.18 euros per share  after it issued over 1.2 billion euros of shares in an accelerated placement.",
        "date": "01082015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander sets capital hike price at 6.18 euros per share "
    },
    {
        "content": "MADRID  Jan 8 The chief executive of Spanish banking group Santander said there was sufficient demand to cover the whole of a 7.5 billion euros ($8.85 billion) share placement announced earlier on Thursday.",
        "date": "01082015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander says capital hike covered  not eying Monte Paschi "
    },
    {
        "content": "Jan 6 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01062015",
        "name": "Banco Santander SA",
        "news_type": "topStory",
        "symbol": "SAN",
        "title": "MOVES- Banco Santander  ING Investment  Investec "
    },
    {
        "content": "LONDON  Jan 8 Banco Santander has set the price range for its capital hike at 6.18-6.50 euros a share  a source familiar with the matter said on Thursday  representing a discount of between 5 and 10 percent of the closing share price.",
        "date": "01082015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Banco Santander sets price range for capital hike - source "
    },
    {
        "content": "*  Share trading suspension to be lifted at 0730GMT on Jan. 9  Spain stock market regulator says  Further company coverage:    (Reporting By Madrid newsroom)",
        "date": "01082015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Santander shares suspension to lift on Friday morning - regulator "
    },
    {
        "content": "MADRID Santander's  new chief Ana Botin continued her shake-up of the Spanish lender on Thursday with plans to boost its capital with a 7.5 billion euro ($8.8 billion) share sale and a cut to its dividends.",
        "date": "01082015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander to boost capital and cut dividends in Botin shake-up "
    },
    {
        "content": "MADRID The euro zone's biggest bank Santander  expects its 2014 net profit to rise 30 percent from a year ago to 5.8 billion euros ($6.85 billion)  it said on Thursday  backed by an 8 percent rise in net interest income.",
        "date": "01082015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander sees 2014 profit up 30 percent year on year "
    },
    {
        "content": "MADRID  Jan 8 Spain's Santander  the euro zone's largest bank by market value  said on Thursday that it would raise 7.5 billion euros ($8.82 billion) in capital through an accelerated placement  adding it was changing its dividend policy.",
        "date": "01082015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "Santander to raise capital by 7.5 billion euros  cuts dividend "
    },
    {
        "content": "Jan 8 Spain's Santander To Raise Capital By around 7 Bln Euros",
        "date": "01082015",
        "name": "Banco Santander SA",
        "news_type": "normal",
        "symbol": "SAN",
        "title": "BRIEF-Santander to raise capital by around 7 billion euros - source "
    }
]