[
    {
        "content": "BARCELONA Europe's biggest technology company SAP  expects profit margins to flatten out during the fourth quarter after three years of declines  with improving margins to begin to show up in 2018  Chief Financial Officer Luka Mucic said on Friday.",
        "date": "11172017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP sees margins flattening out in fourth quarter: CFO "
    },
    {
        "content": "BARCELONA  Nov 17 Europe's biggest technology company SAP expects profit margins to flatten out during the fourth quarter after three years of declines  with improving margins to begin to show up in 2018  Chief Financial Officer Luka Mucic said on Friday.",
        "date": "11172017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP sees margins flattening out in fourth quarter - CFO "
    },
    {
        "content": "BARCELONA  Nov 17 Business software company SAP sees the potential for profit margins to hit bottom during the fourth quarter after three years of declines  with improving profits to begin to show up in 2018  Chief Financial Officer Luka Mucic said on Friday.",
        "date": "11172017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP sees margins flattening out in fourth quarter - CFO "
    },
    {
        "content": "SAN FRANCISCO  Oct 26 Apple Inc and General Electric Co released app-making tools on Thursday tailored to GE's Predix platform for connecting power plants  jet engines and other industrial equipment to the internet.",
        "date": "10272017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "Apple  GE release app-making tools for industrial internet "
    },
    {
        "content": "LONDON/JOHANNESBURG SAP   Europe's biggest software company  is making sweeping changes to its sales practices around the world after saying it faces a U.S. corruption probe over sales commissions paid to win South African government contracts.",
        "date": "10262017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP faces U.S. probe into South Africa kickback allegations "
    },
    {
        "content": "* Apologises over scandal (Adds comments from company critics; context  details)",
        "date": "10262017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 3-SAP faces U.S. probe into South Africa kickback allegations "
    },
    {
        "content": "LONDON  Oct 26 Global business planning software giant SAP is making sweeping changes to its sales practices in countries around the world  the German company said as it revealed it is the subject of a U.S. corruption probe tied to its business dealings in South Africa.",
        "date": "10262017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP revises sales practices as it faces U.S. probe on S. Africa "
    },
    {
        "content": "FRANKFURT/LONDON SAP   Europe's most valuable technology stock  predicted a \"dynamite\" fourth quarter for its cloud computing business  helping its shares erase losses after third-quarter results fell short of market expectations.",
        "date": "10192017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Just relax  Europe's tech leader SAP tells investors  fourth quarter will be dynamite "
    },
    {
        "content": "* Q3 core profit 1.64 bln euros  just below forecasts (Updates with management comments  analyst  shares)",
        "date": "10192017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 3-Just relax  Europe's tech leader SAP tells investors  Q4 will be dynamite "
    },
    {
        "content": "FRANKFURT  Oct 19 SAP  Europe's most valuable technology company   reported that third-quarter revenue growth slowed after a strong first half and profits came up just short of analysts' expectations.",
        "date": "10192017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP Q3 growth slows on cloud  licenses dip "
    },
    {
        "content": "* VIRTUSA PARTNERS WITH SAP TO BUILD INDUSTRY-FOCUSED SOLUTIONS FOR SAP S/4HANA CLOUD Source text for Eikon: Further company coverage:",
        "date": "10172017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-VIRTUSA PARTNERS WITH SAP TO BUILD INDUSTRY-FOCUSED SOLUTIONS FOR SAP S/4HANA CLOUD "
    },
    {
        "content": "* NAMES CHRISTIAN KLEIN TO EXECUTIVE BOARD TO LEAD GLOBAL BUSINESS OPERATIONS  EFFECTIVE JAN 1  2018‍​ Source text - http://bit.ly/2gytX9F Further company coverage: (Gdynia Newsroom)",
        "date": "10122017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "BRIEF-SAP names Christian Klein to executive board "
    },
    {
        "content": "FRANKFURT/JERUSALEM SAP   Europe's biggest technology company  has agreed to buy U.S.-Israeli customer identity software company Gigya to strengthen its position in the booming market for online customer relationship marketing  the company said on Sunday.",
        "date": "09242017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP to buy customer management software firm Gigya "
    },
    {
        "content": "* Gigya ranked market leader in identity access used by marketers",
        "date": "09242017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 2-SAP to buy customer management software firm Gigya "
    },
    {
        "content": "JERUSALEM German software group SAP  has agreed to buy online customer service provider Gigya for about $350 million  Israeli media reported on Sunday.",
        "date": "09242017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP has agreed to buy Gigya for $350 million: Israeli media "
    },
    {
        "content": "JERUSALEM  Sept 24 German software group SAP has agreed to buy online customer service provider Gigya for about $350 million  Israeli media reported on Sunday.",
        "date": "09242017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP has agreed to buy Gigya for $350 mln -Israeli media "
    },
    {
        "content": "FRANKFURT  Aug 4 German business software company SAP denied a media report on Friday that said it has imposed a complete freeze on recruitment in order to meet financial targets this year  while reiterating that it had restricted new hirings in some areas.",
        "date": "08042017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP says restrictions on new recruitment not a general hiring freeze "
    },
    {
        "content": "FRANKFURT/CAPE TOWN Software AG is launching an internal investigation after a media report alleged it had paid kickbacks as part of a wide-ranging South African scandal in which fellow German software maker SAP has also been caught up.",
        "date": "07252017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Germany's Software AG starts probe into South Africa kickback reports "
    },
    {
        "content": "FRANKFURT/CAPE TOWN  July 25 Software AG is launching an internal investigation after a media report alleged it had paid kickbacks as part of a wide-ranging South African scandal in which fellow German software maker SAP has also been caught up.",
        "date": "07252017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-Germany's Software AG starts probe into S.Africa kickback reports "
    },
    {
        "content": "FRANKFURT Newer cloud services powered a rise in second-quarter revenue at Germany's SAP but higher costs curbed profit growth  results from Europe's most valuable technology firm showed on Thursday.",
        "date": "07202017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Cloud services lift SAP sales but costs tether profit growth "
    },
    {
        "content": "FRANKFURT  July 25 Software AG said on Tuesday it is mounting an internal probe after a media report alleged it had paid kickbacks as part of a wide-ranging South Africa government bribery scheme that has also ensnared fellow German software maker SAP.",
        "date": "07252017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "Germany's Software AG starts probe into S.Africa kickback reports "
    },
    {
        "content": "FRANKFURT  July 20 Newer cloud services powered a rise in second-quarter revenue at Germany's SAP but higher costs curbed profit growth  results from Europe's most valuable technology firm showed on Thursday.",
        "date": "07202017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 2-Cloud services lift SAP sales but costs tether profit growth "
    },
    {
        "content": "FRANKFURT Germany's SAP  named a new executive team in South Africa on Friday  two days after the software giant put four senior managers on leave  pending its investigations into allegations that it was involved in a government bribery scheme.",
        "date": "07142017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP names acting executive team  law firm for South Africa probe "
    },
    {
        "content": "FRANKFURT  July 14 Germany's SAP named a new executive team in South Africa on Friday  two days after the software giant put four senior managers on leave  pending its investigations into allegations that it was involved in a government bribery scheme.",
        "date": "07172017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "CORRECTED-(OFFICIAL)-UPDATE 1-SAP names acting executive team  law firm for South Africa probe "
    },
    {
        "content": "FRANKFURT Europe's top technology company  SAP   has put four senior managers in South Africa on leave and begun a probe into reports that have dragged the company into an influence peddling scandal involving friends of President Jacob Zuma. | Video ",
        "date": "07132017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Exclusive: SAP opens probe into South African unit kickback reports "
    },
    {
        "content": "FRANKFURT Germany's SAP named a new executive team in South Africa on Friday  two days after the software giant put four senior managers on leave  pending its investigations into allegations that it was involved in a government bribery scheme.",
        "date": "07172017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP names acting executive team  law firm for South Africa probe "
    },
    {
        "content": "JOHANNESBURG  July 17 South Africa's opposition Democratic Alliance (DA) said on Monday it would file a criminal complaint against German software giant SAP over allegations of corruption involving friends of President Jacob Zuma.",
        "date": "07172017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "South African opposition party to file criminal complaint against SAP "
    },
    {
        "content": "* OpenText announces new global cloud reseller agreement with SAP to provide end-to-end HR document management Source text for Eikon: Further company coverage:",
        "date": "06152017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-OpenText enters into global cloud reseller agreement with SAP "
    },
    {
        "content": "* IBM and SAP collaborate to build new infrastructure for Helse Vest in Norway",
        "date": "06012017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-IBM and SAP collaborate to build new infrastructure for Helse Vest in Norway "
    },
    {
        "content": "MANNHEIM  Germany  May 10 SAP said on Wednesday its executive pay system was reasonable  defending management bonuses against the criticism of some shareholders.",
        "date": "05102017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP chairman defends executive pay system "
    },
    {
        "content": "MANNHEIM  Germany SAP's  supervisory board narrowly won the backing of shareholders at its annual general meeting on Wednesday after criticism of the German software company's executive pay.",
        "date": "05102017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP narrowly wins shareholder backing after pay dispute "
    },
    {
        "content": "* SAP said it would improve remuneration system (Adds background  detail  shareholder comment)",
        "date": "05102017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP narrowly wins shareholder backing after pay dispute "
    },
    {
        "content": "MANNHEIM  Germany  May 10 SAP's supervisory board only narrowly won backing from shareholders at the company's annual general meeting (AGM) on Wednesday following a revolt against the company's remuneration plans.",
        "date": "05102017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP narrowly receives shareholder endorsement "
    },
    {
        "content": "MANNHEIM  Germany SAP  co-founder and supervisory board chairman Hasso Plattner said on Wednesday that he was willing to stay beyond 2019 when is current contract ends but that he would not sign up for a full 5-year term.",
        "date": "05102017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP chairman Plattner open to extend contract beyond 2019 "
    },
    {
        "content": "FRANKFURT SAP  targets a 300-percent increase of its share price in the next few years and a market capitalization of more than 250 billion euros ($273.45 billion)  Chief Executive Bill McDermott wrote in an internal e-mail seen by Reuters.",
        "date": "05082017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP targets $273.45 billion market cap in next years: CEO in memo "
    },
    {
        "content": "FRANKFURT  May 6 Leading shareholder advisors have called on SAP investors to oppose the supervisory board of Europe's largest technology company in a dispute over management pay.",
        "date": "05062017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "Shareholder advisors challenge SAP board in row over pay "
    },
    {
        "content": "* MoU with SAP SE to launch 'Saral GST' solution for taxpayers in GST regime Source text - (Reliance Corporate IT Park Limited (“RCITPL”) – a subsidiary of Reliance Industries Limited today announced that it has signed a Memorandum of Understanding (MoU) with SAP SE<http://www.sap.com/ > (NYSE: SAP) to launch ‘SARAL GST’ solution for taxpayers in the GST regime. ) Further company coverage:",
        "date": "05032017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-Reliance Corporate IT Park signs \tMoU with SAP SE to launch solution in GST regime "
    },
    {
        "content": "JEDDAH Saudi Arabia wants German companies Siemens  and SAP  to play an important role in furthering the kingdom's \"digital transformation\"  company officials said on Sunday during German Chancellor Angela Merkel's visit to the country.",
        "date": "04302017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Siemens  SAP sign cooperation deals with Saudi Arabia: officials "
    },
    {
        "content": "FRANKFURT SAP  Europe's largest software company  reported slightly lower-than-expected first-quarter core profit as it sold more of its cloud products  which are less profitable.",
        "date": "04252017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP first-quarter core profit up 8 percent on accelerating cloud sales "
    },
    {
        "content": "* Q1 core profit 1.198 bln euros vs 1.229 bln avg in Reuters poll",
        "date": "04252017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP Q1 core profit up 8 pct on accelerating cloud sales "
    },
    {
        "content": "FRANKFURT  April 25 SAP  Europe's largest software company  reported slightly lower-than-expected first-quarter core profit as it sold more of its cloud products  which are less profitable.",
        "date": "04252017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP core profit up 8 pct on acceleration in cloud product sales "
    },
    {
        "content": "FRANKFURT  April 13 SAP  Europe's top software maker  said on Thursday that executive Steve Singh would leave the company at the end of this month.",
        "date": "04132017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP says executive Steven Singh to leave company "
    },
    {
        "content": "* Says robert enslin and bernd leukert will shift and expand their portfolios as members of executive board of sap se",
        "date": "04132017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "BRIEF-SAP has named Adaire Fox-Martin  Jennifer Morgan to executive board "
    },
    {
        "content": "* GRAPHIC-Tech stocks lead way in Europe: http://bit.ly/2h3SjpY",
        "date": "03312017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "RPT-Investors bet on a quiet tech revolution in Europe "
    },
    {
        "content": "* GRAPHIC-Tech stocks lead way in Europe: http://bit.ly/2h3SjpY",
        "date": "03302017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "Investors bet on a quiet tech revolution in Europe "
    },
    {
        "content": "BERLIN  March 15 Bosch  the world's biggest maker of automotive components  will continue to develop its own visual technology regardless of Intel's $15 billion deal to buy Mobileye  an executive said on Wednesday.",
        "date": "03152017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "Bosch sticks to own technology in face of Intel-Mobileye merger "
    },
    {
        "content": "TORONTO OutsideIQ  a Canadian startup which uses cognitive computing to analyze data  is partnering with the world's largest business commerce network  SAP Ariba  to help corporations quickly screen vendors for risk and regulatory compliance  they said.",
        "date": "03102017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Canada's OutsideIQ  SAP Ariba partner to tackle compliance  risk "
    },
    {
        "content": "FRANKFURT  March 14 Europe's top software maker SAP said on Tuesday it had patched vulnerabilities in its latest HANA software that had a potentially high risk of giving hackers control over databases and business applications used to run big multinational firms.",
        "date": "03142017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP pushes to patch risky HANA security flaws before hackers strike "
    },
    {
        "content": "FRANKFURT Germany's SAP is teaming up with Silicon Valley giant Google to allow customers to run SAP's big business applications on Google's cloud while offering Google's suite of web-based desktop apps to users  the company said on Wednesday.",
        "date": "03082017",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP to offer its business apps on Google Cloud "
    },
    {
        "content": "FRANKFURT  March 14 Europe's top software maker SAP said on Tuesday it had patched vulnerabilities in its latest HANA software that had a potentially high risk of giving hackers control over databases and business applications used to run big multinational firms.",
        "date": "03142017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP pushes to patch risky HANA security flaws before hackers strike "
    },
    {
        "content": "FRANKFURT  March 8 Germany's SAP is teaming up with Silicon Valley giant Google to allow customers to run SAP's big business applications on Google's cloud while offering Google's suite of web-based desktop apps to users  the company said on Wednesday.",
        "date": "03082017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP to offer its business apps on Google Cloud "
    },
    {
        "content": "FRANKFURT  Feb 28 SAP Chief Executive Bill McDermott's total pay last year jumped to 15.6 million euros ($16.5 million)  overtaking that of Daimler CEO Dieter Zetsche  Germany's best-paid company executive in 2015.",
        "date": "02282017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP CEO McDermott overtakes Daimler's Zetsche in 2016 pay "
    },
    {
        "content": "MUNICH  Germany  Feb 1 Top European engineering group Siemens proposed former SAP co-chief executive Jim Hagemann Snabe as its next chairman ahead of its annual shareholder meeting on Wednesday.",
        "date": "02012017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "Siemens proposes former SAP boss Snabe as next chairman "
    },
    {
        "content": "WALLDORF  Jan 24 SAP will consider initiating share buybacks but plans to keep a lid on big acquisition deals  its chief executive said on Tuesday  saying that the German software company was confident that currently available merger targets were overpriced.",
        "date": "01242017",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP eyes share buybacks while ruling out new mega-deals "
    },
    {
        "content": "FRANKFURT Some influential members of Siemens'  supervisory board favor former SAP  co-chief executive Jim Hagemann Snabe to replace Chairman Gerhard Cromme in 2018  German monthly Manager Magazin reported  citing company sources.",
        "date": "12152016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Some Siemens board members want Snabe as chairman: Manager Magazin "
    },
    {
        "content": "FRANKFURT SAP  Europe's most valuable technology company  is confident it will hit its 2016 profit target based on its order portfolio in the all-important fourth quarter and sees no obstacle to raising its dividend  Luka Mucic  the company's chief financial officer  said on Wednesday.",
        "date": "11302016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP CFO confident on 2016 profit goal  signals higher dividend "
    },
    {
        "content": "* Q3 operating profit up 1 pct at 1.64 bln vs 1.69 bln expected",
        "date": "10212016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "UPDATE 2-SAP ups 2016 operating profit guidance  expects strong fourth quarter "
    },
    {
        "content": "FRANKFURT  Oct 21 Europe's biggest software company SAP on Friday raised the lower end of its 2016 operating profit forecast range after software licenses held up in what the company called a \"strong\" quarter.",
        "date": "10212016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP raises low end of 2016 operating profit outlook range "
    },
    {
        "content": "* Says will introduce tailored  innovative solutions intended to secure successful IDMP compliance within authority timeliness  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "10052016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-NNIT announces partnership with SAP to collaborate on IDMP "
    },
    {
        "content": "FRANKFURT  Sept 28 Europe's biggest software maker SAP has earmarked 2 billion euros ($2.2 bln) for investments in products that help companies to connect everything from washing machines to cars to the Internet.",
        "date": "09282016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP to invest 2 bln euros in Internet of Things by end 2020 "
    },
    {
        "content": "WALLDORF  Germany  Sept 21 Europe's biggest software firm SAP and German car parts maker Robert Bosch have signed an agreement to partner to connect everything from screwdrivers to cars to the internet.",
        "date": "09212016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP and Bosch team up on Internet of Things "
    },
    {
        "content": "HONG KONG  Aug 9 Chinese e-commerce giant Alibaba Group Holding Ltd is offering to help international technology firms such as SAP SE to enter China  a market where foreign tech companies face increased government scrutiny.",
        "date": "08092016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "Alibaba cloud computing arm to help foreign tech firms enter China "
    },
    {
        "content": "LONDON  July 20 Europe's technology shares index climbed to its highest level since early January on Wednesday  boosted by a rally in SAP and ASML after both reported forecast-beating quarterly results.",
        "date": "07202016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "European tech index hits 6-month high as SAP and ASML climb "
    },
    {
        "content": "LONDON  July 20 European shares edged up in early trade on Wednesday  with Swiss speciality chemicals and life sciences group Lonza and software firm SAP  leading the market higher after reporting solid results.",
        "date": "07202016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "European shares rise on strong results from SAP and Lonza "
    },
    {
        "content": "FRANKFURT Unexpectedly strong growth in high-margin packaged software licenses fueled quarterly earnings of Europe's largest software company SAP   which confirmed its full-year outlook.",
        "date": "07202016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "Unexpected high license growth fuels SAP second-quarter operating profit beat "
    },
    {
        "content": "* Shares indicated up 4.2 pct to outperform main index   (Rewrites to adds shares  trader comment)",
        "date": "07202016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 2-Unexpected high license growth fuels SAP Q2 oper profit beat "
    },
    {
        "content": "FRANKFURT  July 20 Europe's largest software company SAP reported better then expected quarterly operating profit on Wednesday  helped by a rise in software licenses  especially in Europe.",
        "date": "07202016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP Q2 operating profit beats expectations on licence growth "
    },
    {
        "content": "FRANKFURT  July 10 Technology investors seeking refuge after Brexit are picking companies delivering instant access to services for Web and mobile customers or firms mainly doing business globally which can benefit from the pound's fall.",
        "date": "07102016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "European tech investors spot safe havens from Brexit worries "
    },
    {
        "content": "* Ameri100 acquires SAP consulting firm Bigtech Software  Source text for Eikon:  Further company coverage:    (Reporting By Supantha Mukherjee)",
        "date": "06292016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-Ameri100 acquires sap consulting firm Bigtech Software "
    },
    {
        "content": "The U.S. Supreme Court on Monday refused to review a case involving the cancellation of a Versata Inc patent that had previously been the subject of a $345 million jury verdict against enterprise software maker SAP SE.",
        "date": "06272016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "U.S. Supreme Court will not review Versata patent cancellation in SAP dispute "
    },
    {
        "content": "The U.S. Securities and Exchange Commission on Thursday accused a former SAP SE executive and three others of insider trading based on a tip he supplied about an impending merger.",
        "date": "06162016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "U.S. SEC charges former SAP America executive with insider trading "
    },
    {
        "content": "June 16 The U.S. Securities and Exchange Commission on Thursday accused a former SAP SE  executive and three others of insider trading based on a tip he supplied about an impending merger.",
        "date": "06162016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 2-U.S. SEC charges former SAP America executive with insider trading "
    },
    {
        "content": "* Appointed Barry Padgett as SAP's new president of SAP Business One  SAP Anywhere  and SAP Business ByDesign teams  effective July 1  2016",
        "date": "06032016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-SAP names president to lead team offering solutions for SMBS "
    },
    {
        "content": "* Says SAP has purchased 4.76 million shares of newly issued Class B common stock in castlight health",
        "date": "05182016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-Castlight Health announces strategic agreement with SAP "
    },
    {
        "content": "Apple Inc is taking another step into the corporate computing world by partnering with SAP to develop apps that run the German company's widely used business software on smartphones and tablets  the two companies said on Thursday.",
        "date": "05052016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP teams up with Apple to bring SAP's HANA to iOS "
    },
    {
        "content": "* Apple to partner with SAP to develop apps that run SAP's business planning software on smartphones and tablets  Further company coverage:",
        "date": "05052016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "BRIEF-Apple partners with SAP for apps to run SAP's business planning software on smartphones  tablets "
    },
    {
        "content": "FRANKFURT  April 20 Europe's largest software company SAP said on Wednesday first-quarter profit after tax rose 9 percent to 763 million euros ($867 million) and reiterated its full-year outlook  citing a strong order pipeline across its portfolio.",
        "date": "04202016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP Q1 profit after tax rises 9 pct  keeps 2016 outlook "
    },
    {
        "content": "FRANKFURT Europe's largest software company  SAP   warned late on Friday that first-quarter results would be weaker than expected due to slower sales of software licenses to corporate customers  particularly in Brazil and the United States.",
        "date": "04082016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP quarterly results fall short as U.S. market slows "
    },
    {
        "content": "* IBM and Sap announce plans for major investments to drive clients' digital transformations",
        "date": "04062016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-Sap Se says IBM and company plan major investments to drive clients' digital transformations "
    },
    {
        "content": "* Q1 underlying operating profit up 5 pct  short of mean forecast",
        "date": "04082016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 2-SAP quarterly results fall short as U.S. market slows "
    },
    {
        "content": "* Ceo says on-premise revenues was slower in the americas than anticipated",
        "date": "04082016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "BRIEF-SAP CEO says on-premise sales was slower in americas than anticipated "
    },
    {
        "content": "FRANKFURT  April 8 Europe's largest software company  SAP  warned late on Friday that first-quarter results would be weaker than expected due to slower sales of software licenses to corporate customers in the United States  its biggest market.",
        "date": "04082016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP first-quarter results fall short as U.S. license sales slow "
    },
    {
        "content": "FRANKFURT Business planning software giant SAP hiked the long-term stock options awarded to senior executives in 2015 while the company's board recommended a 5 percent rise in its annual dividend  according to company documents published on Tuesday.",
        "date": "03292016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP awards hefty option boost to executives  plans 5 percent dividend rise "
    },
    {
        "content": "* Also took 113 000 stock options at face value of 8.32 mln euros",
        "date": "03292016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP awards hefty option boost to execs  plans 5 pct dividend rise "
    },
    {
        "content": "FRANKFURT  March 29 Business planning software giant SAP raised the long-term stock options awarded to senior executives in 2015 while the company's board recommended a 5 percent rise in its annual dividend  according to company documents published on Tuesday.",
        "date": "03292016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP awards hefty option boost to execs  plans 5 pct dividend rise "
    },
    {
        "content": "BERLIN/FRANKFURT German software giant SAP on Thursday extended the contracts of its top executive team until 2021  according to an internal memo seen by Reuters  in a move that dispels doubts about the future tenure of Chief Executive Bill McDermott.",
        "date": "03242016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP extends contracts for executive team  including CEO  until 2021 "
    },
    {
        "content": "BERLIN/FRANKFURT  March 24 German software giant SAP on Thursday extended the contracts of its top executive team until 2021  according to an internal memo seen by Reuters  in a move that dispels doubts about the future tenure of Chief Executive Bill McDermott.",
        "date": "03242016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP extends contracts for exec team  including CEO  until 2021 "
    },
    {
        "content": "* Symsoft  a division of CLX Communications  signs global agreement with SAP to provide mobile operators with SMS Firewall solution  Source text for Eikon:",
        "date": "02092016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-CLX Communications unit signs deal with SAP "
    },
    {
        "content": "SAP SE agreed to pay nearly $3.9 million to settle U.S. Securities and Exchange Commission civil charges over a former executive's scheme to bribe Panama government officials in order to win lucrative technology contracts.",
        "date": "02012016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP settles with SEC over Panama bribery scheme "
    },
    {
        "content": "Feb 1 SAP SE agreed to pay nearly $3.9 million to settle U.S. Securities and Exchange Commission civil charges over a former executive's scheme to bribe Panama government officials in order to win lucrative technology contracts.",
        "date": "02012016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP settles with U.S. SEC over Panama bribery scheme "
    },
    {
        "content": "WALLDORF  Germany German software maker SAP on Friday raised its 2017 revenue outlook to the upper end of forecasts but said operating margins would dip as more business comes from cheaper Internet-based cloud software instead of legacy software packages.",
        "date": "01222016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP lifts 2017 sales goal; takes margin hit to gain share "
    },
    {
        "content": "FRANKFURT Europe's biggest software company SAP  does not need to invest heavily in its cloud infrastructure to keep up with the growth of the business  it chief executive said on Friday.",
        "date": "01222016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP CEO says no need for unusual investments in cloud "
    },
    {
        "content": "* Says sacrificing some margin to gain market share vs rivals",
        "date": "01222016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 3-SAP lifts 2017 sales goal; takes margin hit to gain share "
    },
    {
        "content": "FRANKFURT SAP  Europe's largest software company  on Tuesday met or slightly beat its 2015 revenue and profit targets  driven by strong year-end software license renewals and customers moving to newer Internet-based software.",
        "date": "01122016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Renewals and 'cloud' sales boost SAP  but outlook cautious "
    },
    {
        "content": "* Shares rise 3.4 percent   (Adds details on margin  shares  trader and analyst comment)",
        "date": "01122016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 2-Renewals and 'cloud' sales boost SAP  but outlook cautious "
    },
    {
        "content": "FRANKFURT  Jan 12 Europe's largest software company  SAP on Tuesday reported a 7 percent rise in operating profits  driven both by year-end software license renewals and customers converting to newer cloud-based software.",
        "date": "01122016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP 4th-qtr operating profit rises 7 pct on license renewals "
    },
    {
        "content": "FRANKFURT German business software giant SAP  is expected to hit the high-end of its 2015 operating profit forecast  helped by solid renewals of higher-margin licensed software.",
        "date": "01082016",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP seen to pre-announce strong 2015 results next week "
    },
    {
        "content": "* Transition to cloud software going well   (Adds SAP declines comment)",
        "date": "01082016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP seen to pre-announce strong 2015 results next week "
    },
    {
        "content": "FRANKFURT  Jan 8 German business software giant SAP is expected to hit the high-end of its 2015 operating profit forecast  helped by solid renewals of higher-margin licensed software.",
        "date": "01082016",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP expected to pre-announce strong 2015 results next week "
    },
    {
        "content": "WASHINGTON/MEXICO CITY A U.S. federal judge identified the former president of Panama  Ricardo Martinelli  as one of several alleged co-conspirators in a bribery scheme that helped SAP to sell millions of dollars in software to Panama  according to a document reviewed by Reuters.",
        "date": "12312015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Exclusive: U.S. ties ex-Panamanian president to SAP software bribery scheme "
    },
    {
        "content": "WASHINGTON/MEXICO CITY A U.S. federal judge identified the former president of Panama  Ricardo Martinelli  as one of several alleged co-conspirators in a bribery scheme that helped SAP to sell millions of dollars in software to Panama  according to a document reviewed by Reuters.",
        "date": "12302015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Exclusive: U.S. ties ex-Panamanian president to SAP software bribery scheme "
    },
    {
        "content": "AMSTERDAM  Dec 9 Philips has entered strategic partnerships with Cisco  SAP and Bosch  under which the Dutch company will become a preferred supplier of networked lights.",
        "date": "12092015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "Philips in lighting partnerships with Cisco  SAP and Bosch "
    },
    {
        "content": "* Philips estimates office lighting market at 1 bln euros a year   (Recasts first paragraph to clarify deals are partnerships  not supply deals)",
        "date": "12092015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 3-Philips in lighting partnerships with Cisco  SAP and Bosch "
    },
    {
        "content": "* Aim is to link real-time information from connected street lights with data from other sensors in a single integrated city dashboard",
        "date": "12092015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "BRIEF-Koninklijke Philips and SAP team up to create single integrated city dashboard "
    },
    {
        "content": "FRANKFURT  Nov 28    ** Europe's largest software company SAP expects revenues from its cloud business to surpass traditional software licensing revenues in 2018  CFO Luka Mucic tells German daily Boersen-Zeitung",
        "date": "11282015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "MEDIA-SAP sees 2018 revenues from cloud above licensing - CFO "
    },
    {
        "content": "BARCELONA  Nov 12 Europe's largest software company SAP is confident about reaching its full-year and mid-term targets  its finance chief said on Friday.",
        "date": "11122015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP CFO says confident about full year and mid-term guidance "
    },
    {
        "content": "* Says SAP S/4HANA exceeds 1 300 customers since the launch in  February 2015  Source text for Eikon:  Further company coverage:",
        "date": "10202015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-SAP says S/4HANA exceeds 1 300 customers "
    },
    {
        "content": "FRANKFURT Europe's biggest software company SAP said it could accelerate past full-year financial targets in the fourth quarter  its most important period of the year  as it confirmed the strong quarterly results it had outlined last week.",
        "date": "10202015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP says could beat targets on cloud's silver lining "
    },
    {
        "content": "* CEO says could outrun full-year targets during Q4   (Adds detail on cloud business  contrast to IBM results)",
        "date": "10202015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 2-SAP says could beat targets on cloud's silver lining "
    },
    {
        "content": "FRANKFURT  Oct 20 Europe's biggest software company SAP on Tuesday confirmed its strong third-quarter results and said its newer Internet-based cloud business could top full-year targets in the fourth quarter  the software company's most important period.",
        "date": "10202015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "CORRECTED-SAP CEO says cloud business could beat 2015 targets "
    },
    {
        "content": "FRANKFURT Europe's biggest software maker SAP  reported a 19 percent rise in third-quarter operating profit on Tuesday  surprising markets by bringing forward its forecast-beating results by a week.",
        "date": "10132015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "License sales help SAP operating profit to beat forecasts "
    },
    {
        "content": "* Still sees 2015 operating profit of 5.6-5.9 bln euros   (Rewrites  adds shares  analyst comment  detail)",
        "date": "10132015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 2-Licence sales help SAP operating profit to beat forecasts "
    },
    {
        "content": "* Supervisory board sees ex-SAP CFO as suitable chair candidate",
        "date": "09182015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "UPDATE 2-RWE names ex-SAP CFO Brandt as potential chairman "
    },
    {
        "content": "FRANKFURT  Sept 17 The chief executive of SAP   Europe's biggest software firm  lost an eye and was briefly in life-threatening danger after falling down a flight of stairs in July  the company said on Thursday.",
        "date": "09172015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP boss McDermott loses eye after falling down stairs "
    },
    {
        "content": "FRANKFURT  Sept 16 Europe's largest software maker SAP said on Wednesday it was working on a smartphone application to help migrants arriving in Germany to navigate bureaucracy and officials to register them.",
        "date": "09162015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "Germany's SAP working on migrant registration app "
    },
    {
        "content": "WALLDORF  Germany  Sept 10 German business software maker SAP is on track to meet its 2015 targets and is not seeing a change in business environment and macro-economic factors  it finance chief said on Thursday.",
        "date": "09102015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP CFO says on track to meet 2015 targets "
    },
    {
        "content": "TUEBINGEN  Sept 1 SAP unveiled a new product on Tuesday that promises to help businesses make sense of a deluge of real-world data from retail transactions  transport systems and social media  hoping to persuade customers to switch from rival database suppliers.",
        "date": "09012015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "New SAP software aims to help companies make sense of data deluge "
    },
    {
        "content": "FRANKFURT  July 28 Business planning software start-up Anaplan is nipping at the heels of industry leaders SAP   Oracle and IBM  with sales of its cloud-based service tripling in each of the past three years as it seeks to shake up the market.",
        "date": "07282015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Anaplan targets SAP  Oracle in fast-growing business planning market "
    },
    {
        "content": "FRANKFURT/STUTTGART SAP's order pipeline for the second half of the year is \"very healthy\" and will offset a decline in sales from its packaged software products  which will pose no threat to the company's full-year operating profit target  its finance chief said.",
        "date": "07212015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP CFO says pipeline looks very healthy "
    },
    {
        "content": "FRANKFURT German business software maker SAP posted quarterly profit at the low end of forecasts  hit by weak sales of its traditional packaged software and a rapid shift by customers to lower-margin cloud software delivered via the Internet.",
        "date": "07212015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP's packaged software suffers amid switch to cloud "
    },
    {
        "content": "* Still sees 2015 operating profit 5.6-5.9 bln euros   (Adds details  background  shares)",
        "date": "07212015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 2-SAP's packaged software suffers amid switch to cloud "
    },
    {
        "content": "LONDON  July 21 European shares headed for a flat to slightly higher open on Tuesday  with investors focusing on company results as the second-quarter earnings season gathered pace in Europe.",
        "date": "07212015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "European Factors to Watch-Shares seen flat to higher  focus on earnings "
    },
    {
        "content": "FRANKFURT/BERLIN  July 21 The DAX top-30 index  looked set to open 0.1 percent higher on Tuesday according to premarket data from brokerage Lang & Schwarz at 0613 GMT.",
        "date": "07212015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "German stocks - Factors to watch on July 21 "
    },
    {
        "content": "LONDON  July 21 Financial spreadbetters predicted Britain's FTSE 100 to open about 12 points higher  or up 0.2 percent  Germany's DAX  to gain 18 points  or 0.2 percent  and France's CAC 40 to open flat on Tuesday.",
        "date": "07212015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "European Factors to Watch on July 21 "
    },
    {
        "content": "FRANKFURT  July 21 German business software maker SAP  reported mixed quarterly results on Tuesday as revenues topped expectations due to a surge in newer  lower-margin cloud software delivered via the Internet  pushing down profit to the very low end of hopes.",
        "date": "07212015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP posts Q2 profit at low end of expectations  hit by cloud sales "
    },
    {
        "content": "LONDON  June 18 European shares fell on Thursday  with the Athens bourse touching three-year lows as the prospects of Greece reaching a quick deal with its international creditors faded.",
        "date": "06182015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "European shares weaken as Greek shares touch 3-year lows "
    },
    {
        "content": "LONDON  June 18 European shares fell on Thursday  with the Athens bourse touching three-year lows as the prospects of Greece reaching a quick deal with its international creditors faded.",
        "date": "06182015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "European shares slide as Greek shares touch 3-year lows "
    },
    {
        "content": "LONDON  June 18 European shares fell in early deals on Thursday as hopes of a deal between Greece and its creditors at a planned meeting later in the day receded  further straining investor nerves after weeks of fruitless negotiations.",
        "date": "06182015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "European shares fall amid receding hopes of imminent Greek deal "
    },
    {
        "content": "* Agreement aims to improve functionality of SAP landscape transformation software and automate more aspects of transformation projects",
        "date": "06092015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "BRIEF-SNP Schneider Neureither & Partner signs cooperation agreement with SAP SE "
    },
    {
        "content": "MANNHEIM  Germany German software company SAP's chief executive once again ruled out any move to acquire Salesforce.com  then went further by saying that its richly valued rival is unlikely to be acquired by any other player in the industry.",
        "date": "05202015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP chief sees no takers for software rival Salesforce "
    },
    {
        "content": "MANNHEIM  Germany  May 20 German software company SAP's chief executive once again ruled out any move to acquire Salesforce.com  then went further by saying that its richly valued rival is unlikely to be acquired by any other player in the industry.",
        "date": "05202015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP chief sees no takers for software rival Salesforce "
    },
    {
        "content": "* SAP has spent $20 bln in acquisitions in recent years   (Adds more quotes from CEO  background)",
        "date": "05052015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP has \"zero interest\" in buying Salesforce.com - CEO "
    },
    {
        "content": "FRANKFURT/WALLDORF  May 5 SAP Chief Executive Bill McDermott said his company has \"zero interest\" in acquiring software rival Salesforce.com  which is rumoured to be for sale.",
        "date": "05052015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP CEO says has \"zero interest\" in Salesforce.com deal "
    },
    {
        "content": "FRANKFURT  April 21 The weaker euro boosted revenue at German business software maker SAP in the first three months of the year and drove operating profit up 15 percent  although a rise in newer cloud-based software sales squeezed margins.",
        "date": "04212015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "UPDATE 3-SAP profit in line with forecasts as sales surge  aided by cheap euro "
    },
    {
        "content": "FRANKFURT  April 21 German business software maker SAP on Tuesday reported a 15 percent rise in operating profit helped by a cheap euro  even as rising sales of cloud-based software dampened profit margins relative to its classic licensed software business.",
        "date": "04212015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP Q1 operating profit rises 15 pct  aided by cheap euro "
    },
    {
        "content": "FRANKFURT  March 31 Klaus Tschira  one of the co-founders of European software giant SAP  has died unexpectedly at the age of 74  his foundation said on Tuesday.",
        "date": "03312015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP co-founder Klaus Tschira dies "
    },
    {
        "content": "FRANKFURT Cloud software company Salesforce.com Inc aims to overtake SAP in terms of sales on the German company's home market in the coming years  the Europe chief of Salesforce told a German magazine.",
        "date": "03282015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "Salesforce aims to surpass SAP on German market: executive tells WiWo "
    },
    {
        "content": "FRANKFURT  March 20 SAP  Europe's largest software maker  said on Friday it expected the weak euro boost to operating profit growth by up to 14 percentage points  upping its forecast after the currency weakened further in recent weeks.",
        "date": "03202015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "REFILE-UPDATE 2-SAP sees 2015 profit windfall from weak euro "
    },
    {
        "content": "FRANKFURT  March 20 Europe's largest software maker SAP expects a 11-14 percentage point boost to its current-year operating profits following further weakening in the euro against the U.S. dollar and other currencies  the company said on Friday.",
        "date": "03202015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP sees 11-14 pctg point euro windfall on 2015 profits "
    },
    {
        "content": "FRANKFURT German business software maker SAP  said on Thursday it would recommend a 10-percent dividend increase to 1.10 euros  ($1) per share to its shareholders.",
        "date": "03192015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP to recommend 10 percent dividend hike to 1.10 euros/share "
    },
    {
        "content": "FRANKFURT  March 19 German business software maker SAP said on Thursday it would recommend a 10-percent dividend increase to 1.10 euros  ($1) per share to its shareholders.",
        "date": "03192015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP to recommend 10 pct dividend hike to 1.10 euros/shr "
    },
    {
        "content": "* Beyond cloud software sales  SAP eyes second revenue stream",
        "date": "03172015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP sees procurement services as the cloud's silver lining "
    },
    {
        "content": "FRANKFURT Business software maker SAP SE  will cut about 2 250 posts  or around 3 percent of its global workforce  while creating a similar number in expanding parts of the company  as it accelerates a push to sell its products via the Internet.",
        "date": "03062015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP to cut 2 250 posts while creating similar number in refocusing "
    },
    {
        "content": "FRANKFURT  March 6 Business software maker SAP SE will cut about 2 250 posts  or around 3 percent of its global workforce  while creating a similar number in expanding parts of the company  as it accelerates a push to sell its products via the Internet.",
        "date": "03062015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP to cut 2 250 posts while creating similar number in refocusing "
    },
    {
        "content": "FRANKFURT  March 6 Business software maker SAP  will cut about 2 250 jobs  or around 3 percent of its global workforce  as the company accelerates a push to sell its products via the Internet.",
        "date": "03062015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP to cut 3 pct of jobs in accelerated cloud push "
    },
    {
        "content": "* CFO says software licences  cloud to both boost margins by 2020   (Adds CEO and CFO comments to investors  details throughout)",
        "date": "02032015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP eyes growth after unveiling major software overhaul "
    },
    {
        "content": "FRANKFURT  Feb 3 German software maker SAP  may consider buying back its own shares as a way to return capital to its shareholders  in addition to its existing commitments to boost dividends over time  the company's finance chief told investors on Tuesday.",
        "date": "02032015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP CFO says to consider buying back shares in future "
    },
    {
        "content": "* Sees classic software gross margin growth of 2 pct to 2020   (adds context  margin rate comparisons for prior years)",
        "date": "02032015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 1-SAP sees both cloud  classic margin improvements to 2020 "
    },
    {
        "content": "FRANKFURT  Feb 3 SAP believes both its newer Internet-based cloud business and its classic packaged software and support business will contribute to operating profit growth over the next five years  Chief Financial Officer Luka Mucic told investors on Tuesday.",
        "date": "02032015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP sees cloud  classic margin improvements to 2020 "
    },
    {
        "content": "FRANKFURT  Feb 3 SAP has launched the most high-stakes overhaul of its core software line in more than two decades  aiming to convince multinational corporate customers that its software can now run their most critical business applications much faster.",
        "date": "02032015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP launches biggest software product overhaul in two decades "
    },
    {
        "content": "GAZA  Jan 21 His company may not rival Google  or German software maker SAP yet  but Gaza-based IT entrepreneur Saady Lozon has plans to change that.",
        "date": "01212015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "In Gaza  an IT company has Google-sized aspirations "
    },
    {
        "content": "FRANKFURT  Jan 24 Europe's biggest software group SAP could eventually see its software delivered via the cloud deliver higher profit margins than its traditional packaged software  its finance chief told a newspaper.",
        "date": "01242015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP sees high cloud profit potential in long term "
    },
    {
        "content": "WALLDORF  Germany Europe's largest software group SAP SE has cut key profit forecasts and abandoned a target for higher margins  saying its stepped-up push to deliver products via the cloud would dampen profitability until at least 2018.",
        "date": "01202015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP sees lower margins for years to come as cloud transition bites "
    },
    {
        "content": "* 2017 operating profit outlook ex-items 6.3 bln-7.0 bln euros",
        "date": "01202015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 3-SAP sees lower margins for years to come as cloud transition bites "
    },
    {
        "content": "PARIS  Jan 20 European shares touched new seven-year highs on Tuesday after data showed China's economic growth slowed less than feared and on expectations the European Central Bank will launch a quantitative easing programme later this week.",
        "date": "01202015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "European shares rise as Chinese growth figures reassure "
    },
    {
        "content": "WALLDORF  Germany  Jan 20 Europe's largest software firm SAP lowered its 2017 operating profit outlook on Tuesday  saying its push into cloud-based software delivery would eat into its profit margins.",
        "date": "01202015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "SAP cuts 2017 profit outlook as cloud push bites "
    },
    {
        "content": "FRANKFURT Germany's SAP on Monday reported an accelerating shift by business customers to internet-delivered cloud software  as it eked out a 1 percent rise in operating profit for the fourth quarter thanks to stable demand for its more classic software.",
        "date": "01122015",
        "name": "SAP SE",
        "news_type": "topStory",
        "symbol": "SAP",
        "title": "SAP profit holds up in fourth quarter as cloud shift accelerates "
    },
    {
        "content": "* Q4 op profit up 1 pct  broadly in line with Reuters poll avg",
        "date": "01122015",
        "name": "SAP SE",
        "news_type": "normal",
        "symbol": "SAP",
        "title": "UPDATE 3-SAP profit holds up in fourth quarter as cloud shift accelerates "
    }
]