[
    {
        "content": "* SBA Communications Corp - on April 4   indirect subsidiary entered into a purchase agreement - SEC filing",
        "date": "04072017",
        "name": "SBA Communications Corporation",
        "news_type": "topStory",
        "symbol": "SBAC",
        "title": "BRIEF-SBA Communications says Sindirect subsidiary entered into purchase agreement - SEC filing "
    },
    {
        "content": "* SBA Communications shareholders approve merger in connection with REIT conversion  Source text for Eikon:  Further company coverage:",
        "date": "01122017",
        "name": "SBA Communications Corporation",
        "news_type": "topStory",
        "symbol": "SBAC",
        "title": "BRIEF-SBA Communications shareholders approve merger in connection with REIT conversion "
    },
    {
        "content": "* Intends to use net proceeds from offering to redeem all of SBA telecommunications  Llc's 5.75 percent senior notes due 2020  Source text for Eikon:  Further company coverage:",
        "date": "08012016",
        "name": "SBA Communications Corporation",
        "news_type": "topStory",
        "symbol": "SBAC",
        "title": "BRIEF-SBA Communications announces offering of $800 mln of senior notes "
    },
    {
        "content": "* Calpers  New york City Pension Funds - Request SBA Communications Corp shareowners vote for proposal to give owners access to director nomination process  Source - http://1.usa.gov/1XKUqOr Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "04212016",
        "name": "SBA Communications Corporation",
        "news_type": "topStory",
        "symbol": "SBAC",
        "title": "BRIEF-Calpers  New york City Pension Funds - Request SBA Communications Corp shareowners vote for proposal to give owners access to director nomination process "
    },
    {
        "content": "NEW YORK  Jan 7 Extenet Systems  which makes small wireless towers to help large telecom carriers improve their service in places like U.S. sports stadiums  is exploring a sale that could fetch more than $700 million  according to people familiar with the matter.",
        "date": "01072015",
        "name": "SBA Communications Corporation",
        "news_type": "normal",
        "symbol": "SBAC",
        "title": "Tower company Extenet Systems explores sale-sources "
    }
]