[
    {
        "content": "Starbucks Corp's  slow service at stores and rising competition from high-end coffee shops are likely to pressure its performance next year  analysts said  after the U.S. coffee-chain reported disappointing fourth-quarter sales on Thursday.",
        "date": "11032017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks problems to linger but turnaround on track: analysts "
    },
    {
        "content": "Nov 3 Starbucks Corp's slow service at stores and rising competition from high-end coffee shops are likely to pressure its performance next year  analysts said  after the U.S. coffee-chain reported disappointing fourth-quarter sales on Thursday.",
        "date": "11032017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks problems to linger but turnaround on track - analysts "
    },
    {
        "content": " (This story corrects third paragraph to show that U.S. same-store sales up not down.)",
        "date": "11032017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks cuts profit outlook as competitors close in "
    },
    {
        "content": "Unilever   said on Thursday it would buy the specialty tea brand Tazo from Starbucks in a deal valued at $384 million.",
        "date": "11022017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Unilever to buy tea brand Tazo from Starbucks for $384 million "
    },
    {
        "content": "Nov 2 Starbucks Corp trimmed its profit forecast and posted disappointing quarterly sales on Thursday  squeezed by competitors ranging from boutique coffee sellers like Intelligentsia and lower-price rivals including McDonald's.",
        "date": "11032017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "CORRECTED-UPDATE 5-Starbucks cuts profit outlook as competitors close in "
    },
    {
        "content": "Nov 3 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Friday:",
        "date": "11032017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Added over 2 200 net new stores to a total of now over 27 000 stores globally‍​",
        "date": "11022017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks expects earnings of $2.30 to $2.33 per share in 2018 "
    },
    {
        "content": "Nov 3 Starbucks Corp's slow service at stores and rising competition from high-end coffee shops are likely to pressure its performance next year  analysts said  after the U.S. coffee-chain reported disappointing fourth-quarter sales on Thursday.",
        "date": "11032017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks problems to linger through next year - analysts "
    },
    {
        "content": "* ‍On October 25  co entered into a $2.0 billion credit agreement and a $1.0 billion 364-day credit agreement​",
        "date": "10302017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks corp enters into a $2.0 bln credit agreement and a $1.0 bln 364-day credit agreement​ "
    },
    {
        "content": "Nov 2 Unilever  said on Thursday it would buy the specialty tea brand Tazo from Starbucks in a deal valued at $384 million.",
        "date": "11022017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Unilever to buy tea brand Tazo from Starbucks for $384 mln "
    },
    {
        "content": "Nov 2 IStarbucks Corp reported disappointing quarterly results on Thursday  after hurricanes cooled sales and amid a bitter battle with competitors ranging from boutique coffee seller Intelligentsia to lower-price rivals like McDonald's.",
        "date": "11022017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "CORRECTED-UPDATE 2-Starbucks sales disappoint and shares drop 6 percent "
    },
    {
        "content": "* Starbucks Corp - ‍q4 global and U.S. Comps up 2%  up 3% adjusted for hurricane impact; China up 8%; global traffic up 1%​",
        "date": "11022017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks reports Q4 non-GAAP earnings per share $0.55 "
    },
    {
        "content": "Nov 2 Starbucks Corp  the world's biggest coffee chain  posted a smaller-than-expected rise in quarterly sales at established cafes in the U.S.-dominated Americas region  sending its shares down more than 5 percent in afterhours trading.",
        "date": "11022017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks' Americas cafe sales rises less than expected  shares drop "
    },
    {
        "content": "* Starbucks drives single tea brand strategy with Teavana; sells Tazo brand to Unilever",
        "date": "11022017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks ‍enters agreement for Unilever to acquire assets of Tazo brand "
    },
    {
        "content": "LOS ANGELES Starbucks Corp Chairman Howard Schultz on Tuesday will debut the second season of the coffee chain's inspirational video series \"Upstanders\" on Amazon Prime  and the outspoken executive said he would not run for president  despite persistent speculation.",
        "date": "10102017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks' Schultz still not running for president  launches series on Amazon "
    },
    {
        "content": "LOS ANGELES  Oct 9 Starbucks Corp Chairman Howard Schultz on Tuesday will debut the second season of the coffee chain's inspirational video series \"Upstanders\" on Amazon Prime  and the outspoken executive said he would not run for president  despite persistent speculation.",
        "date": "10102017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks' Schultz still not running for president  launches Amazon series "
    },
    {
        "content": "* Starbucks extends licensing agreement with long-term partner  Maxim’S Caterers Limited  to accelerate growth in singapore",
        "date": "09282017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks extends licensing agreement with Maxim’s Caterers Ltd "
    },
    {
        "content": "MANILA/SINGAPORE  Sept 22 Filipino billionaire Tony Tan Caktiong  who has built Jollibee Foods Corp into a near-4 000 store purveyor of sweet-style spaghetti  burgers and fried chicken  is looking to buy existing brands in mature markets to help fuel future growth.",
        "date": "09222017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Fried chicken to crayfish wraps: Philippines' Jollibee eyes deals to grow "
    },
    {
        "content": "MILAN  Sept 19 Italy's largest coffee group Lavazza could open up to 15 stores around the world as it takes on Starbucks  but has no plans to go head-to-head in the U.S. chain's hometown of Seattle.",
        "date": "09192017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Seattle off menu as Lavazza brews up plans for 15 coffee shops "
    },
    {
        "content": "LONDON/LOS ANGELES  Sept 15 Nestle's high-priced purchase of a majority stake in California-based coffee bar chain Blue Bottle this week  highlights how big companies are seeking exposure to fast-growing premium brands driven by millenials.",
        "date": "09152017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Coffee consolidation percolates as hipsters drink up "
    },
    {
        "content": "* says including company's licensed stores‍​  over 700 Starbucks stores are closed in Southeast U.S. and Puerto Rico Further company coverage:",
        "date": "09112017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks says including licensed stores‍​  over 700 stores closed in Southeast U.S.  Puerto Rico "
    },
    {
        "content": "* Says \"We shuttered more than 500 stores across the Southeast and Puerto Rico preceding Hurricane Irma\"‍​",
        "date": "09112017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks Corp says shuttered more than 500 stores preceding Hurricane Irma‍​ "
    },
    {
        "content": "CHICAGO  Sept 6 Before taking on her new role as Starbucks Corp's second in command  Rosalind Brewer got hands-on experience brewing coffee at company cafes to get an idea how the world's biggest coffee seller could better serve customers.",
        "date": "09072017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "MOVES-Starbucks' new No.2 starts job by brewing coffee "
    },
    {
        "content": "Starbucks Corp's  shares were on track for their worst one-day decline in five years on Friday as the coffee chain's latest quarterly report triggered concerns of a slowdown in sales in the United States  its biggest market. | Video ",
        "date": "07282017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks shares tumble on fears of slowing U.S. growth "
    },
    {
        "content": "* Dow up 0.15 pct  S&P down 0.13 pct  Nasdaq down 0.12 pct (Updates with close of U.S. market)",
        "date": "07282017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-S&P 500 dented by earnings; Dow hits record high "
    },
    {
        "content": "* Dow up 0.11 pct  S&P down 0.16 pct  Nasdaq down 0.07 pct (Updates to late afternoon)",
        "date": "07282017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-S&P 500 knocked lower after earnings wave "
    },
    {
        "content": "LOS ANGELES  July 27 Starbucks Corp's new chief executive said the world's biggest coffee chain is making a long-term investment in China  amid worries that growth from its dominant U.S. market is cooling.",
        "date": "07272017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "UPDATE 4-Starbucks puts spotlight on China as U.S. growth cools "
    },
    {
        "content": "* Indexes down: Dow 0.01 pct  S&P 0.23 pct  Nasdaq 0.08 pct (Updates to early afternoon)",
        "date": "07282017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-S&P lower as Amazon  tobacco stocks drag; Dow  Nasdaq flat "
    },
    {
        "content": "July 28 Starbucks Corp's shares were on track for their worst one-day decline in five years on Friday as the coffee chain's latest quarterly report triggered concerns of a slowdown in sales in the United States  its biggest market.",
        "date": "07282017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks shares tumble on fears of slowing US growth "
    },
    {
        "content": "NEW YORK Starbucks Corp  has locked in all of its coffee needs for fiscal 2017 and 70 percent of needs for the following year  Scott Maw  the company's executive vice president and chief financial officer  said on Thursday.",
        "date": "07272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks says coffee needs 70 percent locked in for FY2018: CFO "
    },
    {
        "content": "* Indexes down: Dow 0.05 pct  S&P 0.35 pct  Nasdaq 0.43 pct (Adds details  changes comment  updates prices)",
        "date": "07282017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall St dragged lower by Amazon  tobacco stocks "
    },
    {
        "content": "LOS ANGELES Starbucks Corp's  new chief executive said the world's biggest coffee chain is making a long-term investment in China  amid worries that growth from its dominant U.S. market is cooling. | Video ",
        "date": "07282017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks puts spotlight on China as U.S. growth cools "
    },
    {
        "content": "* Q3 GAAP earnings per share $0.47; Q3 Non-GAAP earnings per share $0.55; Q3 total net revenue up 8.1 percent to $5.66 billion",
        "date": "07272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks reports Q3 EPS $0.47 "
    },
    {
        "content": "LOS ANGELES  July 27 Starbucks Corp on Thursday posted lower quarterly profit  tempered expectations for the current quarter amid softness in the U.S. retail and restaurant industries  and announced plans to close all 379 of its Teavana stores.",
        "date": "07272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks signals U.S. caution on lower profit; closing Teavana stores "
    },
    {
        "content": "Coffee chain Starbucks Corp  said on Thursday it would buy the remaining 50 percent share of its East China business from its joint venture (JV) partners for about $1.3 billion  in its biggest ever acquisition.",
        "date": "07272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to buy remaining stake in East China JV for $1.3 billion "
    },
    {
        "content": "July 27 Coffee chain Starbucks Corp said on Thursday it would buy the remaining 50 percent share of its East China business from its joint venture (JV) partners for about $1.3 billion  in its biggest ever acquisition.",
        "date": "07272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 2-Starbucks to buy remaining stake in East China JV for $1.3 bln "
    },
    {
        "content": "July 27 Starbucks Corp said on Thursday it would buy the remaining 50 percent share of its East China business from its joint venture partners for about $1.3 billion in cash.",
        "date": "07272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to buy remaining stake in East China JV for $1.3 bln "
    },
    {
        "content": "* Starbucks to acquire remaining shares of east China joint venture and operate all starbucks stores in Mainland China; acquisition advances company’s long-term China growth agenda",
        "date": "07272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks to acquire remaining shares of east China JV "
    },
    {
        "content": "A Starbucks Corp  initiative designed to improve speed and customer service has not fixed staffing shortages  according to an outside survey of company workers released on Thursday.",
        "date": "07062017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks service hurt by understaffing: Coworker.org survey "
    },
    {
        "content": "July 6 A Starbucks Corp initiative designed to improve speed and customer service has not fixed staffing shortages  according to an outside survey of company workers released on Thursday.",
        "date": "07062017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 2-Starbucks service hurt by understaffing -Coworker.org survey "
    },
    {
        "content": "July 6 An initiative by Starbucks Corp's new CEO to improve customer engagement and ease congestion at stores is struggling due to staff shortages  hurting baristas' morale and ability to serve customers  a survey of coffee chain's employees showed.",
        "date": "07062017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks customer engagement plan hurt by understaffing - survey "
    },
    {
        "content": "KUALA LUMPUR A prominent Muslim group in Malaysia has joined calls by Islamic conservatives in Indonesia for a boycott of Starbucks to protest against the international coffee chain's support of gay rights. | Video ",
        "date": "07062017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Malaysian Muslim group joins Indonesian call for Starbucks boycott over LGBT stand "
    },
    {
        "content": "KUALA LUMPUR  July 6 A prominent Muslim group in Malaysia has joined calls by Islamic conservatives in Indonesia for a boycott of Starbucks to protest against the international coffee chain's support of gay rights.",
        "date": "07062017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Malaysian Muslim group joins Indonesian call for Starbucks boycott over LGBT stand "
    },
    {
        "content": "KUALA LUMPUR  July 6 A prominent Muslim group in Malaysia has joined calls by Islamic conservatives in Indonesia for a boycott of Starbucks to protest against the international coffee chain's support of gay rights.",
        "date": "07062017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Malaysia Muslim group joins Indonesian call for Starbucks boycott over LGBT stand "
    },
    {
        "content": "JAKARTA  July 1 A leader of Indonesia's second-largest Muslim organisation has called for a boycott of Starbucks  saying that the international coffee chain's pro-gay stand risks ruining the \"religious and cultured\" core of the Southeast Asian nation.",
        "date": "07012017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Muslim leader urges Indonesians to boycott Starbucks over LGBT stand "
    },
    {
        "content": "NEW YORK  June 20 (Thomson Reuters Foundation) - U.S. coffee chain Starbucks Corp said Tuesday it will hire 2 500 refugees in Europe as part of a wider worldwide hiring plan  months after the policy prompted a backlash from some customers.",
        "date": "06202017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks set to hire 2 500 refugees in Europe "
    },
    {
        "content": "* Stability in FX  commodities  and politics behind improvement",
        "date": "06152017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Late night Ramadan shopping shows Indonesia's economic spirits brightening "
    },
    {
        "content": "MEXICO CITY  May 30 Mexican restaurant operator Alsea said on Tuesday it had reached an agreement with U.S. investment firm General Atlantic to sell its minority stake in Grupo Axo  a company that operates fashion brands.",
        "date": "05302017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Mexico's Alsea agrees to sell Grupo Axo stake to General Atlantic "
    },
    {
        "content": "MEXICO CITY  May 30 Mexican restaurant operator Alsea said on Tuesday it had reached an agreement with U.S. investment firm General Atlantic to sell its minority stake in Grupo Axo  a company that operates fashion brands.",
        "date": "05302017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Mexico's Alsea agrees to sell Grupo Axo stake to General Atlantic "
    },
    {
        "content": "A glitch in a software update caused cash registers at some U.S. and Canadian Starbucks Corp  stores to go offline for several hours on Tuesday  forcing them to give away free coffee or only take cash.",
        "date": "05162017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks software glitch takes some stores offline "
    },
    {
        "content": "May 16 A glitch in a software update caused cash registers at some U.S. and Canadian Starbucks Corp stores to go offline for several hours on Tuesday  forcing them to give away free coffee or only take cash.",
        "date": "05162017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 2-Starbucks software glitch takes some stores offline "
    },
    {
        "content": "May 16 Starbucks Corp said on Tuesday that some of its outlets in the United States and Canada suffered payment system outages due to a technology update implemented at store registers.",
        "date": "05162017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Payment system outages hit some Starbucks stores "
    },
    {
        "content": "* Some Starbucks seeing a payment system outage  the issue is affecting chains across the U.S. and parts of Canada - CNBC Source text - http://cnb.cx/2qnNzma Further company coverage: (Bengaluru Newsroom)",
        "date": "05162017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Some Starbucks seeing payment system outage  issue affecting chains across U.S. and parts of Canada - CNBC "
    },
    {
        "content": "May 5 Starbucks Corp may be in a bit of hot water over its Unicorn beverage as a New York City coffee shop has filed a federal trademark infringement lawsuit against the coffee chain over the popular drink  court documents showed.",
        "date": "05052017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "NYC coffee shop sues Starbucks over Unicorn beverage "
    },
    {
        "content": "May 4 Starbucks Corp said on Thursday it would expand its  loyalty rewards program at grocery stores to include more products  as it seeks to win more customers amid a soft retail and restaurant environment in the United States.",
        "date": "05042017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks expands rewards program at grocery stores "
    },
    {
        "content": "LOS ANGELES Starbucks Corp's  new chief executive has a tall order to fill in keeping the world's biggest coffee chain's promise to return to historic growth rates amidst stubborn U.S. restaurant and retail slumps.",
        "date": "04272017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks results disappoint  new CEO must brew up growth "
    },
    {
        "content": "LOS ANGELES  April 27 Starbucks Corp's new chief executive has a tall order to fill in keeping the world's biggest coffee chain's promise to return to historic growth rates amidst stubborn U.S. restaurant and retail slumps.",
        "date": "04272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 3-Starbucks results disappoint  new CEO must brew up growth "
    },
    {
        "content": "LOS ANGELES  April 27 Starbucks Corp reported quarterly profit that matched Wall Street's estimate on Thursday  sending shares of the chain that often tops expectations down 2.9 percent to $59.50 in after-hours trade.",
        "date": "04272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks profit meets Wall Street view  shares fall "
    },
    {
        "content": "NEW YORK Starbucks baristas have taken to social media to complain about  the coffee chain's entry into the latest food craze: Unicorn Frappuccino.",
        "date": "04212017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks' Unicorn Frappuccino sparks backlash from baristas "
    },
    {
        "content": "NEW YORK  April 21 Starbucks baristas have taken to social media to complain about  the coffee chain's entry into the latest food craze: Unicorn Frappuccino.",
        "date": "04212017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks' Unicorn Frappuccino sparks backlash from baristas "
    },
    {
        "content": "NEW YORK  April 21 Starbucks baristas have taken to social media to complain about  the coffee chain's entry into the latest food craze: Unicorn Frappuccino.",
        "date": "04212017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "REFILE -Starbucks Unicorn Frappuccino sparks backlash from baristas "
    },
    {
        "content": "* Announced the expansion of its mobile order & pay platform to give customers the option to order Starbucks beverage while on the go",
        "date": "03222017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks announces expansion of its mobile order & pay platform "
    },
    {
        "content": "LOS ANGELES  March 22 Starbucks Corp co-founder Howard Schultz will host his final shareholder meeting as chief executive officer on Wednesday before Chief Operating Officer Kevin Johnson takes the helm of the global coffee chain on April 3.",
        "date": "03222017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks CEO Schultz to host last shareholder meeting "
    },
    {
        "content": "LOS ANGELES  March 30 Starbucks Corp will open a dedicated mobile order and pay store next week in its Seattle headquarters building as it tests how to best serve convenience-oriented customers  the company said in a letter to employees on Thursday.",
        "date": "03302017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to test mobile order and pay-only store at headquarters "
    },
    {
        "content": "* Starbucks issues first global yen sustainability bond in japan",
        "date": "03172017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks issues first global Yen sustainability bond in Japan "
    },
    {
        "content": "* Starbucks adds visitor center to its costa rican coffee farm  Hacienda Alsacia  Source text for Eikon:  Further company coverage:",
        "date": "03132017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks adds visitor center to its costa rican coffee farm "
    },
    {
        "content": "* Coffee chain brings sustainability bonds to Japan in overseas debut",
        "date": "03132017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks quenches Japanese thirst for SRI bonds "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 09 (Fitch) Fitch Ratings has assigned an 'A' rating to Starbucks  Corporation's (Starbucks; NASDAQ: SBUX) proposed JPY85 billion (approximately  USD750 million) issuance of fixed-rate seven-year senior unsecured notes. At  Jan. 1  2017  Starbucks had USD3.2 billion of debt. A full list of Starbucks'  ratings is provided at the end of this release. The notes will be issued under an indenture dated Sept. 15  2016 and will r",
        "date": "03092017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Fitch Rates Starbucks' JPY85B (approx. USD750MM) Issuance 'A' "
    },
    {
        "content": "LOS ANGELES Starbucks Corp's  vow to hire thousands of refugees after President Donald Trump's first executive order that temporarily banned travel from seven mostly-Muslim nations appears to be hurting customer sentiment of the coffee chain.",
        "date": "03102017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks CEO's refugee comments sour customer views of chain: survey "
    },
    {
        "content": "LOS ANGELES  March 10 Starbucks Corp on Friday said its business has not been hurt by a social media boycott campaign started in response to the chain's promise to hire 10 000 refugees globally over the next five years.",
        "date": "03112017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks says boycott threats over refugee hiring hasn't hurt brand "
    },
    {
        "content": "LOS ANGELES  March 9 Starbucks Corp's vow to hire thousands of refugees after President Donald Trump's first executive order that temporarily banned travel from seven mostly-Muslim nations appears to be hurting customer sentiment of the coffee chain.",
        "date": "03102017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks CEO's refugee comments sour customer views of chain - survey "
    },
    {
        "content": "* Starbucks will issue its first yen-denominated bonds by the end of the month  possibly raising over 50 billion yen ($436 million) - Nikkei",
        "date": "03032017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks to issue its first yen-denominated bonds by end of month - Nikkei "
    },
    {
        "content": "Starbucks CEO Howard Schultz wants to conquer Italy  the home of espresso  to fulfill a long-time dream of his. The world's biggest coffee seller plans to debut in Milan late next year with a sprawling  super-premium Reserve Roastery.",
        "date": "02282017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Business Watch: Starbucks’ Italian job "
    },
    {
        "content": "LOS ANGELES  Feb 27 Starbucks Corp is making a big bet on Italy  the home of espresso  with plans to debut in Milan late next year with a sprawling  super-premium Reserve Roastery in a turn-of-the-century post office building on Piazza Cordusio.",
        "date": "02282017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks bets on super premium 'Roastery' to lead Italy debut "
    },
    {
        "content": "* Square-On Feb 24  entered warrant cancellation & payment agreement relating to warrant to buy up to 9.5 million shares of class a stock issued to Starbucks",
        "date": "02272017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Square entered warrant cancellation and payment agreement relating to shares issued to Starbucks "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 16 (Fitch) Fitch Ratings has affirmed the Issuer Default  Ratings (IDRs) of Starbucks Corporation (Starbucks; NASDAQ: SBUX) at 'A/F1'. The  Rating Outlook is Stable. At Jan. 1  2017 Starbucks had $3.2 billion of total  debt. A full list of Starbucks' ratings is provided at the end of this release.  Starbucks' ratings reflect its consistent sales and operating earnings growth   balanced financial strategy and market lea",
        "date": "02162017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Fitch Affirms Starbucks at 'A/F1'; Outlook Stable "
    },
    {
        "content": "LOS ANGELES  Feb 7 Yum China Holdings Inc   reporting for the first time as a standalone company  on Tuesday said its profit beat expectations for the fourth quarter despite just missing Wall Street's target for sales at established restaurants.",
        "date": "02082017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "CORRECTED-UPDATE 2-Yum China restaurant sales flat in fourth quarter "
    },
    {
        "content": "Starbucks Corp   facing backlash from some customers over its plans to hire refugees  said it would speed up its previously stated goal of hiring 10 000 veterans and military spouses by 2018.",
        "date": "02022017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks responds to criticism over refugee hiring blowback "
    },
    {
        "content": "Feb 2 Starbucks Corp  facing backlash from some customers over its plans to hire refugees  said it would speed up its previously stated goal of hiring 10 000 veterans and military spouses by 2018.",
        "date": "02022017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks responds to criticism over refugee hiring blowback "
    },
    {
        "content": "Feb 2 Starbucks Corp  facing backlash from some customers over its plans to hire refugees  said it would speed up its previously stated goal of hiring 10 000 veterans and military spouses by 2018.",
        "date": "02022017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to speed up hiring of veterans amid refugee blowback "
    },
    {
        "content": "NEW YORK  Jan 29 Starbucks Corp Chief Executive Officer Howard Schultz said on Sunday that the company planned to hire 10 000 refugees over five years in 75 countries  two days after U.S. President Donald Trump's executive order banning refugees from certain countries.",
        "date": "01302017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks CEO Schultz plans to hire 10 000 refugees after Trump ban "
    },
    {
        "content": "* Starbucks - launching voice ordering capabilities within the Starbucks mobile iOS app and the popular Amazon Alexa platform  Source text : http://bit.ly/2kj21JI",
        "date": "01302017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks launches voice ordering in mobile app  Amazon Alexa platform "
    },
    {
        "content": "LOS ANGELES  Jan 26 Starbucks Corp on Thursday trimmed its full-year revenue forecast and reported a weaker-than-expected rise in quarterly sales at established restaurants in its Americas region  sending shares down 3.4 percent in extended trade.",
        "date": "01262017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "CORRECTED-UPDATE 3-Starbucks curbs 2017 revenue forecast after U.S. store visits drop "
    },
    {
        "content": "LOS ANGELES  Jan 26 Starbucks Corp  reported a smaller-than-expected rise in quarterly sales at established restaurants in its U.S.-dominated Americas region amid a persistent restaurant slump.",
        "date": "01262017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks Americas cafe sales disappoint "
    },
    {
        "content": "MEXICO CITY  Jan 27 Seeking to quell a social media campaign imploring Mexicans to boycott U.S. companies  Starbucks defended itself on Friday  saying it had invested millions in the country  created more than 7 000 jobs  and that its local unit is Mexican-owned.",
        "date": "01272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks in crosshairs as Mexico boycott campaign simmers "
    },
    {
        "content": "* Starbucks Corp - executive chairman Howard Schultz's 2016 total compensation was $21.8 million versus $20.1 million in 2015 - SEC filing",
        "date": "01272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks executive chairman Schultz's 2016 total compensation was $21.8 mln "
    },
    {
        "content": "LOS ANGELES Starbucks Corp  on Thursday trimmed its full-year revenue forecast and reported a smaller-than-expected rise in quarterly sales at established restaurants in the Americas  sending its shares down 3.8 percent in after-hours trade.",
        "date": "01272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks curbs 2017 revenue forecast after U.S. store visits drop "
    },
    {
        "content": "LOS ANGELES  Jan 26 Starbucks Corp on Thursday trimmed its full-year revenue forecast and reported a smaller-than-expected rise in quarterly sales at established restaurants in the Americas  sending its shares down 3.8 percent in after-hours trade.",
        "date": "01272017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "REFILE-UPDATE 5-Starbucks curbs 2017 revenue forecast after U.S. store visits drop "
    },
    {
        "content": "* Said on Monday that its prelim. Q4 revenue was 1.21 billion zlotys  ($297.39 million)  up 32.2 pct year on year",
        "date": "01242017",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-AmRest Holdings prelim. Q4 revenue up 32.2 pct yoy "
    },
    {
        "content": "Jan 25 Starbucks Corp nominated Microsoft Corp Chief Executive Satya Nadella to its board at a time when the company is increasingly focusing on technology to drive sales.",
        "date": "01252017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks nominates Microsoft CEO Nadella to its board "
    },
    {
        "content": "* Nominates Rosalind Brewer  Jorgen Vig Knudstorp And Satya Nadella to its board of directors",
        "date": "01252017",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks nominates Rosalind Brewer  Jorgen Vig Knudstorp and Satya Nadella to its board of directors "
    },
    {
        "content": "BRUSSELS Europe's top court will decide next week on Spanish tax breaks for foreign takeovers in a ruling that may give clues as to how judges will deal with more complex tax cases involving Starbucks  and Apple .",
        "date": "12162016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "EU court ruling on Spanish tax breaks eyed for clues on Starbucks  Apple appeals "
    },
    {
        "content": "Peet's Coffee & Tea  a longtime rival to Starbucks Corp   said on Friday it will invest $58 million to open a new coffee roasting facility in Suffolk  Virginia  to support its expanding business in an increasingly competitive environment.",
        "date": "12092016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Peet's expanding roasting capacity amid premium coffee boom "
    },
    {
        "content": "LOS ANGELES/NEW YORK Starbucks Corp Chief Executive and co-founder Howard Schultz's plan to build a new prestige brand is a bet that moving upscale can raise the profile of the world's largest coffee brand with millennials like Megan Sauers. ",
        "date": "12072016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks courts millennials with $10 coffee at new Reserve bars "
    },
    {
        "content": "Starbucks Corp  unveiled a five-year growth plan  under which it would open more stores around the world  including several high-end coffee shops  while targeting annual revenue growth of 10 percent.",
        "date": "12072016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks sets five-year growth targets  to open 12 000 more stores "
    },
    {
        "content": "Starbucks Chief Executive Howard Schultz's decision to step down is unlikely to hamper growth at the world's biggest coffee chain as his successor Kevin Johnson is well suited to take the helm  analysts said. | Video ",
        "date": "12022016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks' CEO transition unlikely to stymie growth: analysts "
    },
    {
        "content": "Starbucks Corp  co-founder Howard Schultz will step down as chief executive to focus on new high-end coffee shops  handing the top job to Chief Operating Officer Kevin Johnson  a long-time technology executive.",
        "date": "12022016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks CEO steps down to focus on high-end coffee  shares fall "
    },
    {
        "content": "* EGM on Dec. 21 to remove Mistry as Tata Steel director   (Adds details from source  background)",
        "date": "11252016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 2-India's Tata Steel removes Cyrus Mistry as chairman "
    },
    {
        "content": "MUMBAI  Nov 16 Cyrus Mistry has told Tata Global Beverages that his removal as chairman of the company was wrong but has not made a formal legal complaint  two sources familiar with the matter said on Wednesday.",
        "date": "11162016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Ousted chairman has not made legal complaint to Tata Global Beverages-sources "
    },
    {
        "content": "* Mistry defends his record at Tata Sons   (Releads with chairman's ousting at Tata Global Beverages)",
        "date": "11152016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 2-Tata Global Beverages ousts Cyrus Mistry as chairman "
    },
    {
        "content": "MUMBAI  Nov 16 The office of Cyrus Mistry issued a legal notice to Tata Global Beverages Ltd  challenging his removal as chairman of the company  TV news channel ET Now reported on Wednesday citing unidentified sources.",
        "date": "11162016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Cyrus Mistry sends legal notice to Tata Global Beverages - ET NOW "
    },
    {
        "content": "MUMBAI  Nov 15 Tata Global Beverages  which co-owns and runs Starbucks coffee stores across India  said on Tuesday the board of directors has voted to remove Cyrus Mistry as chairman and appoint Tata veteran Harish Bhat in his place.",
        "date": "11152016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "India's Tata Global Beverages board removes Cyrus Mistry as chairman "
    },
    {
        "content": "Nov 16 Indian shares rose on Wednesday  in line with Asian peers as a pause in the global bond rout and rally in the dollar lifted risk sentiment  while cooling retail inflation back home bolstered the chances of a rate cut next month.",
        "date": "11162016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Indian shares rise in line with Asian peers; banknotes withdrawal weighs "
    },
    {
        "content": "* Mistry ousted as Tata Sons chairman in board coup last month",
        "date": "11142016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Key week for Tata tussle as Mistry faces Tata Motors board "
    },
    {
        "content": "* Results come amidst power struggle at Tata group   (Updates with details  background  quote)",
        "date": "11152016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Tata Motors shares plunge on weak earnings at Jaguar Land Rover "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_11162016.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     11:00 am: Winter session of parliament begins in New Delhi.     3:00 pm: Prime Minister Narendra Modi and Information & Broadcasting Minister Venkaiah Naidu at Press council of India event in New Del",
        "date": "11162016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Morning News Call - India  November 16 "
    },
    {
        "content": "Starbucks Corp  reported better-than-expected quarterly results on Thursday  as sales in the U.S.-dominated Americas region soothed concerns that the world's biggest coffee seller had succumbed to a broader restaurant slump.",
        "date": "11032016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks posts higher quarterly revenue  issues cautious forecast "
    },
    {
        "content": "Nov 3 Starbucks Corp reported better-than-expected quarterly results on Thursday  as sales in the U.S.-dominated Americas region soothed concerns that the world's biggest coffee seller had succumbed to a broader restaurant slump.",
        "date": "11032016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 4-Starbucks posts higher quarterly revenue  issues cautious forecast "
    },
    {
        "content": "* Starbucks Corp - board of directors approves 25% increase in quarterly dividend to $0.25 per share  Source text for Eikon:  Further company coverage:",
        "date": "11032016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks Corp - board approves 25% increase in quarterly dividend "
    },
    {
        "content": "NEW YORK Starbucks Corp has locked in two-thirds of its fiscal 2017 coffee needs and expects prices will be \"a little\" favorable  but likely offset by foreign exchange pressures  Chief Financial Officer Scott Maw said on Thursday.",
        "date": "11032016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks has locked in two-thirds of 2017 coffee needs "
    },
    {
        "content": "Nov 3 Starbucks Corp reported sales at established U.S. cafes that matched analysts' expectations  sending its shares up almost 4 percent in extended trading.",
        "date": "11032016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks Americas region same-store sales meet expectations "
    },
    {
        "content": "Oct 19 Starbucks Corp on Wednesday named its first chief executive officer for China and said it plans to more than double its store count in that country to 5 000 by 2021.",
        "date": "10192016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks names China CEO  sees 5 000 stores there by 2021 "
    },
    {
        "content": "* Starbucks elevates Belinda Wong to chief executive officer  Starbucks China; targets 5 000 stores in mainland China by 2021",
        "date": "10192016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks promotes Belinda Wong to CEO of Starbucks china "
    },
    {
        "content": "* company expects to more than double size of its cold beverage business in Canada within five years  Source text for Eikon:  Further company coverage:",
        "date": "10202016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks Canada expects to more than double size of its cold beverage business in Canada within five years "
    },
    {
        "content": "Oct 20 Starbucks Corp Chief Executive Howard Schultz on Thursday unveiled new growth plans for the chain's upscale Reserve brand as it fights off competition from super-premium coffee rivals like Blue Bottle and Intelligentsia.",
        "date": "10202016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks plans new 'Reserve' targets in super-premium battle "
    },
    {
        "content": "* Affine signs a 12-year lease agreement with Starbucks  for its Quai des Marques mall in Bordeaux  Source text: http://bit.ly/2d8X5jL Further company coverage:    (Gdynia Newsroom)",
        "date": "10032016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Affine signs 12-year lease agreement with Starbucks "
    },
    {
        "content": "CHANGSHA  China/BEIJING  Sept 30 Property speculators in China are looking for the next big thing beyond the country's major cities. And they may have found it in the inland city of Changsha.",
        "date": "09302016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "CORRECTED-UPDATE 1-Fever spreads: China's property speculators descend on inland cities "
    },
    {
        "content": "Dunkin' Brands Group Inc  said on Thursday its doughnut chain will partner with Coca-Cola Co  to launch a line of bottled coffee beverages in the United States  its first foray into the ready-to-drink coffee market dominated by rival Starbucks Corp .",
        "date": "09292016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Dunkin' partners with Coca-Cola on bottled coffee "
    },
    {
        "content": "* Files for potential debt shelf; size not disclosed  Source text - http://bit.ly/2cRIfi2 Further company coverage:",
        "date": "09152016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks files for potential debt shelf "
    },
    {
        "content": "MADRID Spanish investment fund ProA Capital will acquire a 30 percent stake in restaurant group VIPS from Goldman Sachs for an undisclosed amount  VIPS said in a statement on Thursday.",
        "date": "09152016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Spanish fund to buy 30 percent of restaurant group VIPS from Goldman Sachs "
    },
    {
        "content": "MADRID  Sept 15 Spanish investment fund ProA Capital will acquire a 30 percent stake in restaurant group VIPS from Goldman Sachs for an undisclosed amount  VIPS said in a statement on Thursday.",
        "date": "09152016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Spanish fund to buy 30 pct of restaurant group VIPS from Goldman Sachs "
    },
    {
        "content": "Sept 16 Starbucks Corp on Friday amended the company's bylaws to allow long-time shareholders to nominate board members.",
        "date": "09162016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks allows long-term shareholders to nominate board members "
    },
    {
        "content": "* Board amended and restated company's amended and restated bylaws",
        "date": "09162016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks board amends and restates company's amended and restated bylaws "
    },
    {
        "content": "* To offer Teavana beverages and full leaf teas in more than 6 200 stores across its 16 markets in China and Asia Pacific region  Source text : http://bit.ly/2c4KWzT Further company coverage:",
        "date": "09122016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks to offer Teavana beverages  full leaf teas in China and Asia Pacific "
    },
    {
        "content": "* Starbucks to give option of Stevia based  zero calorie sweetener in stores starting Sept 6",
        "date": "09062016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks to give option of Stevia based  zero calorie sweetener in stores starting Sept 6 "
    },
    {
        "content": "Sept 6 The world's largest coffee chain Starbucks Corp said it would serve a stevia-based  zero-calorie sweetener at select cafes in the U.S. and Canada.",
        "date": "09062016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to serve stevia-based sweetener in select cafes "
    },
    {
        "content": "* Blames China's slowing economy   (Add further earnings details  context)",
        "date": "08292016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Chinese food maker Tingyi quarterly profit drops 87 pct  says outlook challenging "
    },
    {
        "content": "HONG KONG  Aug 29 Chinese food and beverage maker Tingyi (Cayman Islands) Holding Corp on Monday reported an 87 percent plunge in second-quarter net profit  weighed down by a slowing economy  and said the outlook for the industry remains challenging.",
        "date": "08292016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Chinese food maker Tingyi Q2 profit slides 87 pct  outlook challenging "
    },
    {
        "content": "* Cuts share stake in American Airlines Group Inc by 67.6 pct to 296 018 shares - SEC filing",
        "date": "08152016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Soros Fund Management dissolves share stake in T-Mobile US  Starbucks "
    },
    {
        "content": "A federal judicial panel is set to weigh requests to create new multidistrict litigation for claims over Honest Co products touted as being free of sodium lauryl sulfate  Starbucks beverages and dental crowns made by a subsidiary of 3M.",
        "date": "07282016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "MDL Watch: Panel to consider Honest Co  Starbucks and 3M dental crown cases "
    },
    {
        "content": "July 25 Starbucks Corp on Monday said it was tweaking its management structure as part of a long-range growth strategy that includes opening new retail concepts  including upscale coffee shops and bakery outlets.",
        "date": "07252016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks shuffles management as it rolls out new store concepts "
    },
    {
        "content": "* Futures up: Dow 25 pts  S&P 3.5 pts  Nasdaq 7.75 pts   (Adds details  comments  updates prices)",
        "date": "07222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall St set to open marginally higher "
    },
    {
        "content": "July 22 U.S. stock index futures were higher on Friday  a day after the Dow industrials snapped a nine-session streak of gains and as investors assessed earnings reports from a host of industrial companies including GE.",
        "date": "07222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Futures edge up a day after Dow snaps winning streak "
    },
    {
        "content": "Starbucks Corp  reported quarterly cafe sales growth that fell short of expectations in all major markets as customers made fewer visits  sending its shares down almost 3 percent on Thursday.",
        "date": "07212016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks cafe sales miss targets as growth cools  stock falls "
    },
    {
        "content": "July 21 Starbucks Corp reported quarterly cafe sales growth that fell short of expectations in all major markets as customers made fewer visits  sending its shares down almost 3 percent on Thursday.",
        "date": "07212016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 4-Starbucks cafe sales miss targets as growth cools  stock falls "
    },
    {
        "content": "NEW YORK Starbucks Corp  has locked in prices on more than 50 percent of its coffee needs for fiscal 2017  Chief Financial Officer Scott Maw said on Thursday  on a conference call with analysts to discuss its third-quarter results.",
        "date": "07212016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks has locked in more than 50 percent of 2017 coffee needs "
    },
    {
        "content": "* Fy16 operating margin is expected to increase slightly versus prior year",
        "date": "07212016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks Q3 GAAP earnings per share $0.51 "
    },
    {
        "content": "July 21 Starbucks Corp's quarterly cafe sales growth missed analysts' estimates  cooling in all major markets and sending shares down almost 5 percent on Thursday.",
        "date": "07212016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks growth cools  cafe sales miss targets "
    },
    {
        "content": "LOS ANGELES  July 13 Starbucks Corp on Wednesday announced a financial investment and global licensing deal with Princi  an artisanal bakery based in Milan  Italy.",
        "date": "07132016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks invests in Italy's Princi boutique bakery "
    },
    {
        "content": "* Starbucks says as part of investments in china  starbucks announced launch of starbucks mobile payment experience in china",
        "date": "07122016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks debuts \"Mobile Payment Experience\" in China "
    },
    {
        "content": "* Announces role as global licensee and investor in the Italian restaurant Princi",
        "date": "07132016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks announces role as global licensee  investor in Princi "
    },
    {
        "content": "* On July 12  Starbucks made a small price adjustment in U.S. company-operated stores",
        "date": "07122016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks Corp announces price adjustment in U.S.company-operated stores "
    },
    {
        "content": "Starbucks Corp will raise the wages of all workers in its U.S. stores this autumn  after being accused by employees of \"extreme\" cutbacks in work hours at its American cafes.",
        "date": "07112016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to raise wages for U.S. workers in October "
    },
    {
        "content": "July 11 Starbucks Corp said it will raise worker pay in its U.S. stores this autumn  after employees accused the coffee chain of \"extreme\" cutbacks in work hours that they say are hurting morale and service.",
        "date": "07112016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 6-Starbucks to raise wages for U.S. workers in October "
    },
    {
        "content": "July 11 Starbucks Corp will raise the wages of all workers in its U.S. stores this autumn  after being accused by employees of \"extreme\" cutbacks in work hours at its American cafes.",
        "date": "07112016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 4-Starbucks to raise wages for U.S. workers in October "
    },
    {
        "content": "July 11 Starbucks Corp said on Monday it will raise the wages of all employees in its U.S. stores by 5-15 percent this year through an increase in base pay and stock awards.",
        "date": "07112016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "REFILE-Starbucks to increase wages for U.S. workers in October "
    },
    {
        "content": "* Says This October  All Partners And Store Managers In U.S. Company Operated stores will receive an increase in base pay of 5 percent or greater",
        "date": "07112016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks says to hike wages for Partners  Store Managers in October "
    },
    {
        "content": "* On July 12  planning small price increase on select beverages;  that price adjustment was prematurely entered into point of sale systems in U.S. Company-Operated stores",
        "date": "07022016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks statement on system error "
    },
    {
        "content": "LOS ANGELES  June 30 Nearly 9 000 Starbucks Corp  workers and supporters have signed an online petition saying that the company has made \"extreme labor cuts\" at U.S. cafes  hurting employee morale as well as customer service.",
        "date": "06302016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks workers petition for more hours amid labor cuts "
    },
    {
        "content": "LOS ANGELES An online petition accusing Starbucks Corp of \"extreme\" cutbacks in work hours at its U.S. cafes  hurting both employee morale and customer service  has been signed by more than 9 000 people.",
        "date": "06302016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks accused of slashing employee work hours amid cost cuts "
    },
    {
        "content": "LOS ANGELES  June 30 An online petition accusing Starbucks Corp of \"extreme\" cutbacks in work hours at its U.S. cafes  hurting both employee morale and customer service  has been signed by more than 9 000 people.",
        "date": "06302016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks accused of slashing employee work hours amid cost cuts "
    },
    {
        "content": "June 27 Starbucks Corp for the first time will sell single-origin  premium coffee from India in the United States as part of its effort to support coffee production in the country better known for its tea.",
        "date": "06272016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to debut small-lot Indian coffee in U.S. this year "
    },
    {
        "content": "A federal judge said two Starbucks  customers may pursue a lawsuit accusing the coffee chain of cheating patrons by underfilling lattes.",
        "date": "06202016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks customers may seek damages over underfilled lattes: judge "
    },
    {
        "content": "June 20 A federal judge said two Starbucks  customers may pursue a lawsuit accusing the coffee chain of cheating patrons by underfilling lattes.",
        "date": "06202016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks customers may seek damages over underfilled lattes -judge "
    },
    {
        "content": "LOS ANGELES  June 2 Anheuser-Busch and Starbucks on Thursday announced a deal to produce  bottle  distribute and market Teavana ready-to-drink teas in the United States  with products expected to be available in the first half of next year.",
        "date": "06022016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks  Anheuser-Busch to partner on bottled Teavana teas "
    },
    {
        "content": "LOS ANGELES  June 2 Anheuser-Busch and Starbucks announced a deal on Thursday to produce  bottle  distribute and market Teavana ready-to-drink teas in the United States  with products expected to be available in the first half of next year.",
        "date": "06022016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks  Anheuser-Busch to partner on bottled Teavana teas "
    },
    {
        "content": "* AB InBev  Starbucks to partner on tea distribution in the U.S -WSJ  citing sources",
        "date": "06022016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-AB InBev  Starbucks to partner on tea distribution in the U.S- WSJ "
    },
    {
        "content": "* Starbucks CEO on CNBC - Overstatement to say U.S. is heading to a recession",
        "date": "05312016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks CEO on CNBC - Overstatement to say U.S. is heading to a recession "
    },
    {
        "content": "* Starbucks CEO sees growth in India will parallel that of China - CNBC",
        "date": "05262016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks CEO sees growth in India will parallel that of China - CNBC "
    },
    {
        "content": "May 26 Starbucks Corp  the world's biggest coffee company  said on Thursday it would open a coffee roastery in Shanghai  China in 2017  its first outside the United States.",
        "date": "05262016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to open first coffee roastery outside U.S. in Shanghai "
    },
    {
        "content": "A woman who previously settled a consumer-protection lawsuit against Kraft Foods Global and Starbucks over a discontinued line of coffee pods cannot continue to pursue the case as a class action  a federal appeals court held Monday.",
        "date": "05172016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Kraft  Starbucks defeat appeal of coffee pod settlement "
    },
    {
        "content": "CHICAGO  May 2 A Chicago woman has sued Starbucks Corp in federal court  claiming the world's largest coffee chain puts too much ice in chilled drinks  and is seeking $5 million.",
        "date": "05022016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Chicago woman sues Starbucks for putting too much ice in drinks "
    },
    {
        "content": "JOHANNESBURG U.S. coffee chain Starbucks  plans to open up to 150 stores in South Africa  founder and chief executive Howard Schultz said on Friday.",
        "date": "04292016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks plans 150 stores in South Africa: CEO "
    },
    {
        "content": "April 22 Starbucks Corp's quarterly numbers may not have been enough to satisfy investors craving a stronger cup of joe  but analysts believe its long-term growth prospects remain solid.",
        "date": "04222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Analysts look past Starbucks vanilla numbers  focus on mobile push "
    },
    {
        "content": "* Alphabet has worst day since 2012; Microsoft drags on indexes",
        "date": "04222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall Street ends flat; Alphabet and Microsoft tumble "
    },
    {
        "content": "* Indexes: Dow +0.04 pct  S&P -0.12 pct  Nasdaq -0.99 pct   (Updates to afternoon)",
        "date": "04222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall Street mixed as Alphabet  Microsoft tumble "
    },
    {
        "content": "* Indexes down: Dow 0.27 pct  S&P 0.43 pct  Nasdaq 1.39 pct   (Updates to early afternoon)",
        "date": "04222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Earnings drag Wall St lower even as oil steadies "
    },
    {
        "content": "* Indexes down: Dow 0.38 pct  S&P 0.45 pct  Nasdaq 1.44 pct   (Adds details  changes comment  updates prices)",
        "date": "04222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall St lower as earnings take sheen off oil surge "
    },
    {
        "content": "* Dow up 0.07 pct  S&P down 0.07 pct  Nasdaq down 0.72 pct   (Updates to open)",
        "date": "04222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall St flat as earnings fail to excite investors "
    },
    {
        "content": "* Futures: Dow up 1 pt  S&P up 0.75 pts  Nasdaq down 7.5 pts   (Adds details  comment  updates prices)",
        "date": "04222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall St set for flat open on mixed earnings reports "
    },
    {
        "content": "* Futures: Dow up 13 pts  S&P up 3.5 pts  Nasdaq down 1.75 pts",
        "date": "04222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Futures flat as investors await earnings reports "
    },
    {
        "content": "* Starbucks extends licensing agreement with Amrest to grow stores in Germany",
        "date": "04202016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks extends licensing agreement with Amrest to grow stores in Germany "
    },
    {
        "content": "April 21 Starbucks Corp on Thursday posted quarterly cafe sales that missed analysts' growth estimates for every region where it operates and issued a disappointing full-year forecast  sending its shares down about 4 percent.",
        "date": "04212016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "UPDATE 5-Starbucks cafe sales growth falls short  shares fall "
    },
    {
        "content": "April 21 Starbucks Corp on Thursday reported global cafe sales growth that fell just short of Wall Street expectations.",
        "date": "04212016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks cafe sales growth falls short  shares fall "
    },
    {
        "content": "* Q2 earnings per share view $0.39 -- Thomson Reuters I/B/E/S",
        "date": "04212016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks Q2 earnings per share $0.39 "
    },
    {
        "content": "* Starbucks has seen double-digit growth in No.3 Asian market",
        "date": "04052016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Coffee wars: South Korea's cafe boom nears saturation point "
    },
    {
        "content": "SEATTLE/LOS ANGELES Starbucks Corp  said on Wednesday it will sell espresso pods for Nestle SA's  popular Nespresso home brewers in Europe and unveil a new way for customers to earn loyalty points for free food and drinks outside its cafes.",
        "date": "03232016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks announces Nespresso pod deal  new loyalty perks "
    },
    {
        "content": "SEATTLE/LOS ANGELES  March 23 Starbucks Corp  said on Wednesday it will sell espresso pods for Nestle SA's popular Nespresso home brewers in Europe and unveil a new way for customers to earn loyalty points for free food and drinks outside its cafes.",
        "date": "03232016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "REFILE-UPDATE 1-Starbucks announces Nespresso pod deal  new loyalty perks "
    },
    {
        "content": "SEATTLE/LOS ANGELES  March 23 Starbucks Corp  on Wednesday will announce plans to begin selling espresso pods for Nespresso home brewers in Europe and unveil a new way for patrons to earn loyalty points outside of its cafes.",
        "date": "03232016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to announce Nespresso pod deal  new loyalty perks "
    },
    {
        "content": "FRANKFURT Dunkin' Donuts is on a drive to win customers from Starbucks after the rival coffee and snacks chain changed its loyalty scheme to favor higher spending customers over frequent buyers.",
        "date": "03042016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Dunkin' Donuts to target Starbucks customers after loyalty scheme shake-up "
    },
    {
        "content": "JOHANNESBURG  March 3 Starbucks will open its first store in South Africa next month in the upmarket Johannesburg suburb of Rosebank  the coffee giant's local licensee Taste Holdings said on Thursday.",
        "date": "03032016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to open first shop in South Africa next month "
    },
    {
        "content": "March 1 Starbucks Corp said on Tuesday former Chief Operating Officer Troy Alstead would not return from his extended unpaid leave.",
        "date": "03012016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Former Starbucks COO Alstead to not return from extended leave "
    },
    {
        "content": "* Starbucks says first Starbucks store in Italy to open in Milan in 2017",
        "date": "02282016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-First Starbucks store to open in Italy in 2017 "
    },
    {
        "content": "NEW YORK  Feb 28 Starbucks Corp  the world's biggest coffee chain  said on Sunday that Italian businessman Antonio Percassi would open the first Starbucks cafe in Milan in early 2017  bringing the brand to one of the top coffee-consuming nations in Europe.",
        "date": "02292016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks cafes to open in Italy in early 2017 "
    },
    {
        "content": "LOS ANGELES  Feb 22 Starbucks Corp on Monday announced changes to its North American loyalty program that will mean some customers will have to spend more money at the coffee chain to earn free food and drinks.",
        "date": "02222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks tightens rewards program rules "
    },
    {
        "content": "LOS ANGELES  Feb 22 Starbucks Corp on Monday announced changes to its  loyalty program that will mean some customers will have to spend more money at the coffee chain to earn free food and drinks.",
        "date": "02222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks tightens rewards program rules "
    },
    {
        "content": "Feb 11 PepsiCo Inc reported better-than-expected quarterly net revenue on Thursday as higher sales of snacks and non-fizzy beverages such as Gatorade in North America helped reduce the impact of a strong dollar.",
        "date": "02112016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 4-PepsiCo revenue beats estimates as sales rise in North America "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 01 (Fitch) Fitch Ratings has assigned an 'A' rating to  Starbucks Corporation's (Starbucks; NASDAQ: SBUX) proposed $500 million  aggregate issuance of fixed-rate five-year senior unsecured notes. At Dec. 27   2015  Starbucks had approximately $2.3 billion of total debt. A full list of  Starbucks' ratings is provided at the end of this release. The notes will be issued under Starbucks' Aug. 23  2007 indenture and will r",
        "date": "02012016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Fitch Rates Starbucks' Proposed $500MM Note Issuance 'A' "
    },
    {
        "content": "Jan 22 Tepid growth in Asia might have taken some steam out of Starbucks Corp's latest quarterly sales  but both the company and analysts remain upbeat about the coffee chain's prospects in China.",
        "date": "01222016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks still hot on China despite muted sales "
    },
    {
        "content": "Starbucks Corp  forecast current-quarter earnings below Wall Street estimates and reported slower growth in Asia than many had hoped  sending its shares down nearly 4 percent in extended trade despite a strong holiday performance.",
        "date": "01212016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks stock slips after profit forecast misses Street estimates "
    },
    {
        "content": "Jan 21 Starbucks Corp forecast current-quarter earnings below Wall Street estimates and reported slower growth in Asia than many had hoped  sending its shares down nearly 4 percent in extended trade despite a strong holiday performance.",
        "date": "01212016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 3-Starbucks stock slips after profit forecast misses Street estimates "
    },
    {
        "content": "SAN FRANCISCO Starbucks Corp  has locked in prices on more than 90 percent of its coffee needs for 2016  Chief Financial Officer Scott Maw said in a telephone interview after the company announced earnings on Thursday.",
        "date": "01212016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks has locked prices on 'well over' 90 percent of 2016 coffee "
    },
    {
        "content": "SAN FRANCISCO  Jan 21 Starbucks Corp  has locked in prices on more than 90 percent of its coffee needs for 2016  Chief Financial Officer Scott Maw said in a telephone interview after the company announced earnings on Thursday.",
        "date": "01212016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks has locked prices on 'well over' 90 pct of 2016 coffee "
    },
    {
        "content": "Jan 21 Starbucks Corp reported better-than-expected sales growth at established cafes in the holiday quarter  helped by strength in its Americas division  its largest.",
        "date": "01212016",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks cafe sales growth beats expectations "
    },
    {
        "content": "A Starbucks Corp advertising campaign showing colorful lines bursting from the coffee chain's signature green straws did not rip off the work of a Brooklyn visual artist  a U.S. judge ruled on Tuesday in throwing out her copyright infringement lawsuit.",
        "date": "01122016",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks defeats artist in Frappuccino copyright flap "
    },
    {
        "content": "The UK division of Starbucks  on Tuesday reported higher profits for the year ending Sept. 27  even as its tax payment to Britain decreased by as much as 28 percent.",
        "date": "12162015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks UK profit rises  taxes decrease "
    },
    {
        "content": "Dec 15 The UK division of Starbucks on Tuesday reported higher profits for the year ending Sept. 27  even as its tax payment to Britain decreased by as much as 28 percent.",
        "date": "12162015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "REFILE-Starbucks UK profit rises  taxes decrease (Dec 15) "
    },
    {
        "content": "NEW YORK Taking coffee maker Keurig Green Mountain Inc  private will give JAB Holding Co an opportunity to press for higher margins and even increase prices for the single-serve K-Cups used in about 21 million U.S. homes  analysts and industry bankers said.",
        "date": "12092015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Stumptown in a K-Cup? Keurig deal brings margin opportunity "
    },
    {
        "content": "NEW YORK  Dec 8 Taking coffee maker Keurig Green Mountain Inc private will give JAB Holding Co an opportunity to press for higher margins and even increase prices for the single-serve K-Cups used in about 21 million U.S. homes  analysts and industry bankers said.",
        "date": "12082015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Stumptown in a K-Cup? Keurig deal brings margin opportunity "
    },
    {
        "content": "AMSTERDAM The Dutch Finance Ministry said on Friday it will appeal against a European Commission ruling ordering it to recover up to 30 million euros ($31.8 million) in taxes from Starbucks.",
        "date": "11272015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Dutch government to appeal EU ruling on Starbucks tax deal "
    },
    {
        "content": "AMSTERDAM  Nov 27 The Dutch Finance Ministry said on Friday it will appeal against a European Commission ruling ordering it to recover up to 30 million euros ($31.8 million) in taxes from Starbucks.",
        "date": "11272015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Dutch government to appeal EU ruling on Starbucks tax deal "
    },
    {
        "content": "AMSTERDAM  Nov 27 The Dutch Finance Ministry said on Friday it will appeal a European Union Commission ruling ordering it to recover up to 30 million euros ($31.8 million) in taxes from Starbucks.",
        "date": "11272015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Dutch govt to appeal EU commission ruling on Starbucks tax deal "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 13 (Fitch) Fitch Ratings has upgraded the Issuer Default  Ratings (IDRs) of Starbucks Corporation (Starbucks; NASDAQ: SBUX) to 'A/F1' from  'A-/F2'. Fitch has also assigned an 'A' rating to the company's new bank credit  facility. The Ratings Outlook is Stable. A full list of Starbucks' ratings is  provided at the end of this release. KEY RATING DRIVERS The upgrade reflects that Starbucks has exceeded Fitch's expectati",
        "date": "11132015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Fitch Upgrades Starbucks IDRs to 'A/F1'; Outlook Stable "
    },
    {
        "content": "Starbucks Corp  delivered a disappointing profit forecast for the holiday quarter on the heels of strong cafe sales and profit growth  sending its shares lower.",
        "date": "10302015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks cafe sales hot  but holiday forecast disappoints "
    },
    {
        "content": "Oct 29 Starbucks Corp delivered a disappointing profit forecast for the holiday quarter on the heels of strong cafe sales and profit growth  sending its shares lower.",
        "date": "10302015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 4-Starbucks cafe sales hot  but holiday forecast disappoints "
    },
    {
        "content": "Starbucks Corp  delivered a disappointing profit forecast for this holiday quarter on the heels of strong cafe sales and profit growth  sending its shares down as much as 3 percent in after-hours trading.",
        "date": "10292015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks cafe sales hot  but holiday forecast disappoints "
    },
    {
        "content": "Oct 29 Starbucks Corp delivered a disappointing profit forecast for this holiday quarter on the heels of strong cafe sales and profit growth  sending its shares down as much as 3 percent in after-hours trading.",
        "date": "10292015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "CORRECTED-UPDATE 3-Starbucks cafe sales hot  but holiday forecast disappoints "
    },
    {
        "content": "Oct 29 Starbucks Corp brewed up another quarter of cafe sales growth  fueled by strength in both the Americas and Asia.",
        "date": "10292015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks quarterly cafe sales hotter than expected "
    },
    {
        "content": "LOS ANGELES  Oct 22 Starbucks Corp on Thursday said it was moving its U.S. payment processing from start-up Square Inc to Chase Commerce Solutions  a division of JPMorgan Chase & Co..",
        "date": "10222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks moves U.S. payment processing from Square to Chase "
    },
    {
        "content": "MILAN Starbucks Corp   the world's biggest coffee chain  is in talks with an Italian partner to open branches in Italy  one of the few major markets where it has yet to make an entrance  a source familiar with the matter said on Thursday.",
        "date": "10152015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks in talks to bring brand to Italy: source "
    },
    {
        "content": "BRUSSELS Starbucks Corp  said it would appeal a decision by the European Commission on Wednesday which found it benefited from unfair state aid in the Netherlands and ordered it to pay additional taxes there.",
        "date": "10212015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks to appeal EU tax decision  cites 'errors' "
    },
    {
        "content": "MILAN  Oct 15 Starbucks Corp  the world's biggest coffee chain  is in talks with an Italian partner to open branches in Italy  one of the few major markets where it has yet to make an entrance  a source familiar with the matter said on Thursday.",
        "date": "10152015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks in talks to bring brand to Italy -source "
    },
    {
        "content": "BRUSSELS  Oct 21 Starbucks Corp said it would appeal a decision by the European Commission on Wednesday which found it benefited from unfair state aid in the Netherlands and ordered it to pay additional taxes there.",
        "date": "10212015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to appeal EU tax decision  cites \"errors\" "
    },
    {
        "content": "HALF MOON BAY  Calif  Oct 8 Starbucks Corp  locations will begin accepting Apple Inc's  mobile payment system in a pilot program starting this year  Apple Vice President Jennifer Bailey said at an event on Thursday.",
        "date": "10082015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Apple Pay to land in Starbucks  Chili's  KFC "
    },
    {
        "content": "LOS ANGELES  Oct 8 Meal delivery service Munchery on Thursday said it hired Pascal Rigo  a former Starbucks executive  as its chief customer experience officer.",
        "date": "10082015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Meal delivery start-up Munchery hires former Starbucks executive "
    },
    {
        "content": "CHICAGO  Oct 1 Starbucks Corp will switch to using only eggs laid by cage-free chickens at its North American locations within five years  the company told Reuters on Thursday.",
        "date": "10012015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks to switch to 100 pct cage-free eggs by 2020 "
    },
    {
        "content": "JOHANNESBURG Starbucks' local partner sees potential for more than 200 of the U.S. chain's coffee shops in South Africa within five years  it said on Wednesday  as it prepares to open the country's first Starbucks' outlet next year.",
        "date": "09232015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks' partner sees potential for 200 South African cafes in five years "
    },
    {
        "content": "JOHANNESBURG  Sept 23 Starbucks' local partner sees potential for more than 200 of the U.S. chain's coffee shops in South Africa within five years  it said on Wednesday  as it prepares to open the country's first Starbucks' outlet next year.",
        "date": "09232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks' partner sees potential for 200 S. African cafes in five years "
    },
    {
        "content": "LOS ANGELES Starbucks Corp on Tuesday said its sales-boosting Mobile Order & Pay service is now available in all of its nearly 7 500 U.S. company-operated shops  a nationwide roll-out completed about three months ahead of schedule. | Video ",
        "date": "09222015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks expands sales-boosting Mobile Order & Pay across U.S. "
    },
    {
        "content": "Sept 24 Starbucks Corp  the world's biggest coffee chain  said it would raise the minimum wage for its UK staff to 7.20 pounds ($10.92) an hour in April 2016  regardless of age  and offer interest-free loans to employees moving into new homes.",
        "date": "09252015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks to raise wages for UK employees from April "
    },
    {
        "content": "BRUSSELS  Sept 22 Finance ministers of euro zone's major economies renewed on Tuesday their commitment to curb multinational corporations' tax avoidance and called for more consistent rules to reduce \"harmful\" tax competition.",
        "date": "09222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Eurozone heavyweights resume tax offensive on multinational companies "
    },
    {
        "content": "Sept 24 Starbucks Corp  the world's biggest coffee chain  promised to raise the average wage for its UK staff to just under 8 pounds ($12.18) an hour from November regardless of age  the Financial Times reported.",
        "date": "09252015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to raise wages for UK employees- FT "
    },
    {
        "content": "LOS ANGELES  Sept 22 Starbucks Corp on Tuesday said its sales-boosting Mobile Order & Pay service is now available in all of its nearly 7 500 U.S. company-operated shops  a nationwide roll-out completed about three months ahead of schedule.",
        "date": "09222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks expands sales-boosting Mobile Order & Pay across U.S. "
    },
    {
        "content": "LOS ANGELES  Sept 22 Starbucks Corp on Tuesday said it is now offering its sales-boosting Mobile Order & Pay service in all of its more than 7 400 U.S. company-operated shops  completing its nationwide roll-out about three months ahead of schedule.",
        "date": "09222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks takes sales-boosting Mobile Order & Pay nationwide "
    },
    {
        "content": "Sept 15 Yum Brands Inc's <YUM.N > Taco Bell chain next week will debut a new restaurant concept that dumps the drive-thru and brings on the booze as it seeks to appeal to hip  young city dwellers and fend off popular rival Chipotle Mexican Grill Inc.",
        "date": "09152015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Taco Bell joins fast-food booze bandwagon with new U.S. eateries "
    },
    {
        "content": "David Israel's four-year old company  Pop Gourmet  has a deal to sell snacks at Starbucks and a sought-after licensing agreement with uber-hip sriracha seller Huy Fong Foods  but it is his prison time that makes the brand stand-out in a crowded field.",
        "date": "09042015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Pop Gourmet CEO on sriracha  Starbucks and life after prison "
    },
    {
        "content": "Aug 7 Coca-Cola Co is nearing a deal to buy a minority stake in U.S. organic juice company Suja Life LLC  people familiar with the matter said on Friday  as the soft drink giant tries to identify the next big hit with consumers.",
        "date": "08072015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Coca-Cola near deal for organic juice company Suja -sources "
    },
    {
        "content": "NEW YORK  Aug 3 For U.S. coffee shops  business usually cools down as the weather heats up.",
        "date": "08032015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "INSIGHT-Americans' taste for cold brew transforms summertime coffee market "
    },
    {
        "content": "NEW YORK  Aug 3 For U.S. coffee shops  business usually cools down as the weather heats up.",
        "date": "08032015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "RPT - INSIGHT-Americans' taste for cold brew transforms summertime coffee market "
    },
    {
        "content": "The S&P 500 and Nasdaq posted their largest weekly drops since March on Friday as slowing global growth dragged commodity-related stocks lower while an earnings-fueled drop in Biogen took down the biotech sector.",
        "date": "07242015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Wall Street slides to end rough week on macro  earnings concerns "
    },
    {
        "content": "* Amazon jumps to record high after posting unexpected profit",
        "date": "07242015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall Street slumps as materials  health stocks weigh "
    },
    {
        "content": "July 24 U.S. stock index futures were higher on Friday after three straight days of losses as Amazon  Visa and Starbucks beat expectations.",
        "date": "07242015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Futures higher after strong earnings reports "
    },
    {
        "content": "Starbucks Corp  reported higher quarterly profit on Thursday as new food  drinks and technology helped the world's biggest coffee chain attract more customers.",
        "date": "07232015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks' cafe sales hotter than expected  boost profit "
    },
    {
        "content": "July 23 Starbucks Corp reported higher quarterly profit on Thursday as new food  drinks and technology helped the world's biggest coffee chain attract more customers.",
        "date": "07232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 2-Starbucks' cafe sales hotter than expected  boost profit "
    },
    {
        "content": "NEW YORK  July 23 Starbucks sees coffee costs as \"somewhat unfavorable\" through the rest of 2015  though this will be offset by dairy prices  Chief Financial Officer Scott Maw said in the company's second quarter 2015 earnings conference call on Thursday.",
        "date": "07232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks CFO sees coffee costs as 'somewhat unfavorable' in 2015 "
    },
    {
        "content": "* Starbucks Corp  PepsiCo enter into agreement for marketing  sale  distribution of Starbucks Ready-To-Drink coffee  energy beverages in Latin America",
        "date": "07232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks  PepsiCo sign agreement for Ready-To-Drink coffee  energy beverages in Latin America "
    },
    {
        "content": "July 23 Starbucks Corp reported higher quarterly profit on Thursday  as cafe sales heated up in its U.S.-dominated Americas region.",
        "date": "07232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks' cafe sales growth accelerates "
    },
    {
        "content": "JOHANNESBURG Coffee giant Starbucks  will open stores in sub-Saharan Africa for the first time next year after agreeing a deal with Taste Holdings  on Tuesday  sending the South African company's shares soaring 20 percent.",
        "date": "07142015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks to enter sub-Saharan Africa next year "
    },
    {
        "content": "* Global brands tapping into growing African middle-class   (Adds details  analyst comment)",
        "date": "07142015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 2-Starbucks to enter sub-Saharan Africa next year "
    },
    {
        "content": "JOHANNESBURG  July 14 Shares in restaurant and retail group Taste Holdings jumped nearly 20 percent on Tuesday after the company said it had signed an exclusive deal with coffee giant Starbucks to develop outlets in South Africa.",
        "date": "07142015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Taste Holdings shares jump on Starbucks stores deal "
    },
    {
        "content": "* Taste signs exclusive licence with Starbucks Coffee Company and withdrawal of cautionary announcement",
        "date": "07142015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Taste Holdings signs exclusive licence with Starbucks "
    },
    {
        "content": "July 6 Starbucks Corp said it would raise prices for some of its coffee beverages by 5-20 cents in the United States from Tuesday.",
        "date": "07062015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to hike coffee prices in some U.S. outlets "
    },
    {
        "content": "* Subsidiary Casino Restauration partners with Starbucks to open Starbucks stores across France",
        "date": "06302015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Casino Restauration partners with Starbucks to open starbucks stores across France "
    },
    {
        "content": "NEW YORK  June 24 International Finance Corporation (IFC)  Ecom Agroindustrial Corp  Starbucks Corp    InterAmerican Development Bank  Global Agriculture and Food Security Program:",
        "date": "06242015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Nicaraguan coffee farmers to receive $30 mln in loans "
    },
    {
        "content": "Starbucks Corp  the world's biggest coffee chain  said it would close all 23 of its La Boulange retail locations by the end of September as the stores were not sustainable for its long-term growth.",
        "date": "06172015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks to close all La Boulange retail locations "
    },
    {
        "content": "June 16 Starbucks Corp  the world's biggest coffee chain  said it would close all 23 of its La Boulange retail locations by the end of September as the stores were not sustainable for its long-term growth.",
        "date": "06172015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks to close all La Boulange retail locations "
    },
    {
        "content": "LONDON  June 16 Four years after failing in an initial attempt at common company tax rules across Europe  the EU is set to have a second go as it tries to tackle the low-tax arrangements of some states that have benefited the likes of Amazon  Starbucks and Apple.",
        "date": "06162015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "EU executive to propose common tax base for multinationals - again "
    },
    {
        "content": "June 16 Starbucks Corp said late Tuesday it would close all 23 La Boulange retail locations as well as the two manufacturing facilities that serve those locations  by the end of September.",
        "date": "06172015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to close all its La Boulange retail locations "
    },
    {
        "content": "EU regulators' investigations into the low tax arrangements of Apple  Starbucks and Amazon  in some member states are at an advanced stage and decisions could be announced in the coming months  a senior European Commission official said on Thursday.",
        "date": "06112015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "EU tax probes on Apple  Amazon  Starbucks at advanced stage - European Commission "
    },
    {
        "content": "BRUSSELS EU regulators' investigations into the low tax arrangements of Apple   Starbucks  and Amazon  in some member states are at an advanced stage and decisions could be announced in the coming months  a senior European Commission official said on Thursday.",
        "date": "06112015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "EU tax probes on Apple  Amazon  Starbucks at advanced stage: European Commission "
    },
    {
        "content": "BRUSSELS  June 11 EU regulators' investigations into the low tax arrangements of Apple  Starbucks  and Amazon in some member states are at an advanced stage and decisions could be announced in the coming months  a senior European Commission official said on Thursday.",
        "date": "06112015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "EU tax probes on Apple  Amazon  Starbucks at advanced stage -European Commission "
    },
    {
        "content": "June 8 McDonald's Corp posted a smaller-than-expected drop in worldwide sales at established restaurants in May after a lift from value meal deals in Europe helped offset continued weakness in the United States  its top market for profit.",
        "date": "06082015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 3-McDonald's European meal deals help offset weak U.S. May sales "
    },
    {
        "content": "LOS ANGELES Starbucks Corp  on Friday said it would stop sourcing water for its Ethos Water brand in California  which is in the fourth year of a serious drought that has prompted the state's first-ever mandatory cuts in water use.",
        "date": "05092015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks moves Ethos water bottling out of drought-hit California "
    },
    {
        "content": "BRUSSELS  May 5 EU regulators will miss a June deadline to decide whether tax deals granted by individual member states to companies including Apple and Starbucks are legal because they lack some data  the EU's antitrust chief said on Tuesday.",
        "date": "05052015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "UPDATE 1-EU to delay decisions on tax deals with multinationals "
    },
    {
        "content": "BRUSSELS European Competition Commissioner Margrethe Vestager said on Tuesday she would no longer be able to finalize investigations into tax treatment for Apple  Starbucks  Fiat and Amazon in the second quarter as planned.",
        "date": "05052015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "EU's Vestager says will not complete tax inquiries in Second quarter "
    },
    {
        "content": "LOS ANGELES Starbucks Corp  on Friday said it would stop sourcing water for its Ethos Water brand in California  which is in the fourth year of a serious drought that has prompted the governor  to order the state's first-ever mandatory water use cuts of 25 percent.",
        "date": "05082015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks moves Ethos water bottling out of drought-hit California "
    },
    {
        "content": "BRUSSELS  May 5 European Competition Commissioner Margrethe Vestager said on Tuesday she would no longer be able to finalise investigations into tax treatment for Apple  Starbucks  Fiat and Amazon  in the second quarter as planned.",
        "date": "05052015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "EU's Vestager says will not complete tax inquiries in Q2 "
    },
    {
        "content": "LOS ANGELES  May 8 Starbucks Corp on Friday said it would stop sourcing water for its Ethos Water brand in California  which is in the fourth year of a serious drought that has prompted the state's first-ever mandatory cuts in water use.",
        "date": "05082015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 2-Starbucks moves Ethos water bottling out of drought-hit California "
    },
    {
        "content": "LOS ANGELES  May 8 Starbucks Corp on Friday said it would stop sourcing water for its Ethos Water brand in California  which is in the fourth year of a serious drought that has prompted the governor  to order the state's first-ever mandatory water use cuts of 25 percent.",
        "date": "05082015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "CORRECTED-Starbucks moves Ethos water bottling out of drought-hit California "
    },
    {
        "content": "Starbucks Corp on Thursday opened the first of five  express stores planned for 2015 in New York City as it and other restaurant chains work to give service times a double shot of speed.",
        "date": "04302015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks opens first express store in New York City "
    },
    {
        "content": "April 24 Starbucks Corp said on Friday night that an outage affecting payment systems at a number of its stores in the United States and Canada had been resolved.",
        "date": "04252015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks payment system outage in U.S.  Canada resolved "
    },
    {
        "content": "April 24 Starbucks Corp experienced a widespread systems outage in its stores in United States and Canada on Friday night  causing a number of them to give away free drinks  CNBC reported.",
        "date": "04252015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks stores in U.S. and Canada hit by systems outage -CNBC "
    },
    {
        "content": "Starbucks Corp said on Thursday sales at its coffee shops in the Americas region grew more than expected  boosted by sales of breakfast sandwiches  lunch and new drinks  such as Flat White.",
        "date": "04232015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks' strong results quash growth woes  shares rise "
    },
    {
        "content": "NEW YORK Starbucks Corp has locked in prices on 70 percent of 2016 coffee needs at \"favorable\" levels when compared to its 2015 coffee costs  its chief financial officer said in a call to announce the company's fiscal second-quarter results.",
        "date": "04232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks CFO says prices locked in for 70 percent of 2016 coffee needs "
    },
    {
        "content": "April 23 Starbucks Corp said on Thursday sales at its coffee shops in the Americas region grew more than expected  boosted by sales of breakfast sandwiches  lunch and new drinks  such as Flat White.",
        "date": "04232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 2-Starbucks' strong results quash growth woes  shares rise "
    },
    {
        "content": "NEW YORK  April 23 Starbucks has locked in prices on 70 percent of 2016 coffee needs at \"favorable\" levels when compared to its 2015 coffee costs  chief financial officer Scott Maw said in a call to announce the company's second quarter fiscal year 2015 results.",
        "date": "04232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks locks in prices for 70 percent of 2016 coffee needs "
    },
    {
        "content": "April 23 Starbucks Corp on Thursday said foreign exchange will take a bigger bite out of revenue and earnings this year than it had forecast.",
        "date": "04232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks sees bigger hit from foreign exchange this year "
    },
    {
        "content": "April 23 Starbucks Corp said on Thursday sales at its coffee shops in the Americas region grew more than expected  calming concerns about cooling growth and sending shares up 4.4 percent in after-hours trading.",
        "date": "04232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks quarterly cafe sales top expectations  shares rise "
    },
    {
        "content": "BEIJING  April 15 JD.com Inc  China's No. 2 e-commerce player  on Wednesday launched its JD Worldwide cross-border online shopping platform  a challenger to Alibaba Group Holding Ltd's Tmall Global service.",
        "date": "04152015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "China's JD.com sets up cross-border e-commerce platform in challenge to Alibaba "
    },
    {
        "content": "April 6 Starbucks Corp is expanding its employee college tuition assistance program to cover the entire cost of getting an online bachelor's degree  the chief executive of the coffee chain said on Monday.",
        "date": "04062015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks expands college tuition benefit for workers "
    },
    {
        "content": "LOS ANGELES  March 31 Starbucks Corp  and Danone SA on Tuesday will begin selling a smoothie line at more than 4 300 U.S. Starbucks shops as part of a Greek yogurt partnership that will also include yogurt parfaits and ready-to-eat yogurt to be sold by grocers.",
        "date": "03312015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks U.S. cafes debuting new smoothies  kale optional "
    },
    {
        "content": "Starbucks Corp  head Howard Schultz told employees on Sunday they will no longer be encouraged to write \"Race Together\" on drinks cups  but the company's effort to promote discussion of racial issues “is far from over”.",
        "date": "03222015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks ends 'Race Together' campaign in stores  effort not over "
    },
    {
        "content": "March 22 Starbucks Corp head Howard Schultz told employees on Sunday they will no longer be encouraged to write \"Race Together\" on drinks cups  but the company's effort to promote discussion of racial issues \"is far from over\".",
        "date": "03222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks ends \"Race Together\" campaign in stores  effort not over "
    },
    {
        "content": "SHANGHAI/SEATTLE Starbucks Corp  will partner Taiwanese drinks maker Tingyi Holding Corp  to produce and sell ready-to-drink (RTD) beverages in China  becoming the latest global firm to latch on to a local peer to expand in the tricky market.",
        "date": "03192015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks partners drinks maker Tingyi to expand in China "
    },
    {
        "content": "* Move could lower costs  spread footprint - analysts   (Recasts  adds joint statement  analyst comment  context)",
        "date": "03192015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks partners drinks maker Tingyi to expand in China "
    },
    {
        "content": "LOS ANGELES/SEATTLE Starbucks Corp Chief Executive Howard Schultz has deftly navigated thorny issues such as gay marriage  gun control and Congressional gridlock  but his move to weigh in on U.S. race relations has brewed up a social media backlash.",
        "date": "03182015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks brews backlash with debate on U.S. race relations "
    },
    {
        "content": "LOS ANGELES/SEATTLE  March 18 Starbucks Corp  Chief Executive Howard Schultz has deftly navigated thorny issues such as gay marriage  gun control and Congressional gridlock  but his move to weigh in on U.S. race relations has brewed up a social media backlash.",
        "date": "03182015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks brews backlash with debate on U.S. race relations "
    },
    {
        "content": "LOS ANGELES  March 18 Starbucks Corp Chief Executive Howard Schultz has deftly navigated thorny issues such as gay marriage  gun control and Congressional gridlock  but his move to weigh in on U.S. race relations has brewed up a social media backlash.",
        "date": "03182015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks brews up backlash with debate on U.S. race relations "
    },
    {
        "content": "March 18 Starbucks Corp will begin offering delivery in New York City and Seattle later this year  when it also plans to expand mobile order and pay services across the United States.",
        "date": "03182015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks to debut delivery in Manhattan  Seattle this year "
    },
    {
        "content": "March 18 Starbucks Corp will begin offering delivery in New York City and Seattle later this year  when it also plans to expand mobile order and pay services across the United States.",
        "date": "03182015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks to debut delivery in Manhattan  Seattle this year "
    },
    {
        "content": "SEATTLE Starbucks Corp  said on Wednesday it signed an agreement with Tingyi Holding Corp  for the Chinese food and drink maker to produce and expand the distribution of Starbucks ready-to-drink products in mainland China.",
        "date": "03182015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks says Tingyi to make Starbucks drink products in China "
    },
    {
        "content": "BOSTON  March 17 Health insurer Premera Blue Cross said on Tuesday it was a victim of a cyberattack that may have exposed medical data and financial information of 11 million customers  in the latest serious breach disclosed by a healthcare company.",
        "date": "03182015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 4-Premera Blue Cross breached  medical information exposed "
    },
    {
        "content": "MEXICO CITY  Feb 26 Mexico's Alsea  which operates PF Chang's  Starbucks  Burger King and other restaurants  on Thursday reported an 8 percent increase in fourth-quarter profit  helped by recent acquisitions.",
        "date": "02262015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Mexican restaurant operator Alsea reports higher 4th-qtr profit "
    },
    {
        "content": "Feb 19    - Starbucks Corp. says to open 50 new shops in Mexico",
        "date": "02192015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks to open 50 new stores in Mexico "
    },
    {
        "content": "Feb 4 Starbucks Corp said on Wednesday that its 12 123 U.S. shops would begin offering coconut milk on Feb. 17  as it seeks to keep pace with soaring demand for non-dairy and non-soy milk alternatives.",
        "date": "02042015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks' U.S. shops turn to coconuts as non-dairy demand soars "
    },
    {
        "content": "Feb 3 Delta Air Lines will serve Starbucks brand coffee on all of its flights  growing its existing partnership with the world's biggest coffee chain  the companies plan to announce on Wednesday.",
        "date": "02042015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Delta Air Lines expands partnership with Starbucks "
    },
    {
        "content": "* Dow down 0.5 pct  S&P 500 off 0.35 pct  Nasdaq up 0.2 pct   (Updates to afternoon trading)",
        "date": "01232015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall St dips on UPS  miners; Starbucks jumps "
    },
    {
        "content": "* Dow down 0.2 pct  S&P 500 off 0.1 pct  Nasdaq up 0.4 pct   (Updates to early afternoon)",
        "date": "01232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall St dips weighed by UPS  miners; Starbucks shines "
    },
    {
        "content": "* Dow  S&P 500 down 0.3 pct  Nasdaq up 0.1 pct   (Updates to market open)",
        "date": "01232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall St dips on earnings  but set to end week strong "
    },
    {
        "content": "* Futures down: Dow 7 pts  S&P 3 pts  Nasdaq 3 pts   (Updates with UPS outlook)",
        "date": "01232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Futures point to flat open on weak earnings "
    },
    {
        "content": "* Futures up: Dow 38 pts  S&P 4 pts  Nasdaq 5.75 pts   (Updates prices  adds McDonald's)",
        "date": "01232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Futures gain after rally  indexes set for strong week "
    },
    {
        "content": "Starbucks Corp  on Thursday said traffic to its Americas-region stores perked up during the holiday quarter  easing investor jitters about slower growth and boosting shares over 4 percent in after-hours trading.",
        "date": "01222015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks Americas traffic ticks up in holiday quarter  new COO named "
    },
    {
        "content": "NEW YORK  Jan 23 U.S. stock index futures edged up on Friday  following a sharp rally in the previous session that returned the S&P 500 and Nasdaq to positive territory for the year and put major indexes on track to break a three-week streak of declines.",
        "date": "01232015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Futures tick up after rally  indexes set for strong week "
    },
    {
        "content": "Jan 22 Starbucks Corp on Thursday said traffic to its Americas-region stores perked up during the holiday quarter  easing investor jitters about slower growth and boosting shares over 4 percent in after-hours trading.",
        "date": "01222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 3-Starbucks Americas traffic ticks up in holiday qtr  new COO named "
    },
    {
        "content": "* Director Kevin Johnson to become president and chief operating officer on march 1",
        "date": "01222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "BRIEF-Starbucks names Kevin Johnson COO "
    },
    {
        "content": "NEW YORK  Jan 22 Starbucks Corp has fixed the price it will pay for most of its coffee beans this year after going on a buying spree late last year when prices were under pressure  Chief Financial Officer Scott Maw said on Thursday.",
        "date": "01222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks price set for 94 pct of 2015 coffee supply -CFO "
    },
    {
        "content": "NEW YORK  Jan 22 The S&P 500 and Nasdaq turned positive for the year as U.S. stocks rallied on Thursday on the back of a larger than anticipated stimulus from the European Central Bank.",
        "date": "01222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "RPT-US STOCKS-Wall St gains as ECB prepares to flood markets "
    },
    {
        "content": "Jan 22 Starbucks Corp on Thursday said director Kevin Johnson would become its president and chief operating officer on March 1  replacing long-time executive Troy Alstead  who said he is taking an extended sabbatical to spend time with his family.",
        "date": "01222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks director Johnson to replace Alstead as president  COO "
    },
    {
        "content": "NEW YORK  Jan 22 Starbucks does not see any indication of a disruption in coffee supply  and has already fixed prices for 94 percent of its coffee for 2015  Chief Financial Officer Scott Maw told Reuters on Thursday after the release of the company's first quarter earnings.",
        "date": "01222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks sees no looming disruption in coffee supply -CFO "
    },
    {
        "content": "Jan 22 Starbucks Corp on Thursday said traffic to its Americas-region stores perked up during the holiday quarter  easing investor jitters about slower growth and boosting shares more than 3 percent in after-hours trading.",
        "date": "01222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "CORRECTED-UPDATE 1-Starbucks' Americas-region traffic ticks up during holiday quarter "
    },
    {
        "content": "* Indexes up: Dow 1.5 pct  S&P 500 1.5 pct  Nasdaq 1.8 pct   (Updates to late afternoon)",
        "date": "01222015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "US STOCKS-Wall St gains as ECB prepares to flood markets "
    },
    {
        "content": "LOS ANGELES  Jan 9 Starbucks Corp this week began selling its Tazo tea products exclusively in non-Starbucks retailers  a company spokeswoman said on Friday.",
        "date": "01092015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks moves Tazo tea out of its shops "
    },
    {
        "content": "LOS ANGELES Starbucks Corp on Thursday said Chief Operating Officer Troy Alstead  who as finance chief helped lead the coffee chain's extensive restructuring a few years ago  is taking an extended unpaid leave to spend more time with his family.",
        "date": "01092015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks' COO Alstead taking 'extended unpaid leave' "
    },
    {
        "content": "LOS ANGELES Starbucks Corp  on Thursday said Chief Operating Officer Troy Alstead  who as chief financial officer helped lead the coffee chain's massive and successful restructuring  is taking an extended unpaid leave from the coffee chain to spend more time with his family.",
        "date": "01082015",
        "name": "Starbucks Corporation",
        "news_type": "topStory",
        "symbol": "SBUX",
        "title": "Starbucks COO Alstead taking 'extended unpaid leave' "
    },
    {
        "content": "LOS ANGELES  Jan 8 Starbucks Corp on Thursday said Chief Operating Officer Troy Alstead  who as finance chief helped lead the coffee chain's extensive restructuring a few years ago  is taking an extended unpaid leave to spend more time with his family.",
        "date": "01092015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 3-Starbucks' COO Alstead taking 'extended unpaid leave' "
    },
    {
        "content": "LOS ANGELES  Jan 8 Starbucks Corp on Thursday said Chief Operating Officer Troy Alstead  who as chief financial officer helped lead the coffee chain's massive and successful restructuring  is taking an extended unpaid leave from the coffee chain to spend more time with his family.",
        "date": "01082015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "UPDATE 1-Starbucks COO Alstead taking 'extended unpaid leave' "
    },
    {
        "content": "LOS ANGELES  Jan 8 Starbucks Corp on Thursday said chief operating officer Troy Alstead  who also served for many years as the company's chief financial officer  is taking an extended unpaid leave from the coffee chain.",
        "date": "01082015",
        "name": "Starbucks Corporation",
        "news_type": "normal",
        "symbol": "SBUX",
        "title": "Starbucks says COO Alstead taking \"extended unpaid leave\" "
    }
]