[
    {
        "content": "LIMA Southern Copper Corp  said on Friday that its net profit doubled to $401.8 million in the third quarter from the same period a year earlier as sales surged on higher copper prices.",
        "date": "10202017",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper says third quarter profit doubled  expects Tia Maria permit "
    },
    {
        "content": "LIMA  Oct 20 Southern Copper Corp said on Friday that its net profit doubled to $401.8 million in the third quarter from the same period a year earlier as sales surged on higher copper prices.",
        "date": "10202017",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "UPDATE 1-Southern Copper says Q3 profit doubled  expects Tia Maria permit "
    },
    {
        "content": "LIMA  July 26 Southern Copper Corp said on Wednesday that its second-quarter net profit rose 35.1 percent from the same period a year earlier amid a double-digit surge in global copper prices.",
        "date": "07272017",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper second-quarter profit rises 35.1 pct yr/yr "
    },
    {
        "content": "LIMA Southern Copper Corp on Wednesday reported net income of $314.4 million for the first quarter  up 70 percent from $185.1 million a year earlier and 82 percent above the $172 million posted in the fourth quarter of 2016.",
        "date": "05032017",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper profit rises 70 percent on higher metals prices "
    },
    {
        "content": "LIMA  May 3 Southern Copper Corp on Wednesday reported net income of $314.4 million for the first quarter  up 70 percent from $185.1 million a year earlier and 82 percent above the $172 million posted in the fourth quarter of 2016.",
        "date": "05032017",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "UPDATE 1-Southern Copper profit rises 70 pct on higher metals prices "
    },
    {
        "content": "LIMA  May 3 Southern Copper Corp on Wednesday reported net income of $314.4 million for the first quarter of 2017  up 70 percent from $185.1 million a year earlier and 82 percent from $172 million in the fourth quarter of 2016.",
        "date": "05032017",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper profit rises 70 percent "
    },
    {
        "content": "LIMA Workers at mining company Southern Copper Corp in Peru have reached a deal with management to end a two-week strike  a union official and a company spokesman told Reuters on Monday.",
        "date": "04242017",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Peru's Southern Copper workers back at work after two-week strike "
    },
    {
        "content": "LIMA  April 24 Workers at mining company Southern Copper Corp in Peru have reached a deal with management to end a two-week strike  a union official and a company spokesman told Reuters on Monday.",
        "date": "04242017",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Peru's Southern Copper workers back at work after 2-week strike "
    },
    {
        "content": "    LIMA  April 15 Peru's copper production rose by 5.42 percent in February from the same month a year earlier  the slowest growth rate in two years as the Andean country wrestles with infrastructure damage caused by torrential rains  official data showed on Saturday.     The Ministry of Energy and Mines said in a statement that copper production totaled 178 283 tonnes in February.     Peru's entire mining sector  a key part of the economy  grew just 1.47 percent in February  compar",
        "date": "04152017",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Peru copper output up 5.42 pct in Feb. from year earlier "
    },
    {
        "content": "LIMA  April 10 Workers at Peru's Southern Copper started an indefinite strike on Monday  affecting up to 80 percent of the company's copper production capacity  union representative Jose Espejo said.",
        "date": "04102017",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Strike affects up to 80 pct of Southern Copper's output in Peru - union "
    },
    {
        "content": "    MELBOURNE  April 12 London copper eased on Wednesday amid heightening geopolitical tensions with North Korea  but held above two-week lows hit in the previous session on a healthy demand outlook.           FUNDAMENTALS     * LME COPPER: London Metal Exchange copper traded down 0.1 percent at $5 763 a tonne by 0200 GMT  after ending a tad firmer on Tuesday having previously slumped to $5 710 a tonne during the session  a two-week low.     * SHFE COPPER: Shanghai Futures Exchange c",
        "date": "04122017",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "METALS-London copper slips as North Korea tensions grow "
    },
    {
        "content": "LIMA  April 4 Southern Copper should share more of its profits with workers in Peru to avoid an indefinite strike at its Toquepala and Cuajone mines starting on April 10  a union leader said on Tuesday.",
        "date": "04042017",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Peru's Southern Copper workers demand profit share to avoid strike "
    },
    {
        "content": "SANTIAGO Southern Copper Corp hopes to dissuade workers at its Toquepala and Cuajone mines in Peru from striking this month  as a second labor union this year in the world's No.2 copper producer seeks a larger share of profits.",
        "date": "04042017",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper CEO hopes to prevent strike at Peru mines "
    },
    {
        "content": "SANTIAGO  April 3 Southern Copper Corp hopes to dissuade workers at its Toquepala and Cuajone mines in Peru from striking this month  as a second labor union this year in the world's second-biggest copper producer seeks a larger share of profits.",
        "date": "04042017",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "UPDATE 1-Southern Copper CEO hopes to prevent strike at Peru mines "
    },
    {
        "content": "LIMA  Jan 31 Southern Copper Corp on Tuesday reported a 183 percent year-on-year surge in its fourth-quarter net profit to $172 million as better metal prices and increased production from a recent mine expansion bolstered its sales.",
        "date": "02012017",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper reports 183 pct surge in Q4 net profit "
    },
    {
        "content": "LIMA  Oct 28 Chinese-owned miner MMG Ltd  is using an alternate route to move copper from its Las Bambas mine to port as a key road in Peru remained blocked by protests on Friday  the company said.",
        "date": "10282016",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Peru copper miner MMG bypassing protesters at Las Bambas to ship ore "
    },
    {
        "content": "LIMA Southern Copper Corp on Thursday reported a 100 percent year-on-year rise in its third quarter net profit to $197.6 million as sales rose and costs fell at its Buenavista mine in Mexico.",
        "date": "10272016",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper reports doubling of net income in third quarter year-on-year "
    },
    {
        "content": "LIMA  Oct 27 Southern Copper Corp on Thursday reported a 100 percent year-on-year rise in its third quarter net profit to $197.6 million as sales rose and costs fell at its Buenavista mine in Mexico.",
        "date": "10272016",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "UPDATE 1-Southern Copper reports doubling of net income in third quarter yr/yr "
    },
    {
        "content": "LIMA  Oct 27 Southern Copper Corp on Thursday reported a 100 percent year-on-year rise in its third quarter net profit to $197.6 million as sales rose and costs fell at its Buenavista mine in Mexico.",
        "date": "10272016",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper reports doubling of net income in third quarter yr/yr "
    },
    {
        "content": "LIMA  Oct 18 China National Petroleum Corporation Corp likely has 3-4 trillion cubic feet of proven natural gas reserves in an energy block it operates in southern Peru  Peru's president said Tuesday.",
        "date": "10182016",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "CNPC's natgas block in Peru likely has 3-4 TCF in reserves -govt "
    },
    {
        "content": "Aug 19 Brazil and Argentina have seized the emerging markets spotlight in recent months thanks to investor-friendly political upheavals  but much smaller Peru is quietly stealing the show.",
        "date": "08192016",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "RPT-Peru's stealth rally upstages emerging market rivals "
    },
    {
        "content": "LIMA Southern Copper Corp   said on Monday that its net profit fell 24.7 percent to $221.9 million  or $0.29 per share  in the second quarter from the same period a year earlier as copper prices continued to slump.",
        "date": "07252016",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper reports 24.7 percent fall in second-quarter profit versus year earlier "
    },
    {
        "content": "LIMA  July 25 Southern Copper Corp   said on Monday that its net profit fell 24.7 percent to $221.9 million  or $0.29 per share  in the second quarter from the same period a year earlier as copper prices continued to slump.",
        "date": "07252016",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper reports 24.7 pct fall in Q2 profit vs year earlier "
    },
    {
        "content": "LIMA  May 12 Index provider MSCI Inc on Thursday announced it will keep Southern Copper Corp   in its Peru group rather than moving it to its U.S. securities index  a move that will likely boost Lima's bourse.",
        "date": "05122016",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "UPDATE 2-MSCI keeps Southern Copper in Peru index  pleasing bourse "
    },
    {
        "content": "LIMA  May 12 Index provider MSCI Inc  said on Thursday that it decided not to move Southern Copper Corp to its U.S. securities index  keeping it instead in its Peru index in a move that will likely boost the Lima bourse.",
        "date": "05122016",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "MSCI says to keep Southern Copper in its Peru index "
    },
    {
        "content": "LIMA  April 28 Southern Copper Corp's  net profit dropped 34.5 percent to $185.1 million  or $0.24 per share  in the first quarter on slumping metal prices  the company said Thursday.",
        "date": "04282016",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper's net profit dropped 34.5 pct in first quarter "
    },
    {
        "content": "SANTIAGO  April 5 Southern Copper Corp  controlled by Grupo Mexico  expects to increase copper production by 22 percent in 2016 to 930 000 tonnes  Chief Executive Oscar Gonzalez told Reuters on Tuesday on the sidelines of the annual Cesco/CRU conference.   (Reporting by Anthony Esposito and Fabian Cambero; Editing by Jonathan Oatis)",
        "date": "04052016",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper sees 2016 copper output up 22 pct to 930 000 tonnes "
    },
    {
        "content": "LIMA A Peruvian prosecutor said she suspects that U.S.-listed mining company Southern Copper Corp paid opponents to call off protests against its $1.4 billion Tia Maria project while it was waiting for an environmental permit.",
        "date": "11202015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper may have paid bribes to halt Peru protests: prosecutor "
    },
    {
        "content": "LIMA  Nov 20 A Peruvian prosecutor said she suspects that U.S.-listed mining company Southern Copper Corp  paid opponents to call off protests against its $1.4 billion Tia Maria project while it was waiting for an environmental permit.",
        "date": "11202015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper may have paid bribes to halt Peru protests -prosecutor "
    },
    {
        "content": "LIMA  Oct 27 Global miner Southern Copper Corp  said on Tuesday its net profit tumbled 70 percent to $98.4 million in the third quarter after copper prices fell sharply.",
        "date": "10272015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "UPDATE 1-Southern Copper reports 70 pct drop in 3rd-qtr net profit "
    },
    {
        "content": "LIMA  Oct 27 Global miner Southern Copper Corp  said on Tuesday that its net profit was $98.4 million in the third quarter  about 70 percent less than in the same quarter a year ago.   (Reporting By Mitra Taj; Editing by Chizu Nomiyama)",
        "date": "10272015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper reports 70 pct drop in Q3 net profit "
    },
    {
        "content": "AREQUIPA  Peru  Sept 22 Southern Copper Corp  said on Tuesday that opposition to its Tia Maria project in southern Peru is easing thanks to a door-to-door campaign in communities where activists derailed the project with protests earlier this year.",
        "date": "09222015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper says it sees opposition to Peru project easing "
    },
    {
        "content": "LIMA  July 28 Southern Copper Corp said on Tuesday its net income  dropped 12.6 percent drop in the first half of the year due to the slump in global metal prices  but it said it was well-positioned to weather the \"temporary downturn\".",
        "date": "07282015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper profit drops in first half on copper price slump "
    },
    {
        "content": "LIMA  June 26 Southern Copper Corp  hopes to reach an agreement with angry neighbors of its planned $1.4 billion Tia Maria mine in Peru  and end deadly protests in time to begin construction of the project before the end of 2015  the company's chief executive said on Friday.",
        "date": "06262015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "UPDATE 1-Southern Copper hopes for Tia Maria permit by end 2015 "
    },
    {
        "content": "LIMA  June 26 Southern Copper Corp said that it expects to reach a deal this year with the local community over its $1.4 billion Tia Maria project in Peru and begin development of the mine later in 2015.",
        "date": "06262015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper expects to start development of Peru's Tia Maria in 2015 "
    },
    {
        "content": "LIMA  June 19 Peru's energy and mines minister said on Friday that Southern Copper Corp will likely extend its 60-day \"pause\" of its $1.4 billion Tia Maria project past mid-July in order to keep building local support.",
        "date": "06202015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "INTERVIEW-Southern Copper will likely have to extend pause on Peru project -gov't "
    },
    {
        "content": "LIMA  June 19 Peru's energy and mines minister said on Friday that Southern Copper Corp will likely extend its 60-day \"pause\" of its $1.4 billion Tia Maria project past mid-July because it needs to keep building local support.   (Reporting by Mitra Taj and Teresa Cespedes; Editing by Ken Wills)",
        "date": "06202015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper will likely have to extend pause on Peru project -gov't "
    },
    {
        "content": "LIMA  May 15 Southern Copper Corp   on Friday proposed a 60-day formal \"pause\" in its stalled $1.4 billion Tia Maria project in a bid to quell deadly protests against it.",
        "date": "05152015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "UPDATE 2-Southern Copper proposes 'pause' in Peru project to end unrest "
    },
    {
        "content": "LIMA  May 15 Southern Copper Corp   was preparing to announce a formal \"pause\" in its stalled $1.4 billion Tia Maria project in Peru amid deadly protests against it  two government sources and a company source said on Friday.   (Reporting By Teresa Cespedes and Marco Aquino)",
        "date": "05152015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper to announce \"pause\" in Peru project -sources "
    },
    {
        "content": "LIMA  May 14 Peru is investigating whether Southern Copper Corp knew about but failed to report an extortion attempt by an opponent of its stalled Tia Maria project  the mines minister said on Thursday.",
        "date": "05152015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Peru probes Southern Copper's knowledge of suspected extortion "
    },
    {
        "content": "LIMA  May 15 Southern Copper Corp   on Friday announced a 60-day formal \"pause\" in its stalled $1.4 billion Tia Maria project in a bid to quell deadly protests against it.",
        "date": "05162015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "UPDATE 3-Southern Copper announces 'pause' in Peru project to end unrest "
    },
    {
        "content": "LIMA  May 11 Peru's energy and mines minister said on Monday that she has halted talks with Southern Copper Corp over its stalled $1.4 billion Tia Maria project until the miner explains its role in possible \"wrongdoing.\"",
        "date": "05122015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "UPDATE 2-Peru says halts talks with Southern Copper over possible 'wrongdoing' "
    },
    {
        "content": "LIMA  May 11 Peru's energy and mines minister said on Monday that she has halted talks with Southern Copper Corp over its stalled $1.4 billion Tia Maria project until the miner explains its role in possible \"wrongdoing.\"",
        "date": "05112015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "UPDATE 1-Peru says halts talks with Southern Copper over possible 'wrongdoing' "
    },
    {
        "content": "LIMA  May 11 Peru's energy and mines minister said on Monday that she has halted talks with Southern Copper Corp over its stalled $1.4 billion Tia Maria project until the miner explains its role in possible \"wrongdoing.\"",
        "date": "05112015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Peru says halts talks with Southern Copper over possible 'wrongdoing' "
    },
    {
        "content": "* Minister expects to issue construction permit in 2 months   (Adds comment from company)",
        "date": "04242015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "UPDATE 3-Peru says it could ask for changes to Southern Copper project amid protests "
    },
    {
        "content": "AREQUIPA  PERU  April 22 Opponents of Southern Copper Corp's proposed $1.4 billion Tia Maria mine in Peru expanded their month-long protests against the project on Wednesday with rallies in several towns in the region.",
        "date": "04232015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Peruvian foes of Tia Maria copper mine expand month-long protest "
    },
    {
        "content": "LIMA  April 24 Southern Copper Corp   on Friday reported a 12.7 percent drop in first-quarter net income  citing costs of cleaning up a copper sulfate spill in Mexico.",
        "date": "04242015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "UPDATE 1-Southern Copper profit falls due to clean-up costs "
    },
    {
        "content": "LIMA  April 24 Southern Copper Corp   said on Friday that its net income fell 12.7 percent in the first quarter from the same period a year ago as it continued to pay for the clean-up of a copper sulfate spill in Mexico.",
        "date": "04242015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper says net income fell 12.7 pct in first quarter "
    },
    {
        "content": "LIMA  April 24 Peru's energy and mines minister said on Friday that the government could ask Southern Copper Corp to make additional changes to its $1.4 billion Tia Maria project after protests by farmers turned deadly this week.",
        "date": "04242015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Peru says it could ask for changes to Southern Copper project amid protests "
    },
    {
        "content": "* Southern copper sees new projects in Peru  Mexico almost doubling output to 1.15 million tonnes of copper in 2017 from 2014  Source text: [ID:http://www.bvl.com.pe/hhii/B60052/20150422101101/HI32EVENTO32RELEVANTE32GRUPO32M201XICO.PDF ] Further company coverage:    (Lima newsroom)",
        "date": "04222015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "BRIEF-Southern Copper sees production doubling in 2017 "
    },
    {
        "content": "NEW YORK  April 20 (IFR) - LatAm credit markets were off to a mixed start Monday  though the tone was supportive enough for Southern Copper Corporation to pull the trigger on a new 10s/30s bond sale.",
        "date": "04202015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "LatAm mixed as Southern Copper comes to market "
    },
    {
        "content": "LIMA  April 15 Peru approved Southern Copper Corp's planned $1.2 billion expansion of its Toquepala mine in southern Peru  putting it on track to double the operation's concentrating capacity  the company said on Wednesday.",
        "date": "04152015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Peru okays Southern Copper's $1.2 bln Toquepala mine expansion "
    },
    {
        "content": "SANTIAGO  April 14 Southern Copper Corp  expects to obtain a construction permit for its $1.4 billion Tia Maria copper project in Peru in the next few months  a senior executive said on Tuesday  playing down concerns that local opposition may disrupt its development.",
        "date": "04142015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "UPDATE 1-Southern Copper sees Tia Maria mine go-ahead despite protests "
    },
    {
        "content": "SANTIAGO  April 14 Southern Copper Corp  expects to get a construction permit for its Tia Maria copper project in Peru in the next few months  with production starting by the end of 2017 or start of 2018  a senior executive said on Tuesday.",
        "date": "04142015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper CEO expects to get Tia Maria permit in a few months "
    },
    {
        "content": "LIMA Conflicting statements about whether Southern Copper Corp would cancel development of its $1.4 billion Tia Maria copper mine in Peru's Arequipa region have battered the company's share price and left investors wondering about the project's future.",
        "date": "03272015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper hit by conflicting remarks on Peru mine's future "
    },
    {
        "content": "* Southern Copper CEO  Grupo Mexico say Tia Maria going ahead",
        "date": "03272015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "UPDATE 3-Southern Copper hit by conflicting remarks on Peru mine's future "
    },
    {
        "content": "LIMA  March 27 Southern Copper \"will continue making efforts to move forward\" with its Tia Maria project in Peru  the chief executive of the mining firm told Reuters  just hours after a company spokesman said the project was being shelved.",
        "date": "03272015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper still moving forward with Tia Maria Peru project - CEO "
    },
    {
        "content": "LIMA  March 27 Peru's Mining and Energy Minister Rosa Maria Ortiz said on Friday Southern Copper's announcement to cancel its Tia Maria project had taken the government by surprise and that the company was expected to reverse its decision.",
        "date": "03272015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Peru says expects Southern Copper to reverse Tia Maria cancellation "
    },
    {
        "content": "LIMA  March 27 Southern Copper Corp has canceled its $1.4 billion Tia Maria project amid protests in Peru  Julio Morriberon  the company's head of institutional relations in the South American nation told local radio RPP on Friday.",
        "date": "03272015",
        "name": "Southern Copper Corporation",
        "news_type": "normal",
        "symbol": "SCCO",
        "title": "Southern Copper says cancels $1.4 bln Tia Maria project in Peru "
    },
    {
        "content": "LIMA  Feb 4 Southern Copper Corp   said on Wednesday that quarterly net income fell 14.3 percent as sales slipped on lower metal prices.",
        "date": "02042015",
        "name": "Southern Copper Corporation",
        "news_type": "topStory",
        "symbol": "SCCO",
        "title": "Southern Copper net profit falls 14 pct in fourth quarter "
    }
]