[
    {
        "content": "CALGARY  Alberta Canada's Enbridge Inc said on Wednesday it would cut about 1 000 positions  or 6 percent of its work force  after buying Spectra Energy Corp of Houston  the first layoffs for the combined energy infrastructure company  the biggest in North America.",
        "date": "03222017",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "Canada's Enbridge to cut 1 000 jobs after buying Spectra "
    },
    {
        "content": "CALGARY  Alberta  March 22 Canada's Enbridge Inc  said on Wednesday it would cut about 1 000 positions  or 6 percent of its work force  after buying Spectra Energy Corp  of Houston  the first layoffs for the combined energy infrastructure company  the biggest in North America.",
        "date": "03222017",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "UPDATE 2-Canada's Enbridge to cut 1 000 jobs after buying Spectra "
    },
    {
        "content": "* Enbridge and Spectra Energy complete merger  Source text for Eikon:  Further company coverage:",
        "date": "02272017",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Enbridge and Spectra Energy report completion of merger "
    },
    {
        "content": "* S&P Dow Jones Indices - Incyte will replace Spectra Energy in the S&P 500 effective at the open of trading on February 28",
        "date": "02232017",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Incyte to replace Spectra Energy in S&P 500 "
    },
    {
        "content": "* Spectra Energy to be removed from the Alerian Energy Infrastructure Index  Source text for Eikon:  Further company coverage:",
        "date": "02232017",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "BRIEF-Alerian says Spectra Energy to be removed from the Alerian Energy Infrastructure Index "
    },
    {
        "content": "* Enbridge and Spectra Energy merger expected to close February 27  2017  Source text for Eikon:  Further company coverage:",
        "date": "02232017",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "BRIEF-Enbridge  Spectra Energy merger expected to close February 27  2017 "
    },
    {
        "content": "* Spectra Energy reports fourth quarter and year-end 2016 results",
        "date": "02172017",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy Corp reports Q4 EPS of $0.16 "
    },
    {
        "content": "* Enbridge and Spectra Energy obtain FTC clearance for their proposed combination",
        "date": "02162017",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Enbridge and Spectra Energy obtain FTC clearance for their proposed combination "
    },
    {
        "content": "Energy infrastructure firms Enbridge Inc  and Spectra Energy Corp have agreed to settle charges their merger would hurt competition in the market for gas pipeline transportation in three areas off the Louisiana coast  the Federal Trade Commission said on Thursday.",
        "date": "02162017",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "Enbridge  Spectra Energy to settle charges merger would harm competition - FTC "
    },
    {
        "content": "WASHINGTON  Feb 16 Energy infrastructure firms Enbridge Inc and Spectra Energy Corp have agreed to settle charges their merger would hurt competition in the market for gas pipeline transportation in three areas off the Louisiana coast  the Federal Trade Commission said on Thursday.",
        "date": "02162017",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "Enbridge  Spectra Energy to settle charges merger would harm competition -FTC "
    },
    {
        "content": "* Spectra energy partners lp says its general partner declared a quarterly cash distribution to unitholders of $0.68875 per unit",
        "date": "02072017",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy declares qtrly cash distribution hike "
    },
    {
        "content": "* Q3 earnings per share view $0.26 -- Thomson Reuters I/B/E/S",
        "date": "11022016",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy reports Q3 earnings per share $0.28 "
    },
    {
        "content": "* Says has assessed valve on Express pipeline to ensure it was not damaged  now taking steps to restart the line  Source text for Eikon:  Further company coverage:    (Reporting By Nia Williams)",
        "date": "10112016",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy says now taking steps to restart Express pipeline "
    },
    {
        "content": "* Spectra Energy Corp says outstanding borrowings under credit agreement mature on September 28  2017",
        "date": "10042016",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy unit enters into a $2.0 bln revolving credit agreement "
    },
    {
        "content": "* Enbridge Energy Partners L.P. 'BBB' ccr affirmed following parent's acquisition of Spectra Energy Corp.; outlook stable  Source text for Eikon:",
        "date": "09062016",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-S&P- Enbridge Energy Partners 'BBB' CCR affirmed post Spectra acquisition "
    },
    {
        "content": "* Enbridge Inc.  Enbridge Pipelines Inc. ratings affirmed at 'BBB+' on announced merger with Spectra Energy Corp.  Source text (http://bit.ly/2bRt0sK) Further company coverage:",
        "date": "09062016",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "BRIEF-S&P affirms Enbridge Inc.  Enbridge Pipelines Inc. ratings at 'BBB+' on announced merger with Spectra Energy Corp "
    },
    {
        "content": "* Moody's affirms Spectra Energy ratings  stable outlook  Source text for Eikon:  Further company coverage: ",
        "date": "09062016",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "BRIEF-Moody's affirms Spectra Energy ratings  stable outlook "
    },
    {
        "content": "* Enbridge and Spectra energy to combine to create North America's premier energy infrastructure company with C$165 billion enterprise value",
        "date": "09062016",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "BRIEF-Enbridge to buy Spectra in a deal valued at about C$37 billion "
    },
    {
        "content": "Sept 6 Enbridge Inc  Canada's largest pipeline company  said  on Tuesday it would buy Spectra Energy Corp in an all-stock deal valued at about C$37 billion ($28 billion) to create the largest North American energy infrastructure company.",
        "date": "09062016",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "Enbridge to buy Spectra Energy in C$37 bln deal "
    },
    {
        "content": "* Quarterly net income from controlling interests was $149 million  or $0.21 diluted earnings per share",
        "date": "08032016",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy reports Q2 EPS $0.21 from controlling interests "
    },
    {
        "content": "* Declared a quarterly cash dividend on its common stock of $0.405 per share  Source text for Eikon:  Further company coverage:    )",
        "date": "07052016",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy announces quarterly dividend of $0.405 per share "
    },
    {
        "content": "* Spectra Energy awarded $1.5 billion Nueces-To-Brownsville pipeline project to meet critical need for natural gas in Mexico",
        "date": "06132016",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy awarded $1.5 bln Nueces-to-Brownsville pipeline project "
    },
    {
        "content": "* Q1 earnings per share view $0.38 -- Thomson Reuters I/B/E/S",
        "date": "05042016",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy Q1 EPS $0.35 from continuing operations "
    },
    {
        "content": "* On April 29  Spectra Energy Corp LLC entered into amendment no. 2 to its $1 billion amended and restated revolving credit agreement",
        "date": "05022016",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy Corp unit amends $1 bln revolving credit agreement "
    },
    {
        "content": "* Commencement of an underwritten public offering of 14 million shares of its common stock",
        "date": "04042016",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy announces public offering of common stock "
    },
    {
        "content": "* Spectra energy to sell empress ngl business to plains midstream canada",
        "date": "04042016",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "BRIEF-Spectra Energy to sell Empress NGL business "
    },
    {
        "content": "HOUSTON Spectra Energy Corp  shut its Platte Pipeline that carries crude oil from Guernsey  Wyoming  to Wood River  Illinois  as a precaution due to flooding on the Mississippi River  the company said.",
        "date": "12312015",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "Spectra shuts Wyoming to Illinois crude pipeline due to flooding "
    },
    {
        "content": "Spectra Energy Corp   an oil and natural gas pipeline company  is bidding for the whole of Williams Companies Inc   even though its market capitalization is about half that of Williams  people familiar with the matter said.",
        "date": "08142015",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "Exclusive: Spectra bidding for the entirety of Williams Cos - sources  "
    },
    {
        "content": "CALGARY  July 14 Canada's national energy regulator has ordered Spectra Energy Corp to correct a series of \"management system failures\" following more than two dozen safety and security incidents at its Canadian plants and facilities since 2014.",
        "date": "07142015",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "Canada regulator orders Spectra Energy to clean up practices "
    },
    {
        "content": "CALGARY  Alberta  July 9 Spectra Energy Corp's  280 000-barrel-per-day Express pipeline cannot pull crude oil from Gibson Energy Inc's Hardisty  Alberta terminal  where a booster pump is being repaired  a spokesman for Spectra said on Thursday.",
        "date": "07092015",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "Spectra Express pipeline volumes dip on Gibson terminal repair work "
    },
    {
        "content": "CALGARY  Alberta  April 29 Pipeline company Spectra Energy Corp is cutting 170 jobs as it consolidates positions at its Calgary and Vancouver offices in western Canada  the company said on Wednesday.",
        "date": "04292015",
        "name": "Sea Limited",
        "news_type": "topStory",
        "symbol": "SE",
        "title": "UPDATE 1-Spectra Energy says cutting 170 jobs in western Canada "
    },
    {
        "content": "CALGARY  Alberta  April 29 Pipeline and midstream company Spectra Energy told employees on Wednesday it is cutting around 170 jobs in western Canada  two market sources said.",
        "date": "04292015",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "Spectra Energy cutting around 170 jobs in western Canada - sources "
    },
    {
        "content": "Thomson Reuters April 28  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04282015",
        "name": "Sea Limited",
        "news_type": "normal",
        "symbol": "SE",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    }
]