[
    {
        "content": "* SEATTLE GENETICS ANNOUNCES FDA APPROVAL OF ADCETRIS® (BRENTUXIMAB VEDOTIN) FOR PRIMARY CUTANEOUS ANAPLASTIC LARGE CELL LYMPHOMA (PCALCL) AND CD30-EXPRESSING MYCOSIS FUNGOIDES (MF)",
        "date": "11092017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-SEATTLE GENETICS ANNOUNCES FDA APPROVAL OF ADCETRIS (BRENTUXIMAB VEDOTIN) "
    },
    {
        "content": "* Seattle Genetics and Astellas initiate phase 1B trial of Enfortumab Vedotin in combination with immune checkpoint inhibitor therapies in locally advanced or metastatic urothelial cancer",
        "date": "11082017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics  Astellas initiate phase 1b trial for Enfortumab Vedotin "
    },
    {
        "content": "* Seattle genetics submits supplemental biologics license application to FDA for Adcetris (brentuximab vedotin) in frontline advanced hodgkin lymphoma Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "11022017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics submits supplemental license application for Adcetris "
    },
    {
        "content": "* Seattle Genetics reports third quarter 2017 financial results",
        "date": "10262017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics reports Q3 earnings $0.34/shr "
    },
    {
        "content": "* Says ‍announces additional clinical collaborations to evaluate SGN-LIV1A in triple negative breast cancer​",
        "date": "10112017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics ‍announces additional clinical collaborations to evaluate SGN-LIV1A in triple negative breast cancer​ "
    },
    {
        "content": "* Astellas and Seattle Genetics initiate pivotal trial of Enfortumab Vedotin for patients with locally advanced or metastatic urothelial cancer",
        "date": "10102017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Astellas and Seattle Genetics initiate trial of enfortumab vedotin for ureter cancer patients "
    },
    {
        "content": "* Seattle Genetics and Astellas initiate pivotal trial of enfortumab vedotin for patients with locally advanced or metastatic urothelial cancer",
        "date": "10102017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics and Astellas initiate pivotal trial of enfortumab vedotin "
    },
    {
        "content": "* Genmab and Seattle Genetics to initiate new study of novel antibody-drug conjugate tisotumab vedotin in cervical cancer",
        "date": "10102017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "BRIEF-Genmab and Seattle Genetics to start Phase II study of tisotumab vedotin "
    },
    {
        "content": "* GENMAB AND SEATTLE GENETICS TO INITIATE NEW STUDY OF NOVEL ANTIBODY-DRUG CONJUGATE TISOTUMAB VEDOTIN IN CERVICAL CANCER",
        "date": "10102017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "BRIEF-Genmab and Seattle Genetics to start study of Tisotumab Vedotin in cervical cancer "
    },
    {
        "content": "* Seattle Genetics receives FDA breakthrough therapy designation for adcetris® (brentuximab vedotin) in frontline advanced hodgkin lymphoma",
        "date": "10022017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "CORRECTED-BRIEF-Seattle Genetics receives FDA breakthrough therapy designation for lymphoma drug "
    },
    {
        "content": "* GENMAB AND SEATTLE GENETICS TO CO-DEVELOP TISOTUMAB VEDOTIN FOR SOLID TUMORS",
        "date": "08292017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Genmab and Seattle Genetics to co-develop Tisotumab Vedotin for solid tumors "
    },
    {
        "content": "* FDA accepts supplemental biologics license application and grants priority review for adcetris® (brentuximab vedotin) in cutaneous t-cell lymphoma",
        "date": "08162017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-FDA accepts supplemental biologics license application and grants priority review for adcetris in cutaneous t-cell lymphoma "
    },
    {
        "content": "* Seattle Genetics announces purchase of Bothell manufacturing facility from Bristol-Myers Squibb",
        "date": "08012017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics to buy Bothell plant from Bristol-Myers Squibb "
    },
    {
        "content": "* Seattle Genetics reports second quarter 2017 financial results",
        "date": "07272017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics Q2 loss per share $0.39 "
    },
    {
        "content": "* Seattle Genetics Inc says Health Canada has issued a non-conditional marketing authorization for use ofadcetris",
        "date": "07252017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics Inc says Health Canada has issued a non-conditional marketing authorization for use ofadcetris "
    },
    {
        "content": "* Seattle Genetics announces clinical collaboration to expand the therapeutic evaluation of sgn-liv1a in triple negative breast cancer",
        "date": "07242017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics announces clinical collaboration to expand the therapeutic evaluation of sgn-liv1a "
    },
    {
        "content": "* Seattle genetics inc reports a 8.2 percent stake in immunomedics inc as of June 29  2017 - sec filing",
        "date": "07072017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics reports 8.2 percent stake in Immunomedics as of June 29  2017 "
    },
    {
        "content": "June 19 U.S. drug developer Seattle Genetics Inc said on Monday it would discontinue a late-stage study of its drug to treat older patients with acute myeloid leukemia due to safety concerns.",
        "date": "06192017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "Seattle Genetics to halt late-stage study of leukemia drug "
    },
    {
        "content": "* Seattle Genetics Inc - fda notified co on June 21  IND for vadastuximab talirine has been placed on hold - SEC filing",
        "date": "06222017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-FDA notifies Seattle Genetics that IND for vadastuximab talirine placed on hold "
    },
    {
        "content": "* Seattle Genetics submits supplemental biologics license application to FDA for Adcetris® (brentuximab vedotin) in cutaneous t-cell lymphoma",
        "date": "06202017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics submits supplemental biologics license application to fda for Adcetris "
    },
    {
        "content": "* Seattle Genetics discontinues Phase 3 cascade trial of vadastuximab talirine (SGN-CD33A) in frontline acute myeloid leukemia",
        "date": "06192017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics discontinues Phase 3 trial of vadastuximab talirine "
    },
    {
        "content": "Seattle Genetics Inc's lymphoma drug met the main goal in a late stage study  but shares of the company tumbled as the data fell short of investor expectations on the treatment's advantages over standard of care.",
        "date": "06262017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "Seattle Genetics slumps as cancer drug data fails to impress "
    },
    {
        "content": "* Investors focus on narrow drug benefits vs standard of care",
        "date": "06262017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "UPDATE 2-Seattle Genetics slumps as cancer drug data fails to impress "
    },
    {
        "content": "June 26 Seattle Genetics Inc and Japan's Takeda Pharmaceutical Co Ltd said on Monday that their drug met the main goal in a late-stage study of helping blood cancer patients live longer without their condition worsening.",
        "date": "06262017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "CORRECTED-UPDATE 1-Seattle Genetics  Takeda lymphoma drug success fails to impress investors "
    },
    {
        "content": "* Seattle Genetics and Bristol-Myers Squibb highlight interim phase 1/2 data evaluating combination of adcetris® (brentuximab vedotin) and opdivo® (nivolumab) in relapsed hodgkin lymphoma at the international conference on malignant lymphoma",
        "date": "06152017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics  Bristol-Myers Squibb highlight interim phase 1/2 data "
    },
    {
        "content": " (The story corrects the last paragraph in the June 19 story to say Adcetris generated $266 million in sales last year  not $71 million)",
        "date": "06262017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "Seattle Genetics halts late-stage study of leukemia drug (June 19) "
    },
    {
        "content": "June 19 Seattle Genetics Inc said it would halt a late-stage study of its drug to treat a type of leukemia in older patients following a \"higher rate\" of deaths in patients on the drug compared with those on a placebo.",
        "date": "06262017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "CORRECTED-UPDATE 3-Seattle Genetics halts late-stage study of leukemia drug (June 19) "
    },
    {
        "content": "June 26 Seattle Genetics Inc and Japan's Takeda Pharmaceutical Co Ltd said on Monday that their drug met the main goal in a late-stage study of helping blood cancer patients live longer without their condition worsening.",
        "date": "06262017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "CORRECTED-Seattle Genetics  Takeda lymphoma drug succeeds late-stage trial "
    },
    {
        "content": "* Takeda and Seattle Genetics announce positive results from phase 3 ECHELON-1 clinical trial evaluating Adcetris in frontline advanced hodgkin lymphoma",
        "date": "06262017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "BRIEF-Takeda and Seattle Genetics announce positive results from phase 3 ECHELON-1 clinical trial "
    },
    {
        "content": "* Takeda and Seattle Genetics announce Lancet publication of phase 3 alcanza clinical trial data of adcetris (brentuximab vedotin) for CD30-positive cutaneous t-cell lymphoma",
        "date": "06072017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Takeda  Seattle Genetics announce Lancet publication "
    },
    {
        "content": "* Trial evaluating enfortumab vedotin in combination with CPIs is also planned for later in the year​",
        "date": "06052017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics  Astellas announce updated enfortumab vedotin phase 1 data in metastatic urothelial cancer ​ "
    },
    {
        "content": "* Bristol-Myers Squibb and Seattle Genetics expand clinical collaboration to evaluate combination of opdivo (nivolumab) and adcetris® (brentuximab vedotin) in pivotal phase 3 clinical trial in relapsed hodgkin lymphoma",
        "date": "06022017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Bristol-Myers Squibb and Seattle Genetics expand collaboration to evaluate combination of opdivo and adcetris "
    },
    {
        "content": "* Seattle genetics reports first quarter 2017 financial results",
        "date": "04272017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics Q1 loss per share $0.42 "
    },
    {
        "content": "* Seattle Genetics Inc - CEO Clay B. Siegall's 2016 total compensation $9.6 million versus $6.9 million in 2015 - SEC Filing Source text: [http://bit.ly/2nLu7vX] Further company coverage:",
        "date": "04052017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics' CEO Clay Siegall's 2016 total compensation $9.6 mln - SEC Filing "
    },
    {
        "content": "* Seattle Genetics presents data advancing antibody-drug conjugate and novel immuno-oncology programs at the American Association For Cancer Research (AACR) annual meeting Source text for Eikon: Further company coverage:",
        "date": "04032017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics presents data advancing antibody-drug conjugate at AACR annual meeting "
    },
    {
        "content": "Seattle Genetics Inc said on Monday the U.S. Food and Drug Administration lifted a clinical hold on several early stage studies testing its experimental cancer drug.",
        "date": "03062017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "Seattle Genetics to resume trials as FDA lifts clinical hold "
    },
    {
        "content": "March 6 Seattle Genetics Inc said on Monday the U.S. Food and Drug Administration lifted a clinical hold on several early stage studies testing its experimental cancer drug.",
        "date": "03062017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "UPDATE 1-Seattle Genetics to resume trials as FDA lifts clinical hold "
    },
    {
        "content": "March 6 Seattle Genetics Inc said on Monday the U.S. Food and Drug Administration had lifted the clinical hold on several early stage studies testing its experimental cancer drug.",
        "date": "03062017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "FDA lifts hold on Seattle Genetics drug trials "
    },
    {
        "content": "* FDA lifts clinical hold on seattle genetics' phase 1 trials of vadastuximab talirine",
        "date": "03062017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "BRIEF-FDA lifts hold on Seattle Genetics' phase 1 trials of vadastuximab talirine "
    },
    {
        "content": "* Seattle Genetics reports fourth quarter and year 2016 financial results",
        "date": "02092017",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics Q4 loss per share $0.39 "
    },
    {
        "content": "Feb 10 Immunomedics Inc said it entered into a licensing deal for its cancer treatment with Seattle Genetics Inc for a potential payment of up to about $2 billion.",
        "date": "02102017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "Immunomedics in $2 bln licensing deal with Seattle Genetics "
    },
    {
        "content": "* Seattle Genetics' stock down 4 pct   (Adds details from conf call  recasts; updates shares)",
        "date": "02102017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "UPDATE 3-Immunomedics in $2 bln licensing deal with Seattle Genetics "
    },
    {
        "content": "* Annual meeting has been postponed to march 3  2017 at 10:00 a.m. Eastern time",
        "date": "02102017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "BRIEF-Immunomedics announces postponement of 2016 annual meeting "
    },
    {
        "content": "* Immunomedics enters into exclusive global licensing agreement with Seattle Genetics for Sacituzumab Govitecan (IMMU-132) with potential payments of up to approximately $2 billion  plus royalties",
        "date": "02102017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "BRIEF-Immunomedics enters licensing agreement with Seattle Genetics "
    },
    {
        "content": "* Seattle Genetics announces global license agreement with immunomedics for sacituzumab govitecan (immu-132)  a promising late-stage adc for solid tumors",
        "date": "02102017",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics in licensing deal with Immunomedics "
    },
    {
        "content": "Seattle Genetics Inc said four people had died in trials testing its experimental cancer drug  prompting the U.S. Food and Drug Administration to impose a clinical hold on several early-stage studies.",
        "date": "12272016",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "FDA places some Seattle Genetics drug trials on hold after four deaths "
    },
    {
        "content": "* Seattle Genetics intend to submit a supplemental biologics license application to FDA in first half of 2017 for Adcetris",
        "date": "11102016",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics receives FDA breakthrough therapy designation for Adcetris "
    },
    {
        "content": "* Seattle Genetics and Agensys  an affiliate of Astellas  highlight promising enfortumab vedotin (ASG-22ME) and ASG-15ME phase 1 data in metastatic urothelial cancer at 2016 ESMO congress  Source text for Eikon:  Further company coverage:",
        "date": "10072016",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics  Agensys highlights promising Enfortumab Vedotin  ASG-15ME phase 1 data in metastatic urothelial cancer at 2016 ESMO congress "
    },
    {
        "content": "* CD123A for patients with relapsed or refractory acute myeloid leukemia  Source text for Eikon:  Further company coverage:",
        "date": "09192016",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics starts phase 1 trial of SGN-CD123A for patients with relapsed leukemia "
    },
    {
        "content": "Aug 22 Pfizer Inc  beating out numerous other bidders  said it agreed to buy U.S. cancer drug company Medivation Inc for $14 billion in cash  adding its blockbuster prostate cancer drug Xtandi to the company's growing oncology roster.",
        "date": "08222016",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "UPDATE 5-Pfizer boosts cancer drug roster with $14 bln Medivation deal "
    },
    {
        "content": "* Takeda and Seattle Genetics announce positive data from phase 3 Alcanza clinical trial of ADCETRIS\u007f (Brentuximab Vedotin) for CD30-expressing cutaneous T-Cell Lymphoma",
        "date": "08012016",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics-randomized phase 3 clinical trial with ADCETRIS meets primary endpoint "
    },
    {
        "content": "* Sees intiating  phase 2 trial of denintuzumab mafodotin (SGN-CD19a; 19A) in frontline diffuse large B-cell lymphoma during 2016.",
        "date": "07262016",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics reports Q2 financial results "
    },
    {
        "content": "July 19 Some of the world's largest drug companies are taking out their checkbooks for acquisitions of smaller peers whose cancer drugs have the potential to cure not just patients  but corporate growth prospects as well.",
        "date": "07192016",
        "name": "Seattle Genetics Inc",
        "news_type": "normal",
        "symbol": "SGEN",
        "title": "DEALTALK-Old pharma sees new profit cure in cancer drugs "
    },
    {
        "content": "June 6 Astellas Pharma Inc and Seattle Genetics Inc :",
        "date": "06062016",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Astellas  Seattle Genetics present clinical data in metastatic urothelial cancer "
    },
    {
        "content": "* Q1 earnings per share view $-0.09 -- Thomson Reuters I/B/E/S",
        "date": "04282016",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics Q1 loss per share $0.15 "
    },
    {
        "content": "* CEO Clay B. Siegall 2015 total compensation of $6.87 million versus $6.86 million in 2014 - SEC Filing  Source text for Eikon: (http://1.usa.gov/1XhKT0X) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04062016",
        "name": "Seattle Genetics Inc",
        "news_type": "topStory",
        "symbol": "SGEN",
        "title": "BRIEF-Seattle Genetics CEO's 2015 total compensation was $6.87 mln vs $6.86 mln in 2014 - SEC Filing "
    }
]