[
    {
        "content": "* UPS and Shopify Inc announce a platform integration that make UPS's premium services available to small businesses​ Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "BRIEF-UPS and Shopify Inc announce platform integration "
    },
    {
        "content": "TORONTO  Oct 30 Retail software company Shopify Inc may not be willing to release as many operational details as some investors are hoping for in response to a short seller's criticism  a shareholder and several analysts said.",
        "date": "10302017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "Investors hope for details in Shopify's response to short seller "
    },
    {
        "content": "TORONTO  Oct 31 Canada's main stock index reached a record close for the third-straight session on Tuesday as a rally in energy stocks and firmer financial issues helped offset Shopify Inc's steep decline and broad losses among mining firms.",
        "date": "10312017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "CANADA STOCKS-TSX hits record as energy stocks rally on oil prices "
    },
    {
        "content": "TORONTO Shares in Canadian e-commerce company Shopify Inc   dropped on Tuesday despite its better-than-expected earnings  with concerns about future growth and lack of fresh disclosures rattling investors after a recent short-seller attack.",
        "date": "10312017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "Shopify's earnings beat fails to reassure investors  shares drop "
    },
    {
        "content": "TORONTO  Oct 31 Shares in Canadian e-commerce company Shopify Inc  dropped on Tuesday despite its better-than-expected earnings  with concerns about future growth and lack of fresh disclosures rattling investors after a recent short-seller attack.",
        "date": "10312017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "UPDATE 3-Shopify's earnings beat fails to reassure investors  shares drop "
    },
    {
        "content": "* Citron says unimpressed by Shopify's response to Citron's conclusion that company sells business opportunities through affiliate marketers",
        "date": "10312017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "BRIEF-Short seller Citron comments on Shopify conference call "
    },
    {
        "content": "TORONTO  Oct 31 Canada's main stock index touched a third-straight record on Tuesday as gains in financials and drugmaker Valeant offset a sharp loss by Shopify Inc and a retreat by a slew of resource issues.",
        "date": "10312017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "CANADA STOCKS-TSX touches fresh record  Shopify tumbles "
    },
    {
        "content": "TORONTO  Oct 31 Canada's main stock index rose on Tuesday as financial stocks kept the index in positive territory despite a hefty decline in Shopify Inc shares and weaker resource stocks.",
        "date": "10312017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "CANADA STOCKS-TSX higher shortly after open; Shopify falls sharply "
    },
    {
        "content": "TORONTO  Oct 31 Shopify Inc posted a 72 percent increase in third-quarter revenue as the fast-growing Canadian retail software company reported an adjusted profit for the first time as a public company and increased its fourth quarter forecasts.",
        "date": "10312017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "Shopify posts strong revenue growth  adjusted profit "
    },
    {
        "content": "* Total revenue in Q3 was $171.5 million  a 72% increase from comparable quarter in 2016​",
        "date": "10312017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "BRIEF-Shopify says ‍net loss for Q3 was $0.09 per share​ "
    },
    {
        "content": "* Shopify to triple waterloo workforce  deepening investment in Canada’s thriving tech community",
        "date": "10192017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "BRIEF-Shopify to triple waterloo workforce  deepening investment in Canada’s thriving tech community "
    },
    {
        "content": "* Shopify Inc - ‍co and DHL announced a new partnership to help small businesses \"access global markets\"​",
        "date": "10182017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "BRIEF-Shopify and DHL Express partner to empower small businesses to go global​ "
    },
    {
        "content": "TORONTO Short-seller Andrew Left of Citron Research said on Wednesday  he was investigating various aspects of software company Shopify Inc's business and would \"most likely\" publish a follow-up to an Oct. 4 report that sent its shares plunging.",
        "date": "10112017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "Citron's Left says follow-up report on Shopify likely "
    },
    {
        "content": "TORONTO  Oct 11 Short-seller Andrew Left of Citron Research said on Wednesday  he was investigating various aspects of software company Shopify Inc's business and would \"most likely\" publish a follow-up to an Oct. 4 report that sent its shares plunging.",
        "date": "10112017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "UPDATE 2-Citron's Left says follow-up report on Shopify likely "
    },
    {
        "content": "TORONTO  Oct 4 Canada's benchmark stock index dipped on Wednesday  breaking a five-session stretch of gains  pressured by a sharp fall in shares of online retail platform Shopify Inc and losses in the energy sector as oil fell.",
        "date": "10042017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "CANADA STOCKS-TSX win streak ends as Shopify  energy weigh "
    },
    {
        "content": "TORONTO Shopify Inc   defended its business model on Thursday  a day after short-seller Citron Research criticized the internet-commerce software provider's marketing practices  wiping about $1.5 billion off its market value.",
        "date": "10052017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "Shopify defends itself after Citron criticism "
    },
    {
        "content": "TORONTO Shopify Inc   shares fell by over 11 percent on Wednesday after short-seller Citron Research said the Canadian provider of online retailing software was overvalued  according to traders and analysts.",
        "date": "10042017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "Canada's Shopify slides after Citron criticism "
    },
    {
        "content": "TORONTO  Oct 5 Canada's main stock index advanced on Thursday  fueled by a rally in mining and energy stocks as commodity prices rose  but gains were tempered by a sharp fall in shares of Shopify Inc for a second straight day.",
        "date": "10052017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "CANADA STOCKS-TSX rides resource rally; Shopify extends losses "
    },
    {
        "content": "TORONTO  Oct 5 Canada's main stock index rose on Thursday as mining shares drove broad gains  while Shopify Inc extended its previous session's losses.",
        "date": "10052017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "CANADA STOCKS-TSX rises at open as resources lead  Shopify extends slide "
    },
    {
        "content": "TORONTO  Oct 4 Canada's main stock index edged lower on Wednesday  breaking a five-day winning streak  pressured by a sharp fall in online retail platform Shopify Inc and a decline in energy shares as oil lost ground.",
        "date": "10042017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "CANADA STOCKS-TSX ends winning run as Shopify tumbles "
    },
    {
        "content": "Canada's Shopify Inc    reported better-than-expected quarterly results on Tuesday as it signed up more big brands on to its e-commerce platform  sending the company's shares soaring as much as 15 percent to a record high.",
        "date": "08012017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "Shopify signs up more big brands  shares rise to record "
    },
    {
        "content": "TORONTO  Aug 1 Canada's main stock index fell on Tuesday as falling energy stocks helped outweigh gains for companies reporting strong earnings  including airline Air Canada and e-commerce company Shopify Inc.",
        "date": "08012017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "CANADA STOCKS-TSX down as energy losses offset surges in Shopify  airlines "
    },
    {
        "content": "Aug 1 Canada's Shopify Inc  reported a smaller-than-expected quarterly loss on Tuesday  as the company signed up more merchants to its e-commerce platform.",
        "date": "08012017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "UPDATE 1-Shopify posts smaller-than-expected 2nd-qtr loss "
    },
    {
        "content": "* Shopify Inc - second-quarter gross profit grows 83% year on year",
        "date": "08012017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "BRIEF-Shopify Inc Q2 net loss attributable to shareholders $0.15/shr "
    },
    {
        "content": "Aug 1 Canadian e-commerce company Shopify Inc   on Tuesday reported a bigger quarterly loss compared to a year earlier as it spent more on acquiring new merchants.",
        "date": "08012017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "Shopify's 2nd-qtr loss widens "
    },
    {
        "content": "* Ebay and Shopify extend merchant reach with new sales channel",
        "date": "07132017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "BRIEF-Ebay  Shopify extend merchant reach with new sales channel "
    },
    {
        "content": "* Shopify prices US$500 500 000 offering of class A subordinate voting shares",
        "date": "05192017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "BRIEF-Shopify prices $500.5 mln offering of class A subordinate voting shares "
    },
    {
        "content": "* Shopify launches offering of Class A subordinate voting shares",
        "date": "05182017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "BRIEF-Shopify launches offering of Class A subordinate voting shares "
    },
    {
        "content": "* Shopify Inc files for mixed shelf of up to $2.5 billion - SEC filing Further company coverage:",
        "date": "05172017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "BRIEF-Shopify Inc files for mixed shelf of up to $2.5 billion "
    },
    {
        "content": "TORONTO  May 2 Canada's main stock index see-sawed in early trade on Tuesday as financial stocks weighed  offsetting rises for several stocks whose earnings reports produced positive surprises  including energy company Encana Corp and e-commerce company Shopify.",
        "date": "05022017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "CANADA STOCKS-TSX makes small gain  earnings beats boost Encana  Shopify "
    },
    {
        "content": "Canadian software maker Shopify Inc   raised its full-year revenue forecast as more merchants used its e-commerce platform to set up and manage their online stores.",
        "date": "05022017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "Canada's Shopify raises full-year revenue forecast "
    },
    {
        "content": "May 2 Canadian software maker Shopify Inc raised its full-year revenue forecast as more merchants used its e-commerce platform to set up and manage their online stores.",
        "date": "05022017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "UPDATE 1-Canada's Shopify raises full-year revenue forecast "
    },
    {
        "content": "* Shopify Inc - total revenue in Q1 was $127.4 million  a 75% increase from comparable quarter in 2016",
        "date": "05022017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "BRIEF-Shopify Q1 revenue $127.4 mln "
    },
    {
        "content": "May 2 Canadian e-commerce software maker Shopify Inc  reported a 75 percent jump in quarterly revenue  as more merchants used its platform to set up and manage online stores.",
        "date": "05022017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "Shopify's 1st-qtr revenue jumps 75 pct "
    },
    {
        "content": "April 20 Canadian e-commerce software maker Shopify Inc said on Thursday it had launched a new wireless card reader in the United States.",
        "date": "04202017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "Canada's Shopify launches new wireless card reader "
    },
    {
        "content": "April 20 Canadian e-commerce software maker Shopify Inc said on Thursday it had launched a new wireless card reader in the United States.",
        "date": "04202017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "UPDATE 1-Canada's Shopify launches new wireless card reader "
    },
    {
        "content": "Canada's Shopify Inc  forecast better-than-expected 2017 revenue due to higher demand for its ecommerce software  which is used to set up and manage online stores.",
        "date": "02152017",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "Canada's Shopify forecasts 2017 revenue above estimates "
    },
    {
        "content": "Feb 15 Canada's Shopify Inc forecast better-than-expected 2017 revenue due to higher demand for its ecommerce software  which is used to set up and manage online stores.",
        "date": "02152017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "UPDATE 2-Canada's Shopify forecasts 2017 revenue above estimates "
    },
    {
        "content": "* Shopify announces fourth-quarter and full year 2016 financial results",
        "date": "02152017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "BRIEF-Shopify reports Q4 net loss $0.10 per share "
    },
    {
        "content": "Feb 15 Canadian e-commerce software maker Shopify Inc  reported a bigger quarterly loss on Wednesday as operating expenses jumped 80 percent.",
        "date": "02152017",
        "name": "Shopify Inc",
        "news_type": "normal",
        "symbol": "SHOP",
        "title": "Canada's Shopify reports bigger loss as expenses soar "
    },
    {
        "content": "* Shopify announces director resignation  Source text for Eikon:  Further company coverage:",
        "date": "11182016",
        "name": "Shopify Inc",
        "news_type": "topStory",
        "symbol": "SHOP",
        "title": "BRIEF-Shopify says Trevor Oelschig resigns from board "
    }
]