[
    {
        "content": "* Shares in rival Shire climb 6 pct (Adds projected price of drug  company comment)",
        "date": "11162017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 4-Roche haemophilia drug wins FDA nod  with a warning "
    },
    {
        "content": "* Omega Advisors Inc dissolves share stake in Carrizo Oil & Gas Inc - SEC Filing‍​",
        "date": "11142017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Omega Advisors dissolves share stake in Carrizo Oil & Gas  ups in Shire PLC "
    },
    {
        "content": "* Third Point LLC dissolves Class A share stake in Charter Communications Inc - SEC filing",
        "date": "11092017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Third Point takes share stake in Macerich  dissolves share stake in Humana "
    },
    {
        "content": "* Xenetic Biosciences enters into sublicense agreement related to its Polyxen technology with Baxalta Inc.  a wholly-owned subsidiary of Shire Plc",
        "date": "11022017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Xenetic Biosciences enters into sublicense agreement with subsidiary of Shire Plc "
    },
    {
        "content": "LONDON Shire will start making a genetic disease medicine itself after it was hit by supply problems  the London-listed firm said on Friday as it reported a sharp rise in profit.",
        "date": "10272017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire to make genetic disease drug itself to secure supply "
    },
    {
        "content": "* SHIRE RECEIVES EUROPEAN APPROVAL FOR LABEL EXTENSION OF FIRAZYR (ICATIBANT INJECTION) FOR THE SYMPTOMATIC TREATMENT OF ACUTE HAE ATTACKS IN PAEDIATRIC PATIENTS",
        "date": "10262017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire receives European approval for label extension of firazyr for symptomatic treatment "
    },
    {
        "content": "* SHIRE RECEIVES ORPHAN DRUG DESIGNATION FOR GENE THERAPY CANDIDATE SHP654 (BAX 888) FOR THE TREATMENT OF HEMOPHILIA A",
        "date": "10252017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire receives orphan drug designation for gene therapy candidate for treatment of Hemophilia A "
    },
    {
        "content": "* Shares up 1.2 pct (Adds CEO comments  analyst reaction  shares)",
        "date": "10272017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-Shire to make genetic disease drug itself to secure supply "
    },
    {
        "content": "* Ceo says review of adhd business on track to report by year end",
        "date": "10272017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire CEO says mitigated most Cinryze supply issues "
    },
    {
        "content": "Oct 2 Allergan Plc was sued on Monday by Shire Plc for allegedly scheming to block doctors from prescribing its new treatment for dry eye disease.",
        "date": "10022017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire sues Allergan in U.S. over dry eye drug "
    },
    {
        "content": "ZURICH  Oct 3 Lonza Group is acquiring a clinical-stage mammalian manufacturing site in the United States from Shire PLC  the Swiss pharmaceutical ingredients group said on Tuesday without giving the purchase price.",
        "date": "10032017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Lonza buys U.S. clinical manufacturing site from Shire "
    },
    {
        "content": "TOKYO  Sept 20 Shire Plc and Shionogi & Co Ltd said a drug to treat ADHD in adults had met its main goal in a late-stage trial in Japan  bringing it one step closer to approval in the world's third-biggest market for ADHD treatments.",
        "date": "09202017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire  Shionogi's ADHD drug for adults clears late-stage trial in Japan "
    },
    {
        "content": "* ‍SHIRE AND SHIONOGI ANNOUNCE POSITIVE TOPLINE RESULTS FOR INTUNIV EVALUATED IN PHASE 3 CLINICAL TRIAL IN ADULTS WITH ADHD​ Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "09202017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire and Shionogi announce positive topline results for Intuniv ​ "
    },
    {
        "content": "* SHIRE RECEIVES FDA FAST TRACK DESIGNATION FOR SHP607 FOR THE PREVENTION OF CHRONIC LUNG DISEASE IN EXTREMELY PREMATURE INFANTS",
        "date": "09122017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire receives FDA fast track designation for SHP607 "
    },
    {
        "content": "* Shire announces collaboration with Microhealth to address unique needs of hemophilia A and B patients with inhibitors Source text for Eikon: Further company coverage:",
        "date": "08252017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire announces collaboration with Microhealth to address needs of hemophilia A and B patients with inhibitors "
    },
    {
        "content": "LONDON  Aug 21 Pharmaceutical company Shire said its chief financial officer Jeff Poulton will stand down at the end of the year to join Indigo Ag  a Boston-based start-up that seeks to improve agricultural productivity.",
        "date": "08212017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire's CFO resigns to join plant technology start-up "
    },
    {
        "content": "* Jeff Poulton  chief financial officer  will be leaving Shire at end of year to serve as CFO at Indigo AG Source text for Eikon: Further company coverage:",
        "date": "08212017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire says CFO Jeff Poulton to leave at end of year "
    },
    {
        "content": "* Jana Partners Llc ups sole share stake in Hewlett Packard Enterprise Co to 10.2 million shares from 4.4 million shares",
        "date": "08142017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Jana Partners dissolves sole share stake in Snap Inc  Shire Plc "
    },
    {
        "content": "LONDON Shire  the London-listed pharmaceutical firm built up by acquisitions  said it might spin off its hyperactivity drugs business into a separate company and focus solely on rare disease treatments.",
        "date": "08032017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire may spin off hyperactivity drugs  raises forecasts "
    },
    {
        "content": "* Shares give up gains to trade down 2 percent (Adds further quotes  reaction  background)",
        "date": "08032017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 3-Shire may spin off hyperactivity drugs  raises forecasts "
    },
    {
        "content": "* Says we expect to complete a formal evaluation of the full range of strategic options for the neuroscience",
        "date": "08032017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire CEO says possible ADHD drugs spin-off is natural evolution of his strategy "
    },
    {
        "content": "* ‍NOVIMMUNE AND SHIRE SIGN LICENSE AGREEMENT DEEPENING BISPECIFIC ANTIBODY RESEARCH COLLABORATION​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "07182017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Novimmune and Shire sign license agreement deepening bispecific antibody research collaboration​ "
    },
    {
        "content": "* Shire submits investigational new drug application to FDA for gene therapy candidate SHP654 for treatment of Hemophilia A",
        "date": "07062017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire submits IND application for gene therapy candidate SHP654 "
    },
    {
        "content": "ZURICH Swiss drugmaker Roche's  bid to take a chunk of the $11 billion haemophilia drug market dominated by Shire  took another blow with the Irish company winning a preliminary injunction over its Swiss rival's medication.",
        "date": "07102017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire  Roche slug it out in billion-dollar haemophilia drug battle "
    },
    {
        "content": "ZURICH Pharmaceutical group Shire  said on Sunday it had obtained a preliminary injunction in a Hamburg court against rival Roche  over its hemophilia drug emicizumab  alleging incomplete and misleading statements surrounding the treatment.",
        "date": "07092017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire gets injunction against Roche over hemophilia drug "
    },
    {
        "content": "* Share of big $11 bln haemophilia market at stake (Adds details from preliminary injunction in paragraphs 8  9)",
        "date": "07102017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 2-Shire  Roche slug it out in billion-dollar haemophilia drug battle "
    },
    {
        "content": "ZURICH  July 9 Pharmaceutical group Shire said on Sunday it had obtained a preliminary injunction in a Hamburg court against rival Roche over its haemophilia drug emicizumab  alleging incomplete and misleading statements surrounding the treatment.",
        "date": "07092017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire gets injunction against Roche over haemophilia drug "
    },
    {
        "content": "ZURICH  July 10 Roche's bid to muscle in on Shire's share of the $11 billion haemophilia drug market took a new  contentious turn this weekend when the British drugmaker won a court injunction against how the Swiss drugmaker talks about its new medicine.",
        "date": "07102017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Roche  Shire court fight underscores high stakes in haemophilia "
    },
    {
        "content": "June 20 The U.S. Food and Drug Administration (FDA) on Tuesday approved Shire Plc's long-acting therapy for attention deficit hyperactivity disorder (ADHD)  adding another treatment to its stock of drugs for the cognitive condition that affects millions of children.",
        "date": "06202017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire's long-acting ADHD drug wins U.S. approval "
    },
    {
        "content": "* Supernus announces that its partner Shire receives FDA approval for Mydayis™ for ADHD",
        "date": "06212017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Supernus says Shire receives FDA approval for Mydayis for ADHD "
    },
    {
        "content": "Shire has won U.S. approval for a long-acting attention deficit drug aimed at adolescents and adults  boosting its stock of medicines for the cognitive condition that affects millions of children and is being diagnosed more in older people.",
        "date": "06212017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire wins U.S. approval for long-acting ADHD drug "
    },
    {
        "content": "* Shares up 1.5 percent in London trading (Adds sales forecasts  shares  reaction)",
        "date": "06212017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-Shire wins U.S. approval for long-acting ADHD drug "
    },
    {
        "content": "* Kamada receives additional milestone payment under Glassia exclusive supply and distribution agreement with Shire",
        "date": "06122017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Kamada receives additional milestone payment from Shire PLC "
    },
    {
        "content": "* Provides update on clinical program for alpha-1 antitrypsin IV for treatment of graft-versus-host disease",
        "date": "06072017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Kamada provides update on clinical program for alpha-1 antitrypsin IV treatment "
    },
    {
        "content": "* Xenetic Biosciences - receives program update from partner Shire's phase 1/2 study evaluating SHP656 in development as a long-acting treatment for Hemophilia A",
        "date": "05222017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Xenetic Biosciences receives update from Shire's Phase 1/2 study evaluating SHP656 in development as long-acting treatment for Hemophilia A "
    },
    {
        "content": "Successful late-stage data on Shire Plc's  long-acting preventative treatment for hereditary angioedema (HAE) brings the Dublin-based drugmaker one step closer to U.S. approval  it said on Thursday.",
        "date": "05182017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire's swelling disorder drug moves closer to U.S. approval "
    },
    {
        "content": "* U.S. shares rise 3.4 pct  UK stock up 1.7 pct (Adds conference call details  analyst comment; updates shares)",
        "date": "05182017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 3-Shire's swelling disorder drug moves closer to U.S. approval "
    },
    {
        "content": "* Shire says potential EU marketing submission for lanadelumab is expected to be filed in first half of 2018  pending discussion with the EMA",
        "date": "05182017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire expects to file potential EU marketing submission for lanadelumab in H1 2018 "
    },
    {
        "content": "* Shire's investigational treatment lanadelumab reduces hereditary angioedema monthly attack rate by 87% versus placebo in phase 3 26-week pivotal trial",
        "date": "05182017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire's angioedema drug succeeds in late-stage study "
    },
    {
        "content": "May 18 Shire Plc said on Thursday its drug for hereditary angioedema (HAE)  a disorder characterized by recurrent episodes of severe swelling  was successful in a late-stage study.",
        "date": "05182017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire's angioedema drug succeeds in late-stage study "
    },
    {
        "content": "* Shire and Parion Sciences enter into a collaborative license agreement to advance p-321 for ophthalmic indications",
        "date": "05012017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire and Parion Sciences enter into a collaborative license agreement "
    },
    {
        "content": "LONDON Pharmaceutical group Shire   which bought hemophilia specialist Baxalta last year  reported a better-than-expected 14 percent rise in first-quarter earnings  helped by cost savings and higher sales of its rare disease drugs.",
        "date": "05022017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire drives down costs to deliver earnings beat "
    },
    {
        "content": "* Shares rise 3 pct to top FTSE 100 index (Adds CEO comments  analyst reaction  updates shares)",
        "date": "05022017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 2-Shire drives down costs to deliver earnings beat "
    },
    {
        "content": "LONDON  May 2 Shire  the pharma group that bought haemophilia specialist Baxalta last year  reported a better-than-expected 14 percent rise in first-quarter earnings  helped by higher sales of rare disease drugs and demand for its new dry eye medicine.",
        "date": "05022017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire delivers first-quarter beat with 14 pct rise in earnings "
    },
    {
        "content": "Shire PLC's bid to prevent a Florida-based drug company from being able to go to market with a generic version of extended-release Adderall entered the courtroom phase on Monday as a bench trial began.",
        "date": "03272017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Patent trial begins in Shire bid to block generic Adderall XR "
    },
    {
        "content": "Alexion Pharmaceuticals Inc  on Monday named former Baxalta CEO Ludwig Hantson to its top job  as the rare-disease drug maker seeks to regain investor confidence following the exit of top management.",
        "date": "03272017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Alexion Pharma names former Baxalta chief Ludwig Hantson CEO "
    },
    {
        "content": "March 27 Alexion Pharmaceuticals Inc on Monday named former Baxalta CEO Ludwig Hantson to its top job  as the rare-disease drug maker seeks to regain investor confidence following the exit of top management.",
        "date": "03272017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 2-Alexion Pharma names former Baxalta chief Ludwig Hantson CEO "
    },
    {
        "content": "* Shire receives FDA fast track designation for Recombinant ADAMTS13 (SHP655) for treatment of hereditary thrombotic thrombocytopenic purpura  Source text for Eikon:  Further company coverage:",
        "date": "03222017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-FDA grants fast track designation for Shire's Recombinant ADAMTS13 "
    },
    {
        "content": "* Shire Plc - United States Food And Drug Administration (FDA) has granted fast track designation for Recombinant Adamts13",
        "date": "03222017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-FDA grants fast track designation for Shire's Recombinant Adamts13 "
    },
    {
        "content": "* Shire receives european approval for label extension of Cinryze(C1 inhibitor) to prevent and treat hereditary angioedema (HAE) attacks in paediatric patients with hae",
        "date": "03162017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire receives European approval for label extension of Cinryze "
    },
    {
        "content": "* On March 6  2017  Neos Therapeutics entered into a license agreement with Shire - SEC filing",
        "date": "03102017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Neos Therapeutics enters into a license agreement with Shire "
    },
    {
        "content": "* Reg-Argenx announces extension of therapeutic antibody alliance with Shire plc to advance the discovery and development of novel human therapeutic antibodies for diverse rare and unmet diseases for a further year until May 30  2018  Source text for Eikon:  Further company coverage:   (Gdynia Newsroom)",
        "date": "02272017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Argenx announces extension of therapeutic antibody alliance with Shire "
    },
    {
        "content": "* No serious adverse events or discontinuations due to adverse events were observed at all doses studied",
        "date": "02232017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire reports positive results in phase 1b study of skin swelling drug Lanadelumab "
    },
    {
        "content": "* GSK  AZ  Shire welcome update   (Adds GSK statement  analyst comment  details)",
        "date": "02232017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 2-China updates key drug list in boost for Big Pharma "
    },
    {
        "content": "LONDON Pharmaceuticals group Shire  on Thursday said it was extremely optimistic about long-term growth after reporting a 12 percent rise in earnings for the past year in which it made its largest ever acquisition.",
        "date": "02162017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Pharma group Shire produces top-of-the-range earnings "
    },
    {
        "content": "* Shares rise 6 pct   (Adds CEO comments  analyst reaction  shares)",
        "date": "02162017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-Pharma group Shire produces top-of-the-range earnings "
    },
    {
        "content": "LONDON  Feb 16 Pharmaceuticals group Shire  reported a 12 percent rise in full-year earnings after what it said was a transformational year marked by its largest acquisition to date  adding that it is extremely optimistic on long-term growth prospects.",
        "date": "02162017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Pharma group Shire posts earnings rise at top of guidance "
    },
    {
        "content": "A federal appeals court has removed a roadblock to the launch of a generic version of Shire PLC's bowel disease drug Lialda  reversing a lower court decision that the generic version would infringe Shire's patent.",
        "date": "02132017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Federal Circuit clears proposed generic version of Shire's Lialda "
    },
    {
        "content": "WASHINGTON  Feb 7 The U.S. Federal Trade Commission filed a complaint against Shire ViroPharma on Tuesday  accusing it of hijacking a government channel designed to flag safety issues by using it to fend off generic competition  the agency said in a statement.",
        "date": "02072017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 2-FTC sues Shire ViroPharma for fighting generic entry of Vancocin "
    },
    {
        "content": "WASHINGTON  Feb 7 The U.S. Federal Trade Commission filed a complaint against Shire ViroPharma on Tuesday  accusing it of abusing government processes in order to fend off generic competition to its antibiotic Vancocin HCI  the agency said in a statement.",
        "date": "02072017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "FTC sues Shire ViroPharma for fighting generic entry of Vancocin "
    },
    {
        "content": "* U.S. FDA acknowledges receipt of Shire's new drug application for SHP465 for ADHD",
        "date": "01192017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-U.S FDA acknowledges receipt of Shire's ADHD drug application "
    },
    {
        "content": "DAVOS  Switzerland Shire  which sells some of the world's most expensive prescription drugs  believes the U.S. market will continue to recognize the value of its rare disease treatments  despite sabre-rattling on pricing by President-elect Donald Trump.",
        "date": "01172017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire confident rare drugs will be valued  despite Trump threats "
    },
    {
        "content": "WASHINGTON Shire PLC subsidiaries will pay $350 million to settle U.S. federal and state False Claims Act allegations related to unlawful methods to push “Dermagraft ” a treatment for diabetic foot ulcers  the U.S. Justice Department said in a statement on Wednesday.",
        "date": "01112017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "U.S. says Shire subsidiaries to pay $350 million to settle false claims act allegations "
    },
    {
        "content": "WASHINGTON  Jan 11 Shire PLC subsidiaries will pay $350 million to settle U.S. federal and state False Claims Act allegations related to unlawful methods to push \"Dermagraft \" a treatment for diabetic foot ulcers  the U.S. Justice Department said in a statement on Wednesday.",
        "date": "01112017",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "U.S. says Shire subsidiaries to pay $350 mln to settle false claims act allegations "
    },
    {
        "content": "* Xenetic Biosciences receives $3 million milestone payment from Shire Plc for psa-recombinant shp656 in development for long-acting treatment for hemophilia",
        "date": "01062017",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Xenetic Biosciences receives $3 mln milestone payment from Shire Plc "
    },
    {
        "content": "Nov 29 U.S. biotech Momenta Pharmaceuticals Inc  said on Tuesday its experimental biosimilar version of AbbVie Inc's top-selling autoimmune drug  Humira  met the main goal in a late-stage trial involving patients with a form of psoriasis.",
        "date": "11292016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-Momenta's Humira biosimilar succeeds in key psoriasis study "
    },
    {
        "content": "* Sees opportunity as China opens consultation on key drugs list",
        "date": "11122016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 1-Shire sees opportunity in Asia  aims to double revenue by 2020 "
    },
    {
        "content": "SINGAPORE  Nov 11 Shire  a specialist in rare diseases  aims to double Asian sales by 2020  as it targets markets including China  where it hopes to put its haemophilia drugs on a reimbursement list being updated this year for the first time since 2009.",
        "date": "11112016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire sees opportunity in Asia  aims to double revenue by 2020 "
    },
    {
        "content": "LONDON Shire  reported a fall in third-quarter sales of hemophilia drugs acquired in its $32 billion Baxalta deal in June  resulting in a rare miss on both the top and bottom lines and sending its shares lower.",
        "date": "11012016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire slips on poor sales of hemophilia drugs "
    },
    {
        "content": "* Shares recover some losses to trade down 1.5 pct   (Adds quotes  reaction  updates shares)",
        "date": "11012016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 2-Shire slips on poor sales of haemophilia drugs "
    },
    {
        "content": "A U.S. Patent and Trademark Office tribunal has invalidated most of Shire PLC's patent on its Gattex short bowel syndrome drug  handing hedge fund manager Kyle Bass his first victory in an ongoing campaign of challenging drug patents.",
        "date": "10252016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Fund manager notches first win in drug patent challenge campaign "
    },
    {
        "content": "* Shire PLC - Shire announces update to vyvanse (lisdexamfetamine dimesylate) U.S. labeling",
        "date": "10172016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire announces update to vyvanse U.S. labeling "
    },
    {
        "content": "* Granted eu marketing authorization of onivyde\u007f  in combination with 5-fluorouracil (5-fu) and leucovorin (lv) for treatment of metastatic adenocarcinoma of pancreas in adult patients who have progressed following gemcitabine-based therapy  Source text for Eikon:  Further company coverage:    (Reporting By UK Bureau)",
        "date": "10182016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire granted EU approval for pancreatic cancer combination therapy "
    },
    {
        "content": "* Shire plc will become a component of nasdaq-100 index\u007f  and nasdaq-100 equal weighted index prior to market open on wednesday  october 19  2016",
        "date": "10122016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF- Shire plc to become a component of NASDAQ-100 index "
    },
    {
        "content": "* Says patent trial and appeal board upholds validity of LIALDA patent  Source text for Eikon:  Further company coverage:",
        "date": "10052016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire Plc says patent trial and appeal board upholds validity of LIALDA patent "
    },
    {
        "content": "* Momenta Pharmaceuticals to regain global development and commercialization rights to M923  a proposed biosimilar of HUMIRA (adalimumab)  through termination of collaboration agreement with Baxalta  now part of Shire",
        "date": "09272016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Mmenta Pharmaceuticals to regain global development and commercialization rights to M923 "
    },
    {
        "content": "* Says has regained from shire plc all development and commercial rights previously licensed for chs-0214 etanercept",
        "date": "09272016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Coherus Biosciences regains development and commercial rights to CHS-0214 from Shire "
    },
    {
        "content": "* That its wholly owned subsidiary priced its inaugural public offering of $12.1 bln aggregate principal amount of senior notes  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "09202016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire unit prices public offering of $12.1 bln senior notes "
    },
    {
        "content": "* Priced its inaugural public offering of $12.1 billion aggregate principal amount of senior notes",
        "date": "09202016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire priced its public offering of $12.1 bln aggregate principal amount of senior notes "
    },
    {
        "content": "* Court ruled that Cadilla Healthcare Ltd./Zydus Pharmaceuticals (USA) Inc.'s proposed generic version of Lialda does not infringe U.S. patent no. 6 773 720",
        "date": "09162016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire District Court issues ruling in Hatch Waxman case regarding Shire's Lialda "
    },
    {
        "content": "Sept 14 Shire Plc said the United States Food and Drug Administration (FDA) approved its treatment for patients with primary immunodeficiency  a group of genetic disorders in which part of the body's immune system is missing or functions improperly.",
        "date": "09142016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire's treatment for primary immunodeficiency wins FDA approval "
    },
    {
        "content": "* Shire announces U.S. FDA approval of cuvitrutm [immune globulin subcutaneous (human)  20% solution] treatment for primary immunodeficiency",
        "date": "09142016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire's Cuvitru gets FDA nod to treat primary immunodeficiency "
    },
    {
        "content": "* Announced U.S. launch of Vonvendi [von willebrand factor (recombinant)]  only recombinant treatment for adults living with Von Willebrand Disease  Source text for Eikon:  Further company coverage:",
        "date": "08092016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire launches Von Willebrand disease drug in the U.S "
    },
    {
        "content": "* Shares up 3 pct   (Adds further CEO quotes on cost savings  pipeline)",
        "date": "08022016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 2-Shire lifts earnings and Baxalta cost saving targets "
    },
    {
        "content": "Aug 5 AbbVie Inc said hedge fund Elliott Associates LP has sued the pharmaceuticals company alleging that it had made misrepresentations and omissions related to a failed attempt to buy Dublin-based Shire Plc .",
        "date": "08052016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Elliott Associates sues AbbVie over failed bid for Shire "
    },
    {
        "content": "LONDON Drugmaker Shire  upgraded its profit guidance for 2016 on Tuesday  after it hiked the predicted cost saving target for its $32 billion acquisition of rare disease drugs specialist Baxalta and beat forecasts for the second quarter.",
        "date": "08022016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire lifts earnings and Baxalta cost saving targets "
    },
    {
        "content": "* Ceo says can 'hopefully do even better' than new $700 million cost savings target fin baxalta deal   Further company coverage:    (Reporting By London Bureau)",
        "date": "08022016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire CEO says can 'hopefully do better' on Baxalta M&A target "
    },
    {
        "content": "* Shire announces FDA approval of Adynovate with Baxject III reconstitution system  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08012016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire announces FDA approval of Adynovate "
    },
    {
        "content": "* Shire recommends ADS holders reject TRC Capital's \"mini-tender offer\"",
        "date": "07292016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire recommends ADS holders reject TRC Capital's \"mini-tender offer\" "
    },
    {
        "content": "* Shire's SHP626 (volixibat) receives FDA fast track designation for an investigational treatment for adults who have nonalcoholic steatohepatitis (nash) with liver fibrosis  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "07292016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire's liver disease drug gets fast track designation from U.S. FDA "
    },
    {
        "content": "July 12 Shire Plc * U.S. launch of Xiidra planned for Q3 2016 Source text for Eikon: Further company coverage: ",
        "date": "07132016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire U.S. launch of Xiidra planned for Q3 2016 "
    },
    {
        "content": "* Shire expects to launch Xiidra in United States in Q3 of 2016",
        "date": "07112016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire says FDA approves Shire's Xiidra\u007f "
    },
    {
        "content": "* CEO to update on Baxalta cost savings next month   (Adds comments by CEO on sales outside U.S.  Baxalta synergies)",
        "date": "07122016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 2-Shire on a roll as U.S. approves keenly awaited eye drug "
    },
    {
        "content": "LONDON Shire's  chief executive said on Tuesday the drugmaker would give an update on savings from the acquisition of Baxalta when it reports second-quarter results on August 2  raising hopes that more costs will be eliminated than initially forecast.",
        "date": "07122016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire CEO to update on Baxalta savings next month "
    },
    {
        "content": "Shire has won U.S. approval for its most important new medicine  a treatment for dry eyes  in a fresh boost for the company which completed its $32 billion acquisition of U.S. rare diseases specialist Baxalta last month.",
        "date": "07122016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire on a roll as U.S. approves keenly awaited eye drug "
    },
    {
        "content": "LONDON  July 12 European shares edged higher on Tuesday  boosted by a rise in Shire after positive drug trial results  with Daimler also gaining after its quarterly results.",
        "date": "07122016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "European shares edge up for fourth straight session "
    },
    {
        "content": "July 11 The U.S. Food and Drug Administration on Monday approved Shire Plc's lifitegrast eye drops for treating signs and symptoms of dry eye disease  allowing the company to bring to market its most important pipeline medicine.",
        "date": "07122016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "FDA approves Shire's keenly-watched eye drug "
    },
    {
        "content": "* Shire announces top-line results for phase 2 trial of shp607 in extremely premature infants  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06302016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire reports results for mid-stage trial of shp607 in extremely premature infants "
    },
    {
        "content": "* Shire announces positive topline results of SHP465 efficacy and safety study in adults with ADHD",
        "date": "06292016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire announces positive topline results of SHP465 efficacy and safety study "
    },
    {
        "content": "June 29 Irish drugmaker Shire Plc said a study testing an experimental drug to treat attention-deficit disorder met the main goal  bringing the drug one step closer to approval in the United States.",
        "date": "06302016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "CORRECTED-UPDATE 1-Shire says ADHD drug meets main goal of study (June 29) "
    },
    {
        "content": "* Shire and Kamada announce FDA approval of expanded label for self-infusion of GLASSIA for the treatment of emphysema due to severe AAT deficiency",
        "date": "06152016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire and Kamada announce FDA approval of an expanded label for GLASSIA "
    },
    {
        "content": "* Granted breakthrough therapy designation for two investigational products for rare diseases: SHP621 and SHP625",
        "date": "06132016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire receives FDA breakthrough therapy designation "
    },
    {
        "content": "Irish drugmaker Shire Plc said it would buy the rights to an experimental bowel drug from Pfizer Inc to bolster its pipeline of gastrointestinal treatments.",
        "date": "06142016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire buys bowel drug rights from Pfizer "
    },
    {
        "content": "June 14 Irish drugmaker Shire Plc said it would buy the rights to an experimental bowel drug from Pfizer Inc to bolster its pipeline of gastrointestinal treatments.",
        "date": "06142016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-Shire buys bowel drug rights from Pfizer "
    },
    {
        "content": "June 14 Irish drugmaker Shire Plc said on Tuesday it would buy from Pfizer Inc the rights to an experimental drug  designed to treat moderate-to-severe inflammatory bowel disease.",
        "date": "06142016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Drugmaker Shire buys bowel drug rights from Pfizer "
    },
    {
        "content": "* Shire to license PF-00547659 from Pfizer  adding to established and leading gastrointestinal portfolio",
        "date": "06142016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire to license investigational gastric drug from Pfizer "
    },
    {
        "content": "* Shareholders approved definitive merger agreement with Shire with approximately 98.9 percent of shares outstanding cast in favor of proposal  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05272016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Baxalta shareholders vote to approve combination "
    },
    {
        "content": "* Baxalta announces preliminary merger consideration election results",
        "date": "05232016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Baxalta announces preliminary merger consideration election results "
    },
    {
        "content": "April 28 Shire Plc won just enough support for its director remuneration report at the drugmaker's annual general meeting on Thursday.",
        "date": "04282016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire director pay resolution just scrapes though at general meet "
    },
    {
        "content": "LONDON Strong demand for Shire's  top-selling Vyvanse drug helped to lift first-quarter earnings by a better than expected 12 percent  boosting the London-listed group's shares ahead of its $32 billion acquisition of U.S. rare diseases specialist Baxalta .",
        "date": "04292016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire jumps as Vyvanse drug helps it to beat earnings forecast "
    },
    {
        "content": "* Says 50.55 pct of votes cast at AGM in favour of resolution to approve directors' remuneration report  49.45 percent against  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "04282016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire director's remuneration voted against by 49.4 pct shareholders present at AGM "
    },
    {
        "content": "* Shire announces positive results of shp465 safety and efficacy study in children and adolescents with adhd",
        "date": "04042016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire announces positive results of SHP465 safety  efficacy study "
    },
    {
        "content": "* Anticipates Baxalta transaction will proceed as originally announced on Jan. 11  2016",
        "date": "04062016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire anticipates Baxalta deal to proceed as planned "
    },
    {
        "content": "April 6 U.S. drugmaker Pfizer Inc and Ireland-based Allergan Plc walked away from their $160 billion merger on Wednesday  a major win for President Barack Obama  who has been pushing to curb deals in which companies move overseas to cut taxes.",
        "date": "04062016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 3-Pfizer  Allergan scrap $160 bln deal after U.S. tax rule change "
    },
    {
        "content": "NEW YORK U.S. drug maker Pfizer Inc agreed on Tuesday to terminate its $160 billion agreement to acquire Botox maker Allergan Plc  in a major victory to U.S. President Barack Obama's drive to stop tax-dodging corporate mergers.",
        "date": "04062016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Obama's inversion curbs kill Pfizer's $160 billion Allergan deal "
    },
    {
        "content": "NEW YORK  April 5 U.S. drug maker Pfizer Inc  agreed on Tuesday to terminate its $160 billion agreement to acquire Botox maker Allergan Plc  in a major victory to U.S. President Barack Obama's drive to stop tax-dodging corporate mergers.",
        "date": "04062016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "REFILE-UPDATE 7-Obama's inversion curbs kill Pfizer's $160 bln Allergan deal "
    },
    {
        "content": "March 29 Jason Haas and David Levin  Deutsche Bank AG's top U.S. healthcare investment bankers  have resigned to join Barclays Plc and take leading roles in its healthcare practice  according to people familiar with the matter.",
        "date": "03292016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "CORRECTED-MOVES-Barclays hires top U.S. healthcare bankers from Deutsche -sources "
    },
    {
        "content": "March 28 A U.S. district court on Monday ruled in favor of Shire Plc  preventing Allergan Plc  from selling generic versions of Lialda  the ulcerative colitis drug  in the United States until 2020.",
        "date": "03282016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire gets favorable ruling against Allergan in Lialda patent case "
    },
    {
        "content": "LONDON Drugmaker Shire  reported better-than-expected profit in the last quarter of 2015  a period when management could have been distracted by buying rare disease specialist Dyax and the final stages of its $32 billion pursuit of Baxalta International.",
        "date": "02112016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Drugmaker Shire delivers earnings beat amid deal-making push "
    },
    {
        "content": "* Shares up 2.8 percent   (Adds CEO comments  analyst reaction  updates shares)",
        "date": "02112016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 2-Drugmaker Shire delivers earnings beat amid deal-making push "
    },
    {
        "content": "** Drugmaker Shire down c.2 pct & second biggest loser on the Stoxx 600 healthcare index after HSBC cuts TP on stock to 5400p from 6200p & raises sirens around its proposed $32 billion cash-and-stock offer for Baxalta",
        "date": "01272016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BUZZ-Shire: HBSC sounds caution on Baxalta deal "
    },
    {
        "content": "** British drugmaker Shire jumps c.4 pct  among the top performers on the FTSE 100 after saying it could achieve higher cost savings from Baxalta deal",
        "date": "01132016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BUZZ-Shire: Baxalta deal could bump-up cost savings "
    },
    {
        "content": "* Baxalta haemophilia business a potential product risk   (Adds closing share prices  termination fee)",
        "date": "01112016",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 4-Drugmaker Shire to buy Baxalta for $32 bln after 6-month pursuit "
    },
    {
        "content": "LONDON  Jan 11 European shares ended a choppy session in negative territory on Monday  with drugmaker Shire  falling sharply after announcing it would buy Baxalta  and commodity shares tracking oil and metals prices lower.",
        "date": "01112016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "European shares end lower on Shire slump and commodities slide "
    },
    {
        "content": "LONDON  Jan 11 Britain's top share index fell on Monday to extend a four day losing run after posting its worst first week of the year since 2000  hit by late falls in Shire  and energy firms.",
        "date": "01112016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Britain's FTSE falls away  extending turbulent start to the year "
    },
    {
        "content": "* Ceo says baxalta deal is not about tax savings  it's about creating a leader in rare diseases",
        "date": "01112016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire 'confident' Baxalta structure preserves tax-free status of spin-out "
    },
    {
        "content": "* Baxalta shareholders will receive $18.00 in cash and 0.1482 Shire ADS per Baxalta share\u007f\u007f",
        "date": "01112016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire says to buy Baxalta in deal worth about $32 bln "
    },
    {
        "content": "LONDON  Jan 11 Drugmaker Shire Plc  clinched its six-month pursuit of Baxalta International Inc  on Monday by agreeing a $32 billion cash and stock offer that will make it one of the world's leading rare disease specialists.",
        "date": "01112016",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire to buy Baxalta for $32 bln  forging rare diseases leader "
    },
    {
        "content": "LONDON  Dec 23 European equity futures rose on Wednesday  buoyed by gains on Asian and U.S. equity markets.",
        "date": "12232015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "European Factors to Watch-Equity futures rise "
    },
    {
        "content": "LONDON  Dec 23 European stocks were seen opening higher on Wednesday  tracking gains on Asian and U.S. equity markets.",
        "date": "12232015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "European Factors to Watch-Shares seen higher at open "
    },
    {
        "content": "NEW YORK/LONDON Drug maker Shire Plc  has made a new acquisition offer for peer Baxalta International Inc  that is roughly in line with the latter's valuation expectations  making a deal in the coming weeks likely  people familiar with the matter said.",
        "date": "12222015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Exclusive: Shire closer to deal to buy Baxalta - sources "
    },
    {
        "content": "NEW YORK/LONDON  Dec 22 Drug maker Shire Plc  has made a new acquisition offer for peer Baxalta International Inc that is roughly in line with the latter's valuation expectations  making a deal in the coming weeks likely  people familiar with the matter said.",
        "date": "12222015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "EXCLUSIVE -Shire closer to deal to buy Baxalta -sources "
    },
    {
        "content": "ZURICH/LONDON Drugmaker Shire  is preparing to make a new takeover offer for U.S. biotech firm Baxalta  that if successful will create one of the world's leading specialists in rare diseases  a source with direct knowledge of the situation said on Tuesday.    The London-listed group has asked its advisers to renew its bid effort  the source said  almost four months after Baxalta rejected an unsolicited $30 billion offer that it said significantly undervalue",
        "date": "11242015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Exclusive: Shire prepares to make new bid for Baxalta - source "
    },
    {
        "content": "Nov 5 A pair of Deutsche Bank AG  healthcare investment bankers are leaving for JPMorgan Chase & Co a little more than a year after joining the German bank  according to people familiar with the matter.",
        "date": "11052015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "MOVES-Deutsche Bank healthcare bankers depart for JPMorgan one year after hire "
    },
    {
        "content": "LONDON Shire Plc  has agreed to buy U.S. rare disease specialist Dyax Corp  for about $5.9 billion - and potentially up to $6.5 billion - while still pursuing a five times larger unsolicited bid for Baxalta Inc .",
        "date": "11022015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire to buy Dyax for $5.9 billion  still wants Baxalta "
    },
    {
        "content": "* CEO insists still has capacity to buy Baxalta   (Adds Breakingviews link  updates share prices)",
        "date": "11022015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 4-Shire to buy Dyax for $5.9 bln  still wants Baxalta "
    },
    {
        "content": "** Drugmaker Shire's  London-listed shares fall to intraday lowest as co says to buy Dyax Corp for c.$5.9 bln to gain access to Dyax's late-stage treatment for a severe breathing difficulty",
        "date": "11022015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BUZZ-Shire: makes $5.9 bln bid to buy Dyax Corp "
    },
    {
        "content": "Nov 2 British drugmaker Shire Plc   said it would buy Dyax Corp for about $5.9 billion to gain access to the drug developer's late-stage treatment for a severe breathing difficulty.",
        "date": "11022015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "CORRECTED-Shire to buy Dyax for about $5.9 bln "
    },
    {
        "content": "LONDON Shire reported positive results for a new eye drug on Tuesday  increasing the chances of lifitegrast reaching the market next year and boosting the London-listed group's prospects as it tries to buy Baxalta.",
        "date": "10272015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire's eye drug data could strengthen bid for Baxalta  says CEO "
    },
    {
        "content": "* Shire shares jump more than 6 pct  Baxalta up 3 pct   (Recasts  adds Baxalta share price rise)",
        "date": "10272015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 2-Shire's eye drug data could strengthen bid for Baxalta  says CEO "
    },
    {
        "content": "LONDON  Oct 27 London-listed pharma firm Shire  said its dry-eye disease drug lifitegrast significantly improved patient symptoms in a new study  supporting a re-submission of the potentially block-busting medicine to U.S. regulators early next year.",
        "date": "10272015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire to resubmit dry-eye disease drug to FDA with new study data "
    },
    {
        "content": "Oct 23 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "10232015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON Pharmaceutical firm Shire  said it was still pursuing its attempt to buy U.S. company Baxalta   as it posted a better-than-expected 11 percent rise in third-quarter earnings on Friday.",
        "date": "10232015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire says still pursuing Baxalta; third-quarter earnings rise "
    },
    {
        "content": "LONDON  Oct 23 Pharmaceutical firm Shire  said it was still pursuing its attempt to buy U.S. company Baxalta  as it posted a better-than-expected 11 percent rise in third-quarter earnings on Friday.",
        "date": "10232015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-Shire says still pursuing Baxalta; Q3 earnings rise "
    },
    {
        "content": "LONDON  Oct 23 Pharmaceutical firm Shire  said it was still pursuing its attempt to buy U.S. company Baxalta as it posted a 11 percent rise in third-quarter earnings on Friday.",
        "date": "10232015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire says remains in Baxalta hunt after rise in Q3 earnings "
    },
    {
        "content": "Shire Plc suffered a setback for its most important pipeline medicine late on Friday  adding to the group's problems as it pursues Baxalta Inc to forge the leading global specialist in rare diseases.",
        "date": "10172015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "FDA eye drug rebuff adds to Shire's woes in Baxalta pursuit "
    },
    {
        "content": "* Setback for company's top drug likely to hit shares   (Recasts with context on Baxalta bid)",
        "date": "10172015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 2-FDA eye drug rebuff adds to Shire's woes in Baxalta pursuit "
    },
    {
        "content": "Oct 16 The U.S. Food and Drug Administration notified Shire Plc  it will not approve its eye drug Lifitegrast  the company said on Friday  adding that the U.S. health regulator recommended the company conduct additional clinical studies.",
        "date": "10172015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire says U.S FDA declines to approve eye drug Lifitegrast "
    },
    {
        "content": "* Barclays rises on media report   (Updates with closing prices)",
        "date": "10192015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UK shares underperform Europe; mining companies fall after Chinese data "
    },
    {
        "content": "LONDON  Oct 19 Britain's top share index slipped on Monday as mining stocks suffered after China reported its economic growth had slowed  while drugmaker Shire dipped after U.S. regulators withheld approval for a new drug.",
        "date": "10192015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UK shares underperform Europe; mining companies fall after China data "
    },
    {
        "content": "LONDON  Oct 19 Britain's top share index slipped on Monday as mining stocks took a hit from data showing Chinese economic growth slowing  while drugmaker Shire dipped on a setback in the United States for a dry eye treatment.",
        "date": "10192015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UK shares underperform Europe  miners fall after China data "
    },
    {
        "content": "LONDON Shares in Shire Plc fell 2 percent on Monday after the U.S. Food and Drug Administration (FDA) decided not to approve its most important pipeline medicine for dry eye disease and asked for more information.",
        "date": "10192015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Eye drug setback hits Shire shares amid Baxalta pursuit "
    },
    {
        "content": "LONDON  Oct 19 Britain's top share index slipped on Monday as mining stocks took a hit from data showing Chinese economic growth slowing  while drugmaker Shire dipped on a setback in the United States for a dry eye treatment.",
        "date": "10192015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UK shares slip as miners and Shire weigh on index "
    },
    {
        "content": "LONDON  Oct 16 Britain's top share index rose on Friday  lifted by drugmaker Shire  whose shares climbed on speculation it could be lining up a bid for a U.S. rival.",
        "date": "10162015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Britain's FTSE forges ahead as Shire surges "
    },
    {
        "content": "** Shire down c.2 pct  top FTSE-100 loser after U.S. FDA declined to approve its new eye drug lifitegrast",
        "date": "10192015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BUZZ-Shire: top FTSE 100 faller on FDA setback "
    },
    {
        "content": "* Shares fall 2 pct; weakens hand in all-share Baxalta bid   (Updates with share price fall  analyst comment)",
        "date": "10192015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-Eye drug setback hits Shire shares amid Baxalta pursuit "
    },
    {
        "content": "LONDON  Oct 16 Britain's top share index rose on Friday  lifted by drugmaker Shire  whose shares rose on speculation it could be lining up a bid for a U.S. rival.",
        "date": "10162015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Britain's FTSE rises as Shire surges "
    },
    {
        "content": "LONDON  Oct 19 Shire still hopes to launch its new dry eye drug lifitegrast next year  despite a decision by the U.S. Food and Drug Administration not to approve it based on current data  the firm's chief executive said on Monday.",
        "date": "10192015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "After setback  Shire CEO still hopes to launch eye drug in 2016 "
    },
    {
        "content": "LONDON  Sept 21 Britain's blue-chip share index edged higher on Monday  with drugmaker Shire gaining after receiving European approval for an ADHD treatment  while energy firms tracked a rally in crude oil prices.",
        "date": "09212015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire and energy firms lift FTSE but RSA tumbles as Zurich drops bid "
    },
    {
        "content": "* Shire receives European approval for Intuniv (Guanfacine Hydrochloride prolonged release tablets) as a non-stimulant ADHD treatment for children and adolescents",
        "date": "09212015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire receives European Commission's approval for Intuniv "
    },
    {
        "content": "NEW YORK  Sept 16 A top executive at Baxalta Inc   which was approached with a takeover offer from Shire PLC  said on Wednesday the company did not plan to rush into doing a defensive deal to try to fend off its unwanted suitor.",
        "date": "09162015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Baxalta executive says will not do defensive M&A "
    },
    {
        "content": "Aug 28 Drugmaker Baxalta Inc is working with bankers to buy a U.S.-based hematology and oncology specialist valued at about $2 billion  Bloomberg reported  citing people familiar with the matter.",
        "date": "08282015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Baxalta in talks to buy U.S. hematology-oncology specialist - Bloomberg "
    },
    {
        "content": "* Shire to attain enhanced Cinryze manufacturing flexibility and capacity",
        "date": "08252015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire enters into agreement with Sanquin for Cinryze manufacturing "
    },
    {
        "content": "LONDON  Aug 18 Britain's top share index slipped lower on Tuesday  weighed down by a drop in energy and mining stocks as metals and oil prices weakened.",
        "date": "08182015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Britain's FTSE falters as commodity stocks crumple "
    },
    {
        "content": "LONDON Shire  Chief Executive Flemming Ornskov is stepping up his campaign to get Baxalta  to the negotiating table as he pushes the benefits a $30 billion takeover offer to the U.S. biotech company's shareholders.",
        "date": "08102015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire steps up drive to get Baxalta talking after $30 billion bid "
    },
    {
        "content": "* Baxalta CEO says can get to Shire bid value on its own   (Adds Baxalta CEO comments  paragraphs 4  13 and 14)",
        "date": "08102015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-Shire steps up drive to get Baxalta talking after $30 bln bid "
    },
    {
        "content": "LONDON  Aug 10 Shire Chief Executive Flemming Ornskov is stepping up his campaign to get Baxalta  to the negotiating table as he pushes the benefits a $30 billion takeover offer to the U.S. biotech company's shareholders.",
        "date": "08102015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire CEO steps up drive to get Baxalta board talking "
    },
    {
        "content": "* Goes public with all-share offer after private approach rebuffed",
        "date": "08042015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 5-Drugmaker Shire bids $30 bln for Baxter spin-off Baxalta "
    },
    {
        "content": "LONDON  Aug 5 Shire Chief Executive Flemming Ornskov will need to dig deeper in his pocket if he wants to win U.S. biotech company Baxalta.",
        "date": "08052015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire seen having to sweeten $30 billion offer to win Baxalta "
    },
    {
        "content": "* Indexes down: Dow 0.21 pct  S&P 0.16 pct  Nasdaq 0.22 pct   (Updates to early afternoon)",
        "date": "08042015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "US STOCKS-Wall St lower as Apple slips to 6-month low "
    },
    {
        "content": "LONDON  Aug 4 Top UK shares ended Tuesday on a flat note  with the market pegged back by a mixed bag of corporate earnings and a $30-billion bid from drugmaker Shire  to buy rival Baxalta.",
        "date": "08042015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Earnings-day blues  Shire bid leave UK shares flat "
    },
    {
        "content": "Aug 5 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08052015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "PRESS DIGEST- New York Times business news - Aug 5 "
    },
    {
        "content": "* Indexes down: Dow 0.07 pct  S&P 0.08 pct  Nasdaq 0.23 pct   (Adds details  comment  updates prices)",
        "date": "08042015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "US STOCKS-Wall St falls as Apple slips to 6-month low "
    },
    {
        "content": "* Indexes up: Dow 0.02 pct  S&P 0.04 pct  Nasdaq 0.05 pct   (Updates to open)",
        "date": "08042015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "US STOCKS-Wall St flat amid slew of earnings  Apple weighs "
    },
    {
        "content": "* Futures: Dow up 13 pts  S&P little changed  Nasdaq down 4 pts   (Adds details  comment  updates prices)",
        "date": "08042015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "US STOCKS-Wall St set to open little changed amid earnings "
    },
    {
        "content": "LONDON  Aug 4 London-listed pharmaceutical group Shire said it was seeking to buy U.S. firm Baxalta  in a $30 billion all-share deal to create a global specialist in medicines treating rare diseases with sales of $20 billion by 2020.",
        "date": "08042015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire proposes $30 bln all-share tie-up with Baxalta "
    },
    {
        "content": "Pharmaceutical company Shire Plc said it had bought New York-based Foresight Biotherapeutics Inc for $300 million in cash  gaining access to a late-stage therapy being developed for the treatment of pink eye.",
        "date": "08032015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire buys US company to access experimental pink eye treatment "
    },
    {
        "content": "Pharmaceutical company Shire Plc  said it had bought New York-based Foresight Biotherapeutics Inc for $300 million in cash  gaining access to a late-stage therapy being developed for the treatment of pink eye.",
        "date": "08032015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire buys U.S. company to access experimental pink eye treatment "
    },
    {
        "content": "Aug 3 Pharmaceutical company Shire Plc  said it had bought New York-based Foresight Biotherapeutics Inc for $300 million in cash  gaining access to a late-stage therapy being developed for the treatment of pink eye.",
        "date": "08032015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-Shire buys US company to access experimental pink eye treatment "
    },
    {
        "content": "Aug 3 Pharmaceuticals company Shire Plc  said it had bought New York-based Foresight Biotherapeutics Inc for $300 million  gaining access to a late-stage therapy being developed for the treatment of infectious conjunctivitis known as pink eye.",
        "date": "08032015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire buys U.S.-based Foresight Biotherapeutics Inc for $300 mln "
    },
    {
        "content": "* Shares down 1.5 pct   (Adds CEO comments  analyst reaction  shares)",
        "date": "07232015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 1-Shire takes Q2 earnings pain for long-term gain "
    },
    {
        "content": "LONDON  July 23 Shire  the London-listed maker of drugs to treat hyperactivity and rare diseases  missed market expectations for second-quarter earnings after lower sales of its ADHD drug Intuniv following the introduction of generic competition.",
        "date": "07232015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire misses Q2 earnings forecast  raises outlook "
    },
    {
        "content": "* Achieved a clinical milestone in its worldwide licensing and collaboration agreement with Shire Plc",
        "date": "06152015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Armagen achieves milestone in Shire collaboration trial "
    },
    {
        "content": "* Appointment of Bill Mordan as general counsel and corporate secretary  reporting to CEO Flemming Ornskov",
        "date": "06152015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire appoints Bill Mordan to executive committee "
    },
    {
        "content": "* Olivier will also be a member of science & technology committee of Shire board",
        "date": "06112015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire appoints Olivier Bohuon to its board of directors "
    },
    {
        "content": "LONDON Pharmaceutical company Shire  is considering a 12 billion pound ($18.32 billion) takeover of Actelion Ltd  Europe's biggest biotech firm  Britain's Sunday Times newspaper reported  citing unnamed sources.",
        "date": "06072015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire considers takeover of Swiss biotech group Actelion: Sunday Times "
    },
    {
        "content": "LONDON  June 7 Pharmaceutical company Shire  is considering a 12 billion pound ($18.32 billion) takeover of Actelion Ltd Europe's biggest biotech firm  Britain's Sunday Times newspaper reported  citing unnamed sources.",
        "date": "06072015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire considers takeover of Swiss biotech group Actelion- Sunday Times "
    },
    {
        "content": "* Shire receives european approval to use Resolor(prucalopride) in men for symptomatic treatment of chronic constipation",
        "date": "06032015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire gets European approval to use Resolor to treat chronic constipation in men "
    },
    {
        "content": "* Shire a serial acquirer; Actelion unwilling seller in past   (Adds Breakingviews link)",
        "date": "06082015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 4-Swiss biotech Actelion hits record high on potential Shire bid "
    },
    {
        "content": "LONDON  June 8 Britain's top share index edged lower and finished near the previous session's two-week low  with sharp gains in Diageo on a reported takeover interest offset by weaker firms like Shire and GKN",
        "date": "06082015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Britain's FTSE edges lower at close  Diageo surges "
    },
    {
        "content": "LONDON  June 8 Britain's top share index steadied on Monday  with gains in Diageo on a reported takeover interest offset by weaker firms like Shire  which fell on another report saying it was considering an $18 billion takeover of Actelion.",
        "date": "06082015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "FTSE steadies around 2-month low  Diageo shares surge "
    },
    {
        "content": "LONDON  June 8 Britain's top share index steadied on Monday  with gains in Diageo on a reported takeover interest offset by weaker firms like Shire that fell on another report saying it was considering a $18 billion takeover of Actelion.",
        "date": "06082015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Britain's FTSE steadies near 2-month low  Diageo surges "
    },
    {
        "content": "* Shire dips after Sunday Times says considering Actelion bid",
        "date": "06082015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "CORRECTED-UK FTSE rises from two-month low on Diageo M&A talk "
    },
    {
        "content": "* Shares up 2.8 percent   (Adds CEO comments  analyst reaction  shares)",
        "date": "04302015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 1-Binge eating drug helps Shire deliver first-quarter earnings beat "
    },
    {
        "content": "* Jeff has served as interim cfo since december 2014  while overseeing investor relations  Source text for Eikon:  Further company coverage:",
        "date": "04302015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire names Jeff Poulton as CFO "
    },
    {
        "content": "LONDON  April 7 Pharmaceutical firm Shire  said on Tuesday it had agreed with U.S. regulators the steps it would take to submit a candidate drug to treat hyperactivity in adults for clearance.",
        "date": "04072015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire agrees regulatory path for ADHD drug for adults "
    },
    {
        "content": "* FDA is expected to provide a decision on October 25  2015  based on prescription drug user fee act v action date  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +44 207 542 1810)",
        "date": "04092015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "BRIEF-Shire says U.S. FDA grants priority review to lifitegrast NDA "
    },
    {
        "content": "LONDON  April 10 Britain's top equity index sprinted to new record highs on Friday  as real-estate stocks extended gains from a rebound in property prices and drugmaker Shire got a lift from a positive product review.",
        "date": "04102015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UK's FTSE races to new record high as Shire shines "
    },
    {
        "content": "* Topline results from first of three placebo-controlled phase 2 studies of shp625 (lum001) in children with alagille syndrome",
        "date": "04092015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire's Alagille syndrome drug does not meet study goal "
    },
    {
        "content": "LONDON  April 10 Britain's top equity index advanced on Friday  nearing record highs  as real-estate stocks extended gains from a rebound in property prices and drugmaker Shire got a lift from a positive product review.",
        "date": "04102015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Britain's FTSE nears record high as Shire shines "
    },
    {
        "content": "LONDON  April 10 Britain's top equity index advanced on Friday  nearing record highs  as real-estate stocks extended gains from a rebound in property prices and drugmaker Shire got a lift from a positive product review.",
        "date": "04102015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Britain's FTSE nears record high as real estate prospers "
    },
    {
        "content": "LONDON  April 10 Top UK shares rose on Friday  nearing all-time highs as real-estate stocks extended gains from a rebound in property prices and drugmaker Shire got a lift from a priority drug review in the United States.",
        "date": "04102015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Britain's FTSE nears all-time high as real estate prospers "
    },
    {
        "content": "NEW YORK AbbVie Inc chief Richard Gonzalez fought two other drugmakers to \"the bitter end\" to buy Pharmacyclics Inc  for its hot-selling Imbruvica cancer drug  but may have a harder time convincing investors it is worth $21 billion.",
        "date": "03052015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "AbbVie CEO defends Pharmacyclics deal to skeptical investors "
    },
    {
        "content": "Feb 23 The following bids  mergers  acquisitions and disposals were reported by 2115 GMT on Monday:",
        "date": "02232015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Rare disease drugmaker PTC Therapeutics Inc  is exploring a potential sale amid takeover interest from several pharmaceutical companies  including Shire Plc  and BioMarin Pharmaceutical Inc   according to people familiar with the matter.",
        "date": "02232015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Exclusive: Rare disease drugmaker PTC Therapeutics explores sale - sources "
    },
    {
        "content": "NEW YORK  Feb 20 Valeant Pharmaceuticals International Inc is close to a $10.2 billion deal to acquire gastrointestinal drugmaker Salix Pharmaceuticals Ltd   according to a person directly familiar with the matter.",
        "date": "02202015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "UPDATE 2-Drugmaker Valeant close to buying Salix - source "
    },
    {
        "content": "LONDON Dublin-based drugmaker Shire  said on Tuesday it had bought U.S. firm Meritage Pharma for at least $70 million  boosting its gastrointestinal drugs business.",
        "date": "02242015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire buys Meritage Pharma for at least $70 million "
    },
    {
        "content": "LONDON  Feb 24 Dublin-based drugmaker Shire  said on Tuesday it had bought U.S. firm Meritage Pharma for at least $70 million  boosting its gastrointestinal drugs business.",
        "date": "02242015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire buys Meritage Pharma for at least $70 mln "
    },
    {
        "content": "British pharmaceutical company Shire Plc  has taken initial steps towards a bid for U.S. bowel drugmaker Salix Pharmaceuticals Inc  and is working with advisers on a potential offer  according to people familiar with the matter.",
        "date": "02122015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Exclusive: Shire Plc moves to prepare Salix bid - sources "
    },
    {
        "content": "* Shares up 2.6 pct   (Adds CEO comments  analyst reaction  shares)",
        "date": "02122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-Shire confident on 2015 after NPS deal  binge-eating drug approval "
    },
    {
        "content": "Feb 12 Shire Plc chief executive on a conference call with reporters:",
        "date": "02122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "BRIEF-Shire declines to comment on any takeover targets "
    },
    {
        "content": "LONDON  Feb 12 Shire  the drugs company buying rare disease specialist NPS Pharma for $5.2 billion  posted a 17 percent rise in fourth-quarter earnings on Thursday  and said it expected profit to grow in the mid-single digits in 2015.",
        "date": "02122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire sees mid-single earnings growth in 2015 "
    },
    {
        "content": "LONDON  Jan 26 Shire Plc shares gained more than 3 percent on Monday following news U.S. regulators had approved NPS Pharmaceuticals Inc's drug Natpara  validating Shire's decision to buy NPS for $5.2 billion.",
        "date": "01262015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire shares jump as drug approval vindicates $5.2 bln NPS purchase "
    },
    {
        "content": "Jan 23 The U.S. Food and Drug Administration has approved NPS Pharmaceuticals Inc.'s drug Natpara to treat a rare hormone disorder  validating a bet by Shire Plc   which recently agreed to acquire NPS for $5.2 billion.",
        "date": "01242015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "FDA approves NPS drug  in move validating Shire takeover deal "
    },
    {
        "content": "Jan 23 The U.S. Food and Drug Administration has approved NPS Pharmaceuticals Inc's drug Natpara to treat a rare hormone disorder  validating a bet by Shire Plc   which recently agreed to acquire NPS for $5.2 billion.",
        "date": "01242015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 1-U.S. FDA approves NPS drug  in move validating Shire takeover deal "
    },
    {
        "content": "LONDON Shire Plc has agreed to buy NPS Pharmaceuticals Inc for $5.2 billion in its biggest acquisition yet  as the Dublin-based drugmaker strengthens its position in the lucrative field of medicines for rare diseases.",
        "date": "01112015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "Shire to buy NPS for $5.2 billion to boost rare disease drugs "
    },
    {
        "content": "* Indexes off: Dow 0.5 pct  S&P 0.8 pct  Nasdaq 0.8 pct   (Updates to close)",
        "date": "01122015",
        "name": "Shire plc",
        "news_type": "topStory",
        "symbol": "SHPG",
        "title": "US STOCKS-Wall St falls; energy shares dragged down further by oil "
    },
    {
        "content": "* CEO says doesn't prevent Shire from seeking other buys   (Adds NPS CEO comment)",
        "date": "01112015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "UPDATE 3-Shire to buy NPS for $5.2 bln to boost rare disease drugs "
    },
    {
        "content": "BOSTON Hedge fund Mason Capital lost 12 percent in 2014  making for one of the industry's biggest declines  after the New York-based firm was hit by a failed merger of pharmaceuticals companies Shire and AbbVie  a person familiar with the firm said in Monday.",
        "date": "01122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Exclusive: Hedge fund Mason Capital ends 2014 down 12 percent - source "
    },
    {
        "content": "Jan 11 Shire Plc  said it will acquire NPS Pharmaceuticals Inc in an all-stock transaction for about $5.2 billion  the companies said in a joint statement on Sunday.",
        "date": "01112015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "RPT-Shire to buy NPS Pharma for $5.2 bln "
    },
    {
        "content": "Jan 11 Shire Plc  said it will acquire NPS Pharmaceuticals Inc in an all-stock transaction for about $5.2 billion  the companies said in a joint statement on Sunday.",
        "date": "01112015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "CORRECTED-Shire to buy NPS Pharma for $5.2 bln "
    },
    {
        "content": "* Indexes off: Dow 0.7 pct  S&P 0.9 pct  Nasdaq 0.9 pct   (Updates to late afternoon trading  changes byline)",
        "date": "01122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "US STOCKS-Wall St falls as energy weakness drags on "
    },
    {
        "content": "* Indexes off: Dow 0.6 pct  S&P 0.8 pct  Nasdaq 0.8 pct   (Updates to afternoon trading  changes byline)",
        "date": "01122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "US STOCKS-Wall St falls  led by decline in energy shares "
    },
    {
        "content": "LONDON Shire Plc has agreed to buy U.S. group NPS Pharmaceuticals Inc for $5.2 billion  the Dublin-based drugmaker's biggest acquisition yet as it seeks to strengthen  its position in the lucrative field of medicines for rare diseases. | Video ",
        "date": "01122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire to buy NPS for $5.2 billion to boost rare disease drugs "
    },
    {
        "content": "* Indexes off: Dow 0.46 pct  S&P 0.71 pct  Nasdaq 0.69 pct   (Updates to late morning)",
        "date": "01122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "US STOCKS-Wall Street falls as oil prices drag "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Shire is gambling its AbbVie break fee on risky M&A. The Dublin-based pharma group has agreed to buy U.S. peer NPS to expand in lucrative rare drugs. The 51 percent premium is covered almost entirely by compensation from the collapse of Shire's sale to larger American rival AbbVie last year. That doesn't much mitigate the risk of doing a deal ahead of a key regulatory ruling.",
        "date": "01122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Breakingviews: Shire gambles AbbVie break fee on risky $5 bln deal "
    },
    {
        "content": "LONDON Shire Plc has agreed to buy U.S. group NPS Pharmaceuticals Inc for $5.2 billion  the Dublin-based drugmaker's biggest acquisition yet as it seeks to strengthen  its position in the lucrative field of medicines for rare diseases.",
        "date": "01122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "Shire to buy NPS for $5.2 bln to boost rare disease drugs "
    },
    {
        "content": "* Indexes off: Dow 0.49 pct  S&P 0.55 pct  Nasdaq 0.41 pct   (Updates to market open)",
        "date": "01122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "US STOCKS-Wall Street falls as oil prices weigh on energy sector "
    },
    {
        "content": "* Futures up: Dow 27 pts  S&P 2.75 pts  Nasdaq 8 pts   (Adds quote  updates prices)",
        "date": "01122015",
        "name": "Shire plc",
        "news_type": "normal",
        "symbol": "SHPG",
        "title": "US STOCKS-Wall Street set to open flat ahead of earnings "
    }
]