[
    {
        "content": "* ‍Q3 net revenues increased 61% year over year to $443.1 million ​",
        "date": "11072017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Sina Corp Q3 earnings per share $0.66 "
    },
    {
        "content": "* Sina Corp says urged shareholders to vote \"for\" re-election of Sina nominee  Yichen Zhang  and \"against\" each of Aristeia's nominees​ Source text for Eikon: Further company coverage: ( Bangalore.newsroom@thomsonreuters.com )",
        "date": "10262017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Sina Corp urges shareholders to vote \"for\" re-election of its nominee "
    },
    {
        "content": "* ‍Aristeia Capital Llc - sent letter to Sina Corp shareholders in connection with Aristeia's nomination of candidates for election to co's board Source text for Eikon: Further company coverage:",
        "date": "10232017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-‍Aristeia Capital sends letter to Sina Corp's shareholders "
    },
    {
        "content": "* Sina says ‍board unanimously recommends that shareholders vote \"for\" Yichen Zhang & vote \"against\" each of Aristeia's nominee​s at annual general meeting Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "10182017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Sina says ‍board unanimously recommends that shareholders vote \"for\" Yichen Zhang "
    },
    {
        "content": "* ISS RECOMMENDS THAT SINA SHAREHOLDERS VOTE \"FOR\" THE ELECTION OF YICHEN ZHANG",
        "date": "10202017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-ISS RECOMMENDS SINA SHAREHOLDERS VOTE \"FOR\" ELECTION OF YICHEN ZHANG "
    },
    {
        "content": "* Remark Holdings' 3D augmented reality chosen to be core technology behind launch of sina weibo's new mobile application",
        "date": "10132017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Remark Holdings' 3D augmented reality chosen to be core technology behind launch of Sina Weibo's new mobile application "
    },
    {
        "content": "* Urges shareholders to vote for election of Yichen Zhang and vote against election of each of Aristeia's board nominees​ Source text for Eikon: Further company coverage:",
        "date": "10102017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-‍SINA Corp asks shareholders to vote against Aristeia Capital board nominees​ "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - China's Sina is only likely to produce a qualified victory for activists. U.S. hedge fund manager Aristeia Capital wants the $8 billion web group to consider a sale or a merger with subsidiary Weibo. The former would never get past Chief Executive and Chairman Charles Chao  and the latter is a bad idea. But Chao could compromise by expanding the board  stepping up buybacks and handing out more Weibo shares.",
        "date": "09292017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "Breakingviews - Expect buybacks but not M&A from China's Sina "
    },
    {
        "content": "* US fund seeks two directors in Chinese media company's board",
        "date": "09192017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "U.S. hedge fund seeks Sina board seats  pushes for sale to Weibo "
    },
    {
        "content": "* Sina confirms receipt of nominations from Aristeia Capital Source text for Eikon: Further company coverage:",
        "date": "09192017",
        "name": "Sina Corporation",
        "news_type": "normal",
        "symbol": "SINA",
        "title": "BRIEF-Sina confirms receipt of nominations from Aristeia Capital "
    },
    {
        "content": "* Owning about 3 million shares of Sina issued statement on decision to nominate two independent candidates for election to Sina's board",
        "date": "09182017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Aristeia Capital nominates two independent candidates for election to Sina's board "
    },
    {
        "content": "* Q2 earnings per share view $0.57 -- Thomson Reuters I/B/E/S",
        "date": "08092017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Sina reports Q2 non-GAAP earnings per share $0.70 "
    },
    {
        "content": "* Yintech to form joint venture with Sina Source text for Eikon: Further company coverage:",
        "date": "07072017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Yintech to form joint venture with Sina "
    },
    {
        "content": "* Sina Corp -based on 71.4 million ordinary shares of sina outstanding as of june 7  sina will distribute 7.1 million class a shares of weibo to sina shareholders",
        "date": "06082017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Sina announces details of distribution of Weibo shares "
    },
    {
        "content": "* Sina Corp - ‍board has authorized and approved company's distribution of shares of Weibo Corp to company's shareholders on a pro rata basis​",
        "date": "05262017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Sina Corp announces distribution of Weibo shares "
    },
    {
        "content": "* Says it will change name to SRS HOLDINGS CO. LTD.  effective Oct. 1",
        "date": "05122017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Sato Restaurant Systems to change name to SRS HOLDINGS "
    },
    {
        "content": "* Shenzhen stock exchange's information unit  Euronext and Sina sign MOU to jointly develop internet big data  cross-border index products - Shenzhen stock exchange",
        "date": "04112017",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Shenzhen Stock Exchange's unit  Euronext and Sina sign MOU "
    },
    {
        "content": "* Quarterly advertising revenues grew 21% year over year to $233.6 million.",
        "date": "11212016",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-SINA Corp reports Q3 earnings per share $1.90 "
    },
    {
        "content": "* Sina will distribute one Weibo class A ordinary share to holder of each ten Sina ordinary shares",
        "date": "08312016",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Sina announces distribution of Weibo shares "
    },
    {
        "content": "Aug 31 ChineseAll Digital Publishing Group Co Ltd",
        "date": "08312016",
        "name": "Sina Corporation",
        "news_type": "normal",
        "symbol": "SINA",
        "title": "BRIEF-ChineseAll Digital Publishing plans to acquire stakes in Sina's online bookstore "
    },
    {
        "content": "* Sina corp qtrly net revenues increased 8% year over year to $198.7 million",
        "date": "05112016",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Sina Q1 earnings per share $0.22 "
    },
    {
        "content": "BEIJING  Feb 28 China's cyberspace watchdog said on Sunday it had ordered the closure of a microblog account of a former property tycoon  known for his bold remarks on China's economic policy  for \"spreading illegal information\".",
        "date": "02282016",
        "name": "Sina Corporation",
        "news_type": "normal",
        "symbol": "SINA",
        "title": "China Internet watchdog bans former tycoon's microblog "
    },
    {
        "content": "* Announced a ground breaking deal with Sina Sports  number one digital media platform for sports fans in China\u007f",
        "date": "01072016",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Manchester United says reached deal with Sina Sports for MUTV in China "
    },
    {
        "content": "BEIJING  April 10 China will punish web portal and social media firm Sina Corp after it was identified as operating the most complained about major website in the country  the Internet regulator said on Friday  the latest blow in an ongoing online crackdown.",
        "date": "04102015",
        "name": "Sina Corporation",
        "news_type": "normal",
        "symbol": "SINA",
        "title": "China to punish Internet firm Sina over series of complaints "
    },
    {
        "content": "* Says in strategic cooperation with Sina Corp on online and big data development",
        "date": "04072015",
        "name": "Sina Corporation",
        "news_type": "topStory",
        "symbol": "SINA",
        "title": "BRIEF-Dongxing Securities  Sina in strategic cooperation "
    },
    {
        "content": "SHANGHAI  April 7 China's Dongxing Securities  said it had formed an Internet banking partnership with Sina Corp  operator of a major web portal and microblogging service Weibo Corp.",
        "date": "04072015",
        "name": "Sina Corporation",
        "news_type": "normal",
        "symbol": "SINA",
        "title": "Dongxing Securities  Sina to partner on Internet banking "
    }
]