[
    {
        "content": "* ‍Mackenzie Financial Corp reports 10.02 percent passive stake in Shaw Communications inc as on October 31  2017 - SEC filing​ Source text: (http://bit.ly/2zBhOv2) Further company coverage:",
        "date": "11132017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "BRIEF-‍Mackenzie Financial reports 10.02 percent passive stake in Shaw Communications "
    },
    {
        "content": "TORONTO  Oct 26 Canadian cable company Shaw Communications Inc reported a 2.6 percent increase in revenue on Thursday but paid heavily to add wireless and internet subscribers  squeezing its margins.",
        "date": "10262017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "UPDATE 2-Shaw Communications revenue rises  but so do costs "
    },
    {
        "content": "Oct 26 Canadian telecom company Shaw Communications Inc reported a 2.6 percent increase in revenue on Thursday as it added more wireless and internet subscribers.",
        "date": "10262017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CORRECTED-UPDATE 1-Shaw Communications revenue rises on higher subscriptions "
    },
    {
        "content": "* Shaw announces fourth quarter and full year fiscal 2017 results",
        "date": "10262017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "BRIEF-Shaw reports Q4 EPS $0.96‍​ "
    },
    {
        "content": "Oct 26 Canadian telecoms company Shaw Communications Inc's fourth-quarter profit more than tripled  helped by a C$330 million gain on the sale of its subsidiary ViaWest Inc.",
        "date": "10262017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Shaw Communications profit rises on asset sale gain "
    },
    {
        "content": "Oct 17 Canadian media company Corus Entertainment Inc said on Tuesday it would sell French-language specialty channels Historia and Séries+ to BCE Inc's unit Bell Media for about C$200 million ($159.71 million).",
        "date": "10172017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Corus Entertainment to sell channels to Bell Media for C$200 mln "
    },
    {
        "content": "June 28 Shaw Communications Inc on Wednesday reported strong quarterly subscriber gains at its revamped cable business and notched wireless profit growth even as it spent heavily to build up both businesses.",
        "date": "06282017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "UPDATE 1-Shaw Communications' adds cable customers for first time since 2010 "
    },
    {
        "content": "June 28 Shaw Communications Inc's said on Wednesday its quarterly profit from continuing operations more than doubled  boosted by wireless subscriber gains even as it spent heavily to build up the business.",
        "date": "06282017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Shaw Communications profit from cont ops more than doubles "
    },
    {
        "content": "* Qtrly earnings per share c$0.27 Source text for Eikon: Further company coverage:",
        "date": "06282017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "BRIEF-Shaw reports qtrly EPS c$0.27 "
    },
    {
        "content": "TORONTO  June 13 Canada's main stock index inched lower on Tuesday  weighed by slips among heavyweight financial stocks and losses for some base metal miners  while Shaw Communications Inc gained after deals to sell its data center business and buy wireless airwaves.",
        "date": "06132017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "CANADA STOCKS-TSX slips with financials  miners; Shaw shines "
    },
    {
        "content": "June 13 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06132017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "TORONTO  June 13 Canada's main stock index ended barely lower on Tuesday  with a sharp jump in shares of Shaw Communications Inc on deals to sell data centers and buy wireless airwaves was offset by losses for financial stocks and some base metal miners.",
        "date": "06132017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CANADA STOCKS-TSX ends barely lower as Shaw's jump offset by financials "
    },
    {
        "content": "TORONTO Canada's Shaw Communications Inc said on Tuesday it would sell its data center subsidiary ViaWest Inc to Peak 10 Holding Corp for $1.675 billion  using some of the proceeds to buy airwaves to boost its new wireless unit.",
        "date": "06132017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Canada's Shaw sells data center company ViaWest  buys wireless airwaves "
    },
    {
        "content": "TORONTO  June 13 Canada's main stock index fell on Tuesday as heavyweight banking  energy and mining stocks weighed  while Shaw Communications Inc jumped after announcing deals to sell its data center business and buy wireless airwaves.",
        "date": "06132017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CANADA STOCKS-TSX falls with resources  banks; Shaw shines "
    },
    {
        "content": "TORONTO  June 13 Canada's Shaw Communications Inc said on Tuesday it would sell its data center subsidiary ViaWest Inc to Peak 10 Holding Corp for $1.675 billion  using some of the proceeds to buy airwaves to boost its new wireless unit.",
        "date": "06132017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 2-Canada's Shaw sells data center company ViaWest  buys wireless airwaves "
    },
    {
        "content": "TORONTO  June 13 Canada's main stock index slipped in early trade on Tuesday as natural resource stocks weighed  while Shaw Communications Inc jumped after selling its data center business and buying wireless airwaves.",
        "date": "06132017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CANADA STOCKS-TSX slips as resource stocks weigh; Shaw jumps "
    },
    {
        "content": "* Press release - ViaWest to combine with Peak 10  creating a leading full-service hybrid it solutions provider",
        "date": "06132017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "BRIEF-Canada's Shaw to sell ViaWest to Peak 10 Holding "
    },
    {
        "content": "* Shaw Communications Inc. Announces sale of Viawest to Peak 10 for approximately c$2.3 billion",
        "date": "06132017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "BRIEF-Canada's Shaw to sell Viawest to Peak 10 Holding for about C$2.3 bln "
    },
    {
        "content": "June 13 Canada's Shaw Communications Inc said on Tuesday that it would sell its subsidiary ViaWest Inc to Peak 10 Holding Corp for about C$2.3 billion  as the cable company looks to streamline its operations.",
        "date": "06132017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Canada's Shaw to sell Viawest to Peak 10 Holding "
    },
    {
        "content": "* Omnitracs to acquire the assets of shaw tracking  expand canadian presence",
        "date": "06012017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "BRIEF-Omnitracs to acquire the assets of Shaw Tracking "
    },
    {
        "content": "May 1 Stock futures pointed to a muted opening for Canada's main stock index on Monday after U.S. congressional negotiators agreed on a spending package deal to keep the federal government funded through September  averting a government shutdown.",
        "date": "05012017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CANADA STOCKS-TSX futures flat as U.S. avoids government shutdown "
    },
    {
        "content": "Shaw Communications  is looking for a buyer for ViaWest  the U.S. data center company it bought three years ago  according to people familiar with the matter  as the Canadian cable company continues to shed assets it considers non-core.",
        "date": "04282017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Shaw Communications explores selling ViaWest: sources "
    },
    {
        "content": "* Shaw Communications restores internet and phone services after brief outage",
        "date": "04272017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "BRIEF-Shaw Communications restores internet and phone services after brief outage "
    },
    {
        "content": "April 28 Shaw Communications is looking for a buyer for ViaWest  the U.S. data center company it bought three years ago  according to people familiar with the matter  as the Canadian cable company continues to shed assets it considers non-core.",
        "date": "04282017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Shaw Communications explores selling ViaWest-sources "
    },
    {
        "content": "* Co  Corus Entertainment says new funding model providing Global News additional resources to support local news coverage  reporting",
        "date": "04262017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "BRIEF-Shaw Communications & Corus Entertainment announce new funding model to support local news "
    },
    {
        "content": "Canada's Shaw Communications Inc  reported a 13.3 percent rise in quarterly revenue on Wednesday  as it added more wireless customers and said Alek Krstajic would be stepping down as chief executive of its wireless unit.",
        "date": "04122017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Shaw Communications revenue rises on wireless customer additions "
    },
    {
        "content": "* Paul McAleese appointed COO of Freedom Mobile (Adds details)",
        "date": "04122017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 2-Shaw Communications revenue rises on wireless customer additions "
    },
    {
        "content": "April 12 Canada's Shaw Communications reported a 13.3 percent rise in quarterly revenue on Wednesday  driven by the addition of more wireless customers.",
        "date": "04122017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Shaw Communications posts 13.3 pct rise in revenue "
    },
    {
        "content": "* Shaw communications inc - Shaw confirms at this time that there are no changes to our previously issued fiscal 2017 guidance",
        "date": "04122017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "BRIEF-Shaw Communications qtrly earnings per share $0.30 "
    },
    {
        "content": "* Its OpenTV  Inc. and Nagravision S.A. subsidiaries have filed a patent infringement suit against Shaw Communications  Inc. In federal court of Canada  Source text for Eikon:  Further company coverage:   (Gdynia Newsroom)",
        "date": "03022017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "BRIEF-Kudelski says OpenTV and Nagravision suit against Shaw Communications "
    },
    {
        "content": "TORONTO Canada's Shaw Communications Inc  posted a sharp fall in quarterly profit on Thursday  mostly due to the cost of shutting down a video streaming joint venture  while its shares fell on worries about slower wireless growth.",
        "date": "01122017",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Shaw Communications shares fall as wireless growth slips "
    },
    {
        "content": "TORONTO  Jan 11 Canada's Shaw Communications Inc  announced a voice-controlled television product on Wednesday that it hopes will help it stem years of market share losses to western Canadian telecom rival Telus Corp.",
        "date": "01112017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Canada's Shaw turns to Comcast technology to regain market share "
    },
    {
        "content": "TORONTO  Jan 12 Canada's Shaw Communications Inc  posted a sharp fall in quarterly profit on Thursday  mostly due to the cost of shutting down a video streaming joint venture  while its shares fell on worries about slower wireless growth.",
        "date": "01122017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 2-Shaw Communications shares fall as wireless growth slips "
    },
    {
        "content": "Jan 12 Canada's Shaw Communications Inc  reported a 59.2 pct fall in quarterly profit on Thursday  mainly due to a charge related to the winding down of its investment in video streaming service Shomi.",
        "date": "01122017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Shaw Communications profit more than halves on JV wind down charge "
    },
    {
        "content": "Jan 11 Canadian media company Corus Entertainment Inc's quarterly revenue more than doubled as it added more subscribers and gained from its 2016 acquisition of media assets from sister company Shaw Communications Inc.",
        "date": "01112017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Canadian media company Corus' quarterly revenue more than doubles "
    },
    {
        "content": "* Shaw communications inc qtrly basic and diluted earnings per share c$18",
        "date": "01122017",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "BRIEF-Shaw announces first quarter results "
    },
    {
        "content": "Nov 2 Shaw Communications Inc   reported a smaller-than-expected quarterly profit  largely due to costs associated with the launch of its low-priced internet service.",
        "date": "11022016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "UPDATE 1-Shaw Communications profit misses estimates as costs rise "
    },
    {
        "content": "Nov 2 Shaw Communications Inc   reported a 44 percent fall in quarterly profit from a year ago  when it recorded a gain on the sale of spectrum licenses.",
        "date": "11022016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Shaw Communications posts 44 pct fall in profit "
    },
    {
        "content": "Oct 19 Canadian media company Corus Entertainment Inc reported a sharp drop in quarterly profit as it digested Shaw Communications Inc's media business  which it acquired in a C$2.65 billion ($2.03 billion) deal in January.",
        "date": "10192016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Corus Entertainment reports sharp drop in profit "
    },
    {
        "content": "* Press release - Stingray extends long-term distribution agreement with Shaw Communications  adds four specialty music video TV channels",
        "date": "10132016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "BRIEF-Stingray extends distribution agreement with Shaw Communications "
    },
    {
        "content": "TORONTO Shaw Communications Inc's  third-quarter profit more than tripled  boosted by its purchase of Wind Mobile and sale of media assets  but earnings from ongoing operations disappointed and its shares fell on Friday.",
        "date": "07152016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Shaw's ongoing operations disappoint  Wind Mobile buy helps "
    },
    {
        "content": "TORONTO  July 15 Shaw Communications Inc's  third-quarter profit more than tripled  boosted by its purchase of Wind Mobile and sale of media assets  but earnings from ongoing operations disappointed and its shares fell on Friday.",
        "date": "07152016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 2-Shaw's ongoing operations disappoint  Wind Mobile buy helps "
    },
    {
        "content": "July 15 Shaw Communications Inc's  quarterly profit more than tripled  boosted by the purchase of wireless company Wind Mobile and a gain from the sale of its media assets to Corus Entertainment Inc.",
        "date": "07152016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Shaw profit triples as Wind Mobile purchase helps "
    },
    {
        "content": "Canadian media company Corus Entertainment Inc  reported a better-than-expected revenue  helped by the launch of new specialty television services and increased digital distribution revenues.",
        "date": "04132016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Corus Entertainment revenue beats on strong TV business "
    },
    {
        "content": "Canada's Shaw Communications Inc  posted a 3 percent rise in quarterly revenue as it added more retail Internet customers.",
        "date": "04142016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Shaw Communications posts slight rise in quarterly revenue "
    },
    {
        "content": "April 14 Canada's Shaw Communications Inc  posted a 3 percent rise in quarterly revenue as it added more retail Internet customers.",
        "date": "04142016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 1-Shaw Communications posts slight rise in quarterly revenue "
    },
    {
        "content": "TORONTO  April 14 Canada's Shaw Communications Inc posted a 3 percent rise in quarterly revenue as it added more retail Internet customers.",
        "date": "04142016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CORRECTED-Shaw Communications posts slight rise in quarterly revenue "
    },
    {
        "content": "* Shaw communications sees 2016 consolidated capital investment for consumer business network services business infrastructure services  combined $995 million",
        "date": "04142016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "BRIEF-Shaw Communications Q2 earnings c$0.32/shr "
    },
    {
        "content": "* No tangible benefits will be required for deal  nor will any new broadcasting licences be issued for any of services that are transferred",
        "date": "03232016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "BRIEF-CRTC approves transfer of shares held by Shaw Communications in Shaw Media to Corus Entertainment "
    },
    {
        "content": "March 8 Canada's main stock index looked set to open lower on Tuesday after another batch of weak data from China stoked concerns about the health of the global economy.",
        "date": "03082016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CANADA STOCKS-Futures lower after weak Chinese data "
    },
    {
        "content": "TORONTO  March 9 Minority shareholders in Corus Entertainment Inc voted on Wednesday in favor of the media company's planned C$2.65 billion purchase of Shaw Media from its sister company Shaw Communications Inc.",
        "date": "03092016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Corus investors vote in favor of Shaw Media purchase "
    },
    {
        "content": "TORONTO  March 9 Minority shareholders in Corus Entertainment Inc voted on Wednesday in favor of the media company's planned C$2.65 billion ($1.99 billion) purchase of Shaw Media from its sister company Shaw Communications Inc .",
        "date": "03092016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 1-Corus investors vote in favor of Shaw Media purchase "
    },
    {
        "content": "TORONTO A major Canadian securities regulator on Monday ruled that Corus Entertainment Inc need not disclose more details of its C$2.65 billion ($2 billion) proposal to buy media assets from Shaw Communications Inc  meaning a shareholder vote due on Wednesday could proceed.",
        "date": "03072016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Canada's Corus need not reveal more on Shaw media deal: regulator "
    },
    {
        "content": "March 7 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "03072016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TORONTO  March 7 A major Canadian securities regulator on Monday ruled that Corus Entertainment Inc  did not need to disclose more details on its C$2.65 billion ($2 billion) deal to buy media assets from Shaw Communications Inc   meaning a shareholder vote due on Wednesday can proceed.",
        "date": "03072016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Corus need not disclose more on Shaw media deal -Canadian regulator "
    },
    {
        "content": "TORONTO Corus Entertainment Inc's minority shareholders are set to approve its C$2.65 billion ($2 billion) bid for Shaw Communications Inc's media assets  despite vocal opposition from private equity firm Catalyst Capital  according to two sources familiar with the situation.",
        "date": "03042016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Exclusive: Corus set to win shareholder vote for C$2.65 billion media deal - sources "
    },
    {
        "content": "March 7 Canada's main stock index was poised to open lower after scaling a new high for 2016 in the previous session and a 3.2 percent gain over the week.",
        "date": "03072016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CANADA STOCKS-Futures suggest lower opening to week "
    },
    {
        "content": "TORONTO  March 4 Canadian fund Catalyst Capital  which has been critical of Corus Entertainment Inc's  C$2.65 billion acquisition of Shaw Communication's  media assets  on Friday issued an open letter calling on the Shaw family that controls both entities to prove that the asset was sold in a fair  competitive process.",
        "date": "03042016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Catalyst presses Shaw family for answers on media deal with Corus "
    },
    {
        "content": "TORONTO  Feb 23 Corus Entertainment Inc  could face a shareholder revolt against plan by its controlling family to buy media assets from a related company  Shaw Communications Inc  a wrinkle that could also complicate Shaw's wireless strategy.",
        "date": "02232016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Investor opposes Shaw-Corus deal  Corus vote due March 9 "
    },
    {
        "content": "TORONTO  Feb 4 A Canadian competition watchdog said on Thursday it will not challenge Shaw Communications Inc's  C$1.6 billion  ($1.16 billion) bid for Wind Mobile  the country's fourth-largest wireless provider.",
        "date": "02042016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Canada's Competition Bureau clears Shaw's acquisition of Wind Mobile "
    },
    {
        "content": "Canada's Shaw Communications Inc posted an unexpected 4 percent fall in first-quarter profit as a continued drop in television subscriptions offset a rise in internet accounts.",
        "date": "01142016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Shaw posts unexpected profit drop as it loses TV subscribers "
    },
    {
        "content": "Jan 14 Canada's Shaw Communications Inc  posted an unexpected 4 percent fall in first-quarter profit as a continued drop in television subscriptions offset a rise in internet accounts.",
        "date": "01142016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 2-Shaw posts unexpected profit drop as it loses TV subscribers "
    },
    {
        "content": "TORONTO Canada's Shaw Communications Inc said on Wednesday that it would sell its media unit to Corus Entertainment Inc for C$2.65 billion ($1.9 billion)  gaining funding for its Wind Mobile purchase and sending its shares up nearly 7 percent.",
        "date": "01132016",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Canada's Shaw Communications sells media arm to Corus for C$2.65 billion "
    },
    {
        "content": "Jan 14 Shaw Communications Inc on Thursday reported a 4 percent fall in first-quarter profit  as it continued to lose television subscribers  offsetting a rise in internet accounts.",
        "date": "01142016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Canada's Shaw Communications profit falls as it loses TV subscribers "
    },
    {
        "content": "TORONTO  Jan 13 Canada's Shaw Communications Inc  said on Wednesday that it would sell its media unit to Corus Entertainment Inc for C$2.65 billion ($1.9 billion)  gaining funding for its Wind Mobile purchase and sending its shares up nearly 7 percent.",
        "date": "01132016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 2-Canada's Shaw Communications sells media arm to Corus for C$2.65 bln "
    },
    {
        "content": "Jan 13    Shaw Communications Inc :  * Announces sale of Shaw media to Corus Entertainment Inc for $2.65 billion  * Upon closing  will receive about $1.85 billion in cash and approximately 71",
        "date": "01132016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CORRECTED-BRIEF-Shaw Communications announces sale of Shaw media to Corus Entertainment for $2.65 bln "
    },
    {
        "content": "Jan 13 Canadian media company Corus Entertainment Inc said it would buy Shaw Communications Inc's television unit Shaw Media Inc in a $2.65 billion cash-and-stock deal.",
        "date": "01132016",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Corus Entertainment to buy Shaw Media in $2.65 bln deal "
    },
    {
        "content": "Dec 16 Canadian cable-TV operator Shaw Communications Inc  said it has agreed to buy Mid-Bowline Group Corp and its subsidiary Wind Mobile Corp for about C$1.6 billion ($1.2 billion).",
        "date": "12162015",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Canada's Shaw Communications to buy Wind Mobile for C$1.6 bln "
    },
    {
        "content": "TORONTO  Dec 17 Cable company Shaw Communications Inc gutpunched its main telecom rival with a surprise offer to buy wireless operator Wind Mobile  sinking shares in Telus Corp on Thursday amid competition fears.",
        "date": "12172015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Telus shares sunk by rival Shaw's move on Wind "
    },
    {
        "content": "TORONTO  Dec 17 Canada's main stock index slipped on Thursday as telecom stocks weighed after Shaw Communications Inc said it planned to jump into wireless with a C$1.6 billion bid for recent entrant Wind Mobile.",
        "date": "12172015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CANADA STOCKS-TSX falls as telecoms drag after Shaw's Wind Mobile bid "
    },
    {
        "content": "VANCOUVER/TORONTO Canada's Shaw Communications Inc   said on Wednesday it has agreed to buy Wind Mobile  the country's fourth-largest wireless provider  in a deal that gives it a much-needed presence in the cellular market.",
        "date": "12172015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Shaw Communications eyes wireless in C$1.6 billion Wind Mobile bid "
    },
    {
        "content": "VANCOUVER/TORONTO  Dec 16 Canada's Shaw Communications Inc  said on Wednesday it has agreed to buy Wind Mobile  the country's fourth-largest wireless provider  in a deal that gives it a much-needed presence in the cellular market.",
        "date": "12172015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 2-Shaw Communications eyes wireless in C$1.6 bln Wind Mobile bid "
    },
    {
        "content": "TORONTO  Nov 5 BCE Inc posted a solid rise in third-quarter profit on Thursday  helped by its wireless customers spending more for service  the Canadian telecommunications company said.",
        "date": "11052015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 1-Canada's BCE posts profit rise on wireless spending "
    },
    {
        "content": "TORONTO  Oct 20 Shaw Communications Inc  reported a sharp jump in fourth-quarter profit on Thursday  helped by the sale of wireless airwaves and price increases  but shed large numbers of retail television customers and barely added consumer Internet subscribers.",
        "date": "10222015",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Profit up at Canada's Shaw on price hikes  asset sale; customers leave "
    },
    {
        "content": "* Says will raise Internet and TV product prices C$2-3/month effective August 1  Source text for Eikon:  Further company coverage:    (Reporting by Alastair Sharp)",
        "date": "06252015",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "BRIEF-Shaw Communications to raise Internet  TV product prices "
    },
    {
        "content": "TORONTO Rogers Communications Inc  scooped up a small rival and secured key airwaves through a series of deals on Wednesday that reinforced its position as Canada's largest wireless company  while also helping No. 4 operator Wind Mobile.",
        "date": "06242015",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Rogers adds subscribers  airwaves with Mobilicity  Shaw deals "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 25 (Fitch) Fitch Ratings believes the recent transactions  announced by Rogers Communications Inc. (Rogers) are neutral to its credit  profile. Importantly  Fitch expects Rogers will continue to maintain its current  trajectory to reduce leverage below 2.5x by 2017 through debt reduction and  EBITDA growth. Leverage at the end of the first quarter 2015 was 3.1x. The series of transactions include Rogers completing the prev",
        "date": "06252015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Fitch Views Rogers Transactions as Neutral to Ratings "
    },
    {
        "content": "TORONTO  June 24 Rogers Communications Inc  scooped up a small rival and secured key airwaves through a series of deals on Wednesday that reinforced its position as Canada's largest wireless company  while also helping No. 4 operator Wind Mobile.",
        "date": "06242015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 2-Rogers adds subscribers  airwaves with Mobilicity  Shaw deals "
    },
    {
        "content": "TORONTO  June 25 Canadian cable television provider Shaw Communications Inc reported an 8 percent fall in third-quarter profit on Thursday and said it would likely reach the lower end of its full-year operating income target.",
        "date": "06252015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 1-Shaw Communications loses customers  profit falls 8 pct in 3td qtr "
    },
    {
        "content": "TORONTO  June 25 Shaw Communications Inc  reported an 8 percent fall in third-quarter profit on Thursday and said it would likely reach the lower end of its full-year operating income target.",
        "date": "06252015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Canada's Shaw Communications posts 8 pct slip in profit "
    },
    {
        "content": "TORONTO  June 24 Rogers Communications Inc  has orchestrated a series of deals that will boost the quality of its mobile phone service  Canada's largest wireless operator said on Wednesday.",
        "date": "06242015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Canada's Rogers says to buy Mobilicity  Shaw airwaves "
    },
    {
        "content": "Canada's Shaw Communications Inc  reported a 24 percent drop in quarterly profit  hurt by a dip in the media and cable company's video subscriptions.",
        "date": "04142015",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Shaw Communications profit falls 24 percent as video demand dips "
    },
    {
        "content": "April 14 Canada's Shaw Communications Inc  reported a 24 percent drop in quarterly profit  hurt by a dip in the media and cable company's video subscriptions.",
        "date": "04142015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 1-Shaw Communications profit falls 24 pct as video demand dips "
    },
    {
        "content": "April 14 Canadian media and cable company Shaw Communications Inc reported a 24 percent drop in quarterly profit  hurt by a dip in the company's video subscriptions.",
        "date": "04142015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "Canada's Shaw Communications profit falls 24 pct "
    },
    {
        "content": "TORONTO  Feb 11 Canadian cable company Shaw Communications Inc said on Wednesday it will shut customer care facilities in its Alberta stronghold while beefing up facilities elsewhere  and offered 1 600 workers C$7 500 ($5 936) each to follow their jobs.",
        "date": "02112015",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Canada's Shaw Comms reorganizes service unit; to pay workers to move "
    },
    {
        "content": "TORONTO Canadian cable-TV operator Shaw Communications Inc reported a 7 percent drop in quarterly profit on Wednesday  hurt by a fall in video subscriptions and the costs of launching its new video streaming service.",
        "date": "01142015",
        "name": "Shaw Communications Inc",
        "news_type": "topStory",
        "symbol": "SJR",
        "title": "Shaw Communications profit drops on streaming startup costs "
    },
    {
        "content": "TORONTO  Jan 14 Canadian cable-TV operator Shaw Communications Inc  reported a 7 percent drop in quarterly profit on Wednesday  hurt by a fall in video subscriptions and the costs of launching its new video streaming service.",
        "date": "01142015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "UPDATE 1-Shaw Communications profit drops on streaming startup costs "
    },
    {
        "content": "Jan 14 Canadian cable TV operator Shaw Communications Inc  reported a 7 percent drop in first-quarter profit  hurt mainly by a fall in video subscriptions.",
        "date": "01142015",
        "name": "Shaw Communications Inc",
        "news_type": "normal",
        "symbol": "SJR",
        "title": "CORRECTED-Shaw Communications profit down as video subscriptions slip "
    }
]