[
    {
        "content": "* Entered into agreement with OUE Lippo Healthcare  SK Telecom  Seoul National University Bundang Hospital and Healthconnect Co​ Source text for Eikon: Further company coverage:",
        "date": "11142017",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "BRIEF-Healthway Medical Corp and OUE Lippo Healthcare patrners with SK Telecom  SNUBH and Healthconnect Co​ "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  October 23 (Fitch) Fitch Ratings has affirmed South Korea-based SK Telecom Co.  Ltd.'s (SKT) Long-Term Foreign- and Local-Currency Issuer Default Ratings (IDRs) and its senior unsecured rating at 'A-'. The agency has also affirmed its subsidiary SK Broadband Co.  Ltd.'s (SKB) Long-Term Foreign- and Local-Currency IDRs and senior unsecured rating at 'A-'. The Outlook on both companies' IDRs is Stable. SKT's rating and Stable Outlo",
        "date": "10232017",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "Fitch Affirms SK Telecom  SK Broadband at 'A-'; Outlook Stable "
    },
    {
        "content": "* Says it signed a 1.52 billion won contract with SK Telecom Co. Ltd to provide SK Telecom repeater",
        "date": "09282017",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "BRIEF-Amnis signs contract worth 1.52 bln won "
    },
    {
        "content": "* Co  SK Telecom will collaborate to evolve standards for 5G  network functions virtualization  software-defined networking and IoT​ Source text - Bharti Airtel (“Airtel”)  India’s largest telecommunications services provider  and SK Telecom  Korea’s largest telecommunications company and a world leader in building cutting edge networks  today announced a strategic partnership under which  Airtel will leverage SK Telecom’s expertise to build the most advanced telecom network in India. The partne",
        "date": "09132017",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "BRIEF-Bharti Airtel forges strategic partnership with SK Telecom "
    },
    {
        "content": "* Says it signed 15.21 billion won contract with SK Telecom Co Ltd  to provide repeater",
        "date": "05312017",
        "name": "SK Telecom Co Ltd",
        "news_type": "normal",
        "symbol": "SKM",
        "title": "BRIEF-Solid signs contract worth 15.21 bln won "
    },
    {
        "content": "* Says it signed a 3.04 billion won contract with SK Telecom Co. Ltd to provide SK telecom intelligent network technical assistance service",
        "date": "04102017",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "BRIEF-Uangel signs contract worth 3.04 bln won "
    },
    {
        "content": "* Says it signed 3.75 billion won contract with SK Telecom Co Ltd to provide repeater",
        "date": "03072017",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "BRIEF-CS signs 3.75 bln won contract with SK Telecom "
    },
    {
        "content": "* Says it will pay annual cash dividend at 9 000 won/share for FY 2016",
        "date": "02022017",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "BRIEF-SK Telecom says annual cash dividend for FY 2016 "
    },
    {
        "content": "* Says it signed contract with SK Telecom Co Ltd  on Nov. 24  to provide SK Telecom repeaters",
        "date": "11252016",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "BRIEF-Seohwa signs contract worth 3.2 bln won "
    },
    {
        "content": "* Says it decides to change unit SK Communications Co Ltd  to its wholly owned subsidiary through stock swap",
        "date": "11242016",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "BRIEF-SK Telecom to raise stake in unit SK Communications to 100 pct via stock swap "
    },
    {
        "content": "* Says it decides to deliste its shares from Korea Securities Dealers Automated Quotations Stock Market",
        "date": "11242016",
        "name": "SK Telecom Co Ltd",
        "news_type": "normal",
        "symbol": "SKM",
        "title": "BRIEF-SK Communications to be delisted from KOSDAQ market "
    },
    {
        "content": "* Says it signs contract with SK Telecom Co Ltd  to provide SK telecom repeaters",
        "date": "11242016",
        "name": "SK Telecom Co Ltd",
        "news_type": "normal",
        "symbol": "SKM",
        "title": "BRIEF-I-Kaist Lab signs contract worth 5.09 bln won "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  October 24 (Fitch) Fitch Ratings has affirmed South Korea-based SK  Telecom Co.  Ltd.'s (SKT) Long-Term Foreign- and Local-Currency Issuer Default  Ratings (IDRs) and its senior unsecured rating at 'A-'. The agency has also  affirmed subsidiary SK Broadband Co.  Ltd.'s (SKB) Long-Term Foreign- and  Local-Currency IDRs and senior unsecured rating at 'A-'. The Outlook on both  companies' IDRs is Stable. SKT's rating and Stable Outl",
        "date": "10242016",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "Fitch Affirms SK Telecom  SK Broadband at 'A-'; Outlook Stable "
    },
    {
        "content": "* Fingerprint Cards' touch sensor fpc1145 featured in new customer SK Telecom's smartphone Luna s  Source text for Eikon:  Further company coverage:",
        "date": "10142016",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "BRIEF-Fingerprint Cards touch sensor featured in SK Telecom's smartphone "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL/SYDNEY  July 28 (Fitch) SK Telecom Co.  Ltd's (SKT  A-/Stable)  failure to  acquire South Korea's largest cable television operator will leave it a distant  second behind KT Corporation (A-/Stable) in the fixed-line telecommunications  market. However SKT's credit quality will remain intact as stronger financial  metrics will offset the weaker position in fixed-line and media  Fitch Ratings  says. The Ministry of Science  ICT and ",
        "date": "07282016",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "Fitch: CJH Merger Failure Leaves SK Telecom Trailing in Fixed Line "
    },
    {
        "content": "* Says it signs a contract with SK TELECOM CO. LTD  to supply LTE equipment",
        "date": "08012016",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "BRIEF-CS signs 6 bln won contract with SK TELECOM "
    },
    {
        "content": "* Says it signs a contract with SK TELECOM CO. LTD  to supply telephone repeater",
        "date": "08012016",
        "name": "SK Telecom Co Ltd",
        "news_type": "normal",
        "symbol": "SKM",
        "title": "BRIEF-GSINSTRUMENTS signs 6.86 bln won contract with SK TELECOM "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  November 04 (Fitch) Fitch Ratings says SK Telecom Co.  Ltd's (SKT;  A-/Stable) proposed acquisition of a stake in CJ HelloVision Co.  Ltd (CJH)  the  largest cable television operator in South Korea  will have no immediate rating  effect on SKT or  SK Broadband Co.  Ltd. (SKB  A-/Stable). The acquisition is  likely to boost SKT's media business by broadening its subscriber base and  strengthening its bundled services sales. SKT w",
        "date": "11042015",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "Fitch: No Immediate Rating Impact on SK Telecom from CJ Hellovision Purchase "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  October 27 (Fitch) Fitch Ratings has affirmed South Korea-based SK  Telecom Co.  Ltd.'s (SKT) Long-Term Foreign- and Local-Currency Issuer Default  Ratings (IDRs) and its senior unsecured rating at 'A-'. The agency has also  upgraded wholly owned subsidiary SK Broadband Co.  Ltd.'s (SKB) Long-Term  Foreign- and Local-Currency IDRs and senior unsecured rating to 'A-' from  'BBB+'. The Outlook on both companies' IDRs is Stable. We ",
        "date": "10272015",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "Fitch Affirms SKT at 'A-' and Upgrades SKB to 'A-'; Outlook Stable "
    },
    {
        "content": "SEOUL  Sept 24 South Korean mobile carrier SK Telecom Co Ltd said on Thursday that it will buy back 523 billion won ($438.21 million) worth of its own shares in order to boost shareholder value.",
        "date": "09242015",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "SK Telecom says to buy back $438 mln worth of own shares "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL/HONG KONG  March 24 (Fitch) Fitch Ratings says SK Telecom Co.  Ltd.'s  (SKT; A-/Stable) proposed acquisition of minorities' shares in SK Broadband Co.   Ltd. (SKB; BBB+/Stable) will not affect SKT's rating. The acquisition may  strengthen the ties between SKT and SKB  but we see no immediate rating impact  on SKB.  Fitch believes SKT's credit profile will remain in line with its current rating  level as the company will exchange i",
        "date": "03252015",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "Fitch: No Immediate Rating Impact from SKT's Full Acquisition of SKB "
    },
    {
        "content": "SEOUL South Korean telecommunications firm SK Telecom Inc  said on Friday it seeks to acquire the remaining 49.4 percent stake in internet services provider SK Broadband  via a share swap offer valued at 706 billion won ($627.17 million).",
        "date": "03202015",
        "name": "SK Telecom Co Ltd",
        "news_type": "topStory",
        "symbol": "SKM",
        "title": "SK Telecom offers to acquire rest 49.4 percent stake in SK Broadband "
    },
    {
        "content": "SEOUL  March 20 South Korean telecommunications firm SK Telecom Inc said on Friday it seeks to acquire the remaining 49.4 percent stake in internet services provider SK Broadband via a share swap offer valued at 706 billion won ($627.17 million).",
        "date": "03202015",
        "name": "SK Telecom Co Ltd",
        "news_type": "normal",
        "symbol": "SKM",
        "title": "SK Telecom offers to acquire rest 49.4 pct stake in SK Broadband "
    }
]