[
    {
        "content": "QUITO  Nov 15 Ecuadorean state-owned oil firm Petroamazonas will sign an agreement this month to settle $300 million in unpaid bills from oil services company Schlumberger  an arrangement that includes a five-year financing deal  the Oil Ministry said on Wednesday.",
        "date": "11162017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Ecuador to sign payment deal for Schlumberger debt "
    },
    {
        "content": "* Schlumberger NV files for potential mixed shelf offering; size not disclosed - sec filing Source text : http://bit.ly/2gNQ9zF Further company coverage:",
        "date": "10272017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger files for potential mixed shelf offering size not disclosed "
    },
    {
        "content": "HOUSTON  Oct 25 Schlumberger  the world's largest oilfield service provider  on Wednesday raised the prospect of an impairment charge for past work with Venezuela's state-run oil company.",
        "date": "10252017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger filing raises chance of asset hit from Venezuela "
    },
    {
        "content": "QUITO  Oct 19 Ecuador's state oil company Petroamazonas said it will issue some $350 million in bonds to repay part of its debts with oil services company Schlumberger as part of a wider deal that also includes other payment decisions.",
        "date": "10192017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Ecuador's Petroamazonas to issue $350 mln bonds to help pay Schlumberger debt "
    },
    {
        "content": "The world's top two oilfield service firms on Friday warned slower producer spending and weakness in offshore exploration may weigh on current-quarter earnings  but said activity could improve in the longer term as the global crude market comes into balance.",
        "date": "10202017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Top oilfield services firms signal fourth-quarter uncertainty "
    },
    {
        "content": "Oct 19 Oilfield services giant Schlumberger Ltd sealed a deal to buy oil and gas assets worth $1 billion from Cenovus Energy on Thursday  raising further concerns about its strategy to own more refining and drilling operations directly.",
        "date": "10192017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 3-Schlumberger's latest asset deal raises fresh concerns ahead of Q3 "
    },
    {
        "content": "Oct 20 The world's top two oilfield service firms on Friday warned slower producer spending and weakness in offshore exploration may weigh on current-quarter earnings  but said activity could improve in the longer term as the global crude market comes into balance.",
        "date": "10202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "WRAPUP 3-Top oilfield services firms signal fourth-quarter uncertainty "
    },
    {
        "content": "* Baker Hughes Q3 adj. EPS of $0.05 vs est. $0.11 (Adds analyst estimate  background  shares)",
        "date": "10202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Baker Hughes posts big profit miss  sees challenging year "
    },
    {
        "content": "Oct 20 Schlumberger Ltd posted a bigger quarterly profit on Friday as its North American business continues to be helped by strong shale drilling  but the oilfield services giant said that investments in the region was moderating.",
        "date": "10202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-Schlumberger warns of moderating N. American activity "
    },
    {
        "content": "Oct 20 Schlumberger Ltd posted a bigger quarterly profit on Friday  as its North American business continues to be helped by strong shale drilling.",
        "date": "10202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger quarterly profit up on N.America drilling "
    },
    {
        "content": "* Borr Drilling and Schlumberger sign enhanced collaboration agreement",
        "date": "10062017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Borr signs enhanced collaboration deal with Schlumberger "
    },
    {
        "content": "* Subsea 7 announced contracts awarded to Subsea Integration Alliance",
        "date": "10022017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Joint venture of Subsea 7 and Schlumberger wins Ophir Energy contract "
    },
    {
        "content": "ABERDEEN  Scotland  Sept 6 Two of the most veteran oil and gas producers in the UK North Sea  Royal Dutch Shell and BP  still tie their future to the ageing offshore basin despite a broad retreat in recent years.",
        "date": "09062017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BP  Shell tie future to North Sea despite broad retreat "
    },
    {
        "content": "HOUSTON  Sept 8 The world's largest oilfield services company  Schlumberger NV  is spending billions of dollars buying stakes in its customers' oil and gas projects - investing in the same ventures it supplies with equipment and expertise.",
        "date": "09082017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "RPT-INSIGHT-The next oil major? Service firm Schlumberger's big bet on production "
    },
    {
        "content": "HOUSTON The world's largest oilfield services company  Schlumberger NV   is spending billions of dollars buying stakes in its customers' oil and gas projects - investing in the same ventures it supplies with equipment and expertise.",
        "date": "09082017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "The next oil major? Service firm Schlumberger's big bet on production "
    },
    {
        "content": "HOUSTON  Sept 8 The world's largest oilfield services company  Schlumberger NV  is spending billions of dollars buying stakes in its customers' oil and gas projects - investing in the same ventures it supplies with equipment and expertise.",
        "date": "09082017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "INSIGHT-The next oil major? Service firm Schlumberger's big bet on production "
    },
    {
        "content": "Aug 30 Borr Drilling Ltd Chief Executive Simon Johnson told a news conference on Wednesday:",
        "date": "08302017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Borr Drilling in talks with Schlumberger over collaboration -CEO "
    },
    {
        "content": "MOSCOW The acquisition of Russia's Eurasia Drilling Co (EDC) by U.S. oilfield services giant Schlumberger  has been held up by U.S. sanctions on Russia  Russian Deputy PM Arkady Dvorkovich was quoted as saying by local news services.",
        "date": "09022017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Moscow says Schlumberger Russian oil services deal held up by U.S sanctions: reports "
    },
    {
        "content": "MOSCOW  Sept 2 The acquisition of Russia's Eurasia Drilling Co (EDC) by U.S. oilfield services giant Schlumberger has been held up by U.S. sanctions on Russia  Russian Deputy PM Arkady Dvorkovich was quoted as saying by local news services.",
        "date": "09022017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Moscow says Schlumberger Russian oil services deal held up by U.S sanctions - reports "
    },
    {
        "content": "* LAMPRELL ‍TALKS LED TO SCHLUMBERGER AWARDING TO LAMPRELL CONTRACT. THESE ARE BEING CONSTRUCTED IN LAMPRELL'S EXISTING FACILITIES IN UAE​",
        "date": "08152017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Lamprell settles jacking equipment issues with Cameron International "
    },
    {
        "content": "MOSCOW  Aug 16 The acquisition of a 51 percent stake in Russia's Eurasia Drilling Co (EDC) by U.S. oilfield services giant Schlumberger \"has big problems\" in the current political situation  the head of Russia's competition watchdog said on Wednesday.",
        "date": "08162017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "UPDATE 1-Russian watchdog says Schlumberger-Eurasia Drilling deal \"has big problems\" "
    },
    {
        "content": "QUITO  July 27 Ecuador said on Thursday it had successfully negotiated a payment plan with Schlumberger   although it did not specify if the deal included reimbursement for roughly $850 million owed to the oil service company.",
        "date": "07282017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Ecuador says clinches new payment deal with Schlumberger "
    },
    {
        "content": " ((This July 25 story corrects to indicate majority of the impairment charged was related to PdVSA's promissory notes  not all of the charge  in second paragraph))",
        "date": "07262017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Halliburton  Schlumberger take hit on Venezuela bills in second quarter "
    },
    {
        "content": "* Says it  Soak Oil & Gas LLP and Schlumberger Holding II sign agreement on investment in soak program",
        "date": "07272017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Geo-Jade Petroleum in investment deal with Soak Oil & Gas  Schlumberger "
    },
    {
        "content": "Top oilfield services provider Schlumberger Ltd  said on Friday it would redeploy all of its pressure pumping fleet by early next quarter as demand rises in North America and most of its international markets.",
        "date": "07212017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger beats on North American drilling; sees global recovery "
    },
    {
        "content": "MOSCOW U.S. oilfield services giant Schlumberger NV has applied to Russia's anti-monopoly watchdog for approval of a deal to buy 51 percent stake in Russian peer Eurasia Drilling Co (EDC)  the Interfax news agency reported on Thursday.",
        "date": "07272017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger asks Russia antimonopoly body to OK Eurasia Drilling deal: Ifax "
    },
    {
        "content": "* Schlumberger NV says looking forward  expect U.S. land activity to \"remain strong\" throughout the second half of the year - conf call",
        "date": "07212017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger says it's likely to continue to see strong activity in U.S. in 2018 - conf call "
    },
    {
        "content": "MOSCOW  July 21 U.S. oilfield services giant Schlumberger NV has agreed to buy a 51 percent stake in Russian peer Eurasia Drilling Co (EDC) in a deal likely to test Russia-U.S. ties.",
        "date": "07212017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger buys Eurasia Drilling stake in test of Russia-U.S. ties "
    },
    {
        "content": "MOSCOW  July 27 U.S. oilfield services giant Schlumberger NV has applied to Russia's anti-monopoly watchdog for approval of a deal to buy 51 percent stake in Russian peer Eurasia Drilling Co (EDC)  the Interfax news agency reported on Thursday.",
        "date": "07272017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger asks Russia antimonopoly body to OK Eurasia Drilling deal -Ifax "
    },
    {
        "content": "July 21 Russia's Eurasia Drilling Company Ltd said on Thursday it would sell a 51 percent stake in the company to the world's No. 1 oilfield services provider  U.S.-based Schlumberger NV.",
        "date": "07202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger to buy majority stake in Russia's Eurasia Drilling "
    },
    {
        "content": "July 21 Schlumberger Ltd  the world's largest oilfield services provider  reported a smaller net loss compared with the year-ago quarter  when it took a $2.57 billion charge.",
        "date": "07212017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger posts smaller quarterly net loss "
    },
    {
        "content": "* Eurasia Drilling Company Ltd - co's shareholders have agreed to sell to Schlumberger 51 percent of the total issued share capital of the company",
        "date": "07202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Eurasia Drilling says shareholders have agreed to sell to Schlumberger 51 pct of total issued share capital of the company "
    },
    {
        "content": "* Schlumberger Ltd and Production Plus Energy Services announce creation of JV entities for purpose of developing HEAL System technology and business",
        "date": "06192017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger Limited and Production Plus Energy Services announce joint venture "
    },
    {
        "content": "* Schlumberger recommends stockholders reject “mini-tender” offer by trc capital corporation",
        "date": "06202017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger recommends stockholders reject offer by TRC Capital "
    },
    {
        "content": "QUITO Ecuador wants to negotiate a payment plan with oil service companies owed more than $2 billion and expects to begin talks with main creditor Schlumberger in coming days  its new oil minister told Reuters on Wednesday.",
        "date": "05312017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Ecuador eyes payment deal with Schlumberger soon "
    },
    {
        "content": "* Signed contract with Schlumberger to stimulate 11 wells with multiple zones in Q2  Q3 of this year",
        "date": "05172017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-JKX Oil and Gas signs deal with Schlumberger to stimulate 11 wells in Q2  Q3 of this year "
    },
    {
        "content": "AMSTERDAM  May 8 British oil and gas explorer Ophir Energy plans to borrow $1.2 billion from Chinese banks to back the development of its Fortuna floating liquefied natural gas (FLNG) export project in Equatorial Guinea.",
        "date": "05082017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "CORRECTED-UPDATE 1-Ophir to borrow $1.2 bln from Chinese banks for Fortuna floating LNG "
    },
    {
        "content": "* Has entered into a framework contract with Schlumberger for acquisition of 4D seismic data",
        "date": "04272017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Aker BP in 4D seismic contract with Schlumberger "
    },
    {
        "content": "QUITO  April 25 Ecuador has given oil services company Schlumberger NV $150 million in central bank notes that can be used to pay taxes  President Rafael Correa said late on Monday  part of efforts to pay down a $1.1 billion debt with the company.",
        "date": "04252017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Ecuador gives Schlumberger $150 mln in notes to settle part of debt "
    },
    {
        "content": "* Entered into an agreement with Schlumberger to create joint ventures in Canada and US",
        "date": "04202017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Production Plus Energy to form JV with Schlumberger in Canada and US "
    },
    {
        "content": "HOUSTON  April 20 ConocoPhillips has beaten its 2017 asset sales target less than four months into the year  after shedding $30.8 billion worth of energy assets in six years.",
        "date": "04202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "RPT-ConocoPhillips takes slow  steady route in race for oil profits "
    },
    {
        "content": "Schlumberger NV  warned on Friday that margins would remain under pressure as the oilfield services provider spends more to bring back idled equipment to meet rising demand from North American shale producers after a two-year lull.",
        "date": "04212017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger expects reactivation costs to squeeze margins "
    },
    {
        "content": "HOUSTON  April 20 ConocoPhillips has beaten its 2017 asset sales target less than four months into the year  after shedding $30.8 billion worth of energy assets in six years.",
        "date": "04202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "ConocoPhillips takes slow  steady route in race for oil profits "
    },
    {
        "content": "* Q2  Q3 margin growth to lag Q1 - analyst (Adds Breakingviews link)",
        "date": "04212017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 4-Schlumberger expects reactivation costs to squeeze margins "
    },
    {
        "content": "* Schlumberger says \"activity has now reached bottom in all regions\" - conf call",
        "date": "04212017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger says \"activity has now reached bottom in all regions\" "
    },
    {
        "content": "* Schlumberger sees strength in activity in North Sea  Russia and Caspian regions in coming quarters as the winter season ends  new projects start up",
        "date": "04212017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger says do not expect significant sequential growth from Middle East over coming quarters "
    },
    {
        "content": "* Schlumberger says continued to experience payment delays  primarily from customers in Latin America",
        "date": "04212017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger says continued to experience payment delays  primarily from customers in Latin America "
    },
    {
        "content": "April 21Schlumberger NV reported a 5.7 percent rise in revenue  the first increase after eight quarters  as a recovery in crude prices spurred shale drilling after a more than two-year slump.",
        "date": "04212017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger posts first revenue rise in 9 quarters as drilling recovers "
    },
    {
        "content": "LONDON/NEW YORK  April 7 The stream of U.S. energy companies going public at the start of 2017 has dried up on concerns over the future direction of oil prices  but private buyers seeking mergers and acquisitions are ready to take advantage of the volatility to secure cheap deals.",
        "date": "04072017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Weak crude oil stunts U.S. energy IPOs  boosts outlook for M&A "
    },
    {
        "content": "HOUSTON/QUITO  March 28 OPEC production cuts and economic woes are complicating Schlumberger NV's efforts to collect $1.1 billion from Ecuador's state-owned Petroamazonas  casting a cloud over the oil services company's first-quarter results.",
        "date": "03282017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger sees Ecuador's unpaid bills hurting quarterly results "
    },
    {
        "content": "March 24 Schlumberger NV said on Friday it would form a joint venture with Weatherford International Plc  to deliver oilfield products and services for unconventional resource plays in the United States and Canada.",
        "date": "03242017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger  Weatherford to form joint venture "
    },
    {
        "content": "* Weatherford International Plc - Schlumberger and Weatherford will have 70/30 ownership of joint venture  respectively",
        "date": "03242017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Weatherford and Schlumberger to form OneStim joint venture "
    },
    {
        "content": "* Under agreement  co to sell intellectual property  substantially of Voraxial Separator patents  trademarks to Schlumberger",
        "date": "03152017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-EVTN signs purchase agreement with Schlumberger "
    },
    {
        "content": "* Annual savings of 110 million pound seen   (Adds context  company comments)",
        "date": "03132017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 3-Wood Group buys Amec Foster for $2.7 bln to target oil upturn benefits "
    },
    {
        "content": "* Wood Group agrees 564 pence/share deal for Amec Foster Wheeler",
        "date": "03132017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-UK's Wood Group to buy rival Amec Foster in $2.7 billion deal "
    },
    {
        "content": "* TGS-Nopec and Schlumberger today announced a new multi- and wide-azimuth (m-waz) multiclient reimaging program in highly prospective central U.S. Gulf of Mexico",
        "date": "02232017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-TGS and Schlumberger announce joint program "
    },
    {
        "content": "* Schlumberger NV says CFO Simon Ayat 2016 total compensation was $6.55 million versus $6.65 million in 2015",
        "date": "02212017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger NV says CEO Paal Kibsgaard 2016 compensation was $18.6 mln "
    },
    {
        "content": "* CEO Paal Kibsgaard 2016 compensation $18.6 million versus $18.3 million in 2015 - SEC filing",
        "date": "02212017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger NV says CEO Paal Kibsgaard's 2016 total compensation was $18.6 mln vs $18.3 mln in 2015 "
    },
    {
        "content": "* Schlumberger- On Jan 19  board amended the company's amended and restated by-laws to provide for proxy access - SEC filing",
        "date": "01192017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger board amends by-laws to provide for proxy access "
    },
    {
        "content": "* Baker Hughes and Schlumberger will be awarded contracts for integrated drilling and well services on Cat J rigs Askepott and Askeladden",
        "date": "01182017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Statoil awards service contracts to Baker Hughes  Schlumberger "
    },
    {
        "content": "Schlumberger NV said on Friday that it does not expect a \"dramatic\" short-term recovery in international markets  compared with North America where shale producers are already ramping up drilling activity.",
        "date": "01202017",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger expects international markets recovery in late 2017 "
    },
    {
        "content": "* Shares fall 1.8 percent   (Adds exec  analyst comments; updates shares)",
        "date": "01202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger expects international markets recovery in late 2017 "
    },
    {
        "content": "* CEO says don't expect \"a dramatic  short-term recovery\" in international markets - conf call",
        "date": "01202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger says don't expect \"dramatic  short-term recovery\" in international markets "
    },
    {
        "content": "* Says continue to experience payment delays from some customers - conf call",
        "date": "01202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger sees oil prices fluctuating at current levels for next several months "
    },
    {
        "content": "* Schlumberger NV - fourth-quarter earnings per share  excluding charges was $0.27",
        "date": "01202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger NV Q4 EPS $0.27 excluding charges "
    },
    {
        "content": "Jan 20 Schlumberger NV  the world's No.1 oilfield services provider  reported a smaller fourth-quarter loss than a year earlier  when it recorded more than $2 billion in restructuring and asset impairment charges.",
        "date": "01202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger posts smaller fourth-quarter loss "
    },
    {
        "content": "ABUJA  Jan 13 Nigeria's state oil company said on Friday it will partner with oilfield services company Schlumberger in exploration and reservoir management.",
        "date": "01132017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Nigeria's NNPC partners with Schlumberger for exploration "
    },
    {
        "content": "Please click on the link below for Schlumberger NV's  quarterly earnings press release:  Source text:",
        "date": "01202017",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger 4th-qtr financial results press release "
    },
    {
        "content": "Nov 10 British oil and gas explorer Ophir Energy Plc said it had signed an agreement with OneLNGSM  a joint venture between units of Golar LNG Ltd and Schlumberger  to develop the Fortuna project in Equatorial Guinea.",
        "date": "11102016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Ophir signs deal with Schlumberger JV for Equatorial Guinea project "
    },
    {
        "content": "* Says company has just entered into an OEM valve automation packaging agreement with Rotork Controls",
        "date": "11072016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-NOW Inc announces distributorship agreements "
    },
    {
        "content": "* Consolidated sales of Schlumberger Group in first nine months of amounted to 112.0 million euros",
        "date": "11102016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger 9-mth result after tax and minorities swings to profit "
    },
    {
        "content": "* Ophir - wholly owned subsidiary   OneLNG SM  A jv between subsidiaries of Golar and Schlumberger  have signed a binding agreement to develop Fortuna Project",
        "date": "11102016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Ophir says Golar and Schlumberger's unit sign agreement to develop Fortuna project "
    },
    {
        "content": "* Schlumberger expands Accenture finance and accounting business process outsourcing agreement to 2021",
        "date": "10272016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Accenture says Schlumberger expands Accenture finance and accounting business process outsourcing agreement to 2021 "
    },
    {
        "content": "Schlumberger Ltd  the world's No.1 oilfield services provider  reported a quarterly profit that topped analysts' expectations as more oil producers put rigs back to work in North America.",
        "date": "10202016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger profit beats as North America activity ramps up "
    },
    {
        "content": "* Excluding Cameron  N. America land revenue up 14 pct   (Adds analyst comments  details)",
        "date": "10202016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger profit beats as North America activity ramps up "
    },
    {
        "content": "Oct 20Schlumberger Ltd  the world's No.1 oilfield services provider  reported a 17 percent fall in quarterly revenue  hurt by weaker drilling activity and pricing pressure.",
        "date": "10202016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger reports 17 pct fall in revenue "
    },
    {
        "content": "* MRC Global announces exclusive measurement and instrumentation distribution agreement with Schlumberger",
        "date": "10032016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-MRC Global announces measurement  instrumentation distribution agreement with Schlumberger "
    },
    {
        "content": "DUBAI Investment in exploration and production will have to start increasing soon to help balance the global oil market  Schlumberger CEO Paal Kibsgaard told a conference in Dubai on Monday.",
        "date": "09262016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Oil market investment needed soon to balance market: Schlumberger CEO "
    },
    {
        "content": "CARACAS/PUNTO FIJO  Venezuela  Sept 2 Oilfield services company Schlumberger has let go of workers and pulled out of projects as it cuts operations in crisis-stricken Venezuela  sparking worker protests and heightening worry over the OPEC country's slumping oil output.",
        "date": "09022016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger lets go of workers in Venezuela as it scales back "
    },
    {
        "content": "* Rosneft  BP and Schlumberger today announced agreements for collaboration on seismic research and development",
        "date": "09022016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-BP  Rosneft and Schlumberger sign seismic research agreements "
    },
    {
        "content": "VLADIVOSTOK  Russia  Sept 2 Russian biggest oil producer Rosneft signed agreements with British oil major BP and top world oilfield services provider Schlumberger for collaboration on seismic research and development  the companies said on Friday.",
        "date": "09022016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Rosneft  BP  Schlumberger to collaborate on seismic research "
    },
    {
        "content": "* CFO Simon Ayat reports open market sale of 50 000 shares of co's common stock on aug 18 at $83.68 per share - SEC filing",
        "date": "08192016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger CFO Simon Ayat reports open market sale of 50 000 shares at $83.68 per share "
    },
    {
        "content": "* TGS and Schlumberger announce new dual coil shooting full-azimuth multiclient acquisition in U.S. Gulf of Mexico",
        "date": "08042016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-TGS says to launch seismic data acquisition with Schlumberger "
    },
    {
        "content": "HOUSTON Hess Corp said on Wednesday it was pursuing legal action against Schlumberger NV for $40 million or more  claiming the oilfield service provider supplied a defective valve for a U.S. Gulf of Mexico oilfield that shuttered three wells and crimped production.",
        "date": "07272016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Hess seeks over $40 mln from Schlumberger in valve dispute "
    },
    {
        "content": "HOUSTON Hess Corp said on Wednesday it was pursuing legal action against Schlumberger NV for $40 million or more  claiming the oilfield service provider supplied a defective valve for a U.S. Gulf of Mexico oilfield that shuttered three wells and crimped production.",
        "date": "07272016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Hess seeks over $40 million from Schlumberger in valve dispute "
    },
    {
        "content": "* Golar and Schlumberger have 51/49 ownership of joint venture.",
        "date": "07252016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Golar says OneLNG targets development of low cost gas reserves to LNG "
    },
    {
        "content": "HOUSTON  July 27 Hess Corp said on Wednesday it was pursuing legal action against Schlumberger NV  for $40 million or more  claiming the oilfield service provider supplied a defective valve for a U.S. Gulf of Mexico oilfield that shuttered three wells and crimped production.",
        "date": "07272016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-Hess seeks over $40 mln from Schlumberger in valve dispute "
    },
    {
        "content": "HOUSTON  July 27 Hess Corp said on Wednesday it was pursuing legal action against Schlumberger NV  for as much as $40 million  claiming the oilfield service provider supplied a defective valve for a U.S. Gulf of Mexico oilfield that shuttered three wells and crimped production.",
        "date": "07272016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Hess seeks up to $40 mln from Schlumberger in dispute over well valve "
    },
    {
        "content": "* Schlumberger Says Fy 2016 Capital Expenditures Expected To Be About $2.2 Bln As Compared To Expenditures Of $2.4 Bln In 2015 - Sec filing  Source text : http://bit.ly/2ahcNeq Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "07272016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger sees fy 2016 capital expenditures to be about $2.2 bln "
    },
    {
        "content": "* Joint venture is created to rapidly develop low cost gas reserves to LNG",
        "date": "07252016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger and Golar LNG form joint venture "
    },
    {
        "content": "* Chief Executive John Hess says plans to reduce drilling rigs in Bakken from three to two by august",
        "date": "07272016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Hess CEO says believes the global oil market is rebalancing "
    },
    {
        "content": "July 22 Schlumberger Ltd  the world's No. 1 oilfield services provider  said it expects a \"significant global supply deficit\" of crude oil  assuming steady growth in demand  given the sharp decline in spending on exploration and production.",
        "date": "07222016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger sees oil supply deficit if demand growth holds "
    },
    {
        "content": "Schlumberger Ltd   the world's No.1 oilfield services provider  said the oil downturn appeared to have bottomed out and it was considering rolling back pricing concessions.",
        "date": "07212016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Recovery in sight  Schlumberger mulls rollback of concessions "
    },
    {
        "content": "July 21 Schlumberger Ltd  the world's No.1 oilfield services provider  said the oil downturn appeared to have bottomed out and it was considering rolling back pricing concessions.",
        "date": "07212016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 3-Recovery in sight  Schlumberger mulls rollback of concessions "
    },
    {
        "content": "July 21 Schlumberger Ltd  the world's No.1 oilfield services provider  reported a quarterly loss  compared with a profit a year earlier  as it took a charge of $2.57 billion related to asset impairments and job cuts.",
        "date": "07212016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "CORRECTED-Schlumberger reports loss due to asset impairments charge "
    },
    {
        "content": "* Qtrly asset impairment  workforce reduction  and merger and integration charges totaled $1.79 per share",
        "date": "07212016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger Q2 GAAP loss per share $1.56 "
    },
    {
        "content": "* Schlumberger says drilling group revenue in the second quarter is expected to decline more severely by about 20%",
        "date": "06212016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger says Q2 drilling group revenue expected to decline more severely by about 20 pct "
    },
    {
        "content": "* WSP enhances its expertise in water through proposed acquisition of Schlumberger's industrial water consultancy business",
        "date": "06172016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-WSP Global enters into an agreement with Schlumberger "
    },
    {
        "content": "* Schlumberger NV CEO Paal Kibsgaard reports open market sale of 32 857 shares of co's common stock on 9 june at $80 per share - SEC filing  Source (http://bit.ly/1tmHyVA) Further company coverage:",
        "date": "06102016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger CEO Kibsgaard reports open market sale of 32 857 shares of co "
    },
    {
        "content": "CARACAS  June 11 Venezuela's state oil company  PDVSA  is close to reaching deals to boost Schlumberger's   presence after the oilfield services provider said in April it would reduce operations because of payment problems  PDVSA's president told Reuters.",
        "date": "06112016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "UPDATE 1-Venezuela PDVSA near deals to boost Schlumberger presence -executive "
    },
    {
        "content": "* Schlumberger appoints former BG  Statoil boss Helge Lund to board - WSJ  Source text: (http://on.wsj.com/1XHWJp4) Further company coverage:",
        "date": "06092016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger appoints former BG  Statoil boss Helge Lund to board - WSJ "
    },
    {
        "content": "CARACAS Venezuela's state oil company  PDVSA  is close to reaching deals to boost Schlumberger's presence after the oilfield services provider said in April it would reduce operations because of payment problems  PDVSA's president told Reuters.",
        "date": "06112016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Venezuela PDVSA near deals to boost Schlumberger presence: executive "
    },
    {
        "content": "* Schlumberger NV President Patrick Schorn Reports Open Market Sale Of 9 128 Shares Of Co's Common Stock On June 7 At $80.27 Each - SEC filing  Source (http://bit.ly/1rdanlh) Further company coverage:",
        "date": "06082016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger President reports open market sale of 9 128 shares of co "
    },
    {
        "content": "OSLO  June 9 Helge Lund  the former CEO of energy companies Statoil and BG  has become a director of oil services firm Schlumberger  the company said on Thursday.",
        "date": "06092016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger says Lund joins as a director  not CEO "
    },
    {
        "content": "CARACAS  June 11 Venezuela's state oil company  PDVSA  is close to reaching deals to boost Schlumberger's   presence after the oilfield services provider said in April it would reduce operations because of payment problems  PDVSA's president told Reuters.",
        "date": "06112016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Venezuela PDVSA near deals to boost Schlumberger presence -executive "
    },
    {
        "content": "* Schlumberger picks former BG  Statoil boss Helge Lund as new CEO - WSJ  Source text - (http://on.wsj.com/1RYe6ZZ) Further company coverage:    (Bengaluru Newsroom)",
        "date": "06092016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger picks former BG  Statoil boss Helge Lund as new CEO - WSJ "
    },
    {
        "content": "OSLO  June 9 Helge Lund  the former CEO of oil companies Statoil and BG  has been appointed the new chief executive of oil services firm Schlumberger  the Wall Street Journal reported on Thursday  without naming sources.",
        "date": "06092016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Helge Lund appointed new CEO of Schlumberger-Wall Street Journal "
    },
    {
        "content": "CAPE TOWN  June 6 Equatorial Guinea's energy minister on Monday said Schlumberger had walked away from the country's Fortuna floating liquefied natural gas (FLNG) project but he also said he was confident it would be successful.",
        "date": "06062016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "UPDATE 1-Equatorial Guinea says Schlumberger walked away from Fortuna project "
    },
    {
        "content": "* Schlumberger acquires Omron Oilfield And Marine Inc    Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "06032016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Schlumberger acquires Omron Oilfield and Marine Inc "
    },
    {
        "content": "CAPE TOWN  June 6 Equatorial Guinea's energy minister on Monday said U.S. company Schlumberger walked away from talks with Ophir over the development of the Fortuna LNG project because it wanted to \"monopolise everything.\"",
        "date": "06062016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Equatorial Guinea blames Schlumberger for quitting LNG project "
    },
    {
        "content": "* Now sees first investment decision in Q4 vs. mid-2016 earlier",
        "date": "04292016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "UPDATE 2-Ophir ends talks with Schlumberger over Equatorial Guinea project "
    },
    {
        "content": "April 29 Oil and gas explorer Ophir Energy Plc  said it had ended talks with Schlumberger NV  over the U.S. company's upstream participation in Ophir's Fortuna project in Equatorial Guinea  sending its shares down sharply.",
        "date": "04292016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Ophir ends talks with Schlumberger over Fortuna project deal "
    },
    {
        "content": "* Has terminatd talks with Schlumberger over Fortuna FLNG project after being unable to complete deal on terms agreed in the heads of terms",
        "date": "04292016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Ophir Energy says ends talks with Schlumberger over Fortuna FLNG project "
    },
    {
        "content": "** Ophir Energy loses more than a fifth of its value and poised for worst day ever after energy co says its discussions with Schlumberger on the Fortuna FLNG project have ended",
        "date": "04292016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BUZZ-Ophir: worst day ever after ending talks with Schlumberger "
    },
    {
        "content": "* Xtreme announces sale of XSR coiled tubing services segment to Schlumberger for c$205 million and repositions xtreme as a pure tier 1 contract driller",
        "date": "04272016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Xtreme announces segment sale for C$205 million to Schlumberger "
    },
    {
        "content": "Schlumberger Ltd's profit nearly halved in the first quarter  but the fall was slightly less than analysts estimated  as cost cuts helped cushion the impact of the continued decline in drilling and completion activity.",
        "date": "04212016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger profit halves as clients' spending cuts weigh "
    },
    {
        "content": "* Outlook for oil markets remains unchanged - CEO   (Adds details  analyst's comment  graphic)",
        "date": "04212016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger profit halves as clients' spending cuts weigh "
    },
    {
        "content": "April 21 Schlumberger Ltd  the world's No.1 oilfield services provider  reported a 48.6 percent slump in quarterly profit  as spending cuts by oil producers continued to take a toll.",
        "date": "04212016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "CORRECTED-Schlumberger profit nearly halves as oil spending cuts weigh "
    },
    {
        "content": "CARACAS  April 22 U.S. oil services firm Halliburton Co has decided to begin curtailing activity in Venezuela  the company said on Friday  less than two weeks after Schlumberger Ltd announced a similar decision as a result of payment difficulties.",
        "date": "04222016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Halliburton curtailing business activity in Venezuela "
    },
    {
        "content": "ALGIERS  April 22 Algerian state energy company Sonatrach has awarded U.S. oil service firms Schlumberger  and National Oilwell Varco contracts for managing well operations  a Sonatrach document seen by Reuters showed.",
        "date": "04222016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-Algeria's Sonatrach awards well contracts to Schlumberger and NOV "
    },
    {
        "content": "Schlumberger Ltd  said it expected a \"significant\" fall in second-quarter revenue as it scales back operations in Venezuela due to payment problems  and a prolonged slump in oil prices continues to keep activity subdued.",
        "date": "04222016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger warns of 'significant' revenue drop amid oil slump "
    },
    {
        "content": "April 22 Schlumberger Ltd said it expected a \"significant\" fall in second-quarter revenue as it scales back operations in Venezuela due to payment problems  and a prolonged slump in oil prices continues to keep activity subdued.",
        "date": "04222016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-Schlumberger warns of \"significant\" revenue drop amid oil slump "
    },
    {
        "content": "April 22 Schlumberger Ltd said it expected a \"significant\" fall in second-quarter revenue as it scales back operations in Venezuela due to payment problems  and a prolonged slump in oil prices continues to keep activity subdued.",
        "date": "04222016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger warns of \"significant\" revenue drop amid oil slump "
    },
    {
        "content": "ALGIERS Algerian state energy company Sonatrach has awarded U.S. oil service firms Schlumberger and National Oilwell Varco contracts for managing well operations  according to a Sonatrach document seen by Reuters.",
        "date": "04222016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Algeria's Sonatrach awards well contracts to Schlumberger and NOV "
    },
    {
        "content": "Oilfield services provider Schlumberger Ltd said it would reduce its operations in Venezuela due to payment problems  a further sign of the cash crunch facing the OPEC nation because of weak oil markets.",
        "date": "04132016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger to limit Venezuela operations on payment problems "
    },
    {
        "content": "April 12 Oilfield services provider Schlumberger Ltd said it would reduce its activity in Venezuela due to insufficient payments received in recent quarters and a lack of progress in establishing new mechanisms that address past and future accounts receivable.",
        "date": "04122016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger to reduce Venezuela operations "
    },
    {
        "content": "April 12 Oilfield services provider Schlumberger Ltd said it would reduce its operations in Venezuela due to payment problems  a further sign of the cash crunch facing the OPEC nation because of weak oil markets.",
        "date": "04132016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger to limit Venezuela operations on payment problems "
    },
    {
        "content": "The U.S. Justice Department will file a lawsuit as soon as this week to stop oilfield services provider Halliburton Co from acquiring smaller rival Baker Hughes Inc  a source familiar with the matter said on Tuesday.",
        "date": "04052016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "U.S. Justice Dept will sue to stop Halliburton  Baker Hughes merger: source "
    },
    {
        "content": "April 5 The U.S. Justice Department will file a lawsuit as soon as this week to stop oilfield services provider Halliburton Co from acquiring smaller rival Baker Hughes Inc  a source familiar with the matter said on Tuesday.",
        "date": "04052016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 3-U.S. Justice Dept will sue to stop Halliburton  Baker Hughes merger - source "
    },
    {
        "content": "Schlumberger Ltd   the world's largest oilfield services provider  said revenue in the current quarter is expected to fall 15 percent from the fourth  as spending cuts by oil producers take a toll.",
        "date": "03212016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger expects first quarter revenue to fall 15 percent from fourth quarter "
    },
    {
        "content": "March 21 Schlumberger Ltd  the world's largest oilfield services provider  said revenue in the current quarter is expected to fall 15 percent from the fourth  as spending cuts by oil producers take a toll.",
        "date": "03212016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-Schlumberger expects Q1 revenue to fall 15 pct from Q4 "
    },
    {
        "content": "LONDON British defense company BAE Systems  has picked former oil industry executive Charles Woodburn as heir apparent to Chief Executive Ian King  a source close to the situation said on Sunday.",
        "date": "02142016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BAE Systems lines up oil exec Woodburn as next CEO: source "
    },
    {
        "content": "NEW YORK/LONDON  Feb 11 (IFR) - US companies are lining up euro deals that could give the moribund European corporate bond market a much needed boost after a dire start to the year.",
        "date": "02112016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "US companies tipped to sell euro debt in record numbers in 2016 "
    },
    {
        "content": "BRUSSELS  Feb 5 The European Union executive on Friday cleared the purchase of equipment maker Cameron International Corp by Schlumberger  the world's No.1 oilfield services provider.",
        "date": "02052016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "EU clears acquisition of Cameron by Schlumberger "
    },
    {
        "content": "WASHINGTON U.S. employment gains slowed more than expected in January as the boost to hiring from unseasonably mild weather faded  but rising wages and an unemployment rate at an eight-year low suggested the labour market recovery remains firm.",
        "date": "02052016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "U.S. labour market on solid ground as jobless rate hits eight-year low "
    },
    {
        "content": "WASHINGTON  Feb 5 U.S. employment gains slowed more than expected in January as the boost to hiring from unseasonably mild weather faded  but rising wages and an unemployment rate at an eight-year low suggested the labor market recovery remains firm.",
        "date": "02052016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "WRAPUP 5-U.S. labor market on solid ground as jobless rate hits 8-year low "
    },
    {
        "content": "BRUSSELS The world's biggest oilfield services company Schlumberger  is set to gain unconditional EU approval for its $14.8 billion bid for equipment maker Cameron International Corp   two people familiar with the matter said on Monday.",
        "date": "01252016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Exclusive: EU to give unconditional approval to Schlumberger deal - sources "
    },
    {
        "content": "Jan 25 Oil and gas explorer Ophir Energy Plc  said it signed a non-binding heads of terms agreement with Schlumberger Ltd by which the latter would receive an interest in its Fortuna project in Equatorial Guinea.",
        "date": "01252016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Ophir signs contract for Fortuna project with Schlumberger "
    },
    {
        "content": "Schlumberger Ltd Chief Executive Paal Kibsgaard said a \"significant\" recovery in oilfield activity was not expected until 2017  and he indicated that the company might struggle to meet analysts' estimates for its current-quarter profit.",
        "date": "01222016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger sees no pickup in oilfield activity before 2017 "
    },
    {
        "content": "* Shares rise as much as 8 pct   (Adds details; updates shares)",
        "date": "01222016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 3-Schlumberger sees no pickup in oilfield activity before 2017 "
    },
    {
        "content": "* \u007fHeads of Terms signed for an upstream partner in Fortuna FLNG project  Equatorial Guinea\u007f",
        "date": "01252016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "BRIEF-Ophir welcomes Schlumberger into Fortuna FLNG project "
    },
    {
        "content": "Jan 22 Schlumberger Ltd/NV the world's No. 1 provider of oilfield services  does not expect any significant recovery in the company's activity levels before 2017  Chief Executive Paal Kibsgaard said on a conference call on Friday.",
        "date": "01222016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-QUOTEBOX-Schlumberger CEO sees no significant recovery in activity before 2017 "
    },
    {
        "content": "* Shares up nearly 2 pct in extended trading   (Adds details from statement  background)",
        "date": "01212016",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger plans $10 bln share buyback as profit beats "
    },
    {
        "content": "Jan 22 Schlumberger NV the world's No. 1 provider of oilfield services  does not expect any significant recovery in the company's activity levels before 2017  Chief Executive Paal Kibsgaard said on a conference call on Friday.",
        "date": "01222016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "QUOTEBOX-Schlumberger CEO sees no significant recovery in activity before 2017 "
    },
    {
        "content": "Schlumberger Ltd   the world's No.1 oilfield services provider  unveiled a $10 billion share buyback program and  reported a slightly better-than-expected quarterly profit as it cut costs to weather a prolonged slump in oil prices.",
        "date": "01212016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger plans $10 billion share buyback as profit beats "
    },
    {
        "content": "Jan 22 Schlumberger Ltd  the world's No.1 oilfield services provider  said it was optimistic that it had completed the job cuts needed in this oil downturn.",
        "date": "01222016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger says no more job cuts expected in current oil slump "
    },
    {
        "content": "Jan 21 Schlumberger Ltd  the world's No.1 oilfield services provider  reported its first quarterly net loss in 12 years as it recorded more than $2 billion in restructuring and asset impairment charges.",
        "date": "01212016",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger posts first quarterly loss in 12 years "
    },
    {
        "content": "* Bauer Group seals joint venture in oil and gas drilling business with Schlumberger",
        "date": "12102015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Bauer Group seals joint venture with Schlumberger "
    },
    {
        "content": "VIENNA  Dec 2 Saudi Arabia has come under increased pressure from fellow OPEC members to cut output to prop up prices as the group meets this week amid one of the most severe oil gluts in its history.",
        "date": "12022015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "OPEC hawks push for output cuts; Russia pumps record volumes "
    },
    {
        "content": "NEW YORK  Oct 26 U.S. companies are far from optimistic that next year will see them get a break from the tough economic and market conditions they have faced in 2015. And that may well hurt capital investment and jobs growth.",
        "date": "10262015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-With global outlook weak  many U.S. companies tighten belts "
    },
    {
        "content": "Schlumberger Ltd   the world's No.1 oilfield services provider  suggested that it may have to reduce costs further and cut more jobs as it expects any rebound in drilling activity to now take longer than expected.",
        "date": "10152015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Market recovery to take longer  hints at more cost cuts: Schlumberger "
    },
    {
        "content": "Schlumberger Ltd   the world's No.1 oilfield services provider  said it would cut more jobs and consolidate its manufacturing and distribution network as it did not expect a recovery in demand before 2017.",
        "date": "10162015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger to cut more jobs  sees recovery pushed to 2017 "
    },
    {
        "content": "* Cost cuts help Q3 EPS beat analysts estimates   (Adds details  graphic)",
        "date": "10152015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger: market recovery to take longer  hints at more cost cuts "
    },
    {
        "content": "Oct 15 Schlumberger Ltd  the world's No. 1 oilfield services provider  reported a near 50 percent drop in quarterly profit  due to continued declines in drilling and completion activity.",
        "date": "10152015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger profit halves as drilling activity weakens "
    },
    {
        "content": "* Shares plunge 4.6 pct Friday   (Adds details  more comments)",
        "date": "10162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger to cut more jobs  sees recovery pushed to 2017 "
    },
    {
        "content": "Oct 16 Schlumberger Ltd  the world's No.1 oilfield services provider  will proceed with another round of cuts to capacity and overheads  resulting in a restructuring charge in the fourth quarter  Chief Executive Paal Kibsgaard said on Friday.",
        "date": "10162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger to cut capacity  overheads again - CEO "
    },
    {
        "content": "MOSCOW  Oct 16 U.S. group Schlumberger  may return to its plans to buy a stake in Russia's oil servicing company Eurasia Drilling (EDC)  Igor Artemyev  head of Russian antimonopoly watchdog  was quoted as saying by Interfax news agency on Friday.",
        "date": "10162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Russian competition watchdog: Schlumberger bid for EDC not ruled out - Interfax "
    },
    {
        "content": "Sept 30 Russia's Eurasia Drilling Company  said on Wednesday that a deal with U.S.-based Schlumberger to sell a minority stake in the company is off.",
        "date": "09302015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Russia's Eurasia Drilling Co says deal with Schlumberger is off "
    },
    {
        "content": "* Indicative terms for a licence agreement with Schlumberger in respect to DT Ultravert",
        "date": "09252015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Highlands Natural Resources signs indicative terms over Schlumberger deals "
    },
    {
        "content": "MOSCOW  Sept 24 U.S. company Schlumberger said on Thursday it does not intend to extend the pending agreement to acquire a minority equity interest in Eurasia Drilling once the current extension expires on Sept. 30.",
        "date": "09242015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "UPDATE 1-Schlumberger does not intend to extend agreement to buy stake in Eurasia "
    },
    {
        "content": "MOSCOW  Sept 24 U.S. company Schlumberger said on Thursday it does not intend to extend the pending agreement to acquire a minority equity interest in Eurasia Drilling once the current extension expires on Sept. 30.",
        "date": "09242015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger does not intend to extend agreement to buy stake in Eurasia "
    },
    {
        "content": "* Schlumberger's bid for EDC still to be cleared by Russian govt",
        "date": "09152015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "UPDATE 1-Schlumberger bid for Eurasia stake could face new conditions -RIA "
    },
    {
        "content": "MOSCOW  Sept 15 Russian government may put forward some additional requirements for Schlumberger's  attempted bid to acquire a part of Eurasia Drilling  servicing company  RIA news agency quoted the head of anti-monopoly watchdog as saying on Tuesday.",
        "date": "09152015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Russia may toughen requirements for Schlumberger's bid for Eurasia Drilling - RIA "
    },
    {
        "content": "* Bauer group negotiates partnership in deep drilling business",
        "date": "09102015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "CORRECTED-BRIEF-Bauer AG discussing JV with Schlumberger "
    },
    {
        "content": "* Bauer group negotiates partnership in deep drilling business",
        "date": "09092015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Bauer AG discussing JV with Schlumberger "
    },
    {
        "content": "Schlumberger Ltd  will buy equipment maker Cameron International Corp  for $14.8 billion  as the world's top oilfield services firm scrambles to offer a broader range of products at lower prices to oil companies slashing budgets.",
        "date": "08262015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger to buy oilfield gear maker Cameron in $14.8 billion deal "
    },
    {
        "content": "* Deal should allow Schlumberger to grow market share-analyst",
        "date": "08262015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 5-Schlumberger to buy oilfield gear maker Cameron in $14.8 bln deal "
    },
    {
        "content": "Aug 26 The following bids  mergers  acquisitions and disposals were reported by 1308 GMT on Wednesday:",
        "date": "08262015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Aug 26 Schlumberger Ltd  the world's No.1 oilfield services company  said it will acquire oilfield equipment maker Cameron International Corp in a deal valued at $14.8 billion.",
        "date": "08262015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger to buy Cameron in $14.8 bln deal "
    },
    {
        "content": "HOUSTON Business is so tough for oilfield giants Schlumberger NV and Halliburton Co that they have come up with a new sales pitch for crude producers halting work in the worst downturn in years. It amounts to this: \"frack now and pay later.\"",
        "date": "08072015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "‘Frack now  pay later ’ top services companies say amid oil crash "
    },
    {
        "content": "LONDON  Aug 5 Oil and gas investment fund L1 Energy said on Wednesday it had appointed a former executive from oilfield services firm Schlumberger as president of its Mexican and South America business.",
        "date": "08052015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Russian energy fund names new boss of Mexico  South America business "
    },
    {
        "content": "HOUSTON  Aug 7 Business is so tough for oilfield giants Schlumberger NV and Halliburton Co that they have come up with a new sales pitch for crude producers halting work in the worst downturn in years. It amounts to this: \"frack now and pay later.\"",
        "date": "08072015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "REFILE-RPT-'Frack now  pay later ' top services companies say amid oil crash "
    },
    {
        "content": "HOUSTON  Aug 7 Business is so tough for oilfield giants Schlumberger NV and Halliburton Co that they have come up with a new sales pitch for crude producers halting work in the worst downturn in years. It amounts to this: \"frack now and pay later.\"",
        "date": "08072015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "REFILE-'Frack now  pay later ' top services companies say amid oil crash "
    },
    {
        "content": "NEW YORK  Aug 2 Oilfield services provider Halliburton Co announced in a statement on Sunday it had received a request from the European Commission for additional information about its proposed $35 billion merger with rival Baker Hughes Inc.",
        "date": "08032015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "European regulators ask Halliburton for more merger information-company "
    },
    {
        "content": "July 22 Oilfield services provider Halliburton Co's acquisition of smaller rival Baker Hughes Inc  faces concerns from U.S. antitrust enforcers who believe the $35 billion merger will lead to higher prices and less innovation  according to a source close to the probe.",
        "date": "07222015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-US antitrust worries weigh on Halliburton-Baker Hughes deal -source "
    },
    {
        "content": "Schlumberger Ltd   the world's No.1 oilfield services provider  reported a bigger-than-expected quarterly profit as its cost-cutting efforts helped soften the impact of reduced global drilling activity.",
        "date": "07162015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger profit beats estimates as cost cuts pay off "
    },
    {
        "content": "* N.American rig count may now be touching the bottom - CEO   (Adds CEO and analyst comments  details about results)",
        "date": "07162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger profit beats estimates as cost cuts pay off "
    },
    {
        "content": "Schlumberger NV is betting on an uptick in demand for oilfield services in North America  a market that has been battered by a steep drop in oil prices.",
        "date": "07172015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger betting on slight recovery in North America demand "
    },
    {
        "content": "July 16 Schlumberger Ltd  the world's No. 1 oilfield services provider  reported a 29.5 percent drop in quarterly profit  mainly due to restructuring charges.",
        "date": "07162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger second-qtr profit plunges on restructuring charges "
    },
    {
        "content": "July 17 Schlumberger NV is betting on an uptick in demand for oilfield services in North America  a market that has been battered by a steep drop in oil prices.",
        "date": "07172015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger betting on slight recovery in N.America demand "
    },
    {
        "content": "July 17 Schlumberger Ltd  the world's No. 1 oilfield services provider  expects little improvement in pricing levels in the near future as customers continue to keep a tight lid on budgets  it said on a conference call on Friday.",
        "date": "07172015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-QUOTEBOX-Schlumberger CEO: pricing weak for rest of the year "
    },
    {
        "content": "July 17 Schlumberger Ltd  the world's No. 1 oilfield services provider  expects little improvement in pricing levels in the near future as customers continue to keep a tight lid on budgets  it said on a conference call on Friday.",
        "date": "07172015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "QUOTEBOX-Schlumberger CEO expects weak pricing for the rest of the year "
    },
    {
        "content": "Schlumberger NV  the world's No.1 oilfield services provider  said it would look at returning to Iran once the sanctions are lifted.",
        "date": "07172015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger says evaluating Iran return after sanctions end "
    },
    {
        "content": "July 17 Schlumberger NV  the world's No.1 oilfield services provider  said it will look at operating in Iran once the sanctions are lifted.",
        "date": "07172015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger says to look at Iran return after sanctions lifted "
    },
    {
        "content": "* Subsea 7 announces global alliance with OneSubsea  a company owned by Cameron and Schlumberger",
        "date": "07132015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Subsea 7 and OneSubsea in global alliance "
    },
    {
        "content": "* PGS have executed an MOU (memorandum of understanding) for a cooperation agreement with Spectrum and Schlumberger in Mexico.",
        "date": "07012015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Spectrum  PGS and Schlumberger in cooperation in Mexico "
    },
    {
        "content": "MOSCOW  June 19 Schlumberger Chief Executive Paal Kibsgaard plans to discuss buying stake in Eurasia Drilling during a meeting with Russian President Vladimir Putin  Russia's First Deputy Prime Minister Igor Shuvalov was quoted as saying by Interfax.",
        "date": "06192015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger CEO to discuss Eurasia's deal with Putin - Interfax "
    },
    {
        "content": "* Says Spectrum vessel has arrived in Mexico and started acquisition of their Mexico Gulf of Mexico 2D campaign  in collaboration with Schlumberger",
        "date": "06112015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Spectrum and Schlumberger commence 2D Multi-Client survey offshore Mexico "
    },
    {
        "content": "MOSCOW  May 21 A Russian government commission should decide on Schlumberger's bid for Eurasia Drilling  in two to three weeks  an official from Russia's Federal Antimonopoly Service (FAS) said on Thursday.",
        "date": "05212015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Russia to decide on Schlumberger bid for Eurasia Drilling in 2-3 weeks "
    },
    {
        "content": "MOSCOW  April 30 Russia's Eurasia Drilling  said on Thursday it had  agreed to extend a deadline on a proposed deal to sell a stake to international oilfield services firm Schlumberger from to April 30 to May 31.",
        "date": "04302015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "UPDATE 1-Russia's Eurasia Drilling extends deadline on Schlumberger deal "
    },
    {
        "content": "MOSCOW  April 30 Russia's Eurasia Drilling  said on Thursday it had  agreed to extend a deadline on a proposed deal to sell a stake to international oilfield services firm Schlumberger from to April 30 to May 31.",
        "date": "04302015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Russia's Eurasia Drilling extends deadline on Schlumberger deal "
    },
    {
        "content": "WASHINGTON  April 24 U.S. business investment spending plans fell for a seventh straight month in March  weighed down by a strong dollar and lower energy prices  suggesting the economy was struggling to rebound from a recent soft patch.",
        "date": "04242015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "WRAPUP 2-Weak U.S. business spending data hints at sluggish growth rebound "
    },
    {
        "content": "April 20 Halliburton Co's decision to cut fewer jobs and keep its logistics network intact to capitalize on its pending merger with Baker Hughes Inc  could give Schlumberger NV an edge at a time when cost cuts look like the best way forward.",
        "date": "04202015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Lower cost cuts at Halliburton may give Schlumberger near-term edge "
    },
    {
        "content": "Schlumberger Ltd said it would cut a further 11 000 jobs and reduced its capital spending plan for this year as the world's No.1 oilfield services provider prepares for an extended period of lower activity and pricing pressure  especially in North America.",
        "date": "04162015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger to cut 11 000 more jobs "
    },
    {
        "content": "NEW YORK  April 17 An eventual recovery in U.S. oil drilling activity after the biggest slump in three decades may never reach last year's frenzied pace  according to the world's largest oilfield services company.",
        "date": "04172015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "U.S. oil drilling faces slow recovery  no new highs -Schlumberger "
    },
    {
        "content": "* Total job cuts this year are 20 000  or 15 pct of workforce",
        "date": "04162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger to cut 11 000 more jobs "
    },
    {
        "content": "April 17 Schlumberger Ltd  the world's No.1 oilfield services provider  reported a smaller-than-expected fall in first-quarter margins as it continued to execute tight cost controls to combat a decline in drilling activity.",
        "date": "04172015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-Schlumberger impresses with cost cuts  resilient margins "
    },
    {
        "content": "April 16 Schlumberger Ltd  the world's No.1 oilfield services provider  reported a 38.8 percent drop in quarterly profit and said it would cut a further 11 000 jobs  blaming the fall in drilling activity  particularly in North America.",
        "date": "04162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "CORRECTED-Schlumberger to cut 11 000 more jobs  profit falls 38.8 pct "
    },
    {
        "content": "April 17 Schlumberger Ltd  the world's No. 1 oilfield services provider  said it would cut a further 11 000 jobs and had reduced its capital spending plan for the year in anticipation of an extended lull in activity and slump in pricing.",
        "date": "04172015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-QUOTEBOX-Schlumberger CEO on the effects of low oil prices "
    },
    {
        "content": "April 17 Schlumberger Ltd's shares rose as much as 3.3 percent on Friday  after tight cost controls helped the world's No.1 oilfield services provider report higher-than-expected margins in the first quarter.",
        "date": "04172015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger shares rise as cost cuts impress "
    },
    {
        "content": "April 17 Schlumberger Ltd  the world's No. 1 oilfield services provider  said it would cut a further 11 000 jobs and had reduced its capital spending plan for the year in anticipation of an extended lull in activity and slump in pricing.",
        "date": "04172015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "QUOTEBOX-Schlumberger CEO on the effects of low oil prices "
    },
    {
        "content": "MOSCOW  March 30 Russia's Eurasia Drilling  said on Monday it had agreed to extend a deadline on a proposed deal to sell a stake to international oilfield services firm Schlumberger from March 31 to April 30.",
        "date": "03302015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Eurasia Drilling says extends deadline for Schlumberger deal "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department said on Wednesday that a subsidiary of Schlumberger Oilfield Holdings had pleaded guilty to violating U.S. sanctions related to Iran and Sudan and would pay a $237.2 million fine.",
        "date": "03252015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger pleads guilty to violating U.S. sanctions on Iran  Sudan "
    },
    {
        "content": "WASHINGTON  March 25 The U.S. Justice Department said on Wednesday that a subsidiary of Schlumberger Oilfield Holdings had pleaded guilty to violating U.S. sanctions related to Iran and Sudan and would pay a $237.2 million fine.",
        "date": "03252015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "REFILE-UPDATE 3-Schlumberger pleads guilty to violating U.S. sanctions on Iran  Sudan "
    },
    {
        "content": "March 26 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "03262015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": " (Corrects next-to-last paragraph in March 23 story to show Schlumberger expects international  not global  decline in industry spending on exploration and production)",
        "date": "03242015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Oil rises more than 1 percent  boosted by weaker dollar "
    },
    {
        "content": "The U.S. shale oil industry may have forever abandoned its heavy-spending ways in the face of sliding crude prices  Schlumberger Ltd   the world's No.1 oilfield services provider  said on Monday.",
        "date": "03232015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger sees prudence as new normal for U.S. shale oil "
    },
    {
        "content": "MOSCOW  March 26 Russia's governmental commission on foreign investment has considered a request by oil services giant Schlumberger to buy a 45 percent stake in Eurasia Drilling and a positive decision is possible  the head of the Federal Anti-Monopoly Service said on Thursday.",
        "date": "03262015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-Schlumberger could get approval for Russia's Eurasia Drilling stake - regulator "
    },
    {
        "content": "NEW YORK  March 23 U.S. crude futures settled more than 1 percent higher on Monday  boosted by a falling dollar that outweighed pressure on prices from a global supply glut.",
        "date": "03242015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "CORRECTED-UPDATE 10-Oil rises more than 1 pct  boosted by weaker dollar "
    },
    {
        "content": "March 23 The U.S. shale oil industry may have forever abandoned its heavy-spending ways in the face of sliding crude prices  Schlumberger Ltd  the world's No.1 oilfield services provider  said on Monday.",
        "date": "03232015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 3-Schlumberger sees prudence as new normal for U.S. shale oil "
    },
    {
        "content": "MOSCOW  March 26 Russia's governmental commission on foreign investment has considered Schlumberger's request to buy a 45 percent stake in Eurasia Drilling  and a positive decision is possible  the head of the Federal Anti-Monopoly Service said on Thursday.",
        "date": "03262015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Russia could approve Schlumberger acquisition of Eurasia Drilling stake - anti-monopoly head "
    },
    {
        "content": "March 23 Schlumberger Ltd  the world's No.1 oilfield services provider  said it expects the oil and gas industry's spending internationally on exploration and production to drop by 10-15 percent in 2015.",
        "date": "03232015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "CORRECTED-Schlumberger sees 10-15 pct drop in international E&P spending in 2015 "
    },
    {
        "content": "* Schlumberger sees higher oil prices in second half of 2015   (New throughout  updates prices and market activity to settlement)",
        "date": "03232015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 10-Oil rises more than 1 pct  boosted by weaker dollar "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department said on Wednesday that a subsidiary of Schlumberger Oilfield Holdings had pleaded guilty to violating U.S. sanctions related to Iran and Sudan and would pay a $237.2 million fine.",
        "date": "03262015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger pleads guilty to violating U.S. sanctions on Iran  Sudan "
    },
    {
        "content": "WASHINGTON  March 25 The U.S. Justice Department said on Wednesday that a subsidiary of Schlumberger Oilfield Holdings had pleaded guilty to violating U.S. sanctions related to Iran and Sudan and would pay a $237.2 million fine.",
        "date": "03262015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "REFILE-UPDATE 3-Schlumberger pleads guilty to violating U.S. sanctions on Iran  Sudan "
    },
    {
        "content": "Oilfield giants Schlumberger Ltd  and Halliburton Co  and many others in the oil and gas industry have announced plans to lay off thousands of people in the past few months as global oil prices have halved since June.",
        "date": "03202015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Factbox: U.S. energy companies slash jobs as oil prices weaken "
    },
    {
        "content": "* Caverion and Schlumberger agree on technical maintenance of production plants in Russia",
        "date": "03062015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "BRIEF-Caverion and Schlumberger agree on technical maintenance of production plants in Russia "
    },
    {
        "content": "CARACAS  Feb 27 Venezuela's PDVSA  said on Friday that oil services giant Schlumberger was poised to extend an existing credit line to the South American state oil company  without offering details.",
        "date": "02272015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Venezuela's PDVSA says Schlumberger poised to extend credit line "
    },
    {
        "content": "MOSCOW  Feb 20 Russia's Eurasia Drilling  said on Friday it was delaying a deal to sell a stake in the company to oil services giant Schlumberger while it waited for approval from a Russian regulator.",
        "date": "02202015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "UPDATE 1-Russia's Eurasia Drilling says merger with Schlumberger delayed "
    },
    {
        "content": "MOSCOW  Feb 20 Russia's Eurasia Drilling  said on Friday it was delaying a deal to sell a stake in the company to Schlumberger  pending approval from Russia's Federal Anti-Monopoly Service (FAS).",
        "date": "02202015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Russia's Eurasia Drilling says merger with Schlumberger delayed "
    },
    {
        "content": "WILLISTON  N.D.  Feb 4 Halliburton  Statoil ASA  Hess Corp and other North Dakota energy companies have decided  for now  not to lay off staff in the No. 2 U.S. oil producing state  hoping to be prepared for any prolonged rebound in crude prices.",
        "date": "02042015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Many oil firms plan no North Dakota layoffs despite cheap oil "
    },
    {
        "content": "Driller Helmerich & Payne Inc  said it may cut 2 000 jobs as it begins to idle rigs amid a slide in crude oil prices  following similar cost cuts by top oilfield services providers Schlumberger NV  and Baker Hughes Inc .",
        "date": "01292015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Helmerich & Payne may cut 2 000 jobs as it idles rigs "
    },
    {
        "content": "* Shares fall as much as 10 pct   (Adds analyst  executive comment  background; updates shares)",
        "date": "01292015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Helmerich & Payne may cut 2 000 jobs as it idles rigs "
    },
    {
        "content": "Schlumberger Ltd  the world's No.1 oilfield services provider  said the oil price drop was likely to have a \"significantly more dramatic\" impact on North America than on the rest of the world.",
        "date": "01162015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger: International markets to fare better than North America "
    },
    {
        "content": "* Indexes up: Dow 0.5 pct  S&P 0.7 pct  Nasdaq 0.7 pct   (Updates to late afternoon)",
        "date": "01162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "US STOCKS-Wall St up after 5 down days  helped by data  energy "
    },
    {
        "content": "MOSCOW Oil services giant Schlumberger plans to buy a 45.65 percent stake in Eurasia Drilling for about $1.7 billion  potentially paving the way for it to become the sole owner of Russia's most active oilfield services company.",
        "date": "01202015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger to buy $1.7 billion stake in Russian oil driller "
    },
    {
        "content": "Schlumberger Ltd   the world's No.1 oilfield services provider  said it will cut 9 000 jobs  or about 7 percent of its workforce  as it focuses on controlling costs amid plummeting oil prices.",
        "date": "01152015",
        "name": "Schlumberger NV",
        "news_type": "topStory",
        "symbol": "SLB",
        "title": "Schlumberger to slash 9 000 jobs as oil prices plunge "
    },
    {
        "content": "* Indexes up: Dow 0.27 pct  S&P 0.5 pct  Nasdaq 0.56 pct   (Updates to early afternoon  changes byline)",
        "date": "01162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "US STOCKS-Wall St rises after 5 down days; econ data  energy boost "
    },
    {
        "content": "Jan 16 Schlumberger Ltd  the world's No.1 oilfield services provider  said the oil price drop was likely to have a \"significantly more dramatic\" impact on North America than on the rest of the world.",
        "date": "01162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 1-Schlumberger: International markets to fare better than N.America "
    },
    {
        "content": "* Has option to take full ownership   (Adds Schlumberger comments  detail  background)",
        "date": "01202015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger to buy $1.7 bln stake in Russian oil driller "
    },
    {
        "content": "Jan 15 Schlumberger Ltd  the world's No.1 oilfield services provider  said it will cut 9 000 jobs  or about 7 percent of its workforce  as it focuses on controlling costs amid plummeting oil prices.",
        "date": "01152015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "UPDATE 2-Schlumberger to slash 9 000 jobs as oil prices plunge "
    },
    {
        "content": "Jan 16 Schlumberger Ltd  the world's No.1 oilfield services provider  said the drop in oil prices was likely to have a bigger impact on activity and pricing in North America than in international markets  which is its stronghold.",
        "date": "01162015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger says weak oil prices to impact N. America activity most "
    },
    {
        "content": "Jan 15 Schlumberger Ltd  the world's No.1 oilfield services provider  reported a 6 percent rise in quarterly revenue  helped by efficiency improvements in North America and resilient drilling activity in the Middle East and Asia.",
        "date": "01152015",
        "name": "Schlumberger NV",
        "news_type": "normal",
        "symbol": "SLB",
        "title": "Schlumberger revenue rises 6 pct "
    }
]