[
    {
        "content": "TORONTO Two of Canada's biggest insurance companies reported third-quarter earnings on Wednesday that beat market expectations  benefiting in part from strong growth in Asia.",
        "date": "11082017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Canadian insurers Manulife  Sun Life beat earnings forecasts "
    },
    {
        "content": "* Sun Life looking for more Asian acquisitions (Adds comments from Manulife  Sun Life CEOs)",
        "date": "11082017",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 2-Canadian insurers Manulife  Sun Life beat earnings forecasts "
    },
    {
        "content": "* Q3 earnings per share view c$1.01 -- Thomson Reuters I/B/E/S",
        "date": "11082017",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial posts Q3 ‍reported EPS $1.32​ "
    },
    {
        "content": "* Sun Life Financial increases common share dividend and declares dividends on preferred shares",
        "date": "11082017",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "BRIEF-Sun life Financial raises dividend by to C$0.455/shr "
    },
    {
        "content": "TORONTO  Nov 8 Canadian insurer Sun Life Financial reported third-quarter earnings that were ahead of market expectations  benefiting from a strong performance across all of its businesses.",
        "date": "11082017",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Canadian insurer Sun Life's quarterly earnings beat market view "
    },
    {
        "content": "* Sun Life Global Investments to acquire Excel Funds Management Inc and Excel Investment Counsel Inc",
        "date": "09072017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Global Investments to acquire Excel Funds Management and Excel Investment Counsel "
    },
    {
        "content": "* Sun Life Financial Inc - ‍normal course issuer bid will commence on August 14  2017 and continue until August 13  2018​",
        "date": "08092017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial to commence a normal course issuer bid "
    },
    {
        "content": "* Greig Woodring stepping down from the board of directors of Sun Life Financial Source text for Eikon: Further company coverage:",
        "date": "06022017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Greig Woodring stepping down from the board of Sun Life Financial "
    },
    {
        "content": "TORONTO  May 10 Canada's main stock index rose in early trade on Wednesday  boosted by gains for energy and other resource stocks as oil prices rebounded  while insurer Sun Life Financial Inc and exchange operator TMX Group Ltd fell after reporting quarterly earnings.",
        "date": "05102017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "CANADA STOCKS-TSX rises with energy gains; Sun Life and TMX weigh "
    },
    {
        "content": "* Says announced an increase of 4% or 1.5 cents per share to dividend to be paid on its common shares",
        "date": "05092017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial raises dividend "
    },
    {
        "content": "May 9 Insurer Sun Life Financial Inc reported a smaller-than-expected profit on Tuesday  hurt by weak growth in its U.S market.",
        "date": "05092017",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 1-Canadian insurer Sun Life's profit misses estimates "
    },
    {
        "content": "* qtrly  reported net income $551 million versus $540 million",
        "date": "05092017",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial reports qtrly underlying EPS $0.93 "
    },
    {
        "content": "* Sun Life Financial Inc - Terms of acquisition were not disclosed.",
        "date": "04202017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial to acquire the Premier Dental Group Dental network "
    },
    {
        "content": "* Kevin Strain  currently president  Sun Life Financial Asia  will become executive vice-president & chief financial officer",
        "date": "03282017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial announces executive changes "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 17 (Fitch) Fitch Ratings has affirmed the ratings of Sun Life  Financial Inc. (TSE  NYSE: SLF) including its senior and subordinated notes  as  well as the Insurer Financial Strength (IFS) ratings of SLF's primary Canadian  insurance subsidiary  Sun Life Assurance Co. of Canada (SLAC)  at 'AA-'. A full  list of ratings follows at the end of this release. The Rating Outlook for all  ratings has been revised to Positive fro",
        "date": "03172017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Fitch Revises Sun Life Financial Inc.'s Outlook to Positive; Affirms Ratings "
    },
    {
        "content": "* Sun Life Financial reaffirms medium-term financial objectives  Source text for Eikon:  Further company coverage:",
        "date": "03092017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial reaffirms medium-term financial objectives "
    },
    {
        "content": "Feb 15 Sun Life Financial Inc   Canada's third-largest insurer by assets  reported a 13.3 percent fall in quarterly underlying profit  hurt by weakness in the United States.",
        "date": "02152017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "UPDATE 1-Canadian insurer Sun Life's underlying profit falls 13.3 pct "
    },
    {
        "content": "* Sun Life financial reports fourth quarter and full year 2016 results",
        "date": "02152017",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial posts Q4 operating EPS c$1.19 "
    },
    {
        "content": "* Kansas City Royals and Sun Life Financial U.S. have announced a partnership through 2020 season  Source text for Eikon:  Further company coverage:",
        "date": "02072017",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Kansas City Royals  Sun Life Financial U.S announce deal "
    },
    {
        "content": "* Sun Life Financial Inc - James H. Sutcliffe will be succeeded as chairman by William D. Anderson  Source text for Eikon:  Further company coverage:",
        "date": "02152017",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial announces Chairman succession "
    },
    {
        "content": "Feb 15 Sun Life Financial Inc   Canada's third-largest insurer by assets  reported a 13.3 percent fall in quarterly underlying profit  hurt by weakness in the United States.",
        "date": "02152017",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Canadian insurer Sun Life's underlying profit falls 13.3 pct "
    },
    {
        "content": "* An increase of 4 pct  or 1.5 cents per share  to dividend to be paid on its common shares  Source text for Eikon:  Further company coverage:    (Reporting by Anil D'Silva)",
        "date": "11092016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial raises dividend "
    },
    {
        "content": "Sun Life Financial Inc    Canada's third-largest insurer by assets  reported a better-than-expected quarterly profit on Wednesday  fueled by strong growth in the United States and Canada.",
        "date": "11092016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Sun Life Financial profit beats on strength in U.S.  Canada "
    },
    {
        "content": "Nov 9 Sun Life Financial Inc   Canada's third-largest insurer by assets  reported a better-than-expected quarterly profit on Wednesday  fueled by strong growth in the United States and Canada.",
        "date": "11092016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 1-Sun Life Financial profit beats on strength in U.S.  Canada "
    },
    {
        "content": "* Increase in common share dividend declared of $0.015 per share  to $0.42 per share for quarter",
        "date": "11092016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Qtrly reported EPS $1.20 "
    },
    {
        "content": "Nov 9 Sun Life Financial Inc   Canada's third-largest insurer by assets  reported a 21 percent jump in quarterly underlying profit  helped by strong growth in the United States and Canada.",
        "date": "11092016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Canada's Sun Life Financial reports 21 pct jump in profit "
    },
    {
        "content": "HONG KONG  Oct 4 Canada's Sun Life Financial Inc  plans to expand into Singapore and Thailand as it looks to boost its presence in Asia where demand for insurance products is growing fast  said a senior executive.",
        "date": "10042016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life plans to expand into Singapore  Thailand to boost Asia focus "
    },
    {
        "content": "* Sun life financial announces offering of subordinated unsecured debentures",
        "date": "09132016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial announces offering of subordinated unsecured debentures "
    },
    {
        "content": "TORONTO  Sept 8 Sun Life Financial Inc  is continuing to look for acquisitions  provided they help the Canadian insurer meet its target of a 12 to 14 percent return on equity  Chief Executive Dean Connor said on Thursday.",
        "date": "09082016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Sun Life CEO says looking for acquisitions but bar set high "
    },
    {
        "content": "* Does not intend to exercise right to redeem outstanding class a non-cumulative rate reset preferred shares series 10r on sept 30  2016  Source text for Eikon:  Further company coverage:",
        "date": "08152016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life announces conversion privilege of class A non-cumulative rate reset preferred shares series 10R "
    },
    {
        "content": "TORONTO Canadian insurer Sun Life Financial  will continue to pursue acquisitions through the remainder of 2016  potentially expanding further in Asia  Chief Executive Dean Connor said on Thursday.",
        "date": "08112016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life continues 'aggressive' hunt for acquisitions "
    },
    {
        "content": "Aug 15 - Canada's main stock index was set to open higher on Monday  boosted by higher oil prices.",
        "date": "08152016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "CANADA STOCKS-Futures boosted by higher oil prices "
    },
    {
        "content": "Aug 10 Canadian insurer Sun Life Financial   on Wednesday reported a bigger-than-expected drop in underlying profit for the second quarter.",
        "date": "08112016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 2-Insurer Sun Life Financial's Q2 profit falls more than expected "
    },
    {
        "content": "Canadian insurer Sun Life Financial   on Wednesday reported a bigger-than-expected drop in underlying profit for the second quarter as expenses soared.",
        "date": "08102016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Insurer Sun Life Financial's profit falls more than expected "
    },
    {
        "content": "* Aum were $864.6 billion as at june 30  2016  compared to aum of $891.3 billion as at december 31  2015",
        "date": "08102016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial qtrly operating EPS $0.77 "
    },
    {
        "content": "Aug 10 Canadian insurer Sun Life Financial   reported a near 34 percent drop in quarterly profit  hurt by volatile equity markets following the Brexit vote and low interest rates.",
        "date": "08102016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Canada's Sun Life Financial profit slumps 34 pct "
    },
    {
        "content": "* Launches Digital Health Solutions  to be led by Chris Denys  Source text for Eikon:  Further company coverage:",
        "date": "08042016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial announces launch of Digital Health Solutions "
    },
    {
        "content": "TORONTO  Aug 3 Sun Life Financial Inc  said on Wednesday it will acquire the pension business of FWD Hong Kong in the latest stage of its rapid expansion in Asia.",
        "date": "08032016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life expands further in Asia through Hong Kong acquisition "
    },
    {
        "content": "* Sun Life Financial and Securcor announce $40 million securitization facility with Blue Bridge Financial LLC",
        "date": "07262016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial and Securcor to start a $40 million securitization facility with Blue Bridge Financial LLC "
    },
    {
        "content": "KUALA LUMPUR/SINGAPORE Canada's Sun Life Financial Inc  and Malaysian sovereign wealth fund Khazanah Nasional [KHAZA.UL] are in talks to buy the insurance business of Hong Leong Financial Group Bhd   two banking sources said on Tuesday.",
        "date": "07192016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Khazanah  Sun Life in talks over $750 million Malaysian insurance deal: sources "
    },
    {
        "content": "* Discussions in early stages - banking sources   (Adds details on talks  no comment from companies  background)",
        "date": "07192016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 1-Khazanah  Sun Life in talks over $750 mln Malaysian insurance deal-sources "
    },
    {
        "content": "KUALA LUMPUR/SINGAPORE  July 19 Canada's Sun Life Financial Inc and Malaysian sovereign wealth fund Khazanah Nasional are in talks to buy the insurance business of Hong Leong Financial Group Bhd  two banking sources said on Tuesday.",
        "date": "07192016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Khazanah  Sun Life in talks over $750 mln Malaysian insurance deal -sources "
    },
    {
        "content": "TORONTO  May 10 Sun Life Financial Inc  on Tuesday reported a 13 percent increase in underlying net income in the first quarter  exceeding estimates as it benefited from strong growth in the United States and Canada.",
        "date": "05102016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Sun Life profit beats hopes  helped by strong U.S. growth "
    },
    {
        "content": "TORONTO  May 11 Canada's third biggest life insurer Sun Life Financial Inc does not need to make acquisitions to drive future growth and is focusing on developing existing businesses  its chief executive said.",
        "date": "05112016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life does not need to make acquisitions to drive growth -CEO "
    },
    {
        "content": "* Sun life financial increases dividend  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "05102016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial increases dividend "
    },
    {
        "content": "* Sun life financial inc. Announces intention to redeem series b senior unsecured 4.95% fixed/floating debentures",
        "date": "04042016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial to redeem series B senior unsecured 4.95 pct fixed/floating debentures "
    },
    {
        "content": "TORONTO  March 23 Sun Life Financial Inc  expects to make further acquisitions in Asia  the Canadian insurer said  after agreeing on Wednesday to take full control of its Indonesian business by buying out partner CIMB Group.",
        "date": "03232016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "CORRECTED-UPDATE 1-Sun Life eyes more Asia expansion after Indonesian deal "
    },
    {
        "content": "TORONTO  March 23 Canadian insurer Sun Life Financial said on Wednesday it had agreed to buy the remaining 51 percent of CIMB Sun Life (CSL) in Indonesia from its partner CIMB Group to further expand its presence in a key Asian market.",
        "date": "03232016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Sun Life to buy remaining 51 pct of CSL in Indonesia "
    },
    {
        "content": "* Sun Life Financial to acquire remaining 51 pct of CIMB Sun Life in Indonesia",
        "date": "03232016",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "BRIEF-Sun Life Financial to acquire remaining 51 pct of CIMB Sun Life in Indonesia "
    },
    {
        "content": "TORONTO Insurer Sun Life Financial Inc reported higher fourth-quarter earnings  driven by growth in its Canadian  Asian and asset management businesses.",
        "date": "02102016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life fourth-quarter profit rises on growth from Canada  Asia "
    },
    {
        "content": "TORONTO  Jan 26 Canadian insurer Sun Life Financial Inc signed a C$530 million ($375.59 million) annuity deal on Tuesday with two Canadian companies looking to reduce the risk on their pension plans.",
        "date": "01262016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Canada's Sun Life signs C$530 million annuity deal "
    },
    {
        "content": "Jan 11 Canadian insurer Sun Life Financial Inc  appointed Deutsche Bank AG's Randolph Brown as its chief investment officer  effective immediately.",
        "date": "01112016",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "MOVES-Sun Life Financial names Randolph Brown chief investment officer "
    },
    {
        "content": "TORONTO/MUMBAI Canada's Sun Life Financial Inc  signalled the significance of the fast growing Indian insurance market by revealing plans on Wednesday to increase its stake in life insurance joint venture Birla Sun Life Insurance  to 49 percent.",
        "date": "12022015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Canada's Sun Life to raise stake in Indian insurance joint venture "
    },
    {
        "content": "TORONTO/MUMBAI  Dec 2 Canada's Sun Life Financial Inc signalled the significance of the fast growing Indian insurance market by revealing plans on Wednesday to increase its stake in life insurance joint venture Birla Sun Life Insurance  to 49 percent.",
        "date": "12022015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 1-Canada's Sun Life to raise stake in Indian insurance joint venture "
    },
    {
        "content": "MUMBAI  Dec 2 Canada's Sun Life Financial Inc  will increase its stake in its Indian life insurance joint venture  Birla Sun Life Insurance  to 49 percent by spending 16.64 billion rupees ($250 million)  the companies said on Wednesday.",
        "date": "12022015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Canada's Sun Life raising stake in Indian insurance JV for $250 mln "
    },
    {
        "content": "TORONTO Canadian insurer Sun Life Financial Inc  is scouting for acquisitions to boost its asset management businesses in the United States and Canada  following a string of deals this year  its top executive said on Thursday.",
        "date": "11052015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life CEO mulls asset management acquisitions in U.S.  Canada "
    },
    {
        "content": "TORONTO  Nov 4 Canadian insurer Sun Life Financial Inc reported a higher quarterly profit and raised its dividend on Wednesday  helped by strength in both its wealth management and life insurance businesses.",
        "date": "11042015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Sun Life posts higher quarterly profit "
    },
    {
        "content": "Nov 5 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "11052015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Canadian insurer Sun Life Financial Inc  said it would buy New York-based insurer Assurant Inc's  employee-benefits business for $975 million  creating the sixth largest group benefits business in the United States.",
        "date": "09092015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life to buy U.S. insurer Assurant's unit for $975 million "
    },
    {
        "content": "Sept 9 Canadian insurer Sun Life Financial Inc  said it would buy New York-based insurer Assurant Inc's  employee-benefits business for $975 million  creating the sixth largest group benefits business in the United States.",
        "date": "09092015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 1-Sun Life to buy U.S. insurer Assurant's unit for $975 mln "
    },
    {
        "content": "Sept 9 Canadian insurer Sun Life Financial Inc  said it would buy New York-based insurer Assurant Inc's  employee-benefits business for $975 million  creating the sixth largest group benefits business in the United States.",
        "date": "09092015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Canadian insurer Sun Life to buy Assurant's unit for $975 mln "
    },
    {
        "content": "Canadian insurer Sun Life Financial Inc  is in talks to buy New York-based insurer Assurant Inc's  employee-benefits unit for about $900 million  Bloomberg reported  citing people familiar with the matter.",
        "date": "08242015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Canada's Sun Life in talks to buy Assurant's unit: Bloomberg "
    },
    {
        "content": "Aug 24 Canadian insurer Sun Life Financial Inc  is in talks to buy New York-based insurer Assurant Inc's employee-benefits unit for about $900 million  Bloomberg reported  citing people familiar with the matter.",
        "date": "08242015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Canada's Sun Life in talks to buy Assurant's unit -Bloomberg "
    },
    {
        "content": "Aug 6 The following bids  mergers  acquisitions and disposals were reported by 2045 GMT on Thursday:",
        "date": "08062015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "TORONTO Canadian insurer Sun Life Financial Inc is interested in raising its stake in its Birla Sun Life Insurance joint venture in India as it weighs several acquisition opportunities in Asia and North America  its top executive said on Thursday.",
        "date": "08072015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life eyes bigger stake in India insurance venture "
    },
    {
        "content": "TORONTO Canadian insurer Sun Life Financial Inc  is interested in raising its stake in its Birla Sun Life Insurance joint venture in India as it weighs several acquisition opportunities in Asia and North America  its top executive said on Thursday.",
        "date": "08062015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Sun Life eyes bigger stake in India insurance venture - CEO "
    },
    {
        "content": "Aug 5 Canadian insurer Sun Life Financial Inc  reported a quarterly profit that breezed past analysts estimates  driven by growth in all its businesses and a weaker Canadian dollar.",
        "date": "08052015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "UPDATE 1-Canadian insurer Sun Life's profit beats estimates "
    },
    {
        "content": "Aug 5 Canadian insurer Sun Life Financial Inc  reported a higher quarterly profit  driven by growth in all of its businesses.",
        "date": "08052015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Canadian insurer Sun Life's profit rises "
    },
    {
        "content": "June 30 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06302015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Sun Life Financial Inc  said on Tuesday it will buy U.S.-based investment management company Prime Advisors Inc  the latest deal by the Canadian insurer as it seeks to expand its asset management operations.",
        "date": "06302015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Sun Life to buy investment manager Prime Advisors "
    },
    {
        "content": "June 30 Sun Life Financial Inc said on Tuesday it will buy U.S.-based investment management company Prime Advisors Inc  the latest deal by the Canadian insurer as it seeks to expand its asset management operations.",
        "date": "06302015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 1-Sun Life to buy investment manager Prime Advisors "
    },
    {
        "content": "June 30 Canadian insurer Sun Life Financial Inc  said it would buy investment management company Prime Advisors Inc to expand its asset management portfolio.",
        "date": "06302015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Sun Life to buy investment management firm Prime Advisors "
    },
    {
        "content": "MONTREAL  TORONTO June 15 Sun Life Financial  said Monday it is acquiring North American real estate investment manager Bentall Kennedy Group for C$560 million  as part of the financial services group's larger strategy to expand its capabilities in commercial property.",
        "date": "06152015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "UPDATE 1-Sun Life to acquire real estate manager Bentall Kennedy for C$560 million "
    },
    {
        "content": "MONTREAL  June 15 Sun Life Financial  said Monday it is acquiring North American real estate investment manager Bentall Kennedy Group for C$560 million  as part of the financial services group's broader investment diversification strategy.",
        "date": "06152015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Sun Life to acquire real estate manager Bentall Kennedy for C$560 million "
    },
    {
        "content": "TORONTO  May 6 Canadian insurer Sun Life Financial Inc expects gains in its Asian and asset management segments to drive growth this year and beyond  it's chief executive said on Wednesday.",
        "date": "05062015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life CEO sees Asian  asset management units driving growth "
    },
    {
        "content": "TORONTO  May 5 Canadian insurer Sun Life Financial Inc reported a higher quarterly profit on Tuesday  driven by strength in its asset management business and healthy growth in Asia.",
        "date": "05052015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life posts higher profit on strength in asset management  Asia "
    },
    {
        "content": "March 5 Canadian insurer Sun Life Financial Inc   said it expects annual medium-term earnings growth of 8 percent to 10 percent on a per share basis.",
        "date": "03052015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life forecasts medium-term annual profit growth of 8-10 pct "
    },
    {
        "content": "TORONTO  March 1 Canadian insurance company Sun Life Financial Inc said it was looking for acquisition opportunities in business areas such as wealth management that are less impacted low interest rates.",
        "date": "03012015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life eyeing acquisitions in areas more immune to low rates "
    },
    {
        "content": "TORONTO  March 3 Telecommunications provider BCE Inc has reached a deal to transfer the longevity risk for C$5 billion ($4.01 billion) of pension plan liabilities to insurer Sun Life Financial Inc  the companies said on Tuesday.",
        "date": "03032015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "UPDATE 1-Telecoms firm BCE to shift pension fund longevity risk to Sun Life "
    },
    {
        "content": "TORONTO  March 3 Telecommunications provider BCE Inc has reached a deal to transfer the longevity risk for C$5 billion ($4.01 billion) of pension plan liabilities to insurer Sun Life Financial Inc  the companies said on Tuesday.",
        "date": "03032015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Telecoms firm BCE to shift pension fund longevity risk to Sun Life "
    },
    {
        "content": "TORONTO Sun Life Financial  reported a lower fourth-quarter profit on Wednesday  but the Canadian insurer said it was on track to exceed its 2015 earnings target.",
        "date": "02112015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life posts lower profit  says 2015 on track "
    },
    {
        "content": "TORONTO  Feb 11 Sun Life Financial  reported a lower fourth-quarter profit on Wednesday  but the Canadian insurer said it was on track to exceed its 2015 earnings target.",
        "date": "02112015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 1-Sun Life posts lower profit  says 2015 on track "
    },
    {
        "content": "* Bombardier tumbles after posting loss  shuffling management",
        "date": "02122015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "CANADA STOCKS-TSX shrugs off insurer gloom; banks and energy lead "
    },
    {
        "content": "* Bombardier tumbles after posting loss  shuffling management",
        "date": "02122015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "CANADA STOCKS-TSX steady as insurers slip on results  energy gains "
    },
    {
        "content": "TORONTO  Feb 11 Canadian insurer Sun Life Financial reported a much weaker-than-expected fourth-quarter profit on Wednesday  hurt by disappointing earnings from its U.S. group life and disability operations  but said it was on track to exceed its 2015 earnings target.",
        "date": "02122015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 2-Sun Life Q4 profit misses estimates  but set to beat 2015 targets "
    },
    {
        "content": "Sun Life Financial Inc will buy New York-based Ryan Labs Asset Management in a deal the Canadian insurer hopes will help it win more business with U.S. pension funds and other institutional investors  Sun Life said on Wednesday.",
        "date": "01282015",
        "name": "Sun Life Financial Inc",
        "news_type": "topStory",
        "symbol": "SLF",
        "title": "Sun Life buys Ryan Labs in quest for U.S. pension assets "
    },
    {
        "content": "Jan 28 Sun Life Financial Inc will buy New York-based Ryan Labs Asset Management in a deal the Canadian insurer hopes will help it win more business with U.S. pension funds and other institutional investors  Sun Life said on Wednesday.",
        "date": "01282015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "UPDATE 1-Sun Life buys Ryan Labs in quest for U.S. pension assets "
    },
    {
        "content": "TORONTO  Jan 28 Sun Life Financial Inc  will buy New York-based Ryan Labs Asset Management in a deal the Canadian insurer hopes will help it win more business with U.S. pension funds and other institutional investors  Sun Life said on Wednesday.",
        "date": "01282015",
        "name": "Sun Life Financial Inc",
        "news_type": "normal",
        "symbol": "SLF",
        "title": "Sun Life buys U.S. asset manager Ryan Labs "
    }
]