[
    {
        "content": "* Q3 earnings per share view $0.17 -- Thomson Reuters I/B/E/S",
        "date": "10182017",
        "name": "SLM Corporation",
        "news_type": "topStory",
        "symbol": "SLM",
        "title": "BRIEF-Sallie Mae reports Q3 core earnings per share $0.17 "
    },
    {
        "content": "PHILADELPHIA Lakisha Johnson figured all she needed was her 2016 tax refund to get her and her daughter out of a homeless shelter and back into a place of their own. | Video ",
        "date": "07252017",
        "name": "SLM Corporation",
        "news_type": "normal",
        "symbol": "SLM",
        "title": "Special Report: Herded into default  then hounded to repay student loans "
    },
    {
        "content": "PHILADELPHIA  July 25 Lakisha Johnson figured all she needed was her 2016 tax refund to get her and her daughter out of a homeless shelter and back into a place of their own.",
        "date": "07252017",
        "name": "SLM Corporation",
        "news_type": "normal",
        "symbol": "SLM",
        "title": "SPECIAL REPORT-Herded into default  then hounded to repay student loans "
    },
    {
        "content": "* Q2 earnings per share view $0.16 -- Thomson Reuters I/B/E/S",
        "date": "07192017",
        "name": "SLM Corporation",
        "news_type": "topStory",
        "symbol": "SLM",
        "title": "BRIEF-Sallie Mae reports Q2 GAAP earnings per share $0.15 "
    },
    {
        "content": "* Q1 earnings per share view $0.15 -- Thomson Reuters I/B/E/S",
        "date": "04192017",
        "name": "SLM Corporation",
        "news_type": "topStory",
        "symbol": "SLM",
        "title": "BRIEF-Sallie Mae Q1 gaap earnings per share $0.20 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  April 05 (Fitch) Fitch Ratings has published a Long-term Issuer Default Rating (IDR) of 'BB' for SLM Corporation (SLM) and Sallie Mae Bank. The Rating Outlook is Positive. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS IDRs  VR  AND SENIOR DEBT SLM's ratings reflect its market leading position in the U.S. private education loan industry  predominately prime loan portfolio and high co-signo",
        "date": "04052017",
        "name": "SLM Corporation",
        "news_type": "topStory",
        "symbol": "SLM",
        "title": "Fitch Publishes 'BB' Ratings for SLM Corporation; Outlook Positive "
    },
    {
        "content": "* Intends to use net proceeds to redeem its outstanding 6.97 percent series A preferred stock Source text for Eikon: Further company coverage:",
        "date": "03312017",
        "name": "SLM Corporation",
        "news_type": "topStory",
        "symbol": "SLM",
        "title": "BRIEF-SLM Corporation announces public offering of senior notes "
    },
    {
        "content": "* Sallie Mae reports fourth-quarter and full-year 2016 financial results",
        "date": "01182017",
        "name": "SLM Corporation",
        "news_type": "topStory",
        "symbol": "SLM",
        "title": "BRIEF-Sallie Mae reports Q4 earnings per share $0.15 "
    },
    {
        "content": "* Neither co  Sallie Mae bank  nor any of their current units are named in lawsuit related to  CFP bureau's complaint against Navient Corp  Source text for Eikon:  Further company coverage:",
        "date": "01182017",
        "name": "SLM Corporation",
        "news_type": "normal",
        "symbol": "SLM",
        "title": "BRIEF-Sallie Mae says company and current units not named in Navient lawsuit "
    },
    {
        "content": "* Said on Monday entered into management agreement with SLM Partners AS",
        "date": "11152016",
        "name": "SLM Corporation",
        "news_type": "topStory",
        "symbol": "SLM",
        "title": "BRIEF-Agasti Holding: Tore Viana-Rønning to act as CEO "
    },
    {
        "content": "* Q3 earnings per share view $0.11 -- Thomson Reuters I/B/E/S",
        "date": "10192016",
        "name": "SLM Corporation",
        "news_type": "topStory",
        "symbol": "SLM",
        "title": "BRIEF-Sallie Mae Q3 GAAP earnings per share $0.12 "
    },
    {
        "content": "* Qtrly private education loan provision for loan losses of $42 million  up from $15 million",
        "date": "07202016",
        "name": "SLM Corporation",
        "news_type": "topStory",
        "symbol": "SLM",
        "title": "BRIEF-Sallie Mae Q2 GAAP earnings per share $0.12 "
    },
    {
        "content": "NEW YORK  June 28 There is some good news for American parents terrified about the rising costs of college outstripping inflation and their investments: the average amount families spent on college actually went down last year.",
        "date": "06292016",
        "name": "SLM Corporation",
        "news_type": "normal",
        "symbol": "SLM",
        "title": "YOUR MONEY-College costs dip slightly  but still cause anxiety "
    },
    {
        "content": "WASHINGTON Republican presidential candidates Marco Rubio and Ted Cruz  released tax returns for several years on Saturday in an effort to pressure billionaire front-runner Donald Trump to follow suit.",
        "date": "02282016",
        "name": "SLM Corporation",
        "news_type": "normal",
        "symbol": "SLM",
        "title": "Republicans Rubio  Cruz release taxes  piling pressure on Trump "
    }
]