[
    {
        "content": "* Gains from selling stock holdings rise over H1 (Recasts with quarterly figures  adds stock sale gains)",
        "date": "11142017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "UPDATE 1-SMFG Q2 profit lifted by gains from selling stock holdings "
    },
    {
        "content": "TOKYO  Nov 14 Sumitomo Mitsui Financial Group (SMFG) on Tuesday reported a 17 percent rise in net profit for the six months ended September  helped by gains from selling stock holdings.",
        "date": "11142017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "SMFG 6-month profit lifted by gains from selling stock holdings "
    },
    {
        "content": "* Says it and Sumitomo Corporation entered into a basic agreement concerning the reorganization of their joint leasing partnership",
        "date": "11062017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "BRIEF-Sumitomo Mitsui Financial Group to cut voting power in Sumitomo Mitsui Finance and Leasing "
    },
    {
        "content": "* Says Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"A+\" -R&I",
        "date": "10272017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "BRIEF-R&I affirms Sumitomo Mitsui Financial Group's rating at \"A+\" and says stable outlook - R&I "
    },
    {
        "content": "* Sumitomo Mitsui Financial Group and Yahoo Japan are forming a joint venture - Nikkei‍​",
        "date": "08082017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "BRIEF-Sumitomo Mitsui Financial Group and Yahoo Japan forming a JV- Nikkei‍​ "
    },
    {
        "content": "TOKYO  July 31 Sumitomo Mitsui Financial Group (SMFG) on Monday said net profit jumped 31 percent for its first quarter  helped by gains from part of its holdings in corporate clients' shares.",
        "date": "07312017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "SMFG Q1 net profit up 31 pct y/y  helped by equity holding sale "
    },
    {
        "content": "TOKYO Japanese lender Sumitomo Mitsui Financial Group Inc  will make Frankfurt its new European headquarters as it prepares for Britain's exit from the European Union in 2019  the Nikkei business daily reported on Saturday.",
        "date": "07012017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan's SMFG  preparing for Brexit  to make Frankfurt EU base: Nikkei "
    },
    {
        "content": "TOKYO  July 1 Japanese lender Sumitomo Mitsui Financial Group Inc will make Frankfurt its new European headquarters as it prepares for Britain's exit from the European Union in 2019  the Nikkei business daily reported on Saturday.",
        "date": "07012017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "Japan's SMFG  preparing for Brexit  to make Frankfurt EU base - Nikkei "
    },
    {
        "content": "TOKYO Takata Corp will seek bankruptcy protection from creditors on Monday  two sources said  as the Japanese company faces billions of dollars in liabilities stemming from the biggest recall in automotive history.",
        "date": "06222017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Takata to file for bankruptcy Monday  SMFG to provide bridge loan -sources "
    },
    {
        "content": "TOKYO Takata Corp  will seek bankruptcy protection from creditors on Monday  two sources said  as the Japanese company faces billions of dollars in liabilities stemming from the biggest recall in automotive history.",
        "date": "06222017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "Takata to file for bankruptcy Monday  SMFG to provide bridge loan: sources "
    },
    {
        "content": "* SMBC to provide bridge loans worth tens of blns of yen -sources",
        "date": "06222017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "UPDATE 1-Takata to file for bankruptcy Monday  SMFG to provide bridge loan -sources "
    },
    {
        "content": "TOKYO Japanese lender Sumitomo Mitsui Financial Group (SMFG)  is looking to acquire asset management firms at home and abroad as well as commercial banks in emerging Asia to boost growth amid falling loan income and stricter bank regulation  its CEO said.",
        "date": "05312017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan lender SMFG eyeing M&A in asset management  banking for growth "
    },
    {
        "content": "TOKYO  May 15 Sumitomo Mitsui Financial Group (SMFG) reported on Monday a 9.3 percent rise in net profit for the year ended in March  thanks mostly to the absence of hefty provisions booked in the previous year.",
        "date": "05152017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan bank SMFG's annual profit up 9.3 pct  sees it falling this year "
    },
    {
        "content": "TOKYO  May 2 CVC Capital Partners said on Tuesday it has hired a former executive of Sumitomo Mitsui Financial Group as president of Japan operations.",
        "date": "05022017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "CVC taps former Sumitomo executive as Japan president "
    },
    {
        "content": "* Receives repeat order from Sumitomo for gan-on-sic production technology  Source text for Eikon:  Further company coverage:   (Gdynia Newsroom)",
        "date": "03222017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "BRIEF-Aixtron receives repeat order from Sumitomo for GaN-on-SiC production technology "
    },
    {
        "content": "* Says to launch tender offer for Sumitomo Real Estate Sales  at 3 600 yen per share  expects to spend 61 billion yen ($538 million)  Further company coverage:  ($1 = 113.3500 yen)   (Reporting By Chris Gallagher)",
        "date": "03172017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "BRIEF-Sumitomo Realty to launch tender offer for Sumitomo Real Estate Sales "
    },
    {
        "content": "TOKYO Japan's Sumitomo Mitsui Financial Group Inc (SMFG) and Resona Holdings Inc said on Friday they have agreed to combine their regional banks in the face of tough market conditions that are widely expected to worsen.",
        "date": "03032017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan's SMFG  Resona agree to combine three regional lenders "
    },
    {
        "content": "March 3 Sumitomo Mitsui Financial Group Inc   and Resona Holdings Inc:",
        "date": "03032017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "BRIEF-Japan's SMFG  Resona agree to combine regional lenders "
    },
    {
        "content": "TOKYO  March 3 Japanese banks Sumitomo Mitsui Financial Group (SMFG) and Resona Holdings Inc said on Friday they have agreed to merge their regional lenders  as they face tough market conditions that are expected to worsen in the future.",
        "date": "03032017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "Japan's SMFG  Resona agree to combine regional lenders "
    },
    {
        "content": "TOKYO Sumitomo Mitsui Financial Group  (SMFG) and Resona Holdings Inc  are in talks to merge some of their units  sources said  in what would be the latest in a slow but steady wave of consolidation in Japan's regional banking industry.",
        "date": "02202017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan's SMFG  Resona in talks to combine regional units: sources "
    },
    {
        "content": "TOKYO  Feb 20 Sumitomo Mitsui Financial Group (SMFG) and Resona Holdings Inc are in talks to merge their regional banks  sources with knowledge of the deal said on Monday.",
        "date": "02202017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "Japan's SMFG  Resona in talks to combine regional units -sources "
    },
    {
        "content": "TOKYO Japan's Sumitomo Mitsui Financial Group (SMFG) posted a 22 percent drop in quarterly profits on Friday  as the country's third-largest lender continued to struggle in an ultra-low interest rate environment.",
        "date": "01272017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan's SMFG posts smaller third-quarter profit  low interest rates drag "
    },
    {
        "content": "* Reiterates full-year yen net profit forecast of 700 billion yen",
        "date": "01272017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "UPDATE 2-Japan's SMFG posts smaller Q3 profit  low interest rates drag "
    },
    {
        "content": "TOKYO  Jan 27 Sumitomo Mitsui Financial Group  (SMFG) on Friday reported a 13 percent drop in net profit for the nine months ended December  hurt by low interest rates.",
        "date": "01272017",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "Japan's SMFG posts smaller 9-month profit  low interest rates drag "
    },
    {
        "content": "TOKYO  Nov 14 Sumitomo Mitsui Financial Group (SMFG) on Monday reported a 7.5 percent fall in first-half profit  joining its rivals hurt by low interest rates at home and overseas.",
        "date": "11142016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "SMFG H1 profit falls  hurt by low interest rates "
    },
    {
        "content": "* Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"A+\" -R&I",
        "date": "11042016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "BRIEF-R&I affirms Sumitomo Mitsui Financial Group Inc's rating at \"A+\" and announces stable outlook -R&I "
    },
    {
        "content": "* Keeps full-year net profit forecast at Y700 bln   (Adds full-year forecast  details)",
        "date": "07272016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "UPDATE 1-Japan bank SMFG's Q1 profit skids 31 pct  negative interest rates weigh "
    },
    {
        "content": "TOKYO  July 27 Sumitomo Mitsui Financial Group   Japan's third-largest lender  said net profit fell 31 percent in the first-quarter  with returns on loans and bond investments hurt by the negative interest rate policy adopted by the country's central bank.",
        "date": "07272016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "Japan bank SMFG's Q1 profit skids 31 pct  negative interest rates weigh "
    },
    {
        "content": "* Says the co set up an agency JV  which is engaged in fields of insurance  financial products  investment and bank  with Sumitomo Life Insurance Company On June 30",
        "date": "06302016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "BRIEF-Yamaguchi Financial Group sets up agency JV with Sumitomo Life Insurance Company "
    },
    {
        "content": "TOKYO  May 12 Sumitomo Mitsui Financial Group (SMFG)  Japan's No. 3 lender  said on Thursday it will adopt a western-style board structure that gives more power to outside directors as part of measures aimed at improving corporate governance.",
        "date": "05122016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan bank SMFG says plans board reforms to empower outside directors "
    },
    {
        "content": "TOKYO  May 13 Japan's Sumitomo Mitsui Financial Group Inc (SMFG) on Friday said profit fell 14.2 percent in the last business year  missing analyst estimates  brought down by weakness in its lending and brokerage businesses.",
        "date": "05132016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan's SMFG says profit fell 14.2 pct last year  missing analyst estimates "
    },
    {
        "content": "* Mitsubishi UFJ Financial Group expected to report consolidated net profit of around 950 billion yen ($8.74 billion) for year ended March 31 - Nikkei",
        "date": "04282016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "BRIEF-Sumitomo Mitsui Financial Group's bottom line is seen at over 650 bln yen for year ended March 31- Nikkei "
    },
    {
        "content": "* Elliott says BEA's measures too little too late   (Adds Elliott's comments  updates share price)",
        "date": "02152016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "UPDATE 1-Hong Kong's BEA rejects activist investor Elliott's demand for bank sale "
    },
    {
        "content": "HONG KONG  Feb 15 Bank of East Asia Ltd   a family-run Hong Kong lender  rejected a call by activist investor Elliott Management Corp to put the bank up for sale  saying the challenging economic and business environment would bode ill for such a process.",
        "date": "02152016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "Hong Kong's BEA rejects activist investor Elliott's demand for bank sale "
    },
    {
        "content": "TOKYO  Jan 26 Sumitomo Mitsui Financial Group Inc (SMFG) reported on Tuesday an 8.2 percent fall in net profit for the nine months ended in December  hurt by impairment charges on its minority stake in an Indonesian lender.",
        "date": "01262016",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan bank SMFG's 9-month profit falls on Indonesian impairment "
    },
    {
        "content": "(The following statement was released by the rating agency) TOKYO  December 20 (Fitch) Fitch Ratings says that the recent announcement by  Sumitomo Mitsui Financial Group  Inc. (SMFG  A/Stable) that its 60%-owned  subsidiary Sumitomo Mitsui Finance and Leasing Company  Limited (SMFL) had  agreed  subject to regulatory approval  to fully acquire General Electric  Group's (GE) leasing operation in Japan will have no rating impact on SMFG and  its subsidiary banks. Fitch views the acquisition as sm",
        "date": "12212015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Fitch: No Rating Impact on SMFG from GE Japan Deal "
    },
    {
        "content": "TOKYO  Dec 25 Sumitomo Mitsui Financial Group  is seeking to buy into the rapidly growing financial technology sector ahead of the lifting of a ban on such investments next year  the president of Japan's third-largest bank said.",
        "date": "12242015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan's SMFG says eyeing fintech investments ahead of regulation change "
    },
    {
        "content": "TOKYO Sumitomo Mitsui Financial Group Inc (SMFG)  agreed to buy General Electric's  Japanese leasing business for $4.8 billion  the two companies said on Tuesday.",
        "date": "12152015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "SMFG agrees to buy GE's Japan leasing business for $4.8 billion "
    },
    {
        "content": "TOKYO  Nov 13 Sumitomo Mitsui Financial Group (SMFG) is looking to buy General Electric Co's  Japan-based leasing business for under 600 billion yen ($4.89 billion)  the Nikkei business daily reported on Friday.",
        "date": "11132015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "SMFG aims to buy GE's Japan leasing business for under $4.9 bln-Nikkei "
    },
    {
        "content": "TOKYO Sumitomo Mitsui Financial Group Inc (SMFG) is planning to book an impairment loss of around $500 million on its minority stake in Indonesian lender PT Bank Tabungan Pensiunan Nasional Tbk (BTPN)  sources with knowledge of the matter said on Thursday.",
        "date": "10222015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Exclusive: SMFG to book first-half impairment loss of $500 million on BTPN stake - sources "
    },
    {
        "content": "TOKYO  Oct 22 Sumitomo Mitsui Financial Group Inc (SMFG) is planning to book an impairment loss of around 60 billion yen ($500 million) on its 40 percent stake in Indonesian lender PT Bank Tabungan Pensiunan Nasional Tbk (BTPN)   sources with knowledge of the matter said on Thursday.",
        "date": "10222015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "SMFG to book $500 mln impairment loss on BTPN stake - sources "
    },
    {
        "content": "TOKYO  July 3 Japan's Sumitomo Mitsui Financial Group Inc (SMFG) is considering setting a numerical target to reduce ownership of shares in client companies  a source familiar with the matter said on Friday.",
        "date": "07032015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "Japan's SMFG plans lower shareholdings in client firms - source "
    },
    {
        "content": "TOKYO  June 18 The chairman of the Japanese Bankers Association on Thursday said a requirement in Japan's new corporate governance code is likely to make it easier for lenders to sell their holdings of clients' stocks.",
        "date": "06182015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "Japan bankers head: new governance code will make it easy to sell stock holdings "
    },
    {
        "content": "TOKYO  May 13 Japanese lender Sumitomo Mitsui Financial Group posted a smaller-than-forecast drop in annual profit on strong bond trading gains and lower bad loan costs  and paid a more generous dividend heeding calls for bigger shareholder returns.",
        "date": "05132015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "UPDATE 1-Japan lender SMFG's profit better than own forecast  ups dividend "
    },
    {
        "content": "TOKYO  May 13 Sumitomo Mitsui Financial Group Inc (SMFG) said on Wednesday net profit fell 10 percent for the year ended in March but the results were better than its own forecast  helped by strong markets division profits and subdued bad-loan costs.",
        "date": "05132015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "Japan Sumitomo Mitsui Fin annual profit dips but beats own forecast "
    },
    {
        "content": "Lender PT Bank Sumitomo Mitsui Indonesia  a unit of Japan's Sumitomo Mitsui Financial Group Inc  issued 1 trillion rupiah ($79.4 million) worth medium-term notes of three-year tenure on Feb. 3  the Kontan newspaper reported  citing a company statement.",
        "date": "02042015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "INDONESIA PRESS-Bank Sumitomo Mitsui Indonesia issues 1 trillion rph medium-term notes-Kontan "
    },
    {
        "content": "* Outstanding overseas loans  domestic loans at unit show growth   (Adds details on Q3 earnings  loans growth and analyst comment)",
        "date": "01272015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "topStory",
        "symbol": "SMFG",
        "title": "UPDATE 1-Japan Sumitomo Mitsui's Q3 net up on QE boost to brokerage business "
    },
    {
        "content": "TOKYO  Jan 27 Sumitomo Mitsui Financial Group Inc (SMFG)  Japan's third-largest lender by assets  reported a 3.2 percent fall in net profit for the nine months ended in December as weaker client activities hurt its stock brokerage business.",
        "date": "01272015",
        "name": "Sumitomo Mitsui Financial Group Inc",
        "news_type": "normal",
        "symbol": "SMFG",
        "title": "Japan's Sumitomo Mitsui 9-month net dips on weaker brokerage business "
    }
]