[
    {
        "content": "* Futures down: Dow 108 pts  S&P 11 pts  Nasdaq 21.5 pts (Adds comment  details on consumer prices and retail sales)",
        "date": "11152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St set for lower open on oil slide "
    },
    {
        "content": "Nov 13 U.S. sports broadcaster ESPN launched its flagship SportsCenter program on messaging app Snapchat on Monday  reimagining the show that provides sports highlights and commentary into a short-form series.",
        "date": "11132017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "ESPN brings SportsCenter show to Snapchat "
    },
    {
        "content": "NEW YORK Fund managers expressed sharply contradicting views on Snap Inc during the social media company's challenged third quarter  regulatory filings showed on Tuesday.",
        "date": "11142017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Fund managers clash over Snap shares "
    },
    {
        "content": "Nov 15 U.S. stock futures pointed to a more than 100-point fall in the Dow Jones Industrial Index at opening on Wednesday as a slide in oil prices hit global markets and concerns about the fate of U.S. tax cuts continued to weigh on the mood.",
        "date": "11152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Futures fall on weaker oil prices; inflation data eyed "
    },
    {
        "content": "NEW YORK  Nov 15 A shareholder proposal calling for Twenty-First Century Fox Inc to do away with its dual-class share structure may inflict a symbolic black eye on the media company's founder Rupert Murdoch and his family at its annual meeting on Wednesday.",
        "date": "11152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Shareholders take aim at Murdochs with Fox voting rights push "
    },
    {
        "content": "NEW YORK  Nov 14 Fund managers expressed sharply contradicting views on Snap Inc during the social media company's challenged third quarter  regulatory filings showed on Tuesday.",
        "date": "11142017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 1-Fund managers clash over Snap shares "
    },
    {
        "content": "* Ups share stake in Colgate Palmolive to 431 500 shares from 140 000 shares",
        "date": "11142017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Apple  Altice USA  Snap "
    },
    {
        "content": " (This version of the Nov 9 story corrects name of Tencent gaming unit to Riot Games in paragraph 16)",
        "date": "11102017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Video games could be next for Snapchat  China's Tencent says "
    },
    {
        "content": "SHANGHAI  Nov 9 Hong Kong stocks hit another decade-peak on Thursday morning  while China's blue-chip index hovered near two-year highs  as investor confidence was underpinned by China's strong inflation data that showed economic momentum remains robust.",
        "date": "11092017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Hong Kong  China stocks firm as China inflation signal economy remains robust "
    },
    {
        "content": "Snap Inc said on Wednesday that Chinese tech and media investment firm Tencent Holdings Ltd had taken a 12 percent stake in the company  a day after the owner of disappearing-messaging app Snapchat was punished by Wall Street for disappointing quarterly results. | Video ",
        "date": "11082017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "China's Tencent takes 12 percent stake in Snap as shares plunge "
    },
    {
        "content": "Nov 7 Snapchat-owner Snap Inc on Tuesday reported lower-than-expected daily active users for the third quarter  amid stiff competition from Facebook Inc's photo-sharing application Instagram.",
        "date": "11072017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap reports lower-than-expected daily active users in Q3 "
    },
    {
        "content": "* Says some users are having trouble with the app; aware of issue and working on a fix - tweet Further company coverage:",
        "date": "11062017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Snap says some Snapchat users are having trouble with app "
    },
    {
        "content": "* Tencent may use Snapchat to promote smartphone games -analysts",
        "date": "11102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "CORRECTED-UPDATE 2-Video games could be next for Snapchat  China's Tencent says "
    },
    {
        "content": "Nov 9 China-based Sogou Inc's shares rose more than 10 percent in their U.S. market debut  as investors expect a massive base of Chinese smartphone users to help the Tencent-backed search engine company narrow the gap with market leader Baidu.",
        "date": "11092017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Tencent-backed search firm Sogou jumps 10 pct in U.S. market debut "
    },
    {
        "content": "* Dow down 0.01 pct  S&P up 0.01 pct  Nasdaq up 0.08 pct (Updates to early afternoon)",
        "date": "11082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-S&P  Dow flat as banks stocks weigh; Nasdaq edges higher "
    },
    {
        "content": "* Dow down 0.06 pct  S&P off 0.05 pct  Nasdaq up 0.09 pct (Adds details  changes comment  updates prices)",
        "date": "11082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall Street loses steam as banks  energy stocks weigh "
    },
    {
        "content": "Nov 6 Snapchat faced a worldwide outage for at least four hours on Monday  prompting a flood of complaints on rival mobile application Twitter a day before posting its third quarterly earnings as a public company.",
        "date": "11072017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snapchat outage prompts complaints on Twitter "
    },
    {
        "content": "HONG KONG  Nov 9 Chinese tech firm Tencent Holdings Ltd said in a statement on Thursday it wanted to use its expanded stake in Snapchat owner Snap Inc to explore cooperation on mobile games publishing and a news feed.",
        "date": "11092017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Tencent says it wants to cooperate with Snap on games "
    },
    {
        "content": "TENCENT HOLDINGS LTD SAYS IT PLANS TO WORK WITH SNAP INC ON A NEWS FEED AND MOBILE GAMES",
        "date": "11092017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "TENCENT HOLDINGS LTD SAYS IT PLANS TO WORK WITH SNAP INC ON A NEWS FEED AND MOBILE GAMES "
    },
    {
        "content": "* Indexes down: Dow 0.11 pct  S&P 0.10 pct  Nasdaq 0.05 pct (Updates to open)",
        "date": "11082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall Street edges lower as bank stocks weigh "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Tencent and Snap have sent a short but effective message to Facebook. The owner of China's killer app WeChat now owns 12 percent of its struggling U.S. peer  whose Snapchat service is best known for the ability to make photos vanish. Even though the shares are non-voting  the two companies have excellent reasons to connect.",
        "date": "11082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Breakingviews - Tencent and Snap send short message to Facebook "
    },
    {
        "content": "Democrats score a victory in Virginia  Trump arrives in China to seek help reigning in North Korea and FBI agents raid the headquarters of a major U.S. body broker.",
        "date": "11082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Wednesday Morning Briefing "
    },
    {
        "content": "* Futures: Dow down 3 pts  S&P off 1.25 pts  Nasdaq up 2.25 pts (Adds details  comment  updates prices)",
        "date": "11082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St set to open flat with tax bill debate in focus "
    },
    {
        "content": "* Futures: Dow down 17 pts  S&P off 2.5 pts  Nasdaq up 0.25 pts",
        "date": "11082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Futures slightly lower as investors track progress on tax bill "
    },
    {
        "content": "Nov 8 China's Tencent Holdings Ltd has bought a 12 percent stake in Snapchat parent Snap Inc  a regulatory filing showed on Wednesday.",
        "date": "11082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "China's Tencent buys 12 pct stake in Snapchat owner "
    },
    {
        "content": "* China's Tencent takes a 10 percent stake in Snapchat parent Snap - CNBC Source text - http://cnb.cx/2iDwLCD Further company coverage: (Bengaluru Newsroom)",
        "date": "11082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-China's Tencent takes a 10 pct stake in Snap - CNBC "
    },
    {
        "content": "SAN FRANCISCO  Oct 20 Snap Inc said on Friday it had laid off 18 employees in its recruiting division  a move to cut costs as the parent company of messaging app Snapchat faces competition from Facebook Inc for users and advertising dollars.",
        "date": "10202017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap lays off 18 employees in recruiting division "
    },
    {
        "content": "SAN FRANCISCO  Oct 20 Social media company Snap Inc said on Friday it had laid off 18 people in its recruiting division  an unusual move for a young company with ambitious growth plans and a likely reflection of tough competition from Facebook Inc.",
        "date": "10202017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 1-Snap lays off 18 employees in recruiting division "
    },
    {
        "content": "Oct 17 Snap Inc  parent company of messaging and video app Snapchat  and NBCUniversal launched a joint venture studio on Tuesday to produce scripted shows and other genres to air on Snapchat.",
        "date": "10172017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap and NBCUniversal launch studio to produce shows for Snapchat "
    },
    {
        "content": "MANCHESTER  England  Oct 18 Social media platform Snapchat will present Winter Olympics content at next year's event in Pyeongchang after striking a deal with Discovery communications' Eurosport  a move which could help the Games reach the younger demographic it craves.",
        "date": "10182017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snapchat signs Olympic deal with Eurosport "
    },
    {
        "content": "Snap Inc  parent company of messaging and video app Snapchat  and NBCUniversal launched a joint venture studio on Tuesday to produce scripted shows and other genres to air on Snapchat.",
        "date": "10182017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap and NBCUniversal launch studio to produce shows for Snapchat "
    },
    {
        "content": "Snap Inc's Snapchat on Tuesday introduced \"context cards\"  a new feature that will allow users to book an Uber ride or reserve a seat at a restaurant without leaving the messaging app.",
        "date": "10102017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Looking for an Uber? Book it through Snapchat's 'context cards' "
    },
    {
        "content": "WASHINGTON  Oct 10 U.S. policy proposals to cut red tape for public companies are unlikely to boost listings while borrowing rates continue to be low and could increase risks for investors  the chief executive of FTSE Russell  the world's largest index firm  said on Tuesday.",
        "date": "10102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Looser rules unlikely to boost U.S. company listings -FTSE Russell CEO "
    },
    {
        "content": "Oct 10 Snap Inc's Snapchat on Tuesday introduced \"context cards\"  a new feature that will allow users to book an Uber ride or reserve a seat at a restaurant without leaving the messaging app.",
        "date": "10102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Looking for an Uber? Book it through Snapchat's \"context cards\" "
    },
    {
        "content": "* Snap Inc introduces Context Cards  a feature to display information about the snap users view Source text - (http://bit.ly/2dhendY) Further company coverage:",
        "date": "10102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Snap Inc introduces Context Cards feature "
    },
    {
        "content": "SAN FRANCISCO  Oct 5 When data center operator Switch Inc goes public on Friday it will be the latest tech firm using special shares to limit the rights of minority investors  making it ineligible for inclusion in the S&P 500 under new rules meant to deter such practices.",
        "date": "10052017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Switch IPO the latest to limit investor voting rights "
    },
    {
        "content": "* eMarketer cuts Snapchat's Fy 17 ad revenue forecast to $774.1 million from $900 million Source http://bit.ly/2wtMbiw Further company coverage:",
        "date": "10022017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-eMarketer cuts Snapchat's Fy 17 ad revenue forecast to $774.1 mln from $900 mln "
    },
    {
        "content": "Snap Inc  searching for ways to reinvigorate a slowing growth rate and increase advertising revenue for its Snapchat messaging app  said this week it has racked up 10 million users for its Discover news and video feature in France a year after launching there.",
        "date": "09282017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "In France  Snap's Discover news feature gets 10 million monthly users "
    },
    {
        "content": "SAN FRANCISCO  Sept 26 Silicon Valley venture capital firm IVP on Tuesday announced the close of a $1.5 billion fund  the latest in a string of massive new venture funds that are appearing as global investors scramble for a piece of the tech boom.",
        "date": "09262017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Veteran Silicon Valley venture capital firm raises $1.5 billion fund "
    },
    {
        "content": "Shares of video streaming firm Roku Inc  rose more than 67 percent in their market debut on Thursday  giving the U.S. IPO market a much-needed shot in the arm. | Video ",
        "date": "09282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Roku connects with investors in debut  shares soar over 67 percent "
    },
    {
        "content": "Sept 28 Shares of video streaming firm Roku Inc rose more than 67 percent in their market debut on Thursday  giving the U.S. IPO market a much-needed shot in the arm.",
        "date": "09282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 2-Roku connects with investors in debut  shares soar over 67 pct "
    },
    {
        "content": "Sept 28 Snap Inc  searching for ways to reinvigorate a slowing growth rate and increase advertising revenue for its Snapchat messaging app  said this week it has racked up 10 million users for its Discover news and video feature in France a year after launching there.",
        "date": "09282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "In France  Snap's Discover news feature gets 10 mln monthly users "
    },
    {
        "content": "* ‍Ceros says announced it has been named as a Snapchat creative partner​ Source text for Eikon:",
        "date": "09252017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-‍Ceros says announced it has been named as a Snapchat creative partner​ "
    },
    {
        "content": "* Snap spectacles hardware lab cuts some jobs  changes leadership - Bloomberg  citing sources Source : https://bloom.bg/2w98Nog Further company coverage:",
        "date": "09212017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Snap spectacles hardware lab cuts some jobs  changes leadership - Bloomberg "
    },
    {
        "content": "Aug 22 Canada's Tulip Retail  which makes an app for retailers  said on Tuesday it raised $40 million in a funding round led by venture capital firm Kleiner Perkins Caufield & Byers.",
        "date": "08222017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Retail app maker Tulip raises $40 mln from Kleiner Perkins  others "
    },
    {
        "content": "Aug 21 CNN on Monday began streaming \"The Update \" a daily show on Snapchat featuring at least five news stories each episode from reporters and bureaus around the world  to attract younger viewers.",
        "date": "08212017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "CNN launches daily news show on Snapchat "
    },
    {
        "content": "* Third Point Llc dissolves share stake in Snap Inc - SEC Filing",
        "date": "08112017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Third Point ups share stake in Facebook  dissolves in Snap Inc "
    },
    {
        "content": "NEW YORK Snap Inc  shares rebounded on Monday from a record low in a volatile trading session as big investors reported their stakes in the social media company and a wave of employees became eligible to sell their shares.",
        "date": "08142017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap shares bounce off low; employees free to sell shares "
    },
    {
        "content": "Snap Inc Chief Executive Officer Evan Spiegel said on Thursday neither he nor co-founder Bobby Murphy would sell shares of the Snapchat parent this year  but that failed to soothe investors after quarterly results fell short of analyst expectations. | Video ",
        "date": "08112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap co-founders will not sell shares as stock slumps on earnings miss "
    },
    {
        "content": "Aug 10 Snap Inc Chief Executive Officer Evan Spiegel said on Thursday neither he nor co-founder Bobby Murphy would sell shares of the Snapchat parent this year  but that failed to soothe investors after quarterly results fell short of analyst expectations.",
        "date": "08112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 5-Snap co-founders will not sell shares as stock slumps on earnings miss "
    },
    {
        "content": "NEW YORK  Aug 14 Snap Inc shares rebounded on Monday from a record low in a volatile trading session as big investors reported their stakes in the social media company and a wave of employees became eligible to sell their shares.",
        "date": "08142017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 2-Snap shares bounce off low; employees free to sell shares "
    },
    {
        "content": "* Appaloosa Lp dissolves class a share stake in Snap Inc - SEC Filing",
        "date": "08142017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Appaloosa dissolves share stake in Snap Inc  Pfizer Inc "
    },
    {
        "content": "* Jana Partners Llc ups sole share stake in Hewlett Packard Enterprise Co to 10.2 million shares from 4.4 million shares",
        "date": "08142017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Jana Partners dissolves sole share stake in Snap Inc  Shire Plc "
    },
    {
        "content": "* Takes share stake of 798 123 shares in Bank of America - SEC filing‍​",
        "date": "08142017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Temasek Holdings (Private) Ltd dissolves share stake in Snap  takes share stake in BofA "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  Aug 9 Shares of Snap Inc rallied on Wednesday as options traders buckled in for the social media company's quarterly results and after an analyst said the beaten-down stock was \"getting interesting.\"",
        "date": "08092017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap shares up ahead of results; options traders eye steep stock swing "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO  Aug 10 Snap Inc and Blue Apron Holdings Inc's dismal quarterly reports on Thursday  which sent their shares slumping  join a growing list of technology startups failing to live up to sky-high expectations set ahead of their initial public offerings.",
        "date": "08102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap  Blue Apron fuel worries about overheated IPOs "
    },
    {
        "content": "* \"Some Snapchatters are having trouble sending chats. We're looking into it!\" -  Tweet from Snapchat Support‍​ Source text - (http://bit.ly/2vtj6pw) Further company coverage:",
        "date": "08032017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Snapchat Support‍​ says some users having trouble sending chats "
    },
    {
        "content": "Alphabet Inc's Google is developing technology that media companies could use to create stories similar to those found on Snapchat's \"Discover\" platform  a person familiar with the plans said on Friday.",
        "date": "08042017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Google tests publishing tech similar to Snapchat: source "
    },
    {
        "content": "DALLAS (Reuters Breakingviews) - Snap is haunting the market. The parent of the disappearing-message app reported its second consecutive quarter of disappointing results. Slowing user growth  more losses and fresh fallout from its lousy governance have erased a third of its market value. Others mulling going public may be scared off.",
        "date": "08102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap's fade could make future IPOs vanish "
    },
    {
        "content": "* Q2 earnings per share view $-0.14 -- Thomson Reuters I/B/E/S Source text: (http://bit.ly/2vT7zjw) Further company coverage:",
        "date": "08102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Snap Q2 non-gaap diluted net loss per share $0.16‍​ "
    },
    {
        "content": "* Snap Inc - qtrly ‍DAUs grew from 143 million in Q2 2016 to 173 million in Q2 2017​",
        "date": "08102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Snap Inc - qtrly net loss per share attributable to class A  class B  and class C common stockholders was $‍0.36​ "
    },
    {
        "content": "Aug 4 Alphabet Inc's Google is developing technology to create media content along the lines of Snap Inc's \"Discover\" platform  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08042017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Google developing technology for Snapchat-like media content - WSJ "
    },
    {
        "content": "Artificial intelligence robots are turbo-charging the race to find new drugs  Lego abruptly replaced its CEO with a young Danish industrialist and despite threatening comments from Pyongyang  the people of Guam seem to be taking things in their stride.",
        "date": "08102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Thursday Morning Briefing "
    },
    {
        "content": "SAN FRANCISCO  Aug 2 Shares of Snap Inc slumped to new lows on Wednesday while short sellers closed out their bets following paper profits of half a billion dollars since the Snapchat owner's market debut in March.",
        "date": "08022017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap short sellers take winnings off table as stock sinks "
    },
    {
        "content": "* Formed partner program with analytics providers in marketing mix space  including Neustar Marketshare  Analytics Partners  MMA and Nielsen‍​ Further company coverage:",
        "date": "08012017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Snap partners with analytics providers in marketing mix space "
    },
    {
        "content": "NEW YORK Shares of Snap Inc   owner of the Snapchat messaging app  had their busiest trading day in two and a half months in a volatile session on Monday  as early investors could sell their shares for the first time since its March market debut.",
        "date": "07312017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap ends down slightly in brisk trade on lockup expiry "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK Shares of Snap Inc  rallied on Wednesday as options traders buckled in for the social media company's quarterly results and after an analyst said the beaten-down stock was \"getting interesting.\"",
        "date": "08102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap shares up ahead of results; options traders eye steep stock swing "
    },
    {
        "content": "* ‍Brands will be able to measure  forecast  optimize impact of advertising investments and identify marketing's overall contribution to revenue​ Source text for Eikon: Further company coverage:",
        "date": "08012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Neustar ‍announces marketing mix model partnership with Snap​ Inc "
    },
    {
        "content": "NEW YORK  July 31 The S&P 500 will start excluding companies that issue multiple classes of shares  managers of the index said on Monday  a move that effectively bars Snap Inc after its decision to offer stock with no voting rights.",
        "date": "08012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "S&P 500 to exclude Snap after voting rights debate "
    },
    {
        "content": "NEW YORK  July 31 Shares of Snap Inc  owner of the Snapchat messaging app  had their busiest trading day in two and a half months in a volatile session on Monday  as early investors could sell their shares for the first time since its March market debut.",
        "date": "07312017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 3-Snap ends down slightly in brisk trade on lockup expiry "
    },
    {
        "content": "SAN FRANCISCO  July 28 A flood of Snap Inc shares held back since the Snapchat owner's initial public offering could start to trade freely next week  pressuring a stock that has already plunged far below its debut price.",
        "date": "07282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Wall Street braces for end of Snap share lockup "
    },
    {
        "content": "BOSTON/SAN FRANCISCO FTSE Russell said on Wednesday it planned to exclude Snap Inc  from its widely followed stock indexes because the owner of the Snapchat messaging app has an unusual share structure that denies voting rights to investors.",
        "date": "07272017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "FTSE Russell to exclude Snap from stock indexes over voting rights "
    },
    {
        "content": "The Dow Jones Industrial Average hit a record closing high on Monday  helped by Boeing  while selling in Facebook  Alphabet and other technology companies checked the S&P 500 and pulled the Nasdaq lower. | Video ",
        "date": "07312017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Dow hits record high while tech retreats "
    },
    {
        "content": "July 26 Facebook Inc's mobile advertising business grew by more than 50 percent in the second quarter  the company said in its earnings report on Wednesday  as the social network continued to establish itself as the venue of choice for an ever-growing array of online advertisers.",
        "date": "07272017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 4-Facebook shares hit record high as mobile ad sales soar "
    },
    {
        "content": "BOSTON/SAN FRANCISCO  July 26 FTSE Russell said on Wednesday it planned to exclude Snap Inc from its widely followed stock indexes because the owner of the Snapchat messaging app has an unusual share structure that denies voting rights to investors.",
        "date": "07262017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "UPDATE 4-FTSE Russell to exclude Snap from stock indexes over voting rights "
    },
    {
        "content": "    NEW YORK  July 28 Starting on Monday and extending into August  early investors  employees and other insiders of Snap Inc will be allowed to sell shares for the first time since the company's $3.4 billion initial public offer in March.     Ahead of the release of up to hundreds of millions of the Snapchat owner's shares onto the market  here are some high-profile debuts in the technology sector in recent years  and their performances around their lockup period expiration.        ",
        "date": "07282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "FACTBOX-High-profile IPO performances as Snap lockup expiration looms "
    },
    {
        "content": "NEW YORK  July 26 FTSE Russell CEO Mark Makepeace said on Wednesday the index provider plans to exclude Snap Inc from its widely followed stock indexes because of the Snapchat owner's unusual share structure that denies voting rights to investors.",
        "date": "07262017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "FTSE Russell to exclude Snap from stock indexes "
    },
    {
        "content": "July 25 Snap Inc said its general counsel Chris Handman stepped down to spend more time with his family.",
        "date": "07262017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap General Counsel Chris Handman steps down "
    },
    {
        "content": "Underwhelming performances of Snap and Blue Apron since their high-profile market debuts  especially at a time when the U.S. stock market is hitting record highs  is an indication that the IPO market will not be as robust as expected this year.",
        "date": "07212017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "U.S. IPO market may struggle to finish 2017 on a high "
    },
    {
        "content": "July 21 Underwhelming performances of Snap and Blue Apron since their high-profile market debuts  especially at a time when the U.S. stock market is hitting record highs  is an indication that the IPO market will not be as robust as expected this year.",
        "date": "07212017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "REFILE-U.S. IPO market may struggle to finish 2017 on a high "
    },
    {
        "content": "* Snap Inc introduces 'multi-snap recording' and photo editing feature 'tint brush' Further company coverage:",
        "date": "07182017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Snap Inc introduces 'multi-snap recording' and photo editing feature 'tint brush' "
    },
    {
        "content": "* Snap ad creation tool launches on July 17 Further company coverage:",
        "date": "07172017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Snap ad creation tool launches on July 17 "
    },
    {
        "content": "BOSTON  July 17 MSCI Inc has proposed leaving shares of Snap Inc and other companies including Eaton Vance Corp out of stock indexes because they lack voting rights  a sign of the rising skepticism facing corporate structures that boost the power of insiders.",
        "date": "07172017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Lack of voting rights may keep Snap  others from MSCI indexes "
    },
    {
        "content": "* Formula 1 and Snap Inc announce new global partnership to cover upcoming grand prix races on Snapchat's editorial platform  Discover",
        "date": "07132017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Formula 1 and Snap Inc announce new global partnership "
    },
    {
        "content": "While that is the premise of Snap Inc’s popular messaging platform  investors also saw any gains from its red-hot IPO disappear when shares plunged far below their initial sale price on Tuesday. | Video ",
        "date": "07142017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Giving up the ghost: investors bail on Snap "
    },
    {
        "content": "Snap Inc's shares slipped 1.3 percent to $15.48 in premarket trading on Friday  after IPO underwriter Cowen downgraded the stock to \"market perform\" and lowered its price target to $17 from $21.",
        "date": "07142017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Factbox: Snap IPO underwriters' coverage "
    },
    {
        "content": "While that is the premise of Snap Inc’s popular messaging platform  investors also saw any gains from its red-hot IPO disappear when shares plunged far below their initial sale price on Tuesday.",
        "date": "07112017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "UPDATE 2-Giving up the ghost: investors bail on Snap "
    },
    {
        "content": "July 10 Snap Inc shares fell below their initial public offering price of $17 per share on Monday for the first time  highlighting a lack of confidence in the social media company  which faces fierce competition.",
        "date": "07102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap shares fall below $17 IPO price for first time "
    },
    {
        "content": "* Snap shares drop after downgrade from underwriter Morgan Stanley",
        "date": "07112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St recovers from drop  helped by Senate recess delay "
    },
    {
        "content": "July 10 Snap Inc shares slipped below their initial public offering price of $17 for the first time on Monday  signaling waning investor confidence in the social media company's growth potential as it faces fierce competition.",
        "date": "07102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 1-Snap shares fall below $17 IPO price for first time "
    },
    {
        "content": "NEW YORK  July 11 Short-sellers placed more bets that shares of social media company Snap Inc would continue to fall on Tuesday  representing about 2.4 percent of trading volume in the stock  even though Snap is one of the most expensive shares on Wall Street to borrow.",
        "date": "07112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Investors pay top dollar to short Snap "
    },
    {
        "content": "July 11 Snap Inc shares fell 5.6 percent on Tuesday  after  lead underwriter Morgan Stanley downgraded the stock and raised concerns about the social media company's ability to compete against rival Instagram.",
        "date": "07112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap shares drop after downgrade from lead underwriter Morgan Stanley "
    },
    {
        "content": "* FTSE Russell launched unequal voting rights consultation in June",
        "date": "07052017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "FTSE Russell leaning toward minimum threshold for voting rights - CEO "
    },
    {
        "content": "** Snap's shares  down 2.4 pct at $16.58 premarket after lead underwriter Morgan Stanley downgrades the stock  a little more than 4 months after its debut",
        "date": "07112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap Inc: Lead underwriter Morgan Stanley downgrades "
    },
    {
        "content": "LONDON  June 30 Global equity listings rose sharply in the first half of the year  compared with a year earlier  driven by the U.S. market as well as rights issues in Europe  Thomson Reuters data showed  but remained way off 2015's surge.",
        "date": "06292017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Global equity listings up by a third  but below previous peaks "
    },
    {
        "content": "* Snap Inc says starting today  users can now create filters in Snapchat app  customize them - Blog",
        "date": "06282017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Snap Inc says users can now create filters in Snapchat app - Blog "
    },
    {
        "content": "* Instagram stories crushes Snapchat with 250 million daily active users - CNBC",
        "date": "06202017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Instagram stories crushes Snapchat with 250 million daily active users - CNBC "
    },
    {
        "content": "June 19 Time Warner Inc said on Monday it signed a deal with Snap Inc to develop up to 10 original shows for Snapchat over the next two years.",
        "date": "06192017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Time Warner signs deal to develop shows for Snapchat "
    },
    {
        "content": "June 19 Time Warner Inc and Snap Inc said on Monday they had entered into an agreement to develop original shows for messaging service Snapchat over the next two years.",
        "date": "06192017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 1-Time Warner signs deal to develop shows for Snapchat "
    },
    {
        "content": "* Time Warner and Snap announce wide-ranging global media partnership to invest in content and ads",
        "date": "06192017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Time Warner  Snap announce partnership to invest in content  ads "
    },
    {
        "content": "SAN FRANCISCO Shares of Snap Inc dropped 4.9 percent on Thursday to their initial public offering price  highlighting investors' loss of confidence in the social media company that faces fierce competition from Facebook. | Video ",
        "date": "06152017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap sinks to IPO price for first time since market debut "
    },
    {
        "content": "SAN FRANCISCO  June 15 Shares of Snap Inc dropped 4.9 percent on Thursday to their initial public offering price  highlighting investors' loss of confidence in the social media company that faces fierce competition from Facebook.",
        "date": "06152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 3-Snap sinks to IPO price for first time since market debut "
    },
    {
        "content": "* Location analytics company Placed says it is joining Snap Inc team - blog post Source text : http://bit.ly/2ruKLnX Further company coverage:",
        "date": "06052017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Placed says it is joining Snap Inc team - blog post "
    },
    {
        "content": "SAN FRANCISCO  June 1 You can add Skype to the growing list of services copying features straight from Snapchat.",
        "date": "06012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Microsoft's Skype draws inspiration from Snapchat in big redesign "
    },
    {
        "content": "* Snap Inc has selected company to review Snap brand safety protocols in effort to further reduce risk of negative exposure for brands Source text for Eikon: Further company coverage:",
        "date": "05302017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Snap Inc selects Integral Ad Science to review Snap brand safety protocols "
    },
    {
        "content": "May 16 Facebook Inc's Instagram has souped up its camera tool with quirky face-tracking filters  adding another feature similar to that offered by social media rival Snap Inc's Snapchat.",
        "date": "05162017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Facebook adds Snapchat-like camera filters to Instagram "
    },
    {
        "content": "May 16 Facebook Inc's Instagram has souped up its camera with quirky face-tracking filters  adding another feature similar to one offered by social media rival Snap Inc's Snapchat.",
        "date": "05162017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 2-Facebook adds Snapchat-like camera filters to Instagram "
    },
    {
        "content": "NEW YORK Soros Fund Management LLC  founded by billionaire investor George Soros  boosted the firm's share stake in Goldman Sachs Group Inc by nearly 40 percent during the first quarter and also purchased shares in Snap Inc  parent of the wildly popular Snapchat messaging app  during the first three months of the year  regulatory filings on Monday showed.",
        "date": "05152017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Soros Fund Management ups Goldman stake  buys Snap shares in first quarter "
    },
    {
        "content": "NEW YORK  May 15 Soros Fund Management LLC  founded by billionaire investor George Soros  boosted the firm's share stake in Goldman Sachs Group Inc by nearly 40 percent during the first quarter and also purchased shares in Snap Inc  parent of the wildly popular Snapchat messaging app  during the first three months of the year  regulatory filings on Monday showed.",
        "date": "05152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Soros Fund Management ups Goldman stake  buys Snap shares in Q1 "
    },
    {
        "content": "* Takes sole share stake of 550 000 class A shares of Snap Inc - SEC filing",
        "date": "05152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Jana Partners takes sole share stake in Snap  dissolves sole share stake in Time "
    },
    {
        "content": "SAN FRANCISCO  May 15 Snap Inc jumped 8 percent on Monday and was on track for its third strongest day since the social media company's initial public offering  boosted by filings showing several institutional investors had owned its shares.",
        "date": "05152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap surges after Wall Street heavyweights reveal stakes "
    },
    {
        "content": "Snap Inc shares plunged as much as 23.5 percent on Thursday after the owner of the wildly popular Snapchat app's user growth and revenue numbers failed to show that it was adequately dealing with rising competition from Facebook. | Video ",
        "date": "05112017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Less than picture perfect: Snap slumps on slowing user growth "
    },
    {
        "content": "SAN FRANCISCO  May 12 A widespread view on Wall Street this week was that Snap Inc fell short of revenue forecasts when it posted its first quarterly results as a public company  triggering a big selloff in its shares.",
        "date": "05122017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap earnings 'miss' shows misreading of analyst 'expectations' "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Snap investors may be feeling nauseous. The parent of the disappearing-message app reported a slowdown in user growth and a $2.2 billion quarterly loss. Meanwhile  rivals are co-opting features. These are worrisome trends since its lofty $27 billion value hinges on attracting more people.",
        "date": "05102017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap lays an egg worthy of Twitter nest "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  May 15 Snap Inc jumped more than 8 percent on Monday in its second strongest day since the social media company's initial public offering  boosted by filings showing several institutional investors had owned its shares.",
        "date": "05152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 1-Snap surges after Wall Street heavyweights reveal stakes "
    },
    {
        "content": "* Indexes end down: Dow 0.11 pct  S&P 0.22 pct  Nasdaq 0.22 pct (Updates to close)",
        "date": "05112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall Street slides as investors fret about retail "
    },
    {
        "content": "NEW YORK/BOSTON  May 12 Some of the biggest U.S. mutual and hedge funds  including Daniel Loeb's Third Point and Daniel Och's Och-Ziff Capital Management  owned stakes in Snap Inc  parent of the wildly popular Snapchat messaging app  at the end of March  regulatory filings on Friday showed.",
        "date": "05122017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "High-profile Snap stakeholders revealed in filings "
    },
    {
        "content": "NEW YORK/BOSTON  May 12 Some of the biggest U.S. mutual and hedge funds  including Daniel Loeb's Third Point and Daniel Och's Och-Ziff Capital Management  owned stakes in Snap Inc  parent of the wildly popular Snapchat messaging app  at the end of March  regulatory filings on Friday showed.",
        "date": "05122017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 1-High-profile Snap stakeholders revealed in filings "
    },
    {
        "content": "U.S. stocks were mixed on Wednesday as investors digested President Donald Trump's abrupt dismissal of his FBI chief as well as corporate earnings from Walt Disney and Nvidia. | Video ",
        "date": "05102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Wall Street mixed after Trump fires FBI head; Nasdaq hits record high "
    },
    {
        "content": "* More than triples share stake in Microsoft to 12 800 shares",
        "date": "05152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Soros Fund Management more than triples share stake in Microsoft  takes share stake in Snap  Alibaba "
    },
    {
        "content": "* Takes share stake of 1.1 million shares in Snap Inc - SEC filing",
        "date": "05152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Goldman Sachs takes share stake of 1.1 mln shares in Snap Inc "
    },
    {
        "content": "* Indexes down: Dow 0.12 pct  S&P 0.24 pct  Nasdaq 0.22 pct (Updates to afternoon)",
        "date": "05112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall Street drops as investors worry about retail "
    },
    {
        "content": "* Blackrock Inc takes share stake of 9.4 million Class A shares in Snap Inc - SEC filing",
        "date": "05122017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Blackrock Inc takes share stake of 9.4 mln Class A shares in Snap Inc "
    },
    {
        "content": "* Indexes end: Dow -0.16 pct  S&P +0.11 pct  Nasdaq +0.14 pct (Updates to close)",
        "date": "05102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St mixed after Trump fires FBI head; Nasdaq hits record high "
    },
    {
        "content": "* Indexes down: Dow 0.27 pct  S&P 0.37 pct  Nasdaq 0.42 pct (Updates to early afternoon)",
        "date": "05112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St on track to record worst day in one month "
    },
    {
        "content": " (In this May 10 story  corrects year-ago average revenue per user to 32 cents from 33 cents in paragraph 21.) | Video ",
        "date": "05112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap shares plummet as investors mark down first earnings report "
    },
    {
        "content": "* Third Point LLC dissolves share stake in Apple Inc - sec filing",
        "date": "05122017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Third Point LLC dissolves share stake in Apple  Goldman Sachs "
    },
    {
        "content": "* Appaloosa LP takes share stake of 100 000 class A shares in Snap Inc - SEC filing",
        "date": "05122017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Appaloosa LP takes share stake in Snap Inc and GM  ups share stake in Yahoo "
    },
    {
        "content": "* Scripps Networks Interactive Inc- today announced a new deal with Snap Inc.",
        "date": "05042017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Scripps Networks Interactive reports new deal with Snap "
    },
    {
        "content": "May 10 U.S. stock index futures were lower on Wednesday after President Donald Trump's firing of his FBI chief set off a political storm that could make passage of his pro-growth plans more difficult.",
        "date": "05102017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Futures fall after FBI Chief Comey sacked "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd takes share stake of 300 000 shares in Snap Inc - sec filing",
        "date": "05152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-Temasek holdings (private) ltd  takes share stake in Snap Inc  Senseonics Holdings "
    },
    {
        "content": "* Indexes down: Dow 0.56 pct  S&P 0.61 2 pct  Nasdaq 0.76 pct (Adds details  comments  updates prices)",
        "date": "05112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St on track for worst day in one month "
    },
    {
        "content": "NEW YORK/BOSTON  May 11 The dramatic fall in Snap Inc shares on Thursday following the company's disappointing first quarterly earnings report as a public company was likely costly for a wide range of mutual funds  including Fidelity's giant Contrafund.",
        "date": "05122017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Mutual funds lose  short-sellers win on Snap trades "
    },
    {
        "content": "May 10 Snap Inc  the parent of popular disappearing-messaging app Snapchat  reported a 36.1 percent increase in daily user growth in the company's first quarterly results after its red-hot IPO  amid stiff competition from Facebook Inc.",
        "date": "05112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "CORRECTED-Snap daily users rise 36.1 pct in first report after IPO "
    },
    {
        "content": "May 10 Snap Inc shares plunged on Wednesday after the owner of Snapchat reported slowing user growth and revenue in its first earnings report as a public company  missing some Wall Street estimates as it competes with copycat messaging apps.",
        "date": "05112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "CORRECTED-UPDATE 5-Snap shares plummet as investors mark down first earnings report "
    },
    {
        "content": "Shares of Twitter Inc jumped on Wednesday after the microblogging service reported better-than-expected user growth in the first quarter  although its revenue fell for the first time. | Video ",
        "date": "04262017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Twitter posts strong user growth  shares soar "
    },
    {
        "content": "(..) May 10 .. ",
        "date": "05112017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "REFILE-Snap shares plummet as investors mark down first earnings report - Reuters News "
    },
    {
        "content": "April 26 Shares of Twitter Inc soared in premarket trade on Wednesday after the microblogging service reported better-than-expected user growth.",
        "date": "04262017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "CORRECTED-UPDATE 2-Twitter posts strong user growth  shares soar "
    },
    {
        "content": "SAN FRANCISCO Shares of Snap  fell 1.5 percent on Monday as the Snapchat owner faced criticism for comments allegedly made by its CEO about not prioritizing growth in India and Spain because they were \"poor\" countries.",
        "date": "04172017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap stock falls as alleged CEO comments rile some on social media "
    },
    {
        "content": "SAN FRANCISCO  April 13 Shares of Snapchat-owner Snap fell 1.2 percent on Thursday after rival Instagram  owned by Facebook  said more than 200 million people a day use its Stories feature  which competes against Snapchat.",
        "date": "04132017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap shares drop following strong growth by Instagram Stories "
    },
    {
        "content": "SAN FRANCISCO  April 3 Index fund provider FTSE Russell expects to announce in July whether it will include in its indexes shares of Snap Inc and other companies whose share structure denies investors voting rights.",
        "date": "04042017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "FTSE Russell to announce in July decision on adding Snap shares "
    },
    {
        "content": "* Snap Inc - will hold quarterly conference call to discuss Q1 2017 financial results on Wednesday  May 10  2017 at 1:30 p.m. Pacific time Source text for Eikon: Further company coverage:",
        "date": "04122017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "BRIEF-Snap Inc announces date of Q1 2017 Results "
    },
    {
        "content": "March 31 Snap Inc said on Friday its Snapchat messaging app would add an option for users to search through photos and videos that users have posted to the public.",
        "date": "03312017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snapchat adds more accessible search feature "
    },
    {
        "content": "LONDON Global equity listings rose in the first quarter compared with a year earlier  driven by issuance in Asia and the United States  Thomson Reuters data showed  pointing to a more buoyant year for share sales than 2016.",
        "date": "03312017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Global equity listings start to recover after 2016 slump "
    },
    {
        "content": "March 27 Snap Inc  owner of messaging app Snapchat  received top ratings from a number of its IPO underwriters on Monday  sending its shares up more than 3 percent in premarket trading.",
        "date": "03272017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap shares rise as underwriters start coverage with \"buy\" "
    },
    {
        "content": "* Dow down 0.22 pct  S&P down 0.10 pct  Nasdaq up 0.2 pct   (Updates to close of U.S. market)",
        "date": "03272017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St off as Trump agenda weighed; Dow down for 8th day "
    },
    {
        "content": "* Dow down 0.34 pct  S&P down 0.26 pct  Nasdaq up 0.05 pct   (Updates to late afternoon)",
        "date": "03272017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Financials drag on Wall St as Trump agenda weighed "
    },
    {
        "content": "SAN FRANCISCO  March 28 Facebook Inc is giving the camera a central place on its smartphone app for the first time  encouraging users to take more pictures and edit them with digital stickers that show the influence of camera-friendly rival Snapchat.",
        "date": "03282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Facebook adds camera features  moving closer to Snapchat "
    },
    {
        "content": "SAN FRANCISCO CarGurus  a popular website where consumers go to browse cars  has tapped investment banks for an initial public offering later this year  according to people familiar with the matter.",
        "date": "03282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Car shopping site CarGurus hires banks for U.S. IPO: sources "
    },
    {
        "content": "SAN FRANCISCO  March 28 CarGurus  a popular website where consumers go to browse cars  has tapped investment banks for an initial public offering later this year  according to people familiar with the matter.",
        "date": "03282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Car shopping site CarGurus hires banks for U.S. IPO -sources "
    },
    {
        "content": "SAN FRANCISCO  March 28 Facebook Inc is giving the camera a central place on its smartphone app for the first time  encouraging users to take more pictures and edit them with digital stickers that show the influence of rival Snapchat.",
        "date": "03282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 1-Facebook adds camera features  moving closer to Snapchat "
    },
    {
        "content": "SAN FRANCISCO Shares of Snap Inc  jumped 9 percent on Wednesday after the owner of messaging app Snapchat received a second analyst \"buy\" rating following a red-hot public listing this month and with Wall Street skeptical about its lofty valuation.",
        "date": "03222017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap pops 9 percent after winning second 'buy' recommendation "
    },
    {
        "content": "Shares of Snap Inc jumped nearly 5 percent on Monday after several of the Snapchat owner's IPO underwriters handed it badly needed \"buy\" ratings.",
        "date": "03282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap surges after IPO banks give flurry of 'buy' ratings "
    },
    {
        "content": "SAN FRANCISCO Snap Inc  stock rose on Monday after the Snapchat owner received its first \"buy\" rating from a Wall Street analyst following a $3.4 billion public listing this month that raised the eyebrows of many on Wall Street.",
        "date": "03202017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap snaps back after analyst assigns first 'buy' rating "
    },
    {
        "content": "* Indexes end: Dow -0.03 pct  S&P +0.19 pct  Nasdaq up +0.48 pct   (Updates to close)",
        "date": "03222017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Choppy day on Wall St; all eyes on Trump and healthcare "
    },
    {
        "content": "March 27 Shares of Snap Inc jumped nearly 5 percent on Monday after several of the Snapchat owner's IPO underwriters handed it badly needed \"buy\" ratings.",
        "date": "03282017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "CORRECTED-UPDATE 2-Snap surges after IPO banks give flurry of 'buy' ratings "
    },
    {
        "content": "Google apologized on Monday for allowing ads to appear alongside offensive videos on YouTube as more high-profile firms such as Marks & Spencer  and HSBC  pulled advertising for British markets from Google sites. | Video ",
        "date": "03202017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Google apologizes to ad clients for YouTube content fiasco "
    },
    {
        "content": "SAN FRANCISCO  March 16 Snap Inc shares tumbled below $20 on Thursday for the first time since the company's $3.4 billion public listing after the Snapchat owner received another \"sell\" rating from an analyst.",
        "date": "03162017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap shares drop 4 percent  fall below $20 for the first time "
    },
    {
        "content": "March 15 Shares in Snap Inc hit a fresh low on Wednesday  falling as much as 2.6 percent before clawing back some losses in choppy trading as analysts questioned the company's prospects.",
        "date": "03152017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap shares hit new low in choppy trading as valuation concerns mount "
    },
    {
        "content": "When your price-to-earnings valuation ratio fails  measure a stock with your heart",
        "date": "03132017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Reuters Select: Snap Inc: When your price-to-earnings valuation ratio fails  measure a stock with your heart "
    },
    {
        "content": "March 20 Google apologised on Monday for allowing ads to appear alongside offensive videos on YouTube as more high-profile firms such as Marks & Spencer and HSBC  pulled advertising for British markets from Google sites.",
        "date": "03202017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "REFILE-Google apologises to ad clients for YouTube content fiasco "
    },
    {
        "content": "NEW YORK For some millennial investors  loyalty to one of their favorite apps matters more than financial details in the case of Snap Inc .",
        "date": "03132017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Millennial love for Snapchat extends to the stock "
    },
    {
        "content": "NEW YORK  March 12 For some millennial investors  loyalty to one of their favorite apps matters more than financial details in the case of Snap Inc.",
        "date": "03132017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "RPT-Millennial love for Snapchat extends to the stock "
    },
    {
        "content": "The 2017 advertising revenue forecast for Snap Inc’s Snapchat has been trimmed by $30 million due to higher than expected revenue sharing with its partners  digital marketing firm eMarketer said in its latest ad spending forecast on Tuesday.",
        "date": "03142017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snapchat 2017 ad revenue forecast trimmed to $770 million: eMarketer "
    },
    {
        "content": "March 14 The 2017 advertising revenue forecast for Snap Inc’s Snapchat has been trimmed by $30 million due to higher than expected revenue sharing with its partners  digital marketing firm eMarketer said in its latest ad spending forecast on Tuesday.",
        "date": "03142017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snapchat 2017 ad revenue forecast trimmed to $770 mln -eMarketer "
    },
    {
        "content": "NEW YORK  March 12 For some millennial investors  loyalty to one of their favorite apps matters more than financial details in the case of Snap Inc.",
        "date": "03122017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Millennial love for Snapchat extends to the stock "
    },
    {
        "content": "WASHINGTON/BOSTON One of two current members of the U.S. Securities and Exchange Commission raised questions on Thursday for companies like Snap Inc  that offer shareholders unequal voting rights  saying the agency should \"focus on how some innovations may prove detrimental to investors.\"",
        "date": "03092017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "After Snap IPO  U.S. regulator questions unequal voting rights "
    },
    {
        "content": "WASHINGTON/BOSTON  March 9 One of two current members of the U.S. Securities and Exchange Commission raised questions on Thursday for companies like Snap Inc that offer shareholders unequal voting rights  saying the agency should \"focus on how some innovations may prove detrimental to investors.\"",
        "date": "03092017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 3-After Snap IPO  U.S. regulator questions unequal voting rights "
    },
    {
        "content": "March 9 Conde Nast is joining with Comcast Corp's NBCUniversal and Vox Media to package their digital inventory for sale to advertisers  the companies announced Thursday.",
        "date": "03092017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Conde Nast to package its digital ad inventory with NBCUniversal and Vox Media "
    },
    {
        "content": "SAN FRANCISCO Shares of Snap Inc  bounced back on Wednesday following a steep selloff while an initial rush to short sell the stock appeared to be slowing.",
        "date": "03092017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap perks up after initial rush of short sellers "
    },
    {
        "content": "SAN FRANCISCO  March 8 Shares of Snap Inc  bounced back on Wednesday following a steep selloff while an initial rush to short sell the stock appeared to be slowing.",
        "date": "03082017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "UPDATE 1-Snap perks up after initial rush of short sellers "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  March 7 Snap Inc's  shares tumbled 12 percent on Tuesday and traders raced to position themselves to cash in on further declines after analysts gave the company a lukewarm reception following its red-hot market debut.",
        "date": "03072017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "UPDATE 3-Snap shares tumble as short sellers move in "
    },
    {
        "content": "NEW YORK  March 8 Traders looking for a piece of the action around Snap Inc's newly launched shares will get another way to bet on the fortunes of the Snapchat owner when its options start trading on Friday.",
        "date": "03082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap options set for strong demand on market debut "
    },
    {
        "content": "* Indexes down: Dow 0.14 pct  S&P 0.29 pct  Nasdaq 0.26 pct   (Updates to market close)",
        "date": "03072017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Pharma  bank stocks pull Wall St lower "
    },
    {
        "content": "* Indexes down: Dow 0.1 pct  S&P 0.19 pct  Nasdaq 0.11 pct   (Updates to mid-afternoon  changes byline)",
        "date": "03072017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St dips as pharma  bank stocks retreat "
    },
    {
        "content": "SAN FRANCISCO  March 6 Shares of Snap Inc  slumped 12 percent on Monday and closed at their lowest level of the three sessions since the Snapchat owner's soaring market debut last week.",
        "date": "03062017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap slumps 12 percent  closes at lowest since IPO "
    },
    {
        "content": "NEW YORK  March 5 Snap Inc's share price looks overvalued following a surge in the wake of its much-anticipated initial public offering last week  according to an article in Barron's.",
        "date": "03052017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap's stock price hard to justify - Barron's "
    },
    {
        "content": "    By Ross Kerber     BOSTON  March 8 FTSE Russell will consult with big investors on whether to include companies like Snap Inc          in its widely followed  stock indexes even if their shares lack voting rights  an executive said.      The issue will be studied at meetings with asset managers and other clients this month  Joti Rana  Americas head of governance and policy for FTSE Russell  said in an interview on Tuesday. FTSE Russell offers popular indexes like Britain's blue-c",
        "date": "03082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "FTSE Russell turns to investors on Snap voting rights quandary "
    },
    {
        "content": "* Indexes down: Dow 0.13 pct  S&P 0.23 pct  Nasdaq 0.17 pct   (Updates to early afternoon)",
        "date": "03072017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St dips as pharma  bank stocks lose ground "
    },
    {
        "content": "* Dow down 0.02 pct  S&P down 0.11 pct  Nasdaq up 0.08 pct   (Adds details  comments  updates prices)",
        "date": "03072017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St pares losses as techs offset pharma decline "
    },
    {
        "content": "BOSTON A group representing large institutional investors has approached index providers S&P Dow Jones Indices and MSCI Inc  looking to bar Snap Inc  and any other company that sells investors non-voting shares from their stock benchmarks.",
        "date": "03062017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Investor group seeks to bar Snap from indexes over voting rights "
    },
    {
        "content": "BOSTON  March 6 A group representing large institutional investors has approached index providers S&P Dow Jones Indices and MSCI Inc  looking to bar Snap Inc and any other company that sells investors non-voting shares from their stock benchmarks.",
        "date": "03062017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 1-Investor group seeks to bar Snap from indexes over voting rights "
    },
    {
        "content": "March 7 Snap Inc's shares fell as much as 10.4 percent on Tuesday  opening at their lowest since a blockbuster market debut last week.",
        "date": "03072017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap's shares open at lowest since market debut "
    },
    {
        "content": "BOSTON  March 6 A group representing large institutional investors has approached stock index providers S&P Dow Jones Indices and MSCI Inc  looking to bar Snap Inc and any other company that sells investors non-voting shares from their stock benchmarks.",
        "date": "03062017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "CORRECTED-Investor group seeks to bar Snap from indexes over voting rights "
    },
    {
        "content": "SAN FRANCISCO  March 8 Shares of Snap Inc  rebounded on Wednesday following a steep selloff while an initial rush to short sell the stock appeared to be slowing.",
        "date": "03082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap perks up after initial rush of short sellers "
    },
    {
        "content": "* Indexes down: Dow 0.14 pct  S&P 0.20 pct  Nasdaq 0.13 pct   (Updates to open)",
        "date": "03072017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St slips as Trump tweet pummels drug stocks "
    },
    {
        "content": "NEW YORK Snap Inc's  share price looks overvalued following a surge in the wake of its much-anticipated initial public offering last week  according to an article in Barron's.",
        "date": "03062017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap's stock price hard to justify: Barron's "
    },
    {
        "content": "BOSTON Billionaire investor David Tepper  whose views on markets and stocks are closely watched by other money managers  said on Wednesday he bought shares of Snap Inc in its initial public offering  sold some  and would buy again if the price dropped.",
        "date": "03082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Hedge fund manager Tepper sold some Snap shares as prices climbed: CNBC "
    },
    {
        "content": "BOSTON  March 8 Billionaire investor David Tepper  whose views on markets and stocks are closely watched by other money managers  said on Wednesday he bought shares of Snap Inc in its initial public offering  sold some  and would buy again if the price dropped.",
        "date": "03082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Hedge fund manager Tepper sold some Snap shares as prices climbed -CNBC "
    },
    {
        "content": "* Futures down: Dow 28 pts  S&P 4.75 pts  Nasdaq 10 pts   (Adds details  comments  updates prices)",
        "date": "03072017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St set to open lower as rate hike looms "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK Snap Inc's  shares tumbled 12 percent on Tuesday and traders raced to position themselves to cash in on further declines after analysts gave the company a lukewarm reception following its red-hot market debut. | Video ",
        "date": "03082017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap shares tumble as short sellers move in "
    },
    {
        "content": "March 7 U.S. stock index futures were down on Tuesday as investors assessed the potential impact of U.S. President Donald Trump's latest moves  including a plan to repeal and replace the Affordable Care Act.",
        "date": "03072017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Futures slip as investors assess Trump's policies "
    },
    {
        "content": "Comcast Corp's  NBCUniversal has invested $500 million in Snapchat owner Snap Inc   according to a memo on Friday  its latest move aimed at driving digital growth as more viewers go online for their favorite content.",
        "date": "03032017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "NBCUniversal invests $500 million in Snap's IPO "
    },
    {
        "content": "BOSTON An investor committee that advises the U.S. Securities and Exchange Commission will next week review if Snap Inc's decision to deny shareholders voting rights might also reduce the social media company's public disclosures on executive pay and other governance matters  the head of that committee told Reuters on Wednesday.",
        "date": "03012017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Exclusive: SEC advisory committee to question Snap's transparency for investors "
    },
    {
        "content": "LOS ANGELES  March 2 As shares of California-based Snap Inc began trading on the New York Stock Exchange on Thursday  two dozen residents of the company's adopted home of Venice Beach protested outside its offices  accusing the growing tech company of spoiling their seaside community.",
        "date": "03022017",
        "name": "Snap Inc",
        "news_type": "topStory",
        "symbol": "SNAP",
        "title": "Snap HQ spoils community  Venice Beach protesters say "
    },
    {
        "content": "* Dow down 0.03 pct  S&P down 0.1 pct  Nasdaq down 0.04 pct   (Updates to late afternoon)",
        "date": "03032017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St steady after Yellen signals rate hike this month "
    },
    {
        "content": "* Dow up 0.02 pct  S&P down 0.01 pct  Nasdaq up 0.03 pct   (Adds Yellen comments  details  updates prices)",
        "date": "03032017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St flat after Yellen signals rate hike this month "
    },
    {
        "content": "NEW YORK As Snap Inc looks to gobble up a larger share of the $82 billion digital U.S. ad market  the owner of the ephemeral messaging app popular with millennials could find itself facing more demands from advertisers for reliable metrics.",
        "date": "03012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap advertisers worry about measurement even as they 'lean in' "
    },
    {
        "content": "The Dow on Wednesday blasted through the 21 000 mark for the first time after U.S. President Donald Trump's measured tone in his first speech to Congress lifted optimism and investors viewed a looming interest rate hike as a glass half full. | Video ",
        "date": "03012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Dow pierces 21 000 after Trump speech  rate-hike chatter "
    },
    {
        "content": "* Indexes down: Dow 0.5 pct  S&P 0.6 pct  Nasdaq 0.7 pct   (Updates to close)",
        "date": "03022017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St retreats after surge; Caterpillar  financials fall "
    },
    {
        "content": "March 3 Comcast Corp's NBCUniversal has invested $500 million in Snapchat owner Snap Inc  according to a memo on Friday  its latest move aimed at driving digital growth as more viewers go online for their favorite content.",
        "date": "03032017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 3-NBCUniversal invests $500 mln in Snap's IPO "
    },
    {
        "content": "BOSTON An investor committee that advises the U.S. Securities and Exchange Commission will next week review if Snap Inc's decision to deny shareholders voting rights might also reduce the social media company's public disclosures on executive pay and other governance matters  the head of that committee told Reuters on Wednesday.",
        "date": "03012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "SEC advisory committee to question Snap's transparency for investors "
    },
    {
        "content": "March 2 Look no further than Thursday’s initial public offering of Snap Inc for a short course on why Donald Trump is highly unlikely to make his target of 3 percent annual economic growth.",
        "date": "03022017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "COLUMN-Trump's GDP target won't last in a Snapchat world: James Saft "
    },
    {
        "content": "* Indexes down: Dow 0.23 pct  S&P 0.23 pct  Nasdaq 0.24 pct   (Adds details  comments  updates prices)",
        "date": "03032017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St slips ahead of Yellen's speech "
    },
    {
        "content": "March 1 Snap Inc priced its initial public offering above its target range on Wednesday  raising $3.4 billion as investors set aside concerns about its lack of profits and voting rights for a piece of the hottest tech IPO in years.",
        "date": "03012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "UPDATE 2-Snap tops expectations in pricing of long-awaited IPO "
    },
    {
        "content": "* Indexes end up: Dow 1.46 pct  S&P 1.37 pct  Nasdaq 1.35 pct   (Adds detail on Snap IPO)",
        "date": "03012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Dow pierces 21 000 after Trump speech  rate-hike chatter "
    },
    {
        "content": "NEW YORK Shares of Snap Inc   the owner of the messaging app Snapchat  closed at $24.48 per share on the New York Stock Exchange on Thursday versus the initial public offering price of $17.",
        "date": "03022017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Factbox - Snap IPO: The asymmetry of venture returns "
    },
    {
        "content": "* NBCUniversal CEO Steve Burke says in note to employees that co made a strategic investment of $500 million in Snap Inc as part of Snap's IPO",
        "date": "03032017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "BRIEF-NBCUniversal CEO says co made investment of $500 million in Snap Inc as part of Snap's IPO "
    },
    {
        "content": "Spotify has reported via Twitter that it now has 50 million paid subscribers  a rise of 25 percent in less than six months  and extending the music streaming service's lead over its closest rival  Apple Music.",
        "date": "03032017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Music service Spotify tweets it now has 50 million paid subscribers "
    },
    {
        "content": "March 1 Snap Inc  owner of popular messaging app Snapchat  raised $3.4 billion in its initial public offering on Wednesday  more than it had sought  in the most eagerly awaited technology IPO since Chinese e-commerce giant Alibaba went public in 2014.",
        "date": "03012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snapchat owner Snap raises $3.4 billion in IPO -source "
    },
    {
        "content": "Many investors who took part in the record-smashing initial public offering of the owner of Snapchat seem to think it was a 'must-have ' regardless of fear over share structure and profitability.",
        "date": "03022017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Business Watch: What investors see in Snap IPO "
    },
    {
        "content": "March 3 NBCUniversal  a unit of Comcast Corp   invested $500 million in Snap Inc during its IPO as part of a strategic investment and partnership  CNBC reported on Friday  citing sources familiar with the matter. http://cnb.cx/2mlOnXB",
        "date": "03032017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "NBCUniversal invested $500 mln in Snap Inc during IPO - CNBC "
    },
    {
        "content": "SAN FRANCISCO A decade ago  Lightspeed Venture Partners was an obscure firm investing in highly technical startups that were mostly unknown outside of Silicon Valley.",
        "date": "03012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snap vaults venture investor Lightspeed into the Silicon Valley elite "
    },
    {
        "content": "SAN FRANCISCO  March 1 A decade ago  Lightspeed Venture Partners was an obscure firm investing in highly technical startups that were mostly unknown outside of Silicon Valley.",
        "date": "03012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "REFILE-Snap vaults venture investor Lightspeed into the Silicon Valley elite "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO  March 2 Institutional investors anxious not to be left out of this year's marquee initial public offering helped Snap Inc pull off the biggest U.S.-listed technology share sale this week since Chinese e-commerce juggernaut Alibaba Group Holding Inc smashed records in 2014.",
        "date": "03022017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Investors see Snap's IPO as 'too big to fail' "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - To value Snapchat requires the whimsical sort of filters the disappearing-photo app company has made famous. All the various tallies  even at a specified share price  call on investors to cover their eyes with heart-shaped  rose-tinted lenses.",
        "date": "03012017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Snapchat valuation requires different filters "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.4 pct  Nasdaq 0.5 pct   (Updates to late afternoon)",
        "date": "03022017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St retreats after rally; Caterpillar  financials fall "
    },
    {
        "content": "* Indexes down: Dow 0.31 pct  S&P 0.44 pct  Nasdaq 0.51 pct   (Updates to early afternoon)",
        "date": "03022017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "US STOCKS-Wall St slips after record rally; Caterpillar drags Dow "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Investors have effectively just done what no self-respecting person ever should: wear sweatpants in public. With Snap's $3.4 billion initial public offering they have simply given up giving a damn. They handed their money over to an immature company and in the process abrogated their rights to fair treatment  good governance and reasonable valuations. If the $24 billion self-styled \"camera company\" run by a 26-year-old fails to achieve its ambitions  shareholde",
        "date": "03022017",
        "name": "Snap Inc",
        "news_type": "normal",
        "symbol": "SNAP",
        "title": "Cox: Snap IPO marks moment investors donned sweats "
    }
]