[
    {
        "content": "* Sony has twice lifted its FY original outlook by total of 10.5 pct to 4.2 million units  same figure as year ended this march‍​ - Nikkei Source text (http://s.nikkei.com/2hGabNh) Further company coverage:",
        "date": "11162017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony has twice lifted its FY original outlook by total of 10.5 pct to 4.2 mln units-Nikkei "
    },
    {
        "content": "* Comcast and Sony partner to bring xfinity TV partner app to sony smart TVs",
        "date": "11142017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Comcast and Sony partner to bring xfinity TV partner app to Sony smart TVs "
    },
    {
        "content": "TOKYO  Nov 2 Japan's Nikkei share average extended its strong rally to top a new 21-year peak on Thursday morning  with the mining sector getting a boost while buyers continued to pile into companies such as Honda Motor and Sony on robust earnings prospects.",
        "date": "11022017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Nikkei at 21-year high; Honda  Sony up on earnings boost "
    },
    {
        "content": "TOKYO Shares in Sony Corp  soared to a nine-year high on Wednesday after it forecast record earnings that have vindicated its restructuring efforts and raised expectations of sustained momentum in profitability. | Video ",
        "date": "11012017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Record profit forecast for a resurgent Sony sends shares to nine-year high "
    },
    {
        "content": "TOKYO  Nov 1 Japan's Sony Corp said on Wednesday it has brought back AIBO more than a decade since it last made the robotic dog  as the electronics and entertainment firm seeks to rebuild its reputation for innovation after years of restructuring.",
        "date": "11012017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony revives pet AI project with updated AIBO robot dog "
    },
    {
        "content": "* Hiked annual operating profit forecast by 26 pct to 630 bln yen",
        "date": "11012017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 3-Record profit forecast for a resurgent Sony sends shares to nine-year high "
    },
    {
        "content": "TOKYO  Nov 1 Japanese stocks yet again scaled a 21-year high on Wednesday  cheered by booming profits for Japan Inc. including exporters such as Sony and Nitto Denko.",
        "date": "11012017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Nikkei advances to 21-yr high  robust earnings brighten mood "
    },
    {
        "content": "TOKYO  Nov 1 Japanese stocks scaled a fresh 21-year high on Wednesday morning  cheered by booming profits for Japan Inc. including exporters such as Sony and Nitto Denko.",
        "date": "11012017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Nikkei jumps to 21-yr high on earnings boost from Sony  other exporters "
    },
    {
        "content": "TOKYO  Nov 1 Shares in Sony Corp soared as much as 11.6 percent to a nine-year high on Wednesday after the Japanese electronics and entertainment firm forecast its best ever annual profit.",
        "date": "11012017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony shares soar to 9-year high after forecast of record profit "
    },
    {
        "content": "TOKYO Japan's Sony Corp on Tuesday said it expects to book its highest-ever profit this year  underscoring the success of Chief Executive Kazuo Hirai's restructuring that refocused the electronics and entertainment firm on image sensors and gaming.",
        "date": "10312017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony forecasts best-ever annual profit  sealing overhaul success "
    },
    {
        "content": "* Previous record Y526 bln set on solid sales of first PlayStation",
        "date": "10312017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony forecasts best-ever annual profit  sealing overhaul success "
    },
    {
        "content": "TOKYO  Oct 31 Japan's Sony Corp lifted its full-year operating income forecast on Tuesday  expecting to book its highest-ever profit due to strong sales of image sensors used in smartphones and other devices.",
        "date": "10312017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony raises earnings outlook  expects best-ever annual profit "
    },
    {
        "content": "A patent holding company sued Apple Inc on Friday  alleging infringement of smartphone patents that once belonged to Sony Corp and Nokia Corp.",
        "date": "10092017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Apple faces fresh lawsuit over former Sony  Nokia patents "
    },
    {
        "content": "* TiVo Corp renews multi-year intellectual property license deal with Sony",
        "date": "10022017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-TiVo Corp renews multi-year intellectual property license deal with Sony "
    },
    {
        "content": "* Sony Interactive Entertainment -  co's Deputy President John Kodera  appointed as President and Chief Executive Officer of Sony Interactive immediately",
        "date": "10032017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "CORRECTED-BRIEF-Sony appoints John Kodera as CEO of Sony Interactive Entertainment "
    },
    {
        "content": "FRANKFURT Canadian pension fund OMERS and U.S. buyout group Madison  are acquiring Berlin's landmark property Sony Center from Korea's national pension fund NPS for 1.1 billion euros ($1.3 billion)  the companies said on Monday.",
        "date": "10022017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "OMERS buys landmark Berlin property Sony Center for 1.1 billion euros "
    },
    {
        "content": "FRANKFURT  Oct 2 Canadian pension fund OMERS and U.S. buyout group Madison are acquiring Berlin's landmark property Sony Center from Korea's national pension fund NPS for 1.1 billion euros ($1.3 billion)  the companies said on Monday.",
        "date": "10022017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "OMERS buys landmark Berlin property Sony Center for 1.1 bln eur "
    },
    {
        "content": "A federal judge in Manhattan on Thursday rejected Sony Corp's request for an injunction to stop Fujifilm Holdings Corp from continuing patent infringement litigation before the U.S. International Trade Commission and in a Tokyo court related to the sale of magnetic tape cartridges and components.",
        "date": "09282017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "U.S. judge rejects Sony bid to block Fujifilm ITC  Tokyo cases "
    },
    {
        "content": "CHIBA  Sept 22 Sony Corp's gaming chief on Friday said the virtual reality gaming market needs more competition to drive adoption of the technology and spur software development  adding the sheer size of Sony's lead over rivals is cause for discomfort.",
        "date": "09222017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "VR needs more competition to build audience  top player Sony says "
    },
    {
        "content": "* TOMTOM MAPS TECHNOLOGY TO POWER SONY PROTOTYPE DEVICE FOR BIKING NAVIGATION Source text for Eikon: Further company coverage: (Gdynia Newsroom:)",
        "date": "09112017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-TomTom maps technology to power Sony prototype device for biking navigation "
    },
    {
        "content": "Fujifilm Corp on Friday sued Sony Corp for patent infringement  opening up a new front in a global dispute between the Japanese companies over the rights to backup tape technology.",
        "date": "09152017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Fujifilm ratchets up Sony patent fight with new complaint "
    },
    {
        "content": "* Fujifilm Corporation says receives favorable final initial determination in United States ITC case against Sony Corporation Further company coverage: ",
        "date": "09152017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Fujifilm says receives favorable final initial determination in U.S. ITC case against Sony "
    },
    {
        "content": "* Says Murata Manufacturing Co Ltd group completed acquisition of battery business from Sony Corp group  on Sept. 1",
        "date": "09012017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF- Murata Manufacturing completes acquisition of battery business from Sony "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL/HONG KONG  August 14 (Fitch) Fitch Ratings has upgraded Sony Corporation's (Sony) Long-Term Foreign- and Local-Currency Issuer Default Ratings (IDR) and local-currency senior unsecured ratings to 'BB+' from 'BB'. The Outlook on the IDRs is Positive. Simultaneously  its Short-Term Foreign- and Local-Currency IDRs are affirmed at 'B'. A full list of rating actions is at the end of this release. The Positive Outlook reflects Fitch's ",
        "date": "08142017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Fitch Upgrades Sony Corporation to 'BB+'; Outlook Positive "
    },
    {
        "content": "* No future for smartphone panel business without OLED -CEO (Recasts with CEO comments; adds background)",
        "date": "08092017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Japan Display considers new capital to adapt to Apple's OLED shift "
    },
    {
        "content": "TOKYO Sony Corp  booked its best-ever first-quarter profit on Tuesday  taking the firm one step toward its highest annual result in two decades  as smartphone makers demand more of its image sensors for high-end handsets sporting twin rear cameras.",
        "date": "08012017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony sets itself up for record annual profit  but strikes cautious tone "
    },
    {
        "content": "* Games profit drops; expects revival with new titles (Adds CFO comment  sensor sales outlook  gaming business result  context)",
        "date": "08012017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony sets itself up for record annual profit  but strikes cautious tone "
    },
    {
        "content": "TOKYO  Aug 1 Japan's Sony Corp on Tuesday reported its highest-ever first-quarter operating profit  taking the electronics giant one step toward its highest annual profit in two decades on the back of solid sales of image sensors.",
        "date": "08012017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "REFILE-Sony sets record with three-fold jump in Q1 operating profit "
    },
    {
        "content": "* SEES HIGHER GROUP TURNOVER AND PROFIT IN 2017 Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "07182017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Endor: license agreement with Sony for PlayStation 4 "
    },
    {
        "content": "* Says acquisition date of battery business from Sony Corp is expected to be on Sept. 1",
        "date": "07192017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF- Murata Manufacturing announces acquisition date of battery business from Sony "
    },
    {
        "content": "Sony Corp is in the final stages of talks to buy French music distribution and label services provider Believe Digital  the Nikkei business daily reported on Saturday.",
        "date": "07142017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony to buy French music company Believe Digital: Nikkei "
    },
    {
        "content": "July 15 Sony Corp is in the final stages of talks to buy French music distribution and label services provider Believe Digital  the Nikkei business daily reported on Saturday.",
        "date": "07142017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to buy French music company Believe Digital - Nikkei "
    },
    {
        "content": "* Sony Corp is in the final stages of talks to acquire French music distribution and label services provider Believe Digital - Nikkei",
        "date": "07142017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony to buy French music company Believe Digital - Nikkei "
    },
    {
        "content": "* Says it extends effective date of battery business transfer to its wholly owned battery unit (TMM) to Sept. 1 from July 1",
        "date": "06212017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF- Sony extends effective date of battery business transfer to battery unit "
    },
    {
        "content": "* Says it plans to postpone acquisition date of battery business from Sony Corp",
        "date": "06082017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Murata Manufacturing plans to postpone acquisition date of battery business from Sony "
    },
    {
        "content": "TOKYO  June 7 Sony Corp has sold more than one million units of its virtual reality (VR) headset globally  the Asia chief of the Japanese firm's gaming unit said on Wednesday  as a relatively low price helps push the product into an early lead.",
        "date": "06072017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "RPT-Sony's PlayStation VR headset sales top 1 million units "
    },
    {
        "content": "TOKYO Sony Corp has sold more than one million units of its virtual reality (VR) headset globally  the Asia chief of the Japanese firm's gaming unit said on Wednesday  as a relatively low price helps push the product into an early lead.",
        "date": "06072017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony's PlayStation VR headset sales top one million units "
    },
    {
        "content": "TOKYO  June 7 Sony Corp has sold more than one million units of its virtual reality (VR) headset globally  the Asia chief of the Japanese firm's gaming unit said on Wednesday  as a relatively low price helps push the product into an early lead.",
        "date": "06072017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony's PlayStation VR headset sales top 1 million units "
    },
    {
        "content": "TOKYO  June 7 Japan Display Inc is considering deeper restructuring than first planned and has asked a state-backed fund for help after losing business with Apple Inc due to its late entry into OLED technology  the Nikkei business daily reported.",
        "date": "06072017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Japan Display considers deeper restructuring  seeks more funding -Nikkei "
    },
    {
        "content": "* SAID ON MONDAY APPEALS COURT ISSUED AN ORDER  IN PATENT INFRINGEMENT PROCEEDINGS BROUGHT BY SSH AGAINST SONY  IN WHICH IT HELD THAT SONY GROUP COMPANY IN GERMANY MAY INFRINGE SSH PATENT EP 2 254 311",
        "date": "05302017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-SSH: German Appeals Court overrules District Court on infringement of SSH patent by Sony "
    },
    {
        "content": "LOS ANGELES Sony Corp on Thursday named former Fox television executive Anthony Vinciquerra as chairman and chief executive of Sony Pictures Entertainment  effective June 1.",
        "date": "05112017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony taps Vinciquerra to lead Sony film  TV studio "
    },
    {
        "content": "LOS ANGELES  May 11 Sony Corp on Thursday named former Fox television executive Anthony Vinciquerra as chairman and chief executive of Sony Pictures Entertainment  effective June 1.",
        "date": "05112017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony taps Vinciquerra to lead Sony film  TV studio "
    },
    {
        "content": "LOS ANGELES  May 11 Sony Corp has named former Fox executive Anthony Vinciquerra the new chairman and chief executive of Sony Pictures Entertainment  the company said in a statement on Thursday. Vinciquerra's appointment is effective June 1. He replaces Michael Lynton  who announced in January that he would step down in the spring. (Reporting by Lisa Richwine)",
        "date": "05112017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony taps Vinciquerra to lead Sony Pictures Entertainment "
    },
    {
        "content": "* Sony Corp relaunching OLED TVs using LG-made panels on June 10 Source text for Eikon: Further company coverage:",
        "date": "05082017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony Corp relaunching OLED TVs using LG-made panels - Nikkei "
    },
    {
        "content": "TOKYO Sony Corp on Friday said it expects annual profit to surge 73 percent  closing in on a two decade-old record  as its cash-cow image sensor business recovers from quake damage just as smartphone makers start loading handsets with more sensors.",
        "date": "04282017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony sees surge in chip demand pushing profit nearing 20-year record "
    },
    {
        "content": "* PlayStation 4 has entered harvest period -CFO (Adds CFO comments)",
        "date": "04282017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony sees surge in chip demand pushing profit nearing 20-year record "
    },
    {
        "content": "TOKYO  April 28 Sony Corp said on Friday it expects operating profit to rise 73.2 percent in the financial year through March 2018 as its cash-cow image sensor business recovers from earthquake damage that had suspended a key plant in southern Japan.",
        "date": "04282017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony expects 73.2 pct annual profit jump as it recovers from quake damage "
    },
    {
        "content": "TOKYO Japan's Sony Corp  raised its operating profit estimate for the year ended March 31 thanks to lower amortization costs for its financial services segment.",
        "date": "04212017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony lifts annual profit estimate on lower amortization costs "
    },
    {
        "content": "TOKYO  April 21 Japan's Sony Corp raised its operating profit estimate for the year ended March 31 thanks to lower amortisation costs for its financial services segment.",
        "date": "04212017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony lifts annual profit estimate on lower amortisation costs "
    },
    {
        "content": "WASHINGTON  April 12 The U.S. International Trade Commission said on Wednesday it has launched a patent infringement investigation of television set-top boxes and other components that Arris International supplies to Comcast Corp and DirecTV for their Xfinity and Genie customers.",
        "date": "04122017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "U.S. ITC to investigate Sony patent infringement claims against Arris "
    },
    {
        "content": "April 6 Consumer electronics maker Hisense Electric Co Ltd said it had become an official sponsor of FIFA  making it the latest Chinese company to partner with the global soccer governing body.",
        "date": "04062017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "China's Hisense Electric becomes FIFA sponsor "
    },
    {
        "content": "* Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"A-\" – R&I",
        "date": "03272017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-R&I affirms Sony's rating at \"A-\" and announces stable outlook – R&I "
    },
    {
        "content": "* Take Two Interactive - On March 23  co  Sony Interactive  SIEA  SIEE  entered PlayStation Global Developer and Publisher Agreement",
        "date": "03292017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Take Two Interactive  Sony Interactive  SIEA  SIEE  entered PlayStation Global Developer and Publisher Agreement "
    },
    {
        "content": "SAN FRANCISCO  March 1 Facebook Inc's virtual reality unit Oculus has cut $200 from the total price of its flagship hardware set  in a bid to expand the system's base of video game players  the company said on Wednesday.",
        "date": "03012017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "UPDATE 2-Facebook's Oculus cuts price of virtual reality set by $200 "
    },
    {
        "content": "* Says the co plans to transfer investment management of Sony Interactive Entertainment Europe  Ltd. to its wholly owned subsidiary Sony Interactive Entertainment Inc",
        "date": "02242017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony to transfer SIEE investment management business to Sony Interactive Entertainment Inc "
    },
    {
        "content": "* Says it will transfer the imaging products and solution business to its wholly owned subsidiary  which has been engaged in the manufacturing and sales of electron and electricity machine and equipment in Tokyo  Japan",
        "date": "02152017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony to transfer imaging products & solution business to wholly owned subsidiary "
    },
    {
        "content": "Feb 15 Sony Corp and Murata Manufacturing Co Ltd :",
        "date": "02152017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony and Murata Manufacturing change business transfer date to July "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL/SYDNEY  February 03 (Fitch) Sony Corporation's (BB/Positive) strong  commitment to increasing profitability through restructuring and cost-cutting  will improve its credit profile over the medium to long term  although the  struggling movie and smartphone businesses may delay Sony's recovery and  overshadow its expanding semiconductor and solid gaming businesses in the short  term  says Fitch Ratings.  The company's theatrical rev",
        "date": "02032017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Fitch: Current Problems Delay  Not Derail  Sony's Turnaround "
    },
    {
        "content": "TOKYO  Feb 3 Japan's Nikkei edged down in choppy trade on Friday  as investors awaited the release of the U.S. monthly jobs report that will set the tone for the Federal Reserve's policy outlook  while bank stocks outperformed on higher yields.",
        "date": "02032017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Nikkei edges down in choppy trade; bank shares outperform "
    },
    {
        "content": "TOKYO Sony Corp on Thursday said it does not plan to sell its pictures business after suffering a $1 billion writedown  and instead aims to turn it around by adding sales channels and making more use of movie characters.",
        "date": "02022017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony rules out pictures biz sale  committed to turnaround "
    },
    {
        "content": "* Pictures profit sacrificed during electronics turnaround -CFO   (Adds CFO comments  earnings details  background)",
        "date": "02022017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony rules out pictures biz sale  committed to turnaround "
    },
    {
        "content": "TOKYO Sony Corp  will write down the value of its movie business by nearly 112.1 billion yen ($976 million) in the third quarter  blaming weaker film profits as online streaming services sap demand for movie DVDs.",
        "date": "01312017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony takes $1 billion writedown on its movie business "
    },
    {
        "content": "* pictures segment unlikely to achieve earnings target in year ending March 2018",
        "date": "02022017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony CFO says no possibility of selling pictures business "
    },
    {
        "content": "* To record 37 bln yen gain within operating income from sale   (Adds background on market share)",
        "date": "01312017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 4-Sony takes $1 bln writedown on its movie business "
    },
    {
        "content": "TOKYO  Feb 2 Sony Corp on Thursday cut its full-year outlook for operating profit on Thursday after the Japanese TV-to-gaming group took a $1 billion writedown on its struggling movie business.",
        "date": "02022017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony cuts annual profit view on movie business writedown "
    },
    {
        "content": "TOKYO  Jan 30 Sony Corp said on Monday it booked an impairment charge of 112.1 billion yen ($976 million) on the goodwill value of its film segment in October-December.",
        "date": "01302017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony takes $976 mln charge on film segment in Oct-Dec "
    },
    {
        "content": "* Says the co to sell 5.3 percent stake in M3 Inc  for 52 billion yen",
        "date": "01312017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony to sell 5.3 pct stake in M3 Inc for 52 bln yen "
    },
    {
        "content": "TOKYO  Jan 31 Sony Corp's shares slid as much as 4 percent on Tuesday to 3 362 yen after the company said it had booked a 112.1 billion yen ($986.97 million) impairment charge on the goodwill value of its movie segment in the quarter ended December.",
        "date": "01312017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony shares dip on movie business impairment charge "
    },
    {
        "content": "* Says the co plans to cut stake in M3 Inc to 34 percent from 39.3 percent",
        "date": "01302017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony to cut stake in M3 Inc to 34 pct from 39.3 pct "
    },
    {
        "content": " ",
        "date": "01202017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Paul McCartney sues Sony/ATV for Beatles music rights "
    },
    {
        "content": "* Sony Corporation reports 7 percent passive stake in Genius Brands International Inc as of Jan 18 - sec filing  Source text - http://bit.ly/2k3Uqes Further company coverage:",
        "date": "01192017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony Corp reports 7 pct passive stake in Genius Brands International "
    },
    {
        "content": "Jan 13 Sony Corp said on Friday Michael Lynton would step down as chief executive of its movie and music businesses  Sony Entertainment  effective Feb. 2.",
        "date": "01132017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony Entertainment CEO Lynton to step down; to become Snap Inc chairman "
    },
    {
        "content": "* Michael Lynton to step down as Corporate Executive Officer of Sony Corporation and CEO of Sony Entertainment",
        "date": "01132017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Michael Lynton to step down as corporate executive officer of Sony and CEO of Sony Entertainment "
    },
    {
        "content": "* CEO of Sony's entertainment division  Michael Lynton to step down to focus on Snapchat- NYT  Source http://nyti.ms/2j9rvGF",
        "date": "01132017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Head of Sony Entertainment  Michael Lynton  to step down- NYT "
    },
    {
        "content": "Jan 18 Former Beatle Paul McCartney sued Sony Corp's music publishing arm on Wednesday in a federal court in New York  seeking to get back the copyrights to music of his former band  court records show.",
        "date": "01182017",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Paul McCartney sues Sony/ATV for Beatles music rights "
    },
    {
        "content": "WASHINGTON  Jan 18 The U.S. International Trade Commission said on Wednesday it had launched on investigation into whether Fujifilm Holdings Corp was violating patents which Sony Corp holds for certain magnetic tape cartridges.",
        "date": "01182017",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "U.S. to probe whether Fujifilm violating Sony magnetic tape patents "
    },
    {
        "content": "TOKYO Japan Display Inc  will pay more than $100 million to boost its stake in an organic light-emitting diode (OLED) panel maker  the Nikkei business daily said - a step that would improve its position in a key technology where it lags far behind rivals.",
        "date": "12132016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Japan Display to raise stake in OLED display maker Joled: Nikkei "
    },
    {
        "content": "TOKYO Sony Corp said on Wednesday sales of its PlayStation 4 video game console had exceeded 50 million units as of Dec 6 helped by strong demand during the year-end holiday season.",
        "date": "12072016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony's PlayStation 4 sales top 50 million units worldwide "
    },
    {
        "content": "TOKYO Japan's Sony Corp  will release as many as six smartphone games in the next financial year  hoping that its own gaming franchises can replicate the success of console rival Nintendo Co's  Pokemon GO.",
        "date": "12072016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to release six smartphone games to accelerate mobile drive "
    },
    {
        "content": "* Two-week strike at Sony unit's factory ended Friday after the company offered to pay each employee up to 1 000 Yuan to return to work - Nikkei",
        "date": "11252016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Two-week strike at Sony unit's factory ends - Nikkei "
    },
    {
        "content": "* \"Sony unit told striking workers at a factory here wednesday that they will be fired unless they resume their jobs within the week\"- Nikkei  Source text for Eikon:  Further company coverage:",
        "date": "11232016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-\"Sony unit told striking workers at a factory here wednesday that they will be fired unless they resume their jobs within the week\"- Nikkei "
    },
    {
        "content": "Nov 11 Japan Display Inc is in advanced talks to receive a bailout amount of about 75 billion yen ($704.49 million) from Innovation Network Corp of Japan (INCJ)  a government-backed fund and the display maker's largest shareholder  the Wall Street Journal reported on Thursday.",
        "date": "11112016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Japan Display in talks for 75 bln yen bailout from INCJ - WSJ "
    },
    {
        "content": "* Says co's wholly-owned China-based unit Sony (China) Ltd enters into a binding definitive agreement  to sell entire shares in its wholly-owned unit Sony Electronics Huanan Co Ltd  to Shen Zhen O-Film Tech Co.  Ltd.",
        "date": "11072016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony plans sale of equity interest in Sony Electronics Huanan by Sony's Chinese subsidiary "
    },
    {
        "content": "TOKYO Japan's Sony Corp on Tuesday said it remained bullish about the long-term prospects of its cash-cow imaging sensor business after earthquake damage to a major factory contributed to a 48 percent drop in quarterly profit.",
        "date": "11012016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony bullish on sensors after quake causes quarterly profit to halve "
    },
    {
        "content": "* Chips unit  featuring image sensors  swings to loss   (Adds CFO comments  move toward automotive market)",
        "date": "11012016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony bullish on sensors after quake causes quarterly profit to halve "
    },
    {
        "content": "TOKYO  Nov 1 Japan's Sony Corp on Tuesday reported a 48 percent decline in operating profit for the July-September quarter as earthquake damage continued to affect its cash-cow imaging sensor business.",
        "date": "11012016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony reports Q2 operating profit plunge as quake impact lingers "
    },
    {
        "content": "TOKYO Sony Corp  cut its annual profit outlook due to losses related to the sale of its battery business - disappointing a market that had been hoping for an upward revision on buoyant sales momentum for PlayStation 4 and the launch of its virtual reality headset.",
        "date": "10312016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony surprises with profit warning on sale of battery business "
    },
    {
        "content": "* Cuts operating profit outlook to Y270 bln vs Y309 bln estimate",
        "date": "10312016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony surprises with profit warning on sale of battery business "
    },
    {
        "content": "* Says the co decided to establish Sony Imaging Products & Solutions Inc.  a wholly-owned subsidiary that will be responsible for its imaging products and solutions businesses",
        "date": "10262016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony to set up Sony Imaging Products & Solutions Inc to reinforce imaging business "
    },
    {
        "content": "TOKYO  Oct 31 Sony Corp said on Monday it was cutting its annual profit outlook due to impairment losses related to the sale of its battery business to Murata Manufacturing Co.",
        "date": "10312016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony cuts annual profit outlook due to sale of battery business "
    },
    {
        "content": "* Düsseldorf District Court (Landgericht Düsseldorf) in Germany judges against SSH in patent infringement case against Sony",
        "date": "10252016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-German court judges against SSH in patent infringement case against Sony "
    },
    {
        "content": "* Sony Life Insurance agreed with Crescent Capital Partners to acquire a 14.9% stake in clearview wealth limited",
        "date": "10252016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Clearview Wealth says Sony Life Insurance to buy 14.9 pct stake "
    },
    {
        "content": "* Sony Corp's Playstation Status page says all services are up and running  Source (http://bit.ly/1MuogoJ) Further company coverage:",
        "date": "10212016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony Corp's playstation status page says services up and running "
    },
    {
        "content": "* Sony Corp's Playstation status page says PS3 users may have some difficulty accessing features and products on the playstation store",
        "date": "10212016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony Corp says PS3 users may have difficulty accessing playstation store "
    },
    {
        "content": "Sony Corp plans to release five or more smartphone games around late March 2018  the Nikkei business daily said on Thursday.",
        "date": "10132016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony to launch smartphone games in 2018: Nikkei "
    },
    {
        "content": "Oct 13 Sony Corp plans to release five or more smartphone games around late March 2018  the Nikkei business daily said on Thursday.",
        "date": "10132016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to launch smartphone games in 2018 - Nikkei "
    },
    {
        "content": "TOKYO  Oct 12 Sony Corp will join the race for virtual reality (VR) dominance on Thursday with the $399 PlayStation VR  a headset the Japanese electronics group hopes will beat pricier rivals and revive its reputation as a maker of must-have gadgets.",
        "date": "10122016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony enters virtual reality race with PlayStation VR headset "
    },
    {
        "content": "* Sony plans to ready five or more smartphone games for release around late March 2018  targeting Japan and other parts of Asia - Nikkei",
        "date": "10132016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony to launch first smartphone games in 2018 - Nikkei "
    },
    {
        "content": "KIKUYO-MACHI  Japan Sony Corp's image sensor production will return to full capacity in the October-March half-year due to a pickup in smartphone demand  having spent part of the past year running just under full strength  the head of its chip-making subsidiary said.",
        "date": "10072016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony to return image sensors to full capacity on smartphone pickup "
    },
    {
        "content": "* Clients' business environment is improving -chip-making chief",
        "date": "10072016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony to return image sensors to full capacity on smartphone pickup "
    },
    {
        "content": "CHIBA  Oct 4 Japanese electronics components supplier Murata Manufacturing Co Ltd wants its enlarged battery business to help double automotive-related revenue when the years of rapid expansion in the smartphone market have passed  its chief executive said.",
        "date": "10042016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Japan's Murata aims to boost automotive revenue with Sony battery buy "
    },
    {
        "content": "CHIBA  Sept 15 Sony Corp aims to extend content for its dedicated virtual-reality (VR) headset into non-gaming areas such as TV and film  and has no plans to join the burgeoning market for smartphone-based headsets  its gaming division chief said.",
        "date": "09152016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony aims to extend VR content to films  no plans for smartphone-based headset "
    },
    {
        "content": "* Ps4 pro will be available on nov 10  2016  in Japan  North America And Europe at a msrp of 44 980 yen  us$399  eur 399 and £349  Source text for Eikon:  Further company coverage:",
        "date": "09072016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony unveils Playstation 4 Pro "
    },
    {
        "content": "Sept 7 Sony Interactive Entertainment  a division of Sony Corp  unveiled on Wednesday two new versions of its PlayStation 4 Console in an effort to help Sony maintain its sales lead over Microsoft Corp and Nintendo Co Ltd.",
        "date": "09072016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony unveils new versions of PlayStation 4 "
    },
    {
        "content": "* Says it plans to issue 30th series 3-yr unsecured corporation bonds worth 70 billion yen  with coupon rate of 0.05 percent and maturity date on Sept. 20  2019",
        "date": "09092016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony plans 4 series unsecured corporation bonds worth totaling 200 bln yen "
    },
    {
        "content": "Sony Interactive Entertainment  a division of Sony Corp   unveiled on Wednesday two new versions of its PlayStation 4 Console in an effort to help Sony maintain its sales lead over Microsoft Corp  and Nintendo Co Ltd . | Video ",
        "date": "09082016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony unveils new versions of PlayStation 4 "
    },
    {
        "content": "* Operations at Sony Semiconductor Manufacturing Corp's Kumamoto Technology Center were halted to inspect site's building  manufacturing equipment",
        "date": "09012016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony - Production at Kumamoto Technology Center expected to resume September 3 "
    },
    {
        "content": "* Panasonic  Sony to partner with broadcaster NHK  others to develop technology for televisions capable of handling ultrahigh resolution 8k video - Nikkei  Source text for Eikon:",
        "date": "08252016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Panasonic and Sony to partner with NHK  others to develop ultrahigh-resolution 8K video TV tech - Nikkei "
    },
    {
        "content": "* Sony And Tokyo Electric Power Co. Holdings to offer all-in-one smart home service enabling households to track control appliances' power usage - Nikkei",
        "date": "08222016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony and Tokyo Electric Power Co. Holdings will team up to offer smart home services - Nikkei "
    },
    {
        "content": "* Sony plans to unveil a new playstation 4 standard model alongside a high-end model next month - CNBC  citing DJ",
        "date": "08222016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony plans to unveil a new playstation 4 standard model alongside a high-end model next month - CNBC  citing DJ "
    },
    {
        "content": "* Fitch revises Sony Corp's outlook to positive; affirms at 'BB'  Source text for Eikon:  Further company coverage:",
        "date": "08152016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Fitch revises Sony Corp's outlook to positive  affirms ratings at 'BB' "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL/HONG KONG  August 15 (Fitch) Fitch Ratings has revised the Outlook on Sony  Corporation (Sony) to Positive from Stable. The Long-Term Foreign- and Local-  Currency Issuer Default Ratings (IDRs) have been affirmed at 'BB'. A full list  of rating actions is at the end of this release. The Outlook revision reflects Fitch's expectations of higher margins in Sony's  non-financial businesses and deleveraging following restructuring and ",
        "date": "08152016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Fitch Revises Sony's Outlook to Positive; Affirms at 'BB' "
    },
    {
        "content": "* No financing concerns but must prepare for eventualities -CEO",
        "date": "08092016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Struggling Japan Display says state fund promises full financial support "
    },
    {
        "content": "BRUSSELS  Aug 1 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08012016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "EU mergers and takeovers (Aug 1) "
    },
    {
        "content": "TOKYO  July 28 Sony Corp said on Thursday it has agreed to sell its battery business to Murata Manufacturing Co for a yet-to-be-determined amount.",
        "date": "07282016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony says to sell battery business to Murata Manufacturing "
    },
    {
        "content": "* Slowing demand for smartphones has weighed on Sony profits   (Adds details on deal  context)",
        "date": "07282016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony says to sell battery business to Murata Manufacturing "
    },
    {
        "content": "* Says the co and Murata Manufacturing Co.  Ltd.  entered into a non-binding memorandum of understanding that confirms their intent to negotiate the transfer of the Sony Group's battery business to the Murata Group",
        "date": "07282016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony signs memorandum of understanding to transfer battery business to Murata Manufacturing "
    },
    {
        "content": "TOKYO Japan's Sony Corp  said a strong yen and slower smartphone sales would weigh on its cash-generating image sensor business this year  but the popularity of its PlayStation 4 videogame should help it reach its profit target.",
        "date": "07292016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony keeps profit outlook as PlayStation 4 software sales surge "
    },
    {
        "content": "* Panasonic to raise $3.9 bln in part for Tesla plant investment   (Adds details on image sensor business  Panasonic investment)",
        "date": "07292016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony keeps profit outlook as PlayStation 4 software sales surge "
    },
    {
        "content": "* Sony cuts full-year image sensor sales forecast to 48 billion yen from 51 billion yen",
        "date": "07292016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "CORRECTED-BRIEF-Sony cuts this FY image sensor sales forecast to Y48 bln from Y51 bln "
    },
    {
        "content": "* Sony cuts full-year image sensor sales forecast to 480 billion yen from 51 billion yen",
        "date": "07292016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony cuts this FY image sensor sales forecast to Y480 bln from Y51 bln "
    },
    {
        "content": "TOKYO  July 29 Japan's Sony Corp on Friday reported a 42 percent decline in first-quarter operating profit due to earthquake damage to one of its key image sensor factories.",
        "date": "07292016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony logs 42 pct plunge in Q1 operating profit on quake damage "
    },
    {
        "content": "TOKYO Japan's Sony Corp  on Wednesday lifted the sales target for its games division next year on hopes for its new virtual reality headset  and said it would re-enter robots a decade after it last abandoned the business.",
        "date": "06292016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony upbeat on games and robots but cuts outlook for image sensors "
    },
    {
        "content": "* Images sensor outlook hit by weaker demand for smartphones   (Adds CEO comments  robot re-entry  background)",
        "date": "06292016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony upbeat on games and robots but cuts outlook for image sensors "
    },
    {
        "content": "Microsoft Corp  unveiled 'Project Scorpio'  a new Xbox console that will support ultra-high resolution gaming and virtual reality  while also launching a slimmer version of its Xbox One console at the video game conference E3 in Los Angeles on Monday. | Video ",
        "date": "06152016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Microsoft unveils slimmer Xbox; Sony's VR headset to hit U.S. in October "
    },
    {
        "content": "Microsoft Corp will buy LinkedIn Corp for $26.2 billion in its biggest-ever deal  a bold stroke by Microsoft CEO Satya Nadella in his efforts to make the venerable software company a major force in next-generation computing. | Video ",
        "date": "06142016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Microsoft to buy LinkedIn for $26.2 billion in its largest deal "
    },
    {
        "content": "A federal judge has awarded Sony Corp $400 000 in attorneys' fees after ruling that music publisher Mayimba Music Inc's claims that a hit song by pop star Shakira was an illegal copy of a Dominican songwriter's work were based on fraud.",
        "date": "06102016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "After copyright smackdown  Sony gets fees in Shakira case "
    },
    {
        "content": "June 13 Microsoft Corp unveiled 'Project Scorpio'  a new Xbox console that will support ultra-high resolution gaming and virtual reality  while also launching a slimmer version of its Xbox One console at the video game conference E3 in Los Angeles on Monday.",
        "date": "06142016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Microsoft unveils slimmer Xbox; Sony's VR headset to hit US in Oct "
    },
    {
        "content": "* DHX Brands and Sony Pictures Home Entertainment sign global home entertainment distribution deal for teletubbies  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05312016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-DHX Brands and Sony Pictures Home Entertainment sign deal "
    },
    {
        "content": "TOKYO  May 25 Japanese stocks rose to a near one-month high on Wednesday as exporters received a boost from a stronger dollar following firm U.S. housing data  while Sony Corp soared after releasing earnings.",
        "date": "05252016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Nikkei hits near 1-month high on weaker yen; Sony soars on outlook "
    },
    {
        "content": "TOKYO  May 25 Japanese stocks rebounded on Wednesday morning as exporters received a boost from a stronger dollar following firm U.S. housing data and as growing support for the British campaign to remain in the European Union bolstered global risk appetite.",
        "date": "05252016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Nikkei rebounds on weaker yen; Sony soars on growth outlook "
    },
    {
        "content": "May 22 Madonna paid tribute to Prince  Kesha earned a standing ovation for her stirring rendition of \"It Ain't Me  Babe\" honoring Bob Dylan  and Celine Dion dedicated her Icon award to her late husband at Sunday night's emotion-packed Billboard Music Awards.",
        "date": "05232016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 3-Madonna  Kesha  Dion rule the stage at emotional Billboard Awards "
    },
    {
        "content": "TOKYO Japan's Sony Corp on Tuesday forecast weaker-than-expected earnings this year after partially halting production of its cash-cow image sensors last month to assess earthquake damage to its factory.",
        "date": "05242016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony sees weaker-than-expected annual profit on quake damage "
    },
    {
        "content": "* Cancels development of some high-end camera modules   (Adds graphic)",
        "date": "05242016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 3-Sony sees weaker-than-expected annual profit on quake damage "
    },
    {
        "content": "* Says it will fully resume operations at Kumamoto plant by end-august    (Reporting by Makiko Yamazaki)",
        "date": "05242016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony: to fully resume Kumamoto plant operations by end-August "
    },
    {
        "content": "TOKYO  May 24 Japan's Sony Corp said on Tuesday it expects operating profit to rise just 2 percent in the year through March 2017  weighed down by damage from deadly earthquakes that halted production at its image sensor plant in Kumamoto.",
        "date": "05242016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony sees near-flat growth in annual profit as quake damage weighs "
    },
    {
        "content": "May 18 Chinese e-commerce giant Alibaba Group Holding Ltd is in discussions to become a top sponsor of FIFA  Bloomberg reported on Wednesday.",
        "date": "05182016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Alibaba discussing FIFA sponsorship - Bloomberg "
    },
    {
        "content": "TOKYO  May 18 Japan's Sony Corp said it plans to build up its artificial intelligence (AI) business and eventually turn it into a major revenue source  beginning with an investment in a U.S. start-up.",
        "date": "05172016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to build up AI as key business pillar  invests in U.S. start-up "
    },
    {
        "content": "* Sony: sees fy2016/17 devices unit operating loss of 40 billion yen ($366 million) versus 29.2 billion yen loss last fy",
        "date": "05242016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony sees device unit operating loss of 40 bln yen this FY "
    },
    {
        "content": "* sony: to announce fy2016/17 earnings forecasts on may 24  Source text for Eikon:  Further company coverage:",
        "date": "05132016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-sony to announce fy2016/17 earnings forecasts on may 24 "
    },
    {
        "content": "TOKYO Japan's Sony Corp  on Thursday reported an annual loss in its image sensors business  raising fears the firm's revival of recent years may be losing momentum  even though cost cuts helped it book its biggest operating profit in eight years.",
        "date": "04282016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony's sensor business slows even as cost cuts lift profit "
    },
    {
        "content": "* Panasonic sees weaker profit ahead   (Adds Sony's estimate on damage from quakes)",
        "date": "04282016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 3-Sony's sensor business slows even as cost cuts lift profit "
    },
    {
        "content": "* Japanese earthquake in mid April caused damages on supplier Sony's sensor manufacturing plant.",
        "date": "04282016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Axis says supplier affected by Japanese earthquake  could have effect on sales "
    },
    {
        "content": "TOKYO  April 28 Japanese electronics maker Sony Corp on Thursday reported its biggest annual operating profit since fiscal 2007  due to restructuring its struggling smartphone business and brisk demand for PlayStation 4 videogames.",
        "date": "04282016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony logs biggest FY profit in 8 years on restructuring  games "
    },
    {
        "content": "TOKYO  April 22 Japanese electronics giant Sony Corp said on Friday it would delay announcing earnings forecasts for this business year as it continues to assess the impact of the powerful earthquakes that have halted its image sensor plant in southern Japan.",
        "date": "04222016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony to delay announcing earnings forecasts to assess quake damage "
    },
    {
        "content": "BRUSSELS  April 21 - Warner Music Group and independent labels have urged EU regulators to fight Sony Corp's  bid to buy out Michael Jackson's stake in its music publishing joint venture  saying the move gives Sony too much power.",
        "date": "04212016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Warner Music Group  indies want EU to be tough on Sony's Michael Jackson deal "
    },
    {
        "content": "TOKYO Japanese electronics firm Sony Corp  cut its profit estimate by 9.4 percent for the financial year that ended in March  as slowing global smartphone sales dented demand for its camera modules.",
        "date": "04212016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony cuts FY 2015 profit estimate by 9.4 percent on weaker smartphone demand "
    },
    {
        "content": "TOKYO  April 17 Electronics giant Sony Corp  on Sunday said production at its image sensor plant in Kumamoto  southern Japan  remained suspended as it assessed damage from a powerful earthquake.",
        "date": "04172016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony extending closure of image sensor plant in quake-hit southern Japan "
    },
    {
        "content": "TOKYO  April 16 Electronics giant Sony Corp  said a factory producing image sensors for smartphone makers will remain closed while it assesses the damage from two deadly earthquakes which hit southern Japan. One of its major customers is Apple  which uses the sensors in its iPhones.",
        "date": "04162016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "UPDATE 2-Japan quakes disrupt Sony production of image sensors used in Apple iPhones "
    },
    {
        "content": "* Books 59.6 bln yen impairment loss on camera module business",
        "date": "04212016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony cuts FY 2015 profit estimate by 9.4 pct on weaker smartphone demand "
    },
    {
        "content": "TOKYO  April 21 Japanese electronics firm Sony Corp cut its profit estimate for the financial year that ended in March  citing  weaker demand for its camera modules used in smartphones.",
        "date": "04212016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony cuts FY2015 profit estimate on weaker camera modules demand "
    },
    {
        "content": "* Sony and jackson estate sign definitive agreement for sony to acquire remaining half of sony/atv music publishing",
        "date": "04182016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony  Jackson Estate sign definitive agreement for Sony to acquire remaining half of SONY/ATV music publishing "
    },
    {
        "content": "TOKYO Manufacturers including Honda Motor  and Sony Corp  halted production at plants in southwestern Japan on Friday to inspect for any damage from the previous night's earthquake. No major damage was reported.",
        "date": "04152016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Quake stalls manufacturing in southern Japan; no major damage reported "
    },
    {
        "content": "TOKYO Sony Corp  said on Monday that its image sensor plant in Kumamoto  which has been shut since earthquakes hit southern Japan last week  makes components mainly for digital cameras.",
        "date": "04182016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony says Kumamoto plant not main site for smartphone components "
    },
    {
        "content": "TOKYO  April 18 Sony Corp said on Monday that its image sensor plant in Kumamoto  which has been shut since earthquakes hit southern Japan last week  makes components mainly for digital cameras.",
        "date": "04182016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony says Kumamoto plant not main site for smartphone components "
    },
    {
        "content": "TOKYO  April 18 Japanese electronics giant Sony Corp said on Monday that its image sensor plant in Kumamoto  which has been offline since deadly earthquakes hit southern Japan  produces mainly for digital cameras  rather than smartphones as investors have feared.",
        "date": "04182016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony says Nagasaki  not suspended Kumamoto plant  makes smartphone sensors "
    },
    {
        "content": "Calling its newest arguments \"nonsense \" a federal judge in Manhattan refused to revive a New York music publisher's case against Sony Corp over claims that a hit song by pop star Shakira was an illegal copy of a Dominican songwriter's work.",
        "date": "04022016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "U.S. judge refuses to revive Shakira copyright case  levies sanctions "
    },
    {
        "content": "* This NFC Patent License Program offers NFC patents from both INSIDE Secure and Orange  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "04042016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Inside Secure: France Brevets licenses NFC patents to Sony "
    },
    {
        "content": "* Sony Corp : appoints 4 additional executive vice presidents under new management structure",
        "date": "03252016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony appoints 4 additional executive VPs under new management structure "
    },
    {
        "content": "SAN FRANCISCO  March 15 Sony Corp  announced on Tuesday that its virtual reality headset for PlayStation will launch globally in October for $399  a move that undercuts its biggest competitor by hundreds of dollars.",
        "date": "03152016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony PlayStation VR to launch globally in October  cost $399 "
    },
    {
        "content": "SAN FRANCISCO  March 15 Sony Corp on Tuesday announced its PlayStation virtual reality headset will launch globally for $399 in October this year.",
        "date": "03152016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony PlayStation VR to launch globally in Oct  cost $399 "
    },
    {
        "content": "March 15 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "03152016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "March 14 Sony Corp said it signed an agreement with Michael Jackson's estate to buy for $750 million the deceased pop star's stake in Sony/ATV Music Publishing  the world's largest music publisher which controls songs such as The Beatles' \"All You Need Is Love.\"",
        "date": "03152016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to buy Michael Jackson's stake in music publishing unit "
    },
    {
        "content": "SAN FRANCISCO  Feb 25 Hackers have been destroying more corporate data or encrypting it for ransom instead of merely stealing it  a top cyber security firm said.",
        "date": "02252016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Destructive hacking attacks spread in wake of breaches at Sony and Sands "
    },
    {
        "content": "With virtual reality (VR) on course to become a $1 billion global business  the launch of the eagerly-awaited HTC Vive VR headset has been one of the highlights of this year's Mobile World Congress (MWC) in Barcelona. | Video ",
        "date": "02252016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Virtual reality takes center stage at MWC "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL  February 05 (Fitch) Fitch Ratings has upgraded Sony Corporation's (Sony)  Long-Term Foreign- and Local-Currency Issuer Default Ratings (IDR) and  local-currency senior unsecured ratings to 'BB' from 'BB-'. The Outlook is  Stable. Simultaneously  its Short-Term Foreign- and Local-Currency IDRs are  affirmed at 'B'. A full list of rating actions is at the end of this release. The upgrade reflects Fitch's expectations of improved pr",
        "date": "02052016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Fitch Upgrades Sony to 'BB'; Outlook Stable "
    },
    {
        "content": "TOKYO Sony Corp   widely regarded as a key supplier of image sensors for Apple Inc's  iPhones  said on Friday it was bracing for a slowdown in the premium smartphone market after sales of its sensors fell in the third quarter.",
        "date": "01292016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony says bracing for smartphone slowdown after sensor sales dip "
    },
    {
        "content": "TOKYO  Jan 27 U.S. buyout funds KKR & Co  and Bain Capital  as well as Fujifilm Holdings Corp  are among potential bidders for a medical equipment unit of financially troubled Toshiba Corp in a deal that could fetch more than $3 billion  people familiar with the process said on Wednesday.",
        "date": "01272016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "KKR  Bain  Fujifilm to bid for Japan's Toshiba Medical-sources "
    },
    {
        "content": "* Keeps outlook for annual op profit at 320 bln yen   (Adds raised outlook for game division)",
        "date": "01292016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 3-Sony says bracing for smartphone slowdown after sensor sales dip "
    },
    {
        "content": "TOKYO Sony Corp  said it will buy Israeli chipmaker Altair Semiconductor for $212 million  stepping up its investment in chip technology after strong sales of camera sensors in the last few years helped turn around the business.",
        "date": "01262016",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony says to buy Israel's Altair Semiconductor for $212 million "
    },
    {
        "content": "TOKYO  Jan 29 Sony Corp  widely regarded as a key supplier of image sensors for Apple Inc's  iPhones  said on Friday it was bracing for a slowdown in the premium smartphone market after sales of its sensors fell in the third quarter.",
        "date": "01292016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "CORRECTED-(OFFICIAL)-Sony says bracing for smartphone slowdown after sensor sales dip "
    },
    {
        "content": "TOKYO  Jan 29 Sony Corp reported an 11 percent rise in quarterly operating profit on Friday as strong sales of PlayStation 4 games helped offset a decline in sales of image sensors  which had led the company's turnaround in the previous year.",
        "date": "01292016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony quarterly operating profit rises 11 pct  beats analyst estimates "
    },
    {
        "content": "TOKYO  Jan 22 Japan Display Inc said it will begin mass production of organic light emitting diode (OLED) panels in 2018  aiming to catch up with Korean rivals amid speculation Apple Inc may adopt such screens for its iPhones soon.",
        "date": "01222016",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Japan Display to produce OLED smartphone panels from 2018 "
    },
    {
        "content": "PARIS/BERLIN  Dec 8 Kellogg  Sony   Coca-Cola Enterprises and a group of other companies have committed to targets certified by independent assessors to cut their carbon emissions  they said on Tuesday.",
        "date": "12082015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Kellogg  Sony and others sign up to emissions goals "
    },
    {
        "content": "Dec 3 Japanese electronic companies Toshiba Corp   Fujitsu Ltd and Sony Corp spinoff Vaio are mulling a combination of their PC operations  according to a Nikkei report.",
        "date": "12032015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Toshiba  Fujitsu and Vaio mulling PC units merger - Nikkei "
    },
    {
        "content": "Georgia Southern running back Matt Breida rushed for 187 yards and two touchdowns  leading the Eagles to a 55-17 win over visiting South Alabama on Saturday.",
        "date": "11282015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Georgia Southern 55  South Alabama 17 "
    },
    {
        "content": "Sony Michel scored on a 25-yard run in overtime  helping Georgia survive a stern test from Georgia Southern in a 23-17 victory on Saturday at Samford Stadium in Athens  Georgia.",
        "date": "11222015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Georgia 23  Georgia Southern 17 (OT) "
    },
    {
        "content": "TOKYO  Nov 25 Sony Corp on Wednesday said sales of its PlayStation 4 video game console exceeded 30.2 million units as of Nov. 22  as global price cuts ahead of the year-end holiday season bolstered demand.",
        "date": "11252015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony's PlayStation 4 sales top 30 million consoles "
    },
    {
        "content": "Georgia State couldn't hold a fourth-quarter lead for the second straight week and lost to Louisiana-Lafayette 23-21 Saturday in Sun Belt Conference play at the Georgia Dome.",
        "date": "11072015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Louisiana-Lafayette 23  Georgia State 21 "
    },
    {
        "content": "* No tie-up discussions  but wouldn't say no -Japan Display CEO",
        "date": "11092015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Japan Display says wouldn't turn down a partnership with Sharp "
    },
    {
        "content": "The dispute over whether a hit song by pop star Shakira was an illegal copy of a Dominican songwriter's work has taken another dramatic turn now that the music company behind the lawsuit says its former attorney has a \"deteriorating\" medical condition and failed to represent it properly.",
        "date": "11052015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Lawyer's 'medical issue' doomed Shakira copyright case  Mayimba Music says "
    },
    {
        "content": "BANGKOK  Nov 5 Japan's Sony Corp aims to make 600 000 to 700 000 premium smartphones in the first year at its new wholly-owned plant in Thailand which began production in September  a spokesman said.",
        "date": "11052015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony starts making premium smartphones in Thailand  in quest for profits "
    },
    {
        "content": "TOKYO Sony Corp swung to a second-quarter operating profit as strong PlayStation 4 videogame sales helped to offset a fall in smartphone sales and keep the company on a recovery track after years of decline in its consumer electronics business.",
        "date": "10292015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "PlayStation 4 sales help Sony swing to Q2 operating profit "
    },
    {
        "content": "* Strong PlayStation 4 software & sensors sales offset weak mobile   (Adds CFO comments from conference and details of results)",
        "date": "10292015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-PlayStation 4 sales help Sony swing to Q2 operating profit "
    },
    {
        "content": "TOKYO  Oct 27 Third Point has bought a stake in retailer Seven & I Holdings  sources with knowledge of the matter said on Tuesday  the latest investment in Japan for the U.S. hedge fund run by billionaire investor Daniel Loeb.",
        "date": "10272015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Third Point buys stake in Japan's Seven & I - sources "
    },
    {
        "content": "TOKYO  Oct 27 U.S. hedge fund Third Point has bought a stake in Seven & I Holdings and wants the Japanese retailer to downsize its general merchandise business to improve profitability  sources with knowledge of the matter said.",
        "date": "10262015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Third Point buys stake in Japan's Seven & I - sources "
    },
    {
        "content": "TOKYO Toshiba Corp is set to sell its image sensor business to Sony Corp for around 20 billion yen ($164.68 million) as part of a restructuring plan laid out earlier this year  sources with knowledge of the deal said on Saturday.",
        "date": "10242015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Toshiba to sell sensor business to Sony for around $165 million: sources "
    },
    {
        "content": "TOKYO  Oct 29 Sony Corp swung on Thursday to a quarterly operating profit as strong videogame sales helped to offset a fall in smartphone sales and as the year-ago quarter had seen a big impairment charge.",
        "date": "10292015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony videogame sales help it swing to Q2 operating profit "
    },
    {
        "content": "TOKYO  Oct 24 Toshiba Corp is set to sell its image sensor business to Sony Corp for around 20 billion yen ($164.68 million) as part of a restructuring plan laid out earlier this year  sources with knowledge of the deal said on Saturday.",
        "date": "10242015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Toshiba to sell sensor business to Sony for around $165 mln-sources "
    },
    {
        "content": "TOKYO Japan's Toshiba Corp said on Wednesday it will sell its image sensor business to Sony Corp and overhaul its unprofitable semiconductor businesses as it works to recover from a $1.3 billion accounting scandal.",
        "date": "10282015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Toshiba to sell sensor business to Sony  overhaul chip unit "
    },
    {
        "content": "Toshiba Corp is nearing a deal to sell its image sensor business to Sony Corp as part of a restructuring plan laid out by Chief Executive Masashi Muromachi earlier this year  the Nikkei reported on Friday.",
        "date": "10232015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Toshiba to sell image sensor business to Sony: Nikkei "
    },
    {
        "content": "* Deal with Sony worth around Y20 bln -Toshiba source   (Adds value of sensor deal  background)",
        "date": "10282015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Toshiba to sell sensor business to Sony  overhaul chip unit "
    },
    {
        "content": "TOKYO/DETROIT Asia's two autos powerhouses  Japan and China  are jostling for supremacy in how future electric cars should generate their power – from batteries or hydrogen-powered fuel-cells.",
        "date": "10282015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Auto power play: Japan's hydrogen car vs China's battery drive "
    },
    {
        "content": "Oct 23 Toshiba Corp is nearing a deal to sell its image sensor business to Sony Corp as part of a restructuring plan laid out by Chief Executive Masashi Muromachi earlier this year  the Nikkei reported on Friday.",
        "date": "10232015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Toshiba to sell image sensor business to Sony - Nikkei "
    },
    {
        "content": "TOKYO  Oct 28 Toshiba Corp said on Wednesday that it would sell its image sensor business to Sony Corp and overhaul its  unprofitable semiconductor businesses as it tries to recover from a $1.3 billion accounting scandal.",
        "date": "10282015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Toshiba says to sell sensor business to Sony  overhaul chip unit "
    },
    {
        "content": "* Has signed an agreement with Sony to further expand time-of-flight offering for automobile safety and infotainment markets",
        "date": "10082015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Melexis signs agreement with Sony to expand time-of-flight offering "
    },
    {
        "content": "TOKYO  Oct 8 Japan's Sony Corp said it bought Belgian image sensor technology company Softkinetic Systems for an undisclosed sum  stepping up investment in an area that has become one of its strongest amid weak sales of its TVs and smartphones.",
        "date": "10082015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony buys Belgian image sensor technology firm "
    },
    {
        "content": "Sony Corp  is proceeding with a plan to sell its half of Sony/ATV Music Publishing  the world's largest music publisher  the Wall Street Journal reported.",
        "date": "10082015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony proceeds with plan to sell music publishing unit: WSJ "
    },
    {
        "content": "TOKYO  Oct 6 Japan's Sony Corp said it will split off its semiconductors operations to bolster growth in devices such as image sensors  which have emerged as the company's strongest products in recent years.",
        "date": "10062015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to split off fast-growing image sensor business "
    },
    {
        "content": "* Company eyes expansion of sensors into autos   (Adds details on sensors business)",
        "date": "10062015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony to split off fast-growing image sensor business "
    },
    {
        "content": "Sony Corp is proceeding with a plan to sell its half of Sony/ATV Music Publishing  the world's largest music publisher  the Wall Street Journal reported.",
        "date": "10072015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony proceeds with plan to sell music publishing unit: WSJ "
    },
    {
        "content": "Oct 7 Sony Corp is proceeding with a plan to sell its half of Sony/ATV Music Publishing  the world's largest music publisher  the Wall Street Journal reported.",
        "date": "10072015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony proceeds with plan to sell music publishing unit - WSJ "
    },
    {
        "content": "Oct 7 Sony Corp is proceeding with a plan to sell its half of Sony/ATV Music Publishing  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "10072015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony proceeds with plan to sell music publishing unit - WSJ "
    },
    {
        "content": "TOKYO Sony Corp's  chief executive flagged next year as a make-or-break year for its struggling smartphones  saying it could consider other options for the business if it failed to turn profitable.",
        "date": "10072015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony may consider options for smartphone business if no profit next year "
    },
    {
        "content": "* But smartphone business has been slow to turn around   (Adds SONY comment)",
        "date": "10072015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony may consider options for smartphone business if no profit next year "
    },
    {
        "content": "MUMBAI Sports fans in the Indian subcontinent will be spoilt for choice after Indian Premier League (IPL) rights holder Multi Screen Media (MSM) and sports broadcaster ESPN announced plans on Wednesday to launch new channels and foray into digital market.",
        "date": "10072015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "ESPN joins hands with India's MSM to launch channels "
    },
    {
        "content": "MUMBAI  Oct 7 Sports fans in the Indian subcontinent will be spoilt for choice after Indian Premier League (IPL) rights holder Multi Screen Media (MSM) and sports broadcaster ESPN announced plans on Wednesday to launch new channels and foray into digital market.",
        "date": "10072015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sports-ESPN joins hands with India's MSM to launch channels "
    },
    {
        "content": "TOKYO  Oct 7 Sony Corp Chief Executive Kazuo Hirai said on Wednesday the company would consider options for its smartphone unit if it failed to turn a profit in the next business year.",
        "date": "10072015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony may consider options for smartphone unit if no profit next year "
    },
    {
        "content": "* Technicolor and Sony Corp form joint patent licensing program for digital television and computer display monitor",
        "date": "09142015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Technicolor and Sony form joint patent licensing program "
    },
    {
        "content": "TOKYO China's strict censorship rules are limiting Sony Corp's sales of PlayStation 4 in the country even after a ban on foreign gaming consoles was lifted last year  the head of the Japanese company's gaming division said.",
        "date": "09172015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony says China sales of PlayStation 4 limited by censorship rules "
    },
    {
        "content": "* PlayStation 4 start in China no \"rocket launch\"-Sony gaming head",
        "date": "09172015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony says China sales of PlayStation 4 limited by censorship rules "
    },
    {
        "content": "TOKYO  Sept 17 The head of Sony Corp's  gaming division said sales of PlayStation 4 in China were challenged by strict censorship rules  showing the country remained a tough market even after it ended a ban on foreign gaming consoles last year.",
        "date": "09172015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony says China sales of PlayStation 4 challenged by censorship "
    },
    {
        "content": "Sept 15 Sony Corp and Olympus Corp  said they plan to unveil an ultra high-definition surgical endoscope this week  the first major product from a joint venture formed three years ago.",
        "date": "09152015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony  Olympus to unveil high-definition endoscope "
    },
    {
        "content": "LOS ANGELES (Variety.com) - Sony's faith-based drama \"War Room\" has the edge on N.W.A biopic \"Straight Outta Compton\" with $9.3 million to lead the modest U.S. box office over the Friday-Sunday weekend. | Video ",
        "date": "09062015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "'War Room' edging 'Straight Outta Compton' over slow weekend "
    },
    {
        "content": "LOS ANGELES  Sept. 6 (Variety.com) - Sony's faith-based drama \"War Room\" has the edge on N.W.A biopic \"Straight Outta Compton\" with $9.3 million to lead the modest U.S. box office over the Friday-Sunday weekend.",
        "date": "09062015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Box Office: 'War Room' Edging 'Straight Outta Compton' Over Slow Weekend "
    },
    {
        "content": "LOS ANGELES  Sept. 6 (Variety.com) - Sony's faith-based drama \"War Room\" has the edge on N.W.A biopic \"Straight Outta Compton\" with $9.3 million to lead the modest U.S. box office over the Friday-Sunday weekend.",
        "date": "09062015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Box Office: 'War Room' Edging 'Straight Outta Compton' Over Slow Weekend "
    },
    {
        "content": "* Any talks with Sharp would happen suddenly - CEO   (Adds quotes on Sharp merger speculation  shares  background)",
        "date": "09032015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Japan Display CEO hints at strong Apple orders ahead of new iPhone launch "
    },
    {
        "content": "TOKYO  Sept 3 Japan Display Inc Chief Executive Mitsuru Homma on Thursday said the screen maker's \"biggest client\"  widely understood to refer to Apple Inc   is increasing orders ahead of the expected launch of a new iPhone this month.",
        "date": "09032015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Japan Display CEO hints at strong Apple orders ahead of new iPhone launch "
    },
    {
        "content": "An Italian floormaker's lawsuit involving Sony's popular Gran Turismo car racing video games has been narrowed by a California federal judge who said Sony's use of the company's trademark is artistic and protected by the First Amendment.",
        "date": "08242015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Judge narrows lawsuit over Sony's Gran Turismo video games "
    },
    {
        "content": "TOKYO Sony Corp reported its highest first-quarter profit since 2007 on Thursday due to strong sales of camera sensors and PlayStation 4 videogames  beating analyst estimates and helping to reassure investors a recent stock offering would pay off.",
        "date": "07302015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony books highest first-quarter profit since 2007 on strong sensor sales "
    },
    {
        "content": "TOKYO  July 30 Sony Corp reported its highest first-quarter profit since 2007 on Thursday due to strong sales of camera sensors and PlayStation 4 videogames  beating analyst estimates and helping to reassure investors a recent stock offering would pay off.",
        "date": "07302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "CORRECTED-(OFFICIAL)-Sony books highest Q1 profit since 2007 on strong sensor sales "
    },
    {
        "content": "TOKYO  July 30 Sony Corp on Thursday reported a 39 percent rise in first-quarter profit  beating analyst estimates  helped by strong sales of smartphone camera sensors and PlayStation4 videogames.",
        "date": "07302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony Q1 operating profit rises 39 percent  beats estimates "
    },
    {
        "content": "TOKYO Sony Corp  set a price of 3 420.5 yen per share for its first new-share offering in 26 years  a move aimed at beefing up its profitable image sensors business.",
        "date": "07132015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony prices new shares at three percent discount  CBs at 42 percent premium "
    },
    {
        "content": "* Funds to help pay for sensor production expansion   (Adds convertible bonds pricing)",
        "date": "07132015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony prices new shares at 3 pct discount  CBs at 42 pct premium "
    },
    {
        "content": "TOKYO  July 13 Sony Corp set a price of 3 420.5 yen per share for its first new-share offering in 26 years  a move aimed at beefing up its image sensors business as it reinvents itself as a niche component maker.",
        "date": "07132015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony prices new shares at 3 420.5 yen  3 pct discount "
    },
    {
        "content": "TOKYO Sony Corp CEO Kazuo Hirai was re-elected with 88 percent support of shareholders at an annual general meeting earlier this week  the company said  showing investors maintained their confidence in him despite low return on equity (ROE).",
        "date": "06262015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony CEO re-elected to board with 88 percent vote after turnaround "
    },
    {
        "content": "TOKYO  June 26 Sony Corp CEO Kazuo Hirai was re-elected with 88 percent support of shareholders at an annual general meeting earlier this week  the company said  showing investors maintained their confidence in him despite low return on equity (ROE).",
        "date": "06262015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony CEO re-elected to board with 88 pct vote after turnaround "
    },
    {
        "content": "TOKYO Japan's Sony Corp plans to raise nearly $4 billion via new shares and bonds to plough into image sensors as it reinvents itself as a niche component maker  pulling back from consumer goods like TVs that dragged it into losses.",
        "date": "06302015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony to raise nearly $4 billion  ramp up sensors business to anchor turnaround "
    },
    {
        "content": "* New-look Sony's clearest statement of intent so far   (Adds company comment  details on sensors)",
        "date": "06302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony to raise nearly $4 bln  ramp up sensors business to anchor turnaround "
    },
    {
        "content": "TOKYO  June 30 Japan's Nikkei share average rebounded on Tuesday after posting its second-biggest daily drop this year in the previous session  but the market remained cautious over developments in Greece  while Sony Corp tumbled after it announced a fundraising plan.      The Nikkei share average ended 0.6 percent higher at 20 235.73.     The broader Topix gained 0.3 percent to 1 630.40 and the JPX-Nikkei Index 400 rose 0.4 percent to 14 716.19.     Sony said it planned to raise up ",
        "date": "06302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Nikkei rebounds amid caution on Greece; Sony dives on fundraising plan "
    },
    {
        "content": "* Sony says to raise up to 321.5 billion yen ($2.6 billion)from new share issue",
        "date": "06302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony announces plan to issue new shares  convertible bonds "
    },
    {
        "content": "TOKYO  June 30 Sony Corp plans to raise up to 400 billion yen via the issuance of new shares and convertible bonds  the Nikkei business daily reported on Tuesday.",
        "date": "06302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to raise up to 400 bln yen via public offering -Nikkei "
    },
    {
        "content": "TOKYO Japan's once-mighty electronics makers have lost billions of dollars from TVs but Sony Corp and Panasonic Corp won't quit  saying retreating from the world's living rooms would close the door to more promising businesses.",
        "date": "06192015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony  Panasonic cling to TVs  betting on halo effect of premium sets "
    },
    {
        "content": "LOS ANGELES Virtual reality gaming  once a distant concept  became the new battleground at this year's E3 industry convention  with developers seeking to win over fans with their immersive headsets and accessories. | Video ",
        "date": "06172015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Virtual reality dominates floor at E3 gaming show "
    },
    {
        "content": "TOKYO  June 19 Japan's once-mighty electronics makers have lost billions of dollars from TVs but Sony Corp  and Panasonic Corp won't quit  saying retreating from the world's living rooms would close the door to more promising businesses.",
        "date": "06182015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony  Panasonic cling to TVs  betting on halo effect of premium sets "
    },
    {
        "content": "NEW YORK Apple Inc will announce its new music streaming service on Monday  according to remarks by the chief executive of Sony Music  Doug Morris  VentureBeat reported on Sunday.",
        "date": "06072015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony Music CEO confirms launch of Apple's music streaming Monday: VentureBeat "
    },
    {
        "content": "TOKYO Sony Corp aims to diversify its client base for image sensors beyond top customer Apple Inc  even as it expects orders from the iPhone maker to help lift sales about 20 percent this fiscal year  a senior executive said on Tuesday.",
        "date": "06092015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony aims for more clients  20 percent sales growth in image sensors "
    },
    {
        "content": "* Head of sensors says unit's now-prominent role \"unexpected\"   (Adds further executive comments  context)",
        "date": "06092015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony aims for more clients  20 pct sales growth in image sensors "
    },
    {
        "content": "TOKYO  June 10 Proxy investment adviser ISS advised shareholder to vote against reelecting the heads of Japanese electronics firms Sharp Corp and Sony Corp   both mid-restructuring  saying they are falling short of ISS return-on-equity (ROE) benchmarks.",
        "date": "06102015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Proxy adviser ISS recommends investors vote against Sharp  Sony CEOs at AGMs "
    },
    {
        "content": "TOKYO  June 9 Sony Corp expects sales of its image sensors to increase by 100 billion yen ($804 million) to around 550 billion yen in the current business year through next March due to strong demand from Apple Inc  and other high-end smartphone makers  a senior executive said on Tuesday.",
        "date": "06092015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony expects image sensor sales to grow around 20 pct this year "
    },
    {
        "content": "June 10 Proxy adviser Institutional Shareholder Services Inc (ISS):",
        "date": "06102015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Proxy adviser ISS says recommends vote against reelection of Sony CEO Hirai "
    },
    {
        "content": "TOKYO  June 1 An influential former Sony Corp  executive on Monday urged current Chief Executive Kazuo Hirai to focus on innovation than just restructuring in a letter criticising the Japanese firm's management ahead of a shareholder meeting this month.",
        "date": "06012015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Ex-Sony executive criticised CEO Hirai of ahead shareholder meet "
    },
    {
        "content": "TOKYO A Sony Corp executive in charge of its TV business said it would raise prices to absorb the impact of a strengthening dollar to ensure profitability at the unit  considered one of the weaker parts of the electronics and entertainment conglomerate.",
        "date": "05282015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony TV executive says to raise prices to cope with dollar strength "
    },
    {
        "content": "TOKYO  May 28 A Sony Corp executive in charge of its TV business said it would raise prices to absorb the impact of a strengthening dollar to ensure profitability at the unit  considered one of the weaker parts of the electronics and entertainment conglomerate.",
        "date": "05282015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony TV exec says to raise prices to cope with dollar strength "
    },
    {
        "content": "TOKYO  May 27 The head of Sony Corp's  loss-making mobile telecoms unit plans to tweak handset prices and cut costs if need be to absorb the dollar's sharp rise versus the yen  citing currency shifts as a bigger potential threat to the Japanese electronics maker's efforts to turn the business around than competition.",
        "date": "05272015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony mobile exec: pricing tweaks  cost cuts to cope with dollar's rise "
    },
    {
        "content": "TOKYO  May 27 The head of Japanese electronics maker Sony Corp's mobile business said on Wednesday he plans to deal with the effects of a stronger dollar versus the yen by tweaking the pricing of its handsets and by cutting costs.",
        "date": "05272015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony mobile exec: pricing tweaks  cost cuts to cope with dollar's rise "
    },
    {
        "content": "* Raises prices on camera-related goods  media devices by 5-20 percent in Japan",
        "date": "05112015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-Sony lifts prices on camera-related goods by 5-20 pct in Japan "
    },
    {
        "content": "MENLO PARK  Calif.  April 30 In the 1980s when Sony and Toshiba were setting the agenda in the global TV and memory chip markets Japan was bristling with confidence as a hub of technological innovation.",
        "date": "05012015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "REFILE-UPDATE 1-Abe  seeking new spark for Japan high-tech  meets Silicon Valley chiefs "
    },
    {
        "content": "TOKYO  April 24 A group of former top Sony Corp  executives has delivered an unusually blunt critique to the firm's chief executive Kazuo Hirai  accusing him of losing sight of innovation by focusing on cost-cutting.",
        "date": "04262015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "RPT-Sony's Hirai faces attack from activist \"old boys\" -sources "
    },
    {
        "content": "TOKYO Japanese consumer electronics maker Sony Corp expects operating profit to more than quadruple this year  as strong sales of camera sensors and cost cuts anchor a long-awaited turnaround after years of losses on TVs and mobile phones.",
        "date": "04302015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Resurgent Sony sees profit leaping on camera sensor sales  cost cuts "
    },
    {
        "content": "TOKYO  April 30 Japanese consumer electronics maker Sony Corp expects operating profit to more than quadruple this year  as strong sales of camera sensors and cost cuts anchor a long-awaited turnaround after years of losses on TVs and mobile phones.",
        "date": "04302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Resurgent Sony sees profit leaping on camera sensor sales  cost cuts "
    },
    {
        "content": "April 30 Sony Corp Chief Financial Officer Kenichiro Yoshida says:",
        "date": "04302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony CFO says wants to avoid past habit of lowering outlook "
    },
    {
        "content": "TOKYO Japanese consumer electronics firm Sony Corp  has raised its operating profit estimate for fiscal 2015 to 300 billion yen ($2.52 billion)  or four times its previous estimate  the Nikkei reported on Saturday.",
        "date": "04252015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony raises FY 2015 profit forecast to $2.5 billion: Nikkei "
    },
    {
        "content": "TOKYO  April 30 Japanese consumer electronics maker Sony Corp said it expects operating profit to more than quadruple this fiscal year  boosted by strong sales of camera sensors and cost cuts in its ailing mobile phone business.",
        "date": "04302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony sees FY profit surging on camera sensor sales  cost cuts "
    },
    {
        "content": "* Sony Corp says it expects to sell 30 million smartphones in fy 2015/16 versus 39.1 million in fy 2014/15",
        "date": "04302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony smartphone  PlayStation unit forecasts for FY2015/16 "
    },
    {
        "content": "TOKYO  April 25 Japanese consumer electronics firm Sony Corp has raised its operating profit estimate for fiscal 2015 to 300 billion yen ($2.52 billion)  or four times its previous estimate  the Nikkei reported on Saturday.",
        "date": "04252015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony raises FY 2015 profit forecast to 300 bln yen-Nikkei "
    },
    {
        "content": "Apr 30 (Reuters)-            Sony Corp            PARENT-ONLY FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                    Year ended      Year ended       Year to       NEXT                    Mar 31  2015    Mar 31  2014   Mar 31  2016     YEAR                         LATEST         YEAR-AGO        COMPANY      COMPANY                       RESULTS         RESULTS       FORECAST    H1 FORECAST    Sales           2.07 trln       2.19 trln                                  ",
        "date": "04302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "TABLE-Sony -2014/15 parent results "
    },
    {
        "content": "TOKYO A group of former top Sony Corp executives has delivered an unusually blunt critique to the firm's chief executive Kazuo Hirai  accusing him of losing sight of innovation by focusing on cost-cutting.",
        "date": "04242015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony's Hirai faces attack from activist 'old boys': sources "
    },
    {
        "content": "Apr 30 (Reuters)-            Sony Corp            CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                    Year ended       Year ended       Year to        NEXT                  Mar 31  2015     Mar 31  2014   Mar 31  2016      YEAR                       LATEST          YEAR-AGO        COMPANY      COMPANY                     RESULTS           RESULT        FORECAST    H1 FORECAST    Sales         8.22 trln        7.77 trln       7.90 trln                 ",
        "date": "04302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "TABLE-Sony -2014/15 group results (SEC) "
    },
    {
        "content": "WASHINGTON/TOKYO  April 30 In the 1980s when Sony and Toshiba were setting the agenda in the global TV and memory chip markets Japan was bristling with confidence as a hub of technological innovation.",
        "date": "04302015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Abe  seeking new spark for Japan high-tech  heads to Silicon Valley "
    },
    {
        "content": "TOKYO  April 24 A group of former top Sony Corp  executives has delivered an unusually blunt critique to the firm's chief executive Kazuo Hirai  accusing him of losing sight of innovation by focusing on cost-cutting.",
        "date": "04242015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony's Hirai faces attack from activist \"old boys\" -sources "
    },
    {
        "content": "TOKYO  April 20 Sony Corp on Monday unveiled a new high-end Xperia handset featuring an aluminium frame and a 5.2-inch screen  showing it is still in the smartphone race even as it scales down its mobile operations.",
        "date": "04202015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony unveils new Xperia phone even as it retrenches in mobile "
    },
    {
        "content": "TOKYO Japanese consumer electronics firm Sony Corp  raised its earnings estimates for the second time in three months on Wednesday  citing higher than expected sales of video games and digital cameras.",
        "date": "04222015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony raises profit view as videogame sales herald turnaround "
    },
    {
        "content": "TOKYO  April 20 Sony Corp on Monday unveiled a new high-end Xperia handset featuring an aluminium frame and a 5.2-inch screen  showing it is still in the smartphone race even as it scales down its struggling mobile operations.",
        "date": "04202015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony unveils new Xperia phone even as it retrenches in mobile "
    },
    {
        "content": "TOKYO  April 22 Japanese consumer electronics firm Sony Corp raised its earnings estimates for the second time in three months on Wednesday  citing higher than expected sales of video games and digital cameras.",
        "date": "04222015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony raises profit view as videogame sales herald turnaround "
    },
    {
        "content": "TOKYO  April 22 Japanese consumer electronics maker Sony Corp on Wednesday raised its earnings estimates for the fiscal year that ended in March  citing higher-than-expected sales of camera sensors and videogames.",
        "date": "04222015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony raises full-year profit view on strength in sensors  videogames "
    },
    {
        "content": "Apr 22 (Reuters) -               Sony Corp                    CONSOLIDATED EARNINGS ESTIMATES   (in billions of yen unless specified)                                          Full Year to      Full Year to                     Mar 31  2015      Mar 31  2015                          LATEST           PREVIOUS                           FORECAST          FORECAST        Sales&Rev      8.21 trln         8.00 trln       Operating            68.00             20.00         PreTax               39.00",
        "date": "04222015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "TABLE-Sony -2014/15 group forecast(SEC) "
    },
    {
        "content": "LOS ANGELES  April 16 Sony Corp's Sony Pictures Entertainment objected to the online release by WikiLeaks on Thursday of more than 30 000 documents that were obtained by hackers in a massive cyber attack last year.",
        "date": "04162015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony Pictures condemns Wikileaks release of documents from hackers "
    },
    {
        "content": "* SES teams with Harmonic  Sony  Telvue  Pacsat And Superior to deliver first live and linear ultra HD broadcast to a cable system  Source text: http://bit.ly/1DaLn05 Further company coverage:    (Gdynia Newsroom)",
        "date": "04132015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "BRIEF-SES teams with Harmonic  Sony  Telvue  Pacsat and Superior "
    },
    {
        "content": "LOS ANGELES  April 16 Sony Corp's Sony Pictures Entertainment objected to the online release by WikiLeaks on Thursday of a searchable database of more than 30 000 documents that were obtained by hackers in a massive cyber attack last year.",
        "date": "04162015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony Pictures condemns Wikileaks release of documents from hackers "
    },
    {
        "content": "TOKYO  April 7 Sony Corp said it would spend an extra 45 billion yen  ($376 million) in the fiscal year that started this month to further boost output of imaging sensors  increasing its focus on a business that has become one of its strongest as its TV and mobile operations struggle.",
        "date": "04072015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to further boost production of imaging sensors "
    },
    {
        "content": "* BOJ bought ETFs worth 35.2 bln yen on Wednesday     * Olympus dives to near 1-month low after Sony halves stake     * Mobile application providers jump after Nikkei says Line files 2nd time to go public      By Ayai Tomisawa     TOKYO  April 2 Japan's Nikkei share average rose more than 1.5 percent on Thursday morning  rebounding from Wednesday's three-week low   helped by short-covering and hopes that the central bank is buying stocks.     The Nikkei benchmark added 296.42 points ",
        "date": "04022015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Nikkei rises more than 1.5 pct on short-covering; BOJ buying helps mood "
    },
    {
        "content": "TOKYO  April 1 Japan's Sony Corp halved its stake in camera and endoscope maker Olympus Corp to raise funds for a restructuring drive under which it is boosting investment in sensors and videogames while pulling back from unprofitable segments.",
        "date": "04012015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony Corp halves stake in Olympus to raise funds for growth "
    },
    {
        "content": "* Sony says to book 46.8 billion yen profit from sale of some olympus shares    (Reporting By Tokyo Newsroom)",
        "date": "04012015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony to book 46.8 bln yen profit from sale of Olympus shares "
    },
    {
        "content": "TOKYO  April 1 Japan's Sony Corp has halved its stake in camera and endoscope maker Olympus Corp  and is no longer its top shareholder  according to Olympus.",
        "date": "04012015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Japan's Sony Corp halves stake in Olympus "
    },
    {
        "content": "TOKYO Japanese consumer electronics maker Sony Corp  said on Tuesday its official third-quarter operating profit was 182 billion yen ($1.5 billion)  up 2.2 percent from the estimate it reported last month  boosted by cost cuts and strong sales of sensors and videogames.",
        "date": "03172015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony revises third quarter profit upwards in official announcement "
    },
    {
        "content": "TOKYO  March 17 Japanese consumer electronics maker Sony Corp said on Tuesday its official third-quarter operating profit was 182 billion yen ($1.5 billion)  up 2.2 percent from the estimate it reported last month  boosted by cost cuts and strong sales of sensors and videogames.",
        "date": "03172015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony revises Q3 profit upwards in official announcement "
    },
    {
        "content": "Mar 17 (Reuters)-            Sony Corp            CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                     9 months ended      9 months ended       Year to                    Dec 31  2014        Dec 31  2013     Mar 31  2015                       LATEST             YEAR-AGO          COMPANY                         RESULTS             RESULT          FORECAST      Sales             6.28 trln           5.90 trln        8.00 trln                      (+6.5 p",
        "date": "03172015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "TABLE-Sony -9-MTH group results (SEC) "
    },
    {
        "content": "Sony Corp is planning the U.S. rollout of its long-anticipated video-streaming product later this year  according to a report in the Wall Street Journal on Wednesday.",
        "date": "03112015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony plans U.S. launch of video-streaming service this year: WSJ "
    },
    {
        "content": "March 11 Sony Corp is planning the U.S. rollout of its long-anticipated video-streaming product later this year  according to a report in the Wall Street Journal on Wednesday.",
        "date": "03112015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony plans U.S. launch of video-streaming service this year -WSJ "
    },
    {
        "content": "Bar code printer maker Domino Printing Sciences Plc  is planning to sell itself to a Japanese company in a deal worth close to 1 billion British pounds ($1.51 billion)  Sky News reported.",
        "date": "03102015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Domino Printing Sciences reaches a deal with a Japanese company: Sky News "
    },
    {
        "content": "* Says to start sales of Playstation 4 and Playstation Vita gaming consoles in China from March 20.    Further company coverage:    (Reporting by Kazunori Takada; Editing by Biju Dwarakanath)",
        "date": "03102015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony to start China sales of Playstation on March 20 "
    },
    {
        "content": "* Japan Display seeks to be primary supplier to Apple  sources say",
        "date": "03062015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Japan Display confirms new plant  source says for Apple "
    },
    {
        "content": "PARIS The head of Sony Mobile told French daily newspaper Le Figaro that the division is not being sold  only two weeks after Sony Corp  Chief Executive Kazuo Hirai said he would not rule out considering an exit strategy.",
        "date": "03022015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony Mobile head says division is not being sold: Le Figaro "
    },
    {
        "content": "PARIS  March 2 The head of Sony Mobile told French daily newspaper Le Figaro that the division is not being sold  only two weeks after Sony Corp Chief Executive Kazuo Hirai said he would not rule out considering an exit strategy.",
        "date": "03022015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony Mobile head says division is not being sold -Le Figaro "
    },
    {
        "content": "TOKYO Sony Corp Chief Executive Kazuo Hirai said he wants to resume dividend payments to shareholders when he succeeds in turning the company around  instead of rushing payouts.",
        "date": "02252015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "CEO says Sony won't rush into resuming dividends "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SYDNEY  February 23 (Fitch) Fitch Ratings says Sony Corporation's  (Sony; BB-/Stable) new mid-term strategy to prioritise significant profitability  improvements is credit positive because low margins are the key reason that the  company is rated significantly lower than during its heyday. However  rating  upgrades will depend on management's ability to successfully execute this  strategy and deliver sustained profitability an",
        "date": "02242015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Fitch: Sony Commits to Focus on Higher Profitability  at Last "
    },
    {
        "content": "TOKYO  Feb 25 Sony Corp Chief Executive Kazuo Hirai said he wants to resume dividend payments to shareholders when he succeeds in turning the company around  instead of rushing payouts.",
        "date": "02252015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-CEO says Sony won't rush into resuming dividends "
    },
    {
        "content": "TOKYO  Feb 25 Sony Corp Chief Executive Kazuo Hirai said he wants to resume dividend payments to shareholders after successfully turning the company around  instead of rushing payouts.",
        "date": "02252015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony will give out dividends once turnaround successful - CEO "
    },
    {
        "content": "TOKYO  Feb 20 Japan Display Inc is considering building a plant to supply smartphone screens for Apple Inc and is negotiating with the U.S. company for investment in the project  a person familiar with the situation said on Friday.",
        "date": "02202015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Japan Display in talks with Apple to build iPhone screen plant -source "
    },
    {
        "content": "* Sony jumps to highest since April 2010 on mid-term business plan     * Recent Japan Post's move to invest in risky assets buoys sentiment - trader     * Toraku ratio suggests profit-taking possible in near term      By Ayai Tomisawa     TOKYO  Feb 19 Japanese stocks rose to a 15-year high on Thursday morning  helped by gains in financial and shipping companies  and as  Sony Corp jumped on a well-received business plan.          The Nikkei share average gained 0.5 percent to  18 283",
        "date": "02192015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Nikkei rises to 15-yr high helped by financials; Sony jumps on growth plan "
    },
    {
        "content": "TOKYO Sony Corp  aims to boost operating profit 25-fold within three years by growing its camera sensors and PlayStation units  its chief executive said  outlining a strategy that could see the company exit the cut-throat TV and smartphone sectors.",
        "date": "02182015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony sees 25-fold profit jump by 2018; could exit TVs  phones "
    },
    {
        "content": "* CEO says won't rule out exit from TV  mobile   (Updates with share reaction)",
        "date": "02182015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 4-Sony sees 25-fold profit jump by 2018; could exit TVs  phones "
    },
    {
        "content": "TOKYO  Feb 15 Months after Sony Corp  bought So-net  the broadband provider's chief chided CEO Kazuo Hirai for having his \"priorities in the wrong order\".",
        "date": "02152015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "CFO Yoshida's Sony revamp wins over investors  tough decisions loom "
    },
    {
        "content": "Feb 18 Sony Corp Chief Executive Kazuo Hirai said:",
        "date": "02182015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony CEO: wants to resume dividend payments from FY2015/16 "
    },
    {
        "content": "TOKYO  Feb 18 Bolstered by investors' faith in its restructuring  Sony Corp is set to announce a new strategy highlighting the potential of its image sensors  PlayStation and entertainment businesses to help it return to growth after years of losses.",
        "date": "02182015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to announce new strategy  eyes growth in sensors  PlayStation "
    },
    {
        "content": "TOKYO  Feb 12 Japan's Nikkei share average ended at its highest level in more than 7-1/2 years on Thursday as the weak yen boosted exporters such as Toyota Motor Corp  and Sony Corp  while investors awaited the outcome of Greek debt negotiations.     The Nikkei benchmark gained 1.9 percent to 17 979.72  the highest closing level since July 2007.     Fanuc Corp soared 6.2 percent and hit a record high after the Nikkei business daily reported that Third Point bought a stake in the indu",
        "date": "02122015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Nikkei closes at highest level in 7-1/2 years as weak yen lifts exporters "
    },
    {
        "content": "TOKYO  Feb 12 Screen supplier Japan Display  reported a stronger-than-expected rise in quarterly profit amid higher demand from Apple Inc and Chinese smartphone makers  in stark contrast with peer Sharp Corp's  shrinking panel business.",
        "date": "02122015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Japan Display profit jumps on screen sales to Apple  China smartphone makers "
    },
    {
        "content": "NEW YORK - U.S. stock futures rose late on Wednesday after Europe agreed on a way forward with Greece on debt negotiations that had been holding back U.S. investors worried about European stability.",
        "date": "02122015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "India Morning Call-Global Markets "
    },
    {
        "content": "* Nikkei within striking distance from levels seen July 2007     * Fanuc soars to record high on report Third Point buys stake     * SoftBank underperforms on weak earnings      By Ayai Tomisawa     TOKYO  Feb 12 Japan's Nikkei share average hit a two-month high on Thursday  as the weak yen boosted exporters such as Toyota Motor Corp and Sony Corp  while investors cautiously awaited the outcome of Greek debt negotiations.     Fanuc Corp soared 3.7 percent to a record high after the N",
        "date": "02122015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Nikkei at 2-month high as weak yen lifts exporters "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SYDNEY  February 05 (Fitch) Fitch Ratings says Sony Corporation's  (Sony; BB-/Stable) device segment - including its market-leading image sensor  business - will continue to fare better than its other electronics businesses  and drive overall margin recovery. In addition  we expect benefits from the  company's on-going restructuring to steadily feed through to a lower cost  structure in the medium term. Sony's latest upward re",
        "date": "02062015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Fitch: Image Sensors Lead Sony's Recovery "
    },
    {
        "content": "TOKYO Sony Corp's  shares surged on Thursday to post their biggest daily gain in nine years after the consumer electronics and entertainment group lifted its full-year forecast  raising hopes its restructuring efforts were finally bearing fruit. | Video ",
        "date": "02052015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony shares post biggest daily gain in nine years after upgrading outlook "
    },
    {
        "content": "TOKYO  Feb 5 Japan's Nikkei share average fell on Thursday on news of the European Central Bank's hardline stance on Greek debt and fresh falls in oil prices  but Sony Corp soared after raising its outlook.     The Nikkei share average ended 1 percent lower at 17 504.62.     The broader Topix fell 0.5 percent to 1 410.11 and the JPX-Nikkei Index 400 dropped 0.6 percent to 12 778.26.     Sony shares surged 12 percent to post their biggest daily gain in two years after the electronics ",
        "date": "02052015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Nikkei falls on Greece worries  weak oil prices; Sony surges "
    },
    {
        "content": "* ECB's move on Greece  oil price plunges sap appetite     * Toyota down as upward earning revision fails to inspire     * Hitachi tumbles  Sony jumps after earning surprises      By Hideyuki Sano     TOKYO  Feb 5 Japan's Nikkei share average dipped on Thursday on news of the European Central Bank's hardline stance on Greek debt and fresh falls in oil prices  while investors took profits in Toyota and some others after their unsurprising earnings.      Hitachi dived more than 10 perc",
        "date": "02052015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Nikkei dips on oil  Greece worries; Hitachi tumbles "
    },
    {
        "content": "TOKYO  Feb 2 Sony Corp said it would spend 105 billion yen ($892.40 million) to boost production capacity for imaging sensors  increasing its focus on a business that is becoming one of its strongest as its TV and mobile operations struggle.",
        "date": "02022015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony to invest $890 mln to boost sensor production "
    },
    {
        "content": "TOKYO Japan's Sony Corp  said its net annual loss will likely be smaller than previously forecast after cost cuts and strong sales of its image sensors and PlayStation video game consoles helped its third-quarter profit beat estimates. | Video ",
        "date": "02042015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony trims loss forecast after strong third quarter on higher sensor sales "
    },
    {
        "content": "* CEO due to outline new business plan Feb. 18   (Adds CFO comments  details from statement)",
        "date": "02042015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony trims loss forecast after strong Q3 on higher sensor sales "
    },
    {
        "content": "* Says CEO Hirai to present new business strategy Feb 18  Further company coverage:    (Reporting by Ritsuko Ando)",
        "date": "02042015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony says CEO Hirai to present new business strategy Feb 18 "
    },
    {
        "content": "TOKYO  Feb 4 Japan's Sony Corp said its net loss for 2014 was likely less than previously forecast as cost cuts and higher-than-expected sales of its image sensors and PlayStation video game consoles helped lift its third-quarter profit.",
        "date": "02042015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony trims 2014 net loss forecast  preliminary Q3 profit beats estimates "
    },
    {
        "content": "* estimates Q3 net profit 89 billion yen  Further company coverage:    (Reporting by Tokyo Newsroom)",
        "date": "02042015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony estimates Q3 operating profit 178.3 bln yen "
    },
    {
        "content": "* Says it expects to sell 39.2 million smartphones in FY2015/3 versus prev f'cast of 41 million",
        "date": "02042015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony sales  currency rate forecasts "
    },
    {
        "content": "Feb 4 (Reuters) -               Sony Corp                    CONSOLIDATED EARNINGS ESTIMATES   (in billions of yen unless specified)                                          Full Year to      Full Year to                     Mar 31  2015      Mar 31  2015                          LATEST           PREVIOUS                           FORECAST          FORECAST        Sales&Rev      8.00 trln         7.80 trln       Operating            20.00          loss 40.00       PreTax             loss 5.0",
        "date": "02042015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "TABLE-Sony -2014/15 group forecast(SEC) "
    },
    {
        "content": "Sony Corp plans to cut another 1 000 jobs in its smartphone division  mainly in Europe and China  the Nikkei business daily reported.",
        "date": "01272015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony to cut 1 000 jobs in smartphone business: Nikkei "
    },
    {
        "content": "Jan 27 Sony Corp plans to cut another 1 000 jobs in its smartphone division  mainly in Europe and China  the Nikkei business daily reported.",
        "date": "01272015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to cut 1 000 jobs in smartphone business - Nikkei "
    },
    {
        "content": "By Thomas Wilson     TOKYO  Jan 28 Japanese stocks rose to a fresh one-month high on Wednesday as expectations of strong corporate earnings and a weaker yen boosted investor sentiment.     The Nikkei benchmark gained 0.2 percent to close at 17 795.73  its highest since Dec. 29  after reversing early losses triggered by profit-taking after disappointing U.S. earnings. The average rose 1.7 percent on Tuesday.     Market participants were also buying on expectations that Wall Street sha",
        "date": "01282015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Nikkei hits fresh 1-month high on earnings hopes; Sony outperforms "
    },
    {
        "content": "TOKYO Sony Corp plans to cut around 1 000 additional jobs in its struggling smartphone division as it tries to bring its electronics business back into the black  sources said on Wednesday.",
        "date": "01282015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to cut 1 000 jobs in smartphone business: sources "
    },
    {
        "content": "* Sony rises after report it will cut about 1 000 jobs     * Komatsu  Hitachi Construction off on Caterpillar earnings      By Ayai Tomisawa     TOKYO  Jan 28 Japan's Nikkei share average retreated from a one-month high on Wednesday morning as disappointing U.S. earnings and weak U.S. economic data triggered profit-taking  while Sony Corp outperformed after sources said it will cut about 1 000 jobs.     The Nikkei was flat at 17 762.13 in mid-morning trade after opening 0.9 percent l",
        "date": "01282015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Nikkei slips from 1-mth high as U.S. earnings disappoint; Sony outperforms "
    },
    {
        "content": "TOKYO  Jan 28 Sony Corp plans to cut around 1 000 additional jobs in its struggling smartphone division as it tries to bring its electronics business back into the black  sources said on Wednesday.",
        "date": "01282015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 1-Sony to cut 1 000 jobs in smartphone business -sources "
    },
    {
        "content": "- to cut around 1 000 jobs in smartphone business  sources tell Reuters",
        "date": "01282015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "BRIEF-Sony to cut around 1 000 additional jobs in smartphone business - sources "
    },
    {
        "content": "TOKYO Sony Corp said it was delaying the official submission of its third-quarter results due to the massive cyberattack on Sony Pictures Entertainment  which debilitated network systems at the Hollywood studio.",
        "date": "01232015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony to delay official submission of third quarter results after hacking "
    },
    {
        "content": "WASHINGTON The U.S. National Security Agency began tapping into North Korean computer networks in 2010  an effort that ultimately helped provide evidence to persuade the Obama administration that Pyongyang was behind the cyber attack on Sony Pictures  the New York Times reported on Sunday.",
        "date": "01192015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "U.S. penetrated North Korean networks years ago - New York Times "
    },
    {
        "content": "TOKYO  Jan 23 Sony Corp said it was delaying the official submission of its third-quarter results due to the massive cyberattack on Sony Pictures Entertainment  which debilitated network systems at the Hollywood studio.",
        "date": "01232015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony to delay official submission of Q3 results after hacking "
    },
    {
        "content": "WASHINGTON  Jan 18 The U.S. National Security Agency began tapping into North Korean computer networks in 2010  an effort that ultimately helped provide evidence to persuade the Obama administration that Pyongyang was behind the cyber attack on Sony Pictures  the New York Times reported on Sunday.",
        "date": "01192015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "U.S. penetrated North Korean networks years ago -New York Times "
    },
    {
        "content": "WASHINGTON  Jan 13 The United States aims to use new sanctions imposed on North Korea over the cyber attack on Sony Pictures to cut off the country's remaining links to the international financial system  a senior U.S. Treasury official said on Tuesday.",
        "date": "01132015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "UPDATE 1-U.S. takes aim at North Korea's remaining financial links "
    },
    {
        "content": "WASHINGTON  Jan 13 President Barack Obama sent a bill to Congress on Tuesday to strengthen U.S. cybersecurity laws to protect government  businesses and consumers while protecting privacy  after recent hacking attacks against Sony Pictures  Home Depot Inc and Target Corp   and on Monday the federal government itself.",
        "date": "01142015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "UPDATE 3-Obama seeks enhanced cybersecurity laws to fight hackers "
    },
    {
        "content": "SEOUL  Jan 16 North Korea said on Friday it was committed to fighting money laundering and financing of terrorism  two weeks after being slapped with more U.S. sanctions in the wake of a cyberattack on Sony Pictures which Washington blamed on Pyongyang.",
        "date": "01162015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "North Korea says committed to fighting money laundering  terror financing "
    },
    {
        "content": "Jan 12 Walt Disney Co  Sony Corp  and DreamWorks Animation SKG Inc urged a federal judge to throw out a antitrust lawsuit accusing them of conspiring not to poach each other's animators in order to keep wages down.",
        "date": "01122015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Disney  Sony  DreamWorks seek to throw out anti-poaching lawsuit "
    },
    {
        "content": "LAS VEGAS  Jan 13 Sony Corp CEO Kazuo Hirai has weathered a crisis over a cyberattack on its Hollywood studio and its controversial comedy \"The Interview\"  but his toughest moment may be just arriving as he prepares a new business revival plan.",
        "date": "01122015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony CEO eyes options as pressure mounts on weak TV  mobile "
    },
    {
        "content": "TOKYO Sony Corp  on Tuesday said sales of its PlayStation 4 video game consoles exceeded 18.5 million units as of Jan. 4  up from 13.5 million at the end of October  showing solid holiday demand and a bright spot for a company recovering from a massive cyber-attack.",
        "date": "01052015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony PlayStation 4 sales top 18.5 million units worldwide "
    },
    {
        "content": "SHANGHAI Sony Corp will delay sales of the PlayStation 4 gaming console in China  originally scheduled for Jan. 11  due to \"various factors\"  the company said in a statement on Thursday.",
        "date": "01082015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony to delay sale of PlayStation 4 in China "
    },
    {
        "content": "LAS VEGAS Sony Corp Chief Executive Kazuo Hirai on Tuesday said he does not expect the November cyber attack on the company's film studio to have a significant financial impact  two weeks after the studio rolled out the movie at the heart of the attack.",
        "date": "01072015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "Sony CEO sees no major financial impact from cyber attack "
    },
    {
        "content": "TOKYO  Jan 6 Sony Corp on Tuesday said sales of its PlayStation 4 video game consoles exceeded 18.5 million units as of Jan. 4  up from 13.5 million at the end of October  showing solid holiday demand and a bright spot for a company recovering from a massive cyber-attack.",
        "date": "01052015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "REFILE-Sony PlayStation 4 sales top 18.5 mln units worldwide "
    },
    {
        "content": "SHANGHAI  Jan 8 Sony Corp will delay sales of the PlayStation 4 gaming console in China  originally scheduled for Jan. 11  due to \"various factors\"  the company said in a statement on Thursday.",
        "date": "01082015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony to delay sale of PlayStation 4 in China "
    },
    {
        "content": "SHANGHAI  Jan 8 Sony Corp will delay sales of the Playstation 4 gaming console in China  originally scheduled for Jan. 11  due to \"various factors\"  according to a statement on Thursday.",
        "date": "01082015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony says to delay sale of Playstation 4 in China "
    },
    {
        "content": "HONOLULU/WASHINGTON North Korea was hit with more sanctions on Friday designed to impede access to the U.S. financial system in the wake of a cyberattack on Sony Pictures Entertainment   which the Obama Administration has said was supported by the reclusive country.",
        "date": "01042015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "U.S. slaps more sanctions on North Korea after Sony hack "
    },
    {
        "content": "(Recasts with revenue figures for \"The Interview \" adds background)",
        "date": "01062015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony CEO sees no major financial impact from cyber attack "
    },
    {
        "content": "LAS VEGAS  Jan 6 Sony Corp Chief Executive Kazuo Hirai does not see the November cyber attack on Sony Pictures Entertainment causing major upheaval in the studio's business.",
        "date": "01062015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony CEO does not expect studio upheaval after cyber attack "
    },
    {
        "content": "LAS VEGAS Sony Corp Chief Executive Officer Kazuo Hirai on Monday praised employees and partners of the company's Hollywood movie studio for standing up to \"extortionist efforts\" of hackers who attacked Sony Pictures Entertainment. | Video ",
        "date": "01062015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony CEO praises employees  partners for standing up to hackers "
    },
    {
        "content": "* Sony set for another loss on weak smartphone sales   (Adds details on PlayStation 4 sales  new products)",
        "date": "01062015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "UPDATE 2-Sony CEO praises employees  partners for standing up to hackers "
    },
    {
        "content": "HONOLULU/WASHINGTON North Korea was hit with more sanctions on Friday designed to impede access to the U.S. financial system in the wake of a cyberattack on Sony Pictures Entertainment  which the Obama Administration has said was supported by the reclusive country.",
        "date": "01022015",
        "name": "Sony Corp Ord",
        "news_type": "topStory",
        "symbol": "SNE",
        "title": "U.S. slaps more sanctions on North Korea after Sony hack "
    },
    {
        "content": "LAS VEGAS  Jan 5 Sony Corp Chief Executive Officer Kazuo Hirai on Monday praised employees and partners of the company's Hollywood movie studio for standing up to \"extortionist efforts\" of hackers who attacked Sony Pictures Entertainment in November.",
        "date": "01062015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony CEO praises employees for standing up to 'extortionist' hackers "
    },
    {
        "content": "WASHINGTON New U.S. sanctions imposed against North Korea on Friday were not directly linked to the recent cyber attack on Sony Corp.  senior administration officials in Washington said.",
        "date": "01022015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "U.S. says new North Korea sanctions not directly linked to Sony hack "
    },
    {
        "content": "NEW YORK  March 18 Sony Corp on Wednesday launched its PlayStation Vue Web video service in three cities  targeting customers looking for cheaper alternatives to cable with packages starting at $50.",
        "date": "03182015",
        "name": "Sony Corp Ord",
        "news_type": "normal",
        "symbol": "SNE",
        "title": "Sony's PlayStation Vue online TV service launches at $50 a month "
    }
]