[
    {
        "content": "* Says full-year growth will be at lower end of 3-4 pct guidance",
        "date": "11032017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "UPDATE 2-Under pressure Smith & Nephew to focus on efficiency "
    },
    {
        "content": "Nov 3 The former chief executive of medical device company ArthroCare Corp was sentenced on Friday to 20 years in prison after being convicted of having orchestrated what federal prosecutors called a $750 million securities fraud.",
        "date": "11032017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Ex-ArthoCare CEO sentenced to 20 years in U.S. prison for fraud "
    },
    {
        "content": "* Ceo says cost savings plan will be finalised by year-end results in feb",
        "date": "11032017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "BRIEF-S&N CEO will not confim if activist investor Elliott has stake "
    },
    {
        "content": "LONDON  Nov 3 European hip and knee maker Smith & Nephew said on Friday its growth for the year would be at the lower end of its guidance after reporting a 3 percent rise in revenue for the third quarter  just missing average market expectations.",
        "date": "11032017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Smith & Nephew sees full-year growth at lower end of guidance "
    },
    {
        "content": "LONDON  Oct 23 Medical technology group Smith & Nephew  which some investors believe should streamline operations to make itself a more attractive takeover target  said on Monday it was buying a U.S. sports injury business for up to $210 million.",
        "date": "10232017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "UPDATE 1-Smith & Nephew to buy Rotation Medical for up to $210 mln "
    },
    {
        "content": "LONDON  Oct 23 Medical technology group Smith & Nephew  which has been urged by activist investor Elliott Management to shed some operations according to media reports  has agreed to buy a U.S. tissue repair business for up to $210 million.",
        "date": "10232017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Smith & Nephew to buy Rotation Medical for up to $210 mln "
    },
    {
        "content": "* ‍ENTERED INTO A DEFINITIVE AGREEMENT TO ACQUIRE ROTATION MEDICAL INC​",
        "date": "10232017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew says to buy Rotation Medical Inc​ "
    },
    {
        "content": "Hedge fund Elliott Management Corp has built a stake in artificial hip and knee maker Smith & Nephew Plc  Bloomberg reported on Tuesday  citing people familiar with the matter.",
        "date": "10102017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Elliott Management builds stake in Smith & Nephew: Bloomberg "
    },
    {
        "content": "Oct 10 Hedge fund Elliott Management Corp has built a stake in artificial hip and knee maker Smith & Nephew Plc   Bloomberg reported on Tuesday  citing people familiar with the matter.",
        "date": "10102017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Elliott Management builds stake in Smith & Nephew - Bloomberg "
    },
    {
        "content": "* Paul Singer's Elliott is said to build a stake in Smith & Nephew - Bloomberg  citing sources ‍​ Source text: https://bloom.bg/2y8hNye Further company coverage:",
        "date": "10102017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "BRIEF-Paul Singer's Elliott is said to build a stake in Smith & Nephew - Bloomberg‍​ "
    },
    {
        "content": "* ‍notice of chief executive officer's intention to retire by end of 2018​",
        "date": "10092017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew CEO Olivier Bohuon to retire by end-2018 "
    },
    {
        "content": "* SMITH & NEPHEW AND IMPERIAL COLLEGE PARTNER TO DEVELOP ENHANCED SURGICAL TECHNIQUES IN SPORTS MEDICINE Source text for Eikon: Further company coverage:",
        "date": "09052017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew partners with Imperial College to develop surgical techniques in sports medicine "
    },
    {
        "content": "LONDON  July 27 Artificial hip and knee maker Smith & Nephew reported a 3 percent rise in underlying revenue growth in the second quarter  in line with its 3-4 percent forecast for the year  helped by 13 percent growth in emerging markets.",
        "date": "07272017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Smith & Nephew buoyed by double-digit emerging markets growth "
    },
    {
        "content": "* H1 REVENUE 2.336 BILLION USD VERSUS 2.328 BILLION USD YEAR AGO",
        "date": "07272017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew posts H1 operating profit of $414 mln "
    },
    {
        "content": "* Appointment of Angie Risley as non-executive director and chairman elect of remuneration committee Source text for Eikon: Further company coverage:",
        "date": "07042017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew appoints Angie Risley as chairman elect of remuneration committee "
    },
    {
        "content": "LONDON  May 5 Shares in Smith & Nephew rose to a nine-month high on Friday after the artificial hip and knee maker said a strong first quarter  led by growth in emerging markets  put it on track to meet it targets for the year.",
        "date": "05052017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "RPT-UPDATE 1-Emerging markets growth puts Smith & Nephew on track for year "
    },
    {
        "content": "* Shares rise to nine-month highs (Adds CEO comments  analyst reaction  shares)",
        "date": "05052017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "UPDATE 1-Emerging markets growth puts Smith & Nephew on track for year "
    },
    {
        "content": "LONDON  May 5 The chief executive of Smith & Nephew said on Friday that M&A was not at the top of his agenda  as the focus was on driving growth at the artificial knee and hip maker.",
        "date": "05052017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Smith & Nephew says M&A 'not at top of agenda' at the moment "
    },
    {
        "content": "LONDON  May 5 Smith & Nephew  Europe's biggest artificial hip and knee maker  reported a 3 percent rise in underlying revenue in its first quarter  helped by a return to double-digit growth in emerging markets and a solid performance in knee implants.",
        "date": "05052017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Smith & Nephew Q1 revenue rises 3 pct on underlying basis "
    },
    {
        "content": "* Smith & Nephew invests in and signs agreement to distribute disruptive Leaf Healthcare pressure injury technology  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew signs agreement to distribute Leaf Healthcare technology "
    },
    {
        "content": "LONDON Smith & Nephew   Europe's biggest artificial hip and knee maker  reported a 7 percent drop in full-year trading profit  missing average analysts' forecasts  as tough market conditions in China and Saudi Arabia kept growth in check.",
        "date": "02092017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Smith & Nephew hurt by tough markets in China  Gulf states "
    },
    {
        "content": "* Shares down 2.4 pct   (Adds CEO comments  further analyst reaction  updates shares)",
        "date": "02092017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "UPDATE 2-Smith & Nephew hurt by tough markets in China and Gulf states "
    },
    {
        "content": "LONDON  Feb 9 Britain's top share index steadied on Thursday as falls among mining stocks weighed  while Smith & Nephew dropped after posting disappointing results.",
        "date": "02092017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Falls in Smith & Nephew  miners weigh on Britain's FTSE "
    },
    {
        "content": "LONDON  Feb 9 Smith & Nephew  Europe's biggest artificial hip and knee maker  reported a 7 percent drop in full-year trading profit  missing average forecasts  as tough market conditions in China and the Gulf States kept growth in check.",
        "date": "02092017",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Smith & Nephew hit by tough markets in China  Gulf States "
    },
    {
        "content": "LONDON  Nov 3 Artificial hip and knee maker Smith & Nephew reported a 2 percent rise in underlying quarterly revenue to $1.12 billion  towards the bottom of forecasts  after sales grew only 2 percent in the United States and stalled in other established markets.",
        "date": "11032016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "UPDATE 1-Smith & Nephew revenue up 2 pct  at bottom end of forecasts "
    },
    {
        "content": "LONDON  Nov 3 Artificial hip and knee maker Smith & Nephew reported a 2 percent rise in third-quarter revenue to $1.12 billion  towards the bottom of expectations  as sales grew only 2 percent in the United States and stalled in other established markets.",
        "date": "11032016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Smith & Nephew Q3 revenue rise at bottom-end of forecasts "
    },
    {
        "content": "LONDON Britain's top companies need to cut bonuses in response to shareholder revolts against senior executives' pay  the fund arm of insurer Legal & General  said in a letter to the top 350 firms in the UK.",
        "date": "09162016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Investor warns Britain's top firms not to ignore pay revolts "
    },
    {
        "content": "* Smith & nephew completes gynaecology sale and commences $300 million share buy-back programme",
        "date": "08082016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew starts share buyback after gynaecology divestment completes "
    },
    {
        "content": "LONDON  July 28 Smith & Nephew  Europe's biggest maker of artificial knees and hips  reported a 2 percent rise in second-quarter revenue on Thursday  helped by good growth in its sports medicine joint repair business.",
        "date": "07282016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Smith & Nephew buoyed by sports medicine but China weak "
    },
    {
        "content": "LONDON  July 28 Britain's top share index dipped on Thursday after hitting a one-year high in the previous session  with Smith & Nephew and Royal Dutch Shell falling after poorly received trading updates.",
        "date": "07282016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "FTSE edges down from 1-year high  earnings weigh "
    },
    {
        "content": "* Julie Brown appointed as new chief operating & financial officer",
        "date": "07112016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-Burberry names Smith & Nephew's Julie Brown as new CFO "
    },
    {
        "content": "* Deal expected to close by October end   (Adds details; updates shares)",
        "date": "06272016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "UPDATE 2-Medical device maker Medtronic to buy HeartWare for $1.1 bln "
    },
    {
        "content": "Smith & Nephew Plc   Europe's biggest maker of artificial knees and hips  said it would sell its gynaecology unit to medical device maker Medtronic Plc  for $350 million.",
        "date": "05182016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Smith & Nephew to sell gynaecology unit to Medtronic "
    },
    {
        "content": "May 18 Smith & Nephew Plc  Europe's biggest maker of artificial knees and hips  said it would sell its gynaecology unit to medical device maker Medtronic Plc  for $350 million.",
        "date": "05182016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "UPDATE 1-Smith & Nephew to sell gynaecology unit to Medtronic "
    },
    {
        "content": "May 18 Smith & Nephew Plc   Europe's biggest maker of artificial knees and hips  said it would sell its gynaecology unit to medical device maker Medtronic Plc for $350 million.",
        "date": "05182016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Smith & Nephew to sell gynaecology unit to Medtronic for $350 mln "
    },
    {
        "content": "* Signed a definitive agreement to divest its gynaecology business to Medtronic Plc (NYSE:MDT) for $350 million.",
        "date": "05182016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew sells gynaecology unit to Medtronic "
    },
    {
        "content": "LONDON  May 5 Smith & Nephew  Europe's biggest maker of artificial knees and hips  reported a slightly worse-than-expected 3 percent rise in first-quarter revenue on Thursday  as weakness in China and the oil-rich Gulf states offset good U.S. demand.",
        "date": "05052016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "China weighs on Smith & Nephew revenue in first quarter "
    },
    {
        "content": "* Kroger says promoting Kenny Kimball  currently VP of operations in Smith's division  to serve as President of Smith's  effective April 30",
        "date": "04062016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-Kroger names Kenny Kimball  President of Smith's "
    },
    {
        "content": "LONDON  Feb 4 Smith & Nephew  Europe's largest maker of artificial hips and knees  forecast a rise in underlying revenue this year  but said its profit margin could fall due to the U.S. dollar's strength against emerging market currencies.",
        "date": "02042016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "UPDATE 1-Smith & Nephew sees revenues up  but forex to hit margins "
    },
    {
        "content": "** Smith & Nephew  Europe's largest maker of artificial hips and knees  down about 1 pct & 4th top FTSE 100  losers despite largely in-line  positive results",
        "date": "02042016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "BUZZ-Smith & Nephew: cautious margin guidance weighs on stock "
    },
    {
        "content": "LONDON  Feb 4 Smith & Nephew  Europe's largest maker of artificial hips and knees  reported trading profit slightly ahead of consensus helped by strong demand for sports medicine in the fourth quarter  giving it confidence on growing revenues in 2016.",
        "date": "02042016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Smith & Nephew 2015 trading profit beats expectations "
    },
    {
        "content": "LONDON  Feb 1 Smith & Nephew Plc  Europe's biggest maker of artificial hips and knees  said on Monday that its Chief Executive Olivier Bohuon has been diagnosed with a highly treatable form of cancer.",
        "date": "02012016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Smith & Nephew CEO Bohuon diagnosed with cancer "
    },
    {
        "content": "* \u007folivier bohuon  chief executive officer  has been diagnosed with a highly treatable form of cancer\u007f",
        "date": "02012016",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew CEO Olivier Bohuon to work through cancer treatment "
    },
    {
        "content": "LONDON  Oct 29 Smith & Nephew Plc  Europe's biggest maker of artificial hips and knees  stuck with its forecast for a higher trading profit margin this year as it said third-quarter revenue rose and it announced the acquisition of a robotics company.",
        "date": "10292015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Smith & Nephew on track for profit improvement in 2015 "
    },
    {
        "content": "LONDON  July 30 Smith & Nephew Plc  Europe's biggest maker of artificial hips and knees  beat market expectations with a 6 percent rise in first-half trading profit after growth accelerated in its knees implant and advanced wound care businesses.",
        "date": "07302015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Smith & Nephew posts earnings beat on knee  wound care growth "
    },
    {
        "content": "* H1 revenue 2.27 billion usd versus 2.22 billion usd year ago",
        "date": "07302015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew says on track after 6 pct rise in H1 trading profit "
    },
    {
        "content": "LONDON  July 10 British artificial hip and knee maker Smith & Nephew said it had bought a Russian distribution and manufacturing business  in line with its strategy of expanding in emerging markets.",
        "date": "07102015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Smith & Nephew buys Russian manufacturing business "
    },
    {
        "content": "* Biotec Pharmacon ASA and Smith & Nephew have mutually decided to end the discussion about a Woulgan distribution agreement  Source text for Eikon:",
        "date": "07072015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-Biotec Pharmacon ends discussion about Woulgan distribution agreement with Smith & Nephew "
    },
    {
        "content": "DUBLIN  June 22 An Irish tribunal has ruled in favour of the former Chief Executive of RSA Ireland  Philip Smith  in an unfair dismissal case and awarded him 1.25 million euros ($1.42 million)  a spokesman for Smith's lawyer said on Monday.",
        "date": "06222015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Former RSA Ireland CEO wins unfair dismissal case -lawyer "
    },
    {
        "content": "* Receives $99 million patent infringement payment from Arthrex",
        "date": "06172015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew gets $99 mln patent infringement payment from Arthrex "
    },
    {
        "content": "* Voluntary actions initiated to remove smaller size components and change instructions for use (IFU) following analysis of recent performance data",
        "date": "06042015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew removes smaller components of hip replacement system from market "
    },
    {
        "content": "LONDON  April 30 Smith & Nephew  Europe's largest maker of artificial knees and hips  posted a 3 percent underlying rise in revenue for the first quarter  helped by strong growth in sports medicine joint repair and increased trade in emerging markets.",
        "date": "04302015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Smith & Nephew posts 3 pct higher first-quarter revenue "
    },
    {
        "content": "* Barclays  Glencore slip after updates   (Updates with closing prices)",
        "date": "03032015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "UK's FTSE falls back from record high as Smith & Nephew slumps "
    },
    {
        "content": "LONDON Plans by Stryker  to launch a new $2 billion share buyback program punctured hopes the U.S. surgical implant firm would bid for rival Smith & Nephew   sending shares in the British group some 5 percent lower on Tuesday.",
        "date": "03032015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Stryker's $2 billion buyback plan deflates Smith & Nephew bid hopes "
    },
    {
        "content": "* Barclays  Glencore slip after updates   (Adds details  quote)",
        "date": "03032015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Smith & Nephew slump knocks FTSE back from record high "
    },
    {
        "content": "* Announces acquisition of Eurociencia Colombia ('ECC'). Ecc has been Smith & Nephew's sole distributor for orthopaedic reconstruction  trauma and sports medicine products in Colombia since 2006",
        "date": "03032015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "BRIEF-Smith & Nephew buys Eurociencia Colombia "
    },
    {
        "content": "* Employees of Smith and Ouzman Ltd  a printing company based in Eastbourne  were sentenced today at Southwark Crown Court",
        "date": "02122015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "BRIEF-UK's SFO says two Smith and Ouzman employees sentenced to prison "
    },
    {
        "content": "LONDON  Feb 9 Woodford Investment Management sold out of British artificial hip and knee maker Smith & Nephew  and German real estate firm Gagfah SA in January  according to the firm's factsheet released on Monday.",
        "date": "02092015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Woodford exits bets on Smith & Nephew  Gagfah; adds P2P Global in Jan "
    },
    {
        "content": "LONDON  Feb 5 British artificial hip and knee maker Smith & Nephew posted a 7 percent rise in trading profit in the fourth quarter  and said it was confident it would grow both revenue and its trading profit margin in 2015.",
        "date": "02052015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Smith & Nephew confident after fourth-quarter profit rise "
    },
    {
        "content": "Jan 27 The chief executive officer of U.S. medical device maker Stryker Corp  recently rumored to have been preparing a bid for British rival Smith & Nephew Plc   said on Tuesday that acquisitions are his top priority for spending cash  but he gave no hint that any sort of deal was imminent.",
        "date": "01282015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Stryker CEO says he remains focused on acquisitions "
    },
    {
        "content": "The chief executive of Smith & Nephew  the medical device maker that has been the subject of persistent takeover rumors  on Monday said mergers designed to gain size do not change market share dynamics in the hip and knee replacement business.",
        "date": "01132015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Medical device maker Smith & Nephew CEO: Big not always beautiful "
    },
    {
        "content": "UBS Group AG  Switzerland's biggest bank  has lost two more blue-chip corporate broking clients  the Financial Times reported  citing people familiar with the situation.",
        "date": "01112015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "topStory",
        "symbol": "SNN",
        "title": "Two blue-chip companies drop UBS as their corporate broking adviser: FT "
    },
    {
        "content": "LONDON  Jan 12 European shares were seen opening steady on Monday  with healthcare stocks likely to come into focus after Shire Plc   agreed to buy NPS Pharmaceuticals Inc for $5.2 billion.          Financial spreadbetters expected Britain's FTSE 100 to open down by 10-14 points  or 0.2 percent lower. Germany's DAX was expected to open up by 11.5-31.5 points  or 0.1-0.3 percent higher  while France's CAC 40  was seen opening flat.          Europe bourses in 2014: (http://link.reuters",
        "date": "01122015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "European Factors to Watch-Shares seen steady  health sector in focus "
    },
    {
        "content": "Jan 11 UBS Group AG  Switzerland's biggest bank  has lost two more blue-chip corporate broking clients  the Financial Times reported  citing people familiar with the situation.",
        "date": "01112015",
        "name": "Smith & Nephew SNATS Inc",
        "news_type": "normal",
        "symbol": "SNN",
        "title": "Two blue-chip companies drop UBS as their corporate broking adviser -FT "
    }
]