[
    {
        "content": "A U.S. appeals court has blocked Teva Pharmaceutical Industries Ltd and Novartis AG's Sandoz unit from launching generic versions of Sanofi SA's atrial fibrillation drug Multaq  finding they would infringe two of Sanofi's patents.",
        "date": "11102017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Fed Circuit blocks generic versions of Sanofi atrial fibrillation drug "
    },
    {
        "content": "* Regeneron and Sanofi to present new analyses from the Praluent® (alirocumab) injection Odyssey clinical trial program at the AHA Scientific Sessions 2017 Source text for Eikon: Further company coverage:",
        "date": "11072017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and Sanofi to present new analyses from Praluent injection Odyssey clinical trial "
    },
    {
        "content": "PARIS  Nov 9 Sanofi will develop and sell an oral treatment candidate for multiple sclerosis owned by U.S firm Principia Biopharma in a licensing agreement that could total $765 million  the French drugmaker said on Thursday.",
        "date": "11092017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi strikes licence deal with Principia Biopharma on multiple sclerosis "
    },
    {
        "content": "* ‍MAINTAINS ITS REVENUE GUIDANCE OF A CONTINUED INCREASE IN ROYALTY PAYMENTS FROM SANOFI.​",
        "date": "11082017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma Q3 operating loss at DKK 38.2 mln ​ "
    },
    {
        "content": "Nov 7 Takeda Pharmaceutical's experimental dengue vaccine has produced promising long-term results in clinical tests  boosting the Japanese company's global hopes for a product that will take on Sanofi's Dengvaxia.",
        "date": "11062017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Takeda takes on Sanofi with new global dengue vaccine data "
    },
    {
        "content": "Nov 8 Regeneron Pharmaceuticals Inc on Wednesday reported third-quarter profit that sailed past Wall Street estimates on the strength of increased demand for flagship eye treatment Eylea and its new eczema drug Dupixent  boosting its shares almost 7 percent.",
        "date": "11082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-Regeneron Q3 profit easily tops Street view on Eylea  Dupixent sales "
    },
    {
        "content": "PARIS French drugmaker Sanofi  disappointed investors with a more gloomy forecast for its struggling diabetes business on Thursday  while quarterly net income also slipped.",
        "date": "11022017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi takes gloomy view of diabetes drug sales "
    },
    {
        "content": "* CFO sees L'Oreal keeping Sanofi stake for now (Adds details  shares  comments)",
        "date": "11022017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi takes gloomy view of diabetes drug sales "
    },
    {
        "content": "PARIS  Nov 2 Sanofi confirmed its 2017 outlook after it posted slightly lower-than-expected third-quarter results  and gave a more precise range on expectations of a sales decline at its embattled diabetes business.",
        "date": "11022017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi refines expectations on drop in sales at diabetes arm "
    },
    {
        "content": "* Sanofi files suit in the U.S. to defend its patent rights on Lantus® and Lantus® Solostar®",
        "date": "10242017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi files suit in the U.S. to defend patent rights "
    },
    {
        "content": "LONDON/SHANGHAI  Oct 19 Investors are betting on China's potential to feed the global pharmaceutical pipeline  putting a multi-billion-dollar price tag on a handful of stocks  even as the country struggles to close a huge R&D gap with the West.",
        "date": "10192017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "INSIGHT-China biotech's 'coming out party' masks long road ahead "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc and Sanofi SA said on Monday their drug to treat inflammation in the esophagus  mainly caused by food allergies  met the main goal of a mid-stage study.",
        "date": "10162017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Regeneron-Sanofi drug succeeds mid-stage study "
    },
    {
        "content": "Oct 16 Regeneron Pharmaceuticals Inc and Sanofi SA said on Monday their drug to treat inflammation in the esophagus  mainly caused by food allergies  met the main goal of a mid-stage study.",
        "date": "10162017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-UPDATE 1-Regeneron-Sanofi drug succeeds mid-stage study "
    },
    {
        "content": "VAL-DE-REUIL  France Sanofi on Thursday expressed confidence in the growth of its influenza vaccines after committing to invest 170 million euros to expand its manufacturing facility at Val-de-Reuil in north-western France.",
        "date": "10122017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi boosts vaccines business with 170 million euro investment "
    },
    {
        "content": "Oct 16 Aimmune Therapeutics Inc said on Monday it would collaborate with Regeneron Pharmaceuticals Inc and Sanofi to develop its experimental peanut allergy drug.",
        "date": "10162017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Aimmune teams with Regeneron  Sanofi on peanut allergy drug "
    },
    {
        "content": "* Points to risk of over-optimism over universal flu vaccine (Adds quotes  details)",
        "date": "10122017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi boosts vaccines business with 170 mln euro investment "
    },
    {
        "content": "Oct 12 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "10122017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "French and Benelux stocks-Factors to watch on October 12 "
    },
    {
        "content": "Oct 16 Regeneron Pharmaceuticals Inc and Sanofi SA said on Monday their drug to treat patients with a rare throat infection met the main goal of a mid-stage study.",
        "date": "10162017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Regeneron-Sanofi throat infection drug succeeds key study "
    },
    {
        "content": "* Aimmune Therapeutics announces clinical collaboration to study AR101 with Regeneron and Sanofi’s dupilumab for peanut allergy",
        "date": "10162017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Aimmune Therapeutics collaborates to study AR101 with Regeneron and Sanofi’s dupilumab for peanut allergy "
    },
    {
        "content": "* REGENERON AND SANOFI ANNOUNCE POSITIVE PHASE 2 STUDY RESULTS FOR DUPILUMAB IN PATIENTS WITH ACTIVE MODERATE-TO-SEVERE EOSINOPHILIC ESOPHAGITIS",
        "date": "10162017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and Sanofi announce positive phase 2 study results for dupilumab "
    },
    {
        "content": "* Possible buyers include existing OTC drugmakers and Nestle (Adds Breakingviews link)",
        "date": "10102017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 4-Pfizer weighs $15 bln sale of consumer healthcare business "
    },
    {
        "content": "PARIS  Oct 5 French pharmaceutical group Sanofi is set to start  the process to sell its generic drug business in Europe  and at least six funds have expressed interest to investment banks mandated by group  France's Le Figaro newspaper reported.",
        "date": "10052017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "At least six funds interested in Sanofi European generic drugs unit -Le Figaro "
    },
    {
        "content": "A U.S. appeals court on Thursday threw out a ban on the sale of  Regeneron Pharmaceuticals Inc and Sanofi SA's cholesterol-lowering drug Praluent  and ordered a new trial after finding a jury was given improper instructions.",
        "date": "10052017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "U.S. court reverses ban on sale of Regeneron  Sanofi cholesterol drug "
    },
    {
        "content": "Oct 5 A U.S. appeals court on Thursday threw out a ban on the sale of  Regeneron Pharmaceuticals Inc and Sanofi SA's cholesterol-lowering drug Praluent  and ordered a new trial after finding a jury was given improper instructions.",
        "date": "10052017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-U.S. court reverses ban on sale of Regeneron  Sanofi cholesterol drug "
    },
    {
        "content": "PARIS  Oct 2 Sanofi said on Monday it had appointed Stefan Oelrich to the position of executive vice president at its diabetes and cardiovascular arm  with Oelrich replacing Peter Guenter who left Sanofi in August after more than two decades at the group.",
        "date": "10022017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi appoints Oelrich as executive VP at Diabetes & Cardiovascular arm "
    },
    {
        "content": "* Appellate Court orders a new trial and vacates permanent injunction in ongoing patent case regarding Praluent® (alirocumab)",
        "date": "10052017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-U.S. Appellate Court rules Sanofi  Regeneron can continue manufacturing PRALUENT in U.S. "
    },
    {
        "content": "Oct 5 A U.S. appeals court has thrown out a ban on sales of Sanofi SA and Regeneron Pharmaceuticals Inc's cholesterol-lowering drug Praluent  in a closely watched case that could have broad implications for drug development.",
        "date": "10052017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "U.S. court reverses ban on sales of Sanofi  Regeneron drug Praluent "
    },
    {
        "content": "* Thermalin announces: collaboration with Sanofi to develop next generation insulin therapies",
        "date": "09282017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Thermalin collaborates with Sanofi to develop insulin therapies "
    },
    {
        "content": "PARIS  Sept 28 The European Commission approved Regeneron Pharmaceuticals' and Sanofi's key biologic treatment dupilumab for moderate-to-severe atopic dermatitis  the two companies said on Thursday.",
        "date": "09282017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "EU approves Sanofi and Regeneron's dupilumab in eczema "
    },
    {
        "content": "PARIS More than three decades after links emerged between Sanofi's epilepsy drug valproate and birth defects  many pregnant women remain unaware of the risks  patients  doctors and researchers said on Tuesday.",
        "date": "09262017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Pregnant women still unaware of epilepsy drug risks: EMA hearing "
    },
    {
        "content": "PARIS  Sept 26 More than three decades after links emerged between Sanofi's epilepsy drug valproate and birth defects  many pregnant women remain unaware of the risks  patients  doctors and researchers said on Tuesday.",
        "date": "09262017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Pregnant women still unaware of epilepsy drug risks - EMA hearing "
    },
    {
        "content": "(The following statement was released by the rating agency) MILAN/LONDON  September 26 (Fitch) Fitch Ratings has affirmed L'Oreal SA's (L'Oreal) Short-Term Issuer Default Rating (IDR) and commercial paper (CP) programme at 'F1+'. The agency has also affirmed L'Oreal USA Inc's CP programme  guaranteed by L'Oreal SA  at 'F1+'. The rating reflects L'Oreal's strong market position as the largest beauty company globally and robust financial profile supported by low leverage and superior financial fle",
        "date": "09262017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Fitch Affirms L'Oreal SA at 'F1+' "
    },
    {
        "content": "* DAX stays near 2-month high before national election (Adds detail  updates prices at close)",
        "date": "09222017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Korea tensions keep European shares in check before Germany vote "
    },
    {
        "content": "* Innovation Health announces pilot program with Sanofi to improve care delivery for people living with type 2 diabetes",
        "date": "09252017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Innovation Health announces pilot program with Sanofi to improve care delivery for people living with type 2 diabetes "
    },
    {
        "content": "* Sanofi and Alnylam report positive topline results from APOLLO phase 3 study of patisiran in Hereditary ATTR (HATTR) amyloidosis patients with polyneuropathy",
        "date": "09202017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Alnylam's genetic disease drug meets main goal in phase 3 study "
    },
    {
        "content": "* SANOFI AWARDS LOGISTICS CONTRACT TO KUEHNE + NAGEL‍​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "09192017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Kuehne und Nagel awarded logistics contract by Sanofi "
    },
    {
        "content": "PARIS The death of billionaire Liliane Bettencourt focused attention on Friday on how L'Oreal's founding family and major shareholder Nestle  would manage their stakes in the world's biggest cosmetics firm. | Video ",
        "date": "09222017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Bettencourt death stirs speculation about L'Oreal ownership "
    },
    {
        "content": "ZURICH  Sept 20 The Swiss blue-chip SMI was seen opening 0.2 percent lower at 9 077 points on Wednesday  according to premarket indications by bank Julius Baer .",
        "date": "09202017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Swiss stocks - Factors to watch on Sept. 20 "
    },
    {
        "content": "* L'Oreal shares outperform  Nestle also up (Adds comment  details of Bettencourt ownership)",
        "date": "09222017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-Bettencourt death stirs speculation about L'Oreal ownership "
    },
    {
        "content": "* Daily blood glucose measures in phase 3 clinical trials demonstrated better stability with Sanofi's toujeo versus insulin glargine 100 units/ml",
        "date": "09132017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Daily blood glucose measures in phase 3 clinical trials showed better stability with Sanofi's toujeo vs insulin glargine 100 units/ml "
    },
    {
        "content": "PARIS  Sept 12 Sanofi's chief executive said that its key drug dupilumab could possibly be used to treat nasal polyps as well as eczema and asthma.",
        "date": "09122017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi indicates dupilumab could be used to treat nasal polyps "
    },
    {
        "content": "PARIS Shares of Regeneron Inc and Sanofi SA slid on Monday after late-stage trial data for their asthma drug  dupilumab  fell short of investor expectations.",
        "date": "09112017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Regeneron  Sanofi asthma drug data fails to excite investors "
    },
    {
        "content": "* Sanofi's soliqua 100/33 provided earlier blood sugar control than insulin glargine 100 units/ml",
        "date": "09122017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi's Soliqua 100/33 provided earlier blood sugar control than insulin glargine 100 units/ml "
    },
    {
        "content": "PARIS  Sept 11 Shares of Regeneron Inc and Sanofi SA slid on Monday after late-stage trial data for their asthma drug  dupilumab  fell short of investor expectations.",
        "date": "09112017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Regeneron  Sanofi asthma drug data fails to excite investors "
    },
    {
        "content": "FRANKFURT/LONDON  Sept 8 Germany's Merck KGaA has hired JP Morgan to sell its consumer health business  which includes brands such as Seven Seas vitamins and could be worth around $4.5 billion.",
        "date": "09112017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "RPT-UPDATE 1-Germany's Merck hires JP Morgan to sell consumer health "
    },
    {
        "content": "* Regeneron and Sanofi announce positive Dupilumab topline results from phase 3 trial in uncontrolled persistent Asthma",
        "date": "09112017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron  Sanofi announce positive Dupilumab topline results from phase 3 trial in uncontrolled persistent Asthma "
    },
    {
        "content": "PARIS  Sept 11 Drugmakers Sanofi and Regeneron announced on Monday positive results for their dupilumab product  which helps  treat allergic inflammation.",
        "date": "09112017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi and Regeneron announce positive dupilumab topline results "
    },
    {
        "content": "* Sanofi  Regeneron: Cemiplimab receives FDA breakthrough designation for advanced cutaneous squamous cell carcinoma",
        "date": "09082017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi  Regeneron say Cemiplimab receives U.S. FDA breakthrough designation for advanced cutaneous squamous cell carcinoma "
    },
    {
        "content": "* Shares rise more than 2 percent (Adds background on consumer health industry)",
        "date": "09052017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-Germany's Merck considers sale of consumer health business "
    },
    {
        "content": "FRANKFURT/LONDON Germany's Merck KGaA has hired JP Morgan to sell its consumer health business  which includes brands such as Seven Seas vitamins and could be worth around $4.5 billion.",
        "date": "09082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Germany's Merck hires JP Morgan to sell consumer health "
    },
    {
        "content": "* Pfizer not interested in more consumer health -source (Adds previous talks with Nestle  deal value)",
        "date": "09082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Germany's Merck hires JP Morgan to sell consumer health "
    },
    {
        "content": "* Sanofi-‍as disclosed by Alnylam  fatal thrombotic event occurred in patient with hemophilia without inhibitors enrolled in Phase 2 OLE study of fitusiran​ Source text for Eikon: Further company coverage:",
        "date": "09072017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi alliance partner Alnylam gives update on fitusiran "
    },
    {
        "content": "Sept 7 Quest Diagnostics Inc said on Thursday it will begin using a more precise method of calculating levels of \"bad\" LDL cholesterol that no longer requires fasting prior to blood draw  a development likely to delight patients who previously had to refrain from eating for up to 12 hours before testing.",
        "date": "09072017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Quest to offer cholesterol testing without fasting requirement "
    },
    {
        "content": "* Sanofi receives tentative FDA approval of Admelog® (insulin lispro injection) 100 units/ml",
        "date": "09012017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi says receives tentative FDA approval of Admelog "
    },
    {
        "content": "* Completed the acquisition of Protein Sciences  a vaccines biotechnology company based in Meriden  Connecticut in the United States",
        "date": "08282017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi completes the acquisition of Protein Sciences "
    },
    {
        "content": "* Paulson & Co Inc cuts share stake in Teva Pharmaceutical Industries Ltd  by 38.7 percent to 6.7 million sponsored ADR - SEC filing",
        "date": "08142017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Paulson & Co cuts share stake in Teva Pharmaceutical  Sanofi "
    },
    {
        "content": "* Sanofi files suit in the U.S. to defend its patent rights on Lantus",
        "date": "08082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi files suit in U.S. to defend patent rights on Lantus "
    },
    {
        "content": "LONDON  Aug 8 The science of gene therapy is finally delivering on its potential  and drugmakers are now hoping to produce commercially viable medicines after tiny sales for the first two such treatments in Europe.",
        "date": "08082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Drugmakers' hopes for gene therapy rise despite tiny sales in Europe "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc reported a much better-than-expected quarterly profit on strong demand for its flagship Eylea drug and said it would end one of its agreements with France's Sanofi SA to develop antibodies by the end of the year.",
        "date": "08032017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Regeneron beats profit view  to end antibody deal with Sanofi "
    },
    {
        "content": "* Shares close down 2 pct on plans to scrap antibody deal (Adds details about Sanofi antibody deal  Sanofi and analyst comments  updates shares)",
        "date": "08032017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 4-Regeneron beats profit view  to end antibody deal with Sanofi "
    },
    {
        "content": "* Sanofi Genzyme says PEI Pharmacare has added Lemtrada to pharmacare formulary Source text for Eikon: Further company coverage:",
        "date": "08012017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi genzyme says PEI Pharmacare has added Lemtrada to pharmacare formulary "
    },
    {
        "content": "* SAID ON MONDAY IT STRENGTHENS RELATIONSHIP WITH EVIDATION HEALTH Source text: http://bit.ly/2vj4M2W Further company coverage: (Gdynia Newsroom)",
        "date": "08012017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi strengthens relationship with Evidation Health "
    },
    {
        "content": "* Lexicon Pharmaceuticals announces opt-in decision for u.s. Co-Promotion of sotagliflozin with Sanofi in type 1 diabetes",
        "date": "07312017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Lexicon Pharmaceuticals reports opt-in decision for U.S. co-promotion of sotagliflozin with Sanofi in type 1 diabetes "
    },
    {
        "content": "PARIS Sanofi  raised its 2017 earnings forecast on the back of strong growth in the second quarter but investors were disappointed with sales of key new eczema drug Dupixent  developed with U.S partner Regeneron Pharmaceuticals .",
        "date": "07312017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi raises outlook but key eczema drug disappoints investors "
    },
    {
        "content": "* Sanofi sees \"broadly stable\" 2017 earnings (Adds details  comments)",
        "date": "07312017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-Sanofi raises outlook but key eczema drug disappoints investors "
    },
    {
        "content": "PARIS  July 31 French drugmaker Sanofi raised its 2017 outlook on the back of strong growth at its consumer healthcare  vaccines and genzyme arms in the second quarter  and said it was encouraged by the uptake of a key eczema drug in the United States.",
        "date": "07312017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Drugmaker Sanofi raises outlook after strong Q2 sales growth "
    },
    {
        "content": "* L'Oreal strikes upbeat note over outlook (Adds detail  background)",
        "date": "07272017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-L'Oreal eyes record margins as H1 profits rise "
    },
    {
        "content": " (In this July 20 story  corrects to \"follow-on biologic\" from \"biosimilar\" in paragraphs 1  6 and 9; removes reference to \"biosimilar\" throughout the story.)",
        "date": "07242017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "FDA tentatively approves Merck's copycat of Sanofi's Lantus "
    },
    {
        "content": "July 20 Merck and Co Inc said on Thursday the U.S. Food and Drug Administration (FDA) tentatively approved its follow-on biologic version of French drugmaker Sanofi SA's blockbuster diabetes treatment  Lantus.",
        "date": "07242017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-FDA tentatively approves Merck's copycat of Sanofi's Lantus (July 20) "
    },
    {
        "content": "LONDON  July 21 The European Medicines Agency on Friday recommended approval of  Regeneron Pharmaceuticals and Sanofi's new drug Dupixent for atopic dermatitis  a product many analysts see as the most important growth driver for the two companies.",
        "date": "07212017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "EU follows U.S. in backing Sanofi  Regeneron eczema drug "
    },
    {
        "content": "* Havas CEO Yannick Bollore told reporters during a media lunch that he felt Havas was likely to keep the advertising budget for drugmaker Sanofi.",
        "date": "07182017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Havas CEO says company likely to keep Sanofi budget "
    },
    {
        "content": "Merck and Co Inc said on Thursday the U.S. Food and Drug Administration (FDA) tentatively approved its biosimilar version of French drugmaker Sanofi SA's blockbuster diabetes treatment  Lantus.",
        "date": "07202017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "FDA tentatively approves Merck's copycat of Sanofi's Lantus "
    },
    {
        "content": "French drugmaker Sanofi boosted its early-stage pipeline in immunology on Thursday by signing a deal with Ablynx that could earn the Belgian biotech firm as much as 2.4 billion euros ($2.8 billion).",
        "date": "07202017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Ablynx signs Sanofi deal potentially worth up to $2.8 billion "
    },
    {
        "content": "July 20 French drugmaker Sanofi boosted its early-stage pipeline in immunology on Thursday by signing a deal with Ablynx that could earn the Belgian biotech firm as much as 2.4 billion euros ($2.8 billion).",
        "date": "07202017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Ablynx signs Sanofi deal potentially worth up to $2.8 bln "
    },
    {
        "content": "* Emergent Biosolutions updates on terms of any termination of agreement related to acquisition of acam2000 business from Sanofi",
        "date": "07142017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Emergent Biosolutions updates terms of termination of agreement related to acquisition of Sanofi's acam2000 business "
    },
    {
        "content": "* Emergent biosolutions to acquire acam2000® business from sanofi",
        "date": "07142017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Emergent BioSolutions to acquire ACAM2000 business from Sanofi "
    },
    {
        "content": "* Alnylam and Sanofi Genzyme report positive results from ongoing phase 2 open-label extension study with investigational RNAI therapeutic Fitusiran in patients with hemophilia A and B with or without inhibitors",
        "date": "07102017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Alnylam Pharmaceuticals and Sanofi Genzyme report positive results from ongoing phase 2 open-label extension study "
    },
    {
        "content": "* Alnylam and Sanofi Genzyme initiate ATLAS phase 3 program with investigational RNAi therapeutic fitusiran",
        "date": "07072017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Alnylam and Sanofi Genzyme initiate ATLAS Phase 3 program with investigational RNAi therapeutic fitusiran "
    },
    {
        "content": "A New Jersey federal judge has narrowed a lawsuit filed by Sanofi SA accusing Novo Nordisk of falsely claiming that Sanofi's insulin drugs would no longer be available to many U.S. patients so that it could promote its competing drug.",
        "date": "07112017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi lawsuit over Novo Nordisk diabetes drug marketing narrowed "
    },
    {
        "content": "July 11 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "07112017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Deals of the day-Total  Rent-A-Center  Halcon  Fosun "
    },
    {
        "content": "July 11 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "07112017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "French and Benelux stocks-Factors to watch on July 11 "
    },
    {
        "content": "PARIS  July 11 French drugmaker and healthcare group Sanofi is to buy privately-held U.S vaccines biotech company Protein Sciences for an initial amount of $650 million  as Sanofi steps up its acquisition programme after recently missing two large deals.",
        "date": "07112017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi to buy vaccines biotech group Protein Sciences "
    },
    {
        "content": "* Sanofi and Regeneron announce approval of Kevzara(®) (sarilumab) to treat adult patients with moderately to severely active rheumatoid arthritis in the European Union",
        "date": "06272017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi and Regeneron announce EU approval for Kevzara "
    },
    {
        "content": "FRANKFURT  June 23 Germany's Merck KGaA has won a key recommendation to become a late entrant to the market for oral multiple sclerosis (MS) drugs in Europe  six years after its first attempt to launch the cladribine pill failed.",
        "date": "06242017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-Germany's Merck gets EU backing for oral MS drug "
    },
    {
        "content": "* Rosa & Co announces renewal of multi-year research agreement with Sanofi",
        "date": "06202017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Rosa & Co announces renewal of multi-yr research agreement with Sanofi "
    },
    {
        "content": "PARIS  June 16      The U.S Supreme Court decision to speed access to copycat biologics drugs on Monday was expected but has an \"immediate impact\"  Sanofi Chief Executive told Reuters.",
        "date": "06162017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi chief says U.S. Supreme Court ruling on biologics has \"immediate impact\" "
    },
    {
        "content": "* Parexel collaborates with Sanofi to advance the use of wearable devices in life science industry",
        "date": "06152017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Parexel collaborates with Sanofi to advance use of wearable devices in life science industry "
    },
    {
        "content": "PARIS  June 14 French drugmaker and healthcare group Sanofi on Wednesday announced plans to invest 600 million euros ($673 million) annually over the next two to three years in the field of biologics  seen as an area with a strong growth potential.",
        "date": "06142017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi to invest further in biologics "
    },
    {
        "content": "* plans annual spending of 600 mln eur in biotechnology production",
        "date": "06142017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi to invest further in biologics "
    },
    {
        "content": "PARIS  June 11 France's Sanofi and partner Regeneron Pharmaceuticals said on Sunday their anti-cholesterol drug Praluent recorded positive results in its first dedicated studies involving patients with diabetes and high cholesterol.",
        "date": "06112017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi-Regeneron's Praluent cuts cholesterol in Odyssey trials "
    },
    {
        "content": "* Immunogen - co  affiliate of Sanofi have amended their license agreements covering all compounds in development by sanofi using Immunogen's technology",
        "date": "05302017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Immunogen and Sanofi amend license agreements "
    },
    {
        "content": "May 22 The U.S. Food and Drug Administration approved Regeneron Pharmaceuticals Inc and Sanofi SA's biotech drug for adults with moderate to severe rheumatoid arthritis  the two companies said on Monday.",
        "date": "05222017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 1-Regeneron  Sanofi rheumatoid arthritis drug wins U.S. approval "
    },
    {
        "content": "* REG-SANOFI RECEIVES CHMP RECOMMENDATION FOR APPROVAL OF INSULIN LISPRO BIOSIMILAR",
        "date": "05192017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi receives CHMP recommendation for approval of insulin lispro biosimilar "
    },
    {
        "content": "May 22 The U.S. Food and Drug Administration approved Regeneron Pharmaceuticals and Sanofi's biotech drug for adults with moderate to severe rheumatoid arthritis  the two companies said on Monday.",
        "date": "05222017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Regeneron  Sanofi rheumatoid arthritis drug wins U.S. approval "
    },
    {
        "content": "* Regeneron and sanofi announce fda approval of kevzara® (sarilumab) for the treatment of moderately to severely active rheumatoid arthritis in adult patients",
        "date": "05222017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron  Sanofi RA drug wins FDA nod; co's price it at $39 000/patient/yr "
    },
    {
        "content": "PARIS  May 10 Sanofi is currently looking at several external growth opportunities  after having failed to clinch two large deals recently  but feels it has no urgent need to make acquisitions  the drugmaker's chairman told shareholders on Wednesday.",
        "date": "05102017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi says has no \"absolute need\" to do acquisitions "
    },
    {
        "content": "PARIS Sanofi  is currently looking at several external growth opportunities  after having failed to clinch two large deals recently  but feels it has no urgent need to make acquisitions  the drugmaker's chairman told shareholders on Wednesday.",
        "date": "05102017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi says has no 'absolute need' to do acquisitions "
    },
    {
        "content": "PARIS  May 10 Sanofi is currently looking at several external growth opportunities  after having failed to clinch two large deals recently  but feels it has no urgent need to make acquisitions  the drugmaker's chairman told shareholders on Wednesday.",
        "date": "05102017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi says has no \"absolute need\" to do acquisitions "
    },
    {
        "content": "Sanofi SA and Regeneron Pharmaceuticals Inc are citing a little-noticed federal appeals court ruling in a patent dispute over LED lights last month to bolster their own appeal of a court order banning sales of their cholesterol drug Praluent.",
        "date": "05082017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi  Regeneron hope LED case will shine a light on Praluent injunction appeal "
    },
    {
        "content": "* Regeneron and Sillajen announce immuno-oncology clinical study agreement for combination treatment in kidney cancer",
        "date": "05082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and Sillajen report immuno-oncology clinical study agreement "
    },
    {
        "content": "French drugmaker Sanofi  has pledged to peg U.S. drug price rises to below healthcare inflation in a move that limits increases for any product this year to 5.4 percent  unless there are exceptional circumstances.",
        "date": "05092017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi pegs U.S. drug price rises to below healthcare inflation "
    },
    {
        "content": "PARIS Sanofi  has given up on the possibility of selling its chemical unit Cepia  a spokeswoman with the French drugmaker said on Friday.",
        "date": "05052017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi decides against selling chemical unit Cepia: spokeswoman "
    },
    {
        "content": "* Regeneron Pharmaceuticals says over 3 500 new prescriptions have been written for Dupixent  which translates into over 900 prescriptions : Conf Call",
        "date": "05042017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron says over 3 500 new prescriptions been written for Dupixent "
    },
    {
        "content": "PARIS  May 5 Sanofi has given up on the possibility of selling its chemical unit Cepia  a spokeswoman with the French drugmaker said on Friday.",
        "date": "05052017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi decides against selling chemical unit Cepia -spokeswoman "
    },
    {
        "content": "May 4 Regeneron Pharmaceuticals Inc said its eczema drug Dupixent was off to a strong start and the biotech stood by its full-year sales forecast for its flagship drug Eylea even as competition heats up.",
        "date": "05042017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 4-As Eylea fears fade  focus turns to Regeneron's eczema drug "
    },
    {
        "content": "* More transparency on gross and net prices in U.S. (Adds projection for NHE inflation rate  detail on Sanofi drugs)",
        "date": "05092017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi pegs U.S. drug price rises to below healthcare inflation "
    },
    {
        "content": "May 9 French drugmaker Sanofi said on Tuesday it would peg U.S. drug price rises to below healthcare inflation in a move limiting price increases for any given product this year to 5.4 percent  barring exceptional circumstances.",
        "date": "05092017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi pegs U.S. price increases to below healthcare inflation "
    },
    {
        "content": "LONDON  May 5 Over €20bn of leveraged loans from 25 deals could hit Europe’s leveraged loan market in the coming months as the pipeline of buyouts gathers pace  offering bankers the lucrative underwriting they’ve been waiting for and investors the chance to put new money to work.",
        "date": "05052017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "LPC-Buyouts fuel Europe's leveraged loan pipeline "
    },
    {
        "content": "May 4 Regeneron Pharmaceuticals Inc stood by its full-year sales forecast for its flagship drug Eylea and said the early adoption of its eczema drug Dupixent was encouraging  easing concerns about the company's reliance on Eylea as competition heats up.",
        "date": "05042017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-UPDATE 3-As Eylea fears fade  focus turns to Regeneron's eczema drug "
    },
    {
        "content": "* Exscientia announces 250 mln euro collaboration for a multiple-product development and licence option agreement with Sanofi Further company coverage: (Bengaluru Newsroom)",
        "date": "05092017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Frontier IP announces 250 mln euro licence option agreement with Sanofi "
    },
    {
        "content": "May 4 Regeneron Pharmaceuticals Inc reported a 37.2 percent increase in first-quarter profit  driven by higher demand for its flagship eye drug Eylea.",
        "date": "05042017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Biotech Regeneron's profit jumps 37 pct on higher Eylea sales "
    },
    {
        "content": "* Sanofi genzyme announces approval of cerdelga (eliglustat capsules) by health canada for rare genetic condition Source text for Eikon: Further company coverage:",
        "date": "05012017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi Genzyme announces approval of Cerdelga by Health Canada for rare genetic condition "
    },
    {
        "content": "A federal appeals court on Tuesday revived a Utah woman's lawsuit accusing Sanofi SA of failing to warn about the risks its infertility drug Clomid posed to fetuses but said some of her claims were preempted by federal law.",
        "date": "05022017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Utah woman's lawsuit over Clomid pregnancy risks revived "
    },
    {
        "content": "PARIS  April 28 French drugmaker Sanofi's profit beat forecasts in the first quarter and confirmed its earnings outlook for the year  lifting its shares on Friday.",
        "date": "04282017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi beats profit forecasts  upbeat on prospects for eczema drug "
    },
    {
        "content": "* Regeneron and Sanofi announce FDA approval of a new once-monthly dosing option for Praluent (Alirocumab) injection",
        "date": "04252017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron says FDA approved for praluent injection "
    },
    {
        "content": "* Regeneron and Sanofi announce Kevzara® (sarilumab) Biologics License Application resubmission accepted for review by U.S. FDA",
        "date": "04282017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and Sanofi announce Kevzara license application resubmission for review by FDA "
    },
    {
        "content": "* Sanofi genzyme - announced positive new six-year investigational data from post-hoc analysis of extension study of lemtrada (alemtuzumab)",
        "date": "04252017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi Genzyme announces positive new six-year data from analysis of lemtrada "
    },
    {
        "content": "* Sanofi and Regeneron announce FDA approval of a new once-monthly dosing option for Praluent (alirocumab) injection",
        "date": "04252017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi and Regeneron announce FDA approval of a once-monthly dosing option for Praluent "
    },
    {
        "content": "April 24 Sanofi SA on Monday sued Mylan NV  accusing the pharmaceutical company of engaging in illegal conduct to squelch competition to its EpiPen allergy treatment  which has been at the center of a public debate over drug prices.",
        "date": "04242017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi files U.S. antitrust lawsuit against Mylan over EpiPen "
    },
    {
        "content": "April 24 France's Sanofi SA on Monday sued Mylan NV  accusing the pharmaceutical company of engaging in illegal conduct to squelch competition to its EpiPen allergy treatment  which has been at the center of a public debate over drug prices.",
        "date": "04242017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi files U.S. antitrust lawsuit against Mylan over EpiPen "
    },
    {
        "content": "April 21 A European Medicines Agency panel said on Friday it recommended granting marketing approval to Sanofi and Regeneron's experimental drug to treat rheumatoid arthritis.",
        "date": "04212017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "EMA panel recommends nod for Sanofi  Regeneron's arthritis drug "
    },
    {
        "content": "* EU Medicines Agency recommends approval granting of a marketing authorisation for Sandoz's Rixathon Non-Hodgkin's Lymphoma (NHL)  chronic lymphocytic leukaemia",
        "date": "04212017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-EU Medicines Agency recommendations for April 2017 "
    },
    {
        "content": "* Actis portfolio company MédiS group announces the acquisition of Winthrop Pharma Senegal from Sanofi",
        "date": "04192017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Actis portfolio company MédiS Group announces acquisition of Winthrop Pharma Senegal from Sanofi "
    },
    {
        "content": "PARIS Up to 4 100 children in France suffered major malformations in the womb after their mothers took a treatment against epilepsy and bipolar disorders known as valproate between 1967 and 2016  France's drug regulator said.",
        "date": "04202017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Regulator links Sanofi epilepsy drug to child deformities "
    },
    {
        "content": "April 20 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "04202017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "PARIS  April 20 Up to 4 100 children in France suffered major malformations in the womb after their mothers took a treatment against epilepsy and bipolar disorders known as valproate between 1967 and 2016  France's drug regulator said.",
        "date": "04202017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Regulator links Sanofi epilepsy drug to child deformities "
    },
    {
        "content": "FRANKFURT  April 20 Sanofi is looking at potential acquisitions of devices  such as blood glucose testing kits  to boost its diabetes business  a senior executive at the French drugmaker said on Thursday.",
        "date": "04202017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi says could buy device assets to boost diabetes "
    },
    {
        "content": "LONDON Banks are preparing debt packages of up to €500m to back a potential sale of French drug maker Sanofi’s European contract manufacturer business Cepia  banking sources said on Thursday.",
        "date": "04062017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Bankers prepare 500 million euros of debt as Sanofi lines up Cepia sale "
    },
    {
        "content": "LONDON  April 6 Banks are preparing debt packages of up to €500m to back a potential sale of French drug maker Sanofi’s European contract manufacturer business Cepia  banking sources said on Thursday.",
        "date": "04062017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "LPC-Bankers prepare €500m of debt as Sanofi lines up Cepia sale "
    },
    {
        "content": "WASHINGTON Sanofi SA 's Sanofi-Pasteur unit has agreed to pay $19.8 million to resolve claims that it overcharged the U.S. Department of Veterans Affairs for medications between 2002 and 2011  U.S. Justice officials said on Monday.",
        "date": "04032017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi to pay $19.8 million over claims of drug overcharges: U.S. "
    },
    {
        "content": "* Appoints Bill Sibold as Executive Vice President Sanofi Genzyme  effective July 1  2017",
        "date": "04052017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi appoints Bill Sibold as executive vice president for Sanofi Genzyme "
    },
    {
        "content": "WASHINGTON  April 3 Sanofi SA's Sanofi-Pasteur unit has agreed to pay $19.8 million to resolve claims that it overcharged the U.S. Department of Veterans Affairs for medications between 2002 and 2011  U.S. Justice officials said on Monday.",
        "date": "04032017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi to pay $19.8 mln over claims of drug overcharges -U.S. "
    },
    {
        "content": "WASHINGTON  April 3 Sanofi SA's Sanofi-Pasteur unit has agreed to pay $19.8 million to resolve claims that it overcharged the U.S. Department of Veterans Affairs for medications between 2002 and 2011  U.S. Justice officials said on Monday.",
        "date": "04032017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi to pay $19.8 mln over claims of drug overcharges  U.S. says "
    },
    {
        "content": "INGELHEIM  Germany  April 5 Boehringer Ingelheim  Germany's second-largest drugmaker  said on Wednesday it was targeting a marked gain in 2017 revenues  boosted by new animal health businesses it acquired from Sanofi.",
        "date": "04052017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Boehringer eyes marked sales gain  boosted by animal health "
    },
    {
        "content": "* Says achieves first milestone in diabetes alliance with sanofi",
        "date": "04052017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Evotec achieves first milestone in diabetes alliance with Sanofi "
    },
    {
        "content": "FRANKFURT/LONDON French drug maker Sanofi  has hired advisers for the sale of its European generic drug business  several sources familiar with matter told Reuters  ahead of an auction process which is expected to start after the European summer.",
        "date": "03292017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi hires advisors for European generic drugs unit sale: sources "
    },
    {
        "content": "FRANKFURT/LONDON  March 29 French drug maker Sanofi has hired advisers for the sale of its European generic drug business  several sources familiar with matter told Reuters  ahead of an auction process which is expected to start after the European summer.",
        "date": "03292017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi hires advisors for European generic drugs unit sale -sources "
    },
    {
        "content": "LONDON  March 23 Three of Europe's top drugmakers face critical verdicts from U.S. regulators next week  with Sanofi and Roche likely to win approvals for two new products  while GlaxoSmithKline braces for a potential generic rival.",
        "date": "03232017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Crunch week looms for Sanofi  Roche and GSK at U.S. drugs agency "
    },
    {
        "content": "The U.S. Food and Drug Administration on Tuesday approved Regeneron Pharmaceuticals Inc and Sanofi SA's  drug for moderate-to-severe atopic dermatitis  a product widely seen as the most important future growth driver for the two companies.",
        "date": "03282017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "FDA approves Regeneron  Sanofi $37 000 per year eczema drug "
    },
    {
        "content": "March 28 The U.S. Food and Drug Administration on Tuesday approved Regeneron Pharmaceuticals Inc and Sanofi SA's  drug for moderate-to-severe atopic dermatitis  a product widely seen as the most important growth driver for the two companies.",
        "date": "03282017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-FDA approves Regeneron  Sanofi $37 000 per year eczema drug "
    },
    {
        "content": "* Reacquires Stendra(R) (Avanafil) commercial rights from Sanofi",
        "date": "03272017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Vivus reacquires Stendra(R)(AVANAFIL)commercial rights from Sanofi "
    },
    {
        "content": "* Regeneron and Sanofi announce FDA approval of Dupixent® (Dupilumab)  the first targeted biologic therapy for adults with moderate-to-severe atopic dermatitis",
        "date": "03282017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and Sanofi announce FDA approval of Dupixent "
    },
    {
        "content": "* Says U.S. list price of newly approved Dupixent atopic dermatitis drug $37 000 per patient per yearFurther company coverage:    (Reporting by Ben Hirschler)",
        "date": "03282017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-U.S. list price for Sanofi  Regeneron's Dupixent $37 000 "
    },
    {
        "content": "* Sanofi genzyme extends its multiple myeloma journey partners program to cities nationwide to help improve patient outcomes through peer-to-peer education  Source text for Eikon:  Further company coverage:",
        "date": "03222017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi genzyme extends its multiple myeloma journey partners program "
    },
    {
        "content": "BOSTON  March 21 Sanofi SA and Regeneron Pharmaceuticals Inc filed a lawsuit seeking a court order declaring that their eczema drug Dupixent  awaiting a U.S. approval decision  does not infringe an Amgen Inc  patent for a failed asthma treatment.",
        "date": "03212017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Regeneron sue Amgen to protect eczema drug from patent claims "
    },
    {
        "content": "March 28 The U.S. Food and Drug Administration on Tuesday approved Regeneron Pharmaceuticals Inc and Sanofi SA's  Dupixent for treatment of moderate to severe atopic dermatitis  a product widely seen as the most important future growth driver for the two companies.",
        "date": "03282017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "FDA approves Regeneron  Sanofi eczema drug "
    },
    {
        "content": "BOSTON  March 21 Sanofi SA and Regeneron Pharmaceuticals Inc have filed a lawsuit seeking a court order declaring that their eczema drug Dupixent  awaiting a U.S. approval decision  does not infringe an Amgen Inc patent for a failed asthma treatment.",
        "date": "03212017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi  Regeneron sue Amgen to protect eczema drug from patent claims "
    },
    {
        "content": "LONDON  March 14 Sanofi has won an early green light from Britain for its game-changing eczema medicine  boosting the French company's hopes for a product that is also expected to win approval in the U.S. market this month.",
        "date": "03142017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UK gives early green light to Sanofi eczema drug "
    },
    {
        "content": "LONDON/FRANKFURT French drug maker Sanofi  is looking to hire advisers for the sale of its European generic drug business by the end of the month  sources told Reuters  ahead of an auction process which is set to start after the summer.",
        "date": "03082017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi gears up for European generic drugs unit sale: sources "
    },
    {
        "content": "LONDON/FRANKFURT  March 8 French drug maker Sanofi is looking to hire advisers for the sale of its European generic drug business by the end of the month  sources told Reuters  ahead of an auction process which is set to start after the summer.",
        "date": "03082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi gears up for European generic drugs unit sale - sources "
    },
    {
        "content": "LONDON/FRANKFURT  March 8 French drug maker Sanofi is looking to hire advisers for the sale of its European generic drug business by the end of March  sources told Reuters  ahead of an auction process which is set to start after the summer.",
        "date": "03082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi gears up for European generic drugs unit sale - sources "
    },
    {
        "content": "* Regeneron and Sanofi to present new phase 3 praluent (alirocumab) injection clinical trial analyses at ACC.17 Scientific Sessions",
        "date": "03072017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and Sanofi to present new phase 3 praluent (alirocumab) injection clinical trial analyses at ACC.17 Scientific Sessions "
    },
    {
        "content": "PARIS  March 4 Drugmakers Sanofi and Regeneron said on Saturday results from a one-year test of their Dupixent product aimed at adults with eczema or moderate-to-severe atopic dermatitis (AD) had been positive.",
        "date": "03042017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Regeneron say latest Dupixent eczema drug tests positive "
    },
    {
        "content": "* Medi8897 is a monoclonal antibody (mab) for prevention of lower respiratory tract illness (lrti) caused by respiratory syncytial virus",
        "date": "03032017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-AstraZeneca ties up with Sanofi on respiratory drug "
    },
    {
        "content": "PARIS  March 3 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "03032017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "French and Benelux stocks-Factors to watch on March 3 "
    },
    {
        "content": "* Sanofi Genzyme - kevzara now available in Canada for treatment of adult patients with moderately to severely active rheumatoid arthritis  Source text for Eikon:  Further company coverage:",
        "date": "02282017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi Genzyme says kevzara now available in Canada for treatment of adult patients with moderately to severely active rheumatoid arthritis "
    },
    {
        "content": "PARIS French drugmaker Sanofi and Swiss manufacturer Lonza will invest 270 million euros ($285 million) in a new large-scale biologics facility that will produce monoclonal antibodies by 2020  the two companies said on Monday.",
        "date": "02272017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi and Lonza to build new $285 million Swiss biologics facility "
    },
    {
        "content": "PARIS  Feb 27 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "02272017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "French and Benelux stocks-Factors to watch on Monday Feb 27 "
    },
    {
        "content": "PARIS  Feb 27 French drugmaker Sanofi and Swiss manufacturer Lonza will invest 270 million euros ($285 million) in a new large-scale biologics facility that will produce monoclonal antibodies by 2020  the two companies said on Monday.",
        "date": "02272017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi and Lonza to build new $285 mln Swiss biologics facility "
    },
    {
        "content": "PARIS  Feb 27 French drugmaker Sanofi and Switzerland's Lonza will invest 270 million euros ($285 million) to build a large-scale biologics facility that will produce monoclonal antibodies by 2020  the two companies said on Monday.",
        "date": "02272017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi and Lonza to build biologics facility in Switzerland "
    },
    {
        "content": "* U.S. FTC - Approved final order settling charges that Boehringer Ingelheim’s $13.53 billion asset swap with Sanofi would likely be anticompetitive  Source text : (http://bit.ly/2lC10ws) Further company coverage:",
        "date": "02242017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-FTC approves final order settling charges for Boehringer Ingelheim’s asset swap with Sanofi "
    },
    {
        "content": "Seniors' advocacy group AARP and drugmaker Eli Lilly & Co on Thursday urged a federal appeals court to overturn a court order barring sales of Sanofi SA and Regeneron Pharmaceuticals Inc's cholesterol drug Praluent.",
        "date": "02242017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "AARP  Eli Lilly support Sanofi  Regeneron in cholesterol drug fight "
    },
    {
        "content": "* J&J's $280 per share tender offer to start March 3   (Recasts with rival offer  adds background throughout)",
        "date": "02162017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 2-How Sanofi lost out to J&J in $30 bln battle for Actelion "
    },
    {
        "content": "* Ipsen to acquire a portfolio of select consumer healthcare products from Sanofi",
        "date": "02132017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Ipsen acquires a portfolio of select consumer healthcare products from Sanofi "
    },
    {
        "content": "PARIS Drugmaker Ipsen  has agreed to buy five consumer healthcare products from bigger French rival Sanofi  for 83 million euros ($88 million)  in a deal which Ipsen said should boost its profits.",
        "date": "02132017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Drugmaker Ipsen to buy some products from Sanofi for 83 million euros "
    },
    {
        "content": "PARIS  Feb 13 Drugmaker Ipsen has agreed to buy five consumer healthcare products from bigger French rival Sanofi for 83 million euros ($88 million)  in a deal which Ipsen said should boost its profits.",
        "date": "02132017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Drugmaker Ipsen to buy some products from Sanofi for 83 mln euros "
    },
    {
        "content": "Feb 12 Drugmaker Sanofi is close to selling some over-the-counter products to Ipsen SA  in a deal that could be valued at nearly 100 million euros ($106.18 million)  Bloomberg reported.",
        "date": "02132017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi nears deal to sell some over-the-counter drugs to Ipsen - Bloomberg "
    },
    {
        "content": "* Sanofi nearing agreement to sell some over-the-counter products to Ipsen; deal may be announced as soon as Monday- Bloomberg  citing source",
        "date": "02132017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi nearing deal to sell some over-the-counter products to Ipsen for about 100 mln euros- Bloomberg  citing source "
    },
    {
        "content": "A U.S. appeals court on Wednesday stayed an order that would have blocked Regeneron Pharmaceuticals Inc and Sanofi SA from selling their cholesterol drug  Praluent  while they appeal the order.",
        "date": "02082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Regeneron  Sanofi win stay of U.S. order blocking cholesterol drug sales "
    },
    {
        "content": "Feb 8 A U.S. appeals court on Wednesday stayed an order that would have blocked Regeneron Pharmaceuticals Inc  and Sanofi SA from selling their cholesterol drug  Praluent  while they appeal the order.",
        "date": "02082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Regeneron  Sanofi win stay of U.S. order blocking cholesterol drug sales "
    },
    {
        "content": "Feb 8 A U.S. appeals court on Wednesday has stayed an order that would have blocked Regeneron Pharmaceuticals Inc and Sanofi SA from selling their cholesterol drug  Praluent  later this month while they appeal.",
        "date": "02082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Regeneron  Sanofi win stay of order blocking cholesterol drug sales "
    },
    {
        "content": "* CEO says has made no provisions regarding class action launched in France over anti-epilepsy drug Depakine",
        "date": "02082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi CEO says believes group has fulfilled information obligations on Depakine "
    },
    {
        "content": "PARIS France's biggest drugmaker  Sanofi   which missed out to Johnson & Johnson  on buying Actelion  last month  said it was no rush to do deals as it forecast stable or slightly lower 2017 earnings.",
        "date": "02082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Drugmaker Sanofi in no hurry for deals as signals stable 2017 "
    },
    {
        "content": "* CEO says there is no \"Plan B\" regarding anti cholesterol drug Praluent",
        "date": "02082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi CEO: no \"Plan B\" regarding anti cholesterol drug Praluent "
    },
    {
        "content": "PARIS  Feb 8 France's biggest drugmaker  Sanofi   which missed out to Johnson & Johnson on buying Actelion last month  said it was no rush to do deals as it forecast stable or slightly lower 2017 earnings.",
        "date": "02082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Drugmaker Sanofi in no hurry for deals as signals stable 2017 "
    },
    {
        "content": "* Royalty revenue from Sanofi's sales of Lyxumia (lixisenatide) outside the United states of 5.3 million Danish crowns ($760 849)/0.7 million euros ($747 040.00) for Q4 2016",
        "date": "02082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma royalty revenue of DKK 5.3 mln in Q4 on sales of Lyxumia "
    },
    {
        "content": "PARIS  Feb 8 Sanofi  France's largest drugmaker  said it expected 2017 earnings per share to be stable or slightly lower after its fourth quarter results were affected by an increase in taxes and one-off charges.",
        "date": "02082017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Drugmaker Sanofi sees possibility of lower earnings in 2017 "
    },
    {
        "content": "* Regeneron reports fourth quarter and full year 2016 financial and operating results",
        "date": "02092017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron posts Q4 adj. profit $3.04/shr "
    },
    {
        "content": "* Shares rise as much as 4 pct   (Adds conference call details; updates shares)",
        "date": "02092017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-Regeneron pins hope on eczema drug as Eylea sales slow "
    },
    {
        "content": "Feb 9 Regeneron Pharmaceuticals Inc  reported an 11.7 percent rise in quarterly revenue on Thursday  helped by higher demand for its flagship eye drug Eylea.",
        "date": "02092017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Regeneron revenue rises 11.7 pct on Eylea eye drug "
    },
    {
        "content": "FRANKFURT  Feb 3 German consumer-goods group Beiersdorf has appointed former Sanofi  manager Vincent Warnery to a new position on its board overseeing the Eucerin skincare  La Prairie anti-ageing and Hansaplast woundcare brands.",
        "date": "02032017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Beiersdorf appoints new board member to help drive brand agenda "
    },
    {
        "content": "Feb 2 Amgen Inc said its potent cholesterol fighter Repatha significantly reduced the risk of heart attacks  strokes and death in patients with heart disease  according to initial results of a large  eagerly-anticipated trial released on Thursday.",
        "date": "02022017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Amgen cholesterol drug succeeds in cutting serious heart problems -study "
    },
    {
        "content": "* Sanofi's Xyzal\u007f allergy 24hr approved for over-the-counter use in the United States  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi's Xyzal allergy 24hr approved for over-the-counter use in U.S. "
    },
    {
        "content": "* Sanofi pasteur announces the availability of quadracel\u007f dtap-ipv vaccine for children 4 through 6 years of age in the u.s.",
        "date": "01312017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi Pasteur announces availability of quadracel dtap-ipv vaccine "
    },
    {
        "content": "NEW YORK  Jan 30 Three of the biggest makers of diabetes treatments  Sanofi SA  Novo Nordisk  and Eli Lilly & Co  were named in a class action lawsuit about price fixing filed by a group of patients.",
        "date": "01302017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Novo Nordisk and Lilly named in patients' price fixing suit "
    },
    {
        "content": "* Says U.S. Food and Drug Administration (FDA) approved Xyzal(\u007f) Allergy 24HR as an over-the-counter (OTC) treatment for the relief of symptoms associated with seasonal and year-round allergies",
        "date": "02012017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi's Xyzal\u007f Allergy 24HR approved for over-the-counter use in United States "
    },
    {
        "content": "* Sanofi and Regeneron Pharmaceuticals  Inc. today announced that Health Canada approved Kevzara(TM)",
        "date": "02012017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi and Regeneron announce first approval of Kevzara "
    },
    {
        "content": "NEW YORK  Jan 30 Three of the biggest makers of diabetes treatments  Sanofi SA  Novo Nordisk  and Eli Lilly & Co  were named in a proposed class action lawsuit by a group of patients alleging price-fixing.",
        "date": "01302017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi  Novo Nordisk and Lilly named in patients' price fixing suit "
    },
    {
        "content": "Johnson & Johnson's  agreed takeover of Actelion  for $30 billion in cash marks the biggest takeover with a European pharma business as target since Sanofi-Synthelabo acquired rival Aventis 13 years ago to forge what is now Sanofi .",
        "date": "01262017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Factbox: J&J-Actelion the largest European pharma deal in 13 years "
    },
    {
        "content": "* Actelion shares rise more than 20 percent   (Adds comment from Actelion CEO  moves dateline from Zurich)",
        "date": "01262017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 5-Johnson & Johnson refills drug cabinet with $30 bln Actelion deal "
    },
    {
        "content": "PARIS/DAVOS  Switzerland For the last year  Sanofi's chief executive has made clear his quest for deals to help revive the fortunes of France's biggest drugmaker.",
        "date": "01202017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi's M&A misses frustrate some investors in drugmaker "
    },
    {
        "content": "* Investors growing impatient after it fails to land acquisitions",
        "date": "01202017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "INSIGHT-Sanofi's M&A misses frustrate some investors in drugmaker "
    },
    {
        "content": "* Enteris Biopharma enters agreement with Sanofi to develop investigational oral therapeutic for type 2 diabetes  Source text for Eikon:  Further company coverage:",
        "date": "01232017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Enteris Biopharma enters agreement with Sanofi to develop investigational oral therapeutic for type 2 diabetes "
    },
    {
        "content": " ",
        "date": "01232017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "EpiPen rival to be offered free to many but high price for insurers "
    },
    {
        "content": "Jan 19 Privately held drugmaker Kaleo on Thursday said it would offer its Auvi-Q emergency allergy auto-injector at no cost to many consumers  but set a list price for the EpiPen rival that will be used as the benchmark cost to insurance companies at a whopping $4 500.",
        "date": "01232017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-EpiPen rival to be offered free to many but high price for insurers "
    },
    {
        "content": "PARIS  Jan 19 The French government will keep its stake in car maker PSA Peugeot Citroen  the office of president Francois Hollande tweeted on Thursday.",
        "date": "01192017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "French state to keep stake in Peugeot-Citroen - president's office "
    },
    {
        "content": "New multidistrict litigation over claims that a Sanofi breast cancer drug causes permanent hair loss more than doubled in size over the past month  and plaintiffs are continuing to mount ovarian cancer claims involving Johnson & Johnson's talc products in federal court.",
        "date": "01192017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "MDL Watch: Sanofi Taxotere  Bair Hugger and J&J talc cases grow "
    },
    {
        "content": "* Sanofi reports open market purchase of 87 298 shares of Regeneron Pharmaceuticals Inc's common stock on Jan 11 - SEC filing  Source text: http://bit.ly/2iR2AXn Further company coverage:",
        "date": "01132017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi buys 87 298 shares of Regeneron's common stock on Jan 11 "
    },
    {
        "content": "Sanofi must face whistleblower claims accusing it of marketing its cancer drug Taxotere to doctors for off-label use  a federal judge has ruled  saying it was too early to decide whether the French drugmaker's marketing was shielded by the First Amendment.",
        "date": "01122017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi must face whistleblower's off-label marketing claims -judge "
    },
    {
        "content": "* Regeneron CEO says Sanofi plant that will fill atopic dermatitis drug awaiting U.S. approval decision deemed acceptable",
        "date": "01102017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron says Sanofi plant used to fill drugs now deemed acceptable "
    },
    {
        "content": "* MannKind receives $30.6 million from Sanofi  Source text for Eikon:  Further company coverage:",
        "date": "01092017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-MannKind says receives $30.6 million from Sanofi "
    },
    {
        "content": "Jan 9 Regeneron Pharmaceuticals Chief Executive Len Schleifer on Monday ripped into Amgen Inc  for its insistence on blocking sales of a rival Regeneron cholesterol drug while the appeals process in a patent infringement case plays out.",
        "date": "01102017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-Regeneron CEO says Amgen not putting patients first in patent dispute "
    },
    {
        "content": "* Sanofi and Immunext enter into agreement to develop treatments for autoimmune diseases",
        "date": "01092017",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi and Immunext enter into agreement to develop treatments for autoimmune diseases "
    },
    {
        "content": "Regeneron Pharmaceuticals Inc and Sanofi SA said on Thursday they would appeal the U.S. District Court ruling which banned the two companies from selling their cholesterol drug  Praluent  on grounds of patent infringement.",
        "date": "01062017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Regeneron  Sanofi to appeal U.S. judge's ban on cholesterol drug sales "
    },
    {
        "content": "A federal judge on Tuesday refused to throw out a court verdict upholding two Amgen Inc patents related to the company's cholesterol drug  a defeat for Sanofi SA and Regeneron Pharmaceuticals Inc  which make a rival drug.",
        "date": "01042017",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi  Regeneron lose bid to overturn Amgen win in patent case "
    },
    {
        "content": "WASHINGTON German pharmaceutical company Boehringer Ingelheim agreed to divest five types of animal health products to settle charges that a proposed asset swap with Sanofi would harm competition  the U.S. Federal Trade Commission said on Wednesday.",
        "date": "12292016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "U.S. FTC requires divestitures in $13.53 billion Boehringer-Sanofi deal "
    },
    {
        "content": "France's Sanofi has filed a lawsuit in the United States accusing Novo Nordisk of falsely claiming that Sanofi insulin drugs would no longer be available for many U.S. patients so it could promote its competing drug.",
        "date": "12272016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi sues Novo Nordisk over diabetes drugs in the U.S. "
    },
    {
        "content": "ZURICH/FRANKFURT Swiss biotech company Actelion  has turned back to prospective bidder Johnson & Johnson  for exclusive talks about a \"strategic transaction\"  in an about-turn that appears to sideline rival suitor Sanofi . | Video ",
        "date": "12222016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Actelion re-enters talks with J&J  sidelining Sanofi "
    },
    {
        "content": "ZURICH Swiss biotech group Actelion's  shares rose by more than 3 percent on Wednesday following a report that talks with Sanofi  are making progress  increasing optimism that the two will strike a deal.",
        "date": "12212016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Actelion shares gain on report of progress in Sanofi talks "
    },
    {
        "content": "LONDON Talks between Actelion  and Sanofi  are making progress  despite investors' fears that the Swiss biotech firm's chief executive and founder might not want to sell  a person with direct knowledge of the situation said on Tuesday.",
        "date": "12202016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi's takeover talks with Actelion progressing: source "
    },
    {
        "content": "Shares in Swiss biopharmaceuticals company Actelion  surged more than 8 percent to a record high after Bloomberg reported that talks with French suitor Sanofi  were nearing an agreement that could be worth about $275 per share.",
        "date": "12162016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Actelion's shares jump on report of Sanofi deal nearing "
    },
    {
        "content": "ZURICH/LONDON Switzerland's Actelion Ltd  is in talks with French drugmaker Sanofi  about a deal  sources said on Wednesday  after U.S. healthcare group Johnson & Johnson  abandoned efforts to buy the company. | Video ",
        "date": "12142016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Actelion talking to Sanofi after J&J exit "
    },
    {
        "content": "PARIS The European Medicines Agency (EMA)  the European Union's health regulator  has accepted for review the Dupixent product being developed by drugmakers Sanofi and Regeneron  the companies said on Thursday.",
        "date": "12082016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "EU regulator accepts Sanofi/Regeneron's Dupixent product for review "
    },
    {
        "content": "French drugmaker Sanofi  is considering a bid for Swiss biotech company Actelion   rivaling an offer made by U.S. healthcare company Johnson & Johnson   Bloomberg reported.",
        "date": "12062016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi exploring bid for Actelion amid J&J talks: Bloomberg "
    },
    {
        "content": "Rivals Novo Nordisk and Sanofi have won U.S. approval for new combination drugs to treat diabetes  sparking a fresh battle for sales in a fiercely competitive market.",
        "date": "11222016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Novo  Sanofi go head to head as FDA clears new diabetes drugs "
    },
    {
        "content": "* Companies to sell two-drug products at discount   (Adds detail on pricing  quote from Novo Nordisk executive)",
        "date": "11222016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Novo  Sanofi go head to head as FDA clears new diabetes drugs "
    },
    {
        "content": "* Says expects daily wholesale acquisition cost of new diabetes drug Soliqua will be similar to daily price of a GLP-1 in U.S.",
        "date": "11222016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi sees Soliqua costing about same as a GLP-1 drug in U.S. "
    },
    {
        "content": "* Said on Tuesday  U.S. FDA approves Soliqua 100/33 for treatment of adults with type 2 diabetes",
        "date": "11222016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma: US FDA approves Soliqua 100/33 for treatment of adults with type 2 diabetes "
    },
    {
        "content": "Nov 17 Sanofi and Regeneron Pharmaceuticals said on Thursday they would continue a large clinical outcomes study with their injectable cholesterol-lowering drug Praluent.",
        "date": "11172016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "No early win for Sanofi  Regeneron cholesterol drug in study "
    },
    {
        "content": "Nov 17 Sanofi and Regeneron Pharmaceuticals said on Thursday they would continue a large clinical outcomes study with their injectable cholesterol-lowering drug Praluent  confounding hopes of some investors for an early win.",
        "date": "11172016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-No early win for Sanofi  Regeneron cholesterol drug in study "
    },
    {
        "content": "PARIS  Nov 16 France is setting up a fund to meet compensation claims from people affected by an epilepsy treatment made by Sanofi that is believed to cause birth malfunctions and slow neurological development.",
        "date": "11162016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "France sets up fund for Sanofi epilepsy drug victims "
    },
    {
        "content": "* Regeneron Pharmaceuticals-In MONARCH study  sarilumab monotherapy showed superiority over adalimumab monotherapy in adults with active rheumatoid arthritis",
        "date": "11162016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and Sanofi Present Results from late-stage Monarch study at American College of Rheumatology Annual Meeting "
    },
    {
        "content": "* Alnylam Pharmaceuticals announces Sanofi Genzyme opt-in decision for co-development and co-commercialization of fitusiran in hemophilia and rare bleeding disorders",
        "date": "11142016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Alnylam pharmaceuticals announces Sanofi Genzyme opt-in decision "
    },
    {
        "content": "LONDON  Nov 15 Two of Europe's biggest drugmakers warned on Tuesday there would be no let up in pressure on U.S. medicine prices after last week's presidential election win for Republican Donald Trump  which sent pharmaceutical and biotech shares soaring.",
        "date": "11152016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  GSK expect further price pressure  more M&A under Trump "
    },
    {
        "content": "* Sanofi will purchase $10.2 million worth of insulin from Mannkind in early December as part of its preexisting commitment",
        "date": "11102016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Mannkind and Sanofi reach agreement on Afrezza "
    },
    {
        "content": "* Regeneron and Sanofi to present data from Phase 3 Praluent(alirocumab) injection clinical trials at AHA scientific sessions 2016  Source text for Eikon:  Further company coverage:",
        "date": "11112016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and sanofi to present data from clinical trials "
    },
    {
        "content": "* Sanofi receives CHMP recommendation for approval of Suliqua in the EU  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "11112016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi gets CHMP recommendation for approval of Suliqua in the EU "
    },
    {
        "content": "* Mannkind Corp -  co  other entities entered into a settlement agreement with Sanofi-Aventis U.S. LLC - SEC filing",
        "date": "11092016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Mannkind -  Enters into settlement agreement with Sanofi-Aventis "
    },
    {
        "content": "BRUSSELS  Nov 9 German drugmaker Boehringer Ingelheim won EU antitrust approval on Wednesday to acquire French peer Sanofi's Merial animal health business after agreeing to sell some of Merial's vaccines and pharmaceuticals to allay competition concerns.",
        "date": "11092016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Boehringer gains conditional EU okay to buy Sanofi unit "
    },
    {
        "content": "* Sanofi genzyme begins pivotal phase 3 trial of neogaa investigational second-generation therapy for pompe disease",
        "date": "11042016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi starts phase 3 trial of pompe disease treatment "
    },
    {
        "content": "* Shares reverse course - up as much as 4.68 pct at $351.74   (Recasts  adds conf call details  updates shares)",
        "date": "11042016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 4-Regeneron profit tops Street on lower costs "
    },
    {
        "content": "Nov 4 Regeneron Pharmaceuticals Inc  reported a 7.3 percent rise in quarterly revenue on Friday  driven by higher demand for its flagship eye drug Eylea.",
        "date": "11042016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Eylea sales lift Regeneron revenue 7.3 percent "
    },
    {
        "content": " ",
        "date": "11012016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Drugmaker Sanofi hungry for deals after earnings beat "
    },
    {
        "content": "PARIS Sanofi will accept any blame attributed to it by a court over the harmful effects of its epilepsy treatment Depakine on unborn babies in a case that also involves health authorities and practitioners  the French drug company's scientific affairs director said.",
        "date": "10272016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi will accept epilepsy drug blame if court rules that way "
    },
    {
        "content": "* Signed a memorandum of agreement with the shareholders of Société Addict Media to acquire 100% of the company",
        "date": "10252016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Planet.fr SA to acquire Addict Media "
    },
    {
        "content": "Oct 28 Sanofi SA and Regeneron Pharmaceuticals Inc on Friday said U.S. regulators had declined to approve their experimental treatment for rheumatoid arthritis because of manufacturing deficiencies.",
        "date": "10282016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 1-U.S. FDA spurns Sanofi  Regeneron arthritis drug over manufacturing lapse "
    },
    {
        "content": "Oct 27 Sanofi has struck a collaboration deal with a leading Brazilian research institute to speed development of a Zika vaccine  consolidating the French drugmaker's leading position in the race to defeat the mosquito-borne virus.",
        "date": "10272016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi partners with Brazil to accelerate Zika vaccine work "
    },
    {
        "content": "* Announces an agreement with Sanofi to measure predictive cardiovascular biomarkers in patients with diabetes",
        "date": "10252016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Myriad RBM announces agreement with Sanofi "
    },
    {
        "content": "* Regeneron and sanofi receive complete response letter from fda for sarilumab  an investigational treatment for rheumatoid arthritis",
        "date": "10282016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and Sanofi receive complete response letter from FDA for Sarilumab "
    },
    {
        "content": "Oct 28 French drugmaker Sanofi will remain disciplined in its pursuit of takeover targets and potential therapeutic areas include oncology  immunology  multiple sclerosis and rare diseases  its finance chief and CEO said on Friday.",
        "date": "10282016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi says M&A strategy to remain disciplined "
    },
    {
        "content": "* Regeneron says it was advised by its collaborator  Sanofi  that manufacturing deficiencies have been raised by U.S. FDA during inspection of a Sanofi facility",
        "date": "10282016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron advised by Sanofi that manufacturing deficiencies have been raised by U.S. FDA "
    },
    {
        "content": "* CEO says even after share buyback we can still act swiftly if attractive M&A opportunites arise to increase long term shareholder value",
        "date": "10282016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi CEO says share buyback doesn't preclude M&A "
    },
    {
        "content": "Oct 28 French drugmaker Sanofi's  posted better than expected earnings and lifted its profit guidance for the year on strong growth at its biotech arm Genzyme and helped by an early start to the U.S. flu vaccines season.",
        "date": "10282016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi earnings beat view  lifts outlook "
    },
    {
        "content": "BRUSSELS  Oct 18 German pharmaceuticals company Boehringer Ingelheim has offered concessions in an attempt to secure EU antitrust approval for its acquisition of Sanofi's  animal health unit as part of a $20 billion asset swap.",
        "date": "10182016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Boehringer offers EU concessions over Sanofi animal health unit purchase "
    },
    {
        "content": "* Science 37 secures $31m series b funding to expand clinical trial access to anyone  anywhere  anytime",
        "date": "10182016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Science 37 secures $31m series B funding "
    },
    {
        "content": "The U.S. Supreme Court has declined to consider an appeal by health plans accusing French drugmaker Sanofi SA of hiding the risks of its antibiotic Ketek  which largely fell out of use in the U.S. after being linked to liver failure.",
        "date": "10032016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "U.S. top court will not hear fraud case over Sanofi antibiotic "
    },
    {
        "content": "Big pharmaceutical companies are waging courtroom patent battles against each other over biosimilars  as the line blurs between companies known for their innovative medicines and those that produce cheaper biotech knock-offs.",
        "date": "10022016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Factbox: Biosimilar landscape cluttered with Big Pharma lawsuits "
    },
    {
        "content": "* Sanofi appoints Alan Main to executive committee and executive vice president  consumer healthcare  Source text for Eikon:  Further company coverage:    (Reporting By Dominique Vidalon)",
        "date": "09302016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi appoints Alan Main to Executive Committee "
    },
    {
        "content": "Sanofi SA said on Monday the U.S. Department of Health and Human Services (HHS) approved $43.18 million in funding to accelerate the development of a Zika vaccine  as efforts to prevent the infection gather momentum.",
        "date": "09272016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi gets $43 million U.S. funding to spur Zika vaccine development "
    },
    {
        "content": "* The United States Biomedical Advanced Research and Development Authority (BARDA) agrees to fund the manufacture of an inactivated Zika vaccine for phase II development by Sanofi and its vaccines global business unit Sanofi Pasteur",
        "date": "09262016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-U.S BARDA grants $43.2 mln to Sanofi for Zika vaccine "
    },
    {
        "content": "French drugmaker Sanofi  and its U.S. partner Regeneron Pharmaceuticals  could win U.S. approval for their keenly awaited new eczema drug dupilumab  seen by analysts as a potential $3 billion-a-year seller  by next March.",
        "date": "09262016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi may win U.S. approval of $3 billion eczema drug by March "
    },
    {
        "content": "Sept 26 French drugmaker Sanofi and its U.S. partner Regeneron Pharmaceuticals could win U.S. approval for their keenly awaited new eczema drug dupilumab  seen by analysts as a potential $3 billion-a-year seller  by next March.",
        "date": "09262016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi may win U.S. approval of $3 bln eczema drug by March "
    },
    {
        "content": "* Sanofi and Regeneron announce dupilumab biologics license application accepted for priority review by U.S. FDA  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "09262016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi and Regeneron accepted for priority review by U.S. FDA "
    },
    {
        "content": "* Files suit in  U.S. To defend paten rights on Lantus and Lantus Solostar",
        "date": "09192016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi files suit in U.S. to defend paten rights on Lantus and Lantus Solostar "
    },
    {
        "content": "New Mexico Attorney General Hector Balderas has sued Bristol-Myers Squibb Co and Sanofi SA's U.S. arm for overstating the effectiveness of and concealing the risks of their blood thinner Plavix.",
        "date": "09162016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "New Mexico AG sues Bristol-Myers  Sanofi over blood thinner "
    },
    {
        "content": "PARIS French drugmaker Sanofi  and Verily  the life sciences unit of Google parent Alphabet Inc  on Monday said they would invest about $500 million in a joint venture combining devices with services to improve diabetes care  an example of growing ties between the pharma and tech sectors.",
        "date": "09122016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi  Google parent form $500 million diabetes joint venture "
    },
    {
        "content": "PARIS  Sept 12 French drugmaker Sanofi  and Verily  the life sciences unit of Google parent Alphabet Inc  on Monday said they would invest about $500 million in a joint venture combining devices with services to improve diabetes care  an example of growing ties between the pharma and tech sectors.",
        "date": "09122016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi  Google parent form $500 mln diabetes joint venture "
    },
    {
        "content": "LONDON  Sept 12 (IFR) - Investors  doing their best to remain positive even as corporate bonds descend deeper into negative yielding territory  bought two new issues with negative yields last week as the strength of central bank action continued to promote perverse incentives.",
        "date": "09122016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Investors stay positive as corporate yields turn negative "
    },
    {
        "content": "PARIS  Sept 12 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "09122016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "French and Benelux stocks-Factors to watch on Sept 12 "
    },
    {
        "content": "PARIS  Sept 12 French drugmaker Sanofi  and Google owner Alphabet's  U.S-based life sciences company Verily  announced on Monday the launch of a joint-venture aimed at offering patients suffering from diabetes products that will combine devices and services.",
        "date": "09122016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi and Alphabet set up JV in diabetes "
    },
    {
        "content": "* Sanofi and Regeneron say Praluent shows positive investigational data in phase 3 trial  Further company coverage:    (Reporting by Laurence Frost)",
        "date": "08292016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi and Regeneron say Praluent shows positive phase 3 trial data "
    },
    {
        "content": "A federal judge has blocked Actavis PLC and Novartis AG's Sandoz unit from launching generic versions of Sanofi SA's atrial fibrillation drug Multaq  finding they would infringe two of Sanofi's patents.",
        "date": "09012016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Judge blocks generic versions of Sanofi atrial fibrillation drug "
    },
    {
        "content": "PARIS  Aug 22 French pharmaceutical group Sanofi  reacted to Pfizer's roughly $14 billion cash deal for Medivation Inc by saying it had appreciated the chance to engage in talks with Medivation in past weeks.",
        "date": "08222016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi says talked with Medivation  but will be \"disciplined\" acquirer "
    },
    {
        "content": "Aug 22 Medivation's $14 billion sale to U.S. drug giant Pfizer Inc for a hefty premium  the largest U.S. biotechnology acquisition so far this year  had investors on Monday speculating about more dealmaking in the sector.",
        "date": "08222016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Pfizer's Medivation buy seen prescribing more biotech M&A "
    },
    {
        "content": "PARIS More than 10 000 pregnant women in France took Sanofi's anti-epilepsy drug Depakine between 2007 and 2014 although the risk of fetus malformation was known  according to a study quoted by French satirical weekly Le Canard Enchaine.",
        "date": "08092016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Thousands of women took Sanofi epilepsy drug despite risk to fetuses: media "
    },
    {
        "content": "PARIS  Aug 9 More than 10 000 pregnant women in France took Sanofi's anti-epilepsy drug Depakine between 2007 and 2014 although the risk of fetus malformation was known  according to a study quoted by French satirical weekly Le Canard Enchaine.",
        "date": "08092016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Thousands of women took Sanofi epilepsy drug despite risk to fetuses-media "
    },
    {
        "content": "PARIS U.S. pharmacy benefit manager CVS will drop Sanofi's main insulin drug Lantus from the list of medicines it reimburses on behalf of health insurers  dealing a blow to the French drugmaker's key diabetes business.",
        "date": "08032016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "CVS drops Sanofi's diabetes drugs for biosimilars "
    },
    {
        "content": "BRUSSELS  Aug 4 French drugmaker Sanofi  secured EU antitrust approval on Thursday for its proposed buy of German peer Boehringer Ingelheim's consumer health business after agreeing to divest businesses from both companies in nine EU countries.",
        "date": "08042016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi gains EU approval for Boehringer consumer health unit buy "
    },
    {
        "content": "Aug 4 Regeneron Pharmaceuticals Inc  stood by its full-year growth forecast for flagship eye drug Eylea as the company posted its slowest growth in revenue in eight quarters.",
        "date": "08042016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "REFILE-UPDATE 3-Regeneron sticks by 2016 growth forecast for Eylea  shares fall "
    },
    {
        "content": "* Sanofi  Pfizer  Gilead & Celgene interested in Medivation as company asks for indications of interest by mid-August - CNBC citing sources   Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07292016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi  Pfizer  Gilead & Celgene interested in Medivation - CNBC citing sources "
    },
    {
        "content": "PARIS  July 29 French drugmaker Sanofi's  sales and profit fell in the second quarter despite double-digit growth at biotech arm Genzyme  as the diabetes division continued to come under sustained U.S. pricing pressure.",
        "date": "07292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi sales and profit slide on U.S. pricing  Venezuela "
    },
    {
        "content": "PARIS  July 29 French drugmaker Sanofi's  sales and profit fell in the second quarter despite double-digit growth at biotech arm Genzyme  as the diabetes division came under sustained pricing pressure in the United States.",
        "date": "07292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi sales and profit slide on U.S. pricing  Venezuela "
    },
    {
        "content": "* Ships First Of Its 2016 2017 seasonal influenza vaccine doses in United States",
        "date": "07262016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi pasteur ships seasonal influenza vaccine doses in U.S. "
    },
    {
        "content": "PARIS  July 29 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "07292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "French and Benelux stocks-Factors to watch on July 29 "
    },
    {
        "content": "* Lixisenatide as adlyxin to treat type 2 diabetes commercial launch by Sanofi in U.S. is expected later in H2",
        "date": "07292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma: royalty revenue of DKK 6.4 mln in Q2 on sales of Lyxumia "
    },
    {
        "content": "* Ontario adds Lemtrada (Alemtuzumab) to exceptional access program for eligible patients  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07212016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi Enzyme says Ontario adds LEMTRADA to exceptional access program for eligible patients "
    },
    {
        "content": "BRUSSELS  July 18 - French drugmaker Sanofi has sought to address EU antitrust concerns over its proposed takeover of German peer Boehringer Ingelheim's consumer health unit by offering concessions.",
        "date": "07182016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi offers EU concessions over Boehringer consumer healthcare deal "
    },
    {
        "content": "BRUSSELS  July 8 - German drugmaker Boehringer Ingelheim has offered concessions in an attempt to win EU antitrust approval for its $20 billion asset swap with France's Sanofi  which would make it the second-largest company in the global animal health market.",
        "date": "07082016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Drugmaker Boehringer offers EU concessions for Sanofi asset swap "
    },
    {
        "content": "July 5 U.S. cancer drug company Medivation Inc  said on Tuesday it had agreed to provide confidential information to French pharmaceutical company Sanofi SA  as part of exploring a sale that would be open to other bidders.",
        "date": "07052016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 2-Medivation agrees to open its books to Sanofi "
    },
    {
        "content": "* Saskatchewan has added Lemtrada to province's MS drugs program for eligible people living with relapsing-remitting multiple sclerosis  Source text for Eikon:  Further company coverage:    )",
        "date": "07052016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi Genzyme says Saskatchewan has added Lemtrada to province's MS drugs program "
    },
    {
        "content": "* Regeneron and Sanofi announce approval of praluent (alirocumab) for the treatment of hypercholesterolemia in Japan  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "07052016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and Sanofi announce approval of praluent (alirocumab) in Japan "
    },
    {
        "content": "U.S. cancer drug company Medivation Inc  said on Tuesday it had agreed to provide confidential information to French pharmaceutical company Sanofi SA  as part of exploring a sale that would be open to other bidders. | Video ",
        "date": "07062016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Medivation agrees to open its books to Sanofi "
    },
    {
        "content": "July 6 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "07062016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Sanofi Genzyme begins pivotal phase 2/3 trial of olipudase alfa for adult patients with acid sphingomyelinase deficiency  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07062016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi Genzyme begins pivotal phase 2/3 trial "
    },
    {
        "content": "PARIS/LONDON French drugmaker Sanofi said on Wednesday it had struck a research and development deal with the U.S. Army to speed up the development of a vaccine against the mosquito-borne Zika virus.",
        "date": "07062016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "France's Sanofi partners U.S. Army to speed up Zika vaccine "
    },
    {
        "content": "* French firm only big drugmaker actively working on Zika   (Adds further details on vaccine development)",
        "date": "07062016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-France's Sanofi partners U.S. Army to speed up Zika vaccine "
    },
    {
        "content": "PARIS  July 6 French drugmaker Sanofi  said on Wednesday it had struck a research and development agreement with the Walter Reed Army Institute of Research (WRAIR) in the United States to develop a Zika vaccine candidate.",
        "date": "07062016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi signs research deal for a Zika vaccine with Pentagon "
    },
    {
        "content": "* Sanofi sounding out Medivation shareholders as it prepares to raise bid- CNBC    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06282016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi sounding out Medivation shareholders as it prepares to raise bid- CNBC "
    },
    {
        "content": "July 6 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "07062016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "PRESS DIGEST- Financial Times - July 6 "
    },
    {
        "content": "* Icagen says will retain majority of scientists working at Tucson site in transition",
        "date": "06272016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Icagen acquires Sanofi's Oro Valley  Arizona research facility "
    },
    {
        "content": "June 24 Medivation Inc said shareholder advisory firm Glass Lewis & Co has recommended the cancer drug maker's stockholders to not support Sanofi SA's  efforts to replace the company's board members.",
        "date": "06242016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Glass Lewis urges Medivation shareholders to support current board "
    },
    {
        "content": "June 20 Drug developer Inovio Pharmaceuticals Inc and its partner GeneOne Life Sciences Inc  said they had received approval from U.S. regulators to start an early stage human trial testing their Zika vaccine.",
        "date": "06202016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Inovio Pharma gets green signal to test Zika vaccine in human trial "
    },
    {
        "content": "* Sanofi announces expiration of hart-scott-rodino waiting period regarding proposed acquisition of medivation  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06142016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi announces expiration of Hart-Scott-Rodino waiting period for proposed acquisition of Medivation "
    },
    {
        "content": "NEW YORK  June 13 French drugmaker Sanofi  and its takeover target Medivation Inc on Monday said they had filed official materials with the U.S. Securities and Exchange Commission  as their $9.3 billion battle advances to the next phase.",
        "date": "06132016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "CORRECTED-UPDATE 1-Sanofi  Medivation advance to next phase of takeover fight "
    },
    {
        "content": "PARIS  June 13 French drugmaker Sanofi  said on Monday that it had filed a request with U.S. authorities to remove the board of Medivation and replace it with eight independent candidates as it seeks to acquire the cancer drug company.",
        "date": "06132016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi files request to replace Medivation board "
    },
    {
        "content": "* Medivation files definitive consent revocation statement and mails letter to stockholders",
        "date": "06132016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Medivation files definitive consent revocation statement "
    },
    {
        "content": "PARIS  June 8 Sanofi said on Wednesday it aims to remove the board of takeover target Medivation  by Aug. 1 at the latest.",
        "date": "06082016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi hopes to oust Medivation's board by August 1 "
    },
    {
        "content": "* Announced on Sunday positive Phase 3 results for investigational titratable fixed-ratio combination of insulin glargine and lixisenatide",
        "date": "06132016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi announces positive Phase 3 results "
    },
    {
        "content": "* Sanofi says filed investor presentation on proposed acquisition of Medivation with the U.S. Securities and Exchange Commission",
        "date": "06082016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi files investor presentation with SEC on proposed acquisition of Medivation "
    },
    {
        "content": "PARIS  June 6 French drugmaker Sanofi SA  and U.S. partner Regeneron Pharmaceuticals Inc  said a one-year  late-stage study of dupilumab  a monoclonal antibody designed for the treatment of skin diseases  had met its main goals.",
        "date": "06062016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi and Regeneron report positive skin disease trial "
    },
    {
        "content": "* Medivation sets record date for Sanofi's proposed consent solicitation",
        "date": "06012016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Medivation sets record date for Sanofi's proposed consent solicitation "
    },
    {
        "content": "PARIS  June 1 French drugmaker Sanofi  said on Wednesday it had submitted a written notice to Medivation requesting the U.S. company's board set a deadline for shareholders to give their written consent to remove and replace Medivation's board of directors.",
        "date": "06012016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi requests Medivation set deadline for shareholder consent on board revamp "
    },
    {
        "content": "PARIS U.S. cancer drug company Medivation Inc set June 1 as the date to determine which of its shareholders are eligible to take part in giving written consent to remove and replace its board of directors  after French drugmaker Sanofi submitted a notice.",
        "date": "06022016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Medivation sets eligibility date for shareholder consent on board revamp "
    },
    {
        "content": "* Latest day Medivation board can set record date is June 22  2016",
        "date": "06012016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi requests record date for consent solicitation to remove and replace Medivation's board "
    },
    {
        "content": "PARIS  June 1 U.S. cancer drug company Medivation Inc set June 1 as the date to determine which of its shareholders are eligible to take part in giving written consent to remove and replace its board of directors  after French drugmaker Sanofi submitted a notice.",
        "date": "06022016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-UPDATE 1-Medivation sets eligibility date for shareholder consent on board revamp "
    },
    {
        "content": "* Sanofi expected to request record date from Medivation today- CNBC  citing sources    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "06012016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi expected to request record date from Medivation today - CNBC  citing sources "
    },
    {
        "content": "A preliminary review by the U.S. Food and Drug Administration questioned the usefulness of a combination diabetes drug made by Sanofi SA's and said it was unclear whether one component  lixisenatide  contributed to its benefit.",
        "date": "05232016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "FDA staff question usefulness of Sanofi diabetes drugs "
    },
    {
        "content": "May 20 A preliminary review by the U.S. Food and Drug Administration of Novo Nordisk A/S's experimental diabetes drug  IDegLira  questioned the interpretability of the study findings and practical use of the treatment  according to a review posted on the agency's website on Friday.",
        "date": "05202016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-FDA staff question utility  trials of Novo Nordisk diabetes drug "
    },
    {
        "content": "May 23 A preliminary review by the U.S. Food and Drug Administration questioned the usefulness of a combination diabetes drug made by Sanofi SA's and said it was unclear whether one component  lixisenatide  contributed to its benefit.",
        "date": "05232016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-FDA staff question usefulness of Sanofi diabetes drugs "
    },
    {
        "content": "May 23 A preliminary review by the U.S. Food and Drug Administration questioned whether Sanofi SA's  experimental drug lixisenatide contributed any benefit to a fixed-dose combination diabetes product the company hopes to market.",
        "date": "05232016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "FDA staff question dosing of Sanofi combination diabetes drug "
    },
    {
        "content": "* FDA advisory committee recommends approval of Sanofi treatment for adults with Type 2 Diabetes",
        "date": "05252016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-FDA recommends approval of Sanofi treatment for Type 2 Diabetes "
    },
    {
        "content": "* Sanofi announces changes to executive committee aligned to its strategic roadmap 2020",
        "date": "05232016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi says Pascale Witz  executive VP  diabetes & cardiovascular  to leave company on June 1 "
    },
    {
        "content": "One day after recommending approval of a new diabetes drug made by Novo Nordisk A/S  a U.S. advisory panel on Wednesday recommended approval of a similar product made by Sanofi SA.",
        "date": "05252016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "U.S. panel backs approval of Sanofi combination diabetes drug "
    },
    {
        "content": "May 25 One day after recommending approval of a new diabetes drug made by Novo Nordisk A/S  a U.S. advisory panel on Wednesday recommended approval of a similar product made by Sanofi SA.",
        "date": "05252016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-U.S. panel backs approval of Sanofi combination diabetes drug "
    },
    {
        "content": "France's Sanofi SA  is preparing to name candidates it will put forward to replace the entire board of U.S. cancer drug company Medivation Inc  as early as Wednesday  according to people familiar with the matter.",
        "date": "05252016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Exclusive: Sanofi to unveil challenge to Medivation's board - sources "
    },
    {
        "content": "French drugmaker Sanofi  named eight candidates to replace the entire board of Medivation Inc  on Wednesday  stepping up pressure on the U.S. cancer drug company which has rejected its $9.3 billion takeover approach.",
        "date": "05252016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi moves to oust Medivation board in $9.3 billion takeover fight "
    },
    {
        "content": "* Cancer drug company says $52.50 a share inadequate   (Adds details on Medivation bylaws)",
        "date": "05252016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-Sanofi moves to oust Medivation board in $9.3 bln takeover fight "
    },
    {
        "content": "* Decided to withdraw marketing authorization application for registration of 2 mg/vial presentation of tesamorelin in Brazil",
        "date": "05162016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Theratechnologies and partner evaluating steps to seek and obtain approval of 1 mg/vial presentation "
    },
    {
        "content": "* Medivation urges stockholders to reject sanofi's attempt to replace medivation board of directors",
        "date": "05252016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Medivation says urges stockholders to reject Sanofi's attempt to replace co's board of directors "
    },
    {
        "content": "* Sanofi files consent solicitation to remove and replace Medivation's board",
        "date": "05252016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi sends letter to Medivation board of directors "
    },
    {
        "content": "May 25 French drugmaker Sanofi on Wednesday named eight candidates to replace the entire board of Medivation  stepping up pressure on the U.S. cancer drug company  which has rejected its $9.3 billion takeover approach.",
        "date": "05252016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi names eight candidates to replace Medivation board "
    },
    {
        "content": "* Sanofi seeking to replace entire Medivation board; Will nominate 8 people to replace Medivation board - CNBC",
        "date": "05132016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi seeking to replace entire Medivation board - CNBC "
    },
    {
        "content": "* Sanofi says seeking shareholder support for removal of board as of time removal proposal becomes effective and election of nominees",
        "date": "05252016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi seeking shareholder support for removal of Medivation board "
    },
    {
        "content": "A federal judge has dismissed a proposed class action filed by a union health plan accusing French drugmaker Sanofi SA of using kickback schemes to promote its osteoarthritis and diabetes drugs.",
        "date": "05132016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Judge dismisses proposed class action over alleged Sanofi kickbacks "
    },
    {
        "content": "LONDON Drug regulation has failed to keep up with a globalized world and governments should harmonize oversight to improve patients' access to new and innovative medicines.",
        "date": "05112016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Ex-FDA head and Sanofi call for harmonized drug regulation "
    },
    {
        "content": "LONDON  May 11 Drug regulation has failed to keep up with a globalised world and governments should harmonise oversight to improve patients' access to new and innovative medicines.",
        "date": "05112016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Ex-FDA head and Sanofi call for harmonised drug regulation "
    },
    {
        "content": "NEW YORK  May 11 Cigna Corp signed deals that will pay the makers of Repatha and Praluent  two powerful but pricey cholesterol lowering treatments  based on how well their customers respond to the medicines  the health insurer said on Wednesday.",
        "date": "05112016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Cigna makes deals with Amgen  Sanofi for pricey cholesterol drugs "
    },
    {
        "content": "* Says has entered into new value-based contracts with both amgen and sanofi/regeneron for PCSK9 inhibitors for commercial business  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05112016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Cigna enters into new contracts with Amgen and Sanofi/Regeneron "
    },
    {
        "content": "MUMBAI  May 12 Sanofi is recalling some batches of its painkiller Combiflam in India after the country's drugs regulator found the lots were substandard  the French drugmaker's local unit said on Thursday.",
        "date": "05122016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi recalls some batches of painkiller Combiflam in India "
    },
    {
        "content": "NEW YORK  May 12 Regeneron Pharmaceuticals  Chief Executive Leonard Schleifer on Thursday took aim at an influential drug pricing watchdog  saying a critique of the company's new cholesterol lowering therapy was non-scientific.",
        "date": "05122016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Regeneron CEO says drug price critique by independent group unscientific "
    },
    {
        "content": "PARIS/NEW YORK France's Sanofi said it could raise its proposed $9.3 billion deal to buy Medivation if the U.S. cancer drugmaker engaged in talks  threatening to go directly to shareholders to oust the board if not.",
        "date": "05052016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi ready to up offer for drugmaker Medivation  could oust board "
    },
    {
        "content": "LONDON Two rival cholesterol-lowering injections from Sanofi and Amgen have been recommended by Britain's healthcare cost watchdog after the manufacturers offered special discounts to the country's state-run health service.",
        "date": "05052016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Amgen cholesterol drugs win UK backing after price cuts "
    },
    {
        "content": "* Medivation reiterates rejection of Sanofi's substantially inadequate proposal",
        "date": "05052016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Medivation reiterates rejection of Sanofi's takeover proposal "
    },
    {
        "content": "MEXICO CITY  May 5 Mexico's Grupo Aeromexico said in a filing on Thursday that it accepted the terms set by Mexico's competition regulator to authorize a joint venture with Delta.    (Reporting by Michael O'Boyle; Editing by Chizu Nomiyama)",
        "date": "05052016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Aeromexico says accepts regulator terms for venture with Delta "
    },
    {
        "content": "PARIS Sanofi  sees a strong strategic fit with Medivation  even though its tie-up proposal was rejected by the U.S. cancer drug maker last week  the company's chief executive said on Wednesday.",
        "date": "05042016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi sees 'strong strategic' fit with U.S. Medivation "
    },
    {
        "content": "PARIS Sanofi  and its takeover target Medivation  dug in for trench warfare on Friday  with the French drugmaker confident of winning over investors and the U.S. cancer firm insisting it was better off staying independent.",
        "date": "04292016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi  Medivation dig in for big biotech takeover battle "
    },
    {
        "content": "* Company's shareholders approve CEO Olivier Brandicourt's 2015 compensation by 63.26 percent at annual general meeting.   Further company coverage:    (Reporting by Paris Newsroom)",
        "date": "05042016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi shareholders approve 2015 CEO compensation "
    },
    {
        "content": "* Medivation's board of directors unanimously rejects Sanofi's unsolicited proposal",
        "date": "04292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Medivation board rejects Sanofi's takeover offer "
    },
    {
        "content": "Medivation Inc  said on Friday its board rejected an unsolicited $9.3 billion takeover proposal from Sanofi SA   saying the offer undervalued the company and its pipeline of oncology drugs.",
        "date": "04292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Medivation board rejects Sanofi's $9.3 billion takeover offer "
    },
    {
        "content": "PARIS  April 29 Sanofi said on Friday it remained committed to acquiring U.S. drug firm Medivation  and that it was ready to speak directly to its shareholders.",
        "date": "04292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi says committed to Medivation takeover "
    },
    {
        "content": "* Says Sanofi's proposed acquisition of U.S. cancer drug company Medivation can be accomodated under its current debt rating",
        "date": "04292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi purchase of Medivation can be accomodated under current rating-Moody's "
    },
    {
        "content": "LONDON AstraZeneca is to cut costs by $1 billion and increase its focus on cancer treatments after underlying earnings  hit by drug patent expiries  fell 12 percent in the first quarter  broadly in line with analyst expectations.",
        "date": "04292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "AstraZeneca cuts costs and doubles down on cancer drugs "
    },
    {
        "content": "LONDON/PARIS French drugmaker Sanofi went public with a $9.3 billion offer to buy Medivation on Thursday  setting up what could be a lengthy takeover battle after the U.S. cancer firm rebuffed its approaches.",
        "date": "04292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi launches $9.3 billion fight for U.S. cancer firm Medivation "
    },
    {
        "content": "* Zealand reports Lyxumia royalty revenue for Q1 2016 andmsubmission by Sanofi of the fixed-ratio combination of insulin glargine (Lantus) and lixisenatide for European registration",
        "date": "04292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma Lyxumia royalty revenue for Q1 2016 up 3 pct "
    },
    {
        "content": "* Medivation confirms receipt of unsolicited proposal from Sanofi",
        "date": "04282016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Medivation confirms receipt of unsolicited proposal from Sanofi "
    },
    {
        "content": "PARIS  April 28 French pharmaceuticals group Sanofi said on Thursday it had made an all-cash offer to buy U.S. biotech firm Medivation in a deal worth about $9.3 billion.",
        "date": "04282016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "France's Sanofi makes $9.3 bln bid for U.S. biotech Medivation "
    },
    {
        "content": "LONDON  April 22 Britain's healthcare cost watchdog NICE said on Friday it had changed its mind and decided to recommend Sanofi's prostate cancer drug Jevtana after the French company agreed to a further discount.",
        "date": "04212016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UK agency backs cancer drug after Sanofi cuts price "
    },
    {
        "content": "PARIS  April 19 Sanofi said on Tuesday that it would invest 300 million euros ($339 million) to expand a Belgian site specialised in making treatments for rare diseases.",
        "date": "04192016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi invests 300 mln eur to expand Belgian plant "
    },
    {
        "content": "April 17 Drugmaker AstraZeneca Plc has held internal talks about a bid for cancer treatment maker Medivation Inc but has yet to make a formal offer  the Sunday Times reported  citing sources.",
        "date": "04172016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-AstraZeneca has held internal talks for Medivation bid -Sunday Times "
    },
    {
        "content": "April 17 Drugmaker AstraZeneca Plc has held internal talks about a bid for Medivation Inc but has yet to make a formal offer  the Sunday Times reported  citing sources.",
        "date": "04172016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "AstraZeneca has held internal talks for Medivation bid -Sunday Times "
    },
    {
        "content": "* Has assumed responsibility for worldwide development and commercialization of Afrezza inhalation powder from Sanofi",
        "date": "04052016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Mannkind- regains Afrezza marketing rights "
    },
    {
        "content": "April 1 Regeneron Pharmaceuticals Inc  and Sanofi said on Friday their experimental treatment for eczema proved highly effective in two large studies  without serious side effects often seen with standard treatments for the chronic inflammatory skin disease.",
        "date": "04012016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Regeneron  Sanofi eczema drug clears hurdles in big trials "
    },
    {
        "content": "* Regeneron And Sanofi announce positive Dupilumab topline results from two Phase 3 trials in inadequately controlled moderate to-severe atopic Dermatitis patients",
        "date": "04012016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron and Sanofi announce positive Dupilumab topline results from two Phase 3 trials in inadequately controlled moderate-to-severe atopic Dermatitis patients "
    },
    {
        "content": "LONDON  March 29 French drugmaker Sanofi  has poached one of AstraZeneca's top scientists to be its new research head in another high-profile departure for the British drugmaker.",
        "date": "03292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi poaches AstraZeneca scientist as new research head "
    },
    {
        "content": "LONDON  March 29 French drugmaker Sanofi  has poached one of AstraZeneca's top scientists to be its new research head in another high-profile departure for the British drugmaker.",
        "date": "03292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi poaches AstraZeneca scientist as new research head "
    },
    {
        "content": "PARIS  March 23 French drugmaker Sanofi  and U.S. partner Regeneron said a late-stage study of their Praluent injection showed it reduced the need for patients with an inherited form of high cholesterol to have bad cholesterol removed from their blood.",
        "date": "03232016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Regeneron unveil positive Praluent cholesterol study "
    },
    {
        "content": "LONDON  March 23 European stocks were seen opening slightly lower on Wednesday  having retreated in the previous session after deadly attacks in Brussels hit travel  leisure and luxury goods stocks.",
        "date": "03232016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "European Factors to Watch-Shares seen opening slightly lower "
    },
    {
        "content": "A federal jury upheld the validity of two Amgen Inc patents related to the company's newly-approved drug to reduce bad cholesterol  in a defeat for Sanofi SA and Regeneron Pharmaceuticals Inc  which make a rival drug.",
        "date": "03162016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Amgen beats Sanofi  Regeneron at cholesterol drug trial "
    },
    {
        "content": "March 16 A federal jury upheld the validity of two Amgen Inc patents related to the company's newly-approved drug to reduce bad cholesterol  in a defeat for Sanofi SA and Regeneron Pharmaceuticals Inc  which make a rival drug.",
        "date": "03162016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Amgen beats Sanofi  Regeneron at cholesterol drug trial "
    },
    {
        "content": "* \u007fSanofi and Regeneron say strongly disagree with the U.S. Jury verdict in the ongoing patent litigation regarding Praluent injection and will appeal.\u007f  Source text for Eikon:  Further company coverage:    (Reporting By Dominique Vidalon)",
        "date": "03162016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi  Renegeron to appeal U.S. verdict in Praluent litigation\u007f "
    },
    {
        "content": "* Regeneron and Sanofi strongly disagree with U.S. Jury verdict in ongoing patent litigation regarding Praluent (Alirocumab) injection and will appeal",
        "date": "03162016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Regeneron  Sanofi comment on verdict in ongoing patent litigation regarding Praluent "
    },
    {
        "content": "* Sanofi to pay $50 mln  plus up to $184 mln for each target   (Adds further detail on drugs and partnership)",
        "date": "03162016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi signs deal worth up to $2.3 bln with DiCE Molecules "
    },
    {
        "content": "* Says Gerd Krick  chairman of the supervisory board   to run again for supervisory board",
        "date": "03112016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-FMC says Citi's McWhinney  Sanofi's Witz to run for supervisory board "
    },
    {
        "content": "PARIS Sanofi SA and Merck & Co Inc said on Tuesday they were ending a 22-year-old joint venture to sell vaccines in Europe  arguing they would do better by managing their product portfolios independently.",
        "date": "03082016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi and Merck pull the plug on European vaccines venture "
    },
    {
        "content": "PARIS  March 8 Sanofi SA and Merck & Co Inc said on Tuesday they were ending a 22-year-old joint venture to sell vaccines in Europe  arguing they would do better by managing their product portfolios independently.",
        "date": "03082016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi and Merck pull the plug on European vaccines venture "
    },
    {
        "content": "* \u007fsanofi's board of directors proposes appointment of diane souza and thomas südhof  md as new independent directors\u007f  Source text for Eikon:  Further company coverage:",
        "date": "03032016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi \u007fsanofi's board of directors proposes appointment of diane souza and thomas südhof  md as new independent directors\u007f "
    },
    {
        "content": "CARACAS/LONDON/BOSTON Venezuela has settled debts with at least three global drug companies by giving them bonds that trade at a heavy discount  a further sign of the OPEC nation's worsening financial crisis.",
        "date": "03072016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Venezuela uses distressed bonds to settle debts with drugmakers "
    },
    {
        "content": "CARACAS/LONDON/BOSTON  March 7 Venezuela has settled debts with at least three global drug companies by giving them bonds that trade at a heavy discount  a further sign of the OPEC nation's worsening financial crisis.",
        "date": "03072016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "INSIGHT-Venezuela uses distressed bonds to settle debts with drugmakers "
    },
    {
        "content": "* Sanofi's NDA for the fixed-ratio combination (LixiLan) of lixisenatide and insulin glargine for Type 2 diabetes has been accepted for review by the FDA",
        "date": "02222016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Zealand: nda for the fixed-ratio combination accepted for review by the FDA "
    },
    {
        "content": "PARIS  Feb 22 French drugmaker Sanofi  said the U.S. Food and Drug Administration (FDA) had accepted its application for the use of insulin and its lixisenatide drug in combination for the treatment of adults with Type 2 diabetes.",
        "date": "02222016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi says U.S. FDA accepts diabetes drug application "
    },
    {
        "content": "BRUSSELS  Feb 10 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02102016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "EU mergers and takeovers (Feb 10) "
    },
    {
        "content": "PARIS Sanofi  said it expected stable earnings per share  this year after reporting lower fourth-quarter income on Tuesday  hurt by declining sales of diabetes and cancer treatments and other prescription drugs.",
        "date": "02092016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi pledges stable 2016 earnings "
    },
    {
        "content": "* Shares down 5.3 pct at $369.77   (Adds details from conference call  analyst comment)",
        "date": "02092016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-Regeneron sees gradual adoption of cholesterol drug Praluent "
    },
    {
        "content": "* Proposes 2.93 euro dividend   (Adds details  comment  share price)",
        "date": "02092016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi pledges stable 2016 earnings "
    },
    {
        "content": "* Q4 royalty revenue from Sanofi's sales of lixisenatide (Lyxumia) outside US up at 8.1 million Danish crowns / 1.1 million euros ($1.23 million)  up 15 pct over Q3  up 31 pct over Q4 2014",
        "date": "02092016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma Q4 lixisenatide (Lyxumia) royalty rev up 31 pct at DKK 8.1 mln "
    },
    {
        "content": "PARIS  Feb 9 Sanofi reported lower fourth-quarter earnings on Tuesday  hurt by declining sales in key divisions such as diabetes  oncology and prescription drugs  but said it expected 2016 earnings per share to be stable.",
        "date": "02092016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi pledges stable 2016 earnings despite headwinds "
    },
    {
        "content": "AUSTIN  Texas  Feb 2 The first known case of Zika virus transmission in the United States was reported in Texas on Tuesday by local health officials  who said it likely was contracted through sex and not a mosquito bite  a day after the World Health Organization declared an international public health emergency.",
        "date": "02032016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "WRAPUP 7-First U.S. Zika virus transmission reported  attributed to sex "
    },
    {
        "content": "PARIS/LONDON Sanofi has launched a project to develop a vaccine against the Zika virus in the most decisive commitment yet by a major vaccine producer to fight the disease linked to multiple birth defects in Brazil. | Video ",
        "date": "02022016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi launches hunt for Zika vaccine as disease fears grow "
    },
    {
        "content": "PARIS  Feb 2 Sanofi is considering the launch of a voluntary early retirement plan in France that could lead to around 600 job cuts over three years  the French drugmaker said on Tuesday.",
        "date": "02022016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi plans 600 job cuts in France over 3 years "
    },
    {
        "content": "PARIS  Feb 2 Sanofi is considering the launch of a voluntary early retirement plan in France that could lead to around 600 job cuts over three years  the French drugmaker said on Tuesday.",
        "date": "02022016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi plans 600 job cuts in France over 3 years "
    },
    {
        "content": "PARIS/LONDON  Feb 2 Sanofi has launched a project to develop a vaccine against the Zika virus in the most decisive commitment yet by a major vaccine producer to fight the disease linked to multiple birth defects in Brazil.",
        "date": "02022016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi launches hunt for Zika vaccine as disease fears grow "
    },
    {
        "content": "PARIS  Jan 29 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "01292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "French and Benelux stocks-Factors to watch on Jan 29 "
    },
    {
        "content": "LONDON  Jan 29 European shares were expected to bounce back on Friday  tracking a strong rally in Asian shares after the Bank of Japan stunned markets by adopting negative interest rates to boost the economy.",
        "date": "01292016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "European Factors to Watch-Shares seen getting BoJ boost "
    },
    {
        "content": "PARIS  Jan 28 Sanofi signed a memorandum of cooperation with Iran's government aimed at boosting its presence in the country  the French drugmaker said on Thursday.",
        "date": "01282016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi aims for increased presence in Iran "
    },
    {
        "content": "BRUSSELS  Jan 28 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01282016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "EU mergers and takeovers (Jan 28) "
    },
    {
        "content": "BRUSSELS  Jan 21 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01212016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "EU mergers and takeovers (Jan 21) "
    },
    {
        "content": "* Ceo says aims to return diabetes business to growth in 2019",
        "date": "01122016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi aims to double size of MS business by 2020 "
    },
    {
        "content": "PARIS Sanofi boosted its presence in cancer research on Monday by signing two deals with biotech companies worth up to $1.2 billion  as the French drugmaker plays catch-up with rivals in the hot research field.",
        "date": "01112016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi deepens cancer drive with $1.2 billion of deals  Innate jumps "
    },
    {
        "content": "PARIS  Jan 11 Sanofi and biotech company Warp Drive Bio said on Monday they had deepened their existing partnership in cancer drug research with $750 million in new funding from the French drugmaker.",
        "date": "01112016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi deepens cancer treatment research deal with Warp Drive "
    },
    {
        "content": "French drug company Sanofi SA has won dismissal of a securities class action lawsuit accusing it of promoting its diabetes drugs through an illegal kickback scheme.",
        "date": "01072016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi dodges investor lawsuit over alleged kickback scheme "
    },
    {
        "content": "LONDON French drugmaker Sanofi is to stop selling an inhalable insulin developed by Mannkind  following disappointing sales of the product since its launch in February 2015.",
        "date": "01052016",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Poor sales prompt Sanofi to pull plug on Mannkind inhaled insulin "
    },
    {
        "content": "* Mannkind shares slump 40 percent   (Adds analysts' comment  further share price fall)",
        "date": "01052016",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Poor sales prompt Sanofi to pull plug on Mannkind inhaled insulin "
    },
    {
        "content": "* Sanofi Pasteur announces that the Brazilian regulatory authorities ANVISA approved  tetravalent dengue vaccine  for the prevention of disease caused by all four dengue types in individuals from 9-45 years of age living in endemic areas  Source text for Eikon:   Further company coverage:    (Gdynia Newsroom)",
        "date": "12282015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi Dengvaxia dengue vaccine approved in Brazil "
    },
    {
        "content": "* Sanofi has submitted Lixilan for regulatory review in the US  triggering a $20 million milestone payment",
        "date": "12232015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma: Sanofi submits LixiLan for regulatory review in the US "
    },
    {
        "content": "PARIS/LONDON Sanofi and Boehringer Ingelheim are in exclusive talks over a $20 billion swap of the French pharmaceuticals company's animal health business for the family-owned German group's consumer health operation.",
        "date": "12152015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi plans to reshape via $20 billion asset swap with Boehringer "
    },
    {
        "content": "* Sanofi shares jump more than 4 percent   (Adds banks advising Boehringer  Boehringer comment on financing  updates shares  link to Breakingviews)",
        "date": "12152015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-Sanofi plans to reshape via $20 bln asset swap with Boehringer "
    },
    {
        "content": "FRANKFURT  Dec 15 Boehringer Ingelheim expects negotiations with Sanofi about the drugmakers' planned asset swap to be complex but is confident the deal can be wrapped up by the end of next year.",
        "date": "12152015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Boehringer CEO says negotiations with Sanofi to be complex "
    },
    {
        "content": "PARIS  Dec 9 Sanofi's dengue vaccine is to make its market debut in Mexico  the French drugmaker said on Wednesday  adding that it expects to have filed for market approval in some 20 countries by year-end.",
        "date": "12092015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi wins first dengue vaccine market approval in Mexico "
    },
    {
        "content": "PARIS  Dec 15 Sanofi and Boehringer Ingelheim on Tuesday announced they were in exclusive talks to swap the French pharmaceuticals company's animal health business for the family-owned German group's consumer health operation.",
        "date": "12152015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "RPT-Sanofi  Boehringer in talks to swap assets "
    },
    {
        "content": "PARIS  Dec 15 Sanofi and Boehringer Ingelheim on Tuesday announced they were in exclusive talks to swap the French pharmaceuticals company's animal health business for the family-owned German group's consumer health operation.",
        "date": "12152015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Boehringer in talks to swap assets "
    },
    {
        "content": "* Redefine strikes a 1.3 billion rand deal with Delta for strategic disposal of 15 government-tenanted properties\u007f",
        "date": "12042015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Redefine says Delta Property to buy co's 15 enterprises for 1.3 bln rand "
    },
    {
        "content": "PARIS  Nov 30 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "11302015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "French and Benelux stocks-Factors to watch on Nov 30 "
    },
    {
        "content": "Nov 27 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "11272015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON/NEW YORK/FRANKFURT Investment bank Lazard is working with Sanofi's management to prepare a sale or listing of its Merial animal health unit  aiming to land the leading advisory job for the deal  which could value the business at up 12 billion euros ($12.7 billion)  sources familiar with the matter said.",
        "date": "11272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Exclusive: Lazard works with Sanofi on $12.7 billion animal health unit deal - sources "
    },
    {
        "content": "A group of health plans that brought a class action accusing drugmaker Sanofi of concealing the safety risks of its antibiotic Ketek do not have enough evidence to support their case  a unanimous federal appellate panel has ruled.",
        "date": "11162015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "2nd Circuit rejects false marketing class action against Sanofi "
    },
    {
        "content": "Nov 20 Sanofi and AstraZeneca  said on Friday that they will exchange 210 000 chemical compounds in a deal aimed at widening the diversity of the chemicals they can use to develop new drugs.",
        "date": "11202015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "CORRECTED-Sanofi and AstraZeneca to exchange 210 000 chemical compounds "
    },
    {
        "content": "Chris Viehbacher  ousted last year after six years as CEO of French drugmaker Sanofi  is settling into a new job that involves picking promising experimental drugs before they have been tested in human trials.",
        "date": "11192015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Former Sanofi CEO Viehbacher to bankroll new drugs "
    },
    {
        "content": "A new lawsuit accuses Sanofi SA of stalling development of its multiple sclerosis drug Lemtrada to avoid paying out at least $708 million to rights holders under its 2011 agreement to acquire Genzyme Corp.",
        "date": "11102015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi delayed drug to avoid $708 million in payments  lawsuit claims "
    },
    {
        "content": "Nov 9 A new lawsuit accuses Sanofi SA  of stalling development of its multiple sclerosis drug Lemtrada to avoid paying out at least $708 million to rights holders under its 2011 agreement to acquire Genzyme Corp.",
        "date": "11092015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi delayed drug to avoid $708 mln in payments  lawsuit claims "
    },
    {
        "content": "PARIS  Nov 3 Sanofi and BioNTech said they signed a collaboration and licence agreement to discover and develop up to five cancer immunotherapies  the companies said in a statement on Tuesday.",
        "date": "11032015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  BioNTech sign cancer treatment partnership "
    },
    {
        "content": "* Shares fall 1.5 pct   (Adds further comment from CEO and analysts  closing shares)",
        "date": "11032015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-GSK plan to file up to 20 new drugs by 2020 underwhelms market "
    },
    {
        "content": "GlaxoSmithKline  Roche and Sanofi all hold investor days this week. Below are three new drugs to watch from each company  with consensus annual sales in 2020  according to Thomson Reuters Cortellis.",
        "date": "11012015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Factbox: Drugs to watch at Roche  Sanofi and GSK "
    },
    {
        "content": "PARIS Sanofi has signed a licence deal with Hanmi Pharmaceutical to develop experimental  long-acting diabetes treatments  the French drugmaker said on Thursday  in a move to revive its diabetes division.",
        "date": "11052015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi  Hanmi seal diabetes licence deal for up to $4.2 billion "
    },
    {
        "content": "* Shares rise 3.8 pct premarket   (Adds forecast  background)",
        "date": "11042015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Regeneron raises Eylea sales growth estimates again "
    },
    {
        "content": "LONDON  Nov 1 Three of Europe's top drugmakers - GlaxoSmithKline  Roche and Sanofi - face health checks this week at high-profile presentations designed to show they can overcome looming market threats.",
        "date": "11012015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Drugged up: GSK  Roche and Sanofi to set out their stalls "
    },
    {
        "content": "* Deal seen as negative for existing Sanofi partner Zealand   (Adds analyst's comment  updates share price reaction)",
        "date": "11052015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi  Hanmi seal diabetes licence deal for up to $4.2 bln "
    },
    {
        "content": "* Sanofi to obtain exclusive worldwide licence   (Adds details)",
        "date": "11052015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi  Hanmi seal diabetes licence deal for up to $4.2 bln "
    },
    {
        "content": "* Q3 revenue 7.2 million Danish crowns ($1.05 million) versus 58.2 million crowns year ago",
        "date": "11052015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma Q3 net result swings to loss DKK 51.3 "
    },
    {
        "content": "* Agreed compensation from Sanofi Pasteur following suspension of manufacturing since mid-2012 of bladder cancer treatment Immucyst",
        "date": "11052015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Alliance Pharma says agreed compensation from Sanofi Pasteur "
    },
    {
        "content": "PARIS  Nov 5 France's Sanofi said on Thursday that it had signed a licence agreement with Korea-based Hanmi Pharmaceutical Co. Ltd. to develop a portfolio of experimental  long-acting diabetes treatments.",
        "date": "11052015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Hanmi sign diabetes treatment licence agreement "
    },
    {
        "content": "PARIS Sanofi  could hope to get over 12 billion euros ($13 billion) should it decide to sell its Merial animal health unit and its European generics business  and the French drugmaker's new boss is seen as well-placed to find a buyer.",
        "date": "11062015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "New Sanofi boss seen well-placed to lead $13 billion asset selloff "
    },
    {
        "content": "PARIS  Nov 6 Sanofi could hope to get over 12 billion euros ($13 billion) should it decide to sell its Merial animal health unit and its European generics business  and the French drugmaker's new boss is seen as well-placed to find a buyer.",
        "date": "11062015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "New Sanofi boss seen well-placed to lead $13 bln asset selloff "
    },
    {
        "content": "Sanofi has agreed to collaborate with Lexicon Pharmaceuticals on Sotagliflozin  a potential oral treatment for people with diabetes  the French drugmaker said on Friday.",
        "date": "11062015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Lexicon sign diabetes license and collaboration deal "
    },
    {
        "content": "PARIS  Nov 6 Sanofi said on Friday investment in products to compensate for declining diabetes sales and cost cuts would prevent any meaningful profit growth in the next two years  as it unveiled its strategic plan through 2020.",
        "date": "11062015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi shares drop after warning of no profit growth for two years "
    },
    {
        "content": "PARIS  Oct 29 Sanofi warned on Thursday that sales at its main diabetes division would keep falling until 2018  as it faces growing competition in the United States where the patent on its blockbuster Lantus insulin is due to expire this year.",
        "date": "10292015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi shares drop as diabetes sales seen falling for three years "
    },
    {
        "content": "* Sanofi CEO Olivier Brandicourt says the company is on track to implement new organisation structure from early 2016",
        "date": "11062015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi CEO says company on track to implement new organisation structure "
    },
    {
        "content": "* Sanofi CEO Olivier Brandicourt says company faces \"patent hill\"  pressure on margins",
        "date": "11062015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi says group faces patent hill  pressure on margins "
    },
    {
        "content": "* Sanofi confirms expected next steps in the US regulatory process",
        "date": "10292015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma maintains guidance for 2015 "
    },
    {
        "content": "PARIS  Oct 26 Sanofi's new chief executive is expected to show how he aims to get France's most valuable company back on track   after being hit by lagging diabetes sales and boardroom rows    when he presents his five-year strategic plan on Nov. 6.",
        "date": "10262015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi's new CEO set to deliver revival plan after falling diabetes sales "
    },
    {
        "content": "Nov 6 Sanofi has agreed to collaborate with Lexicon Pharmaceuticals on Sotagliflozin  a potential oral treatment for people with diabetes  the French drugmaker said on Friday.",
        "date": "11062015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Lexicon sign diabetes licence and collaboration deal "
    },
    {
        "content": "French drugmaker Sanofi SA said it was voluntarily recalling all its Auvi-Q injections in the United States to treat patients with severe allergic reactions.",
        "date": "10282015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi U.S. recalls Auvi-Q injections for severe allergy "
    },
    {
        "content": "PARIS  Oct 29 Sanofi reported stronger third-quarter profits on Thursday as rising sales at biotech arm Genzyme and in animal health compensated for a fall in revenue from diabetes drugs  its main business.",
        "date": "10292015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi Q3 profits up; diabetes sales fall offset by other divisions "
    },
    {
        "content": "PARIS  Nov 6 Sanofi said investment in products to compensate for declining diabetes sales will prevent significant profit growth in the next two years  adding that earnings would outpace sales from 2018.",
        "date": "11062015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi sees strong profit growth from 2018  to cut costs "
    },
    {
        "content": "Oct 28 French drugmaker Sanofi SA   said it was voluntarily recalling all its Auvi-Q injections in the United States to treat patients with severe allergic reactions.",
        "date": "10282015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi U.S. recalls Auvi-Q injections for severe allergy "
    },
    {
        "content": "Oct 28 French drugmaker Sanofi SA's  U.S. unit said it was voluntarily recalling all of its Auvi-Q injections to treat people with severe allergic reactions.",
        "date": "10282015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi recalls Auvi-Q injections for severe allergy "
    },
    {
        "content": "Oct 12 The odds that Merck & Co's  high-stakes cholesterol drug will succeed have dropped dramatically after Eli Lilly and Co said its similar medicine failed to reduce heart attacks and strokes  top U.S. heart doctors said.",
        "date": "10132015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Merck cholesterol drug's odds dim after Lilly failure "
    },
    {
        "content": "* Treatment effects maintained over five years in majority of patients with relapsing remitting Multiple Sclerosis who received Genzyme's Lemtrada (alemtuzumab) in clinical trials  Source text for Eikon:  See also:  Further company coverage:    (Gdynia Newsroom)",
        "date": "10082015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi reports positive long-term data for Genzyme's Lemtrada clinical trials "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  September 30 (Fitch) Fitch Ratings has affirmed French pharmaceutical  company Sanofi SA's (Sanofi) Long-term Issuer Default Rating (IDR) and senior  unsecured rating at 'AA-' and Short-term IDR at 'F1+'. The Outlook is Stable. Sanofi's IDR remains supported by its solid market position as a leading player  in the global pharmaceutical industry (ranked fourth-largest in Fitch's global  rated pharma universe based on 2014 pharmac",
        "date": "09302015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Fitch Affirms Sanofi at 'AA-'; Outlook Stable "
    },
    {
        "content": "A federal judge has certified a class action brought by doctors who say they were overcharged for vaccines by French drugmaker Sanofi SA through an illegal bundling scheme.",
        "date": "10012015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Antitrust class action over Sanofi vaccine bundling certified "
    },
    {
        "content": "PARIS Drug company Sanofi is seeking a deal with unions to boost productivity by 20-25 percent at French plants over three years  union sources told Reuters on Wednesday.",
        "date": "10072015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi seeks productivity gains at French sites: sources "
    },
    {
        "content": "PARIS  Oct 7 Drug company Sanofi is seeking a deal with unions to boost productivity by 20-25 percent at French plants over three years  union sources told Reuters on Wednesday.",
        "date": "10072015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi seeks productivity gains at French sites- sources "
    },
    {
        "content": "* Says that Sanofi's new drug application for lixisenatide (Lyxumia) has been accepted for review by the U.S. Food and Drug Administration (FDA)",
        "date": "09292015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma: Sanofi's new drug application for Lyxumia accepted for FDA review "
    },
    {
        "content": "Sanofi and Eli Lilly said they agreed to end a lawsuit over Lilly's right to market a copy of the French drugmaker's injectable insulin product in the United States.",
        "date": "09282015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi  Eli Lilly reach deal on insulin product "
    },
    {
        "content": "Sept 28 Sanofi and Eli Lilly  said they agreed to end a lawsuit over Lilly's right to market a copy of the French drugmaker's injectable insulin product in the United States.",
        "date": "09282015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi  Eli Lilly reach deal on insulin product "
    },
    {
        "content": "PARIS  Sept 14 Sanofi said on Monday a second late-stage Phase III study of its LixiLan diabetes drug had met its main target  readying it for regulatory submissions by the fourth quarter in the United States and the first quarter of next year in the European Union.",
        "date": "09142015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi's combination diabetes drug hits goal in second late-stage trial "
    },
    {
        "content": "Sept 11 A new Novartis AG drug to treat heart failure should cost 17 percent less than its list price of $4 560 per year to keep health costs in line with growth in the overall U.S. economy  according to the nonprofit ICER.",
        "date": "09112015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Novartis heart failure drug should have 17 pct discount -analysis "
    },
    {
        "content": "* Sanofi announced the successful completion of LixiLan-L  the second pivotal phase III trial with LixiLan to demonstrate positive results",
        "date": "09142015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma: Sanofi announces successful completion of LixiLan-L  guidance unchaged "
    },
    {
        "content": "Sept 11 A new Novartis AG drug to treat heart failure should cost 17 percent less than its list price of $4 560 per year to keep health costs in line with growth in the overall U.S. economy  according to the nonprofit ICER.",
        "date": "09112015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Novartis heart failure drug should have 17 pct discount -analysis "
    },
    {
        "content": "PARIS Alcatel-Lucent's board has decided to cut the payoff given to former chief executive Michel Combes to a maximum of nearly 8 million euros ($9 million) after an outcry in France.",
        "date": "09112015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Alcatel cuts ex-CEO Combes departure pay after outcry "
    },
    {
        "content": "PARIS  Sept 11 Alcatel-Lucent's board has decided to cut the payoff given to former chief executive Michel Combes to a maximum of nearly 8 million euros ($9 million) after an outcry in France.",
        "date": "09112015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Alcatel cuts ex-CEO Combes departure pay after outcry "
    },
    {
        "content": "FRANKFURT Germany's Merck KGaA is to seek approval from Europe's regulators for the use of its cladribine tablet to treat multiple sclerosis  in a fresh attempt to enter a multi-billion dollar market for a drug it had given up on four years ago.",
        "date": "09112015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Merck KGaA to try again to get approval for MS pill cladribine "
    },
    {
        "content": "* Merck pulled plug on cladribine in 2011 towards end of Phase III",
        "date": "09112015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Merck KGaA to try again to get approval for MS pill cladribine "
    },
    {
        "content": "Genzyme Corp agreed to pay $32.59 million  admit wrongdoing and enter a deferred prosecution agreement to resolve U.S. criminal charges over its marketing of the surgical implant Seprafilm  the Department of Justice said on Thursday.",
        "date": "09042015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi's Genzyme pays $32.59 million in criminal Seprafilm case "
    },
    {
        "content": "PARIS  Sept 1 Sanofi and Regeneron Pharmaceuticals said on Tuesday that a study into their new cholesterol-lowering drug  Praluent  showed promising results.",
        "date": "09012015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Regeneron say new cholesterol drug data positive "
    },
    {
        "content": "Genzyme Corp agreed to pay $32.59 million  admit wrongdoing and enter a deferred prosecution agreement to resolve U.S. criminal charges over its marketing of the surgical implant Seprafilm  the Department of Justice said on Thursday.",
        "date": "09032015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi's Genzyme pays $32.59 million in criminal Seprafilm case "
    },
    {
        "content": "Sept 3 Genzyme Corp agreed to pay $32.59 million  admit wrongdoing and enter a deferred prosecution agreement to resolve U.S. criminal charges over its marketing of the surgical implant Seprafilm  the Department of Justice said on Thursday.",
        "date": "09042015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-UPDATE 2-Sanofi's Genzyme pays $32.59 mln in criminal Seprafilm case "
    },
    {
        "content": "Sept 3 Genzyme Corp agreed to pay $32.59 million  admit wrongdoing and enter a deferred prosecution agreement to resolve U.S. criminal charges over its marketing of the surgical implant Seprafilm  the Department of Justice said on Thursday.",
        "date": "09032015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi's Genzyme pays $32.59 mln in criminal Seprafilm case "
    },
    {
        "content": "Aug 31 Google Inc and French drugmaker Sanofi SA said they will partner to develop tools to improve the management and treatment of diabetes.",
        "date": "08312015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Google  Sanofi team up to improve diabetes care "
    },
    {
        "content": "Sept 3 Genzyme Corp  a unit of French drug company Sanofi SA  will pay $32.59 million and admit wrongdoing to resolve criminal charges over the unlawful distribution of the surgical device Seprafilm  the U.S. Department of Justice said on Thursday.",
        "date": "09032015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi's Genzyme pays $32.59 mln in criminal Seprafilm case "
    },
    {
        "content": "* Evotec  Apeiron Biologics and Sanofi jointly develop novel small molecule-based cancer immunotherapies  Source text for Eikon:  Further company coverage:    (Reporting By Georgina Prodhan)",
        "date": "08102015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Evotec  Apeiron  Sanofi develop cancer immunotherapies "
    },
    {
        "content": "PARIS  Aug 10 Sanofi is teaming up with Germany's Evotec and Austrian biotech firm Apeiron Biologics to develop a new type of immune system-boosting cancer medicine that could be given as tablets to fight both solid tumours and blood cancers.",
        "date": "08102015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi teams up with Evotec  Apeiron to develop immuno-oncology pills "
    },
    {
        "content": "* Shares up 9.3 pct at $605.93   (Adds details  background  analyst and company comments; updates share)",
        "date": "08042015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Regeneron raises Eylea sales forecast  shares at record "
    },
    {
        "content": "Aug 4 Regeneron Pharmaceuticals Inc  reported a 50 percent rise in quarterly revenue  boosted by increasing demand for its blockbuster eye drug  Eylea.",
        "date": "08042015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Drugmaker Regeneron's revenue jumps on Eylea sales "
    },
    {
        "content": "* Shares down 2 pct after initial rise to record high   (Adds CEO  analyst  details)",
        "date": "08062015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Novo Nordisk's Victoza sales up despite price pressure and China slowdown "
    },
    {
        "content": "French drugmaker Sanofi is linking with Evotec to develop stem cell-based treatments for diabetes  under a deal that could earn the German biotech firm more than 300 million euros ($327 million).",
        "date": "08072015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi links with Evotec to tap stem cells for diabetes care "
    },
    {
        "content": "* to develop beta cell-modulating diabetes treatments  which may reduce or eliminate the need for insulin injections  Source text for Eikon:  Further company coverage:",
        "date": "08072015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi  Evotec enter diabetes partnership "
    },
    {
        "content": "* Sanofi and Evotec align forces to develop next generation therapies in diabetes",
        "date": "08072015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Evotec  Sanofi to cooperate on diabetes therapy "
    },
    {
        "content": "* CEO Brandicourt to unveil strategic plan on Nov.6  open to M&A",
        "date": "07302015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi's diabetes sales slow  Genzyme's jump "
    },
    {
        "content": "* Sanofi has announced that the first LixiLan Phase III trial  LixiLan-O  met primary study endpoint",
        "date": "07292015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma: Sanofi announces first LixiLan Phase III trial's primary study endpoint "
    },
    {
        "content": "French drugmaker Sanofi  said on Tuesday it was committing up to $2.17 billion to a collaboration with its long-time partner Regeneron Pharmaceuticals  in the hot area of cancer immunotherapy.",
        "date": "07282015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi links with Regeneron in $2.2 billion cancer drug push "
    },
    {
        "content": "PARIS  July 30 Sanofi's diabetes division reported lower second-quarter sales hurt by pricing pressure in the United States but the French drugmaker's biotech arm Genzyme posted another quarter of double-digit growth.",
        "date": "07302015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-Sanofi's diabetes division sales slow in Q2  Genzyme jumps "
    },
    {
        "content": "* Lixisenatide (Lyxumia) royalty revenue increased in Q2 2015 as Sanofi confirms the submission of a NDA in the US",
        "date": "07302015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma maintains its financial guidance for 2015 "
    },
    {
        "content": "PARIS  July 29 Sanofi said on Wednesday a first late-stage Phase III study of its LixiLan diabetes drug had met its main target  while another would be completed at the end of the third quarter.",
        "date": "07292015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi's combination diabetes drug hits goal in late-stage trial "
    },
    {
        "content": "July 28 French drugmaker Sanofi said on Tuesday it was committing up to $2.17 billion to a collaboration with its long-time partner Regeneron Pharmaceuticals in the hot area of cancer immunotherapy.",
        "date": "07282015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi links with Regeneron in $2.2 bln cancer drug push "
    },
    {
        "content": "* Sanofi and Regeneron agree to jointly develop PD-1 and other new immuno-oncology antibodies -",
        "date": "07282015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi to invest $2.17 bln in Regeneron cancer therapy collaboration "
    },
    {
        "content": "LONDON  July 27 Two of the most anticipated new heart drugs to be launched in recent years have been priced well above analyst expectations  fuelling the debate about whether modern medicines cost too much.",
        "date": "07272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "New heart drugs come in more expensive than expected "
    },
    {
        "content": "Amgen Inc's cholesterol fighting drug was approved by the European Commission  giving the keenly anticipated treatment a head start over a rival drug being developed by Regeneron Pharmaceuticals Inc and Sanofi SA.",
        "date": "07212015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Amgen wins first approval for new class of cholesterol drugs "
    },
    {
        "content": "WASHINGTON The U.S. Food and Drug Administration approved a potent new cholesterol-lowering drug from Sanofi SA and Regeneron Pharmaceuticals Inc on Friday but limited its approved use to patients with a hereditary form of the condition and those with cardiovascular disease.",
        "date": "07242015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "FDA approves Sanofi/Regeneron cholesterol drug with limits "
    },
    {
        "content": "LONDON AstraZeneca   under pressure from falling sales of older drugs  is selling a medicine for a rare type of cancer to Sanofi  as it continues a drive to raise cash by divesting certain assets.",
        "date": "07272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "AstraZeneca sells rare cancer drug to Sanofi for up to $300 million "
    },
    {
        "content": "LONDON  July 27 AstraZeneca  under pressure from falling sales of older drugs  is selling a medicine for a rare type of cancer to Sanofi as it continues a drive to raise cash by divesting certain assets.",
        "date": "07272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-AstraZeneca sells rare cancer drug to Sanofi for up to $300 mln "
    },
    {
        "content": "LONDON  July 27 Britain's FTSE 100 index is seen opening around 20 points 0.3 percent lower on Monday  according to financial bookmakers. Futures were down 0.1 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on           * The UK blue chip index fell 1.1 percent on Friday  slightly underperforming broader European equities  with a slump in commodity shares tracking a sharp drop in metals and oil prices. It closed at 6 579.81 poin",
        "date": "07272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UK Stocks-Factors to watch on July 27 "
    },
    {
        "content": "July 21 Amgen Inc's cholesterol fighting drug was approved by the European Commission  giving the keenly anticipated treatment a head start over a rival drug being developed by Regeneron Pharmaceuticals Inc and Sanofi SA.",
        "date": "07212015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Amgen wins first approval for new class of cholesterol drugs "
    },
    {
        "content": "WASHINGTON  July 24 The U.S. Food and Drug Administration approved a potent new cholesterol-lowering drug from Sanofi SA and Regeneron Pharmaceuticals Inc  on Friday but limited its approved use to patients with a hereditary form of the condition and those with cardiovascular disease.",
        "date": "07242015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 3-FDA approves Sanofi/Regeneron cholesterol drug with limits "
    },
    {
        "content": "LONDON  July 27 AstraZeneca  under pressure from falling sales of older drugs  is selling a medicine for a rare type of cancer to Sanofi as it continues a drive to raise cash by divesting certain assets.",
        "date": "07272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "AstraZeneca sells rare cancer drug to Sanofi for up $300 mln "
    },
    {
        "content": "LONDON  July 24 A new type of cholesterol drug from Sanofi and Regeneron Pharmaceuticals won a green light from European regulators on Friday  two months behind a rival product from Amgen.",
        "date": "07242015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi's big new cholesterol drug wins European green light "
    },
    {
        "content": "* Sanofi and its subsidiary Henzyme said in a statement they have entered into a definitive agreement with AstraZeneca to acquire Caprelsa\u007f (vandetanib)   Further company coverage:",
        "date": "07272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi to acquire Caprelsa from Astrazeneca "
    },
    {
        "content": "* Praluent to compete with Amgen's rival product Repatha   (Adds comment from companies  more details on drug dose and use)",
        "date": "07242015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi's big new cholesterol drug wins European green light "
    },
    {
        "content": "* EU Medicines Agency recommends approval of high cholesterol drug Praluent from Sanofi SA/Regeneron Pharmaceuticals",
        "date": "07242015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi  Regeneron's high cholesterol drug Praluent gets EMA nod "
    },
    {
        "content": "A U.S. judge has dismissed an unusual whistleblower lawsuit by generic drugmaker Amphastar Pharmaceuticals Inc accusing rival Sanofi SA of deceiving the government in a patent application  and said he may impose sanctions on Amphastar's counsel.",
        "date": "07132015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Judge throws out Amphastar whistleblower lawsuit against Sanofi "
    },
    {
        "content": "PARIS Sanofi will adopt a simplified structure centered around five global business units starting in January 2016 to promote growth  the French drugmaker said on Wednesday  as it prepares a new strategic plan to be unveiled in November.",
        "date": "07152015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi announces reorganization ahead of strategic plan "
    },
    {
        "content": "* Changes to take effect from January 2016   (Adds share price  details)",
        "date": "07152015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi announces reorganisation ahead of strategic plan "
    },
    {
        "content": "PARIS  July 15 Sanofi will adopt a new simplified structure  reducing its number of global business units to five from seven starting in January 2016 to promote growth  the French drugmaker said on Wednesday.",
        "date": "07152015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi trims number of divisions from seven to five "
    },
    {
        "content": "Consumer watchdog Public Citizen said it petitioned U.S. health regulators to withdraw approval of Sanofi SA's Seprafilm and order a recall  saying the surgical implant has been associated with side effects including death.",
        "date": "07072015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Watchdog urges FDA to revoke approval of Genzyme surgical implant "
    },
    {
        "content": "* Says new basal insulin lantus\u007f xr  known as toujeo\u007f in the u.s. and Europe approved in Japan for the treatment of diabetes mellitus.  Source text for Eikon:  Further company coverage:    (Reporting By Dominique Vidalon)",
        "date": "07032015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi's new basal insulin lantus\u007f xr aproved in Japan "
    },
    {
        "content": "(Adds futures  detail  company news)     LONDON  July 3 European stocks were seen opening mixed on Friday ahead of economic survey data later in the session  with focus on the Greek debt crisis heading into a crunch vote at the weekend.     As angry and uncertain voters prepare for a referendum on Sunday that could decide Greece's future in Europe  the International Monetary Fund delivered a stark warning on Thursday of the huge financial hole facing the country.       A new opini",
        "date": "07032015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "European Factors to Watch - Shares seen mixed with Greek vote  PMIs in focus "
    },
    {
        "content": "* Signed an agreement with Delta for delivery of a next generation optical broadband network",
        "date": "07012015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Teleste to deliver broadband network to dutch operator Delta "
    },
    {
        "content": "* Says signed non-binding MOU with Sanofi SA to set up a joint venture in China focusing on developing insulin and diabetes-related treatment",
        "date": "07032015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Zhejiang Hisun Pharma teams up Sanofi on developing diabetes-related treatment "
    },
    {
        "content": "PARIS  June 26 Sanofi Chief Executive Olivier Brandicourt has told unions he will present a five-year strategic plan in November after the French company's third-quarter results  labour representatives said.",
        "date": "06262015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 1-New Sanofi CEO to unveil five-year plan in November -unions "
    },
    {
        "content": "PARIS  June 25 Sanofi Chief Executive Olivier Brandicourt has told unions he will present a five-year strategic plan in November after the French company's third-quarter results  labour representatives said on Thursday.",
        "date": "06252015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi five-year plan to be unveiled in November -unions "
    },
    {
        "content": "June 23 Waypoint Capital  the investment vehicle backed by biotech guru Ernesto Bertarelli  appointed former chief executive of Sanofi SA  Christopher Viehbacher  as a managing partner to its U.S.-based healthcare investment fund.",
        "date": "06232015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "MOVES-Bertarelli's Waypoint hires ex-Sanofi CEO to lead health fund "
    },
    {
        "content": " (This version of the June 9th story corrects dosing schedule in last paragraph to every other week)",
        "date": "06102015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "FDA panel backs Sanofi/Regeneron cholesterol drug with limits "
    },
    {
        "content": "June 10 A new type of cholesterol-lowering drug made by Sanofi SA and Regeneron Pharmaceuticals  should be approved  an advisory committee to the U.S. Food and Drug Administration concluded on Tuesday.",
        "date": "06102015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-UPDATE 3-FDA panel backs Sanofi/Regeneron cholesterol drug with limits "
    },
    {
        "content": "LONDON  June 11 Woodford Investment Management sold out of French pharmaceutical firm Sanofi in May on valuation grounds  the money manager said on Thursday  and instead added several smaller firms to its main fund.",
        "date": "06112015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Woodford exits bets on Sanofi  adds drug  tech firms "
    },
    {
        "content": "A large study demonstrated the heart safety of Sanofi's injectable type 2 diabetes drug lixisenatide and appears to rule out other potential health hazards as well  according to data presented at a medical meeting on Monday ",
        "date": "06082015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "No heart  other safety risks seen with Sanofi diabetes drug: study "
    },
    {
        "content": "June 8 A large study demonstrated the heart safety of Sanofi's  injectable type 2 diabetes drug lixisenatide and appears to rule out other potential health hazards as well  according to data presented at a medical meeting on Monday ",
        "date": "06082015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "No heart  other safety risks seen with Sanofi diabetes drug- study "
    },
    {
        "content": "June 9 A new type of cholesterol-lowering drug made by Sanofi SA and Regeneron Pharmaceuticals  should be approved  an advisory committee to the U.S. Food and Drug Administration concluded on Tuesday.",
        "date": "06092015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 2-FDA panel backs Sanofi/Regeneron cholesterol drug with limits "
    },
    {
        "content": "COPENHAGEN  June 8 The following stocks may be affected by newspaper reports and other factors on Monday:",
        "date": "06082015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "NORDIC STOCKS - Factors to watch on June 8 "
    },
    {
        "content": "* Zealand informs of updates given by Sanofi on Lyxumia and LixiLan on an IR Thematic Conference Call on Diabetes",
        "date": "06092015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma informs of updates given by Sanofi on Lyxumia and LixiLan "
    },
    {
        "content": "* Zealand announces that Sanofi has informed of results from GetGoal Duo-2  showing advantages of Lyxumia versus rapid-acting insulin as add-on to Lantus for the treatment of Type 2 diabetes",
        "date": "06082015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand announces Sanofi has informed of results from GetGoal Duo-2 "
    },
    {
        "content": "* Economic slowdown may be more than temporary-Fed's Brainard",
        "date": "06022015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "US STOCKS-Wall St pares losses as data  Fed comments allay rate hike fears "
    },
    {
        "content": "* NeuroVive Asia signs collaboration agreement with Sanofi for the development and commercialization of ciclomulsion in South Korea",
        "date": "05262015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-NeuroVive teams up with Sanofi for Ciclomulsion launch in South Korea "
    },
    {
        "content": "May 22 Amgen Inc's closely watched new cholesterol drug  Repatha  has been recommended for approval in Europe  putting the U.S. drugmaker ahead in a race with rival Sanofi SA.",
        "date": "05222015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Amgen first to win EU backing for new kind of cholesterol drug "
    },
    {
        "content": "LONDON  May 19 Amgen's new cholesterol drug Repatha could be recommended for approval in Europe as early as this week  putting it ahead in a race with a rival product from Sanofi.",
        "date": "05192015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Amgen cholesterol drug could get EU green light this week "
    },
    {
        "content": "* Group EBITDA before contingent considerations at eur (0.3) m significantly improved compared to same period of previous year (2014: eur (1.3) m)",
        "date": "05122015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Evotec raises 2015 revenue guidance on Sanofi alliance "
    },
    {
        "content": "* Follows rebellions at companies from Sanofi to Barrick Gold   (Adds detail from statement  quote from company)",
        "date": "05082015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 1-Hedge fund firm Man Group feels investor backlash on pay "
    },
    {
        "content": "PARIS  April 30 Drugs group Sanofi  which sacked its chief executive last year and appointed a new one in February  has appealed for shareholder loyalty as it seeks to head off a potential rebellion over millions of euros in payments to both men.",
        "date": "05012015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "RPT-Sanofi faces AGM row over cost of firing and hiring CEOs "
    },
    {
        "content": "* Large shareholder minority votes against the pay packages   (Adds detail on packages)",
        "date": "05042015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi rebels make mark in AGM vote on CEO pay "
    },
    {
        "content": "PARIS  May 4 Shareholders in drugs group Sanofi   which sacked its chief executive last year and appointed a new one in February  approved millions of euros in payments to both men on Monday despite a substantial rebellion by activist investors.",
        "date": "05042015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi rebels make mark in AGM vote on CEO pay "
    },
    {
        "content": "PARIS  April 30 Drugs group Sanofi  which sacked its chief executive last year and appointed a new one in February  has appealed for shareholder loyalty as it seeks to head off a potential rebellion over millions of euros in payments to both men.",
        "date": "04302015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi faces AGM row over cost of firing and hiring CEOs "
    },
    {
        "content": "PARIS  April 30 France's Sanofi warned revenue in its key diabetes division would fall this year after it was forced to offer discounts for its best-selling drug Lantus in the United States.",
        "date": "04302015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-UPDATE 2-Sanofi warns of lower diabetes drug sales this year "
    },
    {
        "content": "PARIS  April 30 Drugs firm Sanofi  maintained its guidance for stable to slightly growing 2015 profit on Thursday as first-quarter earnings grew modestly and beat expectations despite declining sales of its main drug Lantus.",
        "date": "04302015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi keeps 2015 guidance with steady Q1 profits "
    },
    {
        "content": "* Long-standing partnership between the French pharmaceutical group Sanofi and the Ypsomed Group will be bolstered by new major project",
        "date": "04242015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Ypsomed to increase production capacity for new project with Sanofi "
    },
    {
        "content": "* Says effect of Genzyme's multiple sclerosis treatment Lemtrada (alemtuzumab) on slowing brain atrophy and MRI lesion activity has been maintained through four years",
        "date": "04232015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi to present new data from Lemtrada clinical development "
    },
    {
        "content": "* Innate Pharma and Sanofi SA collaborate on next generation antibody-drug conjugates",
        "date": "04162015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Innate Pharma and Sanofi collaborate on antibody-drug conjugates "
    },
    {
        "content": "* Announces the signing of a strategic partnership on the North American market with Elvex",
        "date": "04082015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Delta Plus Group acquires 50 pct of North American Elvex "
    },
    {
        "content": "* Announced a collaboration agreement with Sanofi  of $120 million",
        "date": "04022015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Schrödinger signs $120 million deal with Sanofi - Schrödinger "
    },
    {
        "content": "PARIS  March 30 French pharmaceutical company Sanofi has examined acquisitions opportunities but does not view deal-making as \"indispensable\" to its future  its chairman told French paper Les Echos in an interview.",
        "date": "03302015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi chairman says acquisitions not 'indispensable' for future "
    },
    {
        "content": "PARIS French drugmaker Sanofi plans to launch its new Toujeo insulin for diabetics in the United States on Monday  according to a source familiar with the matter.",
        "date": "03272015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi to launch Toujeo diabetes drug in U.S. on Monday: source "
    },
    {
        "content": "PARIS  March 27 French drugmaker Sanofi  plans to launch its new Toujeo insulin for diabetics in the United States on Monday  according to a source familiar with the matter.",
        "date": "03272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi to launch Toujeo diabetes drug in U.S. on Monday -source "
    },
    {
        "content": "* Says Gardasil 9  new HPV vaccine from Sanofi Pasteur MSD granted positive opinion by European Ccommittee for Medicinal Products for Human Use",
        "date": "03272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi Pasteur's Gardasil 9 HPV vaccine gets positive opinion from EMA "
    },
    {
        "content": "March 25 U.S. health regulators on Wednesday approved Regeneron Pharmaceuticals Inc's big-selling eye drug Eylea to treat diabetic retinopathy  the most common diabetic eye disease and a leading cause of blindness in adults.",
        "date": "03252015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "CORRECTED-U.S. FDA again expands usage of Regeneron eye drug Eylea "
    },
    {
        "content": "LONDON  March 23 Bristol-Myers Squibb  Sanofi and Novartis have the three top new drugs set to reach the market in 2015  among 11 products each with $1 billion-plus sales potential  according to a Thomson Reuters analysis.",
        "date": "03232015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Bristol  Sanofi and Novartis drugs to shine among 2015 launches "
    },
    {
        "content": "* Up from three potential $1 billion-plus drugs in 2014   (Updates with link to report  paragraph 5)",
        "date": "03232015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Bristol  Sanofi and Novartis drugs to shine among 2015 launches "
    },
    {
        "content": "* Evotec shares jump to highest since end July   (Adds further details of deal  share price  trader comment)",
        "date": "03202015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 1-Evotec shares surge on Sanofi strategic alliance "
    },
    {
        "content": "PARIS  March 19 Sanofi's lixisenatide drug for the treatment of type 2 diabetes does not increase cardiovascular risk among high risk patients  the French drugmaker said on Thursday.",
        "date": "03192015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi test shows lixisenatide doesn't increase cardiovascular risk "
    },
    {
        "content": "LONDON  March 18 The gap between regulatory decisions on new medicines made in different parts of the world is increasing  imposing a high cost on industry and deterring investment  the head of research at France's Sanofi  said on Wednesday.",
        "date": "03182015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi R&D head bemoans divergence in global drug regulation "
    },
    {
        "content": "* Says Sanofi has published top-line results from the ELIXA cardiovascular safety outcomes study of Lyxumia (lix-isenatide)",
        "date": "03192015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma: Sanofi publishes results for ELIXA outcomes study of Lyxumia "
    },
    {
        "content": "PARIS  March 19 Drugmaker Sanofi said its lixisenatide drug for the treatment of type 2 diabetes did not increase cardiovascular risk among high risk patients in a study it conducted.",
        "date": "03192015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi says test shows lixisenatide doesn't increase cardiovascular risk "
    },
    {
        "content": "* Announced its affiliate Shantha Biotechnics  located in  India  has delivered first 400 000 doses of its pediatric pentavalent vaccine Shan5 to support immunization of children in India  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "03172015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi affiliate Shantha will provide up to 37 million doses of Shan5 "
    },
    {
        "content": "* Announced on Sunday the 18-month results of a Phase 3 long term trial with praluent (alirocumab) with Regeneron Pharmaceuticals Inc",
        "date": "03162015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi and Regeneron announce 18-month results of ODYSSEY long term trial with praluent (alirocumab) "
    },
    {
        "content": "* Q4 revenue 6.3 million Danish crowns  ($893 860) versus 3.2 million crowns year ago",
        "date": "03132015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Zealand Pharma Q4 operating loss widens to DKK 68.0 mln "
    },
    {
        "content": "PARIS French oil major Total disclosed a list of all its 903 subsidiaries worldwide in a transparency move on Wednesday after recurring criticism about the group's presence in tax havens.",
        "date": "03042015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Total eyes closing nine units located in tax havens by 2017 "
    },
    {
        "content": "PARIS Chris Viehbacher  sacked as chief executive of French drugs firm Sanofi last year  is to join the board of PureTech  a privately owned healthcare science and technology R&D company.",
        "date": "02272015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sacked Sanofi boss joins PureTech board "
    },
    {
        "content": "PARIS  Feb 27 Chris Viehbacher  sacked as chief executive of French drugs firm Sanofi last year  is to join the board of PureTech  a privately owned healthcare science and technology R&D company.",
        "date": "02272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-Sacked Sanofi boss joins PureTech board "
    },
    {
        "content": "LONDON French drugmaker Sanofi's new Toujeo diabetes drug has been recommended for approval in Europe  two days after being cleared for sale in the United States  regulators said on Friday.",
        "date": "02272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi diabetes drug Toujeo wins EU green light  pricing in focus "
    },
    {
        "content": "French drugmaker Sanofi SA's new Toujeo diabetes drug won U.S. regulatory approval  but with wording on its prescribing label that analysts say could make marketing difficult.",
        "date": "02262015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi's diabetes drug Toujeo gets U.S. approval  label disappoints "
    },
    {
        "content": "* Pricing seen key in determining Toujeo take-up   (Adds product details  debate on pricing)",
        "date": "02272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi diabetes drug Toujeo wins EU green light  pricing in focus "
    },
    {
        "content": "Feb 26 French drugmaker Sanofi SA's  new Toujeo diabetes drug won U.S. regulatory approval  but with wording on its prescribing label that analysts say could make marketing difficult.",
        "date": "02262015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi's diabetes drug Toujeo gets U.S. approval  label disappoints "
    },
    {
        "content": "LONDON  Feb 26 Sanofi's new Toujeo diabetes drug is on track to receive a potential green light from European regulators this week  building on a U.S. regulatory approval awarded on Wednesday.",
        "date": "02262015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi diabetes drug awaits imminent EU green light "
    },
    {
        "content": "LONDON  Feb 27 French drugmaker Sanofi's  new Toujeo diabetes drug has been recommended for approval in Europe  two days after being cleared to go on sale in the United States  regulators said on Friday.",
        "date": "02272015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi diabetes drug Toujeo wins European green light "
    },
    {
        "content": "PARIS  Feb 23 French pharmaceuticals group Sanofi came under fire from French government ministers on Monday over a welcome bonus planned for its new CEO.",
        "date": "02232015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi under fire in France over new CEO's pay package "
    },
    {
        "content": "U.S. health regulators on Wednesday approved Sanofi's diabetes drug Toujeo  a more potent follow-up to the French drugmaker's top-selling insulin product Lantus.",
        "date": "02262015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "FDA approves Sanofi's diabetes drug Toujeo "
    },
    {
        "content": "PARIS  Feb 20 Sanofi's new boss Olivier Brandicourt could earn up to 4.2 million euros ($4.8 million) a year at the drugs group and  pocket an extra 4 million euros within 12 months as a one-off golden handshake.",
        "date": "02202015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi's new boss could earn more than Total's  less than Pfizer's "
    },
    {
        "content": "Feb 25 U.S. health regulators on Wednesday approved Sanofi's diabetes drug Toujeo  a more potent follow-up to the French drugmaker's top-selling insulin product Lantus.",
        "date": "02262015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "U.S. FDA approves Sanofi's diabetes drug Toujeo "
    },
    {
        "content": "PARIS  Feb 20 Sanofi's new boss Olivier Brandicourt will earn up to 4.2 million euros ($4.8 million) a year at the drugs group and could pocket 4 million extra as a one-off golden handshake.",
        "date": "02202015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "New Sanofi boss will earn up to 4.2 mln eur a year "
    },
    {
        "content": "PARIS  Feb 18 French drugs group Sanofi  said it struck a deal with Dutch biotech group Lead Pharma to discover and develop treatments for a range of autoimmune diseases including rheumatoid arthritis  psoriasis and inflammatory bowel disease.",
        "date": "02182015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Lead Pharma in tie-up on autoimmune diseases "
    },
    {
        "content": "PARIS French drugmaker Sanofi  on Thursday named Olivier Brandicourt  a Paris-educated doctor and head of Bayer AG's  healthcare arm  as its chief executive officer.",
        "date": "02192015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi names CEO  cites 'capabililty to unite teams' "
    },
    {
        "content": "PARIS  Feb 19 French drugmaker Sanofi  on Thursday named Olivier Brandicourt  a Paris-educated doctor and head of Bayer AG's healthcare arm  as its chief executive officer.",
        "date": "02192015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi names CEO  cites 'capabililty to unite teams' "
    },
    {
        "content": "PARIS  Feb 19 Olivier Brandicourt  the Paris-educated doctor and head of Bayer AG's  healthcare arm who is widely tipped as the new boss of Sanofi   comes with the right scientific and cultural pedigree but faces some daunting corporate challenges.",
        "date": "02192015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "CORRECTED-Sanofi challenges will test likely new boss's pedigree "
    },
    {
        "content": "FRANKFURT  Feb 19 Germany's Bayer  said the head of its healthcare division  Olivier Brandicourt  would quit to become chief executive officer of French peer Sanofi on April 2.",
        "date": "02192015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Bayer healthcare head Brandicourt quits to take Sanofi top job "
    },
    {
        "content": "PARIS  Feb 16 French drugs group Sanofi  is set to announce this week that Olivier Brandicourt  head of Bayer AG's healthcare business  will become its new chief executive  le Figaro newspaper reported on Monday citing information it had obtained.",
        "date": "02162015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi to name Bayer's Brandicourt as CEO this week-Le Figaro "
    },
    {
        "content": "PARIS  Feb 13 Olivier Brandicourt  head of Bayer AG's healthcare business  is well placed to become chief executive of French drug maker Sanofi  Bloomberg reported on Friday  citing people with knowledge of the company's strategy.",
        "date": "02132015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Bayer's Brandicourt a frontrunner for top Sanofi job - Bloomberg "
    },
    {
        "content": "PARIS French drugs firm Sanofi  said it would be able to name a new chief executive in the coming weeks as it delivered 1.5 percent quarterly earnings per share growth and predicted that euro weakness could boost profits this year.",
        "date": "02052015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi to name new CEO in coming weeks as euro lifts results "
    },
    {
        "content": "* Chairman says no current plans for french job cuts but not ruled out in future",
        "date": "02052015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi chairman says new CEO external candidate "
    },
    {
        "content": "* Weinberg says has stabilised Lantus market share in United States",
        "date": "02052015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi to name new CEO in coming weeks as euro lifts results "
    },
    {
        "content": "PARIS  Feb 5 Sanofi said on Thursday it would be in a position to name a new chief executive by the end of the first quarter as it delivered fourth-quarter earnings boosted by the weak euro.",
        "date": "02052015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Weak euro boosts Sanofi earnings  to name CEO in Q1 "
    },
    {
        "content": "PARIS  Feb 3 Sanofi launched an inhalable insulin in the United States on Tuesday in a potential boost for its flagging diabetes drug sales and for patient quality of life.",
        "date": "02032015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi launches inhaled insulin for diabetics "
    },
    {
        "content": "PARIS  Jan 30 Barring a last-minute breakthrough  drugs firm Sanofi's Chairman Serge Weinberg may have to acknowledge in his results presentation next week that the hunt for a new chief executive is not going well.",
        "date": "01302015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Three months on  fruitless CEO search overshadows Sanofi "
    },
    {
        "content": "Jan 26 Regeneron Pharmaceuticals on Monday said U.S. health regulators accepted its application to review a potent  cholesterol drug on a priority basis  potentially giving it the upper hand in a fierce race with Amgen  to bring a new medicine from the promising class to market.",
        "date": "01262015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Regeneron/Sanofi cholesterol drug gets FDA priority review "
    },
    {
        "content": "DAVOS  Jan 21 Christophe Weber  chief operating officer of Takeda Pharmaceutical Co.  said on Wednesday he had been approached in connection with the vacant chief executive post at French drugs group Sanofi but decided to stay put.",
        "date": "01212015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Takeda's Weber was approached for Sanofi CEO job but not interested "
    },
    {
        "content": "PARIS European pharmaceuticals group Sanofi  on Thursday said it had agreed to pay 4.44 million euros ($5.06 million) in total to ousted chief executive Chris Viehbacher.",
        "date": "01222015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Ousted Sanofi CEO gets 4.44 million euro severance package "
    },
    {
        "content": "PARIS  Jan 22 European pharmaceuticals group Sanofi on Thursday said it had agreed to pay 4.44 million euros ($5.06 million) in total to ousted chief executive Chris Viehbacher.",
        "date": "01222015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Ousted Sanofi CEO gets 4.44 mln eur severance package "
    },
    {
        "content": "PARIS  Jan 22 European pharmaceuticals group Sanofi said former chief executive Christopher Viehbacher would receive 2.96 million euros ($3.37 million) as a severance payment following his ouster last autumn.",
        "date": "01222015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi grants ousted CEO Viehbacher 2.96 mln eur severance payment "
    },
    {
        "content": "* Says the European Commission has approved NexGard Spectra beef-flavored chews for dogs for the treatment of flea and tick infestations  the prevention of heartworm disease and/or the treatment of intestinal worms  Further company coverage:",
        "date": "01192015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi receives EU approval for dog parasite treatment "
    },
    {
        "content": "* Sanofi enters strategic manufacturing collaboration with boehringer ingelheim to produce biologics  Source text for Eikon:  Further company coverage:    (Reporting By Andrew Callus)",
        "date": "01152015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "BRIEF-Sanofi in manufacturing collaboration with Boehringer Ingelheim to produce biologics "
    },
    {
        "content": "PARIS  Jan 12 The European Medicines Agency has agreed to review an application by Sanofi and Regeneron for their cholesterol-lowering drug alirocumab  the pharmaceutical groups said in a statement.",
        "date": "01122015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Regeneron submit new cholesterol drug to EMA for review "
    },
    {
        "content": "PARIS  Jan 12 The European Medicines Agency has agreed to review an application by Sanofi and Regeneron for their cholesterol-lowering drug alirocumab  the pharmaceutical groups said in a statement on Monday.",
        "date": "01122015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 1-Sanofi  Regeneron submit new cholesterol drug to EMA for review "
    },
    {
        "content": "An experimental drug from Sanofi SA and Regeneron Pharmaceuticals was found to be effective in lowering \"bad\" cholesterol even when administered once every four weeks  instead of every two weeks.",
        "date": "01092015",
        "name": "Sanofi",
        "news_type": "topStory",
        "symbol": "SNY",
        "title": "Sanofi  Regeneron cholesterol drug also effective in monthly doses "
    },
    {
        "content": "Jan 9 An experimental drug from Sanofi SA   and Regeneron Pharmaceuticals was found to be effective in lowering \"bad\" cholesterol even when administered once every four weeks  instead of every two weeks.",
        "date": "01092015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "UPDATE 2-Sanofi  Regeneron cholesterol drug also effective in monthly doses "
    },
    {
        "content": "PARIS  Jan 9 Pharmaceutical groups Sanofi  and Regeneron announced on Friday that two clinical trials showed that a monthly dose of experimental drug alirocumab was effective in patients with high cholesterol.",
        "date": "01092015",
        "name": "Sanofi",
        "news_type": "normal",
        "symbol": "SNY",
        "title": "Sanofi  Regeneron announce positive trials of cholesterol drug "
    }
]