[
    {
        "content": "Nov 7 Signa Holding GmbH  the Austrian property and retail group that owns German department store operator Karstadt  sent Hudson's Bay Co this week details of the financing it has put together for its 3 billion euro bid ($3.5 billion) for Kaufhof  Germany's largest retail chain  owned by Hudson's Bay.",
        "date": "11072017",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "UPDATE 1-Signa sends Hudson's Bay details of financing for Kaufhof bid "
    },
    {
        "content": "Nov 1 Saks Fifth Avenue owner Hudson's Bay Co said on Wednesday it had received a bid for its German department store chain Kaufhof from Signa Holding  the Austrian property and retail group that owns Karstadt  another German retail chain.",
        "date": "11022017",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "UPDATE 3-Karstadt owner Signa makes offer for Hudson's Bay's Kaufhof "
    },
    {
        "content": "* Simon Property Group reports third quarter 2017 results and raises quarterly dividend",
        "date": "10272017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Group reports Q3 results  raises quarterly dividend "
    },
    {
        "content": "NEW  YORK  Oct 24 Vendors to Toys 'R' Us have resumed shipping top products  a bankruptcy lawyer said on Tuesday  allowing the retailer to stock its shelves ahead of the all-important holiday season.",
        "date": "10242017",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Toys 'R' Us says most top vendors have resumed shipments "
    },
    {
        "content": "* Simon Property Group reports second quarter 2017 results and raises quarterly dividend and full year 2017 guidance",
        "date": "08012017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Q2 FFO per share $2.47 "
    },
    {
        "content": "LOS ANGELES The owners of a giant rabbit named Simon who died on a United Airlines  flight while bound for the Iowa State Fair sued the carrier on Monday  claiming its employees were responsible for the hare's death.",
        "date": "07272017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "United Airlines sued by owners of giant rabbit found dead after flight "
    },
    {
        "content": "LOS ANGELES  July 26 The owners of a giant rabbit named Simon who died on a United Airlines flight while bound for the Iowa State Fair sued the carrier on Monday  claiming its employees were responsible for the hare's death.",
        "date": "07262017",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "United Airlines sued by owners of giant rabbit found dead after flight "
    },
    {
        "content": "* Simon Property Group to redeem all outstanding 5.65% notes due 2020",
        "date": "05252017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Group to redeem all outstanding 5.65% notes due 2020 "
    },
    {
        "content": "NEW YORK  May 25 Strong earnings from the battered U.S. retail sector  which helped lift Wall Street on Thursday  also boosted shares of the hard-hit real estate investment trusts (REITs) that own the properties where the retailers are located.",
        "date": "05252017",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Retail REIT shares rally as fear of e-commerce competition ebbs "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 24 (Fitch) Fitch Ratings has assigned an 'A' rating to the multi-tranche senior notes issued by Simon Property Group  L.P.  the operating partnership of Simon Property Group  Inc. (NYSE: SPG). The offering is comprised of notes due 2022  and 2027. KEY RATING DRIVERS SPG's 'A' Issuer Default Rating (IDR) reflects the company's high-quality retail real estate portfolio  cycle-tested management team  its market-leading access",
        "date": "05242017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Fitch Rates Simon Property Group's Notes Offering 'A' "
    },
    {
        "content": "* Simon property group inc - subsidiary has agreed to sell $600 million principal amount of its 2.625% senior notes due june 15  2022",
        "date": "05222017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Group sells $1.35 billion of senior notes "
    },
    {
        "content": "* Simon Property Group reports first quarter 2017 results and 9.4% year-over-year increase in quarterly dividend",
        "date": "04272017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Group Q1 FFO per share $2.74 "
    },
    {
        "content": "* CEO David Simon's 2016 total compensation was $13.2 million versus $14.2 million in 2015 - sec filing Source: (http://bit.ly/2nHgTCw) Further company coverage:",
        "date": "03312017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Group's CEO 2016 total compensation $13.2 mln "
    },
    {
        "content": "* Simon property group announces amended and extended $4.0 billion revolving credit facility",
        "date": "03172017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property announces amended and extended $4.0 bln revolving credit facility "
    },
    {
        "content": "* Discloseable Transaction Acquisition Of 80% Beneficial Ownership Interest In Property In San Francisco  California",
        "date": "02192017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Sre Group enters deal to acquire 80% beneficial ownership interest in property in San Francisco "
    },
    {
        "content": "(Recasts throughout; Adds analyst quote  details on mutual funds and ETFs  table  byline)     By Trevor Hunnicutt     NEW YORK  Feb 16 Investors boosted their bets on U.S.-based equity funds in the latest week and helped extend market gains since the presidential election  Lipper data showed on Thursday.     Stock funds based in the United States attracted nearly $11.5 billion during the week ended Feb. 15  including $8.9 billion into funds invested domestically  the data showed. ",
        "date": "02172017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "UPDATE 1-Resurgent U.S. stock fund inflows show return of 'Trump trade' "
    },
    {
        "content": "NEW YORK  Feb 9 Investors added $7.5 billion in cash to U.S.-based taxable bond funds during the week through Feb. 8  Lipper data showed on Thursday  marking the sixth straight week of inflows.     Stock funds based in the United States took in $2.4 billion during the week  the data showed.   (Reporting by Trevor Hunnicutt)",
        "date": "02092017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Investors put $7.5 bln in U.S.-based bond funds in week -Lipper "
    },
    {
        "content": "LONDON Global investors poured money into stocks  emerging markets and corporate debt in the week to Wednesday  as they continued to chase the Trump-induced reflation trade  data from Bank of America Merrill Lynch (BAML) showed on Friday.",
        "date": "02102017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Investors chase reflation trades via stocks  emerging assets: BAML "
    },
    {
        "content": "LONDON  Feb 10 Global investors poured money into stocks  emerging markets and corporate debt in the week to Wednesday  as they continued to chase the Trump-induced reflation trade  data from Bank of America Merrill Lynch (BAML) showed on Friday.",
        "date": "02102017",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Investors chase reflation trades via stocks  emerging assets-BAML "
    },
    {
        "content": "NEW YORK Investors showed an insatiable demand for fixed income during the latest week  handing over the most cash in about seven months to managers of U.S.-based taxable-bond funds  Lipper data showed on Thursday.",
        "date": "02102017",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "U.S.-based bond fund sales soar in latest week: Lipper "
    },
    {
        "content": "* Simon Property Group reports fourth quarter and full year 2016 results and raises quarterly dividend",
        "date": "01312017",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Group Inc Q4 FFO per share $2.53 "
    },
    {
        "content": "* Notes will be redeemed at a redemption price of $1 221.90 per $1 000 principal amount of notes",
        "date": "11172016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Group to redeem all outstanding 10.35% notes due 2019 "
    },
    {
        "content": "* Simon property - unit to sell $550 million of 2.35% senior notes due January 30  2022  $750 million of 3.25% senior notes due November 30  2026",
        "date": "11152016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Group sells $1.85 bln of multi-tranche senior notes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 17 (Fitch) Fitch Ratings has assigned an 'A' rating to the  $1.85 billion multi-tranche senior notes issued by Simon Property Group  L.P.   the operating partnership of Simon Property Group  Inc. (NYSE: SPG). The  offering is comprised of $550 million 2.35% notes due 2022  $750 million 3.25%  notes due 2026  and $550 million notes due 2046.  KEY RATING DRIVERS SPG's 'A' Issuer Default Rating (IDR) reflects the company",
        "date": "11172016",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Fitch Rates Simon Property Group's Notes Offering 'A' "
    },
    {
        "content": "* Simon Property Group reports third quarter 2016 results and raises full year 2016 guidance",
        "date": "10262016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Group posts Q3 FFO of $2.70/share "
    },
    {
        "content": "* Simon Property Group announces industry veteran James M. Barkley to be succeeded by Steven E. Fivel as general counsel and secretary  Source text for Eikon:  Further company coverage:",
        "date": "10172016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property Group announces general counsel and secretary change "
    },
    {
        "content": "* Authentic Brands Group  General Growth Properties and Simon Property Group finalizes acquisition of Aéropostale  Source text for Eikon:  Further company coverage:",
        "date": "09152016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Aéropostale consortium finalizes acquisition "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  July 25 (Fitch) Fitch Ratings has affirmed the ratings for Simon  Property Group  Inc. (NYSE: SPG) and the obligations of its subsidiaries  (detailed at the end of this release)  including the Issuer Default Rating (IDR)  at 'A'. The Rating Outlook is Stable.  KEY RATING DRIVERS SPG's 'A' IDR reflects the company's high-quality retail real estate portfolio   cycle-tested management team  its market-leading access to capital  a",
        "date": "07252016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Fitch Affirms Simon Property Group's IDR at 'A'; Outlook Stable "
    },
    {
        "content": "* Reports second quarter 2016 results and raises quarterly dividend and full year 2016 guidance",
        "date": "07272016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon Property reports Q2 FFO per share $2.63 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 12 (Fitch) Fitch Ratings has assigned an 'A' rating to EUR500  million of 1.25% senior unsecured notes issued by Simon International Finance   S.C.A.  a wholly-owned subsidiary of Simon Property Group  Inc. (NYSE: SPG). The  notes are guaranteed by Simon Property Group LP. A full list of ratings follows  at the end of this release. KEY RATING DRIVERS Simon's 'A' Long-Term Issuer Default Rating (IDR) reflects the strong qua",
        "date": "05122016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Fitch Rates Simon Property Group's EUR Notes Offering 'A' "
    },
    {
        "content": "Teen apparel retailer Pacific Sunwear of California Inc filed for Chapter 11 bankruptcy protection on Thursday  succumbing to mounting losses and intense competition from fast-fashion retailers and online rivals.",
        "date": "04072016",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Teen retailer Pacific Sunwear files for bankruptcy "
    },
    {
        "content": "* Shares fall more than 40 pct to record low   (Adds court ruling to restrict share trading  comments by lawyer for debtor)",
        "date": "04072016",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "UPDATE 4-Teen retailer Pacific Sunwear files for bankruptcy "
    },
    {
        "content": "* Says CEO David Simon fy 2015 total compensation $14.2 million versus $14.7 million in fy 2014 - sec filing",
        "date": "04012016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "BRIEF-Simon property Group says CEO David Simon FY 2015 total compensation was $14.2 mln "
    },
    {
        "content": "NEW YORK Stock mutual funds based in the United States posted $2.1 billion in withdrawals last week for the second consecutive week  Investment Company Institute (ICI) data showed on Wednesday  as U.S. equities broke a five-week winning streak.",
        "date": "03302016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Investors shy away from U.S. stock mutual funds for second week: ICI "
    },
    {
        "content": "Feb 5 Department store operator J.C. Penney Co Inc said it is pursuing a potential sale and partial leaseback of its headquarters in Texas to reduce debt and costs.",
        "date": "02052016",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "UPDATE 1-J.C. Penney looking at sale-leaseback deal for Texas HQ "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 12 (Fitch) Fitch Ratings has assigned an 'A' rating to $1.35  billion of senior unsecured notes issued by Simon Property Group  L.P  the  operating partnership of Simon Property Group  Inc.  The offering totalled $550 million of 2.5% senior unsecured due July 15  2021  and $800 million of 3.3% senior unsecured notes due Jan. 15  2026. The company  expects to use the net proceeds to retire three existing mortgage loans ",
        "date": "01122016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Fitch Rates Simon Property Group's Notes Offering 'A' "
    },
    {
        "content": "LONDON Investors dumped stocks and fled for the safety of bonds in the week to Jan. 6 which saw $2.3 trillion wiped off global equity markets and the worst opening week for the S&P 500 index  Bank of America Merrill Lynch (BAML) said on Friday.",
        "date": "01082016",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Investors dump U.S. stocks  seek bond safe haven: BAML "
    },
    {
        "content": "LONDON  Jan 8 Investors dumped stocks and fled for the safety of bonds in the week to Jan. 6 which saw $2.3 trillion wiped off global equity markets and the worst opening week for the S&P 500 index  Bank of America Merrill Lynch (BAML) said on Friday.",
        "date": "01082016",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Investors dump U.S. stocks  seek bond safe haven-BAML "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 11 (Fitch) Fitch Ratings has assigned an 'A' rating to the  EUR750 million issuance of 1.375% senior unsecured notes due 2022 by Simon  International Finance SCA  a subsidiary of Simon Property Group  Inc. (NYSE:  SPG). The notes will be fully and unconditionally guaranteed by Simon Property  Group  L.P.  the operating partnership of Simon Property Group  Inc. The company  expects to use the net proceeds to reduce its",
        "date": "11112015",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Fitch Rates Simon Property Group's Notes Offering 'A' "
    },
    {
        "content": "NEW YORK  June 19 Shares of mall operator Macerich Co fell as much as 7.3 percent on Friday on reports rival Simon Property Group Inc was selling a 3.6 percent stake  months after its failed takeover bid.",
        "date": "06192015",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "UPDATE 1-Macerich shares slump on talk Simon selling its stake "
    },
    {
        "content": "NEW YORK Even as the rise of online retailers such as Amazon.com Inc leads analysts to predict the eventual death of the American shopping mall  real estate fund managers are betting some will prosper – if they can lure the right kind of consumer.",
        "date": "05142015",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Fund managers make big bet on high-end malls via Simon "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  April 20 (Fitch) Fitch Ratings has affirmed its ratings on Simon  Property Group  Inc. (NYSE: SPG) and certain rated subsidiaries (collectively   Simon)  including SPG's long-term Issuer Default Rating (IDR) at 'A'. The Rating  Outlook is Stable. A full list of rating actions follows at the end of this  release. KEY RATING DRIVERS Fitch's affirmation of Simon's long-term IDR at 'A' reflects the strong quality  of the company's",
        "date": "04202015",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Fitch Affirms Simon Property Group's L-T IDR at 'A'; Outlook Stable "
    },
    {
        "content": "Macerich Co's  fourth largest shareholder  Cohen & Steers Inc   asked the shopping mall company on Wednesday to produce a plan that will deliver as much value as the takeover offer by Simon Property Group Inc  it turned down last month.",
        "date": "04162015",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Exclusive: Top Macerich shareholder calls for plan after Simon snub "
    },
    {
        "content": "NEW YORK  April 13 With Sears Holdings Corp  's second joint venture announcement this month on Monday  one question left to be answered is how much of the struggling mall anchor's property will be devoted to new  and potentially lucrative  retail space.",
        "date": "04132015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Value in new Sears JV with Simon is redevelopment of mall space "
    },
    {
        "content": "April 2 Activist investor Jonathan Litt has nominated four directors to Macerich Co's board after the U.S. mall owner rejected a takeover bid from larger rival Simon Property Group Inc  a person familiar with the situation said.",
        "date": "04022015",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Activist investor nominates directors to Macerich board - source "
    },
    {
        "content": "April 2 Simon Property Group Inc  the largest U.S. shopping mall owner  said it would buy back $2 billion in stock  less than 48 hours after scrapping an attempt to buy rival Macerich Co.",
        "date": "04022015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Simon Property to buy back $2 bln in stock after Macerich snub "
    },
    {
        "content": " ",
        "date": "04012015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Simon's failed bid suggests REIT values still at a discount "
    },
    {
        "content": "Simon Property Group Inc scrapped its attempt to buy Macerich Co  ending what could have been the largest deal between U.S. shopping mall operators after Macerich rejected its sweetened offer of $23.2 billion including debt.",
        "date": "04012015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Simon Property ends pursuit of Macerich "
    },
    {
        "content": "* Macerich shares fall as much as 5.5 pct   (Adds background and details; updates shares)",
        "date": "04012015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "UPDATE 2-Simon Property ends pursuit of Macerich "
    },
    {
        "content": "April 1 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "04012015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "April 1 Simon Property Group Inc  scrapped its attempt to buy Macerich Co after the smaller shopping mall owner rejected its sweetened offer of $23.2 billion including debt.",
        "date": "04012015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Simon Property withdraws offer to buy Macerich "
    },
    {
        "content": "April 1 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04012015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "PRESS DIGEST - Wall Street Journal - April 1 "
    },
    {
        "content": "NEW YORK  March 19 Whether a ploy to drive bidding higher or an effective roadblock  Macerich Co.'s  moves this week to ward off Simon Property Group Inc's  $14.39 billion hostile takeover gives the target company a stronger defense against a formidable adversary.",
        "date": "03192015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Macerich moves make Simon Property takeover bid tougher "
    },
    {
        "content": "* Simon Property will not nominate directors to Macerich board",
        "date": "03202015",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "UPDATE 4-Simon says: Macerich offer \"best and final\" "
    },
    {
        "content": "March 20 The following bids  mergers  acquisitions and disposals were reported by 1440 GMT on Friday:",
        "date": "03202015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Shares fall as much as 5 pct   (Adds Breakingviews link  updates stock prices)",
        "date": "03172015",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "UPDATE 4-Macerich rejects Simon Property offer  adopts poison pill "
    },
    {
        "content": "March 20 Simon Property Group Inc  the largest U.S. shopping mall owner  raised its offer for smaller rival Macerich Co to $95.50 per share in cash and stock.",
        "date": "03202015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Simon Property raises offer for Macerich to $95.50/share "
    },
    {
        "content": "March 17 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Tuesday:",
        "date": "03172015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "March 17 Macerich Co  the third-largest U.S. shopping mall owner  rejected a $14.39 billion offer from larger rival Simon Property Group Inc  saying the offer \"substantially undervalues\" the company.",
        "date": "03172015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Macerich rejects Simon Property's offer  adopts poison pill "
    },
    {
        "content": "NEW YORK  March 10 People have been writing epitaphs for brick-and-mortar malls for years  but Simon Property Group Inc's unsolicited takeover bid for rival Macerich Co shows there is still plenty of interest in the limited supply of upscale shopping centers.",
        "date": "03102015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Simon Property's bid for Macerich shows allure of upscale malls "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 09 (Fitch) The proposal by Simon Property Group  Inc. (NYSE:  SPG) to acquire The Macerich Company (NYSE: MAC  Macerich) for $91.00 per share  in cash and SPG shares  if consummated as proposed  would likely have negative  credit implications for SPG according to Fitch Ratings.  The proposed  transaction would increase SPG's leverage materially above the 5.1x level as of  Dec. 31  2014 while also lowering the company's u",
        "date": "03092015",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "Fitch: Simon's Proposed Acquisition of Macerich Would Likely Have Negative Credit Implications "
    },
    {
        "content": "March 9 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "03092015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Simon Property Group Inc  offered to buy Macerich Co  for $14.39 billion in a deal that would join the No. 1 and No. 3 U.S. shopping mall owners.",
        "date": "03092015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Mall owner Simon pushes rival Macerich to do a deal "
    },
    {
        "content": "* Macerich shares brush past offer to touch 8-year high   (Adds Macerich's response in paragraph 12  updates share)",
        "date": "03092015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "UPDATE 3-Mall owner Simon pushes rival Macerich to do a deal "
    },
    {
        "content": "March 9 Simon Property Group Inc  an owner of malls and outlet centers  said it had offered to buy real estate investment trust Macerich Co in a cash and stock deal for $22.4 billion including debt.",
        "date": "03092015",
        "name": "Simon Property Group Inc",
        "news_type": "normal",
        "symbol": "SPG",
        "title": "Simon offers to buy Macerich for $22.4 bln in cash and stock "
    },
    {
        "content": "* Investors lost $536 million   (Adds quotes  background  detail)",
        "date": "01192015",
        "name": "Simon Property Group Inc",
        "news_type": "topStory",
        "symbol": "SPG",
        "title": "UPDATE 2-Boss of UK hedge fund Weavering convicted in fraud case "
    }
]