[
    {
        "content": "* Splunk Inc. announces fiscal third quarter 2018 financial results",
        "date": "11162017",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Splunk announces Q3 GAAP loss per share $0.36 "
    },
    {
        "content": "* Vodafone Australia signs enterprise software and services agreement with Splunk",
        "date": "10302017",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Vodafone Australia signs enterprise software and services agreement with Splunk "
    },
    {
        "content": "* Splunk Inc - ‍acquisition was funded with cash from Splunk's balance sheet for an undisclosed amount​",
        "date": "10172017",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Splunk acquires SignalSense "
    },
    {
        "content": "* Splunk Inc - ‍acquired technology and intellectual property assets of Rocana for an undisclosed amount​",
        "date": "10092017",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Splunk acquires Rocana assets "
    },
    {
        "content": "* Splunk Inc announces fiscal second quarter 2018 financial results",
        "date": "08242017",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Splunk Inc reports Q2 non-GAAP earnings per share $0.08 "
    },
    {
        "content": "* Splunk inc. Announces fiscal first quarter 2018 financial results",
        "date": "05252017",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Splunk Q1 adjusted loss per share $0.01 "
    },
    {
        "content": "* Splunk Inc announces fiscal third quarter 2017 financial results",
        "date": "11292016",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Splunk Inc announces fiscal third quarter 2017 financial results "
    },
    {
        "content": "* Splunk appoints Richard Campione as chief product officer  Source text for Eikon:  Further company coverage:",
        "date": "11142016",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Splunk appoints Richard Campione as Chief Product Officer "
    },
    {
        "content": "* Sees Q2 non-GAAP operating margin is expected to be between 2 pct and 3 pct",
        "date": "05262016",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Splunk posts Q1 non-gaap loss per share of $0.02 "
    },
    {
        "content": "* Cuts share stake in Tableau Software Inc by 28.1 percent to 1.7 million Class A shares",
        "date": "05162016",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Tiger Global cuts stake in Tableau Software  dissolves stake in Splunk "
    },
    {
        "content": "* CEO Douglas Merritt's 2016 total compensation was $3.6 million - SEC filing",
        "date": "04272016",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Splunk CEO Merritt's 2016 compensation $3.6 mln - SEC filing "
    },
    {
        "content": "* Senior vice president  products Guido Schroeder's employment with co will terminate on or before april 29  2016  Source text for Eikon: (1.usa.gov/1RwjSlA) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03212016",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "BRIEF-Splunk to terminate Guido Schroeder's employment on or before April 29 "
    },
    {
        "content": "Feb 25 Data analytics software maker Splunk Inc  forecast full-year revenue far ahead of analysts' estimates  sending the company's shares up 11 percent in after-market trading.",
        "date": "02252016",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "UPDATE 1-Data analytics provider Splunk's revenue forecast beats estimates "
    },
    {
        "content": "Data analytics software maker Splunk Inc reported a 49 percent rise in quarterly revenue as businesses increasingly turn to data analytics to secure their networks from a surge in highly sophisticated cyber attacks.",
        "date": "02252016",
        "name": "Splunk Inc",
        "news_type": "normal",
        "symbol": "SPLK",
        "title": "Data analytics software maker Splunk's revenue jumps 49 percent "
    },
    {
        "content": "Feb 25 Data analytics software maker Splunk Inc  reported a 49 percent rise in quarterly revenue as businesses increasingly turn to data analytics to secure their networks from a surge in highly sophisticated cyber attacks.",
        "date": "02252016",
        "name": "Splunk Inc",
        "news_type": "normal",
        "symbol": "SPLK",
        "title": "Data analytics software maker Splunk's revenue jumps 49 pct "
    },
    {
        "content": "Splunk Inc  forecast full-year revenue above analysts' expectations as businesses increasingly turn to data analytics to secure their networks from a surge in highly sophisticated cyber attacks.",
        "date": "02262015",
        "name": "Splunk Inc",
        "news_type": "topStory",
        "symbol": "SPLK",
        "title": "Splunk's revenue forecast beats Street on data analytics demand "
    },
    {
        "content": "Feb 26 Splunk Inc forecast full-year revenue above analysts' expectations as businesses increasingly turn to data analytics to secure their networks from a surge in highly sophisticated cyber attacks.",
        "date": "02262015",
        "name": "Splunk Inc",
        "news_type": "normal",
        "symbol": "SPLK",
        "title": "UPDATE 2-Splunk's revenue forecast beats Street on data analytics demand "
    },
    {
        "content": "Feb 26 Data analytics software maker Splunk Inc  reported a 47.5 percent rise in quarterly revenue as it added more customers.",
        "date": "02262015",
        "name": "Splunk Inc",
        "news_type": "normal",
        "symbol": "SPLK",
        "title": "Software maker Splunk's revenue jumps 47.5 pct "
    }
]