[
    {
        "content": "Aircraft parts maker Spirit AeroSystems Holdings Inc  on Wednesday posted a decline in quarterly operating margins  hurt by lower maintenance  repair and overhaul services sales.",
        "date": "11012017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit AeroSystems' profit in-line but margins decline "
    },
    {
        "content": "Nov 1 Aircraft parts maker Spirit AeroSystems Holdings Inc on Wednesday posted a decline in quarterly operating margins  hurt by lower maintenance  repair and overhaul services sales.",
        "date": "11012017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 1-Spirit AeroSystems' profit in-line but margins decline "
    },
    {
        "content": "* Spirit Aerosystems announces solid third quarter 2017 operating results with EPS up 9% Y/Y and cash from operations up 9% Y/Y; finalized definitive agreements with boeing; executed $194 million in share repurchases",
        "date": "11012017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aerosystems holdings Q3 earnings per share $1.26 "
    },
    {
        "content": "Nov 1 Aircraft parts maker Spirit AeroSystems Holdings Inc reported a 1.4 percent rise in quarterly profit on Wednesday  due to higher deliveries to Boeing Co and France's Airbus SE  its biggest customers.",
        "date": "11012017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems' quarterly profit rises 1.4 pct "
    },
    {
        "content": "* Completed negotiations with Boeing resolving commercial issues through 2022 related to production for several Boeing programs Source text for Eikon: Further company coverage:",
        "date": "09252017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aerosystems finalizes agreement with Boeing "
    },
    {
        "content": "FRANKFURT  Sept 23 Airbus SE is in talks to sell a part or all of Premium Aerotec  a subsidiary that makes large plane components  Die Welt newspaper reported on Saturday.",
        "date": "09232017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Airbus in talks to sell Premium Aerotec parts subsidiary -Die Welt "
    },
    {
        "content": "Aug 2 Spirit AeroSystems Holdings Inc's shares hit a record high after it reached a tentative agreement with Boeing Co on pricing terms related to parts it supplies for aircraft such as the 787 Dreamliner.",
        "date": "08022017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "RPT-UPDATE 4-Spirit AeroSystems' shares soar on Boeing deal "
    },
    {
        "content": "Spirit AeroSystems Holdings Inc's  shares hit a record high after it reached a tentative agreement with Boeing Co  on pricing terms related to parts it supplies for aircraft such as the 787 Dreamliner.",
        "date": "08022017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems' shares soar on Boeing deal "
    },
    {
        "content": "* Q2 profit  revenue beat Street (Adds details; updates shares)",
        "date": "08022017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 4-Spirit AeroSystems' shares soar on Boeing deal "
    },
    {
        "content": "* Spirit aero says going forward expects to generate annual free cash flow of 7-9 percent of revenue  up from from 6-8 percent - conf call Further company coverage:",
        "date": "08022017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aero expects to generate 2018 free cash flow of 7-9 pct of revenue "
    },
    {
        "content": "Aug 2 Aircraft parts maker Spirit AeroSystems Holdings Inc said it reached an agreement with Boeing Co   its biggest customer  on pricing issues related to aircraft programs such as the single-aisle 737 MAX and the 787 Dreamliner.",
        "date": "08022017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems reaches agreement with Boeing "
    },
    {
        "content": "* Spirit Aerosystems announces strong second quarter 2017 operating results; signs MOU for long-term agreement with boeing to settle open issues; increases share repurchase authorization up to $1 billion; raises 2017 cash from operations and free cash flow* guidan",
        "date": "08022017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aerosystems reports Q2 loss per share of $0.48 "
    },
    {
        "content": "Aircraft parts maker Spirit AeroSystems Holdings Inc's  shares slumped on Wednesday after the company said it was taking \"longer than expected\" to agree on prices with its biggest customer  Boeing Co   which analysts said may create uncertainty over its cash flow growth.",
        "date": "05032017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit Aero's shares sink as pricing talks with Boeing drag on "
    },
    {
        "content": "* SETS REGULAR QUARTERLY DIVIDEND OF $0.10 PER SHARE Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "BRIEF-SPIRIT AEROSYSTEMS HOLDINGS SETS REGULAR QUARTERLY DIVIDEND OF $0.10 PER SHARE "
    },
    {
        "content": "May 3 Aircraft parts maker Spirit AeroSystems Holdings Inc reported a 17.4 percent fall in quarterly profit  due to fewer deliveries to Boeing Co  its biggest customer.",
        "date": "05032017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems profit falls 17.4 pct "
    },
    {
        "content": " (The March 8 story was refiled to correct paragraph 7 to show that Lawson not a nominee; fixes paragraph 9 to show Lawson and Elliott did not see violation of non-compete agreement)",
        "date": "03102017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit AeroSystems says ex-CEO breached retirement deal: Elliott filing "
    },
    {
        "content": "March 8 Elliott Management reported in a regulatory filing that Spirit AeroSystems Holdings has said its former chief executive officer  Larry Lawson  has breached his retirement contract by consulting for the hedge fund during its proxy fight with Arconic Inc.",
        "date": "03102017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "CORRECTED-Spirit AeroSystems says ex-CEO breached retirement deal -Elliott filing "
    },
    {
        "content": "SEATTLE Spirit AeroSystems Holdings Inc   a major supplier to Boeing Co  and Airbus   is demanding steep price cuts from its hundreds of parts suppliers  forcing them to re-bid for their current work against global competitors  according to a document seen by Reuters and three sources familiar with the matter.",
        "date": "03022017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Exclusive: Spirit Aero tells suppliers jobs may go offshore - sources "
    },
    {
        "content": "* With respect to ongoing negotiations with Boeing  \"coversations are constructive\" - Conf call  Further company coverage:",
        "date": "02012017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aero says ongoing negotiations with Boeing are \"constructive\" - Conf call "
    },
    {
        "content": "Feb 1 Aircraft parts maker Spirit AeroSystems Holdings Inc reported a lower-than-expected quarterly revenue on Wednesday as its biggest customer  Boeing Co  faces slowing demand for jetliners.",
        "date": "02012017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 2-Spirit Aero's quarterly revenue hurt by lower deliveries to Boeing "
    },
    {
        "content": "* Meets guidance in 2016; issues increased 2017 guidance for revenue  EPS  and cash",
        "date": "02012017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aerosystems reports Q4 EPS $0.89 "
    },
    {
        "content": "* Contract will bring to company full contribution to turnover as of 2019  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "01242017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "BRIEF-Figeac Aero signs a contract with Spirit Aerosystems "
    },
    {
        "content": "SEATTLE Spirit AeroSystems Holdings Inc   a major supplier to aircraft maker Boeing Co   is considering outsourcing up to 85 U.S. supply chain jobs  possibly to a company overseas  according to three people familiar with the plan.",
        "date": "01202017",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Exclusive: Spirit AeroSystems mulls sending U.S. supply chain jobs overseas "
    },
    {
        "content": "* Raises 2016 profit forecast to $4.50-$4.65/shr from $4.30-$4.50",
        "date": "11012016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "UPDATE 3-Spirit Aero raises 2016 profit  revenue forecasts; sets first div "
    },
    {
        "content": "* Spirit Aerosystems Holdings reports third quarter 2016 financial results; raises full-year guidance on revenue  eps  and cash; completed existing repurchase program and announces new $600 million repurchase program; initiates quarterly dividend",
        "date": "11012016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aerosystems Holdings Q3 earnings per share $1.16 "
    },
    {
        "content": "Nov 1 Aircraft parts maker Spirit AeroSystems Holdings Inc reported a 7.4 percent rise in quarterly revenue on Tuesday  helped by higher deliveries to Airbus Group SE  its second-biggest customers.",
        "date": "11012016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems' revenue rises 7.4 pct  helped by Airbus "
    },
    {
        "content": "* Darsana Capital Partners LP reports 5.4 pct passive stake in Spirit Aerosystems Holdings as of September 16  2016 - SEC filing  Source text for Eikon: (http://bit.ly/2deWBfh) Further company coverage:",
        "date": "09262016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "BRIEF-Darsana Capital Partners reports 5.4 pct passive stake in Spirit Aerosystems "
    },
    {
        "content": "Aircraft parts supplier Spirit AeroSystems Holdings Inc  reported a 7.7 percent rise in quarterly revenue  boosted by higher deliveries of planes.",
        "date": "08032016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit AeroSystems reports 7.7 percent rise in revenue "
    },
    {
        "content": "NEW YORK Aircraft parts supplier Spirit AeroSystems Holdings Inc  said on Wednesday it had signed a key supply deal with Europe's Airbus   sending Spirit shares up as much as 8 percent.",
        "date": "08032016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit Aero shares rise as much as 8 percent on Airbus deal  forecast "
    },
    {
        "content": "NEW YORK  Aug 3 Aircraft parts supplier Spirit AeroSystems Holdings Inc said on Wednesday it had signed a key supply deal with Europe's Airbus  sending Spirit shares up as much as 8 percent.",
        "date": "08032016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "CORRECTED-Spirit Aero shares rise as much as 8 percent on Airbus deal  forecast "
    },
    {
        "content": "* Extends Airbus agreement for A350 XWB planes to 800 ship-sets",
        "date": "08032016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 2-Spirit AeroSystems profit beats on higher deliveries "
    },
    {
        "content": "* Q2 earnings per share view $1.06 -- Thomson Reuters I/B/E/S",
        "date": "08032016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aerosystems sees 2016 EPS of $3.45-$3.65 "
    },
    {
        "content": "SEATTLE Employees laid off by Spirit AeroSystems Holdings Inc in 2013 filed a lawsuit on Monday accusing the aircraft parts supplier of singling them out by age and disability.",
        "date": "07112016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Former Spirit AeroSystems workers file discrimination suit "
    },
    {
        "content": "SEATTLE  July 11 Employees laid off by Spirit AeroSystems Holdings Inc in 2013 filed a lawsuit on Monday accusing the aircraft parts supplier of singling them out by age and disability.",
        "date": "07112016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 2-Former Spirit AeroSystems workers file discrimination suit "
    },
    {
        "content": "SEATTLE  July 11 Former employees of Spirit AeroSystems Holdings Inc said they filed a suit on Monday alleging the company singled them out by age in conducting layoffs in 2013.",
        "date": "07112016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Former Spirit AeroSystems workers sue  alleging age discrimination "
    },
    {
        "content": "WICHITA  Kansas  June 23 Aircraft parts maker Spirit AeroSystems Holdings is in \"active dialog\" with top customer Boeing Co to replace a long-term supply agreement that expired last year but is in \"no hurry to get a deal done\"  Spirit's incoming CEO said on Thursday.",
        "date": "06242016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit Aero's incoming CEO: Boeing supply deal talks on but no deadline "
    },
    {
        "content": "* Entered into a $1.15 billion senior unsecured amended and restated credit agreement",
        "date": "06102016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aerosystems enters $1.15 bln amended credit agreement "
    },
    {
        "content": "NEW YORK  June 8 Aircraft parts maker Spirit AeroSystems Holdings Inc named Chief Operating Officer Tom Gentile to succeed Chief Executive Larry Lawson on Wednesday  a long-expected move - but the company's shares fell 3.5 percent.",
        "date": "06082016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "UPDATE 1-Spirit AeroSystems taps Gentile to succeed Lawson as CEO "
    },
    {
        "content": "* Outgoing ceo lawson will get separation payments of $1.3 million  which is equal to one year of his current base salary",
        "date": "06082016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aerosystems outgoing CEO to get separation payments of $1.3 mln "
    },
    {
        "content": "June 8 Aircraft parts maker Spirit AeroSystems Holdings Inc said Chief Executive Larry Lawson was set to retire on July 31  and would be replaced by Chief Operating Officer Tom Gentile.",
        "date": "06082016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems CEO to retire; COO to take helm "
    },
    {
        "content": "* Spirit AeroSystems Holdings says its unit commenced an offer to purchase $300 million outstanding principal amount of its 6 3/4% senior notes due 2020",
        "date": "05242016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "BRIEF-Spirit AeroSystems says commences offer for outstanding 6 3/4% senior notes due 2020 "
    },
    {
        "content": "* Spirit Aerosystems Holdings Inc files for potential debt shelf  size not disclosed - SEC filing  Source - (http://bit.ly/1qs28Bu) Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05172016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "BRIEF-Spirit Aerosystems Holdings Inc files for potential debt shelf  size not disclosed - SEC filing "
    },
    {
        "content": "April 27 Boeing Co took a surprise $156 million charge for its KC-46 aerial refueling tanker on Wednesday  pushing first-quarter profit down 9 percent amid concern about meeting deadlines for the U.S. Air Force program.",
        "date": "04272016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 3-Boeing profit takes hit from tanker  747; outlook unchanged "
    },
    {
        "content": "Aircraft parts maker Spirit AeroSystems Holdings Inc  reported a better-than-expected quarterly profit  helped by higher deliveries of Airbus Group SE's  planes.",
        "date": "04292016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Airbus business helps Spirit Aero beat profit estimates "
    },
    {
        "content": "NEW YORK Aircraft parts maker Spirit AeroSystems Holdings Inc said on Friday that it is seeing no slowdown in demand from Airbus resulting from undelivered planes piling up at European factories  awaiting interiors.",
        "date": "04292016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems CEO sees no impact from Airbus jet backlog "
    },
    {
        "content": "NEW YORK  April 29 Aircraft parts maker Spirit AeroSystems Holdings Inc said on Friday that it is seeing no slowdown in demand from Airbus resulting from undelivered planes piling up at European factories  awaiting interiors.",
        "date": "04292016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 1-Spirit AeroSystems CEO sees no impact from Airbus jet backlog "
    },
    {
        "content": "NEW YORK  April 29 Spirit AeroSystems Holdings Inc said on Friday that it is seeing no slowdown in demand from Airbus resulting from undelivered planes piling up at European factories  waiting for interiors.",
        "date": "04292016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems sees no impact from Airbus plane pile-up "
    },
    {
        "content": "* Spirit AeroSystems Holdings Inc. reports first quarter 2016 financial results; revenues of $1.7 billion and EPS of $1.29",
        "date": "04292016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "BRIEF-Spirit AeroSystems Holdings reports Q1 EPS of $1.29 "
    },
    {
        "content": "NEW YORK Spirit AeroSystems Holdings Inc confirmed on Friday that it would no longer be providing a wide range of spare parts for Boeing aircraft after the planemaker canceled its license  eliminating a small but lucrative business.",
        "date": "04012016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit says spare parts work Boeing revoked is minimal "
    },
    {
        "content": "NEW YORK  April 1 Spirit AeroSystems Holdings Inc confirmed on Friday that it would no longer be providing a wide range of spare parts for Boeing aircraft after the planemaker canceled its license  eliminating a small but lucrative business.",
        "date": "04012016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 2-Spirit says spare parts work Boeing revoked is minimal "
    },
    {
        "content": "NEW YORK Boeing Co  said it is ending an agreement with one of its largest suppliers  Spirit AeroSystems Holdings Inc   effectively taking away manufacturing of profitable spare parts used in aircraft repairs.",
        "date": "04012016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Exclusive: Boeing takes spare-part making from Spirit AeroSystems "
    },
    {
        "content": "WASHINGTON  Feb 16 Aircraft parts maker Spirit AeroSystems Holdings Inc on Tuesday said it had named Tom Gentile  a former senior General Electric Co  executive  as executive vice president and chief operating officer  effective April 1.",
        "date": "02172016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit Aero names former GE exec as COO "
    },
    {
        "content": "Aircraft parts maker Spirit AeroSystems Holdings Inc  forecast 2016 profit largely above Wall Street expectations despite Boeing Co   its biggest customer  expecting to deliver fewer planes this year.",
        "date": "02032016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit AeroSystems forecasts profit largely above Street "
    },
    {
        "content": "Feb 3 Aircraft parts maker Spirit AeroSystems Holdings Inc forecast 2016 profit largely above Wall Street expectations despite Boeing Co  its biggest customer  expecting to deliver fewer planes this year.",
        "date": "02032016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 1-Spirit AeroSystems forecasts profit largely above Street "
    },
    {
        "content": "Feb 3 Aircraft parts maker Spirit AeroSystems Holdings Inc reported a 2.2 percent rise in quarterly revenue  helped by strong demand for commercial planes.",
        "date": "02032016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems revenue rises 2.2 pct "
    },
    {
        "content": "WASHINGTON Aircraft parts maker Spirit AeroSystems Holdings Inc  is interviewing several candidates for the position of chief operating officer as part of a succession plan for Chief Executive Officer Larry Lawson  according to two people familiar with the matter.",
        "date": "01272016",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Exclusive: Spirit Aero looks for COO as part of succession plan - sources "
    },
    {
        "content": "Spirit AeroSystems Holdings Inc  would feel only a modest impact if Boeing Co  cut production rates of its 777 mini-jumbo jetliner  Chief Executive Larry Lawson said on Tuesday.",
        "date": "10272015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit AeroSystems sees modest impact if Boeing cuts 777 rate "
    },
    {
        "content": "Oct 27 Spirit AeroSystems Holdings Inc  would feel only a modest impact if Boeing Co cut production rates of its 777 mini-jumbo jetliner  Chief Executive Larry Lawson said on Tuesday.",
        "date": "10272015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 1-Spirit AeroSystems sees modest impact if Boeing cuts 777 rate "
    },
    {
        "content": "Oct 27 Spirit AeroSystems Holdings Inc  would feel only a modest impact if Boeing Co cut production rates of its 777 mini-jumbo jetliner  Chief Executive Larry Lawson said on Tuesday.",
        "date": "10272015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit Aerosystems sees only modest impact if Boeing cuts 777 rate "
    },
    {
        "content": "NEW YORK  Sept 2 Boeing Co delivered 14 of its 787 Dreamliners in August  exceeding for the second straight month its 10-a-month target and suggesting strong financial performance later in the year   people familiar with the situation said on Wednesday.",
        "date": "09022015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Boeing delivers 14 Dreamliners  strong cash flow seen - sources "
    },
    {
        "content": "Spirit AeroSystems Holdings Inc  reported a better-than-expected quarterly profit and said it would buy back up to $350 million of its stock  indicating that it has finally put years of losses from its Gulfstream business behind it.",
        "date": "07292015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit Aero profit beat  buyback send shares to record high "
    },
    {
        "content": "* Shares touch record high of $56.78   (Adds analyst comment  details; updates shares)",
        "date": "07292015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 2-Spirit Aero profit beat  buyback send shares to record high "
    },
    {
        "content": "July 29 Aircraft parts maker Spirit AeroSystems Holdings Inc reported an 8.4 percent rise in quarterly profit as costs fell.",
        "date": "07292015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems profit rises 8.4 pct on lower costs "
    },
    {
        "content": "April 29 Aircraft parts maker Spirit AeroSystems Holdings Inc reported better-than-expected quarterly profit and revenue  helped by strong demand for commercial planes.",
        "date": "04292015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "UPDATE 1-Spirit Aero profit rises on higher demand for commercial planes "
    },
    {
        "content": "April 29 Aircraft parts maker Spirit AeroSystems Holdings Inc reported an 18.4 percent rise in quarterly profit  helped by strong demand for commercial planes.",
        "date": "04292015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit Aero profit rises 18.4 pct "
    },
    {
        "content": "NEW YORK  March 4 Share buy backs are \"top of the list\" for returning cash to shareholders  Spirit Aerosystems Holdings Inc's chief executive officer told an investor conference on Wednesday.",
        "date": "03042015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit Aerosystems CEO says share buy backs are priority for cash use "
    },
    {
        "content": "Spirit AeroSystems Holdings Inc   which makes fuselages for Boeing Co   reported a better-than-expected quarterly profit as the world's largest planemaker bumped up production.",
        "date": "02032015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "topStory",
        "symbol": "SPR",
        "title": "Spirit AeroSystems profit beats estimate as Boeing deliveries rise "
    },
    {
        "content": "Feb 3 Spirit AeroSystems Holdings Inc  which makes fuselages for Boeing Co  reported a better-than-expected quarterly profit as the world's largest planemaker bumped up production.",
        "date": "02032015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "UPDATE 1-Spirit AeroSystems profit beats estimate as Boeing deliveries rise "
    },
    {
        "content": "Feb 3 Spirit AeroSystems Holdings Inc  which makes fuselages for Boeing Co  reported a 5 percent rise in quarterly revenue as the world's largest planemaker bumped up production.",
        "date": "02032015",
        "name": "Spirit Aerosystems Holdings Inc",
        "news_type": "normal",
        "symbol": "SPR",
        "title": "Spirit AeroSystems revenue rises 5 pct as Boeing deliveries rise "
    }
]