[
    {
        "content": "Payments company Square Inc  posted better-than-expected third-quarter results and raised its full-year profit and revenue forecasts  as a growing number of larger merchants used its technology to process transactions.",
        "date": "11102017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Payments company Square beats estimates  raises full-year forecasts "
    },
    {
        "content": "Nov 8 Payments company Square Inc posted better-than-expected third-quarter results and raised its full-year profit and revenue forecasts  as a growing number of larger merchants used its technology to process transactions.",
        "date": "11082017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "UPDATE 2-Payments company Square beats estimates  raises full-year forecasts "
    },
    {
        "content": "* Square Inc - Qtrly  net loss per share  basic and diluted  was $0.04‍​",
        "date": "11082017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "BRIEF-Square Inc Q3 2017 adjusted net income per share was $0.07‍​ "
    },
    {
        "content": "Nov 8 Mobile payments company Square Inc posted better-than-expected third-quarter results and raised its full-year profit and revenue forecasts  as a growing number of merchants increasingly used its technology to process transactions.",
        "date": "11082017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "CORRECTED-UPDATE 1-Dorsey-led Square beats Street  raises full-year forecasts "
    },
    {
        "content": "Nov 8 Mobile payments company Square Inc posted a smaller third-quarter loss on Wednesday  as larger merchants increasingly used its technology to process transactions.",
        "date": "11082017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "REFILE-Square Inc posts smaller loss as transaction volumes grow "
    },
    {
        "content": "WASHINGTON/NEW YORK U.S. regulations that bar companies such as Wal-Mart Stores Inc  from providing banking services should be reviewed as they reduce competition and concentrate more risk among a smaller number of banks  a U.S. banking regulator said on Wednesday.",
        "date": "11082017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "U.S. should let more companies offer bank services: regulator "
    },
    {
        "content": "* Square Inc says ‍on November 1  2017  board of directors increased size of board to eleven directors​ - SEC filing Source text: (http://bit.ly/2A1HIF8) Further company coverage:",
        "date": "11022017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square Inc says ‍on Nov. 1  size of board increased to eleven - SEC filing "
    },
    {
        "content": "WASHINGTON  Nov 8 U.S. regulations that bar companies such as Wal-Mart Stores Inc from providing banking services need to be reviewed as they reduce competition thereby concentrating more risk among a smaller number of banks  a U.S. banking regulator said on Wednesday.",
        "date": "11082017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "U.S. regulator says time to review mixing banking with other businesses "
    },
    {
        "content": "* Square names Anna Patterson  founder and managing partner of Google’S Gradient Ventures  to Board of Directors",
        "date": "11022017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "BRIEF-Square names Anna Patterson to Board of Directors "
    },
    {
        "content": "* Square Inc - ‍Square's contactless and chip reader is available to local businesses across Canada​ Source text for Eikon: Further company coverage:",
        "date": "10032017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square says launches new contactless and chip reader in Canada "
    },
    {
        "content": "* Square Inc - ‍strategic partnership with Eventbrite; invested $25 million in Eventbrite​ Source text for Eikon: Further company coverage:",
        "date": "09282017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square partners with Eventbrite to create Omni-channel payments solution "
    },
    {
        "content": "* Square names Naveen Rao  leader in artificial intelligence  to board of directors",
        "date": "09212017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square names Naveen Rao to board of directors "
    },
    {
        "content": "SAN FRANCISCO  Aug 26 Four tablets from various delivery companies crowd the front counter of Proposition Chicken in San Francisco  each calling out with its own ring when an order arrives.",
        "date": "08262017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "Food delivery creates tech headache for some U.S. restaurants "
    },
    {
        "content": "Payments company Square Inc   reported a better-than-expected 26 percent jump in quarterly revenue on Wednesday  as larger businesses used its technology to process transactions and it expanded the range of financial products it offers.",
        "date": "08022017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Square beats expectations on higher transactions "
    },
    {
        "content": "Aug 2 Payments company Square Inc  reported a better-than-expected 26 percent jump in quarterly revenue on Wednesday  as larger businesses used its technology to process transactions and it expanded the range of financial products it offers.",
        "date": "08022017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "UPDATE 2- Square beats expectations on higher transactions "
    },
    {
        "content": "Aug 2 Square Inc  the payments company co-founded by Twitter Inc Chief Executive Jack Dorsey  reported a smaller quarterly loss on Wednesday  as customers processed more transactions through its technology.",
        "date": "08022017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "Dorsey's Square reports smaller quarterly loss "
    },
    {
        "content": "* Square Inc - ‍board increased its size to nine directors​ Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square Inc ‍board increases board size to nine directors​ "
    },
    {
        "content": "Payments company Square Inc   reported a smaller-than-expected quarterly loss on Wednesday and raised its earnings forecast  as customers processed more transactions through its technology and it extended the reach of its services.",
        "date": "05042017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Square beats expectations  offers upbeat outlook "
    },
    {
        "content": "May 3 Payments company Square Inc  reported a smaller-than-expected quarterly loss on Wednesday and raised its earnings forecast  as customers processed more transactions through its technology and it extended the reach of its services.",
        "date": "05032017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "UPDATE 2-Square beats expectations  offers upbeat outlook "
    },
    {
        "content": "May 3 Square Inc  the payments company co-founded by Twitter Inc Chief Executive Jack Dorsey  reported a smaller-than-expected quarterly loss on Wednesday  as customers processed more transactions through its network and costs fell.",
        "date": "05032017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "CORRECTED-UPDATE 1-Dorsey-led Square posts smaller-than-expected qtrly loss "
    },
    {
        "content": "* Square Inc says total net revenue was $462 million in the first quarter of 2017  up 22% compared to the first quarter of 2016",
        "date": "05032017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "BRIEF-Square sees 2017 adjusted EPS of $0.16-$0.20 "
    },
    {
        "content": "May 3 Square Inc  the payments company co-founded by Twitter Inc Chief Executive Jack Dorsey  reported a smaller quarterly loss on Wednesday  as customers processed more transactions through its network.",
        "date": "05032017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "REFILE-Dorsey-led Square's quarterly loss narrows "
    },
    {
        "content": "SAN FRANCISCO Square Inc  the payments company led by Twitter Inc Chief Executive Jack Dorsey  has launched in the United Kingdom in its first European foray.",
        "date": "03282017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Payments company Square launches in the UK "
    },
    {
        "content": "SAN FRANCISCO  March 28 Square Inc  the payments company led by Twitter Inc Chief Executive Jack Dorsey  has launched in the United Kingdom in its first European foray.",
        "date": "03282017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "Payments company Square launches in the U.K. "
    },
    {
        "content": "* Square  inc. Announces pricing of $400 million convertible notes offering",
        "date": "03012017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square Inc prices $400 million convertible notes offering due 2022 "
    },
    {
        "content": "* Square  inc. Announces $350 million convertible notes offering",
        "date": "02272017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square announces $350 million convertible notes offering "
    },
    {
        "content": "Payments processor Square Inc  reported better-than-expected quarterly results on Wednesday  helped by its efforts to offer new services and attract larger customers.",
        "date": "02232017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Dorsey's Square reports smaller-than-expected quarterly loss "
    },
    {
        "content": "Feb 22 Square Inc  the mobile payments company co-founded and run by Twitter Inc Chief Executive Jack Dorsey  reported a 20.7 percent jump in quarterly revenue as it processed more payments.",
        "date": "02222017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Dorsey's Square reports 20.7 pct jump in quarterly revenue "
    },
    {
        "content": "Feb 22 Payments processor Square Inc reported better-than-expected quarterly results on Wednesday  helped by its efforts to offer new services and attract larger customers.",
        "date": "02232017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "UPDATE 2-Dorsey's Square reports smaller-than-expected quarterly loss "
    },
    {
        "content": "Please click on the link below for Square Inc's quarterly earnings press release:  Source text: http://bit.ly/2l0PNSu",
        "date": "02222017",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "BRIEF-Square Inc quarterly results press release "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Coca Cola Co - SEC filing",
        "date": "02142017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Soros Fund Management takes share stake in Tata Motors  dissolves share stake in Coca Cola  Dunkin' Brands "
    },
    {
        "content": "* Capital World Investors reports a 7 percent passive stake in Square Inc as of Dec 30  2016 - SEC Filing  Source text: [http://bit.ly/2kMDv32] Further company coverage:",
        "date": "02132017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Capital World Investors reports a 7 pct passive stake in Square as of Dec 30 - SEC Filing "
    },
    {
        "content": "* Vanguard Group Inc reports a 6.45 percent passive stake in Square Inc as of December 31  2016 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "02102017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Vanguard Group reports 6.45 pct passive stake in Square Inc - SEC filing "
    },
    {
        "content": "NEW YORK  Feb 2    Francoise Brougher  a senior executive at Square Inc will resign from her role on Friday after almost four years at the helm of sales and marketing efforts at the payments company.",
        "date": "02022017",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "UPDATE 1-Senior Square executive Brougher to resign on Friday "
    },
    {
        "content": "* Cuts share stake in Restaurant Brands International Inc by 14.0 percent to 2.1 million shares",
        "date": "11142016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Tiger Global dissolves class A stake in Square  ups stake in Priceline "
    },
    {
        "content": "* Square Inc - Jack Dorsey has entered into a stock trading plan to sell shares of square over course of next twelve months",
        "date": "11152016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square Inc CEO Jack Dorsey enters into stock trading plan to sell shares of Co over course of next 12 months "
    },
    {
        "content": "Square Inc   the mobile payments company co-founded and run by Twitter Inc  Chief Executive Jack Dorsey  reported a higher-than-expected jump in quarterly revenue as it processed more transactions.",
        "date": "11012016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Dorsey's Square posts jump in revenue  raises full-year forecast "
    },
    {
        "content": "Nov 1 Square Inc  the mobile payments company co-founded and run by Twitter Inc Chief Executive Jack Dorsey  reported a higher-than-expected jump in quarterly revenue as it processed more transactions.",
        "date": "11012016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "UPDATE 2-Dorsey's Square posts jump in revenue  raises full-year forecast "
    },
    {
        "content": "Nov 1 Square Inc  the mobile payments company co-founded and run by Twitter Inc Chief Executive Jack Dorsey  reported a 32.2 percent jump in quarterly revenue as it processed more transactions.",
        "date": "11012016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "Dorsey's Square reports 32 pct jump in quarterly revenue "
    },
    {
        "content": "* Ajmere Dale  age 46  will join company as chief accounting officer  effective August 29",
        "date": "08292016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square appoints Ajmere Dale as chief accounting officer "
    },
    {
        "content": "SAN FRANCISCO  Aug 18 U.S. mobile payments company Square Inc posted three new job openings in Europe on Thursday  signaling it is moving closer to ramping up operations in the region through an initial venture in Britain.",
        "date": "08192016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "RPT-Square posts job openings signaling European expansion "
    },
    {
        "content": "SAN FRANCISCO  Aug 18 U.S. mobile payments company Square Inc posted three new job openings in Europe on Thursday  signaling it is moving closer to ramping up operations in the region through an initial venture in Britain.",
        "date": "08192016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "Square posts job openings signaling European expansion "
    },
    {
        "content": "Mobile payments company Square Inc on Wednesday reported a 41.5 percent jump in revenue and diminishing losses as more large merchants make sales using Square's technology  a sign the company has moved beyond serving only pop-up shops and food trucks.",
        "date": "08032016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Dorsey's Square reports 41.5 percent jump in quarterly revenue "
    },
    {
        "content": "Aug 3 Mobile payments company Square Inc  on Wednesday reported a 41.5 percent jump in revenue and diminishing losses as more large merchants make sales using Square's technology  a sign the company has moved beyond serving only pop-up shops and food trucks.",
        "date": "08032016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "REFILE-UPDATE 2-Dorsey's Square reports 41.5 pct jump in quarterly revenue "
    },
    {
        "content": "* Qtrly gross payment volume was $12.5 billion  up 42% year over year",
        "date": "08032016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "BRIEF-Square announces Q2 2016 results "
    },
    {
        "content": "Aug 3 Square Inc  the mobile payments company co-founded and run by Twitter Inc Chief Executive Jack Dorsey  reported a 41.5 percent jump in quarterly revenue as more transactions were processed through the company's network.",
        "date": "08032016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "Dorsey's Square reports 41.5 pct jump in quarterly revenue "
    },
    {
        "content": "STOCKHOLM/SAN FRANCISCO  July 19 Square Inc   the mobile payments company run by Twitter Inc  CEO Jack Dorsey  has incorporated a business called Squareup Europe Ltd in Britain  registration documents show  lining itself up for what could be its first foray into Europe.",
        "date": "07192016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "CORRECTED-Dorsey's Square starts up UK operation for first European foray "
    },
    {
        "content": "* GIC Private Limited reports a passive stake of 5.785 pct in Square Inc as of June 16  2016 - SEC filing  Source text: (http://1.usa.gov/28X3AJv) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06242016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-GIC Private reports passive stake of 5.785 pct in Square "
    },
    {
        "content": "* Board appointed Paul Deighton to board as a class I director and nominated Paul Deighton for election as a class I director",
        "date": "05132016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square says appointed Paul Deighton to board as a class i director "
    },
    {
        "content": "* Qtrly adjusted loss per share $0.14  Source (http://squ.re/1UCQNey) Further company coverage:",
        "date": "05052016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Square qtrly adjusted loss per share $0.14 "
    },
    {
        "content": "* Coatue Management reports 5.99 passive stake in Square as of April 12 - SEC Filing  Source - http://1.usa.gov/22TrYLq Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "04222016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-Coatue Management reports 5.99 passive stake in Square as of April 12 - SEC Filing "
    },
    {
        "content": "* OZ Management LP reports 5.2 percent stake in Square Inc as of April 6 - SEC Filing  Source - http://1.usa.gov/1U3pzgZ Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "04182016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "BRIEF-OZ Management LP reports 5.2 percent stake in Square Inc as of April 6 - SEC Filing "
    },
    {
        "content": "SAN FRANCISCO  April 12 Venture firm GGV Capital has raised $1.2 billion in fresh cash to back technology startups in the United States and China  the latest in a streak of new  billion-dollar-plus funds closed by venture capital firms.",
        "date": "04122016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "GGV Capital raises $1.2 bln as venture fundraising streak continues "
    },
    {
        "content": "Mobile payments company Square Inc's revenue beat analysts' estimates in its first quarterly results since going public in November  easing pressure on CEO Jack Dorsey who is also leading turnaround efforts at Twitter Inc.",
        "date": "03102016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Dorsey-led Square's revenue beats in first quarterly report since IPO "
    },
    {
        "content": "March 9 Square Inc  the mobile payments company co-founded and run by Twitter Inc Chief Executive Jack Dorsey  reported a 49.2 percent jump in revenue in its first quarterly results since going public in November.",
        "date": "03092016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Dorsey-led Square's revenue jumps in first quarterly report since IPO "
    },
    {
        "content": "* Shares gain as much as 7 pct after market   (Adds that quarterly loss was due in part to a charge; removes reference to Apple Pay and adds PayPal as a competitor)",
        "date": "03102016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "UPDATE 4-Dorsey-led Square's revenue beats in first qtrly report since IPO "
    },
    {
        "content": "SAN FRANCISCO Visa Inc   the world's largest credit and debit card company  said on Friday it currently has about a 1 percent stake in mobile payments company Square Inc  based on a 2011 investment.",
        "date": "02132016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Visa's investment in Square represents about 1 percent stake "
    },
    {
        "content": "Nov 25 Billionaire investor Leonard Blavatnik disclosed an 11.4 percent passive stake in Class A shares of mobile payments company Square Inc  which went public earlier this month.",
        "date": "02122016",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "CORRECTED-UPDATE 1-Billionaire Blavatnik takes passive stake in Dorsey's Square "
    },
    {
        "content": "SAN FRANCISCO  Feb 12 Visa Inc  the world's largest credit and debit card company  said on Friday it currently has about a 1 percent stake in mobile payments company Square Inc based on a 2011 investment.",
        "date": "02132016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "Visa's investment in Square represents about 1 pct stake "
    },
    {
        "content": "Nov 25 Ukrainian billionaire Leonard Blavatnik disclosed a 11.4 percent passive stake in Class A shares of mobile payments company Square Inc  which went public earlier this month.",
        "date": "02122016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "CORRECTED-Billionaire Blavatnik discloses passive stake in Dorsey's Square (Nov. 25) "
    },
    {
        "content": "Feb 11 Visa Inc  the world's largest payments network operator   disclosed a 9.99 percent holding of Class A shares in mobile payment firm Square Inc.",
        "date": "02122016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "CORRECTED-Visa discloses 9.99 pct stake in Class A shares of Square (Feb. 11) "
    },
    {
        "content": "Visa Inc   the world's largest payments network operator   disclosed a 9.99 percent holding of Class A shares in mobile payment firm Square Inc .",
        "date": "02122016",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "Visa discloses 9.99 percent stake in Dorsey-led Square "
    },
    {
        "content": "Nov 19 Shares of Square Inc  the mobile payments company co-founded and still run by Twitter Inc  Chief Executive Jack Dorsey  soared as much as 64 percent in their market debut  following a marked-down initial public offering  countering the negative sentiment that has nagged at Silicon Valley startups in recent weeks.",
        "date": "11202015",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "UPDATE 5-Dorsey's Square jumps in market debut  offering hope to tech startups "
    },
    {
        "content": "Nov 19 Shares of Square Inc  the mobile payments company co-founded and still run by Twitter Inc  Chief Executive Jack Dorsey  soared as much as 64 percent in their market debut  following a marked-down initial public offering  countering the negative sentiment that has nagged at Silicon Valley startups in recent weeks.",
        "date": "11192015",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "UPDATE 4-Dorsey's Square jumps in market debut  offering hope to tech startups "
    },
    {
        "content": "Billionaire investor Leonard Blavatnik disclosed a 11.4 percent passive stake in mobile payments company Square Inc  which went public earlier this month.",
        "date": "11252015",
        "name": "Square Inc",
        "news_type": "topStory",
        "symbol": "SQ",
        "title": "Billionaire Blavatnik takes passive stake in Dorsey's Square "
    },
    {
        "content": "Nov 25 Billionaire investor Leonard Blavatnik disclosed a 11.4 percent passive stake in mobile payments company Square Inc  which went public earlier this month.",
        "date": "11252015",
        "name": "Square Inc",
        "news_type": "normal",
        "symbol": "SQ",
        "title": "UPDATE 1-Billionaire Blavatnik takes passive stake in Dorsey's Square "
    }
]