[
    {
        "content": "* Arena provides joint venture agreement and corporate update",
        "date": "11012017",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "topStory",
        "symbol": "SQM",
        "title": "BRIEF-ARENA MINERALS EXERCISES ATACAMA OPTION AGREEMENT WITH SOCIEDAD QUIMICA "
    },
    {
        "content": "Potential buyers have shown big interest in Potash Corp of Saskatchewan Inc's 32 percent stake in Chilean lithium producer SQM SA   Potash's chief executive said on Thursday  after reporting a lower than expected third-quarter profit.",
        "date": "10262017",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "topStory",
        "symbol": "SQM",
        "title": "Buyers circle Potash Corp stake in lithium producer SQM "
    },
    {
        "content": "Oct 26 Potential buyers have shown big interest in Potash Corp of Saskatchewan Inc's 32 percent stake in Chilean lithium producer SQM SA  Potash's chief executive said on Thursday  after reporting a lower than expected third-quarter profit. Canada's Potash  set to merge with rival Agrium Inc  must divest minority stakes in SQM and fertilizer companies ICL Israel Chemicals and Arab Potash Co PLC within 18 months as a condition of India's approval for the $25-billion deal.",
        "date": "10262017",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "normal",
        "symbol": "SQM",
        "title": "UPDATE 4-Buyers circle Potash Corp stake in lithium producer SQM "
    },
    {
        "content": "BEIJING China's state-owned Sinochem Group on Tuesday appeared to deny a media report that it was bidding for a stake in Chilean lithium producer SQM being sold by Canada's PotashCorp.",
        "date": "10242017",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "topStory",
        "symbol": "SQM",
        "title": "China's Sinochem says no plans to bid for stake in Chilean lithium producer SQM "
    },
    {
        "content": "* Sinochem says has had no intention to make bid for SQM stake",
        "date": "10242017",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "normal",
        "symbol": "SQM",
        "title": "UPDATE 1-China's Sinochem says no plans to bid for stake in Chilean lithium producer SQM "
    },
    {
        "content": "BEIJING  Oct 24 China's state-owned Sinochem Group on Tuesday appeared to deny media reports that it was bidding for a stake in Chilean lithium producer SQM being sold by Canada's PotashCorp.",
        "date": "10242017",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "normal",
        "symbol": "SQM",
        "title": "China's Sinochem says has no plans to bid for stake in Chilean lithium producer SQM "
    },
    {
        "content": "* Sociedad Química y Minera de Chile S.A.- revenues for the first half of 2017 were US$1 023.9 million  16.2% higher than revenues for the first half of 2016",
        "date": "08242017",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "topStory",
        "symbol": "SQM",
        "title": "BRIEF-SQM reports Q2 net income of $0.38 per ADR "
    },
    {
        "content": "* Q1 2017 revenues were US$531.9 million  higher than revenues reported during Q1 of 2016",
        "date": "05182017",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "topStory",
        "symbol": "SQM",
        "title": "BRIEF-SQM qtrly earnings per ADR $0.39 "
    },
    {
        "content": "WASHINGTON  Jan 13 Chilean-based chemical and mining company Sociedad Quimica y Minera de Chile SA (SQM)  has agreed to pay more than $30 million to resolve parallel civil and criminal cases that found it violated the U.S. Foreign Corrupt Practices Act  the U.S. Securities and Exchange Commission said on Friday.",
        "date": "01132017",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "topStory",
        "symbol": "SQM",
        "title": "Chile's SQM paying $30 mln to resolve U.S. corruption cases "
    },
    {
        "content": "* SQM reports earnings for the nine months ended september 30  2016",
        "date": "11242016",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "topStory",
        "symbol": "SQM",
        "title": "BRIEF-SQM Q3 reporting net income of $0.21 per ADR "
    },
    {
        "content": "* Qtrly revenues totaled $391.8 million versus $387.5 million  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "05192016",
        "name": "Sociedad Quimica y Minera SA",
        "news_type": "topStory",
        "symbol": "SQM",
        "title": "BRIEF-SQM says qtrly EPS $0.22 per ADR "
    }
]