[
    {
        "content": "* ‍SHOPKO'S PRELIMINARY MAIN STORE COMPARABLE SALES FOR AUGUST 2017 WERE UP 2.5% COMPARED TO PRIOR YEAR PERIOD​",
        "date": "11022017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-SPIRIT REALTY SAYS‍SHOPKO'S PRELIMINARY MAIN STORE COMPARABLE SALES FOR AUGUST 2017 WERE UP 2.5 PCT "
    },
    {
        "content": "* Spirit Realty Capital  Inc. announces third quarter 2017 financial and operating results",
        "date": "11022017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "normal",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital announces Q3 FFO per share $0.21 "
    },
    {
        "content": "* Spirit Realty Capital Inc - ‍Spirit raises 2017 affo guidance range to $0.84 to $0.86 per diluted share​",
        "date": "11022017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "normal",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital posts qtrly ‍AFFO earnings per share $0.23​ "
    },
    {
        "content": "* Spirit Realty announces closing of Series A preferred stock offering and exercise of over-allotment option in full Source text for Eikon: Further company coverage:",
        "date": "10032017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty announces closing of Series A preferred stock offering "
    },
    {
        "content": "* Spirit Realty announces pricing of preferred stock offering",
        "date": "09272017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty announces pricing of preferred stock offering "
    },
    {
        "content": "* Spirit Realty Capital Inc files for potential mixed shelf offering; size not disclosed - SEC filing‍​ Source text for Eikon: (http://bit.ly/2huJ8QN) Further company coverage:",
        "date": "09252017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital Inc files for potential mixed shelf offering "
    },
    {
        "content": "* Spirit Realty Capital - authorized new stock repurchase program of up to $250 million of common stock to be undertaken within 18 months from authorization Source text for Eikon: Further company coverage:",
        "date": "08142017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital authorized new stock repurchase program "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  August 08 (Fitch) Fitch Ratings has affirmed the ratings for Spirit Realty Capital (NYSE: SRC) and its operating partnership Spirit Realty  LP after reviewing the company's plans to spin-off a large portion of its portfolio. The Rating Outlook is Stable.  A full list of Fitch's rating actions follows at the end of this release. Spirit plans to spin-off substantially all of its properties leased to its largest tenant  Shopko  a",
        "date": "08082017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "Fitch Affirms Spirit Realty's IDR at 'BBB-'; Outlook Stable "
    },
    {
        "content": "* Spirit Realty Capital  Inc. announces plan for a leveraged spin-off",
        "date": "08032017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital announces plan for leveraged spin-off "
    },
    {
        "content": "* Spirit Realty Capital Inc announces second quarter 2017 financial and operating results",
        "date": "08032017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "normal",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital Q2 FFO per share $0.18 "
    },
    {
        "content": "Spirit Realty Capital Inc   a U.S. real estate investment trust (REIT)  is considering spinning off some of its real estate  including its Shopko store properties  as part of its strategic review  according to people familiar with the matter.",
        "date": "07202017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "Exclusive: Spirit Realty explores Shopko stores spin-off - sources "
    },
    {
        "content": "* On May 12  David J. Gilbert resigned from board of directors of co",
        "date": "05152017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital says on May 12  David Gilbert resigned from board "
    },
    {
        "content": "* Spirit Realty Capital - Board also determined to reschedule annual meeting of stockholders  until a later date  currently expected to be by end of June 2017",
        "date": "05082017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital names Jackson Hsieh CEO "
    },
    {
        "content": "* Spirit Realty Capital Inc announces fourth quarter and full year 2016 financial and operating results",
        "date": "02222017",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital Inc Q4 FFO per share $0.21 "
    },
    {
        "content": "* Spirit Realty Capital Inc - Files for potential stock shelf; size not disclosed - SEC filing  Source text: [http://bit.ly/2fCuqbG] Further company coverage:",
        "date": "11092016",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital files for potential stock shelf "
    },
    {
        "content": "* Spirit Realty Capital Inc qtrly rental revenue increased 1.6% to $161.8 million compared to $159.2 million during same period a year ago",
        "date": "11022016",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital announces Q3 financial and operating results "
    },
    {
        "content": "* Spirit Realty Capital commences private offering of senior unsecured notes",
        "date": "08112016",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital commences private offering of senior unsecured notes "
    },
    {
        "content": "* Spirit Realty Capital announces second quarter 2016 financial and operating results",
        "date": "08032016",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital Q2 FFO per share $0.24 "
    },
    {
        "content": "* Spirit Realty Capital announces new president and chief operating officer",
        "date": "07262016",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital appoints Jackson Hsieh as president and COO "
    },
    {
        "content": "* Upsizes public offering  prices 30 million shares of common stock",
        "date": "04122016",
        "name": "Spirit Realty Capital Inc",
        "news_type": "topStory",
        "symbol": "SRC",
        "title": "BRIEF-Spirit Realty Capital upsizes public offering prices 30 mln shares "
    }
]