[
    {
        "content": "* Q3 earnings per share view $1.05 -- Thomson Reuters I/B/E/S",
        "date": "10302017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra energy Q3 adjusted earnings per share $1.04 "
    },
    {
        "content": "* Oncor and Sempra Energy to file for Texas regulatory approval",
        "date": "10042017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Oncor and Sempra Energy to file for Texas regulatory approval "
    },
    {
        "content": "* U.S. BANKRUPTCY COURT APPROVES SEMPRA ENERGY'S MERGER AGREEMENT WITH ENERGY FUTURE",
        "date": "09062017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-U.S. BANKRUPTCY COURT APPROVES SEMPRA ENERGY'S MERGER AGREEMENT WITH ENERGY FUTURE "
    },
    {
        "content": "* Sempra Energy - Energy Future Holding required to pay co fee of $190 million​ in event of termination of proposed acquisition of EFH's ownership in Oncor Source text: (http://bit.ly/2wG0y6X) Further company coverage:",
        "date": "08252017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy - Energy Future Holding required to pay co fee of $190 million​ in event of termination of proposed acquisition of EFH's ownership in Oncor "
    },
    {
        "content": "* Files for potential mixed shelf offering; size not disclosed - SEC filing‍​ Source text: (http://bit.ly/2xO3Gu1) Further company coverage:",
        "date": "08302017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy files for potential mixed shelf offering "
    },
    {
        "content": "* Sempra shares touch record high (Adds comments from lawyer and analysts  background and shares)",
        "date": "08212017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "UPDATE 2-Sempra Energy to buy Oncor for $9.45 bln in blow to Berkshire "
    },
    {
        "content": "Aug 21 Sempra Energy said it will buy Oncor for $9.45 billion in cash after Energy Future Holdings Corp  which indirectly owns Oncor  abandoned a deal to sell the power transmission company to Warren Buffett's Berkshire Hathaway Inc.",
        "date": "08212017",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "UPDATE 1-Sempra Energy to buy Oncor for $9.45 bln in blow for Berkshire "
    },
    {
        "content": "Aug 21 Sempra Energy said it will buy power transmission company Oncor  80 percent owned by Energy Future Holdings Corp  for $9.45 billion in cash  resolving the Texas utility's long-standing bankruptcy case.",
        "date": "08212017",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "Sempra Energy to buy Oncor for $9.45 bln in cash "
    },
    {
        "content": "* SEMPRA ENERGY ANNOUNCES AGREEMENT TO ACQUIRE OWNERSHIP INTEREST IN ONCOR",
        "date": "08212017",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy announces agreement to acquire ownership interest in Oncor "
    },
    {
        "content": "Sempra Energy  said it will buy Oncor for $9.45 billion in cash after Energy Future Holdings Corp  which indirectly owns Oncor  abandoned a deal to sell the power transmission company to Warren Buffett's Berkshire Hathaway Inc .",
        "date": "08222017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Sempra Energy to buy Oncor for $9.45 billion in blow for Berkshire "
    },
    {
        "content": "Aug 20 Bankrupt Texas utility Energy Future Holdings will abandon a deal to sell power transmission company Oncor to Warren Buffett's Berkshire Hathaway Inc for $9 billion and will accept a $9.45 billion bid for Oncor by Sempra Energy instead  people familiar with the matter said.",
        "date": "08212017",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "REFILE-UPDATE 3-Sempra snatches Oncor from Buffett with $9.45 bln bid-sources "
    },
    {
        "content": "Utility Sempra Energy said on Monday that it would buy Oncor for $9.45 billion in cash after majority owner Energy Future Holdings Corp abandoned a deal to sell the power transmission company to Warren Buffett's Berkshire Hathaway Inc. | Video ",
        "date": "08222017",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "Sempra Energy to buy Oncor for $9.45 billion in blow to Berkshire "
    },
    {
        "content": "Aug 20 Bankrupt Texas utility Energy Future Holdings will abandon a deal to sell power transmission company Oncor to Warren Buffett's Berkshire Hathaway Inc for $9 billion and will accept a $9.45 billion bid for Oncor by Sempra Energy instead  a person familiar with the matter said.",
        "date": "08212017",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "Energy Future drops Oncor deal with Buffett in favor of $9.45 bln Sempra bid-sources "
    },
    {
        "content": "* Q2 earnings per share view $0.86 -- Thomson Reuters I/B/E/S",
        "date": "08042017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy's reports Q2 earnings per share $1.03 "
    },
    {
        "content": "* Sempra Energy's ienova unit  Valero sign contracts for liquid fuels projects in Mexico",
        "date": "08032017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy unit and Valero sign contracts for liquid fuels projects in Mexico "
    },
    {
        "content": "* Sempra Energy's Ienova unit awarded $155 million liquid fuels project in Veracruz",
        "date": "07122017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy's Ienova unit awarded $155 million liquid fuels project in Veracruz "
    },
    {
        "content": "* Sempra Energy unit  Woodside sign memorandum of understanding with Kogas for Port Arthur LNG project",
        "date": "06292017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy unit signs MOU with Kogas for Port Arthur LNG project "
    },
    {
        "content": "* Q1 earnings per share view $1.67 -- Thomson Reuters I/B/E/S",
        "date": "05092017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy Q1 adjusted earnings per share $1.74 "
    },
    {
        "content": "* Sempra energy updates financial outlook at 2017 analyst conference",
        "date": "04052017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy updates financial outlook at 2017 analyst conference "
    },
    {
        "content": "* CEO Debra L Reed's 2016 total compensation was $18.8 million versus. $16.1 million in 2015 - SEC filing  Source text: (http://bit.ly/2mXUUE6) Further company coverage:",
        "date": "03242017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy's CEO Debra Reed's 2016 total compensation was $18.8 mln "
    },
    {
        "content": "* Sempra Energy appoints Contreras-Sweet to board of directors",
        "date": "03142017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy appoints Contreras-Sweet to board "
    },
    {
        "content": "* P. Kevin Chase appointed chief information officer for Sempra Energy  Source text for Eikon:  Further company coverage:",
        "date": "03072017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-P. Kevin Chase appointed chief information officer for Sempra Energy "
    },
    {
        "content": "* Q4 earnings per share view $1.49 -- Thomson Reuters I/B/E/S",
        "date": "02282017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy Q4 adjusted earnings per share $1.52 "
    },
    {
        "content": "Southern California Gas Co (SoCalGas) told state regulators on Wednesday the amount of natural gas it will be able to pull from its three smaller storage facilities would decline as it upgrades wells at those fields.",
        "date": "02152017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "California natgas storage upgrades to reduce withdrawals: SoCalGas "
    },
    {
        "content": "* Sempra Energy announces California Utilities' settlement agreement for two-year extension of cost-of-capital application",
        "date": "02072017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy announces California Utilities' settlement agreement for two-year extension of cost-of-capital application "
    },
    {
        "content": "MEXICO CITY  Jan 16 Mexican energy infrastructure firm IEnova  a unit of U.S.-based Sempra Energy  will invest $800 million this year on eight projects  the company's chief executive said on Monday.",
        "date": "01162017",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Mexico's IEnova will invest $800 mln in 2017 on 8 projects - CEO "
    },
    {
        "content": "Southern California Gas Co (SoCalGas) on Tuesday told its 21.6 million customers they no longer need to reduce natural gas use to help prevent power shortages due to cooler-than-normal weather.",
        "date": "12202016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Southern California Gas ends call to customers to conserve natgas "
    },
    {
        "content": "LIMA  Nov 18 Peru is considering rescinding Odebrecht SA's $5 billion natural gas pipeline contract after the Brazilian company's attempt to sell its majority stake in the project got snagged on corruption concerns  a government source said Friday.",
        "date": "11182016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Peru considers rescinding Odebrecht's pipeline contract -source "
    },
    {
        "content": "LIMA Sempra Energy  said Wednesday that it dropped its offer to buy a stake in Odebrecht SA's [ODBES.UL] natural gas pipeline concession in Peru  leaving junior partners scrambling to try to save the project as the government eyes a new auction.",
        "date": "11242016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Sempra quits talks on Odebrecht Peru pipeline  partners scramble "
    },
    {
        "content": "LIMA  Nov 23 Sempra Energy said Wednesday that it dropped its offer to buy a stake in Odebrecht SA's natural gas pipeline concession in Peru  leaving junior partners scrambling to try to save the project as the government eyes a new auction.",
        "date": "11242016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "UPDATE 3-Sempra quits talks on Odebrecht Peru pipeline  partners scramble "
    },
    {
        "content": "* Sempra international issues media statement on peru pipeline",
        "date": "11232016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra International negotiations have been terminated regarding Gasoducto Sur Peruano natural gas pipeline project "
    },
    {
        "content": "Nov 8 The Los Angeles County Board of Supervisors said on Tuesday it would vote on Nov. 9 on a motion calling on California Governor Jerry Brown to continue restricting natural gas injection into Southern California Gas's Aliso Canyon storage facility.",
        "date": "11082016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "LA County supervisors to vote on restricting Aliso Canyon gas injection "
    },
    {
        "content": "LIMA  Nov 3 U.S.-based Sempra Energy has agreed to buy a majority stake in a $5 billion natural gas pipeline project in Peru being sold by Brazilian engineering group Odebrecht SA  Finance Minister Alfredo Thorne said on Thursday.",
        "date": "11032016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Sempra Energy agreed to buy Peru pipeline stake -finance minister "
    },
    {
        "content": "* Q3 earnings per share view $0.96 -- Thomson Reuters I/B/E/S",
        "date": "11022016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy reports Q3 earnings per share $2.46 "
    },
    {
        "content": "Nov 2 Southern California Gas has sought state permission to re-inject natural gas into its Aliso Canyon storage facility  shut over a year ago after a massive leak forced the evacuation of thousands in the Porter Ranch area of Los Angeles.",
        "date": "11022016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "SoCalGas seeks to inject gas into California's Aliso Canyon facility "
    },
    {
        "content": "Oct 19 Southern California Gas said on Wednesday it completed safety review tests at most wells at its Aliso Canyon natural gas storage facility in Los Angeles  which shut in October 2015 following a massive methane leak not plugged until February.",
        "date": "10192016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "UPDATE 2-SoCalGas completes most well tests at Calif. Aliso Canyon natgas facility "
    },
    {
        "content": "Oct 19 Southern California Gas said on Wednesday it completed safety review tests at most of its wells at the Aliso Canyon natural gas storage facility in Los Angeles  which shut in October 2015 following a massive methane leak that was not plugged until February.",
        "date": "10192016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "CORRECTED-(OFFICIAL)-UPDATE 1-SoCalGas completes most well tests at Calif. Aliso Canyon natgas facility "
    },
    {
        "content": "* Sempra Energy's Ienova unit announces pricing of common stock follow-on offering",
        "date": "10142016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy's Ienova unit announces pricing of common stock follow-on offering "
    },
    {
        "content": "* Sempra Energy's Ienova unit announces full exercise of over-allotment options",
        "date": "10182016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy Ienova unit announces full exercise of over-allotment options "
    },
    {
        "content": "MEXICO CITY  Sept 28 The Mexican unit of Sempra Energy  Infraestructura Energetica Nova  won the rights to develop two solar power projects at an auction on Wednesday  totaling 141 megawatts and $150 million in expected investment  the company said in a statement.",
        "date": "09292016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "UPDATE 1-Mexico's IEnova wins two solar contracts in energy auction "
    },
    {
        "content": "MEXICO CITY  Sept 28 The Mexican unit of Sempra Energy  Infraestructura Energetica Nova  won the rights to develop two solar power projects at auction on Wednesday  totaling 141 megawatts and $150 million in expected investment  the company said in a statement.",
        "date": "09282016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Mexico's IEnova wins two solar contracts in energy auction "
    },
    {
        "content": "* Sempra Energy unit Ienova receives approval for acquisition of PEMEX stake in joint venture",
        "date": "09212016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy unit receives approval to buy PEMEX stake "
    },
    {
        "content": "Sept 19 More wells  passed safety inspections at the Aliso Canyon natural gas storage facility in Los Angeles  Southern California Gas Co said on Monday  but the company has more work to do before it can inject gas into the giant field the utility shut last fall due to a massive methane leak that was not plugged until February.",
        "date": "09192016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "SoCalGas completes more California Aliso Canyon natgas well tests "
    },
    {
        "content": "* Mark A. Snell  president of Sempra Energy  announced that he plans to retire from company march 1  2017",
        "date": "09132016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy reports executive appointments "
    },
    {
        "content": "Southern California Gas Co is not likely to return the Aliso Canyon natural gas storage facility in Los Angeles to partial service until at least early autumn  according to conversations with regulators.",
        "date": "09132016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "SoCalGas unlikely to restart Aliso Canyon facility until autumn "
    },
    {
        "content": " ",
        "date": "08292016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Sempra-Techint made best offer on Odebrecht pipeline in Peru - source "
    },
    {
        "content": "* Q2 earnings per share view $0.97 -- Thomson Reuters I/B/E/S",
        "date": "08042016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy Q2 adjusted earnings per share $0.79 "
    },
    {
        "content": "MEXICO CITY  July 12 IEnova  the Mexican unit of U.S.-based Sempra Energy  said on Tuesday it had restructured a deal to buy state-run oil company Pemex's 50 percent stake in pipeline company Gasoductos de Chihuahua for $1.108 billion.",
        "date": "07122016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Mexico's IEnova says recasts Pemex deal to buy pipeline stake "
    },
    {
        "content": "U.S. natural gas utility Southern California Gas (SoCalGas) kept fuel supplies flowing as temperatures rose this week  passing its first test of the summer since the closure of its Aliso Canyon storage facility.",
        "date": "06222016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "SoCalGas keeps gas flowing in California  passing first summer test "
    },
    {
        "content": "* TransCanada to invest $1.3 bln in pipeline   (Adds details on natural gas pipeline in Texas)",
        "date": "06132016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "UPDATE 2-TransCanada to build $2.1 bln gas pipeline in Mexico "
    },
    {
        "content": "* The Tuxpan pipeline will have a capacity of 2.6 billion cubic feet per day and an anticipated in-service date of late 2018",
        "date": "06142016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy unit awarded South Texas-Tuxpan natural gas pipeline contract in Mexico "
    },
    {
        "content": "June 13 TransCanada Corp said on Monday that it won a contract with a joint venture partner to build and operate a $2.1 billion natural gas pipeline in Mexico.",
        "date": "06132016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "TransCanada JV wins $2.1 bln gas pipeline contract in Mexico "
    },
    {
        "content": "* Q1 earnings per share view $1.66 -- Thomson Reuters I/B/E/S",
        "date": "05042016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra Energy Q1 earnings per share $1.27 "
    },
    {
        "content": "* Tallgrass Energy announces record first quarter 2016 results and the potential acquisition of a 25 percent interest in rockies express pipeline by TEP",
        "date": "04282016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Tallgrass Energy Partners Lp qtrly diluted net income per common  subordinated unit $0.35 "
    },
    {
        "content": "* Sempra U.S. Gas & Power to sell parent company of Mobile Gas and Willmut Gas",
        "date": "04262016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "BRIEF-Sempra U.S. Gas & Power to sell Energysouth  Inc "
    },
    {
        "content": "LOS ANGELES  April 18 Hundreds of Los Angeles homeowners who live near the site of the worst U.S. methane leak have filed claims against state regulators and the governor  seeking $3.5 million each in damages for government failures they blame for the gas blowout.",
        "date": "04192016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "RPT-California governor  agencies face legal claims in gas blowout "
    },
    {
        "content": "LOS ANGELES  April 18 Hundreds of Los Angeles homeowners who live near the site of the worst U.S. methane leak have filed claims against state regulators and the governor  seeking $3.5 million each in damages for government failures they blame for the gas blowout.",
        "date": "04192016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "California governor  agencies face legal claims in gas blowout "
    },
    {
        "content": "WASHINGTON  April 1 A new U.S. government task force will look into the country's biggest ever accidental release of methane  which occurred over several months in Los Angeles  California  hoping to prevent future leaks of the potent greenhouse gas from storage wells  the Obama administration said on Friday.",
        "date": "04012016",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "U.S. task force to look at massive California natural gas leak "
    },
    {
        "content": "Southern California Gas Co is to be arraigned on criminal charges on Wednesday over a huge methane leak near Los Angeles that forced thousands of residents from their homes  officials said.",
        "date": "02172016",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Gas company to be arraigned over Los Angeles area methane leak "
    },
    {
        "content": "MEXICO CITY Mexican energy infrastructure firm IEnova  a unit of U.S.-based Sempra Energy   said on Friday it will buy out the 50 percent stake in the pipeline company Gasoductos de Chihuahua owned by Mexican state-run oil company Pemex [PEMX.UL].",
        "date": "07312015",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "IEnova to buy Pemex stake in pipeline joint venture for $1.325 billion "
    },
    {
        "content": "MEXICO CITY  July 31 Mexican energy infrastructure firm IEnova  a unit of U.S.-based Sempra Energy   said on Friday it will buy out the 50 percent stake in the pipeline company Gasoductos de Chihuahua owned by Mexican state-run oil company Pemex.",
        "date": "07312015",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "UPDATE 1-IEnova to buy Pemex stake in pipeline joint venture for $1.325 bln "
    },
    {
        "content": "LOS ANGELES  July 2 Fifteen years ago  California led the way to cleaner transit buses with strict tailpipe emissions standards that effectively ushered out diesel as the primary fuel for buses in the state and replaced it with natural gas.",
        "date": "07022015",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "RPT-INSIGHT-California's push for cleaner buses could edge out natural gas "
    },
    {
        "content": "LOS ANGELES  July 2 Fifteen years ago  California led the way to cleaner transit buses with strict tailpipe emissions standards that effectively ushered out diesel as the primary fuel for buses in the state and replaced it with natural gas.",
        "date": "07022015",
        "name": "Sempra Energy",
        "news_type": "normal",
        "symbol": "SRE",
        "title": "INSIGHT-California's push for cleaner buses could edge out natural gas "
    },
    {
        "content": "June 16 Sempra Energy  an energy services holding company  said its board authorized the formation of a publicly traded master limited partnership (MLP) to hold assets producing MLP-qualifying income.",
        "date": "06162015",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "Sempra Energy to create MLP to hold LNG  renewable energy assets "
    },
    {
        "content": "NEW YORK  March 20 Castleton Commodities International LLC  a privately held U.S. energy merchant  has hired Peter Sellars  former metals chief at JPMorgan Chase & Co and Sempra  as part of its launch into the global physical base metals market  it said on Friday.",
        "date": "03202015",
        "name": "Sempra Energy",
        "news_type": "topStory",
        "symbol": "SRE",
        "title": "UPDATE 1-Castleton Commodities expands into metals  hires Peter Sellars "
    }
]