[
    {
        "content": "JOHANNESBURG Shares in South African petrochemicals and energy firm Sasol dropped sharply on Wednesday after it said it was  looking at raising $980 million in a share sale to fund a buy- out of indebted black investors.",
        "date": "09202017",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "South Africa's Sasol plans share issue to buy out black empowerment investors "
    },
    {
        "content": "* Sasol to write off $900 mln from empowerment deal (Re-leads with plan for share issue)",
        "date": "09202017",
        "name": "Sasol Ltd",
        "news_type": "normal",
        "symbol": "SSL",
        "title": "UPDATE 2-South Africa's Sasol plans share issue to buy out black empowerment investors "
    },
    {
        "content": "JOHANNESBURG  May 31 South African petrochemicals group Sasol will apply to postpone a 2020 deadline for meeting stricter air pollution laws  the company said on Wednesday.",
        "date": "05312017",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "S.Africa's Sasol to apply for delay to 2020 air pollution deadline "
    },
    {
        "content": "JOHANNESBURG A blast on Monday at South Africa's Natref oil refinery injured 11 people and forced the shutdown of operations close to the 108 000 barrel per day facility but production at the main refinery continued  Sasol said.",
        "date": "05222017",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "South African refinery blast injures 11  some operations halted "
    },
    {
        "content": "CAPE TOWN South African petrochemical group Sasol said on Tuesday it had enough oil reserves to meet market requirements following an explosion at its 108 000 barrel per day Natref refinery on Monday.",
        "date": "05232017",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "South Africa's Sasol says maintains output after refinery blast "
    },
    {
        "content": "South African energy and chemicals group Sasol reported a 17 percent fall in full-year earnings on Monday due to lower crude oil prices and said the economic environment it operates in remained \"volatile and uncertain\".",
        "date": "09122016",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "Sasol's earnings hit by low oil price  says outlook uncertain "
    },
    {
        "content": "Aug 23 Petrochemicals company Sasol Ltd  on Tuesday raised the price tag of its U.S. ethane cracker project to $11 billion from $8.9 billion  in line with an estimate it flagged to the market in June.",
        "date": "08232016",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "UPDATE 1-Sasol boosts U.S. Lake Charles project price estimate by $2.1 bln "
    },
    {
        "content": "* Project is under construction near Lake Charles  Louisiana in USA  adjacent to Sasol's existing chemical operations",
        "date": "08232016",
        "name": "Sasol Ltd",
        "news_type": "normal",
        "symbol": "SSL",
        "title": "BRIEF-Sasol raises price tag for Lake Charles project "
    },
    {
        "content": "JOHANNESBURG Petrochemicals firm Sasol  said on Friday it was considering buying a majority stake in Chevron's  South African assets  including a 110 000 barrels-per-day oil refinery and retail stations.",
        "date": "07012016",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "Sasol mulling bid for Chevron's South African assets "
    },
    {
        "content": "JOHANNESBURG  July 1 Petrochemicals firm Sasol  said on Friday it was considering buying a majority stake in Chevron's South African assets  including a refinery and retail stations.",
        "date": "07012016",
        "name": "Sasol Ltd",
        "news_type": "normal",
        "symbol": "SSL",
        "title": "South Africa's Sasol considers snapping up Chevron's assets "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "UPDATE 1-Sasol mulling bid for Chevron's South African assets "
    },
    {
        "content": "* Top-40 index falls to one-month low   (Adds latest currency level  share prices)",
        "date": "04052016",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "UPDATE 2-S.African rand and stocks slide on growth fears  political risk "
    },
    {
        "content": "* \u007fHeadline Earnings Per Share (HEPS) for six months ended 31 December 2015 are expected to decrease by between 23 pct and 28 pct (approximating R7 36 to R8 96 per share) compared to 2015 financial half year",
        "date": "01282016",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "BRIEF-Sasol sees H1 HEPS to drop 23-28 pct "
    },
    {
        "content": "* Reports lower earnings  trims dividend   (Adds more details  CEO comments)",
        "date": "09072015",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "UPDATE 2-S.Africa's Sasol looks to gas as oil price languishes "
    },
    {
        "content": "JOHANNESBURG  Sept 7 South African petrochemicals company Sasol said on Monday full year headline earnings fell by 17 percent and cut its dividend by 15 percent  due to weaker oil prices.",
        "date": "09072015",
        "name": "Sasol Ltd",
        "news_type": "normal",
        "symbol": "SSL",
        "title": "CORRECTED-South Africa's Sasol says FY earnings fall  impacted by low oil prices "
    },
    {
        "content": "* Sasol cites higher sales volumes  lower rand   (Adds analyst comment  share price rise)",
        "date": "08072015",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "UPDATE 2-Lower currency  higher sales volumes to prop up Sasol's 2015 earnings "
    },
    {
        "content": "JOHANNESBURG  Aug 7 South African petrochemicals company Sasol said on Friday it expected full-year profits to fall by up to 19 percent due to softer oil prices.",
        "date": "08072015",
        "name": "Sasol Ltd",
        "news_type": "normal",
        "symbol": "SSL",
        "title": "South Africa's Sasol flags lower FY earnings on softer oil price "
    },
    {
        "content": "MAPUTO  July 30 Exxon Mobil  Italy's Eni  and South Africa's Sasol are among the firms that submitted bids to explore new blocks for fossil fuels in Mozambique and off its Indian Ocean coastline  a senior official said on Thursday.",
        "date": "07302015",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "Exxon  Eni  Sasol bid for Mozambique's unexplored fossil fuel bounty "
    },
    {
        "content": "JOHANNESBURG  April 3 Twenty two current and former employees of South African petrochemicals group Sasol  have filed a civil claim against its mining unit  regarding illnesses allegedly contracted while they worked for the company.",
        "date": "04032015",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "UPDATE 1-Employees seek damages from S.Africa's Sasol over coal dust exposure "
    },
    {
        "content": "* Expects savings of 4 bln rand   (Recasts with cracker plans  Eskom talks)",
        "date": "03092015",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "UPDATE 3-S.Africa's Sasol may expand U.S. cracker  sell power to Eskom "
    },
    {
        "content": "JOHANNESBURG  March 9 South African petrochemicals group Sasol could expand its $8.9 billion cracker project in Louisiana  depending on market conditions  its chief executive said on Monday.",
        "date": "03092015",
        "name": "Sasol Ltd",
        "news_type": "normal",
        "symbol": "SSL",
        "title": "S.Africa's Sasol could expand Louisiana cracker project - CEO "
    },
    {
        "content": "JOHANNESBURG  March 9 South Africa's petrochemicals group Sasol aims to maintain a 40/60 split of its interim and final dividends so it can be flexible in volatile markets  the group's financial controller Paul Victor said on Monday.   (Reporting by Zandi Shabalala; Editing by James Macharia)",
        "date": "03092015",
        "name": "Sasol Ltd",
        "news_type": "normal",
        "symbol": "SSL",
        "title": "Sasol says aims to maintain 40:60 interim/final dividend split "
    },
    {
        "content": "JOHANNESBURG  March 9 South African petrochemicals company Sasol reported a 6 percent increase in first-half earnings on Monday  as higher sales and chemical prices offset the impact of falling oil prices.",
        "date": "03092015",
        "name": "Sasol Ltd",
        "news_type": "normal",
        "symbol": "SSL",
        "title": "Sasol H1 earnings up on better sales  cuts dividend "
    },
    {
        "content": "JOHANNESBURG  Feb 18 South Africa's petrochemicals group Sasol has changed its dividend policy as part of a cash saving programme in response to lower oil prices  it said on Wednesday.",
        "date": "02182015",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "S.Africa's Sasol changes dividend policy as oil prices drop "
    },
    {
        "content": "JOHANNESBURG  Jan 28 South African petrochemicals group Sasol will delay a decision to invest in its gas-to-liquid project in the United States to conserve cash after oil prices tumbled  the firm said on Wednesday.",
        "date": "01282015",
        "name": "Sasol Ltd",
        "news_type": "topStory",
        "symbol": "SSL",
        "title": "UPDATE 1-Sasol to delay Louisiana gas-to-liquids plant to conserve cash "
    },
    {
        "content": "Jan 28 Sasol announces plan to respond to the low oil price environment Certain decisive measures have been agreed to and are being implemented Identifying opportunities for additional cash savings targeted over next 30 months Has decided to delay final investment decision on its large-scale  gas-to-liquids (gtl) plant in Louisiana Focus areas are capital portfolio phasing and reductions  capital restructuring  working capital improvements  margin enhancement Cash flow improvements a",
        "date": "01282015",
        "name": "Sasol Ltd",
        "news_type": "normal",
        "symbol": "SSL",
        "title": "Sasol to delay Louisiana investment to cut costs "
    },
    {
        "content": "JOHANNESBURG  Jan 28 South African petrochemicals group Sasol on Wednesday said it would delay investment decision in its gas-to-liquid project in Louisiana  in response to low global oil prices.",
        "date": "01282015",
        "name": "Sasol Ltd",
        "news_type": "normal",
        "symbol": "SSL",
        "title": "CORRECTED-Sasol to delay Louisiana investment to cut costs "
    }
]