[
    {
        "content": "* Steris Plc - ‍fiscal 2018 Q2 revenue as reported was $634.2 million compared with $646.4 million in Q2 of fiscal 2017​",
        "date": "11012017",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Steris Q2 earnings per share $0.75 "
    },
    {
        "content": "* STERIS Plc - Q1 earnings per share $0.68; Q1 adjusted non-gaap earnings per share $0.85; Q1 revenue $608 million versus $638.4 mln‍​",
        "date": "08082017",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-STERIS Plc reports Q1 adjusted non-gaap earnings per share $0.85‍​ "
    },
    {
        "content": "* Steris plc - steris expects fiscal 2018 as reported revenues to decline 2-3pct compared with as reported fiscal 2017 revenue",
        "date": "05092017",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Steris Q4 earnings per share $0.31 "
    },
    {
        "content": "* Effective Feb 9  2017  steris plc completed divestiture of Synergy Health Textiel Service B.V. and its subsidiaries - SEC filing",
        "date": "02102017",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-STERIS completes divestiture of Synergy Health Textiel Service B.V. and its subsidiaries "
    },
    {
        "content": "WASHINGTON  Jan 13 U.S. Federal Trade Commission Chairwoman Edith Ramirez will step down next month after more than three years as chair and six at the agency under Democratic President Barack Obama  the FTC said on Friday.",
        "date": "01132017",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "UPDATE 2-U.S. FTC chairwoman to step down  leaving three vacancies "
    },
    {
        "content": "WASHINGTON U.S. Federal Trade Commission chairwoman Edith Ramirez will step down after more than three years as chairwoman and six at the agency  the FTC said in a statement on Friday  adding that her departure will be effective Feb. 10.",
        "date": "01132017",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "U.S. FTC chairwoman to step down  leaving three vacancies "
    },
    {
        "content": "* Q2 earnings per share view $0.90  revenue view $670.2 million -- Thomson Reuters I/B/E/S",
        "date": "11022016",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Steris reports Q2 eps $0.47 "
    },
    {
        "content": "* Fiscal 2017 q1 revenue increased 45% to $638.4 million compared with $439.9 million for steris corporation in q1 of fiscal 2016",
        "date": "08092016",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Steris Qtrly adjusted EPS $0.79 "
    },
    {
        "content": "* Effective July 22  co has acquired Medisafe Holdings Ltd for approximately £27 million - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07222016",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Steris acquired Medisafe Holdings for about £27 mln - SEC "
    },
    {
        "content": "* Says \"will continue to review its businesses for opportunities to optimize its portfolio\" - SEC filing",
        "date": "07012016",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Steris sells UK linen management services business to Star Mayan Limited "
    },
    {
        "content": "May 18 Steris Plc Sees Adjusted Net Earnings Per Diluted Share To Be In Range Of $3.85",
        "date": "05182016",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Steris reports Q4 adjusted earnings per share of $0.90 "
    },
    {
        "content": "* Said on Monday board resolved upon the exercise of the powers granted by the shareholders' meeting of Sept. 26  2014 for allowing Steris Corporation via Steris UK Holding Limited to subscribe a capital increase",
        "date": "03152016",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "REFILE-BRIEF-Servizi Italia board exercizes powers for 4 mln euro capital increase "
    },
    {
        "content": "BEIJING China ride-hailing app Yidao Yongche said that a unit of Beijing-based technology company LeTV has agreed to invest $700 million in the firm in return for a 70 percent stake  according to an e-mailed statement on Tuesday.",
        "date": "10202015",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "China's Yidao Yongche says LeTV unit agrees to invest $700 million in firm "
    },
    {
        "content": "WASHINGTON  Oct 7 U.S. antitrust enforcers on Wednesday formally dropped opposition to U.S. medical technology firm Steris Corp's plan to merge with British sterilization services provider Synergy Health Plc.",
        "date": "10072015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "U.S. formally ends fight with Steris over Synergy merger "
    },
    {
        "content": "* Proposal relating to merger with Synergy Health approved by requisite vote of co's shareholders at October 2 meeting",
        "date": "10022015",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Steris shareholders back proposal over Synergy deal "
    },
    {
        "content": "WASHINGTON  Oct 1 U.S. antitrust enforcers will not appeal a court ruling which said U.S. medical technology provider Steris Corp could proceed with a merger with British sterilization services provider Synergy Health Plc   a Federal Trade Commission spokesman said on Thursday.",
        "date": "10012015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "U.S. says it will not fight Steris loss in district court "
    },
    {
        "content": "* Steris corporation to proceed with combination with synergy health",
        "date": "09252015",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Synergy says Steris deal to proceed as FTC stop request denied "
    },
    {
        "content": "WASHINGTON  Oct 1 U.S. antitrust enforcers will not appeal a court ruling that said U.S. medical technology provider Steris Corp could proceed with a merger with British sterilization services provider Synergy Health Plc   a Federal Trade Commission spokesman said on Thursday.",
        "date": "10012015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "UPDATE 1-U.S. says it will not fight Steris loss in district court "
    },
    {
        "content": "WASHINGTON A federal court in Ohio refused on Thursday to stop a $1.9 billion purchase by U.S. medical technology provider Steris Corp of British sterilization services provider Synergy Health Plc  despite the objections of U.S. antitrust enforcers.",
        "date": "09242015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "U.S. court denies FTC request to stop Steris-Synergy merger "
    },
    {
        "content": "WASHINGTON  Sept 24 A federal court in Ohio refused on Thursday to stop a $1.9 billion purchase by U.S. medical technology provider Steris Corp of British sterilization services provider Synergy Health Plc  despite the objections of U.S. antitrust enforcers.",
        "date": "09242015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "UPDATE 2-U.S. court denies FTC request to stop Steris-Synergy merger "
    },
    {
        "content": "WASHINGTON  Sept 24 A federal court in Ohio refused on Thursday to stop a $1.9 billion merger of medical technology provider Steris Corp and British sterilization services provider Synergy Health Plc  despite the objections of U.S. antitrust enforcers.",
        "date": "09242015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "Court denies U.S. request to stop merger of Steris  Synergy Health "
    },
    {
        "content": "** Sterilization services provider Synergy Health up 2.8 pct & top FTSE-250 gainer after N+1 Singer raises TP to \"buy\" from \"hold\" saying share price looks compelling",
        "date": "06122015",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BUZZ-Synergy Health: top midcap gainer on brokerage upgrade "
    },
    {
        "content": "* Further postpone court meeting which was intended to be convened for 10.00 am on 11 June 2015 and general meeting which was intended to be convened for 10.10 am on 11 June 2015",
        "date": "06102015",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Synergy Health says Steris and co agree to extend long-stop date for deal "
    },
    {
        "content": "A new court filing on Monday shed more light on why the Federal Trade Commission decided to challenge Steris Corp's $1.9 billion bid for the UK's Synergy Health PLC.",
        "date": "06052015",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "Synergy's plans to fight Steris prompted FTC merger challenge "
    },
    {
        "content": "May 29 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "05292015",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON The U.S. Federal Trade Commission filed a lawsuit on Friday aimed at stopping the $1.9 billion merger of medical technology provider Steris Corp and British sterilization services provider Synergy Health Plc   according to the agency  which enforces antitrust law.",
        "date": "05292015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "U.S. sues to block merger of Steris Corp  Synergy Health "
    },
    {
        "content": "WASHINGTON  May 29 The U.S. Federal Trade Commission filed a lawsuit on Friday aimed at stopping the $1.9 billion merger of medical technology provider Steris Corp  and British sterilization services provider Synergy Health Plc  according to the agency  which enforces antitrust law.",
        "date": "05292015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "UPDATE 1-U.S. sues to block merger of Steris Corp  Synergy Health "
    },
    {
        "content": "WASHINGTON  May 29 The U.S. Federal Trade Commission  which enforces antitrust law  filed a lawsuit on Friday aimed at stopping the $1.9 billion merger of Steris Corp  and Synergy Health  the agency said.",
        "date": "05292015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "U.S. sues to stop planned merger of Steris Corp  Synergy Health "
    },
    {
        "content": "May 29 Sterilisation services provider Synergy Health Plc and U.S. medical tech company Steris Corp  said they would contest the U.S. Federal Trade Commission's attempt to block Steris's acquisition of the British company.",
        "date": "05292015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "UPDATE 2-Synergy Health  Steris to contest US FTC decision to block deal "
    },
    {
        "content": "British sterilization services provider Synergy Health Plc   which is in the process of being acquired by U.S. medical tech company Steris Corp   said the two companies would contest the U.S. Federal Trade Commission's attempt to block the proposed deal.",
        "date": "05292015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "Synergy Health  Steris to contest FTC decision to block deal "
    },
    {
        "content": "May 29 British sterilisation services provider Synergy Health Plc  which is in the process of being acquired by U.S. medical tech company Steris Corp  said the two companies would contest the U.S. Federal Trade Commission's attempt to block the proposed deal.",
        "date": "05292015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "Synergy Health  Steris to contest US FTC decision to block deal "
    },
    {
        "content": "* Steris and Synergy welcome a full judicial review of competitive effects of combination",
        "date": "05292015",
        "name": "STERIS plc",
        "news_type": "normal",
        "symbol": "STE",
        "title": "BRIEF-Synergy Health says FTC intends to seek to block Steris deal "
    },
    {
        "content": "* Synergy intends to reschedule meetings of its shareholders to vote on proposed combination with Steris  by adjourning meetings currently scheduled for May 12 to June 11",
        "date": "04302015",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-Synergy Health  Steris to reschedule shareholder meetings "
    },
    {
        "content": "* Steris and company have each received a request for additional information and documentary material",
        "date": "01122015",
        "name": "STERIS plc",
        "news_type": "topStory",
        "symbol": "STE",
        "title": "BRIEF-FTC requests additional details ahead of Synergy Health  Steris merger "
    }
]