[
    {
        "content": "U.S. regional lender SunTrust Banks Inc's  profit rose 12 percent in the third quarter  as interest rate hikes by the Federal Reserve drove higher net interest income.",
        "date": "10202017",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "SunTrust Banks' profit rises 12 percent on higher interest rates "
    },
    {
        "content": "Oct 20 U.S. regional lender SunTrust Banks Inc's profit rose 12 percent in the third quarter  as interest rate hikes by the Federal Reserve drove higher net interest income.",
        "date": "10202017",
        "name": "SunTrust Banks Inc",
        "news_type": "normal",
        "symbol": "STI",
        "title": "UPDATE 1-SunTrust Banks' profit rises 12 pct on higher interest rates "
    },
    {
        "content": "Oct 20 U.S. regional lender SunTrust Banks Inc's profit rose 12 percent in the third quarter  as interest rate hikes by the Federal Reserve drove higher net interest income.",
        "date": "10202017",
        "name": "SunTrust Banks Inc",
        "news_type": "normal",
        "symbol": "STI",
        "title": "SunTrust Banks' profit rises 12 pct on higher interest rates "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 03 (Fitch) Fitch Ratings has affirmed SunTrust Banks Inc.'s (STI) long-term and short-term Issuer Default Ratings (IDRs) at 'A-/F1'  respectively. The Rating Outlook is Stable. The affirmation reflects its balanced and diverse business profile  generally improving trends in earnings  and still benign asset quality. A full list of rating actions is at the end of this rating action commentary. The rating action follows a ",
        "date": "10032017",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "Fitch Affirms SunTrust Banks  Inc. at 'A-/F1'; Outlook Stable "
    },
    {
        "content": "* SunTrust announces sale of Premium Assignment Corporation Source text for Eikon: Further company coverage:",
        "date": "09252017",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "BRIEF-SunTrust announces sale of Premium Assignment Corporation "
    },
    {
        "content": "WASHINGTON SunTrust Banks Inc  has agreed to pay more than $1.1 million to settle U.S. charges that its investment subsidiary had improperly collected avoidable fees from clients  the U.S. Securities and Exchange Commission said on Thursday.",
        "date": "09142017",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "SunTrust to pay more than $1.1 million to settle U.S. charges over investment fees "
    },
    {
        "content": "WASHINGTON  Sept 14 SunTrust Banks Inc has agreed to pay more than $1.1 million to settle U.S. charges that its investment subsidiary had improperly collected avoidable fees from clients  the U.S. Securities and Exchange Commission said on Thursday.",
        "date": "09142017",
        "name": "SunTrust Banks Inc",
        "news_type": "normal",
        "symbol": "STI",
        "title": "SunTrust to pay more than $1.1 mln to settle U.S. charges over investment fees "
    },
    {
        "content": "* SunTrust Banks - confident in ability to achieve 2019 goal of delivering a sub-60 pct efficiency ratio - Conf call",
        "date": "09122017",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "BRIEF-SunTrust says confident in ability to achieve 2019 goal of delivering sub-60 pct efficiency ratio - Conf Call "
    },
    {
        "content": "* ‍Quarterly dividend of $0.40 per share declared; previous quarterly dividend was $0.26 Source text for Eikon: Further company coverage:",
        "date": "08082017",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "BRIEF-Suntrust board approves increase in common stock dividend "
    },
    {
        "content": "Wells Fargo & Co will pay the U.S. government $108 million to settle a whistleblower lawsuit claiming it charged military veterans hidden fees to refinance their mortgages  and concealed the fees when applying for federal loan guarantees.",
        "date": "08042017",
        "name": "SunTrust Banks Inc",
        "news_type": "normal",
        "symbol": "STI",
        "title": "Wells Fargo to pay U.S. $108 mln over veterans' loans "
    },
    {
        "content": "Aug 4 Wells Fargo & Co will pay the U.S. government $108 million to settle a whistleblower lawsuit claiming it charged military veterans hidden fees to refinance their mortgages  and concealed the fees when applying for federal loan guarantees.",
        "date": "08042017",
        "name": "SunTrust Banks Inc",
        "news_type": "normal",
        "symbol": "STI",
        "title": "UPDATE 2-Wells Fargo to pay U.S. $108 mln over veterans' loans "
    },
    {
        "content": "* Suntrust to increase quarterly common stock dividend and share repurchase program",
        "date": "06282017",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "BRIEF-Suntrust to increase quarterly common stock dividend  share repurchase program "
    },
    {
        "content": "* SunTrust shareholders elect Agnes Bundy Scanlan to board of directors Source text for Eikon: Further company coverage:",
        "date": "04252017",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "BRIEF-SunTrust shareholders elect Agnes Bundy Scanlan to board "
    },
    {
        "content": "* Suntrust announces executive moves to build business momentum",
        "date": "02242017",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "BRIEF-SunTrust to merge mortgage segment with consumer banking & private wealth management "
    },
    {
        "content": "* Suntrust Banks Inc - financial terms of transaction were not disclosed",
        "date": "10202016",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "BRIEF-Suntrust Bank to acquire assets of Pillar Financial  LLC. "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 04 (Fitch) Fitch Ratings has affirmed SunTrust Banks Inc.'s.  (STI) ratings at 'A-/F1'. The Rating Outlook is Stable. The affirmation reflects  an improved earnings profile  good asset quality performance  and continual  enhancements to the company's balanced and diverse business mix.   The rating action follows a periodic review of the large regional banking group   which includes BB&T Corporation (BBT)  Capital One Fi",
        "date": "10042016",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "Fitch Affirms SunTrust Banks Inc. IDRs at 'A-/F1'; Outlook Stable "
    },
    {
        "content": "* Sets regular quarterly cash dividend of $0.24 per share  Source text for Eikon:  Further company coverage:",
        "date": "04262016",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "BRIEF-SunTrust Banks sets regular quarterly cash dividend of $0.24/share "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 05 (Fitch) Fitch Ratings has upgraded SunTrust Banks Inc.'s  (STI) ratings to 'A-' from 'BBB+'. The Rating Outlook has been revised to Stable  from Positive. The upgrade reflects an improved earnings profile that has  converged to peer averages  good asset quality performance  and continual  enhancements to the company's balanced and diverse business mix. The rating action follows a periodic review of the large regiona",
        "date": "10052015",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "Fitch Upgrades SunTrust Banks Inc. LT IDR to 'A-' Following Large Regional Bank Review "
    },
    {
        "content": "June 15 SunTrust Banks Inc said it appointed Kevin Blair as corporate treasurer  effective July 1.",
        "date": "06162015",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "CORRECTED-MOVES-SunTrust Banks names Kevin Blair Corporate Treasurer (June 15) "
    },
    {
        "content": "June 15 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06152015",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "MOVES-Barclays  BNY Mellon  ANZ  Gatehouse  Macquarie Securities "
    },
    {
        "content": "June 15 SunTrust Banks Inc said it appointed Kevin Blair as Corporate Treasurer  effective July 1.",
        "date": "06152015",
        "name": "SunTrust Banks Inc",
        "news_type": "normal",
        "symbol": "STI",
        "title": "MOVES-SunTrust Banks names Kevin Blair Corporate Treasurer "
    },
    {
        "content": "SunTrust Banks Inc  Apollo Global Management and Ares Management LP are considering offers for buying General Electric Co's unit that lends to private-equity firms in the United States  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04242015",
        "name": "SunTrust Banks Inc",
        "news_type": "topStory",
        "symbol": "STI",
        "title": "GE buyout-lending unit draws interest from SunTrust  Apollo  Ares: Bloomberg "
    },
    {
        "content": "April 24 SunTrust Banks Inc  Apollo Global Management and Ares Management LP are considering offers for buying General Electric Co's unit that lends to private-equity firms in the United States  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04242015",
        "name": "SunTrust Banks Inc",
        "news_type": "normal",
        "symbol": "STI",
        "title": "GE buyout-lending unit draws interest from SunTrust  Apollo  Ares - Bloomberg "
    },
    {
        "content": "Thomson Reuters April 24  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04242015",
        "name": "SunTrust Banks Inc",
        "news_type": "normal",
        "symbol": "STI",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    }
]